{
  "path": "/en/news/readouts/2022/10/25/prime-minister-justin-trudeau-meets-nunavut-premier-pj-akeeagok",
  "pageTitle": "Prime Minister Justin Trudeau meets with Nunavut Premier P.J. Akeeagok | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with Nunavut Premier P.J. Akeeagok to discuss shared priorities. The two leaders were joined by Nunavut Tunngavik Incorporated (NTI) President, Aluki Kotierk, and NTI Vice-President, James Eetoolook.</p>\n\n<p>The Prime Minister congratulated the Premier on the launch of Government of Nunavut and Nunavut Housing Corporation’s new Nunavut 3000 strategy,<em> Igluliuqatigiingniq</em>, which means<em> building houses together</em> in Inuktitut. The Prime Minister also acknowledged the extensive collaboration among the government and Inuit partners in Nunavut in the strategy’s development as a positive step in advancing progress on housing issues in the territory. The leaders discussed addressing housing needs in Nunavut as a key priority with important considerations for the health, well-being, and prosperity of Nunavummiut and their communities, particularly in terms of supporting job opportunities in the territory. The leaders agreed on the need for close cooperation across governments and with Inuit and other key partners to close the housing gap in Nunavut.</p>\n\n<p>The Prime Minister and Premier Akeeagok also discussed the collective work that the governments of Canada and Nunavut as well as NTI have undertaken toward a Nunavut Devolution Final Agreement. The leaders agreed that all involved must continue to collaborate to achieve a final agreement so that Nunavummiut will finally have full decision-making power over their lands and resources.</p>\n\n<p>The Prime Minister and Premier looked forward to continued collaboration in support of these and other priorities of importance to Nunavummiut.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/05/12/prime-minister-justin-trudeau-meets-nunavut-premier-pj-akeeagok\">Prime Minister Justin Trudeau meets with Nunavut Premier P.J. Akeeagok</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/21/inuit-crown-partnership-committee-endorses-historic-inuit-nunangat\">Inuit-Crown Partnership Committee endorses historic Inuit Nunangat Policy to better support Inuit self-determination</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2022/04/minister-vandal-announces-budget-2022-housing-investments-in-nunavut1.html\">Minister Vandal announces Budget 2022 housing investments in Nunavut</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Canada’s Arctic and Northern Policy Framework</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1352471770723/1537900871295\">Nunavut devolution</a></li>\n</ul></div>\n      "
}