{
  "path": "/en/news/statements/2022/04/07/g7-leaders-statement",
  "pageTitle": "G7 Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Leaders of the Group of Seven (G7), condemn in the strongest terms the appalling atrocities by Russian armed forces in Bucha and other Ukrainian towns. We continue to stand in full solidarity with Ukraine and the Ukrainian people.</p>\n\n<p>The murder of civilians and non-combatants is categorically prohibited under international humanitarian law. We support the UN Secretary General’s call for an independent investigation that leads to effective accountability for these atrocities. We underscore that those responsible for war crimes and violations of international humanitarian law, including the indiscriminate use of force or attacks intentionally targeting civilians, must be held accountable and brought to justice. We welcome and support the ongoing work to investigate and gather evidence on this, including by the Prosecutor of the International Criminal Court, the Independent investigation commission mandated by the UN Human Rights Council and the OSCE’s mission of experts.</p>\n\n<p>We will further raise the cost of this war for the architects of this aggression, that is Russian President Vladimir Putin and his accomplices, through coordinated action, continuing to act in unity as we apply economic and financial measures in reaction to the ongoing escalation of the war. As a matter of priority, we will immediately take the following actions, consistent with our respective legal processes:</p>\n\n<p>First, we consider new investment in the economy of the Russian Federation incompatible with our security interests and our objective to end this war. We are therefore banning new investment in key sectors of the Russian economy, including the energy sector. The unprecedented private sector exodus from Russia has already compounded the powerful effects of our collective sanctions. As long as the war continues, Russia will face a long descent into economic, financial, and technological isolation.</p>\n\n<p>Second, we will further extend trade export bans on advanced goods and specific services important to Russia’s security, state, and economy. We will also increase import restrictions on a range of Russia’s revenue raising exports.&nbsp; &nbsp;</p>\n\n<p>Third, we will continue to disconnect Russian banks from the global financial system. We have already significantly degraded Russia’s financial system by targeting the transactions involving central bank assets and a number of other financial institutions.</p>\n\n<p>Fourth, we will escalate pressure, including by imposing additional sanctions on state-owned entities that comprise the main drivers of Russia’s economy. President Putin’s regime will no longer be able to rely on these institutions as economic back-stops to stabilise its economy and pursue its objectives.</p>\n\n<p>Fifth, we will continue and elevate our campaign against the elites and their family members who support President Putin in his war effort and squander the resources of the Russian people. Consistent with our legal frameworks, we will impose sanctions on additional individuals and entities.</p>\n\n<p>Sixth, we will impose additional sanctions against Russia’s defence sector to undermine and erode the capabilities of the Russian military to wage war.</p>\n\n<p>Seventh, we will expedite our plan to reduce reliance on Russia for our energy, which include phasing out and banning Russian coal imports. We will also accelerate our work to reduce our dependency on Russian oil. As we do so, we will work together and with partners to ensure stable and sustainable global energy supplies, including by accelerating reduction of our overall reliance on fossil fuels and our transition to clean energy.</p>\n\n<p>We will intensify our collective implementation and enforcement of existing measures, including by strengthening our national enforcement authorities and working with our partners to prevent “sanctions busting” through evasion, circumvention and backfilling.&nbsp;</p>\n\n<p>President Putin’s war of aggression is causing global economic disruptions. Its impact on Ukraine’s internationally significant agriculture sector places global food security under severe strain, for which President Putin and his accomplices bear the full responsibility. We will continue to work with partners to actively address energy, food and other impacts of Russia’s action on third countries and our own people. In particular, we will address the consequences of the global crisis on food security through a joint G7 effort, in close cooperation with international bodies such as the World Food Programme, Multilateral Development Banks and International Financial Institutions and including through exploration of the Food and Agriculture Resilience Mission (FARM). Our sanctions packages are carefully targeted so as not to impede the delivery of humanitarian assistance or the operation of the global agricultural trade, utilising explicit exceptions as appropriate.</p>\n\n<p>We will continue to provide coordinated political, financial, material and humanitarian support to the Ukrainian people and Government both for for their immediate needs as well as with a view to the longer-term reconstruction of the country, including by exploring a Ukraine Solidarity Fund.</p>\n\n<p>&nbsp;</p></div>\n      "
}