{
  "path": "/en/news/itineraries/2018/05/03/itinerary-friday-may-4-2018",
  "pageTitle": "Itinerary for Friday, May 4, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><p><b>Toronto, Ontario</b></p><p><b>10:45 a.m.</b>&nbsp;The Prime Minister and the Prime Minister of Portugal, António Costa, will attend the Economic Club of Canada summit entitled “Canada-Portugal Economic Relations: Maximizing the Benefits of CETA.”</p><p>Ballroom<br>Marriott Eaton Downtown Centre Hotel<br>525 Bay Street</p><p><b>Notes for media:</b></p><ul><ul><li>Open coverage of remarks</li><li>Media are asked to arrive no later than 10 a.m. and to register in the Simcoe Room upon arrival</li></ul></ul><p><b>12:30 p.m.</b> The Prime Minister will host an official lunch for the Prime Minister of Portugal and deliver remarks.</p><p>The Carlu<br>444 Yonge Street</p><p><b>Notes for media:</b></p><ul><ul><li>Open coverage of remarks</li><li>Media are asked to arrive no later than 12 p.m. and to register upon arrival</li></ul></ul><p><b>Cambridge, Ontario</b></p><p><b>3:30 p.m.</b>&nbsp;The Prime Minister will make an announcement at the Toyota Motor Manufacturing Canada (TMMC) North Plant with the Premier of Ontario, Kathleen Wynne. A media availability will follow.</p><p>Plastics Shop<br>TMMC North Plant<br>1055 Fountain Street North</p><p><b>Notes for media:</b></p><ul><ul><li>Pooled photo opportunity in the stitching shop at 3:30 p.m.</li><li>Open coverage of announcement and media availability at 3:45&nbsp;p.m.</li><li>Media are asked to arrive no later than 2:15 p.m. and to register with&nbsp;Suzanne.Baal@toyota.com by 11 a.m. to ensure space on shuttle busses. Any networks wishing to send a satellite truck must also register.</li><li>Media are asked to follow signs on Fountain Street to gate 2, to park in the visitor’s parking lot, and proceed to the guard house (white building, blue roof at entrance). Media must check in with security.</li></ul></ul><p><b>Toronto, Ontario</b></p><p><b>6:45 p.m.</b>&nbsp;The Prime Minister and the Prime Minister of Portugal will attend a reception hosted by the Consulate General of Portugal in coordination with LiUNA Local 183.</p><p>Gerry Gallagher Hall<br>LiUNA Local 183<br>1263 Wilson Avenue, unit #200</p><p><b>Notes for media:</b></p><ul><ul><li>Open coverage of remarks</li><li>Media are asked to arrive no later than 6 p.m. and to register upon arrival</li></ul></ul></div>\n      "
}