{
  "path": "/en/news/news-releases/2018/09/19/president-republic-namibia-visit-canada",
  "pageTitle": "President of the Republic of Namibia to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that His Excellency Dr. Hage G. Geingob, President of the Republic of Namibia, will visit Canada from September 20 to 21, 2018.</p><p>During the visit, President Geingob will meet with Prime Minister Trudeau to discuss issues of mutual interest, including creating economic growth that benefits everyone, building a safer and more peaceful world, combatting climate change, and advancing gender equality and women’s empowerment.</p><p>In addition to meeting the Prime Minister, President Geingob will meet with Minister of International Trade Diversification Jim Carr, as well as attend a business roundtable and a ceremony at the Peacekeeping Monument.</p><h2>Quote</h2><blockquote><p>“Canada and Namibia enjoy a friendship rooted in shared values and a strong history of cooperation. I look forward to meeting with President Geingob to discuss ways our two countries can work together to fight climate change, make gender equality a reality, and create more opportunities for all our citizens.”<br>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p></blockquote><h2>Quick Facts</h2><ul><li>Diplomatic relations between Canada and Namibia were established in 1990, following the latter’s independence.</li><li>Canada strongly supported Namibia’s independence, providing military peacekeepers, police monitors, election supervisors, and technical experts.</li><li>Canada and Namibia have a history of collaboration on shared priorities and work together within the United Nations and the Commonwealth.</li><li>In 2017, two-way merchandise trade between Canada and Namibia totaled $96.6 million, consisting of $2.4 million in exports from Canada, and $94.2 million in imports from Namibia.</li><li>Canada provides international assistance to Namibia through multilateral and regional organizations, including the United Nations, the World Bank, the African Development Bank, and the African Union.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/southafrica-afriquedusud/bilateral_relations_bilaterales/canada_namibia-namibie.aspx?lang=eng\">Canada-Namibia relations</a></li></ul></div>\n      "
}