{
  "path": "/en/news/statements/2018/09/21/statement-prime-minister-international-day-peace",
  "pageTitle": "Statement by the Prime Minister on International Day of Peace | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Peace:</p><p>“Peace is the foundation of a just and equal society. Today, on the <a href=\"http://www.un.org/en/events/peaceday/\">International Day of Peace</a>, we reflect on the progress made, and acknowledge the work yet to be done to achieve a more inclusive, peaceful, prosperous, and secure world for everyone.</p><p>“This year’s theme, ‘The Right to Peace – The Universal Declaration of Human Rights at 70,’ stresses the importance of recognizing human rights as the building blocks of freedom, justice, and peace in the world. We have come a long way since the Declaration was adopted by the United Nations in 1948, but much more needs to be done so everyone is truly free and equal.</p><p>“The Government of Canada remains firm in its commitment to protect and promote human rights. We stand with brave voices around the world who call for progress and push for these fundamental rights. At home, we are working hard to build a country where all Canadians feel free and safe to be themselves, and have the opportunity to go as far as their aspirations will take them.</p><p>“Last year, Canada announced new commitments to support United Nations peace operations around the world. These commitments will help provide the UN with reliable access to military and police resources in conflict areas, empower women in all aspects of peace and security, and protect children used as weapons of war.</p><p>“Canada has also put building a more peaceful and secure world at the centre of its G7&nbsp;Presidency. When leaders met during the G7 Summit, we focused on finding solutions that leave no one behind, and set the international agenda on peace and security. We committed to work more effectively together to respond to threats that attempt to undermine our democracies, sharing information and analysis, and improving online safety and security. As we tackle the challenges we face today, these commitments and others from the Summit will help make our countries safer.</p><p>“As we mark the International Day of Peace, and celebrate the seventieth anniversary of the Universal Declaration of Human Rights, I encourage Canadians to reflect on how we can all stand up for human rights, and build a better country and more peaceful world.”</p></div>\n      "
}