{
  "path": "/en/news/statements/2023/01/29/statement-prime-minister-justin-trudeau-on-death-hazel-mccallion",
  "pageTitle": "Statement by the Prime Minister on the death of Hazel McCallion | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Hazel McCallion:</p>\n\n<p>“Today, I join Ontarians and Canadians in mourning the passing of Hazel McCallion, the former long-serving mayor of Mississauga.</p>\n\n<p>“My dear friend Hazel was an extraordinary woman who wore many hats: a businessperson, an athlete, a politician, and one of Canada's – and the world’s – longest-serving mayors. Nicknamed ‘Hurricane Hazel’ for her bold political style, she was unstoppable.</p>\n\n<p>“‘I want to assure you that the people will come first during my term’ she told a cheering crowd when she won her first term as mayor almost 45 years ago. And that was how she served: by putting people first. She inspired countless others, including myself, in her decades of tireless and selfless service. I will miss her as a friend, and I’ll always cherish the conversations we had, and the wisdom she shared over the years.</p>\n\n<p>“Hazel McCallion led the transformation of Mississauga from a bedroom community to the sixth largest city in Canada under her guidance as mayor from 1978 to 2014. She believed in the growth of her community and its potential to become a city where people could both live and work, and led the charge to do just that. Through her leadership, the city was known for its strong economy, thriving multiculturalism, and excellent public services.</p>\n\n<p>“After serving as mayor for 36 years, Hazel McCallion was appointed Chancellor of&nbsp;Sheridan College&nbsp;and special advisor at&nbsp;the University of Toronto&nbsp;Mississauga. She also served as the chair of the World Health Organization’s Symposiums on Healthy Cities and was a strong advocate for ending discrimination toward seniors.</p>\n\n<p>“Hazel McCallion received many awards and honours for her accomplishments, including the Leadership in Public Service Award from the International Economic Development Council and the Key to the City of Mississauga. She was also the runner-up for the World Mayor Award and was appointed a Member of the Order of Canada in 2005.</p>\n\n<p>“On behalf of all Canadians, Sophie and I offer our condolences to Hazel's family, friends, and the people of Mississauga. We will remember her as a trailblazer whose career in politics and service to her community will remain an inspiration to all of us. But mostly, we will remember her as a dear friend.”</p></div>\n      "
}