{
  "path": "/en/news/news-releases/2022/10/21/freezing-market-handguns",
  "pageTitle": "Freezing the market on handguns | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Fewer guns mean safer communities. That’s why the Government of Canada is implementing some of the strongest gun control measures in a generation. Handguns are the weapon of choice in most firearm-related crimes, which is why limiting the number of handguns is a critical part of our plan to protect Canadians from gun violence.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the national freeze on the sale, purchase, and transfer of handguns comes into effect. From now on, people cannot buy, sell, or transfer handguns within Canada, and they cannot bring newly acquired handguns into the country.</p>\n\n<p>A national handgun freeze was first announced alongside <a href=\"https://www.parl.ca/legisinfo/en/bill/44-1/c-21\">Bill C-21</a>, the strongest gun control measures in over 40 years, in May&nbsp;2022. While the bill continues to be debated in Parliament, we are taking immediate action through regulations to keep Canadians safe.</p>\n\n<p>The national handgun freeze is part of the government’s comprehensive plan to tackle gun violence. We have already banned over 1,500 types of assault-style firearms and have strengthened our gun control laws to expand background checks. Bill C-21 proposes further measures to keep guns out of the wrong hands like revoking the firearms licences of those involved in acts of domestic violence or criminal harassment, continuing to fight gun smuggling and trafficking, and providing law enforcement more tools to investigate firearms crimes.</p>\n\n<p>One life taken by gun violence is one too many. We will continue to work with provinces, territories, Indigenous communities, and municipalities to keep Canadians safe. We will continue to do whatever it takes to keep guns out of our communities and build a safer country, for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians have the right to feel safe in their homes, in their schools, and in their places of worship. With handgun violence increasing across Canada, it is our duty to take urgent action to remove these deadly weapons from our communities. Today, we’re keeping more guns out of our communities, and keeping our kids safe.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is taking Canada’s most significant action on gun violence in a generation. We made a commitment to Canadians that we would act – and we are. The national freeze will tackle the alarming role of handguns in crime, gender-based violence, and more. We are using all tools at our disposal to fight gun violence and will not rest until all Canadians feel safe in their communities.”</p>\n\n<footer class=\"default\">The Hon. Marco E. L. Mendicino, Minister of Public Safety</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Handguns were used in 59 per cent of violent crime involving firearms between 2009 and 2020, and there are 70 per cent more handguns in Canada today than in 2010.</li>\n\t<li>There were over 3,500 reported thefts of firearms in 2018.</li>\n\t<li>One in three women and girls killed by an abuser is murdered with a gun.</li>\n\t<li>Applications submitted before October 21, 2022, to buy, sell, or transfer a handgun within Canada will continue to be processed.</li>\n\t<li>Limited exemptions to the national handgun freeze will apply. For example, high-performance sports shooting athletes and those who carry handguns as part of their lawful profession will be exempted, as well as authorized businesses such as gunsmiths, the film industry, or museums, per their licence conditions.</li>\n\t<li>The temporary ban on the importation of handguns into Canada that took effect on August 19, 2022, remains in place.</li>\n\t<li>Under Canada’s temporary import ban, authorized businesses and individuals can only import handguns for personal use, sale, or transfer if the end use meets the exemptions and conditions listed above and set out in detail in the <a href=\"https://www.international.gc.ca/trade-commerce/controls-controles/notices-avis/1090.aspx?lang=eng\">Notice to Importers No.&nbsp;1090</a>.</li>\n\t<li>Since 2016, the Government of Canada has invested almost $1 billion to address gun violence and keep guns out of the hands of gangs and criminals, including supporting work to crack down on gun smuggling at our border.</li>\n\t<li>These investments are already making a difference. Last year, the Canadian Border Services Agency (CBSA) made a record number of gun seizures at the border.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx\">Firearms</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/2022-rgltns-tmp-en.aspx\">Regulations amending certain regulations made under the <em>Firearms Act</em></a></li>\n\t<li><a href=\"https://www150.statcan.gc.ca/n1/pub/85-002-x/2022001/article/00009-eng.htm\">Trends in firearm-related violent crime in Canada, 2009 to 2020</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/c21-en.aspx\">A comprehensive strategy to address gun violence and strengthen gun laws in Canada: BILL C-21, An <em>Act to amend certain Acts and to make certain consequential amendments (firearms)</em></a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/05/30/further-strengthening-our-gun-control-laws\">Further strengthening our gun control laws</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/08/temporary-ban-on-importation-of-handguns-into-canada-now-in-effect.html\">Temporary ban on importation of handguns into Canada now in effect</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/05/government-of-canada-implements-new-rules-to-better-regulate-non-restricted-firearms.html\">Government of Canada implements new rules to better regulate non-restricted firearms</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">Prime Minister announces ban on assault-style firearms</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/trnsprnc/brfng-mtrls/prlmntry-bndrs/20200621/043/index-en.aspx\">Government measures to reduce gun violence</a></li>\n</ul></div>\n      "
}