{
  "path": "/en/news/news-releases/2020/05/07/prime-minister-announces-agreements-boost-wages-essential-workers",
  "pageTitle": "Prime Minister announces agreements to boost wages for essential workers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>While many of us are being asked to stay home, millions of Canadians are being called on to go to work every day. These Canadians are providing us with essential services, so we can continue to keep our families safe and healthy. We are relying on them now more than ever, and that is why the Government of Canada is working with provinces and territories to provide them with a much-needed wage boost.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that all provinces and territories have confirmed, or are in the process of confirming, plans to cost share wage top-ups for their essential workers.</p>\n\n<p>The Government of Canada will provide up to $3 billion in support to increase the wages of low-income essential workers. Each province or territory will determine which workers would be eligible for support, and how much support they will receive.</p>\n\n<p>These measures are part of the Government of Canada’s comprehensive economic plan to help Canadians and businesses through this period of uncertainty. We will continue to monitor this evolving situation closely, and take additional actions as needed to protect our health and safety, and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Workers are risking their health to provide us with essential care and services, and we need to make sure that they are paid properly for the work they do every day. We’re stepping up, and working with the provinces and territories, to give a much-needed wage boost to Canadians who are helping keep our country and economy strong during this difficult time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s front line workers are dealing directly with the impact of the COVID-19 pandemic by taking care of Canadians in our hospitals and nursing homes. They deserve our support. This measure will help workers critical to the current COVID-19 response get the compensation they need.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has announced targeted new initiatives to support Canadians through the COVID-19 pandemic, such as:\n\t<ul>\n\t\t<li>Introducing the Canada Emergency Response Benefit, a taxable benefit of $2,000 every 4 weeks for up to 16 weeks to eligible workers who have lost their income due to COVID-19. The government also extended the eligibility of this benefit to individuals who earn up to $1,000 per month, as well as workers who have recently exhausted their EI regular benefits and are unable to find a job or return to work because of COVID-19.</li>\n\t\t<li>Providing families who receive the Canada Child Benefit (CCB) an extra $300 per child for the month of May.</li>\n\t\t<li>Providing a one-time special payment through the Goods and Services Tax credit for low- and modest-income families. The average additional benefit is close to $400 for single individuals and close to $600 for couples.</li>\n\t\t<li>Providing approximately $9 billion towards various measures, including the Canada Emergency Student Benefit, to support post-secondary students and recent graduates who are unable to secure employment in order to help them overcome the challenges brought on by the pandemic.</li>\n\t\t<li>Extending the maximum duration of the Work-Sharing program, from 38 weeks to 76 weeks, for workers who agree to reduce their normal working hours because of developments beyond the control of their employers.</li>\n\t\t<li>Allowing all taxpayers to defer, until after August 31, 2020, the payment of income tax amounts that become owing on or after March 18, and before September 2020.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n</ul></div>\n      "
}