{
  "path": "/en/news/news-releases/2021/06/02/prime-minister-attend-g7-leaders-summit-nato-summit-and-canada",
  "pageTitle": "Prime Minister to attend G7 Leaders’ Summit, NATO Summit, and Canada-European Union Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in the G7 Leaders’ Summit in Carbis Bay, United Kingdom from June 11 to 13, 2021. Following the Summit, he will attend the NATO Summit on June 14 followed by the Canada-European Union (EU) Summit in Brussels, Belgium.</p>\n\n<p>The G7 Leaders’ Summit, NATO Summit, and Canada-EU Summit are all crucial opportunities for the Government of Canada to work with our global partners to find real solutions to the challenges that Canadians and people around the world are facing. Together, we will end the COVID-19 pandemic, create new jobs, grow our middle class, fight climate change, and build a more resilient world for everyone.&nbsp;</p>\n\n<p>This year’s G7 Summit will focus on those key global priorities, as well as finding coordinated approaches to promoting international rules and human rights, democracy, and gender equality. In addition to G7 members, the United Kingdom has also invited leaders from Australia, India, South Africa and South Korea.&nbsp;</p>\n\n<p>At the NATO Summit, Prime Minister Trudeau will join other leaders to recommit to working together to address future trans-Atlantic security threats and challenges, and to strengthen shared security commitments that keep our people safe.</p>\n\n<p>During the Canada-EU Summit, the Prime Minister will meet with the President of the European Council, Charles Michel, and the President of the European Commission, Ursula von der Leyen, to discuss areas of further collaboration. Together, they will discuss ways to tackle climate change, fight COVID-19, and further our economic ties to build on the benefits of the Canada-European Union Economic and Trade Agreement (CETA), which has created jobs and growth for all Canadians and Europeans.</p>\n\n<p>When we work with our global partners to tackle the challenges of today and tomorrow, Canadians benefit. Together, we will finish the fight against COVID-19, and coordinate a recovery that creates jobs, grows the middle class, and builds a better future for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Now more than ever, world leaders need to come together to tackle the challenges of today and tomorrow. Canada will continue to work with our global partners to keep our people healthy, create jobs and opportunity, grow the middle class, fight climate change, and strengthen democratic values. Only together can we bring an end to this pandemic and build a future that works for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2><strong>Quick Facts</strong></h2>\n\n<ul>\n\t<li>The Prime Minister and the Canadian delegation traveling to the UK and Belgium will follow strict public health protocols and procedures during their visit, while in-transit, and when they arrive home.</li>\n\t<li>Leaders of the G7 have come together since the 1970s to discuss issues of domestic and global concern. This will be the first in person meeting of G7 leaders since 2019 and the fifth G7 Summit Prime Minister Trudeau will attend.</li>\n\t<li>The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom, the United States and the European Union.</li>\n\t<li>Canada last held the presidency of the G7 in 2018. The United Kingdom holds the presidency in 2021, and Germany will hold it in 2022.</li>\n\t<li>NATO is a cornerstone of Canada’s international security policy. It is the primary international forum in which to engage other nations on transatlantic defence and security.</li>\n\t<li>Canada and the EU’s Strategic Partnership Agreement deepens and broadens bilateral cooperation on a wide range of issues such as international peace and security, counter-terrorism, human rights and nuclear non-proliferation, clean energy and climate change, migration and peaceful pluralism, sustainable development, and innovation.</li>\n\t<li>CETA has been providing Canadians and Europeans with preferential market access since September 2017, and all economically significant parts of the agreement are in force.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.g7uk.org/\">G7 United Kingdom 2021 </a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a>&nbsp;</li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n</ul></div>\n      "
}