{
  "path": "/en/news/news-releases/2019/03/18/prime-minister-announces-former-deputy-prime-minister-anne-mclellan",
  "pageTitle": "Prime Minister announces former Deputy Prime Minister Anne McLellan as Special Advisor | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians expect and deserve to have faith in their institutions and the people who serve within them. The events of the last few weeks have raised important questions about the relationship between the federal government and the Minister of Justice and Attorney General of Canada.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the Honourable Anne McLellan will serve as a Special Advisor to examine these questions and provide independent recommendations to the Prime Minister by June 30, 2019.</p>\n\n<p>In particular, Ms. McLellan will assess the structure that has been in place since Confederation, of a single minister holding the positions of Minister of Justice and Attorney General of Canada. She will consider whether machinery of government or legislative changes may or may not be recommended.</p>\n\n<p>She will also analyze the operating policies and practices across the Cabinet, and the role of public servants and political staff in their interactions with the Minister of Justice and Attorney General of Canada.</p>\n\n<p>Ms. McLellan is one of few Canadians who served their entire parliamentary career as a cabinet minister. Most notably, she served as the Deputy Prime Minister and as the Minister of Justice and Attorney General of Canada, among other roles. Most recently, Ms. McLellan served as Chair of the federal Task Force on Cannabis Legalization and Regulation.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Earlier this month, I said our government would seek external expert opinions on questions about the dual role of the Minister of Justice and Attorney General of Canada. Former Deputy Prime Minister and Minister of Justice and Attorney General of Canada Anne McLellan will tackle these questions head-on. Canadians expect a government that is not only open and transparent, but continually challenging itself to raise the bar. Ms. McLellan’s work will be an important step toward that.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Recently questions have been raised about the joint roles of the Minister of Justice and Attorney General of Canada, and about the rules and norms which should govern the relationship between the Justice Minister and Attorney General, other Ministers, public servants, and political staff. I believe that it is timely and appropriate to examine these questions. I look forward to providing my advice to the Prime Minister.”</p>\n\n<footer class=\"default\">The Hon. Anne McLellan, P.C., O.C., A.O.E.</footer>\n</blockquote></div>\n      "
}