{
  "path": "/en/news/news-releases/2021/03/11/first-ministers-mark-first-anniversary-global-covid-19-pandemic",
  "pageTitle": "First Ministers mark the first anniversary of the global COVID-19 pandemic | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN\" xml:lang=\"EN\">Today marks one-year since the World Health Organization declared COVID-19 a global pandemic. Following a teleconference, First Ministers issued the following statement to recognize this anniversary:</span></span></span></p>\n\n<p><span><span><span lang=\"EN\" xml:lang=\"EN\">“First Ministers honoured Canadians and others around the world who lost their lives to the pandemic. They acknowledged the tremendous personal sacrifices Canadians have made to keep themselves and their neighbours safe. This pandemic has disrupted our lives and livelihoods, and it is thanks to this personal sacrifice that Canadians have been able to reduce the spread of the virus and its variants.</span></span></span></p>\n\n<p><span><span><span lang=\"EN\" xml:lang=\"EN\">“First Ministers expressed their deep appreciation for all health and other essential front line workers, who ensured Canadians had continued access to care, reliable supply chains, and support for their loved ones and our children. These workers are the heroes of the pandemic.</span></span></span></p>\n\n<p><span><span><span lang=\"EN\" xml:lang=\"EN\">“They also noted the unprecedented collaboration between both orders of government, including the largest immunization campaign in Canada’s history. First Ministers agreed to continue these and all other efforts necessary to end the pandemic. Through these efforts, and through the continued vigilance of Canadians in following public health measures, First Ministers are hopeful Canada is on the path to recovery. The past year has been difficult but better days are ahead.</span></span></span></p>\n\n<p><span><span><span lang=\"EN\" xml:lang=\"EN\">“First Ministers agreed to continue to work together to protect Canadians, end the pandemic, and promote recovery of our economy and our public health care systems to benefit all Canadians.”</span></span></span></p>\n\n<p><span><span><em><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Newfoundland and Labrador is operating in a caretaker period due to a provincial election.</span></em></span></span></p></div>\n      "
}