{
  "path": "/en/news/news-releases/2018/06/22/prime-minister-announces-appointment-new-chief-justice-newfoundland",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of Newfoundland and Labrador and new Associate Chief Justice of the Supreme Court of British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Deborah E. Fry, a judge of the Trial Division of the Supreme Court of Newfoundland and Labrador, as Chief Justice of the Court of Appeal of&nbsp;Newfoundland and Labrador. She replaces the Honourable J. Derek Green, who elected to become a supernumerary judge effective December 1, 2017, after more than 25 years of distinguished service as a judge.</p>\n\n<p>Prime Minister Trudeau also announced the appointment of the Honourable Heather J. Holmes, a judge of the Supreme Court of British Columbia, as Associate Chief Justice of the Supreme Court of British Columbia. She replaces the Honourable A.F. Cullen, who elected to become a supernumerary judge effective January 1, 2018, after almost 17 years of distinguished service as a judge.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I am pleased to announce the appointment of Deborah E. Fry as the new Chief Justice of Newfoundland and Labrador. With her extensive experience in public service, conflict resolution, and mediation, I know that she will be an incredible asset to the province’s Court of Appeal.”<br>\n<cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“I am pleased to announce the appointment of Heather J. Holmes as the new Associate Chief Justice of the Supreme Court of British Columbia. She is highly regarded for her expertise in criminal law, and brings with her a wealth of leadership experience gained over a 17-year judicial career.”<br>\n<cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n\t<li>The Court of Appeal of Newfoundland and Labrador has jurisdiction to hear appeals in criminal, civil and family law matters from the province’s trial courts, as well as designated boards and administrative tribunals.</li>\n\t<li>The Supreme Court of British Columbia is the province’s superior trial court. The Supreme Court of British Columbia can hear any type of case, civil or criminal. It hears most appeals from the Provincial Court in civil and criminal cases and appeals from arbitrations. A party may appeal a decision of the Supreme Court to the Court of Appeal.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2018/06/22/honourable-deborah-e-fry\">The Honourable Deborah E. Fry</a></li>\n\t<li><a href=\"/en/news/backgrounders/2018/06/22/honourable-heather-j-holmes\">The Honourable Heather J. Holmes</a></li>\n</ul></div>\n      "
}