{
  "path": "/en/news/statements/2022/01/08/statement-prime-minister-national-day-remembrance-victims-air-disasters",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Air Disasters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Air Disasters:</p>\n\n<p>“Today, on the second National Day of Remembrance for Victims of Air Disasters, I join Canadians in paying tribute to those who lost their lives to aviation disasters, both at home and abroad. We stand in solidarity with their families and loved ones who continue to live with a profound sense of loss and suffering.</p>\n\n<p>“Canada has been scarred by the devastating toll of aviation tragedies. Two years ago today, Iran shot down Ukraine International Airlines Flight 752 (PS752), tragically taking the lives of all 176 innocent people on board, including 55 Canadian citizens, 30&nbsp;permanent residents, and many others with ties to Canada. The year before, Ethiopian Airlines Flight 302 (ET302) crashed on its way to Nairobi, Kenya, claiming the lives of 157 people, including 18 Canadians and many others with ties to Canada. In 1985, 280 Canadians lost their lives in the terrorist bombing of Air India Flight 182.</p>\n\n<p>“Recognizing the pain and hardship that air disasters bring, the Government of Canada continues to work with its international partners to improve the safety of aviation around the world. This includes our ongoing work to advance the <a href=\"https://tc.canada.ca/en/initiatives/safer-skies-initiative\">Safer Skies Initiative</a>, which brings together countries, international organizations, and industry partners to increase aviation security over conflict zones through best practices and information sharing, the review of global standards, and open dialogue.</p>\n\n<p>“The government places the victims’ families and loved ones – those who matter the most – at the heart of its response, and is committed to ensuring they are supported. That is why we continue to consult with them on meaningful commemoration initiatives. We have launched a <a href=\"https://pch.survey-sondage.ca/f/s.aspx?s=FDE0F914-8368-4DED-9D92-C9A81B975C76&amp;lang=EN\">public consultation</a> on a physical tribute to remember those who have lost their lives in air disasters. We are also working with our partners at the International Civil Aviation Organization (ICAO) to help enhance air accident investigations. To date, Canada has secured the support of 55 ICAO member states to review the investigation framework in order to make it more credible, transparent, and impartial. We will continue to work with our international partners to hold Iran accountable for the illegal downing of PS752. We will keep taking meaningful steps to bring transparency, accountability, and justice for the victims of air travel tragedies and their families.</p>\n\n<p>“Today, I invite Canadians to join me in remembering all victims of air travel tragedies and to keep them in our thoughts and hearts. Canada will continue to work with partners across the country and around the world to improve the safety and security of air travel for everyone and help prevent these tragedies from ever happening again.”</p></div>\n      "
}