{
  "path": "/en/news/readouts/2022/07/28/prime-minister-justin-trudeau-meets-his-holiness-pope-francis",
  "pageTitle": "Prime Minister Justin Trudeau meets with His Holiness Pope Francis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, a National Residential School Crisis Line offers emotional support and crisis referral services for residential school Survivors and their families. Call the toll-free Crisis Line at 1-866-925-4419. This service is available 24&nbsp;hours a day, 7&nbsp;days a week. The Hope for Wellness Help Line also offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at&nbsp;</em><a href=\"https://www.hopeforwellness.ca/\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>Yesterday, Prime Minister Justin Trudeau met with His Holiness Pope Francis and the Secretary of State of the Holy See, Cardinal Pietro Parolin, at the Citadelle of Quebec.</p>\n\n<p>Prime Minister Trudeau thanked Pope Francis for visiting Canada to engage with Indigenous Peoples on their ancestral lands, acknowledge the truths about the residential school system, and recognize its painful legacy for First Nations, Inuit, and Métis peoples in Canada.</p>\n\n<p>Following the personal apology Pope Francis delivered to Survivors, their families, and communities on Monday, in Maskwacîs, Alberta, the Prime Minister, Pope Francis, and Cardinal Parolin discussed the importance of the Roman Catholic Church’s continued meaningful engagement with First Nations, Inuit, and Métis in advancing healing and reconciliation. They also discussed the need for the Church to take concrete action to repatriate Indigenous artefacts, provide access to residential schools documents, address the Doctrine of Discovery, and ensure justice for Survivors, including for the Rivoire case. The Prime Minister underlined the Government of Canada’s ongoing commitment to chart a new and better path forward with Indigenous Peoples and everyone in Canada.</p>\n\n<p>Prime Minister Trudeau and Pope Francis also discussed unprecedented global challenges, including peace and security in Ukraine and the global impacts of food insecurity, in particular for the world’s most vulnerable. The Prime Minister and the Secretary of State also exchanged views on issues of mass migration and climate change, and looked forward to further strengthening relations between Canada and the Holy See.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/holy_see-saint-siege/index.aspx?lang=eng\">Canada and the Holy See</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/05/13/statement-prime-minister-welcoming-his-holiness-pope-francis-upcoming\">Statement by the Prime Minister welcoming His Holiness Pope Francis’ upcoming visit to Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/07/25/statement-prime-minister-personal-apology-delivered-his-holiness-pope\">Statement by the Prime Minister on the personal apology delivered by His Holiness Pope Francis to Survivors of the residential school system in Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/04/01/statement-prime-minister-apology-his-holiness-pope-francis-regarding\">Statement by the Prime Minister on the apology from His Holiness Pope Francis regarding the residential school system in Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.papalvisit.ca/\">Pope Francis in Canada</a></li>\n</ul></div>\n      "
}