{
  "path": "/en/news/statements/2018/05/03/statement-prime-minister-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Press Freedom Day:</p><p>“Today, on <a href=\"http://www.un.org/en/events/pressfreedomday/\">World Press Freedom Day</a>, we celebrate the important work journalists do around the world to promote and protect democracy. We also take a hard look at the current state of press freedom, and remember those who have lost their lives in defence of facts, uncovering truth and shining light on stories that would otherwise not be told.</p><p>“This year’s theme ‘Keeping Power in Check: Media, Justice, and the Rule of Law,’ highlights the importance of having an open and transparent environment – safeguarded by an independent judiciary – that protects freedom of the press. It also underlines the role that media play as champions of accountability and the rule of law.</p><p>“While in Canada we recognize freedom of the press as a fundamental freedom, many journalists working in other areas around the world face threats and dangers in their mission to inform the public. The arrest of two Reuters journalists, Wa Lone and Kyaw Soe Oo, in Myanmar last December is a vivid reminder of the ongoing need to advocate for a strong and free press as the cornerstone of any healthy democracy.</p><p>“Canada will always defend journalistic freedom and stand against any violence, intimidation, censorship, and false arrests used to silence journalists. From international broadcasters that bring the world into our homes, to local newspapers that empower us to shape the communities we live in – we know that a free press helps build stronger and healthier societies.</p><p>“On behalf of Canadians, I thank all the journalists in this country and around the world who seek out truth, unravel fact from fiction, bring clarity and fairness to public debate, and encourage us to open ourselves to new perspectives.”</p></div>\n      "
}