{
  "path": "/en/news/news-releases/2020/05/25/canada-emergency-commercial-rent-assistance-now-open-applications",
  "pageTitle": "Canada Emergency Commercial Rent Assistance now open for applications | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian families and small businesses across the country are feeling the impacts of COVID-19. That’s why the Government of Canada is working with provinces and territories to protect jobs and businesses, and give property owners support so they can help small business tenants make it through these difficult times.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that applications are now being accepted for Canada Emergency Commercial Rent Assistance (CECRA) for small businesses.</p>\n\n<p>Over the course of the program, property owners will reduce rent by at least 75 per cent for the months of April and May (retroactive), and June, for their small business tenants. CECRA will cover 50 per cent of the rent, with the tenant paying up to 25 per cent and the property owner forgiving at least 25 per cent.</p>\n\n<p>Applying for CECRA makes financial sense for property owners, as their success depends on the success of their tenants. If a tenant declares bankruptcy and is evicted, the property owner receives zero rental income and faces additional costs while they search for new tenants. With this program, property owners will continue to receive income, and small business tenants will receive the help they need to recover and come back after the pandemic.</p>\n\n<p>CECRA is another measure announced by the Government of Canada to provide important relief for small businesses experiencing financial hardship, and help keep Canadians on the payroll.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We all need to work together if we want our economy to come out strong after this pandemic. This program will help property owners, small businesses, workers, and our communities make it through this difficult time. Small businesses are the backbone of this country. We need to be there to support them when it matters most. ”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We understand the financial pressures on small business owners during these challenging times. That is why we have worked with provinces and territories to launch the new Canada Emergency Commercial Rent Assistance, which will provide rent relief to businesses in need and help property owners maintain rental income.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister</footer>\n</blockquote>\n\n<blockquote>\n<p>“Small businesses are an integral part of our economy, and are vital for families and communities across the country. Many businesses are facing economic hardship and uncertainty during the COVID-19 pandemic. We thank and commend the many property owners who have already taken action to help their tenants during this crisis. The opening of CECRA will provide forgivable loans to commercial property owners who in turn will lower or forgo the rent of tenants to keep them viable and ready to bounce back during the post-pandemic recovery.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Small business owners from coast to coast to coast have told us that one of their biggest worries during this pandemic has been being able to pay rent when they’ve had to temporarily close their doors. With our rent assistance applications now open, small business owners and entrepreneurs will be able to get the help they need, so they can focus on rehiring their team and preparing their businesses for re-opening.”</p>\n\n<footer class=\"default\">The Hon. Mary Ng, Minister of Small Business, Export Promotion and International Trade</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As of today, applications will be accepted through the <a href=\"https://www.cmhc-schl.gc.ca/en/finance-and-investing/covid19-cecra-small-business\">Canada Mortgage and Housing Corporation (CMHC)</a>&nbsp;website.</li>\n\t<li>The CMHC expects a large number of applications. To manage this volume, the intake of applications will be staggered based on the size and location of the commercial property. Property owners can submit their applications according to the following timetable:\n\t<ul>\n\t\t<li>Monday, May 25: Property owners who are located in Atlantic Canada, British Columbia, Alberta, and Quebec, with up to 10 tenants who are eligible for the program.</li>\n\t\t<li>Tuesday, May 26: Property owners who are located in Manitoba, Saskatchewan, Ontario, and the Territories, with up to 10 tenants who are eligible for the program.</li>\n\t\t<li>Wednesday, May 27: All other property owners in Manitoba, Saskatchewan, Ontario, and the Territories.</li>\n\t\t<li>Thursday, May 28: All other property owners in Atlantic Canada, British Columbia, Alberta, and Quebec.</li>\n\t\t<li>Friday, May 29: All property owners across Canada.</li>\n\t</ul>\n\t</li>\n\t<li>This program is for small business tenants that are paying less than $50,000 per month in gross rent, with annual consolidated revenues of less than $20 million, and that have experienced at least a 70 per cent drop in pre-COVID-19 revenues. It will also be available to non-profit and charitable organizations.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/finance-and-investing/covid19-cecra-small-business\">COVID–19: CECRA for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/20/prime-minister-announces-opening-program-protect-jobs-and-help\">Prime Minister announces opening of program to protect jobs and help businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n</ul></div>\n      "
}