{
  "path": "/en/news/statements/2023/02/26/statement-prime-minister-ukraines-day-resistance-occupation-autonomous",
  "pageTitle": "Statement by the Prime Minister on Ukraine’s Day of Resistance to the Occupation of the Autonomous Republic of Crimea and the City of Sevastopol | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ukraine’s Day of Resistance to the Occupation of the Autonomous Republic of Crimea and the City of Sevastopol:</p>\n\n<p>“Today, we mark Ukraine’s Day of Resistance and reaffirm our commitment to always stand with the Ukrainian people in their fight for a free and independent Ukraine.</p>\n\n<p>“Nine years ago, on February 26, 2014, an estimated 10,000 Ukrainians bravely rallied outside the Crimean Parliament building in Simferopol to protest Russia’s attempt to illegally annex Crimea from Ukraine. It was the largest gathering of its kind in Ukrainian history.</p>\n\n<p>“Now, one year since Russia’s full-scale invasion of Ukraine, we are yet again reminded of the bravery of people of Ukraine, who continue to make immense sacrifices in service of their country. We stand in solidarity with the missing and the displaced, and with the families of those who lost their lives. Every day, Ukrainians continue to show their courage and resilience as they defend themselves and their country from Russia’s brutal attacks on people, including its repeated human rights violations, and targeting of Ukraine’s critical infrastructure.</p>\n\n<p>“The international community’s support is critical to Ukraine’s success. Last year alone, Canada committed over $5 billion in assistance to Ukraine, including well over $1&nbsp;billion in military aid. We have imposed severe sanctions on key Russian individuals and entities and, together with our allies, we are supporting Ukrainian troops with training through Operation UNIFIER. And we are providing Ukraine with eight Leopard 2 main battle tanks and donating a National Advanced Surface-to-Air Missile System (NASAMS) – an air defence system that protects against drone, missile, and aircraft attack.</p>\n\n<p>“On Ukraine’s Day of Resistance, Canada reaffirms its commitment to Ukrainians and the principles they’re fighting for – democracy, justice, and freedom. We will continue to use every tool at our disposal to support Ukraine, for as long as it takes.</p>\n\n<p>“As Ukrainians continue to fight for the land that is rightfully theirs, today we reiterate that Crimea is, and will always be, Ukraine.”</p></div>\n      "
}