{
  "path": "/en/news/news-releases/2019/06/04/government-canada-makes-historic-investment-promote-health-and-rights",
  "pageTitle": "Government of Canada makes historic investment to promote the health and rights of women and girls around the world | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Advancing gender equality is key to strengthening the middle class, growing the economy, and building a better world. Canada is a champion for gender equality at home and abroad. Investing in women and girls’ health, and protecting their sexual and reproductive health rights, is a critical part of that.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will raise its funding to reach $1.4 billion annually, starting in 2023, to support women and girls’ health around the world. A ten-year commitment, this historic investment will support sexual and reproductive health rights and maternal, newborn, and child health – with $700 million of the annual investment dedicated to sexual and reproductive health rights, as of 2023. The Prime Minister made the announcement at the Women Deliver 2019 Conference, which Canada is hosting this week in Vancouver.</p>\n\n<p>This investment will advance the 2030 Agenda for Sustainable Development, promote sexual and reproductive health rights, and build on Canada’s leadership on global gender equality. The funding will help make sure women and girls around the world have access to the quality health services they need, including safe and legal abortion, and support women’s right to make their own decisions about their bodies. From providing comprehensive sexual education, to supporting maternal and neonatal care, the investment will advance the rights and health of women and girls around the world.</p>\n\n<p>Women Deliver is the world’s largest gathering on the health, rights, and well-being of women and girls. As this year’s host, Canada is continuing to take action on gender equality, and bringing together advocates from around the world. At the conference, the Prime Minister took part in the opening plenary and a panel discussion. The Prime Minister honoured the work and leadership of gender equality activists and advocates. He stressed the importance of governments stepping up to support feminist advocates on the frontlines, both in Canada and around the world.</p>\n\n<p>During the conference, the Prime Minister met with the President of Ghana, Nana Akufo-Addo, the President of Kenya, Uhuru Kenyatta, and the President of Ethiopia, Sahle-Work Zewde. He also met with local feminist advocates and organizations.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Advocates like those at Women Deliver are leaders in the fight for gender equality and women’s rights – and as a government, we have to stand with you as a partner and an ally. Today, our government is committing $1.4 billion annually to support women and girls’ health around the world. All women, no matter where they live, should have access to the safe, quality health care they need. By investing in sexual and reproductive health rights, and maternal, newborn, and child health, we can build a more just, equal, and prosperous world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is an historic investment in girls and women, which will pay dividends for years to come. Not only will this investment save and better lives, but it will create a ripple effect that will lift up individuals, communities, countries, and whole economies. I applaud Prime Minister Trudeau and Canada for this bold step and the commitment to a more gender equal world.\"</p>\n\n<footer class=\"default\">Katja Iversen, President/CEO of Women Deliver</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Held every three years, Women Deliver is the world’s largest gathering on the health, rights and well-being of women and girls. This year’s theme is “Power, Progress, Change.”</li>\n\t<li>This year’s conference brings together more than 8,000 world leaders, advocates, academics, and journalists from more than 160 countries. An additional 100,000 people will participate virtually.</li>\n\t<li>In March 2017, Canada announced $650 million over three years to address gaps in sexual and reproductive health and rights around the world.</li>\n\t<li>Every two minutes, a woman dies from complications from pregnancy or in childbirth. Most of these deaths are preventable.</li>\n\t<li>In developing countries, 214 million women have an unmet need for modern contraception.</li>\n\t<li>Each year, 25 million unsafe abortions take place due to stigma and restrictions to access of safe medical treatment.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/06/04/canada-strengthens-commitment-global-health-and-nutrition-beyond-2020\">Canada strengthens commitment to global health and nutrition beyond 2020</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/global_health-sante_mondiale/index.aspx?lang=eng\">Global health - Canada’s efforts in the developing world</a></li>\n\t<li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\" title=\"Canada and the 2030 Agenda for Sustainable Development\">Canada and the 2030 Agenda for Sustainable Development</a></li>\n\t<li><a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/women_deliver/index.aspx?lang=eng\">Canada’s role and participation in the Women Deliver 2019 Conference</a></li>\n</ul></div>\n      "
}