{
  "path": "/en/news/readouts/2022/11/14/prime-minister-justin-trudeau-meets-president-philippines-ferdinand-marcos",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of the Philippines Ferdinand Marcos Jr. | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of the Philippines, Ferdinand Marcos Jr., on the margins of the Association of Southeast Asian Nations (ASEAN) Summit.</p>\n\n<p>Prime Minister Trudeau congratulated President Marcos for his election earlier this year. The leaders welcomed the positive growth in the Canada-Philippines bilateral relationship, noting the potential to further deepen cooperation on shared priorities.</p>\n\n<p>The Prime Minister and the President discussed their work to protect the environment while creating economic growth. Prime Minister Trudeau recognized President Marcos for promoting renewable and low carbon solutions to fight climate change and reaffirmed Canada’s strong interest in partnering with the Philippines, and other developing countries, in advancing climate action.&nbsp;</p>\n\n<p>The two leaders discussed the vibrant people-to-people ties that bind Canada and the Philippines, with nearly one million Canadians of Filipino descent residing in Canada as well as a growing number of foreign students choosing to study in Canada. They talked about the countless ways in which Filipino-Canadians make Canada’s economy and society stronger, and President Marcos thanked the Prime Minister for embracing the contributions of Filipino-Canadians.</p>\n\n<p>They agreed that a Canada-ASEAN free trade agreement would help advance these objectives by promoting sustainable growth and creating good middle class jobs on both sides of the Pacific. They also discussed infrastructure, climate action, women’s empowerment, and pay equity.</p>\n\n<p>The Prime Minister raised the importance of standing up for human rights and press freedoms.</p>\n\n<p>The Prime Minister and the President looked forward to further discussions at the APEC Economic Leaders’ Meeting in Bangkok, Thailand.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/philippines/relations.aspx?lang=eng\">Canada-Philippines relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/asean-anase/fta-ale/negotiations-negociations.aspx?lang=eng\">Canada-ASEAN Free Trade Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n</ul></div>\n      "
}