{
  "path": "/en/news/statements/2023/04/17/statement-prime-minister-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom HaShoah, also known as Holocaust Remembrance Day:</p>\n\n<p>“As we mark the beginning of Yom HaShoah tonight, we join Jewish communities and others in Canada and around the world to mourn the more than six million Jews who were systematically murdered during the Holocaust.</p>\n\n<p>“Yom HaShoah also invites us to honour the courage and resilience of the survivors of the Shoah, many of whom chose Canada as their new home and have helped build the diverse and inclusive country we know today. In the decades since the end of the Second World War, survivors have reminded us time and time again of our collective responsibility to ensure the atrocities they endured are never forgotten and never repeated, including through Holocaust education, remembrance, and research.</p>\n\n<p>“Sadly, in recent years, Jewish communities in Canada and around the world have faced a disturbing rise in acts of antisemitism, including through the spread of online hate and disinformation. This is unacceptable. The Government of Canada is working to counter all forms of antisemitism, intolerance, and hatred. Last year, we provided new funding to advance Holocaust education and combat antisemitism across the country, including by supporting the creation of new Holocaust museums in Montréal and Toronto, as well as a new home for the Vancouver Holocaust Education Centre. We amended Canada’s <em>Criminal Code</em> to make it a crime to willfully promote antisemitism by condoning, denying, or downplaying the Holocaust. And later this year, the federal government plans to introduce a new National Action Plan on Combatting Hate, including an enhanced and expanded Communities at Risk: Security Infrastructure Program to help ensure everyone in Canada feels safe and respected.</p>\n\n<p>“Together with our international partners, we are also advancing global efforts in the fight against antisemitism. In 2021, the federal government pledged to promote Holocaust remembrance and combat antisemitism at the Malmö International Forum, and we have made significant progress in the years since. Last year, we doubled our annual contribution to the International Holocaust Remembrance Alliance, and we continue to promote the Alliance’s working definition of antisemitism as an important tool to help combat antisemitic attitudes and behaviours around the world, including Holocaust denial and distortion. And since 2020, Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism, the Honourable Irwin Cotler, has been a tireless champion of this important work, helping to ensure the Holocaust is never forgotten.</p>\n\n<p>“Today, as ceremonies are held in schools, synagogues, and community centres across the country, I invite all Canadians to pay tribute to the victims and survivors of the Holocaust, listen to and learn from their stories, and join us in vowing ‘never again.’ Together, we will continue to build a better, fairer, and more inclusive country.”</p></div>\n      "
}