{
  "path": "/en/news/statements/2022/10/22/statement-prime-minister-formation-new-government-italy",
  "pageTitle": "Statement by the Prime Minister on the formation of a new government in Italy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in Italy:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Giorgia Meloni on her appointment as Italy’s first woman Prime Minister following the election of September 25, 2022.</p>\n\n<p>“Canada and Italy enjoy a strong relationship, built on common interests and vibrant people-to-people ties. Today, Canada is home to approximately 1.6 million people of Italian heritage, one of the largest Italian diasporas in the world and a community that has contributed immeasurably to Canada’s diversity and prosperity. This year also marks the 75th anniversary of bilateral relations between Canada and Italy. Our two countries are partners on the world stage, including within the G7, G20, and North Atlantic Treaty Organization. Together, we have helped build an international system based on democratic values and the rule of law.</p>\n\n<p>“I look forward to working with Prime Minister Meloni to advancing the relationship between our two countries and make progress on issues that matter to Canadians and Italians alike. We will address trans-Atlantic security threats and challenges, work to support Ukraine and bring an end to Russia’s illegal and unjustifiable invasion, transition to clean energy, uphold human rights and democracy, and tackle global inequality. Together, we will also build a strong economic recovery by creating good jobs and opportunities for people on both sides of the Atlantic, including through the Canada-European Union Comprehensive Economic and Trade Agreement.</p>\n\n<p>“I thank outgoing Prime Minister Mario Draghi for his valuable partnership over the past two years. In collaborating on shared priorities from climate action to building an economy that works for everyone, as well as through his leadership of Italy’s G20 Presidency, Prime Minister Draghi was a friend to Canada. I wish him well in his future endeavours.”</p></div>\n      "
}