{
  "path": "/en/news/news-releases/2022/05/25/prime-minister-announces-change-leadership-public-service",
  "pageTitle": "The Prime Minister announces a change in the leadership of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Janice Charette as Clerk of the Privy Council and Secretary to the Cabinet, effective May 28, 2022. Ms. Charette has been serving as Interim Clerk of the Privy Council and Secretary to the Cabinet since March 9, 2021, and prior to this as High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland.</p>\n\n<p>The Prime Minister took the opportunity to congratulate Mr. Ian Shugart on his upcoming retirement from the Public Service, and to thank him for his outstanding leadership and exceptional contribution to Canada.</p>\n\n<p>The Prime Minister also thanked Ms. Janice Charette for continuing to serve in the role of Clerk of the Privy Council and Secretary to the Cabinet, and for her commitment to excellence, a hallmark of the Public Service.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I thank Ian Shugart for over 42 years of public service for Canadians.&nbsp;He served with distinction, including as a deputy minister in three different departments, in addition to Clerk of the Privy Council. I thank Ian for his support and professionalism, especially the leadership he provided supporting Canadians through the COVID-19 pandemic. I wish him continued good health and happiness.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am very pleased that Janice Charette has agreed to continue in this important role. Janice’s leadership and expertise as Head of the Public Service of Canada is vital to the delivery of our ambitious agenda to build a better future for the people of this country and to deliver results for Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/05/25/janice-charette\">Janice Charette</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/05/25/ian-shugart\">Ian Shugart</a></li>\n</ul></div>\n      "
}