{
  "path": "/en/news/statements/2023/02/26/statement-prime-minister-gordon-pinsent",
  "pageTitle": "Statement by the Prime Minister on the death of Gordon Pinsent | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Gordon Pinsent:</p>\n\n<p>“It was with profound sadness that I learned yesterday about the passing of Canadian icon Gordon Pinsent – one of the country’s most prolific and beloved actors.</p>\n\n<p>“Born in Grand Falls, N.L., Mr. Pinsent had a storied career, spanning over six decades, as an actor, writer, director and singer. I met him a number of times over the years and whether it was telling me great stories about my father or just sharing his love for Canada and Canadians, thoughtfulness and grace shone through all that he did. He will be fondly remembered for his many roles in Canadian shows and films, including Away From Her, The Rowdyman, The Forest Rangers, The Red Green Show, Due South, The Grand Seduction, Street Legal, Republic of Doyle, and as the voice of Babar the Elephant.</p>\n\n<p>“He won every major acting prize in the country, including two ACTRA awards, three Genie awards, five Gemini awards, and a Dora Mavor Moore award. Over the course of his career, Mr. Pinsent was named a Companion of the Order of Canada and a fellow of the Royal Society of Canada. He also received the Governor General's Performing Arts Award, the Earle Grey Award for lifetime achievement in television, and was honoured with a star on Canada’s Walk of Fame in 2007.</p>\n\n<p>“Mr. Pinsent loved his province and his country deeply. He entertained millions around the world and inspired us to say ‘yes’ to doing the things we love and to pursuing our dreams. On behalf of all Canadians, I extend my deepest condolences to his family, his friends, and his many fans.”</p></div>\n      "
}