{
  "path": "/en/news/news-releases/2021/06/30/prime-minister-announces-measures-advance-gender-equality-worldwide",
  "pageTitle": "Prime Minister announces measures to advance gender equality worldwide | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Women and girls have been disproportionately affected by the global COVID-19 pandemic, which threatens to roll back the hard-fought social and economic progress that they’ve made. The Government of Canada is committed to ensuring this doesn’t happen, both here at home and around the world, and recognizes that in order to truly build back better, we must create a Canada that works for everyone.</p>\n\n<p>Prime Minister Justin Trudeau today participated in the opening ceremony of the Generation Equality Forum and announced nearly $180 million to advance gender equality around the world. The Forum is a global gathering on the topic of gender equality, which has been convened by UN Women and co-hosted by the governments of Mexico and France.</p>\n\n<p>During the Forum, Prime Minister Trudeau underlined the concrete actions that Canada is taking to ensure women and girls can succeed in Canada and around the world. This includes a continued feminist response to the COVID-19 pandemic and recovering in a way that creates jobs and opportunity for women and girls, as well as efforts to prevent and eliminate gender-based violence, advance sexual and reproductive health and rights, and promote feminist movements, organizations, and voices.</p>\n\n<p>At home, the government is taking steps to remove barriers that prevent women from fully participating in the workforce and our economy. Access to affordable and high quality childcare is one of those barriers, which is why we recently announced a plan to establish a Canada-wide early learning and child care system. This investment of up to $30 billion sets a goal of on average $10 a day child care, and will increase women’s participation in the work force and economic growth, as well as create jobs and make life more affordable for Canadian families.</p>\n\n<p>To address inequalities in unpaid and paid care work internationally, the Prime Minister announced $100 million in new support for low- and middle-income countries that will help increase women’s ability to participate in the economy, in education, and in public life. Canada is one of the leading donors on care worldwide and, since the outset of the COVID-19 pandemic, Prime Minister Trudeau has continued to draw attention to the unequal burden on women and girls, and to the importance of taking early action to address inequalities in the care economy.</p>\n\n<p>The Prime Minister also announced nearly $80 million in new funding for women and girls through action coalitions at the Generation Equality Forum. This includes allocating $50 million from Canada’s $300 million pledge to the Global Partnership for Education, to address social and institutional barriers to girls’ education, and an additional $10 million in emergency support to the UNFPA-UNICEF Global Programme to End Child Marriage and promote the rights of girls. It also includes $18.45 million in funding for five targeted projects to address inequality and discrimination faced by LGBTQ2 communities, to support gender-lens investing, to strengthen civic education and democracy abroad, and advance gender equality in parliaments and legislatures.</p>\n\n<p>The Prime Minister also reaffirmed Canada’s continued support for feminist and equality-seeking movements in Canada, especially those with a focus on underrepresented groups, including Indigenous women, women with disabilities, members of LGBTQ2 communities, and newcomer, racialized, and migrant women. Through existing programs, we are providing funding to organizations that support more than six million Canadians every year, and that are helping women recover from the economic impacts of the pandemic and address systemic issues facing underrepresented and vulnerable women.</p>\n\n<p>Building on significant funding support for women’s rights and feminist organizations in developing countries, Canada will also support the co-creation of the Global Alliance for Sustainable Feminist Movements. This new partnership will create a new, dedicated space to address challenges that women and girls face towards achieving equality, including through funding and by enabling better planning among donors and feminist movements.&nbsp; Canada has been working in partnership with the Ford Foundation and the Equality Fund, as well as other governments, philanthropic entities and women’s organizations and funds, to co-design this alliance. &nbsp;The Prime Minister also announced that Canada will join the Global Alliance for Care, whose goal is to address the burden of care that hinders economic opportunities for women and to accelerate an economic recovery with equality in the wake of the COVID-19 pandemic.</p>\n\n<p>Canada is a leader and champion for gender equality, human rights, and the empowerment of women and girls at home and abroad. Advancing human rights and gender equality is not only fundamental to building back stronger and more resilient, it is also at the heart of Canada’s feminist international approach. By advancing gender equality, and empowering women and girls in all their diversity, we are helping to create a better, safer, and more inclusive world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The COVID-19 pandemic has disproportionately affected women, amplified longstanding inequalities they face, and threatens their hard-fought progress worldwide. The Generation Equality Forum is a critical opportunity for bold and collective action to align our global efforts, renew our momentum, and accelerate progress to achieve gender equality, so all women and girls can reach their full potential.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2020, Canada placed first in North America according to the World Economic Forum’s Global Gender Gap Report, having improved 11 places globally since 2015, compared to 153 countries.</li>\n\t<li>In 2017, Canada launched its Feminist International Assistance Policy and set ambitious targets for integrating and targeting gender equality in its international assistance efforts. As a result, in 2019-20, Canada allocated 97% of its bilateral international development assistance toward initiatives that either targeted or integrated gender equality and the empowerment of women and girls.</li>\n\t<li>Through Budget 2021, the Government of Canada is making investments to promote a fairer more equitable society. This includes:\n\t<ul>\n\t\t<li>Over $600 million to advance a new National Action Plan to End Gender-Based Violence;</li>\n\t\t<li>$2.2 billion, with $106.9 million ongoing, in support of continuing work with Indigenous partners, provinces and territories to implement a National Action Plan to address and end violence against Indigenous women, girls, and 2SLGBTQQIA+ people; and</li>\n\t\t<li>Investing $315.4 million and reallocating $250 million for shelters, transition housing, addressing urgent housing needs through the rapid creation of women-focused housing projects, and providing direct financial assistance to ensure that those facing gender-based violence can afford their rental payments.</li>\n\t</ul>\n\t</li>\n\t<li>Investing to improve the health, rights and well-being of women and children is a crucial part of Canada’s international assistance. Ensuring access to sexual and reproductive health and rights for women and girls is also at the centre of Canada’s approach. As a result of its investments in 2019-20,\n\t<ul>\n\t\t<li>more than 9.9 million women were reached by Canada-funded projects that help prevent, respond to and end sexual and gender-based violence, including child, early and forced marriage and/or female genital mutilation;</li>\n\t\t<li>more than 8.5 million women and girls received micronutrient supplementation, including iron and folic acid; and</li>\n\t\t<li>more than 2.3 million women received access to sexual and reproductive health services, including modern methods of contraception.</li>\n\t</ul>\n\t</li>\n\t<li>Starting in 2023, Canada will be providing $700 million per year in funding for sexual and reproductive health and rights to help ensure that women and girls around the world have access to the quality health services they need, including safe and legal abortion, and comprehensive sexual education.</li>\n\t<li>Canada remains engaged and committed to working with international partners to advance gender equality internationally. Gender equality was a guiding theme of Canada’s G7 Presidency, and it has continued for both France and the United Kingdom’s G7 presidencies. During its G7 Presidency, Canada created the Gender Equality Advisory Council (GEAC) and Canadian officials continue to work closely with G7 counterparts to share lessons from the GEAC and ensure continuity on recommendations between Presidencies.</li>\n\t<li>Through the Feminist Response and Recovery Fund, Canada is also providing $100 million to prevent the pandemic from rolling back progress or reversing the hard-won gains of women in Canada. These funds will be used to support organizations and those in greatest need, for projects that increase women and girls' participation in Canada’s economic, social, democratic and political life.</li>\n\t<li>The Government of Canada is also advancing women's economic empowerment in Canada through the first ever Women Entrepreneurship Strategy, a nearly $6 billion investment that aims to increase women-owned businesses’ access to the financing, talent, networks and expertise they need to start up, scale up and access new markets.</li>\n\t<li>The Honourable Karina Gould, Minister of International Development also represented Canada in the Forum as a co-leader of the Feminist Movements and Leadership Action Coalition and a commitment-maker to the Action Coalition on Bodily Autonomy and Sexual and Reproductive Health and Rights.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/new-canadian-investments-in-global-gender-equality.html\">Backgrounder: New Canadian investments in global gender equality</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget 2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1622233286270/1622233321912\">Federal Pathway to Address Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/fiap-paif.aspx?lang=eng\">Canada's Feminist International Assistance</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/task-force-women-economy.html\">Task Force on Women in the Economy</a></li>\n</ul></div>\n      "
}