{
  "path": "/en/news/readouts/2020/11/12/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the twenty-first call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>First Ministers discussed the recent and alarming increase in COVID-19 cases across the country, and the need for all orders of government to keep working together to keep people safe and to protect jobs. Premiers provided updates on the situations in their jurisdictions. Prime Minister Trudeau reiterated that responding to the pandemic remains the Government of Canada's top priority. The Prime Minister asked premiers to identify their specific needs to protect the health and safety of Canadians and bring the virus under control in their jurisdictions. He&nbsp;assured them that the federal government will continue to provide assistance for provinces and territories, and that the federal government will do whatever it takes for as long as it takes to keep Canadians safe and supported.</p>\n\n<p>First Ministers also discussed Canada-U.S. relations following the United States' presidential election in early November.&nbsp;First Ministers were joined by Canada’s Ambassador to the United States, Kirsten Hillman, who participated in this discussion.</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, in order to minimize the impacts of an increase in cases and support economic recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}