{
  "path": "/en/news/news-releases/2020/05/03/prime-minister-announces-virtual-care-and-mental-health-tools",
  "pageTitle": "Prime Minister announces virtual care and mental health tools for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For many Canadians, COVID-19 is having a major impact on their everyday lives, as they work to pay their bills, put food on the table, and take care of themselves and their families. That is why it is more important than ever that Canadians have access to the tools and resources they need to support their health and well-being.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of $240.5 million to develop, expand, and launch virtual care and mental health tools to support Canadians.</p>\n\n<p>Working with provinces, territories, and stakeholders, this investment will be used to create digital platforms and applications, improve access to virtual mental health supports, and expand capacity to deliver health care virtually, including projects to reach vulnerable Canadians. These supports will also help ease the burden on our health care system, as we continue to deal with COVID-19.&nbsp;This investment will:</p>\n\n<ul>\n\t<li>help Canadians safely engage with their regular health providers and specialist health services through telephone, text, or video-conferencing;</li>\n\t<li>support access to mental health supports and reliable health information in a safe and secure manner, which will reduce the pressure on our health system;</li>\n\t<li>help governments, public health officials, hospitals, and health care facilities make evidence-based decisions; and</li>\n\t<li>support federal, provincial, and territorial initiatives in collaboration with innovators, health stakeholders, and organizations like Canada Health Infoway, to expand virtual health services to Canadians.</li>\n</ul>\n\n<p>This investment will support <a href=\"https://ca.portal.gs/\">Wellness Together Canada</a>, an online portal that provides Canadians with free resources, tools, and professional support services to help with wellness and resilience, as well as mental health and substance use. It will also support a growing family of digital products that includes the Canada COVID-19 app, which helps people track their symptoms, receive the latest updates, and access trusted resources.</p>\n\n<p>With these additional supports, we are helping Canadians access the health resources they need, wherever and whenever they need them. The government will continue to focus on the health, safety, and well-being of all Canadians during these challenging times.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“While we all do our part to fight COVID-19, it can be a challenge to deal with everything that’s happening around us and to get the help and services we need to feel well. It’s important that we take care of ourselves and our families during these challenging times, and that’s why we’ve introduced more virtual health resources and mental health tools to further support Canadians through this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“These investments will help provide Canadians with virtual health care services that are safe and secure. As the COVID-19 pandemic continues to evolve, people in&nbsp;every community are&nbsp;struggling and we will continue to help them.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has a suite of digital tools to help support the physical and mental health and well-being of Canadians during COVID-19. These include:\n\t<ul>\n\t\t<li><a href=\"https://ca.portal.gs/\">Wellness Together Canada</a>, an online portal dedicated to mental wellness and substance use support. It connects Canadians to peer support workers, social workers, psychologists, and other professionals for confidential chat sessions or phone calls, and makes it easier to find credible information and help address mental health and substance use issues.</li>\n\t\t<li><a href=\"https://ca.thrive.health/covid19app/home\">Canada COVID-19</a>, a mobile app that features a symptom tracker, a self-assessment tool, trustworthy up-to-date information on COVID-19, as well as information on mental health and substance use support.</li>\n\t\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/subscription-form.html\">Get Updates on COVID-19</a>, a web-based email service that provides subscribers with critical information related to the pandemic. Subscribers receive emails directing them to important and authoritative content on the Government of Canada’s COVID-19 website.</li>\n\t</ul>\n\t</li>\n\t<li>On March 29, 2020, the Government of Canada announced $7.5 million in funding to Kids Help Phone to provide children and youth with mental health support and counselling services during this difficult time.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/mental-health.html\">Taking care of your mental health during the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/news/2020/04/government-of-canada-connects-canadians-with-mental-wellness-supports-during-covid-190.html\">Government of Canada connects Canadians with mental wellness supports during COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n</ul></div>\n      "
}