{
  "path": "/en/news/news-releases/2023/04/04/renewing-fleets-supporting-good-middle-class-jobs-quebec",
  "pageTitle": "Renewing Canada’s fleets and supporting good middle-class jobs in Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From keeping waters safe at home and abroad and responding to emergencies, to protecting the environment and supporting the flow of Canada’s economy, Canadians rely on the Canadian Coast Guard and the Royal Canadian Navy. That is why the Government of Canada is renewing our federal fleets, while revitalizing our shipbuilding and marine industry to create good middle-class jobs across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced Chantier Davie of Lévis, Quebec, will become the third strategic partner under the National Shipbuilding Strategy (NSS). This agreement between the company and the federal government marks the start of negotiations for contracts to support Canada’s future shipbuilding needs and create good jobs. This will include the construction of six program icebreakers and one polar icebreaker for the Canadian Coast Guard. These ships will play an essential role in the growth of Canada’s economy, supporting year-round marine trade, and will serve as essential platforms for search and rescue and environmental response operations.</p>\n\n<p>The agreement is consistent with the recently released <em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em>, which focuses on building a made-in-Canada clean economy in a free and stable democracy and supporting Canadian workers and manufacturers.</p>\n\n<p>Today’s announcement is an important step in the government’s ongoing efforts to ensure that Canada has the modern and reliable ships it needs, especially as we adapt to the continued growth of commercial shipping and the increasing impacts of climate change on our communities. We will continue to create opportunities for workers and businesses in Canada’s marine industry while ensuring the brave members of the Canadian Coast Guard and the Royal Canadian Navy can continue to carry out their important work in the years to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is bringing us one step closer to building the fleets for Canada’s future. Our strategic partnership with Chantier Davie will help ensure our Coast Guard is supported by modern, made-in-Canada vessels so it can continue to save lives, keep our waters secure, and protect the environment. This will also help strengthen Canada’s world-class marine industry and create good middle-class jobs, right here in Quebec.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<blockquote>\n<p>“The Government of Canada is happy to welcome Chantier Davie as the third strategic partner under the National Shipbuilding Strategy. This addition to the NSS will benefit workers in the Quebec region and provide the Canadian Coast Guard with the vessels it needs to do its important work.”</p>\n\n<footer class=\"default\">The Hon. Helena Jaczek, Minister of Public Services and Procurement</footer></blockquote>\n\n<blockquote>\n<p>“Today’s announcement is fantastic news for our shipbuilding industry. Through the National Shipbuilding Strategy, we are creating opportunities for workers and businesses across Canada – and ensuring that the Canadian Coast Guard and Royal Canadian Navy have the tools they need to do their jobs and protect our country. We will continue to make the necessary investments to deliver modern equipment to our people in uniform, all while creating good jobs for Canadians.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer></blockquote>\n\n<blockquote>\n<p>“Canadians in Eastern Quebec and Atlantic Canada, as well as tourists and businesses, rely on safe and efficient ferry services to support local communities and economies.&nbsp;As the third strategic partner under the National Shipbuilding Strategy, Chantier Davie is also building two new ferries for Transport Canada. The construction of these two ferries will create good jobs for Quebecers, support regional connectivity, and help us continue to build an economy that works for everyone.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer></blockquote>\n\n<blockquote>\n<p>“The National Shipbuilding Strategy and the Canadian Coast Guard have reached an important milestone with the addition of Chantier Davie as the third major shipbuilding partner under the NSS. The work Chantier Davie will complete over the coming years will increase the Arctic capability of the Canadian Coast Guard and guarantee that we have effective, modern vessels for this work. The partnership announced today will benefit Canadians from coast to coast to coast.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer></blockquote>\n\n<blockquote>\n<p>“The addition of Davie as a third shipyard strengthens the Canadian shipbuilding industry and will help generate more economic benefits across the country, including many small and medium-sized enterprises in Quebec. Today’s announcement is a testament to the expertise, know-how, and drive of workers at Chantier Davie.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer></blockquote>\n\n<blockquote>\n<p>“Since 2015, our government has supported workers at Chantier Davie by awarding more than $2&nbsp;billion in contracts to refurbish Canadian Coast Guard icebreakers and ships. The integration of Chantier Davie into the National Shipbuilding Strategy marks another milestone in this ongoing support and will generate historic investments in the Quebec City region. These investments will eventually create a world-class maritime supply chain right here in the Quebec City region.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer></blockquote>\n\n<blockquote>\n<p>“This historic agreement puts the ‘National’ in National Shipbuilding Strategy. The federal government deserves much credit. Together, we will bridge a strategic shipbuilding gap and create guaranteed capacity for future fleet renewal at Canada’s largest shipbuilder. It is an acknowledgement of everything Davie has achieved over the past decade, our expertise, and the quality of our Quebec-based workforce. We can now get to work delivering the icebreakers Canada urgently needs to meet its growing responsibilities as an international Arctic presence, while fulfilling its critical southern wintertime mission to keep our economy flowing. We also commend the Government of Quebec for supporting our journey to become one of the world’s most advanced shipbuilding facilities. The NSS will be a springboard to create an internationally competitive shipbuilding hub in Quebec. We will generate and showcase Quebec innovation and talent as we build cutting-edge ships, which are in high global demand.”</p>\n\n<footer class=\"default\">James Davies, President and CEO, Chantier Davie Canada Inc.</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>In May 2019, the Government of Canada <a href=\"https://pm.gc.ca/en/news/news-releases/2019/05/22/prime-minister-announces-renewal-canadian-coast-guard-fleet\">announced its intention to add a third Canadian shipyard</a> as a strategic partner under the National Shipbuilding Strategy (NSS). A competitive process to select the new shipyard <a href=\"https://www.canada.ca/en/public-services-procurement/news/2019/08/government-of-canada-announces-construction-of-new-icebreakers-for-canadian-coast-guard.html\">was launched</a> later that year.</li>\n\t<li>Today’s agreement is the result of a complex, multi-step qualification process. It included a third-party assessment of the shipyard’s infrastructure and submission, the evaluation of its formal proposal, and a due diligence process to ensure the shipyard is financially capable of performing the work and making any necessary upgrades to its infrastructure.</li>\n\t<li>Founded in Quebec in 1825, Chantier Davie is the oldest shipyard in Canada and a global leader in the delivery of specialist, mission-critical vessels to government and commercial customers. They are the third Canadian shipyard to reach a strategic partnership agreement with the Government of Canada under the NSS, after Irving Shipbuilding Inc. in Nova Scotia and Seaspan Shipyards in British Columbia in 2012.</li>\n\t<li>Chantier Davie has already played a critical role in supporting Canada’s fleets, receiving over $2.2&nbsp;billion in contracts since 2014 for various types of work on ships for the Canadian Coast Guard, the Royal Canadian Navy, and Transport Canada. This included acquiring and converting three medium interim icebreakers for the Canadian Coast Guard, refitting the CCGS Louis S. St‑Laurent, converting the MV Asterix to provide the Navy with an Interim Auxiliary Oiler Replenishment capability, and maintaining one of the Navy’s Halifax-class frigates. They are <a href=\"https://www.canada.ca/en/public-services-procurement/news/2019/05/canada-to-acquire-two-new-ferries-for-the-eastern-canada-ferry-services.html\">currently working</a> on the design and construction of two ferries for Transport Canada.</li>\n\t<li>Since 2012, the Government of Canada has awarded more than $21&nbsp;billion in shipbuilding-related contracts. Contracts awarded under the NSS are estimated to contribute nearly $2&nbsp;billion to Canada’s GDP annually on average, supporting thousands of good middle-class jobs every year.</li>\n\t<li>The Government of Canada’s NSS is a long-term, multi-billion-dollar program focused on renewing the Canadian Coast Guard and Royal Canadian Navy fleets to ensure Canada’s marine agencies have the modern ships they need to fulfill their missions, while revitalizing Canada’s marine industry, creating good middle-class jobs, and maximizing economic benefits across the country.</li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/a-made-in-canada-plan-affordable-energy-good-jobs-and-a-growing-clean-economy.html\">Budget&nbsp;2023 Backgrounder: A Made-in-Canada Plan: Affordable Energy, Good Jobs, and a Growing Clean Economy</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.tpsgc-pwgsc.gc.ca/app-acq/amd-dp/mer-sea/sncn-nss/index-eng.html\">National Shipbuilding Strategy</a></li>\n\t<li><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\"><em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em></a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/22/prime-minister-announces-renewal-canadian-coast-guard-fleet\">Prime Minister announces renewal of Canadian Coast Guard fleet</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-coast-guard/news/2021/05/government-of-canada-announces-polar-icebreakers-to-enhance-canadas-arctic-presence-and-provide-critical-services-to-canadians.html\">Government of Canada announces polar icebreakers to enhance Canada’s Arctic presence and provide critical services to Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-services-procurement/news/2022/06/government-of-canada-moves-to-next-stage-of-third-shipyard-selection-process-with-chantier-davie.html\">Government of Canada moves to next stage of third shipyard selection process with Chantier Davie</a></li>\n</ul></div>\n      "
}