{
  "path": "/en/news/statements/2020/09/20/statement-prime-minister-gender-equality-week",
  "pageTitle": "Statement by the Prime Minister on Gender Equality Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Gender Equality Week:</p>\n\n<p>“Today, we begin Canada’s <a href=\"https://cfc-swc.gc.ca/commemoration/gew-ses/index-en.html\">Gender Equality Week</a>. This week is an opportunity to celebrate the accomplishments we have made in advancing gender equality, and reflect on the work still needed to address the challenges faced by women and LGBTQ2 people in Canada.</p>\n\n<p>“This year’s theme – Because Of You – recognizes our role in the worldwide effort to provide everyone with an equal chance at success, regardless of their gender identity or gender expression. In particular, we mark the 25th anniversary of the Beijing Declaration and Platform for Action, which aims to prevent gender-based violence and accelerate progress on gender equality and women’s empowerment – including through education, reproductive rights, and health care.</p>\n\n<p>“Since the Beijing Declaration, Canada has made important progress to remove barriers to equality. In 2017, we added gender identity and gender expression as prohibited grounds of discrimination under the <em>Canadian Human Rights Act</em>. We built new protections for women, transgender, and gender-diverse Canadians into the <em>Criminal Code</em>. In the last few years, we have also taken steps to reduce the wage gap, increase the number of women in skilled trades and other under-represented fields, and support women entrepreneurs.</p>\n\n<p>“The Government of Canada also developed a <a href=\"https://cfc-swc.gc.ca/violence/strategy-strategie/index-en.html\">$200 million federal strategy</a> to help prevent and address gender-based violence, support survivors and their families, and create more responsive legal and justice systems. This year, recognizing the important role of LGBTQ2 organizations in creating a more inclusive Canada, we launched the first-ever open Call for Proposals to provide funding to support the capacity of these organizations across the country.</p>\n\n<p>“Over the last five years, the Government of Canada has made the safety and security of Indigenous women, girls, and LGBTQ2 people a priority. Together with Indigenous, provincial, and territorial partners, we are working to co-develop a National Action Plan that will address the ongoing national tragedy of missing and murdered Indigenous women and girls.</p>\n\n<p>“In recent months, the COVID-19 pandemic has amplified gender inequalities that already exist in our society, especially for those who also face discrimination or hardship because of their race, sexual orientation, or disability. In particular, for women and LGBTQ2 people experiencing violence, the impacts of the virus have made things more difficult than ever. That is why we invested <a href=\"https://www.canada.ca/en/employment-social-development/news/2020/04/canada-announces-support-to-those-experiencing-homelessness-and-women-fleeing-gender-based-violence-during-the-coronavirus-disease-covid-19-pandemic.html\">$40 million</a> in women’s shelters, sexual assault centres, and other organizations providing support and services for women and children escaping violence across the country. To help protect and support Indigenous women and girls experiencing and fleeing violence, we have also invested <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/29/prime-minister-announces-additional-funding-health-economic-and\">$44.8 million over five years</a> to build 12 new shelters, and <a href=\"https://www.canada.ca/en/employment-social-development/news/2020/04/canada-announces-support-to-those-experiencing-homelessness-and-women-fleeing-gender-based-violence-during-the-coronavirus-disease-covid-19-pandemic.html\">up to $10 million</a> for emergency shelters on reserves and in Yukon to support First Nations women and children. Everyone should have a place they can go to be safe from both violence and COVID 19, and our investments have supported nearly 1,000&nbsp;organizations delivering essential front line support.</p>\n\n<p>“As we recover from the global pandemic and safely restart our economy, we must remember that a fairer, more equal Canada is a better Canada. Gender equality benefits everyone, and leads to greater health, happiness, and prosperity. Together, we can make Canada a country where women, girls, and people of all gender identities and expressions can reach their full potential.”</p></div>\n      "
}