{
  "path": "/en/news/news-releases/2020/06/05/prime-minister-announces-supports-canadians-disabilities-address",
  "pageTitle": "Prime Minister announces supports for Canadians with disabilities to address challenges from COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We know Canadians living with disabilities are facing significant challenges during this difficult time, with some experiencing job insecurity and others seeing increased costs for personal support workers, medication, and medical supplies. As we work together to restart the economy, we must continue to protect health and safety, and ensure the right supports are in place for all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced support to help Canadians with disabilities deal with extra expenses during the pandemic.</p>\n\n<p>This support includes a special one-time, tax-free payment to individuals who are certificate holders of the <a href=\"https://www.canada.ca/en/revenue-agency/services/tax/individuals/segments/tax-credits-deductions-persons-disabilities/disability-tax-credit.html\">Disability Tax Credit</a> as of June 1, 2020, as follows:</p>\n\n<ul>\n\t<li>$600 for Canadians with a valid Disability Tax Credit certificate. &nbsp;</li>\n\t<li>$300 for Canadians with a valid Disability Tax Credit certificate and who are eligible for the Old Age Security (OAS) pension.</li>\n\t<li>$100 for Canadians with a valid Disability Tax Credit certificate and who are eligible for the OAS pension and the Guaranteed Income Supplement (GIS).</li>\n</ul>\n\n<p>Combined with the special payments of $300 for Canadians who are eligible for the OAS pension and the additional $200 for those eligible for the GIS, all seniors with a valid Disability Tax Credit certificate will receive a total of $600 in special payments. People who are eligible for this special payment will receive it automatically.</p>\n\n<p>The Government of Canada recognizes that people with disabilities are also at higher risk of job loss during economic downturns. To help Canadians with disabilities get and maintain good jobs so they can continue to support themselves and their families, the government will:</p>\n\n<ul>\n\t<li>Create a National Workplace Accessibility Stream through the Opportunities Fund for Persons with Disabilities. A new investment of $15 million in 2020-21 will provide community organizations with resources to improve workplace accessibility and access to jobs in response to COVID-19, including by helping employers set up accessible and effective work-from-home arrangements. This support will also cover expanding accessible online training opportunities and helping connect Canadians with disabilities working from home with employers.</li>\n\t<li>Invest $1.18 million in five new projects across the country through the Accessible Technology Program. With this funding, organizations will develop dynamic and affordable technology, such as accessible payment terminals for retailers and tools to make communication easier for Canadians with disabilities in the digital economy.</li>\n</ul>\n\n<p>As we mark <a href=\"https://www.canada.ca/en/employment-social-development/campaigns/national-accessability-week.html\">National AccessAbility Week</a>, we reaffirm our commitment to continue listening to and working in partnership with persons with disabilities to maintain their health, safety, and dignity as we address the wide-ranging impacts of COVID-19.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“To make it through this difficult time, we need to look out for one another. Canadians with disabilities are facing significant challenges because of COVID-19, as they work to access essential services and care, and provide for their families. With today’s announcement, we are stepping up to make sure they have the support they need to make it through this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know this pandemic has deeply affected the lives and health of all Canadians, and disproportionately affected Canadians with disabilities in particular. The cost to safely get groceries, medication, and other basic necessities has increased, while services like disability support workers and therapy may be unavailable because volunteer and subsidized services have declined. We have listened to the concerns of Canadians with disabilities and received advice from the COVID-19 Disability Advisory Group on how to best provide support during this difficult time. I am confident that the measures announced today will greatly benefit Canadians with disabilities across the country.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion <em>&nbsp;</em></footer>\n</blockquote>\n\n<blockquote>\n<p>“Working together empowers our companies, our economy, our people. We know now, more than ever, how important it is to be able to access the digital world. Through the Accessible Technology Program, we continue to open doors to endless possibilities, so that Canadians with disabilities can fully benefit from being connected. Thanks to our innovative entrepreneurs, we continue to increase accessibility and awareness of this importance.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The funding included in today’s announcement will benefit approximately 1.25&nbsp;million Canadians with disabilities who are facing additional expenses due to the COVID-19 pandemic.</li>\n\t<li>According to the 2017 Canadian Survey on Disability, 22 per cent of Canadians 15 years of age and over identify as having a disability. That rate increases as people age, with 37.8 per cent of Canadians over 65 and 47.4 per cent of Canadians over 75 identifying as having a disability.</li>\n\t<li>Among working-age Canadians with disabilities, more than 1.5 million, or 41&nbsp;per&nbsp;cent, are unemployed or out of the labour market entirely. Among those with severe disabilities, this rate increases to over 60 per cent.</li>\n\t<li>The Government of Canada is working to support people with disabilities in-line with the principles and objectives of the United Nations Convention on the Rights of Persons with Disabilities and the <em>Accessible Canada Act</em>, which came into force in July 2019.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/06/05/new-supports-canadians-disabilities-address-challenges-related-covid\">New supports for Canadians with disabilities to address challenges related to COVID-19</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need\">Prime Minister announces further support to help Canadians in need</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2020/04/statement-by-minister-qualtrough-on-canadas-disability-inclusive-approach-to-its-covid-19-pandemic-response.html\">Statement by Minister Qualtrough on Canada’s Disability-Inclusive approach to its COVID-19 pandemic response</a></li>\n</ul></div>\n      "
}