{
  "path": "/en/news/readouts/2022/12/13/prime-minister-justin-trudeau-speaks-prime-minister-malaysia-anwar-ibrahim",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Malaysia Anwar Ibrahim | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Malaysia, Anwar Ibrahim, to congratulate him on his recent appointment as Prime Minister.</p>\n\n<p>The prime ministers highlighted the positive relationship between Canada and Malaysia, and looked forward to working together on deepening bilateral collaboration.</p>\n\n<p>Prime Minister Trudeau thanked Malaysia for its support for Canada at the Association of Southeast Asian Nations (ASEAN), which recently committed to elevating the relationship between Canada and ASEAN to a Strategic Partnership.</p>\n\n<p>The prime ministers also discussed the recent release of Canada’s Indo-Pacific Strategy. Prime Minister Trudeau noted that Canada is a Pacific nation, and reiterated the great potential for Canada and Malaysia to do even more together on bilateral trade and investment, advancing people-to-people ties, and promoting peace and security in the region.</p>\n\n<p>Prime Minister Trudeau highlighted cooperation among friendly nations on deepening trade and creating opportunities as especially important for citizens in the context of global challenges such as rising inflation and increasing food and energy prices.</p>\n\n<p>Prime Minister Anwar expressed interest in deepening collaboration on democratic accountability and strengthening institutions, and on trade and investments with Canada.</p>\n\n<p>Prime Minister Trudeau noted that, with Malaysia’s recent ratification of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), there are many opportunities for Canada and Malaysia not only to deepen the bilateral trading relationship, but also to stand up for the rule of law, the rules-based international order, and other issues that are so important to all countries and their citizens.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/malaysia-malaisie/relations.aspx?lang=eng\">Canada-Malaysia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/indo-pacific-indo-pacifique/index.aspx?lang=eng\">Canada’s Indo-Pacific Strategy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n</ul></div>\n      "
}