{
  "path": "/en/news/news-releases/2022/05/02/investing-canadas-auto-sector-its-workers-and-our-clean-future",
  "pageTitle": "Investing in Canada’s auto sector, its workers, and our clean future | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For decades, Canada’s auto sector has been creating good, middle-class jobs and driving economic growth. Today, as we continue to recover from the pandemic and accelerate our work to build a clean future, the auto sector plays a key role in supporting workers and helping us achieve net-zero emissions by 2050. By making smart investments, the Government of Canada is delivering clean air, good jobs, and a strong economy for generations of Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Premier of Ontario, Doug Ford, to announce a new federal investment in project funding for automaker Stellantis that will secure thousands of jobs and modernize assembly plants for the clean tech economy. This multi-billion dollar project from Stellantis will support plants in Windsor and Brampton, Ontario, implementing flexible vehicle platforms at both plants and increasing its production of electric vehicles (EV). The Government of Canada is investing up to $529 million into this project. The Province of Ontario is also supporting the project with an investment of up to $513 million.</p>\n\n<p>Following another major manufacturing deal by Stellantis in March, this new investment is yet another strong vote of confidence in Canada’s automotive sector and future as a global clean tech leader. This project includes EV production at its assembly plants and new research and development investments at its Automotive Research and Development Centre (ARDC) in Windsor.</p>\n\n<p>Today’s announcement demonstrates Canada’s continued strength in automotive production and is another step toward building a strong, healthy future for Canadians. This follows the release of the Government of Canada’s 2030 Emissions Reduction Plan and Budget 2022, which propose measures to create thousands of new, good-paying jobs and grow the economy, all while fighting climate change.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s deal on made-in-Canada electric vehicles is yet another investment in our workers and in our future. We’re building a world-class Canadian auto industry for generations to come, an innovative economy, and a clean, strong future for everyone. This is what a healthy environment and a healthy economy looks like.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is yet another example that our plan to build Ontario is delivering huge wins for workers and communities all over this province. Ontario has everything it needs to be North America’s auto manufacturing powerhouse once again. We are getting it done and ensuring that the cars of the future are made in Ontario by Ontario workers.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is a big win for Canadian workers, the future of Canada’s auto sector, and the entire Canadian economy. With this historic investment for Stellantis to build thousands of electric vehicles every year, we are securing thousands of well-paying jobs in Windsor and Brampton. With a century of excellence by Canadian auto workers, today is one more step in our efforts to build a sustainable economy of the future that is part of Canada’s path to net-zero.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada has the opportunity to drive the clean energy future by building up our manufacturing of clean technologies like ZEVs. Today’s announcement will help ensure that we continue to lead the global fight against climate change, and will put more Canadians in the driver’s seat on the road to a net-zero future.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>“These investments re-affirm our long-term commitment to Canada and represent an important step as we move toward zero-emission vehicles that deliver on our customers’ desire for innovative, clean, safe and affordable mobility. We’re grateful to both the federal and provincial governments for their shared vision to create a sustainable future. And to Unifor and our workforce for their support in helping ensure the viability of our Canadian operations for the long term.”</p>\n\n<footer class=\"default\">Mark Stewart, Chief Operating Officer, Stellantis North America</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Stellantis’ investment will support the creation of a state-of-the-art Battery Pack Testing Facility for North America at the Automotive Research and Development Centre (ARDC) in Windsor, which will further secure Canada’s position as a leader in EV innovation. Activities at the ARDC are already underway, with an addition to the existing building to be complete by the end of 2023.</li>\n\t<li>The Government of Canada recently released the <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\"><em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em></a><em>, </em>an ambitious and achievable sector-by-sector approach for Canada to reach its new climate target of cutting emissions by at least 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n\t<li>The Government of Canada is putting in place a sales mandate that will ensure that 100 per cent of new light-duty vehicle sales are zero-emission vehicles by 2035. Accelerating the ZEV target will support Canada’s commitment to reach net-zero emissions by 2050 and its pledge at the United Nations 2019 Climate Action Summit.</li>\n\t<li>Budget 2022 proposes an investment of $1.7 billion to extend the Incentives for Zero-Emission Vehicles Program until March 2025 and broadening eligibility under the program to include more vehicle models.</li>\n\t<li>In support of the government’s objective of adding 50,000 ZEV chargers to Canada’s network, Budget 2022 provides an additional $400 million to Natural Resources Canada for deploying zero-emission vehicle infrastructure, complemented by $500 million that Canada’s Infrastructure Bank will invest in large-scale ZEV charging and refueling infrastructure that is revenue generating and in the public interest.</li>\n\t<li>The auto sector in Canada supports nearly 500,000 workers in Canada, contributes $16&nbsp;billion annually to Canada’s gross domestic product, and is one of the country’s largest export industries.</li>\n\t<li>The auto industry around the world is in a period of rapid transformation to electrification. The Government of Canada is providing support to facilitate this transition here at home. Canada competes globally and in North America for these investments and this support ensures that the country’s auto sector remains competitive, and is secured for the future.</li>\n\t<li>Stellantis is a leading global automaker and mobility provider that offers clean, connected, affordable and safe mobility solutions. Its ambitious electrification and software strategies and the creation of an innovative ecosystem of strategic, game-changing partnerships are driving its transformation into a sustainable mobility tech company.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/clean-air-and-a-strong-economy.html\">Budget 2022 Backgrounder: Clean Air and a Strong Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/a-strong-growing-and-resilient-economy.html\">Budget 2022 Backgrounder: A Strong, Growing, and Resilient Economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget 2022</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/11/helping-more-canadians-drive-electric-vehicles\">Helping more Canadians drive electric vehicles</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.stellantis.com/en\">Stellantis</a></li>\n</ul></div>\n      "
}