{
  "path": "/en/news/readouts/2022/05/20/prime-minister-justin-trudeau-convenes-incident-response-group-situation",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group on the situation in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau convened the Incident Response Group with ministers and senior officials to discuss the latest developments of the situation in Ukraine.</p>\n\n<p>With the Russian invasion of Ukraine starting almost three months ago, the group discussed the Government of Canada’s ongoing efforts to assist the people of Ukraine, including those seeking refuge in Canada. In addition to the regular arrival of Ukrainians to Canada, three charter flights from Poland will be arriving in Canada in the coming weeks as part of the Canada-Ukraine Authorization for Emergency Travel program. The group also discussed financial supports, interim accommodations, and plans to launch a family sponsorship pathway for up to 10,000 new permanent residents.</p>\n\n<p>The Prime Minister spoke about the impacts of the invasion on the Ukrainian people and Ukraine’s infrastructure and economy. He also noted the global impact on energy prices and food security, and the group discussed how Canada could help. They assessed options for increasing federal efforts underway to provide humanitarian and agricultural development support. They further discussed how Canada could help alleviate current pressures on supply chains in the medium and long term, including by increasing food production and processing.</p>\n\n<p>The Prime Minister and ministers were updated on Canada’s military support to Ukraine to date. Following the announcement of $500 million in new funding for military assistance to Ukraine in Budget 2022, National Defence continues to pursue additional support to meet Ukraine’s immediate and longer-term requirements. The group also discussed the coordination of efforts with Allies and partners, including donations of equipment and timelines for delivery.</p>\n\n<p>The Prime Minister and ministers committed to continue working alongside Allies and international partners to support the territorial integrity, sovereignty, and independence of Ukraine and the country’s evolving needs in the face of Russia’s ongoing, illegal aggression.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/05/federal-charter-flights-for-ukrainians-who-want-to-come-to-canada.html\">Federal charter flights for Ukrainians who want to come to Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/08/prime-minister-visits-kyiv-ukraine\">Prime Minister visits Kyiv, Ukraine</a></li>\n</ul></div>\n      "
}