{
  "path": "/en/news/news-releases/2017/12/04/canada-announces-new-partnerships-china-grow-shared-prosperity",
  "pageTitle": "Canada announces new partnerships with China to grow shared prosperity | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced new joint partnerships with China after successfully concluding, with His Excellency Li Keqiang, Premier of the State Council of the People’s Republic of China, the second Annual Leaders’ Dialogue.</p><p>Canada and China are working to build a stronger, more stable relationship to create good, middle-class jobs and more opportunities for people in both countries.</p><p>With that goal in mind, the two leaders announced new initiatives to grow our shared prosperity.</p><p>The Prime Minister and the Premier look forward to continuing exploratory discussions towards a comprehensive trade agreement between Canada and China. With China, as with all of our trading partners, we are committed to pursuing trade that benefits everyone, that puts people first and reflects Canadian values, especially when it comes to the environment, labour, and gender.</p><p>The two leaders issued the Joint Statement on Climate Change and Clean Growth which highlights the ongoing bilateral collaboration and the potential for enhanced engagement. The two countries will also expand cooperation and increase ministerial dialogue to promote clean growth and combat climate change by fully implementing the Paris Agreement.</p><p>In the context of the National Security and Rule of Law Dialogue, the Prime Minister directed his officials to redouble their efforts regarding the threat of opioids.</p><p>Both countries agreed to increase collaboration on agriculture and tourism, which will include expanding market access to give Canadian producers new opportunities to enhance their competitiveness. They also committed to supporting more opportunities for youth and student exchanges, such as internships at Canadian missions in China.</p><p>To strengthen the cultural and economic relationship between Canada and China, both countries agreed to co-chair the inaugural meeting of the Canada-China Joint Committee on Culture in Ottawa, in February 2018, to discuss matters of mutual interest, including creative industries and the arts.</p><p>Finally, the two leaders discussed important regional issues, including North Korea and Myanmar. In the spirit of open and frank dialogue, both sides agreed to maintain a dialogue on human rights on the basis of equality and mutual respect, and to expand practical cooperation and exchanges, including on the rule of law, and to address their differences constructively.</p><h2>Quotes</h2><blockquote><p>“While in Beijing, Premier Li and I had discussions on a range of issues, from growing trade and investment, to combating climate change, to the importance of free expression. I look forward to continuing discussions towards a comprehensive trade agreement, which will open up greater opportunities for people on both sides of the Pacific.”<br><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Increasing trade and investment with our partners in the Asia-Pacific region is essential if we are to create long-term prosperity and an economy that creates jobs and works for the middle class. China is Canada’s second largest trading partner, and its vast market offers significant opportunities for Canadian businesses of all sizes. It is time for a more strategic, long-term, and comprehensive approach to economic engagement with China.”&nbsp;<br><cite>— The Hon. François-Philippe Champagne, Minister of International Trade</cite></p></blockquote><blockquote><p>“I am proud of the ongoing collaboration between Canada and China on climate change and the environment. Canada and China understand the need to protect our environment for future generations and the economic opportunity of clean growth. Environmental protection is key to our progressive trade agenda and will provide even greater opportunities for businesses&nbsp;to provide innovative solutions for clean air, water and soil&nbsp;that will lead to good, middle-class jobs and prosperity in both countries. Canada and China are committed&nbsp;to work together to provide global leadership on combatting&nbsp;climate change through implementation of the Paris Agreement.”&nbsp;<br><cite>— The Hon. Catherine McKenna, Minister of Environment and Climate Change</cite></p></blockquote><h2>Quick facts</h2><ul><li>Prime Minister Trudeau and His Excellency Li Keqiang, Premier of the State Council of the People’s Republic of China, last met in September 2016 in Canada when the two leaders held an inaugural meeting of the Canada-China Annual Leaders’ Dialogue.</li><li>China is Canada’s second-largest trading partner, largest and fastest growing source market for international students, and third-largest source of tourists.</li><li>Canada’s merchandise exports to China were almost $21 billion in 2016, an increase of four per cent over 2015, with top exports being forest and agricultural products, copper and iron ores, and motor vehicles.</li><li>In 2016, Canada and China agreed to designate 2018 the Canada-China Year of Tourism, which includes initiatives to increase the flow of tourists and promote cultural activities.</li></ul><h2>Related products</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/12/04/canada-china-joint-initiatives-and-agreements\">Canada-China Joint Initiatives and Agreements</a></li><li><a href=\"/en/news/statements/2017/12/04/canada-china-joint-statement-climate-change-and-clean-growth\">Joint Statement on Climate Change and Clean Growth</a></li><li><a href=\"/en/news/news-releases/2017/12/04/prime-minister-trudeau-welcomes-upcoming-canada-china-year-tourism\">Prime Minister Trudeau welcomes upcoming Canada-China Year of Tourism</a></li><li><a href=\"/en/news/news-releases/2017/11/26/prime-minister-strengthen-bilateral-and-commercial-ties-trip-china\">Prime Minister to strengthen bilateral and commercial ties on trip to China</a></li></ul><p><b>Associated link</b></p><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.56003307.1168694504.1511191876-108037952.1511191871\">Canada-China Relations</a></li></ul></div>\n      "
}