{
  "path": "/en/news/statements/2021/03/11/statement-prime-minister-mark-one-year-world-health-organization",
  "pageTitle": "Statement by the Prime Minister to mark one year since the World Health Organization declared COVID-19 a pandemic | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement to reflect on the year that has passed since the World Health Organization declared COVID‑19 a pandemic:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“One year after the World Health Organization officially declared COVID‑19 a pandemic, more than </span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">22,000 Canadian families have lost a loved one, many people have lost their jobs and businesses, health care and front line workers have faced great risk and challenge, and all Canadians have made sacrifices to keep others safe and healthy.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Today, on the National Day of Observance for COVID-19, we honour every individual who lost their life to this disease, and we stand with the people they loved as they continue to cope with this unimaginable loss. Together, we also recognize all who have been impacted by the pandemic, and we reaffirm our commitment to work as Team Canada to beat this virus.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Canada was swift to act at the beginning of this pandemic. While Canadians followed public health measures to flatten the curve and protect our front line health care workers and systems, we quickly took action to help save lives and support individuals, families, and businesses through the crisis. With a broad range of measures, including the Canada Emergency Response Benefit and the Canada Emergency Wage Subsidy, we helped Canadians put food on the table and employers keep their workers on the payroll. We also worked tirelessly to ensure essential workers had access to the supplies they needed to stay safe and healthy, and we have worked with Indigenous communities to provide the support they needed in these challenging times. Together, alongside all orders of government, Indigenous peoples, community organizations, <span>and private sector partners,</span> we quickly worked to use every tool available to protect and support Canadians during this crisis.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“We also joined forces with our international partners to strengthen global health systems, coordinate response efforts, support vulnerable countries, and help researchers develop tests and vaccines. Canada will continue to work with our partners through the G7, the G20, and other international organizations to contribute to a coordinated and science-based response and recovery, and to support vulnerable countries – because we can’t beat COVID-19, unless we beat it everywhere.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“As we look back on the challenges of this past year and reflect on how far we have come, we must also keep one eye on the road ahead. The largest immunization campaign in our country’s history is well underway, and we are on track to have a vaccine available for every Canadian who wants one, by September. But the pandemic isn’t over, and until all Canadians have access to a safe and effective vaccine, we all need to continue to follow public health advice. That means working from home if you can, keeping two metres apart from others, wearing a mask, and downloading the COVID Alert app.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Today, we acknowledge the heavy toll that the global pandemic has taken and continues to take, both here at home and abroad. To date, more than 2.6&nbsp;million people have died globally from COVID-19, including 22,000 Canadians. They are more than just numbers. They were our mothers, fathers, grandparents, and loved ones. They were our neighbours, friends, and colleagues. We honour their memory, and renew our commitment to <span>do whatever it takes, for as long as it takes, to keep people safe and supported through this crisis. </span></span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“</span></span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">We also take this opportunity to thank our </span><span><span>front line workers who have been working tirelessly every single day to keep us safe and healthy. We owe these everyday heroes an immense debt of gratitude, and we will continue to offer the support they need.</span></span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Since the first case of the virus was diagnosed in Canada in January 2020, close to 850,000 Canadians have recovered from this terrible disease, but many in communities across the country continue to suffer its effects. We will continue to work together to set Canada – and the world – on the path to recovery and <span>to build back better for everyone. The past year has been difficult, but better days are ahead. We will come out of this pandemic a more resilient country </span></span><span><span>in a stronger global community</span></span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>.”</span></span></span></span></p></div>\n      "
}