{
  "path": "/en/news/statements/2016/08/26/statement-prime-minister-canada-25th-anniversary-re-establishing-ties",
  "pageTitle": "Statement by the Prime Minister of Canada on the 25th anniversary of re-establishing ties with Baltic states | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the 25<sup>th</sup> anniversary of Canada’s re-establishment of diplomatic relations with Estonia, Latvia, and Lithuania:</p>\n<p>“On this day – 25 years ago – Canada re-established diplomatic ties with Estonia, Latvia, and Lithuania, after the three Baltic states declared independence from the Soviet Union.</p>\n<p>“Since then, our countries have enjoyed a dynamic and friendly relationship, rooted in the shared values of democracy and freedom, and our partnership in the North Atlantic Treaty Organization.</p>\n<p>“Canada never recognized the Soviet Union’s occupation of Estonia, Latvia, and Lithuania, and always supported their struggle to restore independence during decades of Soviet occupation.</p>\n<p>“Canada looks forward to further strengthening its relations with Estonia, Latvia, and Lithuania, and working with them on bilateral and regional issues, including support for Ukraine’s sovereignty and territorial integrity. This includes Canada’s recent commitment to lead a robust multinational NATO battlegroup in Latvia, as part of NATO’s enhanced Forward Presence in Eastern Europe. We will continue working closely with our NATO Allies ‒ including those in the Baltics ‒ to ensure our citizens can continue to live in safety and security.&nbsp;</p>\n<p>“On behalf of the Government of Canada, Sophie and I invite all Canadians to reflect on the tremendous contributions of Canadians of Estonian, Latvian, and Lithuanian descent to our national fabric, and offer our best wishes to everyone celebrating today.”</p></div>\n      "
}