{
  "path": "/en/news/news-releases/2022/04/13/helping-young-people-get-housing-market",
  "pageTitle": "Helping young people get into the housing market | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone should have a place to call home, yet it is becoming increasingly challenging for many Canadians, especially young people, to find a safe and affordable place to live. That’s why a key focus of Budget&nbsp;2022 is making housing more affordable for young people in communities across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted key measures included in <em>Budget&nbsp;2022: </em><em>A Plan to Grow Our Economy and Make Life More Affordable</em> to help improve housing affordability and get more young people into the housing market.</p>\n\n<p>The measures proposed in Budget&nbsp;2022 include:</p>\n\n<ul>\n\t<li><strong>Introducing the Tax-Free First Home Savings Account, </strong>allowing first-time home buyers to contribute up to $40,000. Like an RRSP, contributions would be tax-deductible, and withdrawals to purchase a first home – including investment income – would be non-taxable, like a TFSA. Tax-free in, tax-free out.</li>\n\t<li><strong>Doubling the First-Time Home Buyers’ Tax Credit to $10,000</strong> to provide up to $1,500 in direct support to home buyers. This will apply to homes purchased on or after January 1, 2022.</li>\n\t<li><strong>Extending the First-Time </strong><strong>Home Buyer</strong> <strong>Incentive</strong> to March 31, 2025, allowing first-time home buyers to lower their monthly payments.</li>\n\t<li><strong>Helping Canadians save for and buy their first home</strong> by investing $200&nbsp;million to help develop and scale up rent-to-own projects across Canada.</li>\n\t<li><strong>Curbing unfair practices that drive up the price of housing, in order to level the playing field for young and middle class Canadians</strong> by imposing a two-year ban on foreign capital coming into Canada to buy residential real estate; taking steps to ensure property flippers pay their fair share of taxes; taxing all assignment sales of newly constructed and substantially renovated homes; and working with provinces and territories to develop and implement a Home Buyers’ Bill of Rights and bring forward a national plan to end blind bidding.</li>\n\t<li><strong>Putting Canada on the path to double housing construction over the next decade</strong>, including by investing $4&nbsp;billion for the launch of a new Housing Accelerator Fund that will help create 100,000 new housing units over the next five years.</li>\n</ul>\n\n<p>Budget&nbsp;2022 proposes targeted and responsible investments to ensure more Canadians, especially young Canadians, have a safe and affordable place to call home. This is a key part of our plan to make life more affordable, create jobs and prosperity today, grow the middle class, and build a stronger economic future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Making life more affordable starts with addressing housing affordability. Everyone deserves a safe place to live, raise their family, and build their future. Budget&nbsp;2022 will help put the dream of home ownership back in reach for more Canadians across the country, and protect them from unfair practices that drive up prices.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We need housing that is affordable for everyone, and that means we have to take significant steps to ensure an entire generation of Canadians is not priced out of owning a home. Budget&nbsp;2022 represents the most ambitious plan that Canada has ever had to solve that fundamental challenge.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget&nbsp;2022 proposes measures to fight homelessness and support housing affordability, particularly for the most vulnerable.<strong> </strong>This includes investing $475&nbsp;million in 2022-23 to provide a one-time $500 payment to those facing housing affordability challenges; providing $1.5&nbsp;billion to extend the Rapid Housing Initiative and create at least 6,000 additional affordable housing units across Canada; advancing $2.9&nbsp;billion under the National Housing Co-Investment Fund to accelerate the creation of up to 4,300 new units and repair of up to 17,800 units for vulnerable Canadians; and providing $562.2&nbsp;million over two years to continue to prevent and address homelessness through <em>Reaching Home: Canada’s Homelessness Strategy</em>.</li>\n\t<li>Budget&nbsp;2022 proposes an additional $458.5&nbsp;million to provide low-interest loans and grants to low-income housing providers through the Canada Greener Home Loans program. This funding will help make existing affordable housing more energy efficient, which will also help to lower energy bills.</li>\n\t<li>Budget&nbsp;2022 proposes a Multigenerational Home Renovation Tax Credit that would provide up to $7,500 for Canadians to build a secondary suite that would allow a senior or an adult with a disability to move in.</li>\n\t<li>To expand co-operative housing in Canada by an estimated additional 6,000 units, Budget&nbsp;2022 proposes to reallocate $500&nbsp;million of funding from the National Housing Co-Investment Fund to launch a new Co-operative Housing Development Program, and reallocate an additional $1&nbsp;billion in loans from the Rental Construction Financing Initiative to support co-op housing projects. This would be the largest investment in building new co-op housing in Canada for more than 30 years.</li>\n\t<li>Budget&nbsp;2022 seeks to accelerate work in closing housing gaps for Indigenous Peoples<strong> </strong>by investing $4.3&nbsp;billion over seven years to improve and expand Indigenous housing in Canada.</li>\n\t<li>Budget&nbsp;2022 also proposes $150&nbsp;million over two years, starting in 2022-23, to support affordable housing and related infrastructure in the North.</li>\n\t<li>The housing measures proposed in Budget&nbsp;2022 build on the Government of Canada’s National Housing Strategy (NHS), a 10-year, $72+&nbsp;billion plan that will give more Canadians a place to call home and which is grounded in a human rights-based approach to housing.</li>\n\t<li>Since the creation of the NHS, the Government of Canada has committed over $24.2&nbsp;billion to support the creation of over 91,000 units and the repair of over 209,000 units, and has provided affordability support for over 172,000 households. These measures prioritize those in greatest need, including seniors, Indigenous Peoples, people experiencing or at risk of homelessness, and women and children fleeing violence.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget&nbsp;2022 Backgrounder: Making Housing More Affordable</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/moving-forward-on-reconciliation.html\">Budget&nbsp;2022 Backgrounder: Moving Forward on Reconciliation</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\">National Housing Strategy</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/consumers/home-buying/first-time-home-buyer-incentive\">First-Time Home Buyer Incentive</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/affordable-housing-innovation-fund\">Affordable Housing Innovation Fund</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/co-investment-fund\">National Housing Co-Investment Fund</a></li>\n</ul></div>\n      "
}