{
  "path": "/en/news/news-releases/2023/04/28/prime-minister-advances-gender-equality-and-strengthens-trade-ties",
  "pageTitle": "Prime Minister advances gender equality and strengthens trade ties while in New York City | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is a global leader in advancing gender equality and the empowerment of women and girls. As women’s rights are increasingly threatened around the world, Canada will continue to step up. Over the past two days, the Prime Minister, Justin Trudeau, had a successful visit to New York City where he continued work to advance gender equality internationally at the <a href=\"https://www.globalcitizen.org/en/content/global-citizen-now-everything-to-know-2023/\">Global Citizen NOW</a> summit.</p>\n\n<p>In the face of rising global challenges and threats to democracy and human rights – including women’s rights, the Prime Minister highlighted Canada’s <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a> (FIAP) and its overarching objectives of reducing poverty, advancing gender equality and human rights, supporting lasting peace and security, and implementing the Sustainable Development Goals (SDGs) to build a more equal, peaceful, and healthy world.</p>\n\n<p>Weakened democracies and geopolitical instability have threatened to undermine women’s rights and the work and safety of women’s rights organizations, women human rights defenders, women peacebuilders, and young feminists. That’s why yesterday, Canada <a href=\"https://www.canada.ca/en/global-affairs/news/2023/04/canada-announces-expansion-and-renewal-of-womens-voice-and-leadership-program.html\">announced</a> $195 million over five years and $43.3 million per year ongoing for the renewal and expansion of the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/wvl_projects-projets_vlf.aspx?lang=eng\">Women’s Voice and Leadership Program</a>. This is a flagship initiative to support women’s rights organizations and lesbian, bisexual, transgender, queer, and intersex (LBTQI) groups working for women’s rights and gender equality around the world. The renewal and expansion of the program reaffirms Canada’s longstanding commitment and leadership in supporting women’s rights organizations to advance gender equality and women’s rights where it is needed most, including in conflict and crisis-affected areas.</p>\n\n<p>While in New York, the Prime Minister, with his co-Chair the Prime Minister of Barbados, Mia Mottley, convened the SDG Advocates Group to accelerate work towards achieving the SDGs and creating momentum ahead of the SDG Summit in September 2023. The Prime Minister reiterated Canada's commitment to implementing the SDGs and building a better future at home and abroad.</p>\n\n<p>During his visit, Prime Minister Trudeau also underscored Canada’s strong leadership on climate action and the continued need to advocate for women, who are particularly vulnerable to the impacts of climate change, as they often bear responsibility for securing food and water for example. He also stressed the importance of fully leveraging the capacity of the Multilateral Development Banks to improve the ability of low-and middle-income countries, especially those affected by the impacts of climate change, to access the financing they need to confront unprecedented overlapping crises.</p>\n\n<p>While in New York, Prime Minister Trudeau delivered a keynote address at the Council on Foreign Relations to an audience of leaders in banking, finance, policy. He highlighted Canada’s unique partnership with the United States, affirming that the bonds that unite our two countries are a source of strength in the advancement of our domestic, regional and global objectives, including our mutual and deep commitment to democracy, human rights, and the rules-based international order. The Prime Minister further underlined Canada’s role as a reliable and responsible partner for trade and investment and the importance of Canada and the United States working together in areas of mutual interest such as critical minerals, electric vehicles, semiconductors supply chains, and clean energy.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As we implement game-changing policies that help women in Canada like $10-a-day child care, we must also support women around the world who are seeing their hard-fought rights repealed and clawed back. In places like Iran, Afghanistan, and beyond, Canada will continue to be there as a partner for women’s rights organizations fighting for equality. Only when we achieve gender equality, can we truly build a more peaceful, equal, and healthy world for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The Prime Minister was joined by Canada’s Ambassador for Women Peace and Security, Jacqueline O’Neil, at the Global Citizen NOW event.</li>\n\t<li>In New York City, Prime Minister Trudeau held bilateral meetings with the Prime Minister of Barbados, Mia Mottley and the President of the European Commission, Ursula von der Leyen.</li>\n\t<li>The Prime Minister also participated in an interview with the Executive Director of the United Nations Office of Partnerships, Annemarie Hwa Hou where he reiterated his call for accelerated, collective efforts to achieve the SDGs, including the need to work together to achieve inclusive and equitable quality education for all.</li>\n\t<li>In 2021-22, 99 per cent of Canada’s bilateral international assistance either targeted or integrated gender equality.</li>\n\t<li>Since its inception in 2017, the Women’s Voice and Leadership program has supported more than 1500 local women’s rights organizations in over 30 countries and regions.</li>\n</ul><h2>Related Products</h2>\n\n<ul><li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/04/21/prime-minister-participate-global-citizen-now-summit\">Prime Minister to participate in Global Citizen NOW summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/04/27/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley?auHash=1qN6gb3pS7SX2l6lvxx7xd9G4Z0FXhV5IzDofe7ky0A\">Prime Minister Justin Trudeau meets with Prime Minister of Barbados Mia Mottley</a></li>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"b0e45f76-c485-4f7b-811d-1b1eae30846e\" href=\"/en/news/readouts/2023/04/28/prime-minister-justin-trudeau-meets-president-european-commission-ursula\">Prime Minister Justin Trudeau meets with the President of the European Commission, Ursula von der Leyen</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://sdgs.un.org/\">United Nations - Sustainable Development</a></li>\n\t<li><a href=\"https://sdgs.un.org/2030agenda\">Transforming our world: the 2030 Agenda for Sustainable Development</a></li>\n\t<li><a href=\"https://www.unsdgadvocates.org/\">SDG Advocates</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy</a></li>\n</ul></div>\n      "
}