{
  "path": "/en/news/news-releases/2019/03/08/prime-minister-delivers-apology-inuit-federal-governments-management",
  "pageTitle": "Prime Minister delivers apology to Inuit for the federal government’s management of tuberculosis epidemic from the 1940s-1960s | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Apologies cannot undo the wrongs of the past – but they play an important role in setting a commitment to do better, and helping communities heal. By acknowledging these wrongs, we can help renew Canada’s relationship with Inuit, create a more just future, and move forward together on our journey of reconciliation.</p>\n\n<p>The Prime Minister, Justin Trudeau, today apologized on behalf of the Government of Canada to Inuit for its actions during the tuberculosis epidemic from the 1940s to the 1960s. During this period, thousands of Inuit were sent away from their communities for tuberculosis treatment in southern Canada, where they were cut off from their language, their culture, their families, and their home. In too many cases, when people passed away during treatment, they were buried far from home, leaving families with no knowledge of the fate of their loved ones.</p>\n\n<p>Prime Minister Trudeau recognized the pain and trauma this injustice caused for families and communities across Inuit Nunangat, and the intergenerational impacts that continue to affect Inuit communities today. He also apologized for the colonial mindset that drove these and other government actions and brought such shameful destruction upon Inuit communities.</p>\n\n<p>The Prime Minister also announced the launch of the Nanilavut Initiative, developed in partnership with Inuit, to help Inuit families and communities with the process of healing. In Inuktitut, “Nanilavut” means “let’s find them.” The initiative will help families find information on loved ones sent away during the epidemic. It will also provide other support identified as important by Inuit, including mental health assistance and commemoration activities.</p>\n\n<p>The apology and the Nanilavut Initiative are the result of a collaborative effort between the Government of Canada, Inuit Tapiriit Kanatami, Inuvialuit Regional Corporation, Makivik Corporation, Nunatsiavut Government and Nunavut Tunngavik Incorporated. Reconciliation initiatives like this are a key priority for these partners, and part of the work of the Inuit-Crown Partnership Committee. They also reflect the Government of Canada’s firm commitment to renewing the Inuit-Crown relationship based on recognition of rights, respect, cooperation, and partnership.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“To Inuit, and the families and communities of Inuit Nunangat who were wronged by the federal government’s management of the tuberculosis epidemic – we are sorry. We apologize to those who were forced to leave, those left behind, the families without knowledge of the fate of their loved ones, and the communities that continue to feel the impacts today. We cannot undo the shameful actions of the past, but we can work together to create a better future, one built on respect and partnership. Every step we take on this journey of reconciliation, we will take together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This apology is a necessary first step toward closing this dark chapter in Canada’s history and remedying the ongoing challenges that are connected to it. It allows families to seek the closure and healing they have sought for more than half a century. I am pleased that the Prime Minister’s words are also accompanied by actions. The launch of the Nanilavut Initiative will help many families gather tangible information to help them find the final resting place of their loved ones. Through the Inuit-Crown Partnership Committee, Inuit leaders and federal ministers must continue to work together to achieve our shared commitment of eliminating TB in Inuit Nunangat by 2030. These are all critical elements on our shared path towards reconciliation.”</p>\n\n<footer class=\"default\">Natan Obed, President, Inuit Tapiriit Kanatami</footer>\n</blockquote>\n\n<blockquote>\n<p>“On behalf of Beneficiaries of the Labrador Inuit Land Claims Agreement, we acknowledge and accept the Prime Minister’s apology. We also appreciate the federal government’s efforts to help Inuit find closure in relation to this important issue. We are proud to be working with our partners across Inuit Nunangat and in Ottawa to help Inuit find out what happened to lost loved ones who were sent south for medical treatment between the 1940s and 1960s. The work we are doing together is extremely important, and there is still so much to do to create the better future that the Prime Minister spoke so eloquently about.”</p>\n\n<footer class=\"default\">Johannes Lampe, President, Nunatsiavut</footer>\n</blockquote>\n\n<blockquote>\n<p>“We acknowledge the apology, which is long overdue. While we look at the wrongs of the past, we also look at problems of today, among them overcrowding from the lack of housing and the spread of tuberculosis that is endangering our people as the disease slowly spreads in Arctic communities.”</p>\n\n<footer class=\"default\">Adamie D Alaku, Vice President, Makivik Corporation of Nunavik</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has been collaborating with Inuit partners on the Nanilavut Initiative, which will provide family members with information on loved ones who passed away while undergoing medical treatment for tuberculosis between the 1940s and the 1960s.</li>\n\t<li>The Government of Canada is committed to supporting Inuit-led efforts to eliminate tuberculosis in Inuit Nunangat, as well as the factors that contribute to the spread of the disease, including inadequate housing, food insecurity, and poverty.</li>\n\t<li>On March 23, 2018, the Government of Canada and Inuit Tapiriit Kanatami announced a commitment to eliminate tuberculosis across Inuit Nunangat by 2030, and reduce active tuberculosis by at least 50 percent by 2025.</li>\n\t<li>Budget 2018 announced $27.5 million over five years to support the Inuit-specific approach to tuberculosis elimination. This includes funding for enhanced prevention, screening, diagnosis, and treatment of TB and latent TB infection.</li>\n\t<li>This is part of the $509.5 million committed in Budget 2018 to work with Inuit and other partners to strengthen public health programs, collect data through an Inuit Health Survey, invest in housing to address the significant overcrowding in Inuit communities, and support employment and job training.</li>\n\t<li>This is in addition to the $240 million over 10 years announced in Budget 2017 to support housing in Nunavut.</li>\n</ul>\n\n<h2><strong>Related Product</strong></h2>\n\n<ul>\n\t<li><a href=\"/en/news/2019/03/08/statement-apology-behalf-government-canada-inuit-management-tuberculosis-epidemic\">Statement of apology on behalf of the Government of Canada to Inuit for the management of the tuberculosis epidemic from the 1940s-1960s</a>&nbsp;(also available in Inuktitut, in&nbsp;<a href=\"/en/news/2019/03/08/mamiarniujuq-kanataup-gavamangani-inunnut-aulatsinirilauqsimajanginnut\">Roman orthography</a>&nbsp;and in&nbsp;<a href=\"/en/news/backgrounders/2019/03/08/inuktitut-syllabics\">syllabics</a>, and in <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/03/08/qaqialisimaninginnut-kiggatullugu-kavamanga-kanatami-inunnut\">Labrador Inuktitut</a>, in <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/03/08/uqauhit-mamiahuknirmun-kivgartuqhugit-tapkuat-kavamatkut-kanata\">Inuinnaqtun</a>, in <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/03/08/kanatami-gavamakkut-uqausingit-ilaaniungituurniginut-inunnut\">Nunavik Inuktitut</a>, in <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/03/08/canadam-ataniqpangit-uqaqtuat-nagligusuklutik-inuit\">Inuvialuktun</a>.)</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\">Inuit Tuberculosis Elimination Framework Released</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/03/the-government-of-canada-and-inuit-tapiriit-kanatami-commit-to-eliminating-tuberculosis-across-inuit-nunangat-by-2030.html\">The Government of Canada and Inuit Tapiriit Kanatami commit to eliminating tuberculosis across Inuit Nunangat by 2030</a></li>\n\t<li><a href=\"/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee</a></li>\n\t<li><a href=\"/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">Inuit Nunangat Declaration on Inuit-Crown Partnership</a></li>\n</ul></div>\n      "
}