{
  "path": "/en/news/news-releases/2018/05/01/his-serene-highness-prince-albert-ii-monaco-visit-canada",
  "pageTitle": "His Serene Highness Prince Albert II of Monaco to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Sovereign Prince of Monaco, His Serene Highness Albert II, will visit Canada from May 7 to 8, 2018.</p><p>During the visit, Prime Minister Trudeau and H.S.H. Prince Albert II will discuss our shared commitment to the Paris Agreement, and the actions our countries are taking to address climate change and protect the world’s oceans.</p><p>They will also discuss the work of the Canadian chapter of the Prince Albert II of Monaco Foundation, which focuses particularly on the Canadian Arctic, including its communities, biodiversity, and oceans.</p><h2>Quote</h2><blockquote><p>“Canada and Monaco are partners in the fight against climate change, and share a commitment to protect our world’s oceans. I look forward to meeting with Prince Albert to discuss how we can work together to promote further action and leave a cleaner, healthier planet for future generations.”<br>—&nbsp;<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the first formal meeting between Prime Minister Trudeau and H.S.H. Prince Albert II of Monaco.</li><li>In Monaco, Canada is represented by the Embassy of Canada in France.</li><li>In Canada, Monaco is represented by its Embassy in Washington as well as honorary consulates in Toronto, Montréal and Vancouver.</li><li>The two countries also cooperate in a number of international organizations and institutions, most notably the International Organisation of La Francophonie.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_monaco.aspx?lang=eng\">Canada-Monaco</a></li></ul></div>\n      "
}