{
  "path": "/en/news/statements/2017/09/29/statement-prime-minister-yom-kippur",
  "pageTitle": "Statement by the Prime Minister on Yom Kippur | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on Yom Kippur:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Tonight at sunset, Jewish communities in Canada and around the world will observe the beginning of Yom Kippur, the Day of Atonement.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Yom Kippur, which occurs on the tenth day of the month of Tishrei, is one of the holiest days in the Jewish calendar. It marks the end of the Ten Days of Awe, and is a time for introspection, repentance, and renewal.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On this sacred day, people will gather with family and friends to fast and pray, reflect on the past year, and look forward with hope and renewed purpose to the year ahead. For all of us, Yom Kippur is a chance to reflect on our values and recommit ourselves to putting them into practice.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, we mark the 150th anniversary of Confederation – an opportunity to honour the many cultures, traditions, and beliefs that make Canada such a wonderful place to live. Jewish Canadians as individuals and as a community have greatly contributed to Canada’s success over the last 150 years and continue to play an important role in all aspects of Canadian life.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“For many people in the Jewish community in Canada, Yom Kippur comes at a time of anxiety this year, in the wake of recent hateful, anti-Semitic acts. The Government of Canada stands firmly with the Jewish community in the face of this hatred. We will continue to work to counter anti-Semitism, racism, and hatred in all its forms, and to build a more inclusive Canada.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of our entire family, Sophie and I extend our best wishes to the Jewish community and all those observing Yom Kippur.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“G’mar Chatimah Tovah.”</span></p></div>\n      "
}