{
  "path": "/en/news/statements/2023/04/16/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week:</p>\n\n<p>“In Canada and around the world, volunteers are the backbone of our communities, helping those most vulnerable by generously donating their time, skills, and talent. During <a href=\"https://volunteer.ca/index.php?MenuItemID=477#:~:text=The%20National%20Volunteer%20Week%20theme,take%20to%20support%20one%20another\">National Volunteer Week</a>, we celebrate and recognize the positive impact of Canada’s volunteers, from delivering meals to those who need them to organizing community events for kids.</p>\n\n<p>“Each year, the Government of Canada recognizes the significant contributions to improving the lives of others through <a href=\"https://www.canada.ca/en/employment-social-development/news/2022/11/government-of-canada-announces-recipients-of-canadas-volunteer-awards0.html\">Canada’s Volunteer Awards</a>. I extend my warmest congratulations to the <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards/2021-recipients.html\">21 most recent award recipients</a>, including Marilyn McLean, the latest recipient of the Thérèse Casgrain Lifelong Achievement Award, for her 42 years of volunteering for Special Olympics British Columbia.</p>\n\n<p>“The theme for this year’s National Volunteer Week is ‘Volunteering Weaves Us Together’. It speaks to the power of collective action and reminds us that we are stronger when we work together. That is why the Government of Canada continues to support initiatives like the Canada Service Corps, which provides young Canadians with meaningful service opportunities that help them gain valuable skills and experience that they will carry with them throughout their lives.</p>\n\n<p>“As we celebrate National Volunteer Week, I invite you to thank a volunteer, donate your time, or share your volunteering story using the hashtags #NVW2023 and #WeavingUsTogether. On behalf of the Government of Canada, Sophie and I would like to thank all volunteers, from coast to coast to coast, who generously give their time and energy to help build stronger and more resilient communities across the country.”</p></div>\n      "
}