{
  "path": "/en/news/news-releases/2021/02/16/new-firearms-measures-combat-crime-and-increase-public-safety",
  "pageTitle": "New firearms measures to combat crime and increase public safety | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gun violence has had devastating effects on communities across the country, and on too many Canadians who have lost loved ones. According to Statistics Canada, firearms were used in over 40 per cent of homicides in Canada in 2019. This violence must stop. This is why, last May, the Government of Canada banned over 1,500 models and variants of assault-style firearms and some of their components. The government is continuing to take every step necessary to combat gun violence and keep Canadians and communities safe.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the introduction of new legislation to amend the <em>Criminal Code</em> and the <em>Firearms Act</em> to make communities safer while respecting law-abiding gun owners. Through the proposed legislation and other measures, the government would:</p>\n\n<ul>\n\t<li><strong>Combat intimate partner and gender-based violence, and self-harm involving firearms</strong> by creating “red flag” and “yellow flag” laws. These laws would allow people, such as concerned friends or relatives, to apply to the courts for the immediate removal of an individual’s firearms, or to ask a Chief Firearms Officer to suspend and review an individual’s licence to own firearms.</li>\n</ul>\n\n<ul>\n\t<li><strong>Fight gun smuggling and trafficking</strong> by increasing criminal penalties, and by enhancing the capacity of the Royal Canadian Mounted Police and the Canada Border Services Agency to combat the illegal importation of firearms.</li>\n</ul>\n\n<ul>\n\t<li><strong>Help create safer communities </strong>by supporting municipalities that ban handguns through by-laws restricting storage and transportation in their jurisdictions. Individuals who violate these municipal by-laws would be subject to federal penalties, including licence revocation and criminal sanctions.</li>\n</ul>\n\n<ul>\n\t<li><strong>Give young people the opportunities and resources</strong> they need to avoid criminal behaviour by providing funding to municipalities and Indigenous communities to support youth programs.</li>\n</ul>\n\n<ul>\n\t<li><strong>Protect Canadians from gun violence</strong> by creating new offences for altering the cartridge magazine component of a firearm and depicting violence in firearms advertising, introducing tighter restrictions on imports of ammunition, and ensuring the prohibition of imports, exports, sales, and transfers of all replica firearms.</li>\n</ul>\n\n<ul>\n\t<li><strong>Complete the prohibition of assault-style firearms</strong> to ensure these weapons cannot be legally used, transported, sold, transferred, or bequeathed by individuals in Canada. We also intend to move forward with a buyback program in the coming months to support the safe removal of these firearms from our communities.</li>\n</ul>\n\n<p>These measures are part of a broader firearms strategy to increase public safety and build upon previous legislation and policies already in place. This includes the ban on assault-style firearms, significant funding to provinces and territories to combat gun and gang violence, and investments in border security to tackle firearms smuggling.</p>\n\n<p>The Government of Canada will continue to work with Parliamentarians, provincial and territorial governments, Indigenous communities, and municipalities to do what it takes to keep our country safe from gun violence.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“One Canadian killed by gun violence is one too many. The tragedies we have seen in Ste-Foy and Portapique, and more recently in Toronto and Montréal, should never happen. This is why our government has taken some of the strongest action in our country's history against gun violence. We will continue to take steps to strengthen gun control measures, remove dangerous weapons from our streets, and make sure everyone can feel safe from violence.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Too many Canadians have been killed or injured because of gun violence, and we need to take every reasonable step to stop more Canadians from suffering the same fate. These concrete measures we’re announcing today build on actions already taken to address some of the most serious firearms safety issues and are part of our government’s detailed firearms strategy that will help make our communities safer for everyone.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, Minister of Public Safety and Emergency Preparedness</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement builds on the important measures our government has already taken to keep Canadians safe in their communities. The multi-faceted approach to gun control we are proposing combines evidence-based policies, tougher <em>Criminal Code</em> penalties, and funding for programs that address root causes that lead to criminal behavior in the first place.”</p>\n\n<footer class=\"default\">The Hon. David Lametti, Minister of Justice and Attorney General of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In order to improve the firearms classification framework, the Minister of Justice will conduct a review of firearms classification. The Minister will also look into modernizing language in the regulation and the <em>Criminal Code</em> with respect to prohibited weapons, devices, and ammunition to close gaps in the law.</li>\n\t<li>There were over 99,000 victims of intimate partner violence in Canada in 2018, and firearms were present in over 500 of these incidents. Women accounted for almost eight in 10 victims of all intimate partner violence incidents, and they were even more likely to be the victim in incidents where a firearm was present.</li>\n\t<li>In the <em>Fall Economic Statement 2020</em>, the government committed to support municipalities, community-led initiatives, and Indigenous communities by providing $250 million in dedicated funding over five years to support anti-gang programs for young people. It will complement previous investments, including funding announced in November 2017 to support provincial and territorial initiatives and combat firearms smuggling and trafficking.</li>\n\t<li>In June 2019, new legislation on firearms received Royal Assent, and many measures will come into force soon. The 2019 legislation includes practical, targeted, and measured steps to keep Canadians safe, including:\n\t<ul>\n\t\t<li>Helping ensure people with a history of violence are not granted a licence to own firearms through expanded background checks that consider the applicant’s lifetime history, not just the preceding five years.&nbsp;&nbsp;&nbsp;</li>\n\t\t<li>Helping keep firearms out of the wrong hands by requiring sellers to verify the validity of a firearms licence before selling a non-restricted firearm.</li>\n\t\t<li>Helping police trace guns used in crimes by requiring businesses to keep point-of-sale records for non-restricted firearms.</li>\n\t\t<li>Requiring authorization to transport restricted and prohibited firearms to locations other than the range (e.g. gunsmith, gun show, etc.) through strengthened transportation requirements.</li>\n\t\t<li>Safeguarding the impartial classification of firearms by putting the responsibility in the hands of technical experts, who make these determinations based on the <em>Criminal Code</em>.</li>\n\t</ul>\n\t</li>\n\t<li>A <em>Criminal Code</em> amnesty is in place until April 30, 2022, to protect lawful owners from criminal liability and to enable them to comply with the law. Under the amnesty, the newly prohibited firearms can only be transferred or transported within Canada for specific purposes.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/c21-en.aspx\">Bill C-21: <em>An Act to amend certain Acts and to make certain consequential amendments (firearms)</em></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">Prime Minister announces ban on assault-style firearms</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2019/06/royal-assent-of-legislation-strengthening-gun-laws-to-keep-communities-safe.html\">Royal Assent of legislation; strengthening gun laws to keep communities safe</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2017/11/major_new_federalfundingandsummittotacklegunviolenceandgangactiv.html\">Major new federal funding and summit to tackle gun violence and gang activity</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/fes-eea/2020/home-accueil-en.html\"><em>Fall Economic Statement 2020</em></a></li>\n</ul></div>\n      "
}