{
  "path": "/en/news/readouts/2022/06/25/prime-minister-justin-trudeau-meets-president-kenya-uhuru-kenyatta",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Kenya Uhuru Kenyatta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of Kenya, Uhuru Kenyatta, on the margins of the Commonwealth Heads of Government Meeting.</p>\n\n<p>The two leaders discussed Russia’s illegal and unjustified invasion of Ukraine. They agreed the Commonwealth countries should continue working together to uphold democracy, peace and security, and human rights.</p>\n\n<p>The Prime Minister and President expressed concern about the conflict’s impact on global food security, which is disproportionally affecting the most vulnerable in Africa and elsewhere in the Commonwealth. Prime Minister Trudeau reaffirmed Canada’s commitment to address the global food security crisis and help all people that are facing rising food prices.</p>\n\n<p>The leaders reaffirmed their shared commitment to protecting oceans and advancing initiatives to strengthen the blue economy, noting that sustainably harnessing the potential of our oceans can make life better for all. They also reaffirmed their commitment to the Commonwealth and agreed on the importance of modernizing and renewing this important institution.</p>\n\n<p>The two leaders committed to continue working to advance shared priorities for Canada and Kenya, including in the areas of trade, environmental protection, and the recovery from the ongoing impacts of the COVID-19 pandemic. They underlined their interest in deepening the trade and investment relationship between Canada and Kenya to enhance prosperity and make life better for people.</p>\n\n<p>The Prime Minister and President discussed Kenya’s upcoming election in August, after which President Kenyatta will step down from the presidency. Prime Minister Trudeau wished President Kenyatta well in his future endeavours.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_kenya.aspx?lang=eng\">Canada-Kenya relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/17/prime-minister-justin-trudeau-speaks-president-kenya-uhuru-kenyatta\">Prime Minister Justin Trudeau speaks with President of Kenya Uhuru Kenyatta</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}