{
  "path": "/en/news/statements/2020/09/21/statement-prime-minister-international-day-peace",
  "pageTitle": "Statement by the Prime Minister on International Day of Peace | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Peace:</p>\n\n<p>“Peace is the work of many generations. Today, on the&nbsp;<a href=\"https://www.un.org/en/observances/international-day-peace\">International Day of Peace</a>, we reflect on the progress made, and the work still to be done, to achieve a more peaceful, just, and sustainable future for Canada and the world.</p>\n\n<p>“This year’s theme – Shaping Peace Together – recognizes that the COVID-19 pandemic has changed the world as we know it. It reminds us that, now more than ever, we need to work together to address the challenges we face as a global community. Just like the virus, the serious and pressing issues of our time know no borders. Defeating COVID-19, tackling climate change, poverty, and inequality, and protecting human rights will require the cooperation of all countries.</p>\n\n<p>“Cooperation, understanding, and solidarity are essential to building a more peaceful world. That’s why the Government of Canada continues to engage with international partners as part of our commitment to peace, security, sustainability, and prosperity at home and abroad. Canada believes in the importance of working with our partners to fight climate change and protect our oceans, advance gender equality and women’s empowerment, support peace and security, and promote sustainable economic growth that leaves no one behind. As part of our commitment to the&nbsp;<a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">Sustainable Development Goals</a>, Canada and other United Nations (UN) Member States&nbsp;are working to protect human rights and the rule of law, and provide access to justice to help build more peaceful and inclusive societies.</p>\n\n<p>“Our country also has a long and proud history of serving in international peace operations. Over the past seven decades, Canada has participated in peacekeeping missions around the world, from Cambodia to the Balkans, and Haiti to Mali. Canada is committed to increasing the effectiveness of UN peace operations, and to preventing and responding to conflicts around the world. In 2017, we launched the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>, as well as the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>, which is working to increase the meaningful participation of uniformed women in UN peace operations. Last year, we appointed <a href=\"https://pm.gc.ca/en/news/news-releases/2019/06/12/prime-minister-names-first-ambassador-women-peace-and-security\">Canada’s first Ambassador for Women, Peace and Security</a> to advance women’s participation in conflict prevention and peacebuilding, and advise on the implementation of our second<a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/cnap_wps-pnac_fps.aspx?lang=eng\"> National Action Plan on Women, Peace and Security</a>. Today, Canada continues to play an important role in building a more peaceful and secure world, including as Chair of the UN Peacebuilding Commission for 2020.</p>\n\n<p>“Over the past few months, we have all seen attempts to use COVID-19 to encourage division. Canada will continue to stand against all forms of intolerance, racism, and discrimination. We know that our country – and our world – are stronger and more peaceful when we embrace diversity, encourage inclusion, and protect human rights.</p>\n\n<p>“As we mark the International Day of Peace, I invite all Canadians to reflect on our shared values of peace, equality, and compassion. Only together can we build a better country and a safer, more peaceful world.”</p></div>\n      "
}