{
  "path": "/en/news/news-releases/2017/09/26/prime-minister-introduces-canadas-new-top-scientist",
  "pageTitle": "Prime Minister introduces Canada’s new top scientist | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Government of Canada is committed to strengthen science in government decision-making and to support scientists’ vital work. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">In keeping with these commitments, the Prime Minister, Justin Trudeau, today announced Dr. Mona Nemer as Canada’s new Chief Science Advisor, following an open, transparent, and merit-based selection process. &nbsp;</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">We know Canadians value science. As the new Chief Science Advisor, Dr. Nemer will help promote science and its real benefits for Canadians—new knowledge, novel technologies, and advanced skills for future jobs. These breakthroughs and new opportunities form an essential part of the Government’s strategy to secure a better future for Canadian families and to grow Canada’s middle class. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">Dr. Nemer is a distinguished medical researcher whose focus has been on the heart, particularly on the mechanisms of heart failure and congenital heart diseases. In addition to publishing over 200 scholarly articles, her research has led to new diagnostic tests for heart failure and the genetics of cardiac birth defects. Dr. Nemer has spent more than ten years as the Vice-President, Research at the University of Ottawa, has served on many national and international scientific advisory boards, and is a Fellow of the Royal Society of Canada, a Member of the Order of Canada, and a Chevalier de l’Ordre du Québec.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">As Canada’s new top scientist, Dr. Nemer will provide impartial scientific advice to the Prime Minister and the Minister of Science. She will also make recommendations to help ensure that government science is fully available and accessible to the public, and that federal scientists remain free to speak about their work. Once a year, she will submit a report about the state of federal government science in Canada to the Prime Minister and the Minister of Science, which will also be made public. </span></p><h2>Quotes</h2><blockquote><p>“We have taken great strides to fulfill our promise to restore science as a pillar of government decision-making. Today, we took another big step forward by announcing Dr. Mona Nemer as our Chief Science Advisor. Dr. Nemer brings a wealth of expertise to the role. Her advice will be invaluable and inform decisions made at the highest levels. I look forward to working with her to promote a culture of scientific excellence in Canada.”<br> — <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“A respect for science and for Canada’s remarkable scientists is a core value for our government. I look forward to working with Dr. Nemer, Canada’s new Chief Science Advisor, who will provide us with the evidence we need to make decisions about what matters most to Canadians: their health and safety, their families and communities, their jobs, environment and future prosperity.”<br> — <cite>The Honourable Kirsty Duncan, Minister of Science</cite></p></blockquote><blockquote><p>“I am honoured and excited to be Canada’s Chief Science Advisor. I am very pleased to be representing Canadian science and research – work that plays a crucial role in protecting and improving the lives of people everywhere. I look forward to advising the Prime Minister and the Minister of Science and working with the science community, policy makers, and the public to make science part of government policy making.”<br> — <cite>Dr. Mona Nemer, Chief Science Advisor, Canada</cite></p></blockquote><h2><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Quick Facts</span></b></h2><ul><li><span lang=\"EN-US\" xml:lang=\"EN-US\">Dr. Nemer is also a Knight of the Order of Merit of the French Republic, and has been awarded honorary doctorates from universities in France and Finland.</span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">The Office of the Chief Science Advisor will be housed at Innovation, Science and Economic Development and supported by a secretariat.</span></li></ul><h2><b>Related Products</b></h2><ul><li><a href=\"/en/news/backgrounders/2017/09/26/chief-science-advisor\"><b>Backgrounder</b>: Chief Science Advisor</a></li><li><a href=\"/en/news/backgrounders/2017/09/26/dr-mona-nemer\"><b>Biographical notes</b>: Dr. Mona Nemer</a></li></ul></div>\n      "
}