{
  "path": "/en/news/readouts/2023/02/13/prime-minister-justin-trudeau-meets-premier-yukon-ranj-pillai",
  "pageTitle": "Prime Minister Justin Trudeau meets with Premier of the Yukon Ranj Pillai | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Premier of the Yukon, Ranj Pillai, to discuss issues of importance to Yukoners and all Canadians.</p>\n\n<p>The two leaders highlighted the significance, for the Yukon and for Canada, of the 50th anniversary of Together Today for our Children Tomorrow, a historic document that paved the way for the negotiation of the Yukon Final Agreements and Self-Government Agreements. They also reiterated their shared commitment to advancing reconciliation with Indigenous Peoples.</p>\n\n<p>The Prime Minister and the Premier reaffirmed their commitment to work together to improve the health care system and spoke about the additional federal funding announced last week, which will help deliver concrete outcomes for Yukoners and all Canadians. This includes prioritizing investments in mental health, long-term care, and community care, and promoting greater transparency and accountability on results for Canadians.</p>\n\n<p>The two leaders agreed on the importance of the partnership between the Government of Canada and Government of Yukon on other shared priorities, including support for clean energy and economic development opportunities. They recognized the importance of critical minerals for the North and Canada’s economic growth, and discussed Canada’s Critical Minerals Strategy, which the federal government released in December.</p>\n\n<p>Prime Minister Trudeau and Premier Pillai also discussed recent developments concerning the unidentified object flying over the Yukon that violated Canadian airspace last week. The Prime Minister underscored that the Government of Canada remains deeply committed to supporting the health, security, and prosperity of the Arctic while defending Canadian sovereignty and upholding regional security.</p>\n\n<p>The two leaders committed to remain in close contact and to continue working together on these important priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/13/prime-minister-justin-trudeau-speaks-premier-designate-yukon-ranj-pillai\">Prime Minister Justin Trudeau speaks with Premier-designate of the Yukon Ranj Pillai</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadas-critical-minerals-strategy.html\">Canada’s Critical Minerals Strategy</a></li>\n</ul></div>\n      "
}