{
  "path": "/en/news/readouts/2020/10/01/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the nineteenth call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>First Ministers discussed the recent and significant increase in cases, highlighting that parts of the country are particularly affected. The Prime Minister updated premiers on the federal support available to provinces and territories regarding contact tracing, testing, the procurement of personal protective equipment, and outbreak management. He also highlighted the progress being made on new rapid testing solutions, and the pre-ordering of multiple candidate vaccines to protect Canadians and save lives. &nbsp;</p>\n\n<p>The Prime Minister thanked the jurisdictions who have adopted the national exposure notification app, COVID Alert, and recognized that more will soon be adopting this important tool in an effort to keep Canadians safe across the country.</p>\n\n<p>Building on the strong collaboration established over the spring and summer, First Ministers reiterated their support for the Team Canada approach, agreeing to continue to work together at this critical point in the pandemic. The Prime Minister also updated premiers on international border measures, noting the importance of data collection to inform future decision-making.</p>\n\n<p>The Prime Minister updated premiers on the Government of Canada’s fall agenda set out in the Speech from the Throne and reiterated his commitment to hold a meeting with First Ministers&nbsp;to discuss health transfers. &nbsp;</p>\n\n<p>All First Ministers reiterated the need to continue closely coordinating their efforts to minimize the impacts of an increase in cases of COVID-19 and in supporting economic recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/25/new-agreements-secure-additional-vaccine-candidates-covid-19\">New agreements to secure additional vaccine candidates for COVID-19</a></li>\n</ul></div>\n      "
}