{
  "path": "/en/news/readouts/2022/04/05/prime-minister-justin-trudeau-speaks-president-mexico-andres-manuel-lopez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Mexico Andrés Manuel López Obrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Mexico, Andrés Manuel López Obrador, about the ongoing conflict in Ukraine and the warm bilateral relations between Canada and Mexico.</p>\n\n<p>The two leaders shared their concerns about the humanitarian impact of the war, including the growing number of internally displaced persons and refugees fleeing from Ukraine. They also expressed concerns about global challenges related to the war, including those related to energy and food security.</p>\n\n<p>The Prime Minister invited the President to participate in the “Stand Up for Ukraine” campaign pledging event&nbsp;on April 9, which he is co-convening with the President of the European Commission, Ursula von der Leyen,&nbsp;to raise funds for Ukrainian refugees and internally displaced people. The Prime Minister and the President discussed the importance of ongoing work at the United Nations, where Mexico plays an important role as a non-permanent member of the United Nations Security Council.</p>\n\n<p>The Prime Minister and the President took note of the progress made bilaterally further to discussions at the November 2021 North American Leaders’ Summit. The leaders discussed the mutually important bilateral economic relationship between their two countries, anchored in the Canada-United States-Mexico Agreement. They discussed the important contributions Canadian investors make to the Mexican economy, including in the energy sector. They agreed to continue working together to counter climate change.</p>\n\n<p>The two leaders looked forward to speaking again on shared priorities in the coming months.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/26/stand-ukraine-european-commission-and-government-canada-team-global\">Stand Up For Ukraine: European Commission and Government of Canada team up with Global Citizen to mobilize support for refugees</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement (CUSMA)</a></li>\n</ul></div>\n      "
}