{
  "path": "/en/news/statements/2020/10/22/statement-prime-minister-anniversary-attack-national-war-memorial-and",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the attack at the National War Memorial and Parliament Hill | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the sixth anniversary of the attack at the National War Memorial and Parliament Hill:</p>\n\n<p>“Six years ago today, Canadians across the country were shocked and saddened by the terrorist attack at the National War Memorial and Parliament Hill in Ottawa that claimed the life of Corporal Nathan Cirillo, a sentry guarding the Tomb of the Unknown Soldier, and left several others injured.</p>\n\n<p>“On this solemn anniversary, I join Canadians to remember and pay tribute to Corporal Cirillo and to Warrant Officer Patrice Vincent, who was killed two days earlier in a separate attack in Saint-Jean-sur-Richelieu, Quebec. We offer our deepest sympathy to their families and friends.</p>\n\n<p>“We also salute the courage of the first responders who put their lives in danger on that dark day to keep Canadians safe. We remember the selflessness and compassion of everyone who acted quickly to aid the victims.</p>\n\n<p>“These attacks on our democracy and on our service members sought to create panic, divide Canadians, and weaken our country. Instead, they united us, and strengthened our resolve to counter hate by promoting the values of freedom, diversity, and inclusion that define us as Canadians.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to take a moment today to mourn these two members of the Canadian Armed Forces. I also invite you to join me in thanking our service members and all those who work hard every day to keep us, our communities, and our country safe and free.”</p></div>\n      "
}