{
  "path": "/en/news/statements/2020/10/01/statement-prime-minister-womens-history-month",
  "pageTitle": "Statement by the Prime Minister on Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for Women’s History Month:</p>\n\n<p>“Women have contributed enormously to making Canada the country we know today. During <a href=\"https://cfc-swc.gc.ca/commemoration/whm-mhf/index-en.html\">Women’s History Month</a>, we celebrate the significant achievements of women and girls, but also reflect on the work still to be done so that they can all reach their full potential.</p>\n\n<p>“This year’s theme – Because of You – honours the trailblazers, activists, and advocates who work to advance gender equality and the well-being of women and girls, in all their diversity, here in Canada and around the world. Despite hurdles and barriers to equal pay and leadership opportunities as well as experiences of violence and discrimination, women have continued to push for change and to make advances for the benefit of everyone in society.</p>\n\n<p>“From journalists like Carrie Best, we learn to raise our voices against discrimination. Through artists like Kenojuak Ashevak, we witness how to express ourselves and our cultures. Thanks to politicans like Thérèse Casgrain, we see how to fight for equal rights. And by watching astronauts like Roberta Bondar, we have the courage to reach new heights. Women like these continue to inspire others to follow in their footsteps.</p>\n\n<p>“Over the past few months, women – and in particular low-income women – have been hit hardest by the global COVID-19 pandemic. Many have served bravely on the frontlines, risking their health to provide essential care and services to Canadians. Women’s participation in the workforce has also fallen sharply as they have faced job losses, reduced hours of work, and at times no option other than to stay home to care for their families. Some have called it a ‘she-cession.’ The pandemic has highlighted and deepened the inequalities and injustices that exist for women in our society. We know that it will take hard work to fix these gaps, which threaten to get worse without decisive action. Now more than ever, we need to make sure that women are supported so that we don’t lose the progress we have made in recent years.</p>\n\n<p>“We are deeply committed to building a fairer, more inclusive country. That’s why the Government of Canada is taking action to help women through the pandemic and to advance their economic empowerment. In May, we announced $15 million in funding to support women entrepreneurs through the <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a>, and we are committed to accelerating this strategy. We will continue to take steps to advance equality by addressing the gender wage gap, working to end gender-based violence, and making a significant, long-term, and sustained investment to create a Canada-wide early learning and child care system. The government will also create an Action Plan for Women in the Economy to help more women return to the workforce as we recover from the pandemic.</p>\n\n<p>“On the international stage, Canada continues to be a leader for gender equality and the empowerment of women and girls. In 2017, we launched our first <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a> with the goal of ensuring that, by 2021-22, at least 95 per cent of Canada’s international development assistance will be devoted to initiatives that improve the lives of women and girls. Last year, the Government of Canada also made a <a href=\"https://pm.gc.ca/en/news/news-releases/2019/06/04/government-canada-makes-historic-investment-promote-health-and-rights\">historic investment</a> to support women and girls’ health, including their sexual and reproductive health rights, around the world.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I encourage all Canadians to take time this month to learn more about our history, and to honour the women who have helped shape – and who continue to shape – Canada into a fairer, more diverse, and more prosperous country through their achievements and desire to make a difference.”</p></div>\n      "
}