{
  "path": "/en/news/news-releases/2019/04/03/inuit-kanataup-kavamakungit-pinasuaqatigiigutimiknut-katimajiralaat",
  "pageTitle": "Inuit-Kanataup Kavamakungit Pinasuaqatigiigutimiknut Katimajiralaat tusaqtitivut Kanatami Inuit ikluksanginut aaqiksimajutiksait ammalu kayusijumik tamanna pivaliatiatuq tamainik sivuliqpautitariaqaqtamiknit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kanataup Sivuliuqtinga Justin Trudeau, Angajuqaaq Natan Obed taapkunangat Inuit Tapiriit Kanatami, Kanataup Ministangit, ammalu Inuit sivuliuqtit ublumi katimaqaujut taapkua Inuit-Kanataup Kavamakungit Pinasuaqatigiigutimiknut Katimajiralaat qimirualautangit pivalianirijatik ammalu aaqiksuqlautangit sivuliqpautitariaqaqtut pingjugiliqtangani taapkua katimajiralat katimagamik</p>\n\n<p>Taikani katimalutik, Kanataup Sivuliuqtinga ammalu Katimajiralaat katimajingit uqausiqalauqtut pimmariujunik pivaliatiaqsimajamiknik aqqaaninit. Ukua kajusititauttiaqsimajut ilagijauvut:</p>\n\n<ul>\n\t<li>Una tusagaksaq saqitiqatigiikniginik Inuit Nunangat Iklulirijutauniaqtunik aaqiksimajutiksaq, Taapna ikajuqniaqtuq piusivaalirutiksanut iklunut nanituinnaq Inuit nunangani kanatami, ammalu saqqittilutik Inuknit-ingiratitauniaqtuq ikluliriniqmut aaqigutiuniaqtuq pisimajuq Inuit inuusiginut, piusituganginut, ammalu atuqpaktatuqanginut.</li>\n\t<li>Una atuliqtitauvuq angiqtauvuq&nbsp;<a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\" tabindex=\"107\">Inuit Puvakluguniiqtitaulutik qanuiliurutauniaqtut&nbsp;</a>–Ammalu katujilutik angiqsimajut nugutitautiammarikluni pivaklukniq Inuknut tikiutilaunginigani 2030.</li>\n\t<li>Ukua taapkunanga saqitaulutik&nbsp;<a href=\"https://www.canada.ca/en/employment-social-development/programs/indigenous-early-learning/2018-framework.html\" tabindex=\"108\">Nunaqaqqaaqsimajut Iliniaqnialisaaqtut ammalu Pairiviliriniq Qanuiliuqviuniaqtut,&nbsp;</a>ukualu ikajuqniaqtut Inuknik nutaqanik ammalu inuusuktunik aturunaqlutik pairiviknik ammalu iliniaqlutik kajusittiaqniaqmata inuusiqmikni.</li>\n</ul>\n\n<p>Aqqaaninit, Kanataup Kavamakkungit ammau Inuit Tapiriit Kanatami pimmariujunik pigiaqtitisimajut saimaqatigiikniqmut, ilagijaulutik Kanataup Kavamakkut mamialautut Ahiarmiut Inuit nuutaulauqsimakmata nunagikitamiknut; Kanataup Sivuliuqtinga mamialauqtuq kigaqtuqlugit Kanataup Kavamakungit aulatijutaulauqtunut puvaklutut aituqliujunaqtunik inulimaanut 1940-ni tikilugu 1960-nun; ammalu pigiaqtitauniga Nanilavut igirasititausimajuq ikajuqniaqmat inuknik ilamiknik asiujisimajut nakligijamiknik.</p>\n\n<p>Ammaluttauq, Katimajiralaat saqittilauqtut sivulliqpaaq piliriariniaqtamiknut sananiaqtamiknut paqnauti aulutilugit avatiliriniqmut ammalu silaup uquusivalianiganut asitjiqtut, ammalu sapimiriarutiksait imavikmik, ilagijauluni atiliuqtauluni Pikialasorsuaq Katujiwatigiit sivuliuqtiujut uqaqsimajangit. Tamauna uqaqsimanigitigut, Kanataup Kavanakkungit ammalu Inuit sivuliuqtiujut angiqsimatiaqtut sanaqatigiiklutik pinasuaqatigiikliutik, ammalu kavamakkutgit Denmark ammalu Greenland, sapumilugu Pikialasorsuaq – sikuqaqpangituq avalusimayaujuq sikunut uaknanga Sannirutiup Imanga, avataani Nunavut ammalu Greenland.</p>\n\n<p>Ukua Katimajiralaat pigiarumajut sanalutik saqitilutik nutaanik aulutigunaqtamiknik pigajugiliqtanganut ukiungat, ilagijaulutik kajusijumik uqausirilugit nappariaqaqtunik iqpaqsimajut Inuit Nunanganni.</p>\n\n<p>Ukua Inuit-Kanataup Kavamakungit Pinasuaqatigiigutimiknut Katimajiralaat malikniaqtut angiqsimajamiknik nutaanguriaqtolugu Inuit-Kanataup Kavamakungit ilagiigusigit ammalu saimaqatigiikniq malikluni ilisaqsisimaluni pijunautiqaqniginik, ik[igusutiaqniqmik, ikajuqatigiikniqmik, ammalu pinasuaqatigiikniqmik.</p>\n\n<h2>Uqaqtaujut</h2>\n\n<blockquote>\n<p>“Taimanganit 2017, Inuit sivuliuqtit ammalu Kavamatuqaqkut Ministangit sanaqatigiiginnaqtut nutaanguriaqtilugit Inuit-Kanataup Kavamakkugit ilagiigusigit, pivaaqliqtilugu saimaqatigiikniq, ammalu ajuqsaruniittiaqlutik tamaqmik Inuit. Angiqsimatiaqtugut nanisiluta nunaliknit-pigiyajunik, nunaliknit-ingiratitaujunik aaqgutiksanik, taapsutunaq nutaaq ikluksaniut aaqiksimajutiksaq, ukualu sanyausimajariitut inuknit pinasuaqatigilugit Kavamakkut, ammalu tuniyauniaqtut Inuknit. Katujiluta, pinasuaqatigiikluta aaqiksuilauqta piuniqsamik sivuniksaqaqtitauqulugit nunaliit nanituinnaq Inuit Nunanganni, ammalu tamaqmik Kanatamiunut.”</p>\n\n<footer class=\"default\">Justin Trudeau, Sivuliuqtinga Kanata</footer>\n</blockquote>\n\n<blockquote>\n<p>“Atuutiqaqtunik ikluksaqarunaqniaqmata tamanna tungavilariujuq Inuit aaniaqaqtailititiniganut ammalu qanuingitialitunaqniginut. Ukua ikajuqatigiit Kavamatuqaqkut ammalu Kanatami Inuit ikluliriniqmut aaqiksimajutiksat pigiatitaujuq ublumi qiniqtut piusivaaliquligit ikluqutigit nanituinnaq Inuit Nunanganni ammalu aaqiutittiaqniaqmata anginiqsaujumik Inuit immigut-makitajunaqniqsaulutik ammalu aulatijunaqsilitik.”</p>\n\n<footer class=\"default\">Angajuqaangat Natan Obed, Inuit Tapiriit Kanatami</footer>\n</blockquote>\n\n<h2>Sulijut taapkuniga Pisimajut</h2>\n\n<ul>\n\t<li>Asingit kajusittiaqsimajut taimanganit piqataa aqqaaguani Katimajiralaanit ukua ilagiyaujut:\n\t<ul>\n\t\t<li>Pigiaqtitauniga<a href=\"https://www.canada.ca/en/indigenous-services-canada/services/first-nations-inuit-health/supporting-inuit-children.html\" tabindex=\"109\">Nutaraq Sivuliutitauluni igirasititausimajuq</a></li>\n\t\t<li>Saqiauniga<a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2018/12/government-of-canada-announces-improvements-to-nutrition-north-canada-including-support-for-country-food.html\" tabindex=\"110\">Inuit-Kavamatuqaqkut niqiksaqaqtitiniqmut sanaqatigiit Katimajit</a></li>\n\t\t<li>Kajusijuq sanayauniga nutaaq<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1499951681722/1537884604444\" tabindex=\"111\">Ukiuqtaqtuq ammalu ukiuqtaqtuanni atuagaksaq qanuiliurutauniaqtuq avaliksanga</a></li>\n\t\t<li>Atuliqtitaulutik angiqtaulutik tiliyausimajutiksangit qinirunaqviqaqlutik piliriaksanut Inuit ilinialisaaqtut tikilugu ilinarutiliit 12-mik.</li>\n\t</ul>\n\t</li>\n\t<li>Ukua Inuit-Kanataup Kavamakungit Pinasuaqatigiigutimiknut Katimajiralaat saqitaulauqtut February 2017 atiliuqtaulutit Inuit Nunangat Sulinirauti pilugit Inuit-Kanataup Kavamakungit Pinasuaqatigiigutimiknut. Naniyaujuq tungajutauluni ukua atjigiimik pinasuaqatiikniaqmata avataani Inuit ammalu Kanataup Kavamakkungit atuutiqammariktuq saimaqatigiikpalianiqmut.</li>\n\t<li>Ukua Katimajiralaat iksivautaqaqniatut Kanataup Sivuliuqtinganik ammalu angjuqaanganik Inuit Tapiriit Kanatami. Ilagiyaujut taapkua Kavamatuqaqkut Ministangit ammalu niruaqtausimajut Nunatsiaqvut Kavamakkut, Nunavut Tunngavik Timminga, Inuvialuit Nunanganni Corporation, ammalu Makivik Corporation.</li>\n\t<li>Ukua Katimajiralaat ilaqaqtut naalagiaqtuqsimajut angajuqaangit Kanatami Inuit Makkuktut Katimajingit, Pauktiitut Inuit Aqnait Kanatami, ammalu Inuit Nunaqjuaqmi Katimajut Kanata.</li>\n\t<li>Pikialasorsuaq, taijausuuqtauq Ukiuqtaqtuq Aukkaqnit, nunaqjuaqmi pivaliatitiniqpaujuq imavingmi uumajulimaanik avatilimaaginiklu – ikajuqtuq amisunik puijinik, ilagiyaujut tuugaaliit qilalugait, aiviq, nattiit, ammalu nanuit, ammalu tariuq tingmiagit ammalu qanuritutuinnait iqaluit.</li>\n\t<li>Ukunani uqaqsimayuq&nbsp;<a href=\"https://changingclimate.ca/CCCR2019\" tabindex=\"112\">Kanataup asitjiqtitiniga silaup ukuuqniganut asitjiqtunut unikaaq,</a>tamaqmik kigumnitini ammalu sivuniksatini ukuusivalianiga Kanata, qanilaaq, maqqruiluaqtuq nunaqjuaqmi sukalinigata.</li>\n</ul>\n\n<h2>Tamakuniga uqausiqaqmijut Ikiaqivik</h2>\n\n<ul>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1554302528267\" tabindex=\"113\">Inuit Nunangat Ikluliriniqmut Aaqiksimajutiksaq</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/04/03/pikialasorsuaq-leaders-statement\" tabindex=\"114\">Pikialasorsuaq&nbsp;Katujuqatigiit Sivuliuqtit Uqausingit</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\" tabindex=\"115\">Inuit Nunangat Sulinirauti Inuit-Kanataup Kavamakkungit Pinasuaqatigiikniganut</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce-inuit-crown\" tabindex=\"116\">Kanataup Sivuliuqtinga ammalu Angajuqaangat Inuit Tapiriit Kanatami tusaqtitijut Inuit-Kanatup Kavamakkungit Pinasuaqatigiigutimiknut Katimajiralaat</a></li>\n\t<li><a href=\"https://www.itk.ca/icpc-housing-pm/\" tabindex=\"117\">Inuit-Kanataup Kavamakkungit Pinasuaqatigiigutimiknut Katimajiralaat tusaqtitilauqtut Kanatami Inuit iklusanginik aaqiksimajutik pigajungani agaaguani katimagamik Kanataup Sivuliuqtingalu.</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2019/01/canada-advances-reconciliation-with-historic-apology-to-the-ahiarmiut.html\" tabindex=\"118\">Kanata pivaaliqtitanga saimaqaitiikniq immakalanit mamiavujariaqaqsimajut Ahiarmiut</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/03/08/prime-minister-delivers-apology-inuit-federal-governments-management-tuberculosis\" tabindex=\"119\">Kanataup Sivuliuqtinga mmiatuq Inuknut Kavamatuqaqkut aulatijusirilauqtanginik puvakluktunut aituqluijunaqniganut taikani 1940-nit 1960-nut</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\" tabindex=\"120\">Puvaklukniq nugutitauluni qanuiliurutauniqtuq saqitausimavuq tusagaksaq</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1552059698863/1552059725063\" tabindex=\"121\">Una Nanilavut Igirasititaujuq</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/plan/chap-03-en.html#Supporting-Inuit-Priorities\" tabindex=\"122\">Kiinaujaqtuutiksaq 2019 – Ikajuqtuq Inuit Sivuliutiyariaqaqtanginut.</a></li>\n</ul></div>\n      "
}