{
  "path": "/en/news/statements/2021/01/24/statement-prime-minister-world-day-african-and-afrodescendant-culture",
  "pageTitle": "Statement by the Prime Minister on World Day for African and Afrodescendant Culture | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today issued the following statement on the World Day for African and Afrodescendant Culture:</p>\n\n<p>“Today, on the <a href=\"https://en.unesco.org/commemorations/africanafrodescendantculture\">World Day for African and Afrodescendant Culture</a>, we celebrate the many vibrant cultures of Africans and African diasporas around the world. It is also a time to recognize and promote African cultures as a catalyst for dialogue, sustainable development, growth, prosperity, and peace.</p>\n\n<p>“African and Afrodescendant culture is rich and diverse. Throughout history, people of African descent have made profound economic, political, social, cultural, and spiritual contributions to Canada and the world. While this is something to celebrate, the recognition of and appreciation for African and Afro-descendent heritage and cultures have been very limited. As an integral part of the world’s shared heritage, it is important that we preserve African and Afro-descendent culture, and continue to nurture cultural diversity.</p>\n\n<p>“In Canada, we are committed to building a more inclusive and equal country. That is why the Government of Canada officially recognizes the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy/international-decade-african-descent.html\">International Decade for People of African Descent</a>. The Decade is an opportunity to highlight the important contributions people of African descent have made in Canada and around the world. It also provides a framework for state and non-state actors to take measures toward recognition, justice, and development to fight racism, discrimination, and the ongoing inequalities faced by Canadians of African descent.</p>\n\n<p>“In recognition of this important milestone, we continue to support projects aimed at celebrating, sharing knowledge, and capacity building in Canada’s vibrant Black Canadian communities. These investments will also help communities create the first national institute for Black Canadians, which will work to advance initiatives that affect Black Canadians at a systemic level. We’re also working to empower Black Canadian youth through local community-led projects that are combatting discrimination, providing opportunity and empowerment through the promotion of Black history and culture, and helping develop leadership skills and civic engagement.</p>\n\n<p>“Last fall, we announced Canada’s first-ever Black Entrepreneurship Program to help thousands of Black business owners and entrepreneurs across the country respond to the global COVID-19 pandemic and grow their businesses. This year, we have launched a pilot program to open bidding opportunities for Black owned and operated businesses, and are examining greater opportunities for supplier diversity across the government. We are also helping drive economic growth and investment, as well as contribute to poverty reduction in Africa, by supporting the African Continental Free Trade Area through the African Trade Policy Centre of the United Nations Economic Commission for Africa.</p>\n\n<p>“While progress has been made, much more remains to be done to address the systemic issues across the country. That is why, through <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a>, we will continue to fight racism and eliminate inequities by empowering communities, building awareness, and changing attitudes. We will take concrete action to combat anti-Black racism, along with all forms of racism, racial discrimination, xenophobia, and intolerance.</p>\n\n<p>“Canada has been a consistent and strong voice for protecting human rights and advancing democratic values on the global stage. We support the African Union’s vision of finding African-led solutions to address political, economic, and developmental challenges facing the continent. Canada will continue to work with our many African partners to advance shared priorities and to build a better future for Canadians and Africans alike.</p>\n\n<p>“Today, I invite all Canadians to take part in virtual events commemorating the World Day for African and Afrodescendant Culture. I also encourage all Canadians to reflect on how we can build a safer, fairer, and more equal world for everyone.”</p></div>\n      "
}