{
  "path": "/en/news/news-releases/2020/02/13/prime-minister-concludes-productive-visit-senegal",
  "pageTitle": "Prime Minister concludes productive visit to Senegal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Senegal. The visit focused on deepening our two countries’ already strong ties through trade and investment, and advancing shared priorities like democracy and governance, gender equality, and fighting climate change.</p>\n\n<p>Both Canada and Senegal will benefit from a stronger relationship. Senegal’s young and growing population, and economic leadership in the region, makes them a natural partner to create more jobs and open new business markets for Canadians.</p>\n\n<p>During the visit, Prime Minister Trudeau met with the President of Senegal, Macky Sall. The Prime Minister commended the country’s Plan Sénégal Émergent, a plan focused on economic and social transformation. The two leaders talked about ways to further strengthen trade and investment between our two countries, and the importance of educational and economic opportunities for young people. They also reaffirmed their commitment to La Francophonie, and the promotion of the French language.</p>\n\n<p>The Prime Minister also visited Gorée Island, a major historical transit point for the transatlantic slave trade. He marked Black History Month with a tribute to African Canadians and their contributions in the building of Canada, including Richard Pierpoint, who left Senegal as a slave in 1760 and later played an important role in the War of 1812.&nbsp;&nbsp;&nbsp;</p>\n\n<p>To help increase commercial ties between our two countries, the Prime Minister met with Senegalese and Canadian business leaders to explore new opportunities for trade. The Prime Minister took the opportunity to highlight Canada’s leadership in clean technology, renewable energy, and responsible business practices. Growing our two countries’ partnership will benefit Canadian businesses and grow Canada’s economy.</p>\n\n<p>The Prime Minister also attended the official opening of the International Development Research Centre’s new regional office in Dakar, where he emphasized Canada’s support for innovative research. He met with students and young research professionals whose projects focus on the reproductive health of young people, economic empowerment of women, advancement of technology, and resiliency to climate change. These are pressing issues Canada is working to advance, at home and abroad.</p>\n\n<p>To advance gender equality, the Prime Minister announced funding to promote sexual and reproductive health, combat genital mutilation and forced marriage, and provide better educational opportunities for adolescent girls in Senegal. He also continued to advocate for the advancement of human rights for all people across the continent and around the world. Later, the Prime Minister met with women peacekeepers, and highlighted Canada’s commitment to working with Senegal through the Elsie Initiative for Women in Peace Operations.</p>\n\n<p>Canada will also provide support for income-generating activities for vulnerable and marginalized women. This will help 1,000 women working in promising sectors of the economy, and will mobilize 200,000 people to support women become leaders and active citizens in their communities.</p>\n\n<p>To promote the power of sport for young people, particularly women and girls, the Prime Minister attended a basketball event that celebrated youth leadership and the upcoming 2022 Dakar Summer Youth Olympics. The 2022 Games will be the first Olympic Games held in Africa, and the first with an equal representation of male and female athletes in each sport and event. Canada and Senegal have agreed to work together to help our young people train for the Games.</p>\n\n<p>At an address at Dakar’s Cheikh Anta Diop University, Prime Minister Trudeau recognized young people as key drivers of innovation and economic growth. He welcomed the important role they play as advocates for strong action against climate change, the greatest global threat of our time. He also highlighted how Canada and Senegal are natural partners, and how opportunities are available to our countries, and other African nations, if we work together as equal partners to build a better future. He stressed that to move forward, we must empower the next generation of leaders, in particular girls, to be agents of change.</p>\n\n<p>Finally, the Prime Minister visited a project funded by the Government of Canada, which helped introduce more efficient and environmentally friendly farming techniques to the region. The project also helped increase revenue for farmers. Canada will continue to support small-scale producers and farmers, particularly women, in Senegal as they work to increase their resilience to climate change.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With shared priorities like growing our economies, combatting climate change, advancing gender equality, and strengthening democracy, Canada and Senegal are natural partners. We will continue to work closely to address the issues that matter most to Canadians and Africans, and together we will create a path forward and empower the next generation of leaders.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and Senegal established diplomatic relations in 1962. Our two countries cooperate to advance peace and security in the region, and are both active members of La Francophonie, a group of states and governments from five continents sharing French as a common language.</li>\n\t<li>In 2019, trade between Canada and Senegal totaled $ 82.2 million. Canada’s commercial involvement in Senegal shows significant potential for growth, including in the mining, agriculture, oil and gas, and clean energy sectors.</li>\n\t<li>The International Development Research Centre’s head office is located in Ottawa, Canada. It also has five regional offices located in Montevideo, Uruguay; Nairobi, Kenya; Dakar, Senegal; Amman, Jordan; and New Delhi, India.</li>\n\t<li>The Memorandum of Understanding between the Canadian and Senegalese Olympic Committees covers the exchange of trainers, and a contribution of equipment by Canada to help Senegal deliver the 2022 Dakar Summer Youth Olympics. By supporting athlete training camps in both countries, it will also help Canadian and Senegalese young people prepare for the Games.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/02/13/canada-working-partners-senegal-advance-shared-priorities\">Canada working with partners in Senegal to advance shared priorities</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/senegal/bilateral_relations_bilaterales/canada_senegal.aspx?lang=eng\">Canada-Senegal relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada-La Francophonie</a></li>\n\t<li><a href=\"https://www.idrc.ca/en/about-idrc\">The International Development Research Centre</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month/transcript-black-soldiers-fight-canada.html\">Video – The Contribution of Black Soldiers in the Fight for Canada</a></li>\n</ul></div>\n      "
}