{
  "path": "/en/news/readouts/2023/05/01/prime-minister-justin-trudeau-speaks-president-djibouti-ismail-omar",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of Djibouti, Ismaïl Omar Guelleh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Djibouti, Ismaïl Omar Guelleh, about the situation in Sudan.</p>\n\n<p>Prime Minister Trudeau expressed deep concern about the conflict in Sudan and its impact on the humanitarian situation and the stability of the region, as well as on the transition to a civilian government in Sudan.</p>\n\n<p>The Prime Minister thanked President Guelleh for Djibouti’s exceptional support for Canada’s evacuation operations. He also commended Djibouti for its demonstrated willingness to participate in the resolution of the conflict.</p>\n\n<p>The two leaders discussed ongoing mediation efforts. Prime Minister Trudeau reiterated Canada’s support for regional mediation efforts, including those undertaken by the Intergovernmental Authority on Development (IGAD). He offered Canada’s support in the search for a peaceful solution to the conflict.</p>\n\n<p>The Prime Minister and the President discussed&nbsp;the close ties and friendship between Canadians and Djiboutians. They both noted the potential for developing bilateral relations between Canada and Djibouti.</p>\n\n<h2>Related links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/djibouti/relations.aspx?lang=eng\">Canada-Djibouti Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/sudan-soudan.aspx?lang=eng\">Canada’s response to the crisis in Sudan</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n</ul></div>\n      "
}