{
  "path": "/en/news/statements/2023/01/24/statement-prime-minister-world-day-african-and-afrodescendant-culture",
  "pageTitle": "Statement by the Prime Minister on World Day for African and Afrodescendant Culture | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the World Day for African and Afrodescendant Culture:</p>\n\n<p>\"Today, on the <a href=\"https://www.unesco.org/en/days/african-culture\">World Day for African and Afrodescendant Culture</a>, we honour and celebrate the diverse and vibrant cultures of the African continent and the African diaspora around the world.</p>\n\n<p>\"People of African descent have shaped all aspects of life in Canada – contributing to our political, economic, scientific, and social fabric. In science, they have made significant contributions that changed our understanding of the world. In art, they have drawn from their roots to create music, write poetry, and tell stories. And in the political realm, members of the Black and Afrodescendant communities are leaders in the advancement of human rights, equity, and justice.</p>\n\n<p>\"In 2018, the Government of Canada adopted the United Nations’ International Decade for People of African Descent to guide federal and international action to advance the economic, social, cultural, civil, and political rights of people of African descent. The Decade, which spans from 2015 to 2024, focuses on the themes of recognition, justice and development. We reaffirm our commitment to a whole-of-government approach to promote and strengthen human rights protections for people of African descent, including by developing policies and programs to ensure equality before the law, eradicate poverty and social exclusion, promote economic well-being and tackle systemic anti-Black racism, discrimination and xenophobia in public and private institutions. We also remain committed to working with African nations to advance the objectives of the Decade and to bolster economic, social, and cultural cooperation across the continent.</p>\n\n<p>“We still have work to do to achieve equality and equality of opportunity. As Canadians, we must continue to fight against anti-Black racism, prejudice, and build a world free of hate and discrimination. The Government of Canada supports Black and Afrodescendant communities across the country through programs like the <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a>, which supports Black Canadian business owners and entrepreneurs to grow their businesses and empower them to succeed. The Black-led Philanthropic Endowment Fund is dedicated to supporting Black-led, Black-focused, and Black-serving charities and social purpose organizations. Lastly, as part of the renewal of Canada’s Anti-Racism Strategy, we will take concrete steps to fight systemic anti-Black racism and hate crimes and incidents targeting Black and Afrodescendant communities in Canada.</p>\n\n<p>\"Today, on the World Day for African and Afrodescendant Culture, we reflect on the progress we have made – and the work that remains – to celebrate Afrodescendant cultures and end all forms of hate and discrimination here in Canada. I welcome all Canadians to learn more about the richness of these many cultures by engaging in activities celebrating World Day for African and Afrodescendant Culture.\"</p></div>\n      "
}