{
  "path": "/en/news/news-releases/2019/04/10/prime-minister-welcomes-twenty-sixth-annual-report-public-service",
  "pageTitle": "Prime Minister welcomes the Twenty-Sixth Annual Report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Twenty-Sixth Annual Report on the Public Service of Canada from the Clerk of the Privy Council and Head of the Federal Public Service.</p>\n\n<p>The report shares stories of the many public servants whose hard work and dedication make our Public Service among the best in the world. These stories show how public servants make a real difference in the lives of Canadians – from advancing more open, transparent, and evidence-based decision-making, to finding better ways to deliver the services we all rely on.</p>\n\n<p>The report also deals candidly with challenges facing the Public Service, including findings of harassment and discrimination, and slow progress in stabilizing the Phoenix pay system. The Government of Canada is working to make sure every employee gets the pay they are owed, and recognizes the tireless efforts of public servants to resolve pay issues as quickly as possible. &nbsp;</p>\n\n<p>The report sets the stage for ongoing dialogue and discussion that will lead to continued renewal and improvement in the years to come. It outlines a new framework – Beyond2020 – that lays out a vision for a Public Service that is more agile, more inclusive, and better equipped to deliver real results for Canadians.<strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>“Canada’s Public Service is recognized as among the best in the world. I encourage Canadians to learn more about the talent, professionalism, and dedication of our hard-working public servants. I look forward to working with the Public Service to better tackle today’s challenges so we can meet the changing needs of Canadians now and in the future.”\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada first introduced the Annual Report to the Prime Minister on the Public Service of Canada in 1992 – a requirement under section&nbsp;127 of the <em>Public Service Employment Act</em>.</li>\n\t<li>Canada’s civil service has been ranked as the most <a href=\"https://ottawacitizen.com/news/local-news/canadas-civil-service-is-worlds-most-effective-uk-report\">effective in the world by researchers from Oxford University and the Institute for Government.&nbsp; </a>&nbsp;</li>\n\t<li>The Public Service of Canada is the country’s largest employer, with more than 270,000 employees in more than 300 distinct organizations.</li>\n\t<li>Beyond2020 is a framework for public service renewal that focuses on adopting the mindsets and behaviours that will contribute to making the Public Service more agile, more inclusive, and better equipped.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/corporate/clerk/publications/26-annual-report.html\">Twenty-Sixth Annual Report on the Public Service of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/services/blueprint-2020/beyond-2020.html\">Beyond2020</a></li>\n</ul></div>\n      "
}