{
  "path": "/en/news/statements/2021/02/12/statement-prime-minister-international-day-against-use-child-soldiers",
  "pageTitle": "Statement by the Prime Minister on the International Day Against the Use of Child Soldiers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against the Use of Child Soldiers, also known as Red Hand Day:</p>\n\n<p>“Children have the right to grow up in a safe environment, to access basic care, to pursue an education, and – above all – to be children. Taking them away from their families and putting them on the front lines of conflict robs them of these fundamental rights.</p>\n\n<p>“Whether they are trained to fight, armed with deadly weapons, used as spies, sexually exploited, or forced into marriage, child soldiers face unimaginable violence and abuse, and suffer long-lasting, scarring effects. These horrible practices must stop.</p>\n\n<p>“That is why, every year on this day, we reaffirm our long-standing commitment to help end the recruitment and use of children in armed conflicts. Since 2017, Canada has mobilized close to 100 countries to endorse the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>. These commitments, which were developed in partnership with the Dallaire Institute for Children, Peace and Security, the United Nations, UN Member States, and other organizations, help protect children through education, training, and prevention.</p>\n\n<p>“No child should bear the brunt of conflict and be forced to participate in acts of violence. Canada will continue to be an unwavering advocate against the use of child soldiers and to bring countries together to endorse and implement the Vancouver Principles. Children have the right to be children, away from the atrocities of war.”</p></div>\n      "
}