{
  "path": "/en/news/news-releases/2021/11/18/prime-minister-concludes-productive-north-american-leaders-summit",
  "pageTitle": "Prime Minister concludes productive North American Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a productive two-day visit to Washington, D.C., where he reinforced the importance of strengthening the relationships with his North American counterparts, and advocated for Canadian priorities that will create middle class jobs and economic growth for everyone.</p>\n\n<p>While in Washington, the Prime Minister participated in the North American Leaders’ Summit with the President of the United States of America, Joe Biden, and the President of Mexico, Andrés Manuel López Obrador. At the Summit, the leaders spoke about shared priorities, including finishing the fight against COVID-19, getting the job done on vaccines, taking strong climate action, and building an economic recovery that creates new jobs and middle class growth. They agreed to work together to strengthen medical supply chains and advocate for increased global vaccine distribution, support a North American transition to zero-emission vehicles, conserve 30 per cent of North American land and waters by 2030, and increase opportunities for legal pathways for migrants to enter our respective countries.</p>\n\n<p>The Prime Minister met with President Biden separately to discuss progress made on the Roadmap for a Renewed Canada-U.S. Partnership, agreed to by the two leaders in February. During the meeting, the leaders committed to enhancing supply chain security by setting up a Canada-U.S. supply chain working group. In addition, they also announced the establishment of an Indo-Pacific strategic dialogue to coordinate shared priorities. Finally, they agreed to develop a renewed vision for joint management of the border applying lessons learned from the pandemic.</p>\n\n<p>Canada and the U.S. also announced their intent to begin negotiations toward a science, technology, and innovation agreement to position Canada and the U.S. as leaders in the digital economy.</p>\n\n<p>Prime Minister Trudeau also met with President López Obrador. The two leaders reaffirmed the strong relationship between Canada and Mexico, which is built on strong trade and investment relations, as well as shared values and close people-to-people ties. They underscored the importance of the economic relationship between our two countries, and discussed the importance of an integrated North American economy, and of the Canada-United States-Mexico Agreement. Finally, they discussed the commonality of our shared identity as nations with rich Indigenous heritage and committed to exploring additional opportunities to cooperate in advancing on the path of Truth and Reconciliation.</p>\n\n<p>During his visit to Washington, the Prime Minister also met with the Vice President of the United States, Kamala Harris, to discuss a range of issues of mutual interest, including bilateral cooperation on democracy and human rights, and a range of global challenges. In addition, he also met with U.S. congressional leaders to discuss our close economic relationship, and how we can work together to better secure supply chains and increase trade opportunities.</p>\n\n<p>To build back a better Canada from the impacts of the COVID-19 pandemic, we need to work with our North American partners. Only together, can we finish the fight against this virus, take strong climate action, create new jobs and middle class growth, and tackle the many challenges of today and tomorrow.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Strengthening our partnership with the United States and Mexico will create new opportunities for economic growth for our people and ensure North America remains the most competitive region in the world. Together we will finish the fight against COVID-19, get the job done on vaccines, tackle the climate crisis, create new middle class jobs, and build an economic recovery that works for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister was accompanied by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland, the Minister of Foreign Affairs, Mélanie Joly, the Minister of International Trade, Export Promotion, Small Business and Economic Development, Mary Ng, and the Minister of Public Safety, Marco E.L. Mendicino.</li>\n\t<li>Prime Minister Trudeau participated in a moderated panel discussion at the Woodrow Wilson Centre, focusing on themes such as climate and energy goals, diversity, equity and inclusion, trade and economy, building back better, and broader international issues.</li>\n\t<li>Canada hosted the last North American Leaders’ Summit in June 2016.</li>\n\t<li>Since signing our first trilateral trade agreement in 1994, three-way merchandise trade has grown over 250 per cent. The agreement created the foundation to enter into the most modern and comprehensive trade agreement in the world in 2020, the <a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a>. The United States, Mexico, and Canada generate close to one third of global goods and services.</li>\n\t<li>The three countries are among each other’s largest trading partners and sources of foreign investment. In 2019, total trilateral merchandise trade (the total of each country’s imports from one another) reached slightly over USD $1.1 trillion.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"3c5de4c0-d59f-44a8-8461-8c993b549baa\" href=\"/en/news/backgrounders/2021/11/18/joint-statement-north-american-leaders\">Building Back Better Together: A Secure, Prosperous North America</a></li>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"26b7c360-dba4-4213-aa4f-d1a1bd9c2a7b\" href=\"/en/news/backgrounders/2021/11/18/fact-sheet-key-deliverables-2021-north-american-leaders-summit\">Key Deliverables for the 2021 North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-president-united-states-america-joe\">Prime Minister Justin Trudeau meets with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-president-mexico-andres-manuel-lopez\">Prime Minister Justin Trudeau meets with President of Mexico Andrés Manuel López Obrador</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-united-states-congressional-leadership?auHash=ywvkjcKLXzPnPNefi5Z90XEzVPYT5_ehfNQA6y0iFqY\">Prime Minister Justin Trudeau meets with United States congressional leadership</a></li>\n\t<li><a href=\"/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-united-states-vice-president-kamala\">Prime Minister Justin Trudeau meets with United States Vice President Kamala Harris</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed Canada-U.S. Partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minster Trudeau to attend North American Leaders’ Summit</a></li>\n</ul></div>\n      "
}