{
  "path": "/en/news/news-releases/2019/06/27/prime-minister-announces-two-appointments-superior-courts-ontario-and",
  "pageTitle": "Prime Minister announces two appointments to superior courts of Ontario and Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Geoffrey B. Morawetz, a Judge of the Superior Court of Justice of Ontario, as Chief Justice of the Superior Court of Justice of Ontario, effective July 1, 2019. He replaces the Honourable Heather J. Smith, who will retire on June 30, 2019, after more than 36 years of distinguished service as a judge.</p>\n\n<p>Prime Minister Trudeau also announced the appointment of the Honourable Catherine&nbsp;La Rosa, a Judge of the Superior Court of Quebec for the district of Québec, as Senior Associate Chief Justice of the Superior Court of Quebec, effective October&nbsp;1,&nbsp;2019. She will replace the Honourable Robert Pidgeon, who elected to become a supernumerary judge effective September 30, 2019, after more than 30 years of distinguished service as a judge.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I know the Honourable Geoffrey B. Morawetz will serve Ontarians well as Chief Justice of the Superior Court of Justice of Ontario. He is highly regarded in Canada and around the world for his expertise and brings with him a wealth of experience in civil and commercial matters gained over a 14‑year judicial career.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am happy to announce the appointment of Catherine La Rosa as the new Senior Associate Chief Justice of the Superior Court of Quebec. With her extensive experience in family and human rights law, I am confident that she will be a great asset to the province’s superior court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General, on the advice of Cabinet and on the recommendation of the Prime Minister.</li>\n\t<li>The Superior Court of Justice of Ontario has jurisdiction over criminal, civil, and family cases, and is the largest superior trial court in Canada.</li>\n\t<li>The Superior Court of Quebec hears civil and commercial cases where the sum at issue is $85,000 or more, as well as administrative and family matters, bankruptcies, jury trial in criminal cases, and summary conviction appeals.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/06/27/honourable-geoffrey-b-morawetz\">The Honourable Geoffrey B. Morawetz</a></li>\n\t<li><a href=\"/en/news/backgrounders/2019/06/27/honourable-catherine-la-rosa\">The Honourable Catherine La Rosa</a></li>\n</ul></div>\n      "
}