{
  "path": "/en/news/statements/2022/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian Multiculturalism Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada/multiculturalism-day.html\">Canadian Multiculturalism Day</a>, I join people from coast to coast to coast to celebrate one of our country’s greatest strengths – our diversity. Cultural communities have always been integral to the fabric of Canada, and Canadians celebrate their diverse cultural heritage and identity with great pride.</p>\n\n<p>“Our multiculturalism makes us who we are as Canadians, and many cultural communities have a long history of contributing to our country. As Canadians and partners, we acknowledge that First Nations, Inuit, and Métis have called these lands home for millennia.</p>\n\n<p>“Canada’s proud and longstanding tradition of welcoming people from around the world with open arms continues to shape our country today. Last year, the Government of Canada welcomed over 405,000 new permanent residents into the country, the largest number of newcomers to Canada in a single year, surpassing the previous record from 1913. Canada was also the global leader in resettling refugees in 2021, helping them establish roots and start a new life here. All across the country, newcomers start businesses in their communities, volunteer to help those who need it, and contribute fully to our local economies. Canada is better for it.</p>\n\n<p>“The government is building on Canada’s global reputation as an open and compassionate society. While we have much to celebrate, many Canadians still face systemic barriers and discrimination based on&nbsp;the colour of their skin, their background, or their faith, and we recognize there is still more work to do to achieve a truly equitable country. Through the <a href=\"https://www.canada.ca/en/canadian-heritage/services/funding/community-multiculturalism-anti-racism.html\">Community Support, Multiculturalism, and Anti-Racism Initiatives Program</a>, a renewed Anti-Racism Strategy, and a new National Action Plan on Combatting Hate, we are improving our understanding of the challenges faced by Indigenous Peoples, Black and racialized and religious minority communities and driving action to make Canada more inclusive for everyone.</p>\n\n<p>“On behalf of the Government of Canada, I invite everyone to participate in Canadian Multiculturalism Day by taking part in <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada/multiculturalism-day.html\">activities and events</a> across the country. Today and every day, let us celebrate the differences that make Canada one of the best places in the world to live.”</p></div>\n      "
}