{
  "path": "/en/news/statements/2018/08/18/statement-prime-minister-canada-death-kofi-annan",
  "pageTitle": "Statement by the Prime Minister of Canada on death of Kofi Annan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Kofi Annan, former Secretary-General of the United Nations and Nobel Peace Prize winner:</p><p>“Today, I join the world to mourn the passing of a great statesman and humanitarian, the former Secretary-General of the United Nations, Kofi Annan.</p><p>“Born in Ghana, Mr. Annan worked throughout his life to advance peace and development. During his long career at the United Nations, including his two terms as Secretary-General, he gained international respect for his work to strengthen and reform the organization, to promote acceptance, pluralism, and respect for human rights, and to address the HIV/AIDS epidemic. He and the organization were recognized for their achievements with the Nobel Peace Prize in 2001.</p><p>“After leaving the United Nations, his work to make this world a better, fairer, and more equal home for all didn’t end. As founder and Chair of the Kofi Annan Foundation and a founding member and Chair of The Elders, he continued to work to address pressing humanitarian issues and advance good governance. He also served as Chairman of the Advisory Commission on Rakhine State, helping to bring the world’s attention and spur action on the grave crisis and violations of human rights faced by hundreds of thousands of vulnerable people in Myanmar.</p><p>“I recently met with Mr. Annan ahead of the One Young World global forum in 2016. He believed deeply in the power and potential of young people. He recognized their innate sense of a world that has never been more interconnected or interdependent, and knew that young people, in many ways, had more to teach us than we had to teach them.</p><p>“On behalf of all Canadians, Sophie and I offer our deepest condolences to Mr. Annan’s family, as well as his many friends and colleagues.”</p></div>\n      "
}