{
  "path": "/en/news/news-releases/2022/09/26/prime-minister-announces-appointment-ian-shugart-privy-councillor",
  "pageTitle": "The Prime Minister announces appointment of Ian Shugart as Privy Councillor | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Ian Shugart as Canada’s newest Privy Councillor.</p>\n\n<p>An exceptional public service leader, Mr. Shugart is being honoured for his outstanding and dedicated service to Canadians. His career in service to Canadians spans over four decades, during which he held many leadership positions, including Deputy Minister of Foreign Affairs, Deputy Minister of Employment and Social Development, and Deputy Minister of Environment and Climate Change.</p>\n\n<p>From 2019 to 2022, Mr. Shugart was the 24th Clerk of the Privy Council and Secretary to the Cabinet. In this role, he led the federal public service’s response to the COVID‑19 pandemic, providing direct support to Canadians and Canadian businesses when they needed it most.</p>\n\n<p>Mr. Shugart retired from the public service on May 27, 2022.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For over 40 years, Ian Shugart’s advice and leadership in service of Canadians have been invaluable. I&nbsp;am pleased to appoint him as Canada’s newest Privy Councillor to recognize his contributions and dedication to making Canada a better place for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Privy Councillors are members of the King’s Privy Council for Canada, established under the <em>Constitution Act, 1867</em> to advise the Governor General.</li>\n\t<li>The Privy Council includes all past and present ministers, as well as a number of select persons honoured for their contributions to Canada.</li>\n\t<li>Members are appointed by the Governor General, on the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/services/queens.html\">Queen’s Privy Council for Canada</a></li>\n</ul></div>\n      "
}