{
  "path": "/en/news/news-releases/2021/02/23/prime-minister-canada-welcomes-plan-revitalize-and-expand-ties-united",
  "pageTitle": "Prime Minister of Canada welcomes plan to revitalize and expand ties with the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today met with the President of the United States of America, Joe Biden, during a bilateral meeting.</p>\n\n<p>During the meeting, Prime Minister Trudeau and President Biden solidified the deep and enduring friendship between Canada and the United States, by committing to an ambitious <a href=\"/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">roadmap</a> to revitalize and expand this historic relationship and&nbsp;realize our full potential.</p>\n\n<p>The Prime Minister and the President discussed working together to end the global COVID-19 pandemic, and agreed that the pandemic will not end until everyone, everywhere has access to a vaccine. To ensure a strong economic recovery that benefits everyone, the two leaders further discussed the importance of avoiding measures that may constrain the critical trade and supply-chain security between our countries. Both leaders shared their vision for&nbsp;building back better by supporting hard-hit small and medium-sized businesses and creating good middle class jobs, especially for women and young people. They discussed the importance of addressing all forms of systemic racism, discrimination, and exclusion, including by implementing more effective approaches to community safety, criminal justice, and law enforcement.</p>\n\n<p>Prime Minister Trudeau and President Biden expressed their shared commitment to taking real action to fighting climate change while growing the economy and creating good jobs. They discussed working together to reduce pollution, protect nature and biodiversity, and collaborate on critical minerals and clean energy. Prime Minister Trudeau and President Biden announced that they will launch a High Level Climate Ministerial to align our policies and our goals to increase ambition to tackle the climate crisis. The Prime Minister also highlighted that our integrated energy infrastructure, including oil and gas, would remain essential during a transition to a net-zero emissions future. In addition, the two leaders emphasized the importance of maintaining strong and secure supply chains, and spoke about the digital economy. They also discussed important defence and security issues, including modernizing NORAD, as well as NATO missions, cybersecurity threats, and firearms.</p>\n\n<p>The Prime Minister and President discussed efforts to address key regional, national, and global challenges, and&nbsp;priorities in multilateral forums, including the G7, the G20, and the United Nations. The leaders also discussed China. President Biden&nbsp;reaffirmed&nbsp;his country’s commitment to ending the arbitrary detention of two Canadian citizens, Michael Kovrig and Michael Spavor.</p>\n\n<p>This productive bilateral meeting is another step to revitalize and expand ties with our largest and closest partner, the United States. Prime Minister Trudeau will continue to work closely with President Biden to fight the pandemic and ensure a strong economic recovery to grow the middle class in both countries.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the United States have an extraordinary relationship that transcends geographic borders. It is in our best interest to work together to make things better for our people and both our countries. Today’s meeting with President Biden further strengthens our two countries’ strong and historic ties. I look forward to continue working together to end COVID-19, and build back better to grow the middle class and create good jobs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In addition to today’s meeting,&nbsp;Prime Minister Trudeau and President Biden have spoken twice since the U.S. election in November 2020, on November 9, 2020&nbsp;and January 22, 2021. They also both participated in the G7 videoconference on February 19, 2021. Prime Minister Trudeau also spoke to Vice President Kamala Harris on February 1, 2021.&nbsp;</li>\n\t<li>The leaders were joined during their virtual bilateral meeting today by Deputy Prime Minister and Minister of Finance Chrystia Freeland, and Minister of Foreign Affairs Marc Garneau, as well as Vice President Harris and Secretary of State Antony Blinken.</li>\n\t<li>Minister of National Defence Harjit Sajjan, Minister of Natural Resources Seamus O’Regan, Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Small Business, Export Promotion and International Trade Mary Ng, Minister of Environment and Climate Change Jonathan Wilkinson, Minister of Transport Omar Alghabra, and Ambassador of Canada to the United States Kirsten Hillman also joined during a virtual expanded meeting.</li>\n\t<li>Canada and the United States share one of the largest trading relationships in the world. The two countries also share the longest and most secure border in the world, over which $2.7 billion worth of goods and services cross daily.</li>\n\t<li>In 2019, Canada was the top import source country for 20 U.S. states.</li>\n\t<li>Canada is the United States’ largest customer and buys more goods from the United States than China, Japan, and the United Kingdom combined. Canada is also the top trading partner for most U.S. states.</li>\n\t<li>Canada and the United States have worked side-by-side in the North American Aerospace Defense Command (NORAD) since the pact was created in 1957.</li>\n\t<li>Canada is the largest supplier of all forms of energy to the U.S.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a>&nbsp;</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/country-pays/united_states-etats_unis/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/20/prime-minister-trudeau-and-president-biden-hold-first-meeting\">Prime Minister Trudeau and President Biden to hold first meeting</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/22/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-inauguration-joe-biden-president-united\">Statement by the Prime Minister of Canada on the inauguration of Joe Biden as President of the United States of America</a></li>\n\t<li><a href=\"https://www.cbsa-asfc.gc.ca/services/covid/menu-eng.html\">Coronavirus disease (COVID-19): Current border measures and requirements</a></li>\n</ul></div>\n      "
}