{
  "path": "/en/news/readouts/2021/12/16/prime-minister-justin-trudeau-speaks-ontario-premier-doug-ford",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Ontario Premier Doug Ford to discuss the COVID-19 pandemic and other shared priorities.</p>\n\n<p>The Prime Minister and Premier spoke about the rising number of COVID-19 cases in Ontario, including as a result of the Omicron variant of concern. They discussed the strong, additional public health measures announced by the federal and provincial governments this week, and the plans going forward to keep people safe and healthy and help stop the spread of the virus and its variants.&nbsp;They agreed on the importance of continuing to collaborate closely on rapid tests and booster shots.</p>\n\n<p>The two leaders also agreed to continue working together to quickly reach an agreement on early learning and child care for the benefit of Ontario families. They spoke about the need for collaboration on housing, including when it comes to increasing the supply of affordable housing, and looked forward to discussing further at the Ontario Housing Affordability Summit now taking place in January.</p>\n\n<p>The Prime Minister and Premier discussed the implications of the United States’ <em>Build Back Better Act</em>, Canada’s work to vigorously defend its national interests, and the potential for economic growth as a result of the production of electric vehicles and batteries in Ontario.</p>\n\n<p>The two leaders also discussed Ontario’s desire to welcome more skilled immigrants into the province, as well as health care and the importance of funding and accountability to deliver for Canadians.</p>\n\n<p>The Prime Minister and Premier agreed to continue working together on these and other issues of importance to both governments.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-holds-35th-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 35th call with premiers on COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/government-of-canada-introduces-additional-measures-to-address-covid-19-omicron-variant-of-concern.html\">Government of Canada introduces additional measures to address COVID-19 Omicron variant of concern</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/20/helping-over-320-canadian-families-find-affordable-homes-ontario\">Helping over 320 Canadian families find affordable homes in Ontario</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/12/minister-ng-and-team-canada-delegation-advocate-for-canadian-workers-and-industry-in-washington-dc.html\">Minister Ng and Team Canada delegation advocate for Canadian workers and industry in Washington, D.C.</a></li>\n</ul></div>\n      "
}