{
  "path": "/en/news/readouts/2016/09/15/prime-minister-canada-justin-trudeau-meets-vice-chancellor-germany-sigmar",
  "pageTitle": "Prime Minister of Canada Justin Trudeau meets with the Vice Chancellor of Germany Sigmar Gabriel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister and Vice Chancellor discussed Canada's and Germany's strong relationship based on common values and a commitment to progressive trade that supports the economy as well as consumers and employees in both countries.</p>\n<p>The Prime Minister and Vice Chancellor discussed CETA and welcomed the fact that Canada and the EU are working towards signature of the agreement next month.</p>\n<p>The Prime Minister and Vice Chancellor agreed that CETA reflects a shared commitment to a modern, progressive trade policy that contributes to growth, employment and opportunities for our people in Canada and Europe.</p>\n<p>The Prime Minister and Vice Chancellor further agreed that:</p>\n<ul>\n<li>Modern trade agreements should offer predictable rules and standards, a high level of protection for consumers, workers, the environment, and public services‎.</li>\n<li>Improving the transparency and ethics of the process of investment dispute resolution and affirming the right to regulate of national parliaments is crucial.</li>\n</ul>\n<p><br>The German Vice Chancellor ‎recognized that the new Canadian Government strengthened CETA in these areas. In particular, the new Canadian Government and the EU created a new system of investment protection which can serve as benchmark for international rules on investment.‎</p>\n<p>The Prime Minister and Vice Chancellor discussed the value of considering proposals to further build on CETA with regards to investment protection, workers’ rights, and public services including procurement. They support the work Canada's Trade Minister and the EU's Trade Commissioner are doing to strengthen the progressive elements of CETA by clarifications in a declaration with legal status.</p></div>\n      "
}