{
  "path": "/en/news/news-releases/2021/03/03/new-investments-support-research-and-science-across-canada",
  "pageTitle": "New investments to support research and science across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>Research and science are essential to creating opportunity for Canadians, and finding solutions to the challenges of today and tomorrow. That’s why the Government of Canada has committed more than $10 billion since 2015 to fund research and science, and why they have guided our response to the global COVID-19 pandemic. To keep Canadians safe and supported through this crisis, and to build back better for everyone, we will continue to make smart investments in Canadian research and those who power it.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today announced an investment to support more than 100 research projects and almost 1,000 researchers across the country. This investment of more than $518 million will ensure these researchers have the facilities and tools they need, and will fund projects that help us beat the pandemic and build a more resilient Canada. </span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">At the CHU de </span><span>Québec-Université Laval, today’s investment will help create a program to speed up vaccine production. Researchers at Ryerson University will use the funding to develop made-in-Canada technologies that will build cleaner, healthier, and more resilient communities. The funding will also help the University of Manitoba develop</span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"> a digital archive to support reconciliation with Indigenous peoples, and will support other projects that address climate change, maternal and child health, genome sequencing, and cancer immunotherapy.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">By continuing to make the largest investment in science and research in our history, we’re creating new jobs, a cleaner environment, and healthier communities – now and into the future.</span></span></span></p>\n\n<h2><span><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Quotes</span></span></span></span></span></h2>\n\n<blockquote>\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Canada's researchers and scientists are some of the brightest and most skilled in the world</span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">. Today’s investments will ensure that they have what they need</span><span> to</span><span> help us build a Canada that is healthier, cleaner, and more competitive</span><span>.</span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">”</span></span></span></span></p>\n\n<footer class=\"default\"><span><span><span>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span>“</span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Great science and research is the first step in driving innovation. Now more than ever, Canadians are looking to their researchers to develop innovative solutions to real-world problems. Our government is proud to support today’s funding recipients, who are harnessing their expertise and dedication to make the important discoveries that will serve Canadians now and in the future.</span><span>”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span>The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Investing in research is an investment in the future of Canada. Discoveries will lead to economic growth and will help solve the challenges the world faces today. These projects demonstrate the breadth and depth of Canadian expertise and excellence, and these awards are a tribute to the innovative researchers across the country.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Roseann O’Reilly Runte, President and CEO, Canada Foundation for Innovation</span></span></span></footer>\n</blockquote>\n\n<h2><span><span><span>Quick Facts</span></span></span></h2>\n\n<ul>\n\t<li><span><span><span>Today’s investments are made under the Canada Foundation for Innovation (CFI)’s Innovation Fund. The Innovation Fund supports 40 per cent of the eligible infrastructure costs of an institution’s research project, with the remaining portion coming from partners such as provincial and territorial governments and the institution itself.</span></span></span></li>\n\t<li><span><span><span>The funding will be provided to 35 different universities, colleges, and research institutions across Canada, with 14 recipients in Ontario, nine in Quebec, four in British Columbia, two each in Alberta and Saskatchewan, and one each in Manitoba, Nova Scotia, Newfoundland and Labrador, and the Northwest Territories.</span></span></span>\n\t<ul>\n\t\t<li><span><span><span>A </span><a href=\"https://www.innovation.ca/user/login?destination=node/2946%3Futm_source%3DPANTHEON_STRIPPED%26utm_medium%3DPANTHEON_STRIPPED%26utm_campaign%3DPANTHEON_STRIPPED&amp;utm_source=PMsite&amp;utm_medium=PMrelease&amp;utm_campaign=ifnewsitem-pmrelease-EN-2021\"><span>f</span></a><span><a href=\"https://www.innovation.ca/about/press-release/major-investment-innovative-world-class-research-benefit-all-canadians\">ull list of the universities, colleges, and research institutions </a>funded by the CFI as part of today’s announcement, and <a href=\"https://www.innovation.ca/story/setting-bar-global-leadership-canadian-research\">stories about some of the projects</a> receiving support, are available online.</span></span></span></li>\n\t\t<li><span><span><span>Projects are selected as part of Innovation Fund competitions, which take place every two to three years and</span> <span>include a rigorous merit review process. </span></span></span></li>\n\t</ul>\n\t</li>\n\t<li><span><span><span>In Budget 2018, the Government of Canada</span> <span>made an investment of $763 million over five years in the CFI to support state-of-the-art research infrastructure at Canadian universities, colleges, and research hospitals. It also established stable funding of $462 million per year starting in 2023-24 for the CFI.</span></span></span></li>\n\t<li><span><span><span>In May 2020, the government announced $450 million in funding to help Canada’s academic research community during the COVID-19 pandemic. This funding included wage supports to universities and health research institutes, and support to maintain essential research-related activities during the crisis.</span></span></span></li>\n</ul>\n\n<h2><span><span><span>Related Product</span></span></span></h2>\n\n<ul>\n\t<li><span><span><a href=\"https://bit.ly/3uzyZqA\"><span>Major investment in innovative, world-class research to benefit all Canadians</span></a></span></span></li>\n</ul>\n\n<h2><span><span><span>Associated Links</span></span></span></h2>\n\n<ul>\n\t<li><span><span><span><a href=\"https://www.innovation.ca/awards/innovation-fund\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Innovation Fund</span></a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://www.innovation.ca/\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada Foundation for Innovation</span></a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://www.innovation.ca/about/news/ensuring-canadian-researchers-are-well-equipped-tackle-pandemic?utm_source=PMsite&amp;utm_medium=PMrelease&amp;utm_campaign=eofcovid19-pmrelease-EN-2021\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Ensuring Canadian researchers are well equipped to tackle the pandemic</span></a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/15/prime-minister-announces-support-research-staff-canada\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Prime Minister announces support for research staff in Canada</span></a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada’s plan to mobilize science to fight COVID-19</span></a></span></span></span></li>\n</ul></div>\n      "
}