{
  "path": "/en/news/readouts/2022/05/31/prime-minister-justin-trudeau-speaks-prime-minister-singapore-lee-hsien",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Singapore Lee Hsien Loong | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Singapore, Lee Hsien Loong, to discuss shared priorities and current regional and global issues.</p>\n\n<p>The prime ministers highlighted the close ties between their two countries, built on a commitment to rules-based multilateral cooperation in support of greater stability and shared prosperity. The two leaders discussed the importance of expanding their bilateral efforts to strengthen trade and investment and to address pressing global challenges. Prime Minister Lee welcomed Canada’s recent formal expression of interest to accede to the Digital Economy Partnership Agreement, a novel digital trade policy tool co-initiated by Singapore, New Zealand, and Chile.</p>\n\n<p>The two leaders discussed Russia’s attack on Ukraine, which violates international law and the Charter of the United Nations, and expressed concern over its global impacts, including on food and energy security. They condemned President Putin’s invasion and agreed on the importance of holding Russia accountable through targeted sanctions.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Lee agreed to remain in touch and advance their work together in these and other areas, and they looked forward to meeting in person soon.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/singapore-singapour/bilateral_relations_bilaterales/canada_singapore-singapour.aspx?lang=eng\">Canada-Singapore relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/05/minister-ng-announces-canadas-request-to-join-the-digital-economy-partnership-agreement.html\">Minister Ng announces Canada’s request to join the Digital Economy Partnership Agreement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}