{
  "path": "/en/news/statements/2017/09/20/statement-prime-minister-rosh-hashanah",
  "pageTitle": "Statement by the Prime Minister on Rosh Hashanah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister of Canada, Justin Trudeau, today issued the following statement in recognition of Rosh Hashanah:&nbsp; </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Tonight at sunset, Jewish communities in Canada and around the world will celebrate Rosh Hashanah, the Jewish New Year. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Rosh Hashanah is celebrated on the first and second days of the month of Tishrei and marks the beginning of the Days of Awe. It is a time to reflect on the past year and look forward to the year ahead with hope and intention.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, Rosh Hashanah comes at a time of great anxiety for the Jewish community in Canada. We have seen hateful, anti-Semitic acts target innocent people and the places where they gather and worship. The Government of Canada stands firmly with the Jewish community in the face of this hatred and condemns all forms of racism, xenophobia, and discrimination. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In the spirit of Rosh Hashanah, I urge all Canadians to reflect on the values we hold dear as a country. What makes us strong – our openness, compassion, diversity and inclusion – is enshrined in our laws and statutes. Yet they are only meaningful when we put them into practice, through the choices we make every day. Each of us must be confident and untiring custodians of these values and do our part to repair the world.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of our family, Sophie and I wish all those celebrating Rosh Hashanah a healthy, peaceful, and prosperous New Year.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Shana Tova Umetukah!”</span></p></div>\n      "
}