{
  "path": "/en/news/statements/2017/09/11/statement-prime-minister-mark-first-annual-firefighters-national",
  "pageTitle": "Statement by the Prime Minister to mark the first annual Firefighters’ National Memorial Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the first annual Firefighters’ National Memorial Day:</p><p>“Today, on the first annual Firefighters’ National Memorial Day, we take a moment to remember those who have answered their last alarm.</p><p>“We solemnly honour Canada’s more than 1,300 firefighters who have died in the line of duty since the first recorded fatality in 1848, including the 13 who have died this year. We mourn them with their loved ones, friends and colleagues.</p><p>“There can be no greater gesture than to put oneself in harm’s way to save the life of another. We must never forget the enormous risks our firefighters face to keep us safe, or the sacrifices they and their families are called upon to make.</p><p>“In particular, I want to offer our sincere gratitude for the efforts of the firefighters who having been fighting the 2017 wildfires in British Columbia, and of those who tackled the 2016 blaze in Fort McMurray, Alberta.</p><p>“Firefighting is fraught with danger, and that includes emotional and mental stress. We recognize the toll this work takes on the lives of firefighters and those close to them.</p><p>“The Government of Canada&nbsp;is committed to supporting the women and men who risk their lives to keep Canadians safe. Budget 2017 includes an investment of $80 million over five years, starting in 2018-19, and $20 million thereafter, for the establishment of a grant program to support the families of all public safety officers – firefighters, police and paramedics – who made the ultimate sacrifice to keep Canadians safe.</p><p>“Working collaboratively with provinces, territories, first responders, and other key stakeholders, we are also developing a coordinated national action plan to address post-traumatic stress disorder and other occupational stress injuries, in support of public safety officers.</p><p>“Every year from now on, to honour the service and sacrifice of Canada’s firefighters, the Canadian flag will fly at half-mast on all federal buildings and establishments&nbsp;— including the Peace Tower&nbsp;— from sunrise to sunset on the second Sunday in September.</p><p>“Today, as we remember and honour the legacy of sacrifice, dedication and bravery provided by our firefighters, let us ensure that Canada forever remains a country where generosity of heart prevails, and where Canadians continue to look out for the wellbeing of those around them.”</p></div>\n      "
}