{
  "path": "/en/news/statements/2022/06/05/statement-prime-minister-world-environment-day",
  "pageTitle": "Statement by the Prime Minister on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p>\n\n<p>“Today, on <a href=\"https://www.worldenvironmentday.global/overview\">World Environment Day</a>, we come together with the international community to protect our planet and ensure our kids and grandkids can have a safe and healthy place to live and grow. This year’s theme –&nbsp;Only One Earth –&nbsp;highlights the importance of working together toward this goal. &nbsp;</p>\n\n<p>“Climate change is real and its impacts are already here. Across the country, Canadians have experienced extreme heat waves, had their homes destroyed by wildfires and floods, and seen their crops devastated by drought – and these extreme weather events are on the rise. &nbsp;</p>\n\n<p>“Since 2015, the Government of Canada, together with Canadians, has taken historic action to cut pollution while growing the economy and creating good jobs. We put a price on pollution, which is making life more affordable for Canadian families in jurisdictions where the federal pricing system applies. We made historic investments in nature conservation, and we’re working with Indigenous and other partners to protect our lands and waters from coast-to-coast-to-coast. We’re working closely with industry to create good manufacturing jobs building electric vehicles. We’re banning harmful single-use plastics and supporting small businesses to innovate and find alternatives to single-use plastics. With the help of Canadians in communities across the country, provinces and territories, Indigenous partners, and the private sector, we are developing Canada’s first <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/national-adaptation-strategy.html\">National Adaptation Strategy</a> to help prepare our communities for the impacts of climate change.</p>\n\n<p>“The <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\"><em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em></a> shows how each region of the country and each sector of the economy has an important role to play in creating a clean future. This ambitious and achievable roadmap includes $9.1&nbsp;billion in new investments to help Canada meet its 2030 emissions target while growing our economy.</p>\n\n<p>“We know that the climate crisis knows no borders. So, just like we are leading at home, Canada is a strong advocate for ambitious environmental &nbsp;action: we are working closely with our international partners to conserve our oceans, we doubled our climate financing commitment so that the world’s most vulnerable don’t get left behind, and last year, we called on all countries to adopt a price on pollution to drive innovation and create jobs.</p>\n\n<p>“On this World Environment Day, I encourage all Canadians to learn more about <a href=\"https://www.canada.ca/en/services/environment/our-environment.html\">what we can do</a> to leave a clean, healthy planet for our kids and grandkids. We only have one Earth. Let’s stand together to protect it.”</p></div>\n      "
}