{
  "path": "/en/news/statements/2022/06/06/joint-statement-prime-minister-justin-trudeau-and-president-gabriel",
  "pageTitle": "Joint statement by Prime Minister Justin Trudeau and President Gabriel Boric | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and Chile are progressive and like-minded partners in the Americas, with a steadfast commitment to promoting and defending democracy; to safeguarding human rights; to working in true partnership with Indigenous peoples; to leading on the promotion of gender equality and women’s empowerment; and to ensuring that sustainable and inclusive trade creates good jobs and benefits everyone. We are also committed to protecting our natural environments, by conserving our oceans, and taking ambitious action to fight climate change. Russia’s illegal invasion of Ukraine is a stark reminder that we must continue to work together to uphold international law, defend human rights, and promote peace and stability.</p>\n\n<h2>Democracy and Human Rights</h2>\n\n<p>The presence of strong democracies in the hemisphere is in our interest and aligns with our shared values of human rights, freedom, equality, and inclusion. We are committed to collaborating to adapt and safeguard democracy, rule of law, independence of the judiciary, and freedom of expression in the digital age, recognizing that new technologies create new opportunities for participation but also pose new threats to our societies. Canada welcomes Chile’s intention to join the Freedom Online Coalition, a partnership of governments to support internet freedom worldwide.</p>\n\n<h2>Gender Equality</h2>\n\n<p>We know that gender equality benefits us all, and it is only when everyone has access to equal rights and opportunities that we can build stronger, more peaceful and prosperous societies. Canada and Chile share a commitment to advance gender equality and the empowerment of women and girls. We believe in a feminist government, which includes representation and wage parity, as well as assessing decisions, programs, and initiatives to ensure they benefit all segments of society. To show the strength of our commitment, we signed a Memorandum of Understanding on Gender Equality and Women’s Empowerment, establishing a framework for our countries to cooperate on the advancement, design, implementation, and monitoring of public policies for the promotion of gender equality and women’s empowerment. Canada and Chile will exchange information and aid each other on issues such as COVID 19 recovery efforts, women in leadership positions in public and private spheres, gender-based violence, Gender-based Analysis Plus, and Women, Peace and Security, among other topics.</p>\n\n<h2>Indigenous Peoples</h2>\n\n<p>We are committed to meaningful engagement with Indigenous peoples to build on each other’s experiences, particularly expanding on our commitments under the 2007 Canada-Chile Partnership Framework. We welcome the opportunity to strengthen the bilateral Indigenous relationship among the Indigenous peoples of our countries in the areas of socio-economic and cultural development, trade, and expanding engagement into participatory democracy.</p>\n\n<h2>Support for Refugees and Migrants</h2>\n\n<p>We are working together to support internationally displaced persons, in particular, the millions of Venezuelan refugees and migrants seeking a secure future in our hemisphere. We are collaborating through the Quito Process and international assistance to meet the needs of Venezuelan refugees and migrants, including access to basic services and employment. We will continue to coordinate closely in support of regional and international responses to humanitarian challenges.</p>\n\n<h2>Climate Action</h2>\n\n<p>This year marks the 25<sup>th</sup> Anniversary of the Canada-Chile Agreement on Environmental Cooperation (CCAEC). We believe in ambitious climate action that will allow future generations to grow and prosper in a green and sustainable world. We reconfirm our joint commitment to accelerating the global transition to a green, net-zero future, and emphasize the urgency of addressing climate change, including through diligent implementation of commitments made at COP26.</p>\n\n<p>Climate finance commitments under the United Nations Framework Convention on Climate Change (UNFCCC) and Paris Agreement are important to support developing countries’ efforts to adapt to climate change and achieve their climate goals. We will also work together to ensure an ambitious outcome of the negotiations of the post-2020 Global Biodiversity Framework and remain committed to the transition towards more resource-efficient and circular economies.</p>\n\n<p>As members of the High-Level Panel for a Sustainable Ocean Economy, and through the Global Ocean Alliance, we agree to work together to support efforts towards achieving the goal of protecting or conserving at least 30% of the ocean by 2030 through the declaration and effective implementation of a network of Marine Protected Areas and other effective area-based conservation measures. Canada is proud to be co-sponsoring the \"Americas for the Protection of the Ocean\" Declaration with Chile.</p>\n\n<p>We further agree that carbon pricing is one of the most efficient and cost-effective policy tools to reduce greenhouse gas emissions and drive clean innovation. We recognize each other’s leadership in this area and commit to cooperate bilaterally and in multilateral fora to achieve these objectives, in line with the Paris Agreement. We are working together towards convening a high-level event at COP27 to showcase the role of carbon pricing in the global response to climate change.</p>\n\n<h2>Economic Prosperity</h2>\n\n<p>We believe in generating economic growth that benefits everyone by creating good jobs and providing opportunities for every citizen to succeed. The impacts of the pandemic are still being felt by our workers and businesses and the global economy is fragile. We recognize the importance of our companies and state institutions investing in economies that are green, innovative and growth-oriented. Canada and Chile are committed to providing greater access and opportunities to small- and medium-sized enterprises (SMEs) and women-led business so they can also reap the benefits of international trade, through a balance between productive initiatives and trade policies.</p>\n\n<p>We are also proud to celebrate the 25<sup>th</sup> anniversary of our landmark Canada-Chile Free Trade Agreement (CCFTA) and the Canada-Chile Labour Cooperation Agreement (CCLCA). Canada and Chile, alongside New Zealand and Mexico, are promoting a more progressive version of trade through the Inclusive Trade Action Group and the Global Trade and Gender Arrangement. We have also shown a commitment to reform of the World Trade Organization through our common participation in the Ottawa Group. We are working together in the region to enhance economic engagement with the Pacific Alliance, where Chile is a founding member and Canada an observer and Candidate Associated State. Chile was pleased to receive Canada’s formal application to accede to the Digital Economic Partnership Agreement (DEPA). We strongly support efforts that strengthen opportunities for international engagement on digital trade, as well as collaboration on advanced technologies issues.</p>\n\n<h2>Russia’s Invasion of Ukraine</h2>\n\n<p>We strongly condemn President Putin’s unjustifiable and unprovoked invasion of Ukraine and stand unwavering in our support of Ukraine’s democracy, sovereignty, and territorial integrity. We are determined to defend our shared values and international law. We are committed to the advancement of human rights, gender equality and inclusion, and the protection of fundamental freedoms.</p>\n\n<p>Furthermore, we call on Russia to fully respect international humanitarian law, which includes the Geneva Conventions, and we call for the creation, implementation and full respect of humanitarian corridors with special emphasis in the protection of women and girls, children, and the elderly.</p></div>\n      "
}