{
  "path": "/en/news/readouts/2022/12/07/prime-minister-justin-trudeau-meets-secretary-general-united-nations",
  "pageTitle": "Prime Minister Justin Trudeau meets with Secretary-General of the United Nations António Guterres | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Secretary-General of the United Nations (UN), António Guterres, on the margins of the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, which Canada is hosting from December 7 to 19, 2022.</p>\n\n<p>The two leaders expressed their steadfast commitment to action on biodiversity and climate change and agreed on the need for an ambitious Post-2020 Global Biodiversity Framework to guide the world’s collective efforts to stop biodiversity loss and the degradation of nature. Prime Minister Trudeau and Secretary-General Guterres emphasized that the success of the future Framework will depend on the mobilization of resources commensurate with the level of ambition, to support developing countries in realizing the Framework’s targets.</p>\n\n<p>Prime Minister Trudeau and Secretary-General Guterres discussed other pressing global issues. The Prime Minister raised Russia’s illegal invasion of Ukraine and its impacts on global food security and&nbsp;commended the Secretary-General’s work to renew the Black Sea Grain Initiative. the two leaders expressed their concern about the humanitarian situation in Ukraine as winter sets in. They also discussed the situation in Haiti and the need to advance political dialogue toward a Haitian-led solution to the security crisis. Prime Minister Trudeau further expressed his appreciation for the UN’s efforts in delivering humanitarian assistance in Haiti. They also exchanged views on regional peace and security issues, including the ongoing peace process in Ethiopia.</p>\n\n<p>The Prime Minister and the Secretary-General discussed Prime Minister Trudeau’s role within the Sustainable Development Goals (SDGs) Advocates group, which he co-chairs with the Prime Minister of Barbados, Mia Mottley. The two leaders stressed the importance of COP15 in advancing the SDGs and accelerating climate action. They further agreed that the year ahead will be critical in re-energizing efforts toward the SDGs in the decade for action, noting that the SDG Summit, which will be held in New York City next September, will be a key milestone in 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/06/canada-welcomes-world-cop15-protect-nature\">Canada welcomes the world for COP15 to protect nature</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.un.org/en/conferences/SDGSummit2023\">SDG Summit 2023</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/21/prime-minister-justin-trudeau-meets-secretary-general-united-nations\">Prime Minister Justin Trudeau meets with Secretary-General of the United Nations António Guterres</a></li>\n</ul></div>\n      "
}