{
  "path": "/en/news/statements/2020/03/26/extraordinary-g20-leaders-summit-statement-covid-19",
  "pageTitle": "Extraordinary G20 Leaders’ Summit statement on COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The unprecedented COVID-19 pandemic is a powerful reminder of our interconnectedness and vulnerabilities. The virus respects no borders. Combatting this pandemic calls for a transparent, robust, coordinated, large-scale and science-based global response in the spirit of solidarity. We are strongly committed to presenting a united front against this common threat.</p>\n\n<p>We are deeply saddened by the tragic loss of life and the suffering faced by people around the world. Tackling the pandemic and its intertwined health, social and economic impacts is our absolute priority. We express our gratitude and support to all frontline health workers as we continue to fight the pandemic.</p>\n\n<p>The G20 is committed to do whatever it takes to overcome the pandemic, along with the World Health Organization (WHO), International Monetary Fund (IMF), World Bank Group (WBG), United Nations (UN), and other international organizations, working within their existing mandates. We are determined to spare no effort, both individually and collectively, to:</p>\n\n<ul>\n\t<li>Protect lives.</li>\n\t<li>Safeguard people’s jobs and incomes.</li>\n\t<li>Restore confidence, preserve financial stability, revive growth and recover stronger.</li>\n\t<li>Minimize disruptions to trade and global supply chains.</li>\n\t<li>Provide help to all countries in need of assistance.</li>\n\t<li>Coordinate on public health and financial measures.</li>\n</ul>\n\n<h2>Fighting the Pandemic</h2>\n\n<p>We commit to take all necessary health measures and seek to ensure adequate financing to contain the pandemic and protect people, especially the most vulnerable. We will share timely and transparent information; exchange epidemiological and clinical data; share materials necessary for research and development; and strengthen health systems globally, including through supporting the full implementation of the WHO International Health Regulations (IHR 2005). We will expand manufacturing capacity to meet the increasing needs for medical supplies and ensure these are made widely available, at an affordable price, on an equitable basis, where they are most needed and as quickly as possible. We stress the importance of responsible communication to the public during this global health crisis. We task our Health Ministers to meet as needed to share national best practices and develop a set of G20 urgent actions on jointly combatting the pandemic by their ministerial meeting in April.</p>\n\n<p>We fully support and commit to further strengthen the WHO’s mandate in coordinating the international fight against the pandemic, including the protection of front-line health workers, delivery of medical supplies, especially diagnostic tools, treatments, medicines, and vaccines. We acknowledge the necessity of urgent short-term actions to step up the global efforts to fight the COVID-19 crisis. We will quickly work together and with stakeholders to close the financing gap in the WHO Strategic Preparedness and Response Plan. We further commit to provide immediate resources to the WHO’s COVID-19 Solidarity Response Fund, the Coalition for Epidemic Preparedness and Innovation (CEPI) and Gavi, the Vaccine Alliance, on a voluntary basis. We call upon all countries, international organizations, the private sector, philanthropies, and individuals to contribute to these efforts.</p>\n\n<p>To safeguard the future, we commit to strengthen national, regional, and global capacities to respond to potential infectious disease outbreaks by substantially increasing our epidemic preparedness spending. This will enhance the protection of everyone, especially vulnerable groups that are disproportionately affected by infectious diseases. We further commit to work together to increase research and development funding for vaccines and medicines, leverage digital technologies, and strengthen scientific international cooperation. We will bolster our coordination, including with the private sector, towards rapid development, manufacturing and distribution of diagnostics, antiviral medicines, and vaccines, adhering to the objectives of efficacy, safety, equity, accessibility, and affordability.</p>\n\n<p>We ask the WHO, in cooperation with relevant organizations, to assess gaps in pandemic preparedness and report to a joint meeting of Finance and Health Ministers in the coming months, with a view to establish a global initiative on pandemic preparedness and response. This initiative will capitalize on existing programs to align priorities in global preparedness and act as a universal, efficient, sustained funding and coordination platform to accelerate the development and delivery of vaccines, diagnostics and treatments.</p>\n\n<h2>Safeguarding the Global Economy</h2>\n\n<p>We commit to do whatever it takes and to use all available policy tools to minimize the economic and social damage from the pandemic, restore global growth, maintain market stability, and strengthen resilience.</p>\n\n<p>We are currently undertaking immediate and vigorous measures to support our economies; protect workers, businesses—especially micro-, small and medium-sized enterprises—and the sectors most affected; and shield the vulnerable through adequate social protection. We are injecting over $5 trillion into the global economy, as part of targeted fiscal policy, economic measures, and guarantee schemes to counteract the social, economic and financial impacts of the pandemic.</p>\n\n<p>We will continue to conduct bold and large-scale fiscal support. Collective G20 action will amplify its impact, ensure coherence, and harness synergies. The magnitude and scope of this response will get the global economy back on its feet and set a strong basis for the protection of jobs and the recovery of growth. We ask our Finance Ministers and Central Bank Governors to coordinate on a regular basis to develop a G20 action plan in response to COVID-19 and work closely with international organizations to swiftly deliver the appropriate international financial assistance.</p>\n\n<p>We support the extraordinary measures taken by central banks consistent with their mandates. Central banks have acted to support the flow of credit to households and businesses, promote financial stability, and enhance liquidity in global markets. We welcome the extension of swap lines that our central banks have undertaken. We also support regulatory and supervisory measures taken to ensure that the financial system continues to support the economy and welcome the Financial Stability Board’s (FSB) announced coordination of such measures.</p>\n\n<p>We also welcome the steps taken by the IMF and the WBG to support countries in need using all instruments to the fullest extent as part of a coordinated global response and ask them to regularly update the G20 on the impacts of the pandemic, their response, and policy recommendations. We will continue to address risks of debt vulnerabilities in low-income countries due to the pandemic. We also ask the International Labour Organization (ILO) and the Organisation for Economic Cooperation and Development (OECD) to monitor the pandemic’s impact on employment.</p>\n\n<h2>Addressing International Trade Disruptions</h2>\n\n<p>Consistent with the needs of our citizens, we will work to ensure the flow of vital medical supplies, critical agricultural products, and other goods and services across borders, and work to resolve disruptions to the global supply chains, to support the health and wellbeing of all people.</p>\n\n<p>We commit to continue working together to facilitate international trade and coordinate responses in ways that avoid unnecessary interference with international traffic and trade. Emergency measures aimed at protecting health will be targeted, proportionate, transparent, and temporary. We task our Trade Ministers to assess the impact of the pandemic on trade.</p>\n\n<p>We reiterate our goal to realize a free, fair, non-discriminatory, transparent, predictable and stable trade and investment environment, and to keep our markets open.</p>\n\n<h2>Enhancing Global Cooperation</h2>\n\n<p>We will work swiftly and decisively with the front-line international organizations, notably the WHO, IMF, WBG, and multilateral and regional development banks to deploy a robust, coherent, coordinated, and rapid financial package and to address any gaps in their toolkit. We stand ready to strengthen the global financial safety nets. We call upon all these organizations to further step up coordination of their actions, including with the private sector, to support emerging and developing countries facing the health, economic, and social shocks of COVID-19.</p>\n\n<p>We are gravely concerned with the serious risks posed to all countries, particularly developing and least developed countries, and notably in Africa and small island states, where health systems and economies may be less able to cope with the challenge, as well as the particular risk faced by refugees and displaced persons. We consider that consolidating Africa’s health defense is a key for the resilience of global health. We will strengthen capacity building and technical assistance, especially to at-risk communities. We stand ready to mobilize development and humanitarian financing.</p>\n\n<p>We task our top relevant officials to coordinate closely in support of the global efforts to counter the pandemic’s impacts, including through proportionate border management measures in accordance with national regulations and to provide assistance where necessary to repatriate citizens.</p>\n\n<p>We value the efforts to safeguard our people’s health through the postponement of major public events, in particular the decision by the International Olympic Committee to reschedule the Olympic Games to a date no later than summer 2021. We commend Japan’s determination to host the Olympic and Paralympic Games Tokyo 2020 in their complete form as a symbol of human resilience.</p>\n\n<p>We stand ready to react promptly and take any further action that may be required. We express our readiness to convene again as the situation requires. Global action, solidarity and international cooperation are more than ever necessary to address this pandemic. We are confident that, working closely together, we will overcome this. We will protect human life, restore global economic stability, and lay out solid foundations for strong, sustainable, balanced and inclusive growth.</p></div>\n      "
}