{
  "path": "/en/news/news-releases/2022/03/21/prime-minister-announces-nomination-joe-friday-reappointment-public",
  "pageTitle": "Prime Minister announces nomination of Joe Friday for reappointment as Public Sector Integrity Commissioner of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Joe Friday for reappointment as Public Sector Integrity Commissioner of Canada for a term of 18 months.</p>\n\n<p>Mr. Friday was first appointed to this role in 2015. He joined the Office of the Public Sector Integrity Commissioner of Canada in 2008 as General Counsel and was Deputy Commissioner from 2011 until his appointment as Commissioner.</p>\n\n<p>With jurisdiction over most federal public sector organizations, including the Royal Canadian Mounted Police and Crown corporations, the Public Sector Integrity Commissioner of Canada works to strengthen accountability and oversight of government operations. This includes investigating wrongdoing in the federal public sector and helping protect whistleblowers and those who participate in investigations from reprisal. The Commissioner reports directly to Parliament. The Office is an independent federal organization that was created in 2007 under the&nbsp;<em><a href=\"https://laws-lois.justice.gc.ca/eng/acts/P-31.9/\" target=\"_blank\">Public Servants Disclosure Protection Act</a></em>.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Over the past seven years, Mr. Friday has worked in an independent and objective manner to support accountability across the federal public sector. I thank him for his commitment to this office in service of Canadians and I am pleased to nominate him for reappointment for a term of 18 months.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Public Sector Integrity Commissioner is an independent Agent of Parliament, appointed under the <em>Public Servants Disclosure Protection Act</em> for a term of seven years. The Public Sector Integrity Commissioner is eligible to be re-appointed for a further term of not more than seven years.</li>\n\t<li>The reappointment will be made by the Governor in Council after consultation with the leader of every party in the House of Commons and the leader or facilitator of every party and group in the Senate, and after approval by resolution of both&nbsp;Houses of Parliament.</li>\n\t<li>As an Officer of Parliament, the Public Sector Integrity Commissioner investigates wrongdoing in the federal public sector and helps protect persons who make disclosures and who participate in investigations from reprisals. The mandate of the Office is to establish a safe, confidential and independent mechanism for public servants or members of the public to disclose potential wrongdoing in the federal public sector.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/03/21/joe-friday\">Joe Friday</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/topics/appointments/governor-council.html\">Governor in Council appointments</a></li>\n\t<li><a href=\"https://psic-ispc.gc.ca/en/meet-joe-friday\">Meet Joe Friday</a></li>\n\t<li><a href=\"https://www.psic-ispc.gc.ca/en\">Office of the Public Sector Integrity Commissioner of Canada</a></li>\n</ul></div>\n      "
}