{
  "path": "/en/news/news-releases/2019/04/16/new-growth-and-innovation-network-ontario-help-create-18000-jobs",
  "pageTitle": "New growth and innovation network in Ontario to help create 18,000 jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian businesses drive innovation, create good, middle class jobs, and generate economic growth that improves the lives of all Canadians. To succeed in the global innovation race, we need to help promising companies take the next step and grow into global firms. That’s why the Government of Canada is investing in a growth and innovation network along the Waterloo–Toronto–Ottawa corridor.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment to bring together three top innovation hubs—Communitech, MaRS Discovery District, and Invest Ottawa. Together, they will implement the Scale-Up Platform to help innovative companies grow more quickly and create 18,000 high-quality, skilled jobs.</p>\n\n<p>Through the Platform—the first of its kind in Canada—the three organizations will pool their resources to help 30 Ontario companies scale up and achieve revenues of $100 million or more by 2024, as well as to provide services to thousands of others. From coaching and advice to greater access to capital, talent, and global markets, the Platform will give businesses the tools they need to grow. It will also strengthen partnerships with post-secondary institutions, preparing young Canadians for the jobs of today and tomorrow.</p>\n\n<p>By making strategic investments in Canada’s technology sector, the Government of Canada is helping secure our position as a world leader in innovation and creating the right conditions for continued growth in our evolving economy.<strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada’s strong start-up culture makes our country one of the most innovative and prosperous places in the world. Today’s announcement is about making sure Canadian businesses have the support they need to thrive, compete globally, and create jobs for people from coast to coast to coast.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<blockquote>\n<p>“We’re providing our homegrown businesses with the support they need to succeed because they will play a key role driving our economic growth and creating tomorrow’s good jobs. By partnering with these top innovation hubs with a demonstrated track record of scaling up innovative companies, we are giving innovators in this ecosystem every chance we can to scale up, strengthen their footing at home, and compete in global markets.”</p>\n\n<p>—The Hon. Navdeep Bains,&nbsp;Minister of Innovation, Science and Economic Development</p>\n</blockquote>\n\n<blockquote>\n<p>\"Tech companies that generate more than $100 million in annual revenue will be Canada's next generation of anchor firms. For the first time in&nbsp;decades, we have a crop of scale-ready firms that are on the path to $100 million. Our job—through the Scale-Up Platform—is to help those high-growth firms find the talent and capital to accelerate their growth. We&nbsp;need to pool our expertise, our networks, and our resources to help them compete globally and create good-paying jobs for Canadians.\"</p>\n\n<p>—Iain Klugman, President &amp; CEO, Communitech</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada, through <a href=\"http://www.feddevontario.gc.ca/\">FedDev Ontario</a>, is investing $52.4 million in the Scale-Up Platform over five years. As part of the investment, Communitech will receive $18 million, MaRS Discovery District will receive $17.5 million, and Invest Ottawa will receive $16.9 million.</li>\n\t<li>The Scale-Up Platform will support 30 companies in southern Ontario to grow and achieve revenue objectives of $100 million or more by 2024.</li>\n\t<li>Over the last 10 years, Communitech has helped transform the regional economy by supporting more than 3,000&nbsp;companies and helping them attract $1.7 billion in investment and create over 16,000 new jobs.</li>\n\t<li>The Waterloo–Toronto innovation corridor currently ranks as one of the top 20 technology clusters in the world. This investment will leverage the strengths of the Ottawa region and link it to the corridor, creating economic growth by combining forces.</li>\n\t<li>Southern Ontario is among only three start-up ecosystems in the world that is strong in four of the most in demand areas in tech today: financial technology, artificial intelligence and big data, life sciences, and advanced manufacturing and robotics.</li>\n\t<li>Through the Innovation and Skills Plan, the Government is making strategic investments to build innovation ecosystems in Canada, including the Innovation Superclusters Initiative, the Venture Capital Catalyst Initiative and the Global Skills Strategy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.feddevontario.gc.ca/eic/site/723.nsf/intro\">FedDev Ontario</a></li>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/062.nsf/eng/home\">Innovation and Skills Plan</a></li>\n\t<li><a href=\"https://www.communitech.ca/\">Communitech</a></li>\n\t<li><a href=\"https://www.marsdd.com/\">MaRS Discovery District</a></li>\n\t<li><a href=\"https://www.investottawa.ca/\">Invest Ottawa</a></li>\n</ul></div>\n      "
}