{
  "path": "/en/news/statements/2021/03/10/statement-prime-minister-mark-10th-anniversary-great-east-japan",
  "pageTitle": "Statement by the Prime Minister to mark the 10th anniversary of the Great East Japan Earthquake | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement to mark the 10th anniversary of the Great East Japan Earthquake:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Ten years ago, people around the world watched in shock and horror as one of the largest earthquakes in recorded history struck the northeast coast of Japan on March 11, 2011, triggering a devastating tsunami. The events of that fateful day caused extensive damage, leaving more than 15,000 dead and 2,500 missing, in one of the worst humanitarian crises ever experienced by Japan.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“In the wake of this disaster, Canadians showed solidarity with the Japanese people in their time of need and provided immediate support, contributing over $40 million to relief efforts. Many Canadians living in Japan volunteered tirelessly to deliver supplies and messages of hope to their adopted home.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On this solemn anniversary, we join Japanese communities in Canada and around the world to remember the victims of these tragic events. We offer our condolences to those who lost loved ones, and thank everyone who provided assistance in the weeks and months following the disaster. Our thoughts also go to those who were affected earlier this year when another earthquake hit the same region – a reminder of our fragility in the face of powerful natural forces.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“We also</span> <span lang=\"EN-CA\" xml:lang=\"EN-CA\">pay tribute to the incredible strength and determination Japanese people have displayed in the past decade to bring their country on the path to reconstruction and recovery. We have seen this same strength in communities across Canada and Japan as we continue to fight the global COVID-19 pandemic, and I am encouraged that the bonds between our two countries have grown stronger out of these experiences of hardship.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On behalf of the Government of Canada, I invite all Canadians to remember those who were lost in this tragedy. As efforts continue to address its impacts, I extend my profound gratitude to everyone working to build back better for a brighter, more resilient tomorrow.”</span></span></span></p></div>\n      "
}