{
  "path": "/en/news/readouts/2021/09/23/prime-minister-justin-trudeau-speaks-united-states-vice-president-kamala",
  "pageTitle": "Prime Minister Justin Trudeau speaks with United States Vice President Kamala Harris | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Vice President of the United States of America, Kamala Harris, who congratulated him on his re-election.</p>\n\n<p>On the heels of the virtual Global COVID-19 Summit hosted by the President of the United States of America, Joe Biden, yesterday, the Prime Minister and Vice President welcomed Canada-U.S. cooperation in a variety of areas.</p>\n\n<p>The Prime Minister discussed the importance of Canada’s investments in supporting women’s entrepreneurship, including through the Women Entrepreneurship Strategy, and providing parents across Canada with early learning and child care spaces for an average of $10 a day, a model inspired by Québec. These initiatives will increase women’s participation in the workforce, make life more affordable for Canadian families, and foster economic growth.</p>\n\n<p>The Prime Minister and Vice President noted their close partnership, and their desire to work even more closely on issues of mutual interest. They looked forward to meeting in person at the earliest opportunity.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/09/21/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n</ul></div>\n      "
}