{
  "path": "/en/news/statements/2017/11/08/joint-statement-canada-and-socialist-republic-vietnam-establishment",
  "pageTitle": "Joint Statement by Canada and the Socialist Republic of Vietnam on the establishment of a comprehensive partnership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><b>Canada and Vietnam</b> have decided to enhance their cooperation and friendship towards a comprehensive, substantive, effective, stable and sustainable relationship both bilaterally, regionally and internationally, to meet their interests and to contribute to maintaining peace, stability, cooperation and development in the Asia Pacific and the world, based on respect for the Charter of the United Nations, basic principles of international law, and their respective national law<i>.</i></p><p><b>Founded</b> on the fruitful and multifaceted relationship they have developed since establishing their diplomatic relations in 1973, Canada and Vietnam have jointly decided to establish a comprehensive partnership encompassing the following areas:</p><h2>Political and Diplomatic</h2><ol><li>Canada and Vietnam will continue the exchange of high-level visits and regular senior-level dialogues between their respective governments, including bilateral consultations at deputy minister level, and welcome interactions between entities associated with their political parties and their parliaments.</li><li>Canada and Vietnam will continue to cooperate closely in multilateral institutions, including the United Nations (UN), the International Atomic Energy Agency, the Association of Southeast Asian Nations (ASEAN) and La Francophonie. Canada and Vietnam reaffirm their shared commitment to maintain world peace, security and stability, uphold the UN Charter and principles of international law, and will consider cooperation in relevant areas of mutual interest bilaterally and multilaterally in a respectful and constructive manner, in order to contribute to the promotion of their relationship.</li><li>Canada and Vietnam emphasize the importance of maintaining peace and stability in the Asia Pacific region; supporting the maintenance of a rules-based order for the seas and oceans, including the South China Sea. This approach will be based on international law, including the 1982 UN Convention on the Law of the Sea; supporting the assurance of freedom of navigation, aviation, trade and the use of oceans for peaceful purposes, protecting the environment and maritime ecosystem.</li><li>Canada and Vietnam affirm their support for the peaceful settlement of disputes in the South China Sea, including full respect for diplomatic and legal processes and in accordance with international law.</li><li>Canada and Vietnam underscore the important role of ASEAN in the regional architecture, support efforts to build a strong and prosperous rules-based ASEAN community, and welcomes ASEAN initiatives to maintain regional peace and security and prevent confrontations, such as the Declaration of Conduct of Parties in the South China Sea and the Code of Conduct in the South China Sea.</li><li>Canada and Vietnam will continue to work together to address global challenges, including counter terrorism, the proliferation of weapon of mass destruction, and non-traditional challenges such as transnational crimes, climate change, maritime security, food security, water security and safeguard of the environment. Canada and Vietnam will work to protect biodiversity and habitats from illegal exploitation and trafficking as well as support actions to implement the Ha Noi Statement on the Illegal Wildlife Trade.</li><li>Canada and Vietnam recognise the importance of protection and promotion of human rights in conformity with their own constitutions and respective international commitments, including to uphold the UN Charter and Universal Declaration of Human Rights, and express willingness to enhance mutual understanding.</li></ol><h2>Trade and Investment</h2><ol start=\"8\"><li>Canada and Vietnam are committed to reciprocal trade and investment as an important driver of their relationship. Canada and Vietnam will continue to maintain their interest in each other as important markets and promote bilateral trade and investment in key sectors.</li><li>Canada and Vietnam will facilitate trade transactions and promptly resolve issues that may arise in the trade and investment relationship based on a principle of equality, mutual benefit and cooperation; and enhance collaboration in multilateral economic, trade and financial cooperation mechanisms, including the World Trade Organization, the Asia Pacific Economic Cooperation forum, the International Monetary Fund and the World Bank.</li><li>Canada and Vietnam will examine the potential for a Canada-ASEAN free trade agreement, and promote implementation of the Trans-Pacific Partnership.</li></ol><h2>Development Cooperation</h2><ol start=\"11\"><li>Canada and Vietnam note the contribution of development cooperation to their overall relationship over the past decades, and will continue their strong partnerships for sustainable development in their bilateral relations<b>.</b> Canada recognizes Vietnam’s outstanding achievements in poverty reduction since the 1990s and its current development aspiration under Vietnam 2035. Vietnam highly appreciates the official development assistance that Canada has provided and the long-standing partnership underpinning bilateral development cooperation.</li><li>Canada and Vietnam renew their commitment to fulfilling the terms of their 1994 General Agreement on Development Cooperation, as the basis of their continued partnership. Canada and Vietnam commit to continuing their longstanding policy dialogue on enhancing development effectiveness and efficiency as mutually beneficial goals and as fundamental prerequisites for continued cooperation.</li><li>Canada recognizes the need for a new, more strategic approach to development cooperation and will seek to allocate available resources to programs that align with Canada’s feminist International Assistance Policy, and respond directly to Vietnam’s developmental challenges, such as poverty reduction, rural developmentas outlined in Vietnam’s Socio-Economic Development Plan&nbsp;2016-2020. In this regard, Canada’s development cooperation will support Vietnam’s efforts to combat climate change and promote sustainable development through the implementation of the UN’s 2030 Agenda for Sustainable Development.</li></ol><h2>Defence and Security</h2><ol start=\"14\"><li>Canada and Vietnam share common interests for peace and security in the Asia Pacific region and will continue to engage in multilateral and bilateral dialogue and cooperation on national defence and security matters, capacity building and training.</li><li>Canada and Vietnam will explore and advance cooperation in the areas of peacekeeping, maritime security, humanitarian assistance and disaster relief<b>,</b> among other areas of mutual interest and benefit. Canada and Vietnam will continue to explore ways to enhance cooperation on national defence through the Military Training and Cooperation Program, as well as training programs led by Vietnam.</li><li>Canada and Vietnam have decided to explore new areas of cooperation to enhance security, including capacity building in areas of mutual interests.</li></ol><h2>Cultural and Academic Exchange</h2><ol start=\"17\"><li>Vietnam notes favourably Canada’s continued efforts to attract growing numbers of Vietnamese students to pursue studies at Canadian educational institutions, and Canada welcomes the growing number of Vietnamese students pursuing educational opportunities in Canada.</li><li>While recognizing that education is under the jurisdiction of Canadian provincial governments, Canada and Vietnam have decided to promote and facilitate enhanced academic cooperation, mobility, including through the establishment of partnerships and student exchange programs between educational institutions.</li></ol><h2>Science, Technology and Innovation</h2><ol start=\"19\"><li>Canada and Vietnam will promote and strengthen cooperation in areas such as energy, clean and sustainable technologies, agriculture and agri-food, information and communications technology and marine and environmental research, including climate change adaptation and mitigation. The aim will be to facilitate engagement of various innovation stakeholders to share information, experience and topics of mutual interest. Canada and Vietnam will further endeavor to explore potential opportunities to collaborate in respect to research and development, deployment and commercialization of innovative, forward-looking clean technology to address global climate change challenges.</li></ol><h2>People-to-people ties</h2><ol start=\"20\"><li>Canada and Vietnam welcome the strong and growing people-to-people links that already exist between them across all levels of society and across a broad spectrum of business, academic, media, cultural, sports, tourism and non‑governmental organisations. Canada and Vietnam will work to strengthen these links, through cooperation in various fields, provinces and territories. Canada and Vietnam recognize the contributions of the Vietnamese community to Canada. Canada’s policy of multiculturalism welcomes the Vietnamese culture and values, and this promotes friendly relations between their peoples. Canada and Vietnam encourage people-to-people ties that will foster friendly bilateral relations.</li></ol></div>\n      "
}