{
  "path": "/en/news/statements/2023/01/17/statement-prime-minister-trudeau-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul Wallenberg Day:&nbsp;</p>\n\n<p>“Today, we pay tribute to Raoul Wallenberg, a remarkable hero and humanitarian who put his life on the line to save Jews in German-occupied Hungary from persecution, deportation to concentration camps, and death during the Holocaust.</p>\n\n<p>“Mr. Wallenberg has been called ‘the greatest humanitarian of the 20th century’ by the United Nations and was named Canada’s first honorary citizen in 1985. A Swedish diplomat and businessman, he saved the lives of tens of thousands of Hungarian Jews in just six months, between July 1944 and January 1945, through the granting of diplomatic passports giving them immunity. He also established a network of safe havens operating under Swedish diplomatic immunity to shelter and protect those fleeing persecution from the Nazi regime. Tragically, he disappeared in 1945 after being arrested by the Soviets and sent to forced labour camps. In 2001, the Government of Canada designated January&nbsp;17th, the date of his disappearance, as Raoul&nbsp;Wallenberg Day.</p>\n\n<p>“Mr. Wallenberg’s legacy is celebrated worldwide and is a powerful reminder of the difference one person can make when they choose to confront evil and take action. His selflessness and courage are reflected in his own famous words: ‘To me, there is no other choice.</p>\n\n<p>“As a country, Canada has been profoundly shaped by the many contributions of some 40,000 Holocaust survivors who resettled here after the war. Today, and every day, Canadians remember the Holocaust, honour its victims, and commemorate the survivors.</p>\n\n<p>“Today, with a disturbing rise in antisemitism at home and around the world, we must maintain our collective commitment to standing up against all forms of hate and discrimination. Each of us, Jews and non-Jews alike, have an ongoing responsibility to speak up in the face of antisemitism whenever and wherever it occurs. All Canadians have a continued role to play in making sure that fundamental respect and inclusion is at the heart of our strong communities.</p>\n\n<p>“On Raoul Wallenberg Day, I encourage all Canadians to reflect on Mr. Wallenberg’s remarkable story and to draw inspiration from his heroism, his humanitarianism, and his dedication to justice. The Government of Canada will always stand up against antisemitism as we build a more equal, safe, and just world for everyone.”</p>\n\n<p>&nbsp;</p></div>\n      "
}