{
  "path": "/en/news/statements/2021/01/27/statement-prime-minister-international-holocaust-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on International Holocaust Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Holocaust Remembrance Day:</p>\n\n<p>“Today, I join Canadians in paying tribute to the over six million Jews who were murdered and the countless other victims who suffered under the heinous crimes perpetrated by the Nazi regime. The pain and loss endured during the Shoah will never be forgotten. We also honour the survivors whose stories and memories paint a vivid portrayal of suffering, courage, and hope in the face of such despicable acts.</p>\n\n<p>“The atrocities of the Holocaust have left an unfathomable stain on our history, yet antisemitism, discrimination, xenophobia, and violence remain a lived reality for Jewish communities, both here at home and around the world. That is why the Government of Canada will not waver in its commitment to combat antisemitism and all forms of hatred. Through the International Holocaust Remembrance Alliance’s definition of antisemitism, adopted as part of our government’s <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a>, Canada is equipped with the tools and resources needed to combat antisemitic attitudes and Holocaust denial. In an increasingly digital and interconnected world, we will also continue to fight against disinformation and hate online, including by supporting the Inter-Parliamentary Task Force on Online Antisemitism and the government’s <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a>.</p>\n\n<p>“Only through effective education, research, and remembrance can we foster a society free of prejudice and discrimination. In November, I appointed the Honourable Irwin&nbsp;Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism. By leading Canada’s delegation to the International Holocaust Remembrance Alliance, Mr. Cotler is collaborating with domestic and international partners to preserve the memory of the Holocaust for generations to come and strengthen human rights both at home and abroad.</p>\n\n<p>“Learning from our past is key to building a more inclusive future. On this International Holocaust Remembrance Day, I encourage Canadians to remember the victims, survivors, and heroes who bore witness to the Shoah. Together, we will vow ‘Never Again’.”</p></div>\n      "
}