{
  "path": "/en/news/news-releases/2022/04/11/helping-more-canadians-drive-electric-vehicles",
  "pageTitle": "Helping more Canadians drive electric vehicles | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians have been clear about what they want: clean air, good jobs, a healthy environment, and a strong economy. That’s why the Government of Canada is making it easier and more affordable for Canadians across the country to drive zero-emission vehicles (ZEVs), while helping the auto sector to build them right here in Canada.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted key measures included in <em>Budget&nbsp;2022: </em><em>A Plan to Grow Our Economy and Make Life More Affordable</em> to help Canadians make the switch to zero-emission vehicles.</p>\n\n<p>The measures proposed in Budget&nbsp;2022 include:</p>\n\n<ul>\n\t<li><strong>Building a national network of electric vehicle charging stations</strong> by supporting charging infrastructure in communities of all sizes through $500&nbsp;million in investments by the Canada Infrastructure Bank as well as $400&nbsp;million for the Zero Emission Vehicle Infrastructure Program, toward our goal of adding 50,000 charging stations across the country.</li>\n\t<li><strong>Helping more Canadians get behind the wheel of ZEVs</strong> by continuing to provide purchase incentives of up to $5,000 through investing $1.7&nbsp;billion to extend the Incentives for Zero-Emission Vehicles Program until March 2025 and broadening eligibility under the program to include more vehicle models.</li>\n\t<li><strong>Making it easier to buy a ZEV</strong> through a new, mandatory sales target so that when people go to purchase a ZEV, there are options for sale on the lot. At least 20 per cent of all new passenger vehicles sold in Canada will be ZEVs by 2026, and at least 60 per cent by 2030, on the road to 100 per cent by 2035.</li>\n\t<li><strong>Helping businesses switch to medium- and heavy-duty zero-emission vehicles</strong> by investing $547.5&nbsp;million to launch a new purchase incentive program.</li>\n\t<li><strong>Positioning Canada as a global leader on critical minerals, which are essential to build ZEVs</strong><strong> </strong>by providing up to $3.8&nbsp;billion for Canada’s first Critical Minerals Strategy.</li>\n</ul>\n\n<p>Budget&nbsp;2022 and the recently released <em>2030 Emissions Reductions Plan: Canada’s Next Steps to Clean Air and a Strong Economy</em> will ensure clean air and a strong economy. By putting Canadians in the driver’s seat of zero-emission cars and trucks, we are helping people save on gas, while fighting climate change, growing our economy, and building a better future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“One of the best ways to cut pollution is getting more clean cars on the road. That’s why we’re making it easier and more affordable for Canadian families to make their next vehicle purchase an electric one. Our plan is also creating jobs and growing the economy by building these clean vehicles right here in Canada. This is just one example of how our plan will benefit the environment, the economy, and families.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“On-road transportation represents 20 per cent of Canada’s greenhouse gas emissions. Reducing that number is going to be critical to our fight against climate change, and by making it more affordable for Canadians to get behind the wheel of a zero-emission vehicle and helping to build the charging infrastructure they can rely on, Budget&nbsp;2022 will do exactly that.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada recently released the <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\">2030 Emissions Reduction Plan: Canada’s Next Steps to Clean Air and a Strong Economy</a><em>, </em>an ambitious and achievable sector-by-sector approach for Canada to reach its new climate target of cutting emissions by at least 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n\t<li>As of March 31, 2022, the Incentives for Zero-Emission Vehicles Program has helped Canadians purchase or lease over 141,000 new ZEVs.</li>\n\t<li>As of March 31, 2022, the Government of Canada has approved projects that will result in more than 25,000 new chargers and 19 hydrogen stations around the country.</li>\n\t<li>As of April 11, 2022, the Government of Canada has announced several investments to help the auto sector retool to produce EVs in Canada through the <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a>.</li>\n\t<li>Critical minerals are central to major global industries like clean technology, health care, aerospace, and computing. They are used in phones, in computers, and in our cars. They are already essential to the global economy and will continue to be in even greater demand in the years to come.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/clean-air-and-a-strong-economy.html\">Budget&nbsp;2022 Backgrounder: Clean Air and a Strong Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/a-strong-growing-and-resilient-economy.html\">Budget&nbsp;2022 Backgrounder: A Strong, Growing, and Resilient Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/supporting-canadas-rural-communities.html\">Budget&nbsp;2022 Backgrounder: Supporting Canada’s Rural Communities</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/transportation-alternative-fuels/electric-charging-alternative-fuelling-stationslocator-map/20487#/find/nearest\">Electric Charging and Alternative Fuelling Stations Locator</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/healthy-environment-healthy-economy.html\"><em>A Healthy Environment and a Healthy Economy</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}