{
  "path": "/en/news/news-releases/2019/08/21/new-investments-protect-montreal-against-floods-and-help-create",
  "pageTitle": "New investments to protect Montréal against floods and help create the largest urban park in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are seeing firsthand the consequences of the climate crisis. Year after year, extreme weather events are becoming more frequent and more severe, threatening our health, safety, and local economies. Having gone through two major floods since the spring of 2017, the people of Greater Montréal have been directly affected by the climate crisis, including the high costs of recovery in the wake of these events. &nbsp;</p>\n\n<p>Prime Minister Justin Trudeau, accompanied by Mayor of Montréal Valérie Plante, today announced new federal funding for a large-scale natural infrastructure project in Pierrefonds-Roxboro. The leaders were also accompanied by the Minister of Infrastructure and Communities, François-Philippe Champagne. These investments will help protect this borough and boost its resilience, as it is one of the areas most vulnerable to spring thaws and floods in Montréal.</p>\n\n<p>With federal investments of up to $50 million, the city will be able to protect and enhance several irreplaceable wetlands, in addition to upgrading stormwater outfalls in order to better protect neighbouring communities against spring floods. These upgrades, including pumping stations and valves, will help prevent spring flooding from the Rivière des Prairies in the areas of Chemin de la Rive-Boisée, Boulevard Jacques-Bizard, Boulevard Pierrefonds, and Boulevard Gouin.</p>\n\n<p>The project will also strengthen wetlands to support their ecosystems and improve local flood resilience – helping to create the largest urban park in Canadian history. The park will be the largest urban green space in the country and one of the biggest municipal parks in the world. &nbsp;</p>\n\n<p>The funds will come from the $2 billion Disaster Mitigation and Adaptation Fund, launched in 2017. Through the Fund, the Government of Canada is making sure Canadian communities are better equipped to withstand damage caused by the climate crisis and extreme weather events. These investments help keep Canadians safe, protect local businesses, and support strong local economies.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Communities across the country know that the impacts of extreme weather events don’t disappear from one day to the next. In Montréal, people have seen firsthand the damage and uncertainty caused by the 2017 and 2019 floods. That’s why our government is stepping up. By investing in the infrastructure our cities need, we are helping Canadians adapt to the effects of the climate crisis, while building stronger, more resilient communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This investment is a great example of how planning can help reduce the costs of extreme weather phenomena and help communities get back on their feet sooner. Rebuilding takes time, and over the long term, the process of repairing damaged infrastructure can have a social and economic impact on our communities. We have to act now in order to create a sustainable future for our communities.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Ville de Montréal is taking up its responsibilities in the fight against climate change and in the preservation of ecosystems and biodiversity. We are implementing sustainable solutions and welcome the government’s willingness to adapt its programs to the needs of municipalities in the context of climate change.”</p>\n\n<footer class=\"default\">Valérie Plante, Mayor of Montréal</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Rivière des Prairies and the other rivers of Greater Montréal flow through several municipalities in the region, making the metropolitan area vulnerable to flooding.</li>\n\t<li>The Ville de Montréal plans for the “Grand parc de l’Ouest” to cover 3,000 hectares, of which 1,600 hectares will be new protected areas. This vast park will connect Île-Bizard to the Parc-nature du Cap-Saint-Jacques, through the Parc-nature de L’Anse-à-l’Orme, the Parc-agricole du Bois-de-la-Roche, and the Morgan Arboretum. It will be eight times the size of Central Park in New York City and fifteen times the size of Mount Royal Park. The project includes organic vegetable farms, walking and cycling trails, and a river shuttle linking Île-Bizard to Pierrefonds-Ouest.</li>\n\t<li>The Disaster Mitigation and Adaptation Fund is a 10-year program that helps communities build the infrastructure they need to better withstand extreme weather events such as floods, wildfires, earthquakes, and droughts.</li>\n\t<li>The Disaster Mitigation and Adaptation Fund is part of the federal government’s Investing in Canada infrastructure plan, which is providing more than $180 billion over 12 years for public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and rural and northern communities.</li>\n\t<li>Of this amount, $26.9 billion supports green infrastructure projects that help communities cope with the intensifying effects of climate change and support Canada’s transition to a more resilient, low-carbon economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.infrastructure.gc.ca/dmaf-faac/index-eng.html\">Disaster Mitigation and Adaptation Fund</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada’s Long-Term Infrastructure Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/gmap-gcarte/index-eng.html\">Investing in Canada Plan Project Map</a></li>\n</ul></div>\n      "
}