{
  "path": "/en/news/readouts/2020/10/06/prime-minister-justin-trudeau-speaks-mayor-montreal-valerie-plante",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Mayor of Montréal Valérie Plante | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Mayor of Montréal Valérie Plante to discuss the COVID-19 pandemic.</p>\n\n<p>The Prime Minister and the Mayor spoke about the rising number of COVID-19 cases in Montréal. Prime Minister Trudeau restated his commitment to helping municipalities, provinces, and territories respond to the global COVID-19 pandemic and ensuring economic recovery.</p>\n\n<p>They discussed the funding for municipalities and public transport granted as part of the Safe Restart Agreement. The Prime Minister and the Mayor also spoke about the Rapid Housing Initiative, the housing agreement signed today by the governments of Canada and Quebec, and the homelessness situation in Montréal.</p>\n\n<p>The Prime Minister and the Mayor agreed on the importance of continuing to take action on these issues and of working together on the response to COVID-19, in order to protect the health and safety of the people of Montréal, and all Canadians.&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/01/prime-minister-announces-support-help-communities-create-jobs-and\">Prime Minister announces support to help communities create jobs and restart the economy</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2020/canada-rapidly-create-affordable-housing-support-homeless\">Canada to rapidly create affordable housing and support the homeless</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2020/canada-quebec-sign-housing-agreement\">Canada and Québec sign housing agreement</a></li>\n</ul></div>\n      "
}