{
  "path": "/en/news/news-releases/2021/05/18/prime-minister-trudeau-announces-additional-support-hard-hit-african",
  "pageTitle": "Prime Minister Trudeau announces additional support for hard-hit African economies | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The COVID-19 pandemic has caused unprecedented economic and social challenges worldwide. These effects have been particularly damaging for many of Canada’s partners in Africa.&nbsp;Canada is one of the leading contributors to the global fight against COVID-19, and we will continue to support this effort as we work to recover from the crisis – because we can’t beat the virus at home unless we beat it everywhere.</p>\n\n<p>Addressing the Summit on Financing African Economies, hosted by President of France, Emmanuel Macron, Prime Minister Justin Trudeau announced that Canada will accelerate its support for the African Development Bank’s (AfDB) Seventh General Capital Increase to maintain its ability to provide valuable financial assistance to its clients. This will help create economic growth and opportunity for people across Africa. In addition to this broader support, Canada will also provide $7 million over five years for the AfDB’s Africa Climate Change Fund to help people, and specifically women, across the continent adapt to the impacts of climate change.</p>\n\n<p>The Prime Minister also underlined the commitment in Budget 2021 to provide a $300 million recapitalization to FinDev Canada over three years, starting in 2023-24. This will allow FinDev Canada to support private sector growth to help developing countries reduce poverty, enhance women’s economic participation, and mitigate and adapt to climate change, including in Africa. He also announced the creation of 2X Canada: Inclusive Economic Recovery, a new $75.9 million facility in partnership with FinDev Canada to support low-income and underserved people, particularly women and girls, in sub-Saharan Africa, Latin America and the Caribbean.</p>\n\n<p>As part of Canada’s commitment to economic growth in Africa, Prime Minister Trudeau also announced funding of $15.2 million to the African Trade Policy Centre of the U.N. Economic Commission for Africa. This will support the implementation of the Africa Continental Free Trade Area, a key milestone in African economic integration that will create jobs and growth across the continent. Canada also recognizes that infrastructure investment is essential to a strong recovery from the pandemic. That’s why we will be providing $40 million in funding to GuarantCo to enhance affordable and sustainable infrastructure in low-income countries and fragile states.</p>\n\n<p>Prime Minister Trudeau also announced $5 million to the Regional Disease Surveillance Systems Enhancement Program through the World Bank, to strengthen national and regional capacity for disease surveillance and epidemic preparedness in West Africa, and to provide immediate and effective response in the event of emergencies.</p>\n\n<p>Since the start of this crisis, Canada has helped bring the global community together to propose creative solutions and build a recovery that works for everyone, including by recognizing the specific needs of African nations. As we finish the fight against COVID-19 and build back better, we will continue to support vulnerable countries and create a better future for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We can’t defeat this virus and build back better at home unless all countries have the resources to respond to and recover from this global challenge. With&nbsp;some of the fastest growing economies in the world, and with some of the youngest populations on the planet, Africa’s success and recovery is key to our shared future.&nbsp;Only together can we lay the foundations of a better world.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Summit on Financing African Economies brings together heads of state and government from Africa and around the world to respond to the specific financing needs to support a prompt, green, sustainable and inclusive recovery in Africa.</li>\n\t<li>The African Development Bank’s overarching objective is to foster sustainable economic growth, support social progress, and contribute to poverty reduction in its African member countries.</li>\n\t<li>The Africa Climate Change Fund is a multi-donor trust fund hosted by the African Development Bank; Canada’s support will help address the disproportionate impacts of climate change on women, particularly as it relates to agriculture.</li>\n\t<li>FinDev Canada is Canada’s Development Finance Institution and subsidiary of Export Development Canada that supports inclusive private sector growth and sustainability in developing markets.</li>\n\t<li>All 2X Canada investments will be qualified for the <a href=\"https://www.findevcanada.ca/en/who-we-are/our-partners/2x-challenge#:~:text=The%202X%20Challenge%20calls%20for,and%20services%20that%20enhance%20economic\">2X Challenge on Financing for Women</a> – a global commitment to mobilize capital that will enhance women’s economic participation. &nbsp;</li>\n\t<li>GuarantCo is part of the Private Infrastructure Development Group, and mobilises private sector local currency investment for infrastructure projects and supports the development of financial markets in lower income countries across Africa and Asia.</li>\n\t<li>On March 17, Canada announced a contribution of $132.9 million to establish the Canada-African Development Bank Climate Fund, which aims to enhance women’s economic rights and participation in climate action, and to mobilize private capital to fill the climate investment gap in Africa.</li>\n\t<li>Canada is a founding member of the Access to COVID-19 Tools (ACT) Accelerator and the COVID-19 Vaccines Global Access Facility (COVAX), and plays a major role within the Advance Market Commitment initiative.</li>\n\t<li>On May 7, Prime Minister Trudeau announced that $375 million proposed in Budget 2021 would be contributed to the Access to COVID-19 Tools (ACT) Accelerator to help facilitate the world’s poorest countries to access the tools necessary to help contain the spread of COVID-19.</li>\n\t<li>Since the start of this crisis, Canada has committed more than $2.5 billion to support the global COVID-19 response.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\"><em>Budget 2021 - A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/03/29/world-leaders-meet-strengthening-financial-measures-boost-efforts\">World leaders to meet on strengthening financial measures to boost efforts to cope with COVID-19 fallout</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/prime-minister-co-chairs-high-level-meeting-address-economic\">Prime Minister co-chairs high-level meeting to address economic devastation caused by COVID‑19 and announces new funding to fight the pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/world-leaders-focus-key-actions-assist-countries-battered-financial\">World leaders to focus on key actions to assist countries battered by the financial crisis caused by COVID-19</a></li>\n</ul></div>\n      "
}