{
  "path": "/en/news/news-releases/2022/08/13/chancellor-germany-olaf-scholz-visit-canada",
  "pageTitle": "Chancellor of Germany Olaf Scholz to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Chancellor of Germany, Olaf Scholz, will visit Montréal, Quebec, Toronto, Ontario, and Stephenville, Newfoundland and Labrador, from August 21 to 23, 2022.</p>\n\n<p>Prime Minister Trudeau will meet with Chancellor Scholz in Montréal to advance our shared priorities, including our unwavering support for Ukraine, protecting peace and security in Europe and around the world, and addressing the broader global impacts of Russia’s illegal and unjustifiable invasion. The leaders will also continue collaboration on ways the two countries can work together to safeguard energy security, and accelerate the global transition to clean energy, including through secure access to key resources like clean hydrogen and critical minerals. They will discuss taking strong climate action through policies like pollution pricing, and advancing the Canada-Germany trade relationship to benefit everyone and grow the middle class in both countries, including through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), bolstering science and innovation relations, and attracting investments, including in sectors like automotive and electric vehicle manufacturing, hydrogen and clean energy, and bio manufacturing and life sciences.</p>\n\n<p>While in Montréal, Prime Minister Trudeau and Chancellor Scholz will participate in a networking luncheon with German and Canadian business representatives to encourage investment and partnership opportunities, including in the critical minerals and automotive sectors. The leaders will then tour Mila, one of the three National Artificial Intelligence Institutes funded by the government’s <a href=\"https://ised-isde.canada.ca/site/ai-strategy/en\">Pan-Canadian Artificial Intelligence Strategy</a> to showcase Canada’s advances in artificial intelligence (AI) and highlight Canada and Germany’s cooperation to advance the responsible development and use of AI.</p>\n\n<p>Prime Minister Trudeau will then travel to Toronto, where on August 23, the eve of the Ukrainian Independence Day, he will participate in the virtual Summit for Heads of State and Government of the International Crimea Platform. Canada is an active supporter and participant of the International Crimea Platform, an initiative launched by Ukraine to enhance international advocacy and responses to Russia’s illegal annexation of Crimea. The Platform has much deeper implications this year in the face of Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>While in Toronto, Prime Minister Trudeau will also speak at the Canada-Germany Business Forum to promote greater cooperation between the two countries in response to current global challenges, particularly energy security and climate change.</p>\n\n<p>The two leaders will then travel to Stephenville, Newfoundland, to visit a hydrogen trade show where they will have the opportunity to speak to experts and view a variety of clean hydrogen projects, technologies, and services. Canada and Germany have a long history of collaborating to advance the development of a clean economy and this visit will be an opportunity to formally deepen this collaboration. Canadian and German researchers have been at the forefront of advancing clean hydrogen technologies with Canadian companies deploying their technologies in the German market and German companies investing in growing manufacturing capabilities in Canada.&nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Germany and Canada are close friends on the world stage. We are tied by our shared commitments to democracy, peace and security, including our support for Ukraine, a clean, healthy future, and an economy that works for people. I look forward to showing Chancellor Scholz what Canada has to offer, while we further strengthen our relationship, create jobs, and help grow the middle class in both countries.‎”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister and Chancellor Scholz last met in June on the margins of the G7 Summit in Elmau, Germany.</li>\n\t<li>Canada and Germany benefit from their strong cultural connections and people-to-people ties. Almost 10 per cent of Canadians claim at least partial German ancestry and about 400,000 Canadians travel to Germany each year. A similar number of people travel from Germany to Canada each year.</li>\n\t<li>Every year, several thousand German students spend a term or full year at a Canadian college, university, or high school. Thousands more young Germans and Canadians travel in each direction for short-term study and research or work as part of the International Experience Canada program.</li>\n\t<li>Germany is one of Canada’s most important sources of innovative, research, and engineering-intensive investment, with over 820 affiliates operating in Canada, employing nearly 70,000 Canadians. Germany is the 7th largest source of foreign direct investments into Canada.</li>\n\t<li>Germany is Canada’s largest merchandise export market in the European Union, and its sixth-largest trading partner globally, with two-way merchandise trade totalling $25.9&nbsp;billion in 2021.</li>\n\t<li>Canadian exports to Germany were worth $6.9&nbsp;billion in 2021, while Canada’s imports from Germany totalled $19.0&nbsp;billion. Sectors of interest include aerospace, advanced manufacturing, automotive, life sciences, information and communications technologies, and agri-food. Canada’s top merchandise exports include precious stones, machinery, mineral ores, scientific and precision instruments, electrical and electronic machinery and equipment, and inorganic chemicals.</li>\n\t<li>Investments in Canada by companies like Germany’s BASF for battery manufacturing demonstrate the strong and growing potential for collaboration in the clean technology space.</li>\n\t<li>In March 2022, and again in May 2022, Prime Minister Trudeau and Chancellor Scholz agreed to work together to advance adoption and expansion of carbon pricing around the world through Canada’s Global Carbon Pricing Challenge and Germany’s Climate Club. In May 2022, both Germany and Canada signed onto the G7 Hydrogen Action Pact.</li>\n\t<li>Long-standing partners in the North Atlantic Treaty Organization (NATO), Canada and Germany cooperate closely on security and defence issues, and are also both members of the G7 and G20, the Organisation for Economic Co-operation and Development (OECD), and the World Trade Organization (WTO).</li>\n\t<li>Canada and Germany are doing their part to contribute to NATO operations and activities along NATO’s eastern flank, in particular through their leadership of NATO Enhanced Forward Presence battle groups in Latvia and Lithuania, respectively.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/07/05/prime-minister-justin-trudeau-speaks-chancellor-germany-olaf-scholz\">Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/28/prime-minister-announces-additional-support-ukraine-and-shared\">Prime Minister announces additional support for Ukraine and shared priorities at</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}