{
  "path": "/en/news/news-releases/2016/10/01/prime-minister-announces-gift-mark-royal-tour-duke-and-duchess",
  "pageTitle": "Prime Minister announces gift to mark the Royal Tour of The Duke and Duchess of Cambridge | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the Government of Canada’s official gift to mark the Royal Tour of Their Royal Highnesses, The Duke and Duchess of Cambridge.</p>\n<p>The official gift is a donation of $100,000, which will be divided equally between two worthy initiatives.</p>\n<p>The first $50,000 contribution will go to Prince’s Charities Canada (PCC), and will be used to promote education in Canada’s Indigenous communities and help more young people reach their full potential. It will also be used to help preserve Indigenous languages in Canada.</p>\n<p>The second contribution of $50,000 will be given to the Immigrant Services Society of British Columbia to help assist newcomers with housing, employment, and language skills.</p>\n<p>Canada looks forward to more visits from the Royal Family. We hope they will be part of the upcoming celebrations to mark our 150<sup>th</sup> anniversary of Confederation.</p>\n<p><strong>Quote</strong></p>\n<p>“In keeping with tradition, I am honoured to mark the visit by The Duke and Duchess of Cambridge with a gift that will help both Indigenous youth as well as newcomers to Canada realize their dreams. Canadians have a real affection for the Royal family which was once again very much on display during this tour.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>This is the second official Canadian tour for the Duke and Duchess of Cambridge. Their first Royal Tour was in 2011.</li>\n<li>The work of Prince’s Charities Canada focuses on The Prince of Wales’s main interests which include helping disadvantaged youth, education, responsible business, environmental sustainability and support for the Canadian Armed Forces, among others.&nbsp;</li>\n<li>PCC works with existing Canadian charities and provides opportunities for charitable organizations in Canada and the U.K. to work together.</li>\n<li>The Immigrant Services Society of British Columbia has been providing support services for immigrants and refugees since 1972.</li>\n<li>It provides targeted programs for refugees, women, children and youth and is the largest agency of its kind in Western Canada.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.princescharities.ca/\">Prince's Charities Canada</a></li>\n<li><a href=\"https://issbc.org/\">Immigrant Services Society of British Columbia</a></li>\n</ul></div>\n      "
}