{
  "path": "/en/news/news-releases/2019/03/18/prime-minister-announces-change-leadership-public-service",
  "pageTitle": "Prime Minister announces a change in the leadership of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced his intention to name Ian Shugart as Clerk of the Privy Council and Secretary to the Cabinet. Mr. Shugart, who is currently the Deputy Minister of Foreign Affairs, will assume the new role in the coming weeks.</p>\n\n<p>The Clerk of the Privy Council and Secretary to the Cabinet, Michael Wernick, earlier today&nbsp;<a href=\"https://www.canada.ca/en/privy-council/news/2019/03/statement-from-the-clerk-of-the-privy-council.html\">announced his upcoming retirement</a>&nbsp;following nearly 38 years of distinguished public service.</p>\n\n<p>The Prime Minister took the opportunity today to thank Mr. Wernick for his many years of service marked by dedication and excellence in serving Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Ian Shugart will bring with him a wealth of experience to the role of Clerk of the Privy Council and Secretary to the Cabinet. Having served as a deputy minister in three different departments, Mr. Shugart is well-placed to lead the federal Public Service as it continues to implement the Government of Canada’s agenda and deliver high-quality service to Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I thank Michael Wernick for his many years of service to Canada and Canadians. Since 1981, he has distinguished himself as a dedicated public servant, focused on building a modern, agile, and world-class Public Service that places the needs of Canadians at the forefront of its work. I also thank him for his support over the last few years as we worked to implement an ambitious agenda to build a better future for the people and communities at the heart of this country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/03/18/ian-shugart\">Ian Shugart</a></li>\n</ul></div>\n      "
}