{
  "path": "/en/news/news-releases/2017/11/09/prime-minister-concludes-official-visit-vietnam",
  "pageTitle": "Prime Minister concludes official visit to Vietnam | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Hanoi and Ho Chi Minh City, Vietnam, and will now travel to Da Nang, Vietnam, to attend the Asia Pacific Economic Cooperation (APEC) Leaders’ Meeting on November 10 and 11.</p><p>While in Hanoi, Prime Minister Trudeau met with the Prime Minister of Vietnam, Nguyễn Xuân Phúc. Together, they announced a comprehensive partnership that will enhance cooperation between Canada and Vietnam, grow both economies, and strengthen the middle class.</p><p>During his meetings with Vietnamese leaders, Prime Minister Trudeau emphasized the importance of Canadian values, including respect for human rights, diversity, inclusion, and gender equality. The leaders also explored ways to deepen relations between both countries, increase trade and investment, and bolster our shared prosperity.</p><p>In Ho Chi Minh City, Prime Minister Trudeau visited the Stock Exchange, where he participated in a gong ceremony and met with Canadian and Vietnamese business leaders to discuss the benefits of progressive trade. Finally, he spoke to students at Ton Duc Thang University about the value of education, youth empowerment, and the strong educational connections between both countries.</p><h2>Quote</h2><blockquote><p>“I thank Prime Minister Phúc and the people of Vietnam for their warmth and hospitality. I am encouraged by our joint partnership agreement and know it will go a long way in advancing our ongoing dialogue on the promotion and protection of human rights, and creating opportunities for our middle class.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Prime Minister Trudeau also met with the President of Vietnam, Trần Đại Quang, the Chair of the National Assembly, Nguyễn Thị Kim Ngân, the Chairman of the People’s Committee, Nguyễn Thanh Phong, and the General Secretary of the Communist Party of Vietnam, Nguyễn Phú Trọng.</li><li>Discussions with Vietnamese leaders focused on advancing human rights; closer collaboration on areas of mutual interest, including trade and investment; and the important contribution of the large Vietnamese diaspora in Canada to strengthening people-to-people links.</li><li>Canada and Vietnam have strong diplomatic relations that were established in 1973.</li><li>Vietnam is Canada’s largest trading partner in the ASEAN region. In 2016, two-way merchandise trade between Canada and Vietnam totalled $5.5 billion.</li><li>Since 1990, Canada has provided over $1.3 billion to support development and poverty reduction initiatives in Vietnam.</li><li>Approximately 240,000 people of Vietnamese origin call Canada home, and there are more Vietnamese students studying in Canada than from any other country in Southeast Asia.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/vietnam/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Vietnam Relations</a></li><li><a href=\"http://international.gc.ca/global-markets-marches-mondiaux/markets-marches/vietnam.aspx?lang=eng\">Vietnam Fact Sheet</a></li><li><a href=\"/en/news/statements/2017/11/07/joint-statement-canada-and-socialist-republic-vietnam-establishment\">Joint Comprehensive Partnership</a></li></ul></div>\n      "
}