{
  "path": "/en/news/news-releases/2016/09/02/prime-minister-strengthens-commercial-ties-china-during-successful",
  "pageTitle": "Prime Minister strengthens commercial ties with China during successful visit to Shanghai | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to build and renew relationships with international partners in order to increase trade, attract international investment, and grow Canada’s middle class.</p>\n<p>As part of his official visit to China, the Prime Minister, Justin Trudeau, visited Shanghai over the past two days where he met with local business and government leaders.</p>\n<p>In meetings with members of the Canada China Business Council and in roundtables with women entrepreneurs, the Prime Minister discussed how to strengthen Canada’s commercial ties with China – especially how to open doors for small and medium-sized enterprises. He also expressed that Canada welcomes investment from China that will generate jobs and enhance economic growth back home.</p>\n<p>Today’s meetings emphasized the importance of building relationships with international partners over time that result in new opportunities for the middle class and those working hard to join it.</p>\n<p>The Prime Minister also welcomed $1.2 billion in commercial signings between Canadian and Chinese companies, which will help grow Canada’s economy and create new jobs for middle class Canadians.&nbsp;&nbsp;</p>\n<p><strong>Quotes</strong></p>\n<p>\"It was great to be in Shanghai and witness exciting new business deals signed between Canadian and Chinese companies in such a wide range of fields. We will continue to strengthen relationships with individuals and companies around the world, with the aim of growing our economy and middle class back home.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>\"In meetings with government and business leaders – including women entrepreneurs – we explored ways of connecting even more Canadian businesses, especially small and medium-sized enterprises, to the increasingly important Chinese market. I am encouraged by the discussions today, and know they will go a long way in fostering understanding between our two countries and creating opportunities for our middle class.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>In Shanghai, the Prime Minister also continued his efforts to build stronger ties and a deeper understanding between the citizens of both countries, with a focus on education, tourism, and culture.</li>\n<li>He visited Shanghai Nanyang Model High School where he touted the quality of Canadian education and promoted the role of youth in global issues.&nbsp;</li>\n<li>He met with Daniel Lamarre, the CEO of Cirque du Soleil, and his Chinese partner, Fosun, with whom he spoke about the success of the iconic Canadian entertainment company.</li>\n<li>Tomorrow, the Prime Minister heads to Hangzhou where he will participate in the G20 Leaders’ Summit.</li>\n<li>China is the world's second largest economy, and Canada's second-largest single-country trading partner.</li>\n<li>Two-way merchandise trade between Canada and China amounted to nearly $85.8 billion in 2015.</li>\n<li>In 2015, bilateral trade with China increased 10.1 per cent over 2014.</li>\n<li>Canada's two-way foreign direct investment (FDI) relationship with China reached $33 billion at the end of 2015.</li>\n<li>Shanghai is the most populous city in China with nearly 24 million people.</li>\n<li>Shanghai has the world's busiest container port, which handled 35.29 million TEUs (Twenty-foot Equivalent Unit) in 2014.&nbsp;&nbsp;</li>\n<li>Canada’s Trade Commissioner Service offers 15 points of service in China, staffed by a team of over 100 trade commissioners.</li>\n<li>Canadians of Chinese descent make up approximately 4.5 per cent of Canada's population.</li>\n</ul>\n<p><strong><br>Related Product</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/09/01/strengthening-canada-china-commercial-relationship\">Strengthening of Canada-China Commercial Relationship</a></li>\n</ul>\n<p></p></div>\n      "
}