{
  "path": "/en/news/news-releases/2017/08/29/prime-minister-announces-support-gender-equality-and-resilience",
  "pageTitle": "The Prime Minister announces support for gender equality and resilience-building programs in the Middle East | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today met with His Majesty King Abdullah II of Jordan to deepen the already strong partnership that exists between the two countries.</p><p>Prime Minister Trudeau announced $45.3 million to support projects that promote economic development, the empowerment of women, and the resilience of refugee-hosting communities in Jordan and the Middle East.</p><p>During their meeting, Prime Minister Trudeau and His Majesty King Abdullah II discussed&nbsp;Canada’s and Jordan’s shared commitment to regional security and stability, human rights, and a more prosperous Middle East. The two leaders also discussed Canada’s multi-year commitment to&nbsp;address the ongoing crises in Iraq and Syria and the impact they have on the surrounding region.</p><h2>Quote</h2><blockquote><p>“Canada is proud to support Jordan in the exemplary work they are doing on behalf of the wider international community. We are especially proud to support projects that serve Syrian refugees and Jordanians, while advancing the empowerment of women and girls. We will continue to work with Jordan to help ensure its continued stability and prosperity.”<br> <cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is His Majesty King Abdullah II’s fifth visit to Canada since his ascension to the throne in February 1999.</li><li>Canada is becoming an increasingly important trade and investment partner for Jordan since the implementation of the Canada-Jordan Free Trade Agreement. Further commercial cooperation will serve to support the middle class in both Canada and Jordan.</li><li>Through development and humanitarian assistance programs, Canada supports the Government of Jordan’s efforts to provide a safe haven for over 660,000 registered Syrian refugees who have taken sanctuary in the country.&nbsp;</li><li>Canada and Jordan are members of the 73-country Global Coalition against Daesh, which is committed to degrading and defeating Daesh, countering violent extremism, and restoring regional security.</li></ul><h2>Related product</h2><ul><li>Backgrounder:&nbsp;<a href=\"/en/news/backgrounders/2017/08/29/canada-provides-support-initiatives-jordan-and-middle-east\">Canada provides support for initiatives in Jordan and the Middle East</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/jordan-jordanie/bilateral_relations_bilaterales/canada_jordan-jordanie.aspx?lang=eng\">Canada-Jordan Relations</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/jordan-jordanie/fta-ale/background-contexte.aspx?lang=eng\">Canada-Jordan Free Trade Agreement</a></li><li><a href=\"http://www.treaty-accord.gc.ca/text-texte.aspx?id=105176&amp;lang=eng\">Canada-Jordan Foreign Investment Protection Agreement</a></li><li><a href=\"http://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/where-ou/jordan-jordanie.aspx?lang=eng\">Canada’s international assistance in Jordan</a></li><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/middle_east-moyen_orient/index.aspx?lang=eng\">Canada's Middle East engagement strategy</a></li><li><a href=\"http://theglobalcoalition.org/en/home/\">The Global Coalition against Daesh</a></li></ul></div>\n      "
}