{
  "path": "/en/news/news-releases/2017/10/23/ukrainian-prime-minister-volodymyr-groysman-visit-canada",
  "pageTitle": "Ukrainian Prime Minister Volodymyr Groysman to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will meet with the Prime Minister of Ukraine, Volodymyr Groysman, in Ottawa on October 31.</p><p>During the meeting, Prime Minister Trudeau and Prime Minister Groysman will explore ways to deepen the relationship between Canada and Ukraine, including through the trade and business opportunities created by the Canada-Ukraine Free Trade Agreement.</p><p>Prime Minister Trudeau will also reiterate Canada’s unwavering support for the people of Ukraine, its sovereignty and territorial integrity, and its democratic, economic, and legal reform efforts.</p><h2>Quote</h2><blockquote><p>“Canada and Ukraine have a long history of friendship forged through generations of family ties and shared values. I look forward to meeting with Prime Minister Groysman to discuss how we can work together to build a more prosperous and secure future for both of our countries.”<br><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>There have been many high-level visits between Canada and Ukraine, the most recent being when Prime Minister Trudeau met President Poroshenko on September 22, 2017, in Toronto on the margins of the Invictus Games.</li><li>Canada and Ukraine cooperate in several international organizations, including the United Nations, the Organization for Security and Cooperation in Europe, and La Francophonie.</li><li>Operation UNIFIER is the Canadian Armed Forces (CAF) training mission in Ukraine. Through Operation UNIFIER, the CAF provide military training and capacity-building assistance to Ukrainian Forces personnel in support of Ukraine’s efforts to maintain sovereignty, security, and stability.</li><li>The Canada-Ukraine Free Trade Agreement, which entered into force August 1, 2017, represents a significant milestone in the countries’ bilateral relationship, and will generate commercial benefits for Canadian and Ukrainian businesses alike.</li><li>Canada-Ukraine bilateral merchandise trade increased 34 per cent in 2016.</li><li>In 2016, Canada’s merchandise exports to Ukraine totalled $265.2 million and merchandise imports totalled $107.4 million.</li></ul><h2>Associated Links</h2><ul><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"http://www.canadainternational.gc.ca/ukraine/bilateral_relations_bilaterales/index.aspx?lang=enghttp://www.canadainternational.gc.ca/ukraine/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Ukraine Relations</a></span></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"http://www.forces.gc.ca/en/operations-abroad/op-unifier.page\">Operation UNIFIER</a></span></li></ul></div>\n      "
}