{
  "path": "/en/news/news-releases/2020/10/08/new-commitment-battery-electric-vehicle-manufacturing-ontario",
  "pageTitle": "New commitment to battery-electric vehicle manufacturing in Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we continue to address the health, social, and economic impacts of COVID-19, we are also working toward a sustainable and greener economic recovery that will create new jobs and opportunities for workers and businesses alike. This is why we are supporting measures to accelerate our country’s clean energy transition, making zero-emission vehicles (ZEV) more affordable while investing in more charging stations across the country. This work will help ensure we can become a leading destination for the design, development, and manufacturing of the sustainable technologies of the future.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Ontario, Doug Ford, today announced their commitment to Ford Motor Company of Canada’s investment in its Oakville Assembly Complex. This project, valued at $1.8 billion, will include federal and provincial contributions of $295 million each. This will help secure 5,400 well-paying middle class jobs across Ford’s production workforce in Canada and grow our green economy, especially in Southern Ontario where thousands of Canadians are employed across the auto supply chain. A repurposed battery-electric vehicle (BEV) production plant for the Oakville Assembly Complex is in line with the Government of Canada’s commitment to sustainable growth. Electrification will allow us to position the innovative Canadian automotive industry as a global leader in BEV manufacturing.</p>\n\n<p>Together, we continue to help build a Canada that is healthier and safer, cleaner and more competitive, and fairer and more inclusive for future generations. Our recovery from COVID-19 will help us create more economic opportunities for Canadians while meeting our ambition of net-zero carbon emissions by 2050. We will do so by working with industry to attract ZEV manufacturing facilities through large-scale investments. The Government of Canada and the Government of Ontario are committed to working with Canada’s automotive partners, including Ford and Unifor, to attract investment, including in zero-emissions technologies, and to ensure that our automotive industry remains one of the most competitive in the world.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is a testament to Canada’s attractiveness as a destination for clean technology, talent, and infrastructure in the automotive industry. Companies like Ford are helping accelerate our transition to a low-carbon, clean-growth economy, which will help protect our environment, drive innovation, and create many good middle class jobs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s investment from Ford Canada is historic. It will ensure our province continues to lead North America and the world in automotive manufacturing and innovation, while boosting our competitiveness in this key sector. Together with our federal partners, we are proud to invest almost $300 million to support the production of next-generation, made-in-Ontario vehicles and secure thousands of good-paying jobs across the province for years to come.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is committed to making investments that create good middle class jobs and give Canada a competitive advantage in the clean economy of the future. Today’s announcement will provide consumers with affordable, world-class, made-in-Canada zero-emission vehicles and provide sustainable jobs for generations of Canadian workers.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“This investment will position Canada as a global leader in battery-electric vehicle manufacturing and secures 5,400 good, green, middle class jobs for thousands of Canadian autoworkers. Our government will continue to create economic opportunities in ways that will also help us meet our ambition of net-zero carbon emissions by 2050. Ford Motor Company of Canada is a vital part of Canada’s journey toward an electric future of sustainable growth, dependable jobs, and global leadership.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Any region seeking a long-term future in auto manufacturing must be adding value at every stage of the supply chain, particularly in the two technologies shaping the next generation of vehicles: zero-emissions and connected and autonomous. Bolstered by strategic government partnerships, Ontario is now at the leading edge. This ongoing collaboration between industry, government and labour will be essential as we face the immense economic challenges of COVID-19 and build for the future.”</p>\n\n<footer class=\"default\">The Hon. Vic Fedeli, Ontario's Minister of Economic Development, Job Creation and Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“With this investment, Ford will expand its award-winning portfolio to include a family of battery-electric SUVs built at Oakville Assembly, marking the first time ever that a full-line automaker has produced full BEVs in Canada for the North American market.”</p>\n\n<footer class=\"default\">Dean Stoneley, President and CEO, Ford Motor Company of Canada, Ltd.</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canadian government understands that the auto industry is essential to building back our economy and the Prime Minister must be commended for his vision and leadership in making this significant investment that will secure good jobs for our members for decades to come.”</p>\n\n<footer class=\"default\">Jerry Dias, National President, Unifor</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Ford is a global automotive company manufacturing and servicing a range of vehicles. The company employs approximately 8,000 people in Canada, including three vehicle assembly and engine manufacturing plants, two parts distribution centres, two research and development sites, and three connectivity and innovation centres. Approximately 18,000 people also work at more than 400&nbsp;Ford and Ford-Lincoln dealerships across Canada.</li>\n\t<li>The automotive sector is one of Canada’s largest manufacturing sectors with over 500,000 direct and indirect jobs, contributing $16 billion to Canada’s gross domestic product (GDP) and is one of the country’s largest export industries.</li>\n\t<li>Through the Pan-Canadian Framework on Clean Growth and Climate Change, the Government of Canada committed to deliver on an ambitious national strategy to put more zero-emission vehicles on the road.</li>\n\t<li>As of August 31,&nbsp;2020, over 56,000 Canadians have purchased an eligible zero‑emission vehicle through the iZEV program, totalling more than $239 million in rebates.</li>\n\t<li>The Government of Canada has provided over $300 million to support the establishment of a coast-to-coast network of fast chargers for electric vehicles, natural gas, and hydrogen refuelling stations as well as the research, demonstration, and development of next-generation charging technologies and enabling codes and standards. These investments will help Canadians safely and reliably charge their ZEVs where they live, work, and play.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n\t<li><a href=\"https://www.ford.ca/\">Ford Motor Company of Canada</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/energy-efficiency-transportation/electric-and-alternative-fuel-infrastructure/22823\">Electric and Alternative Fuel Infrastructure</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/climate-change/green-infrastructure-programs/electric-vehicle-infrastructure-demonstration-evid-program/20467\">Electric Vehicle Infrastructure Demonstration (EVID) Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/business-investment-in-zero-emission-automotive-vehicles-and-equipment.html\">Business investment in Zero-Emission Automotive Vehicles and Equipment</a></li>\n</ul></div>\n      "
}