{
  "path": "/en/news/news-releases/2019/03/25/new-measures-address-housing-affordability-across-canada",
  "pageTitle": "New measures to address housing affordability across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves a safe and affordable place to call home. But in some of our communities, too many people struggle to find an affordable place to live, because there are not enough houses to buy, or apartments to rent.</p>\n\n<p>The Government of Canada is working hard to meet these challenges. In 2017, we launched Canada’s first ever National Housing Strategy – and with Budget 2019, we are proposing significant new measures to make sure all Canadian families can find a good quality, affordable place to call home.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Maple Ridge, British Columbia, to highlight Budget 2019 measures to increase the supply of housing and make housing more affordable and accessible for people across the country.</p>\n\n<p>With this year’s budget, the Government of Canada is expanding the Rental Construction Financing Initiative to build more rental units in communities across Canada. This would help keep rental prices stable and competitive, and provide more affordable rental options. Budget 2019 also proposes a Housing Supply Challenge, which would invite municipalities and other organizations to propose innovative solutions to help get more new housing built. In addition, to make housing more affordable for those looking to buy their first home, we are modernizing the Home Buyer’s Plan. For the first time in ten years, we are increasing the amount that first-time home buyers can withdraw from their Registered Retirement Savings Plan without adding to their income for the year, from $25,000 to $35,000.</p>\n\n<p>To help ensure British Columbians have the housing they need, Budget 2019 proposes support for the Expert Panel on the Future of Housing Supply and Affordability. The Expert Panel – a joint initiative of the Government of Canada and the Province of British Columbia – will examine trends in rental and homeownership. It will consult with stakeholders to provide advice on new approaches to better meet the future housing needs of British Columbians and all Canadians.</p>\n\n<p>Through Budget 2019, the government also announced the First-Time Home Buyer Incentive, a landmark new program that will make it easier for more Canadians to buy their first home. Under the program, eligible first-time home buyers could share a part of the cost of buying a home with the Canada Mortgage and Housing Corporation (CMHC). For eligible buyers, the program would both reduce the size of their insured mortgage and lower monthly mortgage payments. That means more money for Canadians to put toward the things that matter to them – from furthering their education, to putting their kids in sports, to saving for retirement.</p>\n\n<p>Together, these measures will help housing prices grow at a more moderate pace and make it easier and more affordable for more Canadians to rent or buy a home, while keeping markets accessible for future generations. They will play a key role in our plan to help all Canadians build a better future for themselves and their families.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Too many Canadian families are being priced out of buying or renting where they live, because there are not enough homes to keep up with the demand. Safe, affordable homes give Canadian families the stability and opportunities they need to thrive in their communities. Our government is taking action to increase the housing supply in communities across the country, make housing more affordable for more Canadians, and make sure our cities remain great places to live, now and into the future.”&nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Over three years, the Government of Canada invested over $826 million for housing in British Columbia, including support for the construction of more than 8,000 new housing units.</li>\n\t<li>Budget 2019, <em>Investing in the Middle Class</em>, is the government’s plan to create more good well-paying jobs, put homeownership within reach of more Canadians, help working people get the training they need to succeed, support seniors, and lay the foundation for national pharmacare.</li>\n\t<li>The First-Time Home Buyer Incentive, administered by the CMHC, would help eligible Canadians with a household income under $120,000 per year afford to buy their first home.</li>\n\t<li>Through the new Incentive, the CMHC would provide 5 per cent of the value of a home for a first-time homebuyer through a shared investment.</li>\n\t<li>To encourage the construction of new housing supply, the Incentive would increase to 10 per cent for a newly-built home.</li>\n\t<li>Additional information about the First-Time Home Buyer Incentive will be released by CMHC later this year.</li>\n\t<li>Budget 2019 proposes to expand the Rental Construction Financing Initiative, by making an additional $10 billion over nine years available in financing to help build 42,500 new affordable rental units across the country.</li>\n\t<li>It would also provide $300 million to launch a new Housing Supply Challenge through the Impact Canada Initiative.&nbsp;</li>\n\t<li>The Expert Panel on the Future of Housing Supply and Affordability will be comprised of leaders and specialists in a range of fields, who will consult to identify and evaluate measures that could build on recent investments and initiatives to increase the supply of housing to meet demand in British Columbia.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/home-accueil-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\">Canada’s National Housing Strategy</a></li>\n\t<li><a href=\"https://cmhc-schl.gc.ca/en/nhs/rental-construction-financing-initiative\">Rental Construction Financing Initiative</a></li>\n\t<li><a href=\"https://www.fin.gc.ca/n19/19-021-eng.asp\">Expert Panel on the Future of Housing Supply and Affordability</a></li>\n\t<li><a href=\"https://impact.canada.ca/en\">Impact Canada Initiative</a></li>\n</ul></div>\n      "
}