{
  "path": "/en/news/statements/2023/01/04/statement-prime-minister-national-ribbon-skirt-day",
  "pageTitle": "Statement by the Prime Minister on National Ribbon Skirt Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Ribbon Skirt Day:</p>\n\n<p>“Today, I join all those across Canada who are marking the first National Ribbon Skirt Day, whether that be through celebration, ceremony, or with community. Every year from now on, January 4 will be an opportunity for us all to learn more about and to celebrate Indigenous cultures, traditions, histories, and contributions to this diverse country.</p>\n\n<p>“Passed unanimously into law by Parliament last month, National Ribbon Skirt Day originates with the story of Isabella Kulak. A member of Cote First Nation, Saskatchewan, Isabella was shamed for wearing her handmade ribbon skirt to a formal wear day at her elementary school. Traditionally worn by First Nations and Métis peoples, ribbon skirts are a centuries-old symbol of identity, adaptation, and survival for Indigenous women, girls, and gender-diverse people, and represents a direct connection to Mother Earth. Isabella’s story shone a light on the enduring injustices, racism, and discrimination faced by First Nations, Inuit, and Métis in Canada every day, and on the importance of the role we all have to play in making sure that what happened never happens again to anyone in Canada.</p>\n\n<p>“Raising awareness of and protecting the unique and deeply personal traditions of Indigenous communities is essential to advancing reconciliation as a society, as well as building relationships and connections based on mutual respect and understanding. The Government of Canada is working in partnership with Indigenous Peoples to protect and promote their cultures and traditions, which are critical to the vitality and well-being of their communities. This includes our ongoing efforts through the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway to Address Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People</a> to assist in the revitalization and strengthening of Indigenous cultures and identity. We also continue to work closely with First Nations, Inuit, and Métis to implement the <a href=\"https://www.justice.gc.ca/eng/declaration/index.html\"><em>United Nations Declaration on the Rights of Indigenous Peoples Act</em></a> and develop an action plan that will help ensure the inherent rights of all Indigenous Peoples are respected. These are important steps in our ongoing work to renew our nation-to-nation, Inuit-Crown, and government-to-government relationships through respect, healing, and cooperation.</p>\n\n<p>“This National Ribbon Skirt Day, I invite everyone to learn from Indigenous Peoples about their cultures and histories – from languages to traditional ceremonies and regalia to ancestral ties to the land. Together, let us amplify Indigenous voices and stand up against racism and discrimination to build a better society for everyone.”</p></div>\n      "
}