{
  "path": "/en/news/news-releases/2018/12/31/canada-concludes-successful-g7-presidency",
  "pageTitle": "Canada concludes successful G7 Presidency | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As the 2018 G7 President, Canada brought countries together to create good, middle class jobs, invest in economic growth that benefits everyone, advance gender equality and women’s empowerment, uphold peace and security, fight climate change, protect our oceans, and promote clean energy.</p><p>Tomorrow, Canada will officially hand over the G7 Presidency to France, which assumes the Presidency for 2019. To mark the occasion, the Prime Minister, Justin Trudeau, highlighted key accomplishments Canada and its partners achieved over the past year.</p><p>During the G7 Leaders’ Summit in June, world leaders discussed the future of the economy and their shared responsibility to create sustainable economic growth that benefits everyone, particularly those at risk of being left behind. They also made progress on defending our democracies against foreign threats, fighting climate change and protecting our oceans, and advancing gender equality and women’s empowerment.</p><p>Canada created the Gender Equality Advisory Council to ensure gender equality and the empowerment of women and girls guided all discussions and activities of its Presidency. During the Leaders’ Summit, Canada and partners committed nearly $3.8&nbsp;billion to support quality education for women and girls in crisis and conflict situations—the largest of its kind ever made. A few months later, during the United Nations General Assembly, Canada welcomed an additional $527 million from partners to help developing countries give every child access to quality education and modern skills training. These unprecedented commitments recognize that education is the key to advancing gender equality and achieving a more equal, inclusive world.</p><p>Canada also brought countries together to fight climate change and protect our oceans and coastal communities. The Canada-led <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a>, launched at the Leaders’ Summit and since endorsed by 16 countries and 20 companies, outlines concrete actions to combat marine plastic litter and protect our oceans for generations to come. The recent <a href=\"http://www.dfo-mpo.gc.ca/campaign-campagne/bec-ceb/index-eng.html\">Sustainable Blue Economy Conference</a>, co-hosted by Canada, Kenya, and Japan, built on Canada’s G7 leadership to safeguard our oceans and support resilient coasts and coastal communities.</p><p>During its 2019 G7 Presidency, France will carry forward the key themes that Canada championed as President, including addressing inequality, promoting gender equality and access to education, fighting climate change, and protecting our oceans. We look forward to working with France and other G7 partners next year to continue making progress on these crucial challenges.</p><h3>Quotes</h3><blockquote><p>“The commitments, investments, and joint initiatives from Canada’s G7 Presidency will make a difference for millions of people around the world. From ridding our oceans of plastic, to giving vulnerable women and girls the education they need, G7 leaders and partners have shown once again what happens when we work together, and take ambitious action for people and our planet.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><blockquote><p>“As leaders of the G7, we share a responsibility to strengthen the middle class and help people deal with the uncertainty of a changing world. I am confident that France will build on the momentum and progress from Canada’s G7 Presidency and bring us closer to a more equal, secure, and prosperous world.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h3>Quick Facts</h3><ul><li>Canada assumed Presidency of the G7 on January 1, 2018, and hosted the G7 Summit in the Charlevoix region of Quebec on June 8 and 9, 2018.</li><li>Over the past year, Canada advanced domestic and international priorities framed by the following five key themes:</li><ul><li>Investing in growth that works for everyone;</li><li>Preparing for jobs of the future;</li><li>Advancing gender equality and women’s empowerment;</li><li>Working together on climate change, oceans and clean energy; and</li><li>Building a more peaceful and secure world.</li></ul><li>Members of the Gender Equality Advisory Council participated in the G7 Summit and in each of the G7 ministerial meetings. The Council’s report&nbsp;<a href=\"https://g7.gc.ca/en/g7-presidency/gender-equality-advisory-council/recommendations/\">Make Gender Inequality History</a>&nbsp;provided recommendations that informed the discussions and decision-making during the G7 Summit and will continue to inspire work moving forward.</li><li>To promote accountability and transparency, G7 members released the first G7 progress report on women’s economic empowerment—<i>The Charlevoix Progress Report.</i>&nbsp;This report highlights how efforts made by G7 countries and the European Union, as well by civil society, advocacy groups, and the private sector, are empowering women in developing countries and leading to positive change.</li><li>France’s G7 Presidency will also make gender equality a key priority, and will continue the Gender Equality Advisory Council.</li><li>Canada welcomed an additional 16 world leaders and heads of international organizations to the G7 Summit to take part in a special outreach session focused on healthy oceans and resilient coastal communities. As part of the outreach, the Prime Minister also held a roundtable discussion with leaders of Small Island Developing States.</li><li>In addition to the G7 Summit, Canada hosted four ministerial meetings in Montréal, Toronto, Whistler, and Halifax, meetings of over 20 working groups, and public dialogues in 11 cities in order to engage international and domestic stakeholders, as well as Canadians from coast to coast to coast. Over 15,000 Canadians shared their voices and perspectives to help shape the 2018 G7 agenda.</li><li>The G7 Summit concluded with a G7 leaders’ communique and the following seven commitment documents:<ul><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-commitment-equality-economic-growth/\">Charlevoix Commitment on Equality and Economic Growth</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-commitment-innovative-financing-development/\">Charlevoix Commitment on Innovative Financing for Development</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-common-vision-future-artificial-intelligence/\">Charlevoix Common Vision for the Future of Artificial Intelligence</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-declaration-quality-education-girls-adolescent-girls-women-developing-countries/\">Charlevoix Declaration on Quality Education for Girls, Adolescent Girls and Women in Developing Countries</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-commitment-end-sexual-gender-based-violence-abuse-harassment-digital-contexts/\">Charlevoix Commitment to End Sexual and Gender-Based Violence, Abuse and Harassment in Digital Contexts</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-commitment-defending-democracy-from-foreign-threats/\">Charlevoix Commitment on Defending Democracy from Foreign Threats</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-blueprint-healthy-oceans-seas-resilient-coastal-communities/\">Charlevoix Blueprint for Healthy Oceans, Seas and Resilient Coastal Communities including the Ocean Plastics Charter</a></li></ul></li><li>The country that holds the G7 Presidency sets the agenda for the year, and is responsible for hosting and organizing the Leaders' Summit, ministerial meetings, and other associated events.</li><li>The G7 is an informal grouping of seven of the world’s most advanced economies, consisting of Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States. The European Union was first invited to attend the G7 in 1977, but is not part of the hosting rotation.</li></ul><h3>Associated Links</h3><ul><li><a href=\"https://g7.gc.ca/en/\">Canada’s 2018 G7 Presidency</a></li><li><a href=\"/en/news/news-releases/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and\">Canada and partners announce historic investment in education for women and girls in crisis and conflict situations</a></li><li><a href=\"/en/news/news-releases/2018/06/10/prime-minister-concludes-successful-g7-summit-focused-creating\">Prime Minister concludes successful G7 Summit focused on creating economic growth that benefits everyone</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-g7-summit-communique/\">The Charlevoix G7 Summit Communiqué</a></li><li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-12-18-charlevoix-progress_report-rapport_etape.aspx?lang=eng\">The Charlevoix Progress Report: Women’s Economic Empowerment as a Driver for Innovation, Shared Prosperity and Sustainable Development</a></li></ul></div>\n      "
}