{
  "path": "/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid",
  "pageTitle": "Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The COVID-19 outbreak continues to evolve rapidly, and the government is mobilizing Canadian businesses and manufacturers to help fight the spread of the virus and protect the health and safety of all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced Canada’s Plan to Mobilize Industry to fight COVID-19, which will create pathways to deploy resources to domestic manufacturers and businesses so they can help during this critical time.</p>\n\n<p>The Plan introduces new measures to directly support these businesses to rapidly scale up production or re-tool their manufacturing lines to develop products made in Canada that will help in the fight against COVID-19. These products could include critical health and safety supplies and equipment, including personal protective equipment, sanitization products, diagnostic and testing products, and disease tracking technology.</p>\n\n<p>The Plan builds on the Government of Canada’s more than $1 billion COVID-19 Response Fund and the support that has been provided to our health care system since the beginning of the outbreak. It focuses on domestic capacity building, innovative solutions, and procurement of essential supplies. It will:</p>\n\n<ul>\n\t<li>Build the industrial capability needed to manufacture critical supplies at scale in Canada. This will be done either by re-tooling the manufacturing lines of existing Canadian businesses or rapidly scaling up the production of others that already produce these products.</li>\n\t<li>Refocus Canada’s existing industrial and innovation programs, by adding to their mandate a requirement that they prioritize the fight against COVID-19. This includes:\n\t<ul>\n\t\t<li>the Strategic Innovation Fund to deliver direct support to Canadian companies for large-scale projects</li>\n\t\t<li>National Research Council of Canada to expedite research and development with small and medium-sized enterprises</li>\n\t\t<li>Innovation Superclusters to tap into a national network of 1,800 members, and Innovative Solutions Canada to help companies commercialize products more quickly</li>\n\t</ul>\n\t</li>\n\t<li>Deliver direct support to key Canadian companies that are working on large-scale and later-stage research and development projects aimed, in the immediate term, at producing countermeasures to COVID-19.</li>\n\t<li>Challenge innovative companies to develop research-based solutions, technologies, and products that can address a variety of COVID-19 issues.&nbsp;</li>\n\t<li>Source equipment needed to support Canada’s response to COVID-19 here in Canada. The Government of Canada will use existing supply arrangements and innovative, flexible procurement approaches. It is also reaching out to suppliers to identify and purchase equipment, supplies, and services needed for Canada’s response to COVID-19. With a view to longer-term support, the Government of Canada will ensure procurement flexibility to support innovation and build domestic manufacturing capacity to supply critical health supplies to Canadians.</li>\n</ul>\n\n<p>These measures are part of a larger strategy the Government of Canada is implementing to protect Canadians and prevent the spread of the virus. This strategy prioritizes the health and safety of Canadians, ensures the capacity of our health care system, and mitigates the economic impacts on Canadians and Canadian business.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“From the very beginning of this outbreak, our priority has been the safety and health of all Canadians. We’re partnering with Canadian industry and business so we can act fast to ensure our health care providers have the products and supplies they need to help Canadians. Together, we are mobilizing all of Canada to fight the spread of the virus.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I have heard from many companies that are already feeling impacts of this pandemic. Our government is acting quickly to ensure that we are using every possible tool in our toolbox to fight for the health and economic well-being of Canadians and their companies. The initiatives announced today will help strengthen our country’s response to COVID-19 while laying the foundation to protect Canadians into the future.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry&nbsp;&nbsp;</footer>\n</blockquote>\n\n<blockquote>\n<p>“We have been working around the clock with provinces and territories to respond to the outbreak of COVID-19, and today we are taking another step to make sure that everyone has what they need to detect and interrupt the chain of transmission of the virus.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“COVID-19 is a rapidly evolving global challenge. To ensure the ongoing delivery of critical services, the Government of Canada initiated a whole-of-government approach informed by the best available health and scientific advice. In leading coordinated procurement approaches for Canada, we stand ready to take further action to support the provinces and territories, our frontline health workers and Canadians at large.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On March 11, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">announced a more than $1 billion package</a> to help minimize the health, economic, and social impacts of the COVID-19 outbreak, which includes $50&nbsp;million to help ensure adequate supplies of personal protective equipment for provinces and territories, as well as to address federal needs.</li>\n\t<li>The Strategic Innovation Fund will allow for rapid support to Canadian companies that are working on large-scale and later-stage promising research and development projects aimed at providing medical countermeasures to COVID-19, including vaccines and critical medical supplies.</li>\n\t<li>The National Research Council of Canada will organize a COVID-19 Challenge Program, composed of teams of government, academic and private sector partners to address a range of medium term needs of the Public Health Agency of Canada and Health Canada. These include personal protective equipment, sanitization products, diagnostic and testing products, therapeutics, and disease tracking technology.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/03/20/new-measures-under-canadas-plan-mobilize-industry-fight-covid-19\">New measures under Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}