{
  "path": "/en/news/readouts/2021/02/04/prime-minister-justin-trudeau-holds-26th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 26th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the 26th call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>The Prime Minister began by thanking Stephen McNeil for his leadership throughout his political career, including as Premier of Nova Scotia these past eight years. The Prime Minister provided premiers with an update on Canada-U.S. relations, including recent calls with President Joe Biden, Vice President Kamala Harris, and Presidential Special Envoy for Climate, John Kerry. He outlined the opportunities in working on shared priorities with the U.S. and the importance for First Ministers to work collaboratively, through the Team Canada approach, to defend Canadian interests, protect and create jobs, and support our industries and businesses.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 pandemic. The Prime Minister noted that the federal government continues to monitor the new variants of the virus, and reiterated its commitment to supporting provinces and territories as they manage the outbreak. He stressed the important role of rapid tests in helping to mitigate the spread of the virus, and encouraged their use.</p>\n\n<p>First Ministers discussed the continued vaccine rollout and Minister LeBlanc provided an update on vaccine shipments. In response to questions raised on the call, the Prime Minister assured premiers that the federal government is in regular contact with vaccine manufacturers, including Moderna, Pfizer, and AstraZeneca. He noted that he was assured that Canada would receive 2 million doses from Moderna and 4 million doses from Pfizer by the end of March, as the companies committed to in their contracts. The Prime Minister emphasized that Canada has been assured by the European Union that their measures on vaccine exports will not impact vaccines destined for Canada. First Ministers also discussed the importance of further building domestic capacity for vaccine production and the approval of new vaccines by Health Canada.</p>\n\n<p>The Prime Minister updated premiers on international travel and border measures, including the implementation of strengthened measures at airports, whose cost is being covered by the federal government, and the range of potential measures at land border crossings.</p>\n\n<p>In closing, the Prime Minister reiterated the critical importance of protecting vulnerable Canadians, including Indigenous communities, who have been particularly affected by the resurgence of the virus.</p>\n\n<p>All First Ministers firmly reiterated their commitment to a collaborative approach to fighting COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/22/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/news/2021/01/covid-19-expert-panel-provides-science-based-advice-on-optimizing-testing-and-screening-in-canada.html\">COVID-19 Expert Panel provides science-based advice on optimizing testing and screening in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/27/prime-minister-justin-trudeau-speaks-president-european-commission-ursula\">Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/01/government-of-canada-introduces-further-restrictions-on-international-travel.html\">Government of Canada introduces further restrictions on international travel</a></li>\n</ul></div>\n      "
}