{
  "path": "/en/news/statements/2022/07/25/statement-prime-minister-personal-apology-delivered-his-holiness-pope",
  "pageTitle": "Statement by the Prime Minister on the personal apology delivered by His Holiness Pope Francis to Survivors of the residential school system in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, a National Residential School Crisis Line offers emotional support and crisis referral services for residential school Survivors and their families. Call the toll-free Crisis Line at 1-866-925-4419. This service is available 24&nbsp;hours a day, 7&nbsp;days a week. The Hope for Wellness Help Line also offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at </em><a href=\"http://www.hopeforwellness.ca\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>The Prime Minister, Justin Trudeau, today issued the following statement on the personal apology delivered by His Holiness Pope Francis to Survivors of the residential school system in Canada:</p>\n\n<p>“Today, His Holiness Pope Francis was in Maskwacîs, situated on Treaty&nbsp;6 territory, traditional lands of First Nations and Métis people, where he recognized the abuses experienced at residential schools that resulted in cultural destruction, loss of life, and ongoing trauma lived by Indigenous Peoples in every region of this country. His Holiness begged ‘forgiveness for the evil committed by so many Christians against Indigenous Peoples.’</p>\n\n<p>“The residential school system attempted to assimilate Indigenous children, forcing them to abandon their languages, cultures, spiritualities, traditions, and identities. Over 150,000 children were taken from their families and communities to attend residential schools. Many suffered physical, emotional, and sexual abuse, and thousands of children never returned home. The painful legacy of the residential school system lives on today.</p>\n\n<p>“In 2015, the Truth and Reconciliation Commission (TRC) released its final report – delivering 94 Calls to Action to address and repair the harms endured at residential schools. Call to Action #58 specifically calls upon the Pope to issue an apology to Survivors, their families, and communities for the Roman Catholic Church’s role in the spiritual, cultural, emotional, physical, and sexual abuse of First Nations, Inuit, and Métis children in Catholic-run residential schools. Since its release, First Nations, Inuit, and Métis have asked the Pope to fulfill this call. Earlier this year, in an immense display of bravery and determination, Survivors, Indigenous leaders, and youth travelled to the Vatican to tell their truths directly to one of the institutions responsible and urged the Catholic Church for a full apology. Today’s gathering at Maskwacîs would not have been possible without the courage, advocacy, and perseverance of First Nations, Inuit, and Métis Survivors who recounted their painful memories and shared their experiences.</p>\n\n<p>“Today is about the children who were taken from their families and robbed of their childhoods. The intergenerational impacts of residential schools continue to reverberate within Indigenous communities today, as Survivors, their families, and their communities continue to deal with the resulting trauma. The Government of Canada will continue to support their healing journey and remains committed to fully implementing the TRC’s Calls to Action.</p>\n\n<p>“Reconciliation is the responsibility of all Canadians. It is our responsibility to be open, to listen, and to share. It is our responsibility to see our differences not as an obstacle, but as an opportunity to learn, to better understand one another, and to take action. No one must ever forget what happened at residential schools across Canada and we must all ensure it never happens again. In the spirit of reconciliation and healing, together we will build a better future – for Indigenous Peoples and all Canadians.”</p></div>\n      "
}