{
  "path": "/en/news/readouts/2022/04/19/prime-minister-justin-trudeau-participates-teleconference-meeting",
  "pageTitle": "Prime Minister Justin Trudeau participates in teleconference meeting with President of the United States of America Joe Biden, Prime Minister of Japan Kishida Fumio, and European leaders on the war in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden, and the leaders of the United Kingdom, France, Germany, Italy, Poland, Romania, Japan, the European Commission, the European Council, and the North Atlantic Treaty Organization (NATO) to discuss collective efforts to date, assess the current situation on the ground in Ukraine, and discuss critical actions allies must undertake to effectively support Ukraine.</p>\n\n<p>The leaders denounced Russia’s war crimes and brutality in Ukraine, and promised to hold Russia accountable for its actions, including through the International Criminal Court. They emphasized the importance of allies maintaining the strong, united stand they have taken in support of Ukraine. The leaders also expressed their collective commitment to the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The Prime Minister and leaders recognized that it is crucial to maintain financial support to Ukraine in a way that meets its critical needs and adapts quickly to changing circumstances in the country, particularly with regard to food security and humanitarian assistance.</p>\n\n<p>Prime Minister Trudeau emphasized the strength and unity of the NATO Alliance. The leaders agreed to a common approach in supporting Ukraine as it enters the next phase of the war and agreed to continue coordinating closely.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/09/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/24/prime-minister-concludes-successful-visit-belgium-and-announces\">Prime Minister concludes successful visit to Belgium and announces additional support for Ukraine</a></li>\n</ul></div>\n      "
}