{
  "path": "/en/news/statements/2018/05/17/statement-prime-minister-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p><p>“On the <a href=\"http://dayagainsthomophobia.org/\">International Day Against Homophobia, Transphobia, and Biphobia</a>, we join Canadians and people everywhere to call for a world free of stigma, persecution, and discrimination. Everyone deserves the same rights and opportunities in life no matter who they love or how they identify.</p><p>“This year’s theme is Alliances for Solidarity. Change may start with an individual, but progress is paved when people stand together, proud and strong. Thanks to the brave and tireless efforts of LGBTQ2 advocates and allies alike, Canada is a more just, compassionate country – but we still have a ways to go.</p><p>“Members of LGBTQ2 communities continue to face daily harassment, discrimination, and violence simply for being who they are. Inequality has no place in our society, and Canada gets stronger every day that we choose to embrace diversity.</p><p>“In the last year, the Government of Canada, working with Member of Parliament Randy&nbsp;Boissonnault, Special Advisor on LGBTQ2 issues, has taken many important steps to recognize and protect the rights of LGBTQ2 individuals.</p><p>“Last June, we passed&nbsp;<a href=\"https://www.canada.ca/en/department-justice/news/2017/06/statement_by_ministerwilson-raybouldonpassageofbillc-16insenatea.html\">legislation</a>&nbsp;that provides Canadians with explicit protection from discrimination and hate crimes based on their gender identity or expression. A few months later, we <a href=\"/en/news/speeches/2017/11/28/remarks-prime-minister-justin-trudeau-apologize-lgbtq2-canadians\"><span lang=\"EN\" xml:lang=\"EN\">apologized</span></a> to those harmed by federal legislation, policies, and practices that led to the oppression of and discrimination against LGBTQ2 people in Canada.</p><p>“We have also put forward several <a href=\"/en/news/backgrounders/2017/11/28/government-canada-initiatives-support-lgbtq2-communities-and-promote\">initiatives</a> that will make a difference for LGBTQ2 communities. In Budget 2017, we introduced a $101-million Strategy to Prevent and Address Gender-Based Violence – the first-ever federal strategy of its kind – to help fill gaps in support for diverse populations, including LGBTQ2 communities. Budget 2018 proposes another $86 million over the next five years to expand the Strategy and help end the ongoing discrimination, harassment, and the other harms that affect LGBTQ2 individuals and other vulnerable groups.</p><p>“We know there is a need to close data gaps to better understand critical socioeconomic issues facing LGBTQ2 Canadians. To that end, Budget 2018 provides $6.7 million over the next five years for Statistics Canada to establish a Centre for Gender, Diversity and Inclusion Statistics.</p><p>“On the international stage, Canada continues to advance LGBTQ2 rights. As the current co-chair of the Equal Rights Coalition (ERC), we are working alongside states, civil society, and international organizations to combat discrimination and violence against LGBTQ2 people. We look forward to hosting the ERC Global Conference on LGBTI Rights and Inclusive Development in Vancouver this August.</p><p>“Today, we rededicate ourselves to a future where every single one of us – regardless of our gender expression, gender identity, or sexual orientation – is free to be true to who we are and achieve our fullest potential.”</p></div>\n      "
}