{
  "path": "/en/news/news-releases/2019/04/28/prime-minister-canada-announces-closer-collaboration-japan",
  "pageTitle": "Prime Minister of Canada announces closer collaboration with Japan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, met with the Prime Minister of Japan, Shinzo Abe, to set the foundation for an even closer Canada-Japan relationship.</p>\n\n<p>During their meeting, the two leaders re-affirmed their commitment to strengthen the strategic partnership between Canada and Japan, and agreed to strengthen strategic dialogues between the two countries.</p>\n\n<p>The two leaders also discussed the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which is already creating good, middle class jobs and new opportunities for businesses in Canada and Japan. There has been a significant increase in demand for Canadian products since the CPTPP came into force. For example, some Canadian beef products exported to Japan have increased nearly threefold.</p>\n\n<p>Building on this momentum, the two leaders finalized two memorandums. The first Memorandum of Cooperation, between Invest in Canada and the Japan External Trade Organization, will make it easier for Canadian and Japanese companies to work in partnership, and will drive investment in both our countries. The second Memorandum of Understanding, between the National Research Council of Canada and the Advanced Telecommunications Research Institute International of Japan, will support joint research and development in fields like robotics and telecommunications.</p>\n\n<p>The two leaders also discussed their shared vision for maintaining a free and open Indo-Pacific region based on the rule of law – something Canada and Japan will continue to advance through a range of initiatives. Prime Minister Trudeau announced that Canada will continue periodic deployments, over a two-year period, of Canadian Armed Forces aircraft, ships, and personnel under Operation NEON – a multinational surveillance initiative to counter North Korea’s maritime sanctions evasion.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Abe also discussed the threat to peace and security posed by North Korea’s weapons of mass destruction and ballistic missile programs. Prime Minister Trudeau announced that Canada has provided a grant of $2 million to the International Atomic Energy Agency to enhance the Agency’s readiness to verify denuclearization activities in North Korea.</p>\n\n<p>Finally, Prime Minister Trudeau and Prime Minister Abe discussed the upcoming G20 Summit in Osaka, and emphasized that G20 countries need to work closely together to address the world’s most pressing challenges.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Over the last two days, Prime Minister Abe and I discussed the longstanding partnership between our two countries, and committed to deepening relations even further. We moved forward on a number of new agreements and initiatives that will create good, middle class jobs and bring Canada and Japan even closer together. I look forward to travelling to Osaka in June for the G20 Summit, which I know will be a successful meeting under Prime Minister Abe’s leadership.”<br>\n—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“Our close economic ties with Japan have never been stronger thanks in large part to our new trade deal with Asia and Pacific countries – and our government is strengthening those ties even further. That’s why we’re adding trade commissioners right across Canada, and putting new trade commissioners in three major Japanese cities to help our businesses and economy grow. A new hub in Tokyo will also help Canadian tech companies to thrive in the Japanese market.”<br>\n—<cite>The Hon. Jim Carr, Minister of International Trade Diversification</cite></p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the visit, Prime Minister Abe announced Japan’s endorsement of the Ottawa Declaration on Venezuela.</li>\n\t<li>Japan will host the G20 Summit in Osaka Japan from June 28-29, 2019.</li>\n\t<li>Japan’s G20 priorities include free trade, science and technology innovation, infrastructure for development, global health, climate change, aging populations, and Sustainable Development Goals and international development.</li>\n\t<li>Canada and Japan are partners in the CPTPP, a free trade agreement between Canada and 10 other countries in the Asia-Pacific region. The CPTPP has entered into force for the seven countries to ratify the Agreement, including Canada and Japan.</li>\n\t<li>Japan was the number one importer of Canadian pork in 2018 worth $1.3 billion</li>\n\t<li>Canada will periodically deploy aircraft, ships and personnel to the region as part of Operation NEON, to identify apparent sanctions violators and share this information with the UN Security Council.</li>\n\t<li>Canada and Japan are members of the G7, the G20, the Asia-Pacific Economic Cooperation forum, the Asian Development Bank, the International Monetary Fund, and the Organisation for Economic Co-operation and Development.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\" tabindex=\"107\">Canada-Japan Relations</a></li>\n\t<li>Backgrounder:&nbsp;<a href=\"https://pm.gc.ca/eng/news/2019/04/28/canada-announces-closer-collaboration-japan\" tabindex=\"108\">Canada announces closer collaboration with Japan</a></li>\n\t<li><a href=\"https://international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/korea-coree.aspx?lang=eng\" tabindex=\"109\">Canadian sanctions related to North Korea</a></li>\n</ul></div>\n      "
}