{
  "path": "/en/news/news-releases/2019/04/04/inuit-crown-partnership-committee-releases-national-inuit-housing",
  "pageTitle": "Inuit-Crown Partnership Committee releases national Inuit housing strategy and continues progress on shared priorities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau, President Natan Obed of Inuit Tapiriit Kanatami, Cabinet ministers, and Inuit leaders today gathered for a meeting of the Inuit-Crown Partnership Committee to review progress and set priorities for the third year of the Committee.</p>\n\n<p>During the meeting, the Prime Minister and Committee members reflected on the important progress made this past year. These accomplishments include:</p>\n\n<ul>\n\t<li>The release of the co-developed Inuit Nunangat Housing Strategy, which will help improve housing conditions across Inuit regions of Canada, and develop Inuit-led housing solutions that reflect Inuit lifestyles, traditions, and culture.</li>\n\t<li>The endorsement of the&nbsp;<a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\" tabindex=\"107\">Inuit Tuberculosis Elimination Framework</a>&nbsp;– and joint commitment to eradicate tuberculosis among Inuit by 2030.</li>\n\t<li>The co-development of the&nbsp;<a href=\"https://www.canada.ca/en/employment-social-development/programs/indigenous-early-learning/2018-framework.html\" tabindex=\"108\">Indigenous Early Learning and Child Care Framework</a>, which will help ensure Inuit children and young people can access the care and education they need to succeed.</li>\n</ul>\n\n<p>Over the last year, the Government of Canada and Inuit Tapiriit Kanatami have also taken important steps toward reconciliation, including the Government of Canada’s apology to Ahiarmiut Inuit for their forced relocation; the Prime Minister’s apology on behalf of the government for its management of the tuberculosis epidemic from the 1940s to the 1960s; and the launch of the Nanilavut Initiative to help Inuit find lost loved ones.</p>\n\n<p>In addition, the Committee established its first work plan focused on the environment and climate change, and furthered its efforts to protect the ocean, including signing the Pikialasorsuaq Joint Leaders Statement. Through this statement, the Government of Canada and Inuit leaders are committing to work in partnership together, and with the governments of Denmark and Greenland, to protect Pikialasorsuaq – an open-water area surrounded by ice in northern Baffin Bay, between Nunavut and Greenland.</p>\n\n<p>The Committee also began work to establish new areas of focus for its third year, including continuing to address infrastructure gaps in Inuit Nunangat.</p>\n\n<p>The Inuit-Crown Partnership Committee reflects a firm commitment to a renewed Inuit-Crown relationship and to reconciliation based on recognition of rights, respect, cooperation, and partnership.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since 2017, Inuit leaders and federal ministers have been working together to renew the Inuit-Crown relationship, advance reconciliation, and create prosperity for all Inuit. We’re committed to finding community-owned, community-driven solutions, like the new housing strategy, which has been designed by Inuit in partnership with the federal government, and will be delivered by Inuit. Together, we are partners in building a brighter future for communities across Inuit Nunangat, and for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Reliable access to housing is foundational to Inuit health and well-being. The collaboration with the federal government on the National Inuit Housing Strategy which is being released today seeks to improve housing conditions across Inuit Nunangat and ensure better outcomes through greater Inuit self-determination and control.”</p>\n\n<footer class=\"default\">President Natan Obed, Inuit Tapiriit Kanatami</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Other key achievements in year two of the Committee include:\n\t<ul>\n\t\t<li>the launch of the&nbsp;<a href=\"https://www.canada.ca/en/indigenous-services-canada/services/first-nations-inuit-health/supporting-inuit-children.html\" tabindex=\"109\">Child First Initiative</a></li>\n\t\t<li>the creation of an&nbsp;<a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2018/12/government-of-canada-announces-improvements-to-nutrition-north-canada-including-support-for-country-food.html\" tabindex=\"110\">Inuit-Crown Food Security working group</a></li>\n\t\t<li>ongoing work on the new&nbsp;<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1499951681722/1537884604444\" tabindex=\"111\">Arctic and Northern Policy Framework</a></li>\n\t\t<li>the endorsement of a mandate to explore options for action on Inuit kindergarten to grade 12 schooling</li>\n\t</ul>\n\t</li>\n\t<li>The Inuit-Crown Partnership Committee was created in February 2017 with the signing of the Inuit Nunangat Declaration on Inuit-Crown Partnership. It is founded on the principle that an equal partnership between Inuit and the Crown is essential to the reconciliation process.</li>\n\t<li>The Committee is co-chaired by the Prime Minister and the president of Inuit Tapiriit Kanatami. Members include federal cabinet ministers and the elected leaders of the Nunatsiavut Government, Nunavut Tunngavik Inc., Inuvialuit Regional Corporation, and Makivik Corporation.</li>\n\t<li>The Committee also includes as observers the presidents of the National Inuit Youth Council, Pauktuutit Inuit Women of Canada, and the Inuit Circumpolar Council Canada.</li>\n\t<li>Pikialasorsuaq, also known as the North Water Polynya, is one of the world’s most productive ocean ecosystems – supporting an abundance of marine mammals, including narwhal, walrus, seals, and polar bears, as well as seabirds and a variety of fish.</li>\n\t<li>According to&nbsp;<a href=\"https://changingclimate.ca/CCCR2019\" tabindex=\"112\">Canada’s Changing Climate Report</a><em>,&nbsp;</em>both past and future warming in Canada is, on average, about double the magnitude of global warming. Northern Canada has warmed and will continue to warm at more than double the global rate.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/04/03/pikialasorsuaq-leaders-statement\" tabindex=\"122\">Pikialasorsuaq Leaders Statement</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1554302528267\" tabindex=\"113\">Inuit Nunangat Housing Strategy</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\" tabindex=\"114\">Inuit Nunangat Declaration on Inuit-Crown Partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce-inuit-crown\" tabindex=\"115\">Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee</a></li>\n\t<li><a href=\"https://www.itk.ca/icpc-housing-pm/\" tabindex=\"116\">ICPC Releases National Inuit Housing Strategy at Third Annual Meeting with the Prime Minister</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2019/01/canada-advances-reconciliation-with-historic-apology-to-the-ahiarmiut.html\" tabindex=\"117\">Canada advances reconciliation with historic apology to the Ahiarmiut</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/03/08/prime-minister-delivers-apology-inuit-federal-governments-management-tuberculosis\" tabindex=\"118\">Prime Minister delivers apology to Inuit for the federal government’s management of tuberculosis epidemic from the 1940s-1960s</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\" tabindex=\"119\">Tuberculosis Elimination Framework Released</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1552059698863/1552059725063\" tabindex=\"120\">The Nanilavut Initiative</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/plan/chap-03-en.html#Supporting-Inuit-Priorities\" tabindex=\"121\">Budget 2019 – Supporting Inuit Priorities</a></li>\n</ul>\n\n<p>Also available in Inuktitut, in&nbsp;<a href=\"https://pm.gc.ca/eng/news/2019/04/03/inuit-kanataup-kavamakungit-pinasuaqatigiigutimiknut-katimajiralaat-tusaqtitivut\" tabindex=\"123\">Roman orthography</a>&nbsp;and in&nbsp;<a href=\"https://pm.gc.ca/eng/news/2019/04/03/inuit-kanataup-gavamakkungit-pinasuaqatigiigutimingnut-katimajiralaangit\" tabindex=\"124\">syllabics</a>.</p></div>\n      "
}