{
  "path": "/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response",
  "pageTitle": "Canada and international partners launch the Coronavirus Global Response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 is a global pandemic, spread by a virus that knows no borders. No country will be able to fully recover until we beat it all around the world. We must work together, and Canada is contributing to this fight. Canadian and international researchers are racing to develop diagnostics, treatments, and vaccines that will save lives, protect the health and safety of people everywhere, and lay the groundwork for a sustainable worldwide economic recovery.</p>\n\n<p>The Prime Minister, Justin Trudeau, today joined other global leaders to launch the Coronavirus Global Response. This online pledging event aims to initially raise more than $8 billion (USD) to help researchers and innovators develop solutions to test, treat, and protect people, and to prevent the further spread of COVID-19.</p>\n\n<p>The Prime Minister highlighted that, to date, the Government of Canada has announced investments of over $850 million (CAD) that support this fundraising target. This includes funding to:</p>\n\n<ul>\n\t<li>mobilize Canadian researchers’ and life sciences companies’ coronavirus research and development of medical countermeasures;</li>\n\t<li>support accelerated vaccine development, including through the Coalition for Epidemic Preparedness Innovations and other partners;</li>\n\t<li>find a safe and effective treatment for COVID-19 through the World Health Organization (WHO) Solidarity Trial;</li>\n\t<li>coordinate a COVID-19 viral and host genome sequencing effort across Canada;</li>\n\t<li>help provide COVID-19 diagnostic support to more than 20 partner countries; and</li>\n\t<li>create strategies to tackle misinformation, stigma, and fear.</li>\n</ul>\n\n<p>In today’s interconnected world, the global health system relies on the strength of all regions to ensure a sustainable global recovery. That is why the government is providing funding to support some of the world’s most vulnerable populations, and working with international partners as they coordinate and prioritize response efforts in vulnerable countries. We are aiming to maximize global benefits from these investments, and we are committed to helping to ensure that once a vaccine is developed, it will be produced at a scale and cost accessible to all countries.</p>\n\n<p>The Government of Canada is committed to a robust global effort to stop COVID-19 and address its devastating health, social, and economic impacts on people across the world. We will work together with our partners to end this pandemic and to build a safe and prosperous future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“None of us is immune to the effects of COVID-19, and none of us can beat the virus alone. Only by protecting each other can we protect ourselves. Canada is ready to help lead a coordinated global response which will contribute to overcoming the pandemic. Together, we will win.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“COVID-19 is a threat that does not recognize borders and will only be overcome through coordinated global action. We need to continue working together as partners to make a future treatment or vaccine available, accessible and affordable to all. If ever there was a time to realize we’re all in this together, it is now.”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of International Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Coronavirus Global Response initiative is an international online pledging event co-hosted by Canada, the European Union, France, Germany, Spain, Norway, the United Kingdom, Japan, Saudi Arabia as the current G20 presidency, and Italy as the future G20 presidency.&nbsp;</li>\n\t<li>The initiative seeks to:\n\t<ul>\n\t\t<li>kick-start an unprecedented global cooperation between scientists and regulators, industry and governments, international organizations, foundations, and health care professionals;</li>\n\t\t<li>raise more than $8 billion (USD) by the end of the pledging period to support the development of rapid coronavirus diagnostics, treatments, and vaccines; and</li>\n\t\t<li>work with the World Health Organization to coordinate and prioritize efforts to vulnerable countries.</li>\n\t</ul>\n\t</li>\n\t<li>The funds collected will be channelled into three principal strands: diagnostics, treatments, and vaccines. Funds may also be used to strengthen health systems.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://global-response.europa.eu/index_en\">Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.who.int/who-documents-detail/access-to-covid-19-tools-(act)-accelerator\">Access to COVID-19 Tools (ACT) Accelerator</a></li>\n\t<li><a href=\"https://cepi.net/\">Coalition for Epidemic Preparedness Innovations (CEPI)</a></li>\n\t<li><a href=\"https://ec.europa.eu/commission/presscorner/detail/en/AC_20_795\">The global response: Working together to help the world get better</a></li>\n</ul></div>\n      "
}