{
  "path": "/en/news/statements/2022/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence against Women:</p>\n\n<p>“Today, on the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/16-days/national-day-remembrance.html\">National Day of Remembrance and Action on Violence against Women</a>, we remember the 14 young women who were murdered and 13 others injured at the École Polytechnique de Montréal on December 6, 1989. Their lives were so tragically cut short simply because they were women.</p>\n\n<p>“For 33 years, we have held them in our thoughts. Geneviève Bergeron. Maryse Laganière. Hélène Colgan. Maryse Leclair. Nathalie Croteau. Anne-Marie Lemay. Barbara Daigneault. Sonia Pelletier. Anne-Marie Edward. Michèle Richard. Maud Haviernick. Annie St-Arneault. Barbara Klucznik-Widajewicz. Annie Turcotte. We will never forget them.</p>\n\n<p>“On this day, and throughout the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/16-days.html\">16 Days of Activism against Gender-Based Violence</a>, we acknowledge that the hatred that motivated this tragic mass shooting is still a very real threat for women in Canada and around the world. This is particularly true for marginalized and racialized women.</p>\n\n<p>“Across the country this past week, we have been mourning the tragic killing of four Indigenous women in Manitoba: Rebecca Contois, Morgan Harris, Marcedes Myran, and a fourth woman who remains unidentified at this time. We will remember them as mothers, daughters, sisters, and caring community members. There is more work to do to stop this senseless violence and put an end to the ongoing tragedy of missing and murdered Indigenous women, girls, and 2SLGBTQI+ people. We will continue to work in partnership with Indigenous families, Survivors, leaders, and partners, as well as with provinces and territories, to implement the MMIWG National Action Plan and the&nbsp;<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway</a>&nbsp;to make our communities safer.</p>\n\n<p>“The Government of Canada is working to end gender-based violence so that all women, girls, and gender-diverse people can feel safe. Our <a href=\"https://women-gender-equality.canada.ca/en/gender-based-violence-knowledge-centre/gender-based-violence-strategy.html\">Gender-Based Violence Strategy</a> is advancing efforts to help prevent and address gender-based violence, support Survivors and their families, and promote justice. We are also supporting provinces and territories in implementing the <a href=\"https://femmes-egalite-genres.canada.ca/en/ministers-responsible-status-women/national-action-plan-end-gender-based-violence.html\">National Action Plan to End Gender-Based Violence</a>, launched last month, which sets a framework for anyone facing gender-based violence to have reliable and timely access to protection and services, no matter where they live. In addition, the government provided funding for women’s shelters across the country, crisis hotlines, and organizations helping women flee violence.</p>\n\n<p>“We are also helping to protect women and girls by keeping guns out of our communities. Earlier this fall, the government implemented a national freeze on the sale, purchase, and transfer of handguns, which will make communities safer and help save lives. And <a href=\"https://www.parl.ca/legisinfo/en/bill/44-1/c-21\">Bill C-21</a> proposes Canada’s most significant action on gun violence in a generation.</p>\n\n<p>“I encourage all Canadians to honour the victims and Survivors of the tragedy at the École Polytechnique de Montréal. Today, we wear a white ribbon, observe a moment of silence at 11:00 a.m., and support Survivors and those affected by gender-based violence. We will continue to do everything we can to build a safer, more inclusive future for everyone.”</p></div>\n      "
}