{
  "path": "/en/news/news-releases/2016/01/13/prime-minister-announces-support-canadian-centre-advanced-therapeutic",
  "pageTitle": "Prime Minister announces support to Canadian Centre for Advanced Therapeutic Cell Technologies | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Centre for Commercialization of Regenerative Medicine (CCRM) will receive $20 million – under the Advanced Manufacturing Fund (AMF) – to establish and operate the Centre for Advanced Therapeutic Cell Technologies.</p>\n<p>This will be the first cell therapy development facility in the world to use a collaborative approach – between research institutions and industry – to solve cell therapy manufacturing challenges. The new, world-class facility will create good jobs, strengthen Canada’s knowledge economy, and position Ontario as a global hub for the cell therapy industry.</p>\n<p>Every year, thousands of Canadians die as a result of cancer, heart conditions, and other medical disorders. Regenerative medicine has emerged as a promising approach to disease prevention and treatment, harnessing the power of stem cells to repair, regenerate, or replace damaged cells, tissues, and organs affected by disease.</p>\n<p>The Government of Canada will therefore provide funding to the CCRM, who will collaborate with GE Healthcare and other industry partners, to establish a centre that will accelerate the development and adoption of cell manufacturing technologies.</p>\n<p><strong>Quotes</strong></p>\n<p>“The health of Canadians is a priority. We believe that supporting this new, world-class facility will have significant benefits for innovative health-related technology in Canada and around the world. It will also generate new jobs and make Ontario an even stronger competitor in the bio-tech industry.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“This is wonderful news for CCRM, Canada, GE Healthcare and the global regenerative medicine community. The new centre will provide jobs for highly skilled workers and help the cell therapy industry overcome critical manufacturing bottlenecks. Most importantly, the outputs of this centre will enable access to revolutionary medical treatments for patients from around the world.”<br><em>- Michael May, President and CEO, Centre for Commercialization of Regenerative Medicine</em></p>\n<p>\"We are pleased the federal government is investing in the new advanced therapeutic cell technologies centre at MaRS. Ontario provided seed funding for the Centre for the Commercialization of Regenerative Medicine to support research and commercialization in regenerative medicine, which we know will continue to be a key driver in the province's life sciences sector. Today's announcement will further grow Ontario's reputation as a global leader in this field, which offers incredible potential for continued growth in the future.\"<br><em>- Hon. Reza Moridi, Ontario Minister of Research and Innovation‎</em></p>\n<p><strong>Quick Facts:</strong></p>\n<ul>\n<li>The project, which has a total cost of $43.8 million, has the potential to make Ontario a global hub for the cell therapy industry.</li>\n<li>The $20 million in Government of Canada funding will be provided once the CCRM meets the terms and conditions outlined in the contribution agreement. All project activities must be completed by December 31, 2018.</li>\n<li>The Government of Canada funding will be used to support improvements to the new facility and the purchase of specialized equipment. Furthermore, funding will support the development of at least five&nbsp;new patent applications, the commercialization of 30 new products or processes, and the creation or maintenance of 389 high-quality jobs by project completion in December 2018.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<p><a href=\"http://ccrm.ca/\">Centre for Commercialization of Regenerative Medicine</a><br><a href=\"http://www.feddevontario.gc.ca/eic/site/723.nsf/eng/h_01855.html\">Advanced Manufacturing Fund</a></p></div>\n      "
}