{
  "path": "/en/news/news-releases/2019/08/26/prime-minister-concludes-productive-g7-leaders-summit-france",
  "pageTitle": "Prime Minister concludes productive G7 Leaders’ Summit in France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G7 Leaders’ Summit in Biarritz, France.</p>\n\n<p>In discussions on the global economy with G7 leaders, Prime Minister Trudeau stressed the need for leaders to work together to build economies that work for everyone and strengthen the middle class. He underscored the importance of the rules-based international order in supporting growth and opportunities for people around the world to share in a better future.</p>\n\n<p>The G7 leaders also agreed to&nbsp;Prime Minister Trudeau's initiative&nbsp;to task&nbsp;their&nbsp;Finance Ministers to report back to&nbsp;their&nbsp;leaders on the state of the global economy, so countries can take concerted action to address signs of risk and ensure stable, sustained growth for people.</p>\n\n<p>G7 leaders agreed to work in partnership with African leaders to support transformation, growth, shared prosperity in Africa. The Prime Minister announced several initiatives, including funding in support of the Affirmative Finance Action for Women in Africa initiative to help women entrepreneurs succeed by providing them with access to financing to start their own businesses.</p>\n\n<p>During the Summit, leaders discussed the importance of advancing gender equality and women’s empowerment. Canada joined the Biarritz Partnership on Gender Equality which highlighted the progress being made by Canada on policy and legislative measures needed to further address inequalities in Canada and abroad. Leaders agreed to concrete actions in response to the recommendations of the G7 Gender Equality Advisory Council, which was launched for the first time by Canada in 2018, and continued by France in 2019.</p>\n\n<p>Prime Minister Trudeau also announced $179.2 million in investments to support quality education for women and girls living in crisis, conflict-affected and fragile states. This funding completes Canada’s commitment as part of the $3.8 billion mobilized at the G7 Summit in Charlevoix, Quebec in 2018 – the largest in history.</p>\n\n<p>A key theme of the Summit was the importance of addressing climate change, biodiversity and oceans. The Prime Minister stressed the urgent need for collective action to tackle the climate crisis and protect our shared environment. He announced an important set of projects to support global climate action including continued strong support for the Green Climate Fund. He also underscored Canada’s leadership to safeguard our world’s oceans, coasts, and coastal communities, and called on others to come together to protect these shared resources. Canada welcomed France’s work to encourage coalitions on environmental issues.</p>\n\n<p>During the Summit, leaders discussed the opportunities that artificial intelligence offers our economies and societies. The Prime Minister spoke about the importance of the responsible development of human-centric approaches to artificial intelligence, The Prime Minister advanced a new Global Partnership on AI, an initiative created by Canada and France, and developed in partnership with other countries and the OECD.</p>\n\n<p>The Prime Minister announced $15 million to help fight the fires in the Amazon.</p>\n\n<p>In addition to the discussion regarding the wildfires in the Amazon, the Prime Minister and his G7 counterparts also discussed efforts to address key regional and global challenges, including Russia and ongoing reform efforts in Ukraine, as well as the crisis in Venezuela. The Prime Minister thanked the Leaders for their support in advocating for the release of the detained Canadians Michael Spavor and Michael Kovrig in China.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Now more than ever, G7 leaders need to work together to tackle urgent global challenges – from fighting the climate crisis, to making sure people around the world can share in a prosperous future. Thanks to France’s leadership, this year’s G7 Summit was a chance to combat inequality, build economies that work for everyone, and help make sure our citizens can feel confident in the future. Together, we can face today’s most pressing challenges, and grow a strong middle class around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada<em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </em></footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister held bilateral meetings with the following leaders: the Prime Minister of Australia, Scott Morrison, the President of the European Council, Donald Tusk, the President of France, Emmanuel Macron, the Chancellor of Germany, Angela Merkel, the Prime Minister of Japan, Shinzo Abe, the President of Rwanda, Paul Kagame, the President of South Africa, Cyril Ramaphosa, the Prime Minister of the United Kingdom, Boris Johnson, the President of the United States, Donald Trump, and met with representatives of the Gender Equality Advisory Committee.</li>\n\t<li>The G7 is an informal grouping of seven of the world’s advanced economies consisting of Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States. The European Union was first invited to attend the G7 in 1977.</li>\n\t<li>This is the fourth time Prime Minister Justin Trudeau has attended a G7 Summit. The Leaders of the G7 have come together each year since the 1970s to discuss issues of domestic and global concern.</li>\n\t<li>Canada held the presidency of the G7 last year. The United States will hold it in 2020.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2019/08/26/creating-better-future\">Creating a better future</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.elysee.fr/en/g7\">G7 France</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a>&nbsp;</li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li>\n</ul></div>\n      "
}