{
  "path": "/en/news/statements/2018/06/10/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for National Public Service Week, which runs from June 10 to 16, 2018:</p><p>“This week we celebrate <a href=\"https://www.canada.ca/en/treasury-board-secretariat/site/proudly-serving.html\">Canada's public servants</a>, whose hard work and dedication make a difference each day in the lives of Canadians.</p><p>“Canada’s Public Service has earned recognition worldwide – thanks to the leadership, passion, and commitment our public servants show every day. Whether helping those affected by the spring flooding across the country, welcoming the world to Canada during the G7 Summit, or supporting Canadians abroad, public servants are there time and again to deliver the essential services we rely on.</p><p>“Public servants continue to show unwavering professionalism as they face unacceptable hardships caused by the implementation of the Phoenix pay system. The government will continue to work diligently to make sure every employee gets the pay they are owed. As outlined in <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a>, we have added significant resources to boost processing capacity, improve support for employees within departments, and begin work on a new pay system. Working together with our public service labour partners, we are committed to resolving outstanding pay system issues as quickly as possible.</p><p>“From bringing new initiatives to life, to carrying out ongoing services, federal public servants continue to set an example for service excellence around the world. In communities across Canada, public servants are finding innovative solutions to the challenges we face, and tackling the issues that matter most to Canadians – from promoting diversity and inclusion, to growing economies that work for everyone.</p><p>“To all public servants, I say thank you. You play a vital role to keep our democracy healthy, strengthen communities, and grow the middle class. I look forward to continuing to work with you to build a Canada where everyone has access to quality services and a real and fair chance to succeed.”</p></div>\n      "
}