{
  "path": "/en/news/news-releases/2019/04/03/inuit-kanataup-gavamakkungit-pinasuaqatigiigutimingnut",
  "pageTitle": "ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐱᓇᓱᐊᖃᑎᒌᒍᑎᒥᖕᓄᑦ ᑲᑎᒪᔨᕋᓛᖏᑦ ᑐᓴᕐᑎᑦᑎᕗᑦ ᑲᓇᑕᒥ ᐃᓄᐃᑦ ᐃᒡᓗᒃᓴᖏᓐᓄᑦ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᓂᒃ ᐊᒻᒪᓗ ᑲᔪᓯᔪᒥᒃ ᑕᒪᓐᓇ ᐱᕙᓪᓕᐊᑎᐊᖅᑐᖅ ᑕᒪᐃᓐᓂᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᑦᑕᕆᐊᖃᖅᑕᒥᖕᓂᑦ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᔭᔅᑎᓐ ᑐᓘᑐ, ᐊᖓᔪᖅᑲᖅ ᓇᐃᑕᓐ ᐅᐱᑦ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ, ᑲᓇᑕ ᒥᓂᔅᑕᖏᑦ, ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᓯᕗᓕᐅᖅᑎᐅᔪᑦ ᐅᓪᓗᒥ ᑲᑎᒪᖃᐅᔪᑦ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᐱᓇᓱᐊᖃᑎᒌᒍᑎᒥᖕᓄᑦ ᑲᑎᒪᔨᕋᓛᑦ ᕿᒥᕐᕈᐊᓚᐅᖅᑕᖏᑦ ᐱᕙᓪᓕᐊᓂᕆᔭᑎᒃ ᐊᒻᒪᓗ ᐋᕿᒃᓱᓚᐅᖅᑕᖏᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᑦᑕᕆᐊᖃᖅᑐᑦ ᐱᖓᔪᒋᓕᖅᑕᖓᓂ ᑖᒃᑯᐊ ᑲᑎᒪᔨᕋᓛᑦ ᑲᑎᒪᒐᒥᒃ.</p>\n\n<p>ᑕᐃᑲᓂ ᑲᑎᒪᓪᓗᑎᒃ, ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᐊᒻᒪᓗ ᑲᑎᒪᔨᕋᓛᑦ ᑲᑎᒪᔨᖏ ᐅᖃᐅᓯᖃᓚᐅᖅᑐᑦ ᐱᒻᒪᕆᐅᔪᓂᒃ ᐱᕙᓪᓕᐊᑎᐊᖅᑎᓯᒪᔭᒥᖕᓂᒃ ᐊᕐᕌᓂᓂᑦ. ᐅᑯᐊ ᑲᔪᓯᑦᑎᐊᖅᓯᒪᔪᑦ ᐃᓚᒋᔭᐅᕗᑦ:</p>\n\n<ul>\n\t<li>ᐅᓇ ᑐᓴᒐᒃᓴᖅ ᓴᕿᑦᑎᖃᑎᒌᖕᓂᖏᓐᓂᒃ ᐃᓄᐃᑦ ᓄᓇᖓᓂ ᐃᒡᓗᓕᕆᔾᔪᑕᐅᓂᐊᖅᑐᒥᒃ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᖅ, ᑖᓐᓇ ᐃᑲᔪᕐᓂᐊᖅᑐᖅ ᐱᐅᓯᕚᓪᓕᕈᑎᒃᓴᓄᑦ ᐃᒡᓗᓄᑦ ᓇᓂᑐᐃᓐᓇᖅ ᐃᓄᐃᑦ ᓄᓇᖏᓐᓂ ᑲᓇᑕᒥ, ᐊᒻᒪᓗ ᓴᕿᑦᑎᓗᑎᒃ ᐃᓄᖕᓂ-ᐃᖏᕐᕋᑎᑕᐅᓂᐊᖅᑐᑦ ᐃᒡᓗᓕᕆᓂᕐᒧᑦ ᐋᕿᒍᑎᒋᓂᐊᑦᑐᑦ ᐱᓯᒪᔪᑦ ᐃᓄᐃᑦ ᐃᓅᓯᖏᓐᓄᑦ, ᐱᐅᓯᑐᖃᖏᓐᓂᒃ, ᐊᒻᒪᓗ ᐊᑐᖅᐸᒃᑕᑐᖃᖏᓐᓄᑦ.</li>\n\t<li>ᐊᑐᓕᖅᑎᑕᐅᓗᓂ ᐊᖕᖏᖅᑕᐅᕗᖅ ᐃᓄᐃᑦ ᐳᕙᒡᓗᒍᓐᓃᑦᑎᐊᕐᓗᑎᒃ ᖃᓄᐃᓕᐅᕈᑕᐅᓂᐊᖅᑐᖅ - ᐊᒻᒪᓗ ᑲᑐᔾᔨᓗᑎᒃ ᐊᖕᖏᖅᓯᒪᔪᑦ ᓄᖑᑎᑕᐅᑦᑎᐊᒻᒪᕆᒡᓗᓂ ᐳᕙᒡᓗᖕᓂᖅ ᐃᓄᖕᓂ ᑎᑭᐅᑎᓚᐅᖅᑎᓐᓇᒍ 2030.</li>\n\t<li>ᐅᑯᐊ ᑖᒃᑯᖕᓇᖓᑦ ᓴᕿᑕᐅᓪᓗᑎᒃ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ ᐃᓕᓐᓂᐊᕐᓂᐊᓕᓵᖅᑐᑦ ᐊᒻᒪᓗ ᐸᐃᕆᕕᓕᕆᓂᖅ ᖃᓄᐃᓕᐅᕐᕕᐅᓂᐊᖅᑐᑦ, ᐅᑯᐊᓗ ᐃᑲᔪᕐᓂᐊᖅᑐᑦ ᐃᓄᖕᓂᒃ ᓄᑕᖃᓂᒃ ᐊᒻᒪᓗ ᐃᓅᓱᒃᑐᓂᒃ ᐊᑐᕈᓐᓇᕐᓗᑎᒃ ᐸᐃᕆᕕᖕᓂᒃ ᐊᒻᒪᓗ ᐃᓕᓐᓂᐊᕐᓗᑎᒃ ᑲᔪᓯᑦᑎᐊᕐᓂᐊᕐᒪᑕ ᐃᓅᓯᕐᒥᖕᓂ.</li>\n</ul>\n\n<p>ᐊᕐᕌᓂᓂ, ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ ᐱᒻᒪᕆᐅᔪᓂᒃ ᐱᒋᐊᖅᑎᑦᑎᓯᒪᔪᑦ ᓴᐃᒻᒪᖃᑎᒌᒡᐸᓪᓕᐊᓂᕐᒧᑦ, ᐃᓚᒋᔭᐅᓪᓗᑎᒃ ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᒪᒥᐊᓚᐅᖅᑐᑦ ᐊᕼᐃᐊᕐᒥᐅᑦ ᐃᓄᖕᓄᑦ ᓅᑕᐅᓚᐅᖅᓯᒪᖕᒪᑕ ᓄᓇᒋᓐᖏᑕᒥᖕᓄᑦ; ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᒪᒥᐊᓚᐅᖅᑐᑦ ᑭᒡᒐᖅᑐᖅᖢᒋᑦ ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐊᐅᓚᑦᑎᔾᔪᑕᐅᓚᐅᖅᑐᓄᑦ ᐳᕙᒡᓗᒃᑐᑦ ᐊᐃᑦᑐᕐᓗᐃᔪᓐᓇᖅᑐᑦ ᐃᓄᓕᒫᓂᒃ 1940-ᓂ ᑎᑭᓪᓗᒍ 1960-ᓄᑦ; ᐊᒻᒪᓗ ᐱᒋᐊᖅᑎᑕᐅᓂᖓ ᓇᓂᓚᕗᑦ ᐃᖏᕐᕋᓯᑎᑕᐅᔪᖅ ᐃᑲᔪᕐᓂᐊᕐᒪᑦ ᐃᓄᖕᓂ ᐃᓚᒥᖕᓂᒃ ᐊᓯᐅᔨᓯᒪᔪᓂᒃ ᓇᒡᓕᒋᔭᒥᖕᓂᒃ.</p>\n\n<p>ᐊᒻᒪᓗᑦᑕᐅᖅ, ᑲᑎᒪᔨᕋᓛᑦ ᓴᕿᑦᑎᓚᐅᖅᑐᑦ ᓯᕗᓪᓕᖅᐹᖅ ᐱᓕᕆᐊᕆᓂᐊᖅᑕᒥᖕᓄᑦ ᓴᓇᓂᐊᖅᑕᒥᖕᓄᑦ ᐸᕐᓇᐅᑎᑦ ᐊᐅᓪᓗᑎᓪᓗᒋᑦ ᐊᕙᑎᓕᕆᓂᕐᒧᑦ ᐊᒻᒪᓗ ᓯᓚᐅᑉ ᐅᖂᓯᕙᓪᓕᐊᓂᖓᓄ ᐊᓯᑦᔨᖅᑐᖅ, ᐊᒻᒪᓗ ᓴᐳᒻᒥᒋᐊᕈᑎᒃᓴᐃᑦ ᐃᒪᕕᖕᒥᒃ, ᐃᓚᒋᔭᐅᓪᓗᓂ ᐊᑎᓕᐅᖅᑕᐅᓗᓂ ᐱᑭᐊᓚᓱᐊᖅᓱᐊᖅ ᑲᑐᔾᔨᖃᑎᒌᑦ ᓯᕗᓕᐅᖅᑎᐅᔪᑦ ᐅᖃᖅᓯᒪᔭᖏᑦ. ᑕᒪᐅᓐᓇ ᐅᖃᖅᓯᒪᓂᖏᑦᑎᒍᑦ, ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᓯᕗᓕᐅᖅᑎᐅᔪᑦ ᐊᖕᖏᖅᓯᒪᑦᑎᐊᖅᑐᑦ ᓴᓇᖃᑎᒌᒡᓗᑎᒃ ᐱᓇᓱᐊᖃᑎᒌᒡᓗᑎᒃ, ᐊᒻᒪᓗ ᒐᕙᒪᒃᑯᖏᑦ ᑎᓐᒫᒃ ᐊᒻᒪᓗ ᐊᑯᑭᑦᑐᖅ, ᓴᐳᒻᒥᓗᒍ ᐱᑭᐊᓚᓱᐊᖅᓱᐊᖅ - ᓯᑯᖃᖅᐸᓐᖏᑦᑐᖅ ᐊᕙᓗᔭᐅᓯᒪᔪᖅ ᓯᑯᓂᑦ ᐅᐊᖕᓇᖓ ᓴᓐᓂᕈᑎᐅᑉ ᐃᒪᖓ, ᐊᕙᑖᓂ ᓄᓇᕗᑦ ᐊᒻᒪᓗ ᐊᑯᑭᑦᑐᖅ.</p>\n\n<p>ᐅᑯᐊ ᑲᑎᒪᔨᕋᓛᑦ ᐱᒋᐊᕈᒪᔪᑦ ᓴᓇᓗᑎᒃ ᓴᕿᑦᑎᓗᑎᒃ ᓄᑖᓂᒃ ᐊᐅᓪᓗᑎᒋᔪᓐᓇᖅᑕᒥᖕᓂ ᐱᖓᔪᒋᓕᖅᑕᖓᓄ ᐅᑭᐅᖓᓄ, ᐃᓚᒋᔭᐅᓗᑎᒃ ᑲᔪᓯᔪᒥᒃ ᐅᖃᐅᓯᕆᓗᒋᑦ ᓇᑉᐸᕆᐊᖃᖅᑐᓂ ᐃᖃᖅᐸᖅᓯᒪᔪᑦ ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂ.</p>\n\n<p>ᐅᑯᐊ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᐱᓇᓱᐊᖃᑎᒌᒍᑎᒥᖕᓄᑦ ᑲᑎᒪᔨᕋᓛᑦ ᒪᓕᖕᓂᐊᖅᑐᑦ ᐊᖕᖏᖅᓯᒪᔭᒥᖕᓂᒃ ᓄᑖᖑᕆᐊᖅᑎᓪᓗᒍ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᐃᓚᒌᒍᓯᖏᑦ ᐊᒻᒪᓗ ᓴᐃᒻᒪᖃᑎᒌᖕᓂᖅ ᒪᓕᒡᓗᓂ ᐃᓕᓴᖅᓯᓯᒪᓗᓂ ᐱᔪᓐᓇᐅᑎᖃᕐᓂᖏᓐᓂᒃ, ᐃᒃᐱᒍᓱᑦᑎᐊᕐᓂᕐᒥᒃ, ᐃᑲᔪᖃᑎᒌᖕᓂᕐᒥᒃ, ᐊᒻᒪᓗ ᐱᓇᓱᐊᖃᑎᒌᖕᓂᕐᒥᒃ.</p>\n\n<h2>ᐅᖃᖅᑕᐅᔪᑦ</h2>\n\n<blockquote>\n<p>“ᑕᐃᒪᖓᓂᑦ 2017, ᐃᓄᐃᑦ ᓯᕗᓕᐅᖅᑎᑦ ᐊᒻᒪᓗ ᒐᕙᒪᑐᖃᒃᑯᑦ ᒥᓂᔅᑕᖏᑦ ᓴᓇᖃᑎᒌᖏᓐᓇᖅᑐᑦ ᓄᑖᖑᕆᐊᖅᑎᓪᓗᒋᑦ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐃᓚᒌᒍᓯᖏᑦ, ᐱᕚᓪᓕᖅᑎᓪᓗᒍ ᓴᐃᒻᒪᖃᑎᖐᖕᓂᖅ, ᐊᒻᒪᓗ ᐊᔪᖅᓴᕈᓐᓃᑦᑎᐊᕐᓗᑎᒃ ᑕᒪᕐᒥᒃ ᐃᓄᐃᑦ. ᐊᖕᖏᖅᓯᒪᑦᑎᐊᖅᑐᒍᑦ ᓇᓂᓯᓗᑕ ᓄᓇᓕᖕᓂᑦ-ᐱᒋᔭᐅᔪᓂᒃ, ᓄᓇᓕᖕᓂᑦ-ᐃᕐᕋᑎᑕᐅᔪᓂᒃ ᐋᕿᖑᑎᒃᓴᓂᒃ, ᑖᔅᓱᑐᓇᖅ ᓄᑖᖅ ᐃᒡᓗᒃᓴᓄᑦ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᖅ, ᐅᑯᐊᓗ ᓴᓇᔭᐅᓯᒪᔭᕇᖅᑐᑦ ᐃᓄᖕᓂᑦ ᐱᓇᓱᐊᖃᑎᒋᓪᓗᒋᑦ ᒐᕙᒪᑐᖃᒃᑯᑦ, ᐊᒻᒪᓗ ᑐᓂᔭᐅᓂᐊᖅᑐᖅ ᐃᓄᖕᓂᑦ. ᑲᑐᔾᔨᓗᑕ, ᐱᓇᓱᐊᖃᑎᒌᒡᓗᑕ ᐋᕿᒃᓱᐃᓚᐅᖅᑕ ᐱᐅᓂᖅᓴᒥᒃ ᓯᕗᓂᒃᓴᖃᑦᑎᐊᖁᓪᓗᒋᑦ ᓄᓇᓖᑦ ᓇᓂᑐᐃᓐᓇᖅ ᐃᓄᐃᑦ ᓄᓇᖓᓂ, ᐊᒻᒪᓗ ᑕᒪᕐᒥᒃ ᑲᓇᑕᒥᐅᓄᑦ.”</p>\n\n<footer class=\"default\">ᔭᔅᑎᓐ ᐳᓘᑐ, ᓯᕗᓕᐅᖅᑎᖓ ᑲᓇᑕ</footer>\n</blockquote>\n\n<blockquote>\n<p>“ᐊᑑᑎᖃᖅᑐᓂᒃ ᐃᒡᓗᓴᖃᕈᓐᓇᕐᓂᐊᕐᒪᑕ ᑕᒪᓐᓇ ᑐᓐᖓᕕᓪᓚᕆᐅᔪᖅ ᐃᓄᐃᑦ ᐋᓐᓂᐊᖅᑕᐃᓕᑎᑦᑎᓂᖓᓄᑦ ᐊᒻᒪᓗ ᖃᓄᐃᖏᑦᑎᐊᓕᕈᓐᓇᕐᓂᖏᓐᓄᑦ. ᐅᑯᐊ ᐃᑲᔪᖃᑎᒌᑦ ᒐᕙᒪᑐᖃᒃᑯᓗ ᐊᒻᒪᓗ ᑲᓇᑕᒥ ᐃᓄᐃᑦ ᐃᒡᓗᓕᕆᓂᕐᒧᑦ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᖓ ᐱᒋᐊᖅᑎᑕᐅᔪᖅ ᐅᓪᓗᒥ ᕿᓂᖅᑐᑦ ᐱᐅᓯᕚᓪᓕᖁᓪᓗᒋᑦ ᐃᒡᓗᖁᑎᖏᑦ ᓇᓂᑐᐃᓐᓇᖅ ᐃᓄᐃᑦ ᓄᓇᖓᓂ ᐊᒻᒪᓗ ᐋᕿᐅᑎᑦᑎᐊᕐᓂᐊᕐᒪᑕ ᐊᖕᖏᓂᖅᓴᐅᔪᒥᒃ ᐃᓄᐃᑦ ᐃᒻᒥᒍ-ᒪᑭᑕᔪᓐᓇᖅᓯᓗᑎᒃ ᐊᒻᒪᓗ ᐊᐅᓚᑦᑎᔪᓐᓇᖅᓯᓗᑎᒃ.”</p>\n\n<footer class=\"default\">ᐊᖓᔪᖅᑳᖅ ᓇᐃᑕᓐ ᐅᐱᑦ, ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ</footer>\n</blockquote>\n\n<h2>ᓱᓕᔪᑦ ᑖᒃᑯᓂᖓ ᐱᓯᒪᔪᑦ</h2>\n\n<ul>\n\t<li>ᐊᓯᖏᑦ ᑲᔪᓯᑦᑎᐊᖅᓯᒪᔪᑦ ᑕᐃᒪᖓᓂᑦ ᐱᖃᑖ ᐊᕐᕌᒍᐊᓂ ᑲᑎᒪᔨᕋᓛᓂ ᐅᑯᐊ ᐃᓚᒋᔭᐅᔪᑦ:\n\t<ul>\n\t\t<li>ᐱᒋᐊᖅᑎᑕᐅᓂᖓ<a href=\"https://www.canada.ca/en/indigenous-services-canada/services/first-nations-inuit-health/supporting-inuit-children.html\" tabindex=\"107\">ᓄᑕᕋᖅ ᓯᕗᓪᓕᐅᑎᑕᐅᓗᓂ ᐃᖏᕐᕋᓯᑎᑕᐅᓯᒪᔪᖅ</a></li>\n\t\t<li>ᓴᕿᑕᐅᓂᖓ<a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2018/12/government-of-canada-announces-improvements-to-nutrition-north-canada-including-support-for-country-food.html\" tabindex=\"108\">ᐃᓄᐃᑦ-ᒐᕙᒪᑐᖃᒃᑯᑦ ᓂᕿᒃᓴᖃᕐᑎᑦᑎᓂᕐᒧᑦ ᓴᓇᖃᑎᒌᑦ ᑲᑎᒪᔨᑦ</a></li>\n\t\t<li>ᑲᔪᓯᔪᖅ ᓴᓇᔭᐅᓂᖓ ᓄᑖᖅ&nbsp;<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1499951681722/1537884604444\" tabindex=\"109\">ᐅᑭᐅᖅᑕᖅᑐᖅ ᐊᒻᒪᓗ ᐅᑭᐅᖅᑕᖅᑐᓂ ᐊᑐᐊᒐᒃᓴᖅ ᖃᓄᐃᓕᐅᕈᑕᐅᓂᐊᖅᑐᖅ ᐊᕙᓗᒃᓴᖓ</a></li>\n\t\t<li>ᐊᑐᓕᖅᑎᑕᐅᓪᓗᑎᒃ ᐊᖕᖏᖅᑕᐅᓪᓗᑎᒃ ᑎᓕᔭᐅᓯᒪᔾᔪᑎᒃᓴᖏᑦ ᕿᓂᕈᓐᓇᕐᕕᖃᕐᓗᑎᒃ ᐱᓕᕆᐊᒃᓴᓄᑦ ᐃᓄᐃᑦ ᐃᓕᓐᓂᐊᓕᓵᖅᑐᑦ ᑎᑭᓪᓗᒍ ᒍᓕ 12 ᐃᓕᓐᓂᐊᕈᑎᑦ</li>\n\t</ul>\n\t</li>\n\t<li>ᐅᑯᐊ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᐱᓇᓱᐊᖃᑎᒌᒍᑎᒥᖕᓄᑦ ᑲᑎᒪᔨᕋᓛᑦ ᓴᕿᑕᐅᓚᐅᖅᑐᑦ ᕕᕗᐊᕆ 2017 ᐊᑎᓕᐅᕆᓪᓗᑎᒃ ᐃᓄᐃᑦ ᓄᓇᖓᑦ ᓱᓕᓂᕋᐅᑎ ᐱᓪᓗᒋᑦ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᐱᓇᓱᐊᖃᑎᒌᒍᑎᒥᖕᓄᑦ. ᓇᓂᔭᐅᔪᖅ ᑐᓐᖓᔾᔪᑕᐅᓪᓗᓂ ᐅᑯᐊ ᐊᔾᔨᒌᒥᒃ ᐱᓇᓱᐊᖃᑎᒌᖕᓂᐊᕐᒪᑕ ᐊᕙᑖᓂᑦ ᐃᓄᐃᑦ ᐊᒻᒪᓗ ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐊᑑᑎᖃᒻᒪᕆᒃᑐᖅ ᓴᐳᒻᒥᖃᑎᒌᒃᐸᓪᓕᐊᓂᐊᕐᓗᓂ.</li>\n\t<li>ᐅᑯᐊ ᑲᑎᒪᔨᕋᓛᑦ ᐃᒡᓯᕙᐅᑕᖃᕐᓂᐊᖅᑐᑦ ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᑦᑎᖓᓂ ᐊᒻᒪᓗ ᐊᖓᔪᖅᑳᖓᓂ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ. ᐃᓚᒋᔭᐅᔪᑦ ᑖᒃᑯᓄᖓ ᒐᕙᒪᑐᖃᒃᑯᑦ ᒥᓂᔅᑕᖏ ᐊᒻᒪᓗ ᓂᕈᐊᖅᑕᐅᓯᒪᔪᑦ ᓄᓇᑦᓯᐊᕗᑦ ᒐᕙᒪᒃᑯᑦ, ᓄᓇᕗᑦ ᑐᓐᖓᕕᒃ ᑎᒥᖓ, ᐃᓅᕕᐊᓗᐃᑦ ᐊᕕᒃᑐᖅᓯᒪᔪᓂ ᑯᐊᐳᕆᓴᓐ, ᐊᒻᒪᓗ ᒪᑭᕕᒃᑯᑦ</li>\n\t<li>ᐅᑯᐊ ᑲᑎᒪᔨᕋᓛᑦ ᐃᓚᖃᖅᑐᑦ ᓈᓚᒋᐊᖅᑐᖅᓯᒪᔪᑦ ᐊᖓᔪᖅᑳᖏᑦ ᑲᓇᑕᒥ ᐃᓄᐃᑦ ᒪᒃᑯᒃᑐᑦ ᑲᑎᒪᔨᖏᑦ, ᐸᐅᒃᑑᑎᑯᑦ ᐃᓄᐃᑦ ᐊᕐᓇᐃᑦ ᑲᑐᔾᔨᖃᑎᒌᑦ ᑲᓇᑕᒥ, ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᓄᓇᕐᔪᐊᑉ ᑲᔾᔨᐊᓂ ᑲᑎᒪᔨᑦ ᑲᓇᑕ.</li>\n\t<li>ᐱᒃᑭᐊᓚᓱᐊᓱᐊᖅ, ᑕᐃᔭᐅᓲᖅ ᐅᑭᐅᖅᑕᖅᑐᒥ ᐊᐅᒃᑲᕐᓂᑦ, ᓄᓇᕐᔪᐊᒥ ᐱᕙᓪᓕᐊᑎᑦᑎᓂᖅᐸᐅᔪᖅ ᐃᒪᕕᖕᒥ ᐆᒪᔪᓕᒫᓂᒃ ᐊᕙᑎᓕᒫᖏᓐᓂᒡᓗ - ᐃᑲᔪᖅᑐᖅ ᐊᒥᓱᓂᒃ ᐳᐃᔨᓂᒃ, ᐃᓚᒋᔭᐅᔪᑦ ᑑᒑᓕᑦ ᕿᓚᓗᒐᐃᑦ, ᐊᐃᕕᖅ, ᓇᑦᑏᑦ, ᐊᒻᒪᓗ ᓇᓄᐃᑦ, ᐊᒻᒪᓗ ᑕᕆᐅᑉ ᑎᖕᒥᐊᖏᑦ ᐊᒻᒪᓗ ᖃᓄᕆᑦᑐᑐᐃᓐᓇᐃᑦ ᐃᖃᓗᐃᑦ.</li>\n\t<li>ᐅᑯᓇᓂ ᐅᖃᖅᓯᒪᔪᑦ&nbsp;<a href=\"https://changingclimate.ca/CCCR2019\" tabindex=\"110\">ᑲᓇᑕᐅᑉ ᐊᓯᑦᔨᖅᑎᑦᑎᓂᖓ ᓯᓚᐅᑉ ᐅᖂᓂᖓᓄᑦ ᐊᓯᑦᔨᖅᑐᓄᑦ ᐅᓂᒃᑳᓂᒃ</a><em>,</em>&nbsp;ᑕᒪᕐᒥᒃ ᑭᖑᓂᑦᑎᓂ ᐊᒻᒪᓗ ᓯᕗᓂᒃᓴᑦᑎᓂ ᐅᖂᓯᕙᓪᓕᐊᓂᖓ ᑲᓇᑕ, ᖃᓂᓛᖅ, ᒪᕐᕈᐃᓪᓗᐊᖅᑐᖅ ᐊᖕᖏᓂᖓ ᓄᓇᕐᔪᐊᒥ ᐅᖂᓯᕙᓪᓕᐊᓂᖓᑕ. ᑲᓇᑕᐅᑉ ᐅᑭᐅᖅᑕᖅᑐᐊ ᐅᖂᓯᓯᒪᓕᖅᑐᖅ ᐊᒻᒪᓗ ᑲᔪᓯᓂᐊᖅᑐᖅ ᐅᖂᓯᕙᓪᓕᐊᖏᓐᓇᕐᓗᓂ ᒪᕐᕉᐃᓪᓗᐊᖅᑐᖅ ᓄᓇᕐᔪᐊᕐᒥ ᓱᑲᓕᓂᖓᑕ.</li>\n</ul>\n\n<h2>ᑕᒪᒃᑯᓂᖓ ᐅᖃᐅᓯᖃᕐᒥᔪᑦ ᐃᑭᐊᕿᕕᒃᑯᑦ</h2>\n\n<ul>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1554302528267\" tabindex=\"111\">ᐃᓄᐃᑦ ᓄᓇᖓ ᐃᒡᓗᓕᕆᓂᕐᒧᑦ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᖅ</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/04/03/pikialasorsuaq-leaders-statement\" tabindex=\"112\">ᑭᒃᑭᐊᓚᓱᐊᓱᐊᖅ ᑲᑐᔾᔨᖃᑎᒌᑦ ᓯᕗᓕᐅᖅᑎᑦ ᐅᖃᐅᓯᖏᑦ</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\" tabindex=\"113\">ᐃᓄᐃᑦ ᓄᓇᖓ ᓱᓕᓂᕋᐅᑎ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐱᓇᓱᐊᖃᑎᒌᖕᓂᖓᓄᑦ</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce-inuit-crown\" tabindex=\"114\">ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᐊᒻᒪᓗ ᐊᖓᔪᖅᑳᖓ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ ᑐᓴᕐᑎᑦᑎᔪᑦ ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐱᓇᓱᐊᖃᑎᒌᖕᓂᖓᓄᑦ ᑲᑎᒪᔨᕋᓛᑦ</a></li>\n\t<li><a href=\"https://www.itk.ca/icpc-housing-pm/\" tabindex=\"115\">ᐃᓄᐃᑦ-ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐱᓇᓱᐊᖃᑎᒌᖕᓂᖓᓄᑦ ᑲᑎᒪᔨᕋᓛᑦ ᑐᓴᖅᑎᑦᑎᓚᐅᖅᑐᑦ ᑲᓇᑕᒥ ᐃᓄᐃᑦ ᐃᒡᓗᒃᓴᖏᓐᓂᒃ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᑦ ᐱᖓᔪᖓᓂ ᐊᕐᕌᒍᐊᓂ ᑲᑎᒪᒐᒥᒃ ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓᓗ</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2019/01/canada-advances-reconciliation-with-historic-apology-to-the-ahiarmiut.html\" tabindex=\"116\">ᑲᓇᑕ ᐱᕚᓪᓕᖅᑎᑕᖓ ᓴᐃᒻᒪᖃᑎᒌᖕᓂᖅ ᐃᒻᒪᑲᓪᓚᓂᑦ ᒪᒥᐊᕕᐅᔭᕆᐊᖃᖅᓯᒪᔪᑦ ᐊᕼᐃᐊᕐᒥᐅᑦ</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/03/08/prime-minister-delivers-apology-inuit-federal-governments-management-tuberculosis\" tabindex=\"117\">ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᒪᒥᐊᑦᑐᖅ ᐃᓄᖕᓄᑦ ᒐᕙᒪᑐᖃᒃᑯᑦ ᐊᐅᓚᑦᑎᔾᔪᓯᕆᓚᐅᖅᑕᖏᓐᓂᒃ ᐳᕙᒡᓗᒃᑐᓄᑦ ᐊᐃᑦᑐᕐᓗᐃᔪᓐᓇᕐᓂᖓᓄ ᑕᐃᑲᓂ 1940-ᓂᑦ 1960-ᓄᑦ</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2018/12/inuit-tuberculosis-elimination-framework-released.html\" tabindex=\"118\">ᐳᕙᒡᓗᖕᓂᖅ ᓄᖑᑎᑕᐅᓗᓂ ᖃᓄᐃᓕᕈᑕᐅᓂᐊᖅᑐᖅ ᓴᕿᑕᐅᓯᒪᕗᖅ ᑐᓴᒐᒃᓴᖅ</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1552059698863/1552059725063\" tabindex=\"119\">ᐅᓇ ᓇᓂᓚᕗᑦ ᐃᖏᕐᕋᓯᑎᑕᐅᔪᖅ</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/plan/chap-03-en.html#Supporting-Inuit-Priorities\" tabindex=\"120\">ᑮᓇᐅᔭᖅᑑᑎᒃᓴᖅ 2019 – ᐃᑲᔪᖅᑐᖅ ᐃᓄᐃᑦ ᓯᕗᓪᓕᐅᑎᔭᕆᐊᖃᖅᑕᖏᓐᓄᑦ</a></li>\n</ul></div>\n      "
}