{
  "path": "/en/news/news-releases/2016/10/13/canada-and-france-strengthen-bilateral-ties",
  "pageTitle": "Canada and France strengthen bilateral ties | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, welcomed the Prime Minister of France, Manuel Valls, on his first official visit to Canada.</p><p>During the visit, the two leaders took concrete steps to strengthen the Franco-Canadian relationship, and agreed to deepen the already rich cultural ties between the two countries, work towards a safer world, and create the kind of economic growth that will help the middle class grow and prosper.</p><p>The two leaders agreed to renew the Canada-France Enhanced Cooperation Agenda, which will: enhance cooperation in peace, security and sustainable development, with an emphasis on protecting women and children, as well as peacekeeping; strengthen economic and scientific cooperation, including through the Canada-European Union (EU) Comprehensive Economic and Trade Agreement (CETA); and, foster closer societal, cultural, and people-to-people ties, with a special focus on youth.</p><p>Canada and France are true partners and true friends, much of which can be attributed to what we share – a common language, a common history, and a common set of values.</p><h2>Quote</h2><blockquote><p>“Canada and France share an impressive and storied past. Thanks to the continued success of our longstanding friendship – and to the dedicated work by Prime Minister Valls – the next chapter of our relationship with France looks even more promising than the last. I am particularly excited that we were able to agree to enhance commercial ties between our two countries – including through CETA – and that we will be strong partners in our efforts to create economies that work for the middle class and those working hard to join it.”&nbsp;<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>As a permanent member of the United Nations Security Council, NATO, G7, G20, founding nation of the European Union (EU) and leading partner in La Francophonie, France is a key ally for Canada on the international stage.</li><li>France is Canada’s eighth-largest merchandise trading partner globally and fourth-largest export market in the EU, with bilateral trade valued at $9.9 billion.</li><li>The EU is the world’s second-largest market and Canada’s second-largest trading partner after the United States.</li><li>Approximately 98 percent of all EU tariff lines will be duty-free on the day CETA comes into force (over 99 percent will be duty-free when the agreement is fully implemented).</li><li>Over the course of the visit, ministers from both countries also signed the Declaration on Cooperation in Innovation for 2016-2018 and the Declaration on the Joint Economic Action Plan Canada-France 2016-2017. In addition, Canada and France agreed to a new roadmap on peacekeeping.</li></ul><h2><strong><br></strong>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2016/10/06/prime-minister-france-visit-canada\">News release: Prime Minister of France to visit Canada</a></li><li><a href=\"/en/news/backgrounders/2016/10/13/canada-france-enhanced-cooperation-agenda\">Canada-France Enhanced Cooperation Agenda</a></li><li><a href=\"/en/news/backgrounders/2016/10/13/france-canada-peacekeeping-roadmap\">France-Canada Peacekeeping Roadmap</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/cooperation_in_innovation-cooperation_en_innovation.aspx?lang=eng\">Declaration Between the Department of Foreign Affairs, Trade and Development of Canada and the Ministry of Economy and Finance of the French Republic on Cooperation in Innovation for 2016-2018</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/joint_economic_action_plan-plan_action_conjoint_economique.aspx?lang=eng\">Declaration on the Joint Economic Action Plan Canada-France 2016-2017</a></li></ul></div>\n      "
}