{
  "path": "/en/news/news-releases/2020/07/31/new-mobile-app-help-notify-canadians-potential-covid-19-exposure-now",
  "pageTitle": "New mobile app to help notify Canadians of potential COVID-19 exposure now available | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Over the past several months, Canadians have been following public health advice and doing their part to help prevent the spread of COVID-19. Now, as we take steps to ease restrictions and safely restart our economy, we need to continue to work together to contain the virus and keep Canadians safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Ontario, Doug Ford, today announced that COVID Alert, a new national mobile app, is now available to Canadians for free download. The app, first developed in Ontario, helps notify users if they may have been exposed to someone who has tested positive for COVID-19.</p>\n\n<p>Use of COVID Alert is voluntary, and serves as another tool to help limit the spread of COVID-19. Once the app is fully functioning in their province or territory, users who test positive for COVID-19 will receive a one-time key from their health authority that they can enter into the app. When the key is entered, COVID Alert will notify other users who may have come in close contact with that person for at least 15 minutes in the past 14 days, so they can contact their local public health authority for guidance.</p>\n\n<p>To safeguard the confidentiality and privacy of all Canadians, the app uses strong measures to protect any data it collects, and does not track a user's location or collect personally identifiable information. The Privacy Commissioners of Canada and Ontario were consulted on the development of COVID Alert, to ensure the highest level of privacy for Canadians using the app.</p>\n\n<p>The Government of Canada has been working in close partnership with the Province of Ontario to launch the COVID Alert app. Health authorities in Ontario will be the first to begin distributing one-time keys. The Government of Canada is also working with the other provinces and territories to bring their jurisdictions on board in the coming weeks and months.</p>\n\n<p>An expert Advisory Council will ensure the app meets the highest standards in public health outcomes, privacy, and technology. The members of the Council reflect Canada’s regional and cultural diversity, and cover a wide range of expertise, including health, privacy, data governance, science, and innovation. Their advice will inform the implementation and rollout phases of the app.</p>\n\n<p>The new COVID Alert app is just one example of how the Government of Canada is working with the provinces, territories, and other partners to protect the health of all Canadians, and support efforts to restart the economy gradually and safely.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“While we have made good progress over the past few months, COVID-19 remains a very serious threat to the health of Canadians. As we continue to gradually restart our economy, innovative technologies like this new app will help us keep our families and communities safe and healthy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am proud of the fact that this Ontario-made app will now be available to individuals and families right across the country. It will be another powerful tool to help us stop the spread of this deadly virus and keep people healthy and safe. I encourage everyone to download it onto your handheld device, it is free, easy to use, and the responsible thing to do.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“I want to thank Canadians for the sacrifices made to flatten the curve in the first wave. The mobile app we are launching today is an additional tool Canadians can use, as they continue to follow public health advice to contain the spread of COVID-19.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Built with a privacy-first approach, COVID Alert is a safe and easy-to-use tool that Ontarians can download to protect themselves, their loved ones and community from COVID-19. This Ontario-made app keeps people informed about being potentially exposed to the virus, allows them to act quickly to stop the spread of the virus and is a key tool in our case and contact management strategy. I encourage all Ontarians to download the app, as early detection of cases will be important as we continue to carefully reopen more of the province.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Christine Elliott, Ontario’s Deputy Premier and Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our digital response has been critical to overcoming the challenges brought about by the COVID-19 pandemic. By collaborating across sectors and orders of government, we have built an easy to use and secure digital tool that will help slow the spread of this virus and protect the health and safety of Canadians. The more of us who use the app, the more effective it will be, so I encourage all Canadians to do their part and download COVID Alert.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Digital Government</footer>\n</blockquote>\n\n<blockquote>\n<p>“As Ontario safely and gradually re-opens, we continue to take a digital-first approach to delivering simpler, faster, better services to support Ontarians, including the COVID Alert app, which will leverage the power of integrated data to protect the health and safety of the people of Ontario.&nbsp;By making it easier for Ontarians to protect themselves, their loved ones and their communities, we continue to deliver on our commitment to build&nbsp;a smarter government that works for you.”</p>\n\n<footer class=\"default\">The Hon. Peter Bethlenfalvy, Ontario’s President of the Treasury Board</footer>\n</blockquote>\n\n<blockquote>\n<p>“Innovation is more important now than ever. With this new app, we will be better positioned to help contain the spread of COVID-19 while supporting Canada’s economic reopening. It is intended to support people in safely participating in the economy. We’re also taking every step necessary to ensure Canadians have the confidence and trust that their data is being protected. The COVID-19 Exposure Notification App Advisory Council will help ensure COVID Alert meets the highest standards of privacy, technology, and, most importantly, public health outcomes.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>COVID Alert is now available for Canadians as a free download from the App Store or the Google Play Store. The app assigns a random code to a user’s device that pings other users of the app via Bluetooth when they are within a range of approximately two metres. If they test positive for the virus, users can choose to upload their random codes to a central server located in Canada. Once uploaded, the random codes are stored on the server for 15 days, after which they are automatically deleted.</li>\n\t<li>The COVID-19 Exposure Notification App Advisory Council was named by the Government of Canada and its members are:\n\t<ul>\n\t\t<li>Jean-François Gagné (co-chair)</li>\n\t\t<li>Carole Piovesan (co-chair)</li>\n\t\t<li>Simone Atungo</li>\n\t\t<li>Dr. Jonathan Dewar</li>\n\t\t<li>Dr. Bunmi Fatoye</li>\n\t\t<li>Éloïse Gratton</li>\n\t\t<li>Andrew Harrison</li>\n\t\t<li>Brenda McPhail</li>\n\t\t<li>Dr. Derek Ruths</li>\n\t\t<li>Dr. Margo Seltzer</li>\n\t\t<li>Dr. Gaynor Watson-Creed</li>\n\t</ul>\n\t</li>\n\t<li>The app has undergone a security assessment by BlackBerry and the Canadian Centre for Cyber Security. All data provided to the app will be securely stored and protected.</li>\n\t<li>The Government of Canada has taken extensive steps to ensure that citizens’ privacy and data are protected. Given the importance the government assigns to these issues, the Office of the Privacy Commissioner has been consulted on this initiative.</li>\n\t<li>COVID Alert is a collaboration between Health Canada, the Canadian Digital Service, the Province of Ontario, and Innovation, Science and Economic Development Canada. It builds upon an exposure notification solution developed by Shopify volunteers in coordination with the nonprofit<em> </em><a href=\"https://www.lfph.io/\">Linux Foundation Public Health</a>. It is also the work of a team of developers from across the country.</li>\n\t<li>Canadians who want to know more about COVID Alert can call 1-833-784-4397.</li>\n\t<li>As part of our commitment to open and transparent government, the Canadian Digital Service is making its work on the app’s development and testing available on <a href=\"https://github.com/cds-snc/covid-shield-mobile\">Github</a>.</li>\n\t<li>COVID Alert complements the existing <a href=\"https://ca.thrive.health/\">Canada COVID App</a>, a tool that supports Canadians in tracking their symptoms while allowing them to receive the latest updates and access trusted resources.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert.html\">Download COVID Alert</a></li>\n\t<li><a href=\"https://ic.gc.ca/eic/site/icgc.nsf/eng/h_07687.html\">COVID-19 Exposure Notification App Advisory Council</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/canadas-covid-19-economic-response-plan-support-for-canadians-and-businesses.html\">Canada’s COVID-19 Economic Response Plan: Support for Canadians and businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/18/prime-minister-announces-new-mobile-app-help-notify-canadians-covid\">Prime Minister announces new mobile app to help notify Canadians of COVID-19 exposure</a></li>\n</ul></div>\n      "
}