{
  "path": "/en/news/statements/2021/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/multiculturalism-day.html\">Canadian Multiculturalism Day</a>:</p>\n\n<p>“Today, we celebrate a pillar of our national character, and recognize the many contributions that people of all backgrounds have made, and continue to make, to our society. &nbsp;</p>\n\n<p>“Canada’s commitment to multiculturalism is an example to the world, and at the heart of our success as a country. For generations, Canadians have known we are stronger when we recognize and honour our differences and diverse roots, and work together to build a more inclusive future for all.</p>\n\n<p>“This year, we mark an important anniversary. Fifty years ago this fall, Canada became the first country in the world to adopt a policy of multiculturalism, which was later enshrined in law through the <em>Canadian Multiculturalism Act</em>. While we have made important progress toward a more inclusive and equitable society since then, much work remains to be done. Every day, far too many racialized Canadians, Indigenous peoples, and religious minorities continue to face systemic racism, discrimination, and a lack of resources and opportunity.</p>\n\n<p>“Sadly, over the last year and a half, the COVID-19 pandemic has revealed and deepened social, health, and economic disparities, and seen a rise in threats and violence against many of these communities. The tragic events of the past several weeks are painful reminders that Canada has not always lived up to its ideals, and that many Canadians continue to feel fear and insecurity simply because of the colour of their skin, their background, or their faith.</p>\n\n<p>“This is unacceptable and must change. That is why the Government of Canada must and will continue to take meaningful action to right past wrongs, fight racism and discrimination, and foster a fairer, more equitable society.</p>\n\n<p>“As individuals, we all have a role to play in building a more inclusive and resilient country. The values of openness, compassion, and respect have the power to bring us together, but they are only meaningful if we embody them. When we choose to put them into practice, we choose to shape a better tomorrow for everyone.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to celebrate Canadian Multiculturalism Day by taking part in <a href=\"https://public.tableau.com/views/CelebrateCanada_Desktop_E/S-Multi?:showVizHome=no%20%20%20%20%20&amp;:embed=true&amp;:toolbar=no&amp;language=EN-CA\">online events and in-person activities</a>, and recognizing the invaluable contributions that Canadians of all backgrounds continue to make to our country. Together, we can make Canada a stronger, more welcoming, and inclusive place.”</p></div>\n      "
}