{
  "path": "/en/news/statements/2018/04/28/statement-prime-minister-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Mourning:</p><p>“The <a href=\"http://www.ccohs.ca/events/mourning/\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">National Day of Mourning</span></a> calls attention to workers in Canada and around the world who have lost their lives, suffered illness, or been injured on the job.</p><p>“Every person deserves to be able to provide for themselves and their families, knowing that they will return home safe and sound at the end of their work day. Sadly, too many people face workplace risks to their physical and mental health. We know that some of these risks stem from workplace harassment and violence. The theme of this year’s National Day of Mourning is ‘Violence and Harassment: Not Part of the Job.’</p><p>“Ending harassment and violence in the workplace requires a culture change, one that we all – businesses, employers, employees, organizations, and governments – need to actively support. Businesses that take care of employees foster healthy environments that attract and retain the best talent. Employers that lead by example encourage their employees to reach their full potential, and help their businesses succeed. Employees also make a difference by following workplace best practices, creating a more positive environment for the entire team.</p><p>“The Government of Canada is doing its part. We are taking action to reduce work-related dangers and harassment, and to help prevent on the job accidents, injuries, and illnesses. Budget 2018 proposes $34.9 million over five years to ensure that federally regulated workplaces, including Parliament, are free from harassment and any type of violence. This will mean more resources for training and education, more timely complaints investigations, and effective enforcement. We have also proposed $50.4 million over five years to address sexual harassment in Canadian workplaces. These funds will boost legal aid across the country to support victims of workplace sexual harassment, and help develop a national outreach program to better inform workers – especially those most vulnerable – about their rights and how they can get support if they have experienced harassment.</p><p>“Occupational health and safety is fundamental. From banning asbestos, to modernizing our compliance and enforcement regime under the <i>Canada Labour Code</i> so that there are real and public consequences for violating workplace standards, we are deeply committed to making workplaces safer and more productive for everyone.</p><p>“Today, I encourage all Canadians to pause and honour those who have lost their lives, become disabled, or suffered injury or illness while on the job. Together, we rededicate ourselves to a future where every Canadian can work free from violence and harassment, in environments that put their safety and wellness first.”</p></div>\n      "
}