{
  "path": "/en/news/statements/2022/06/06/canada-chile-announcement-carbon-pricing",
  "pageTitle": "Canada-Chile announcement on carbon pricing | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Government of Canada and the Government of the Republic of Chile, recognize the urgent need to take swift and ambitious action on climate change this decade, to address this global threat affecting the economy, the environment and people’s livelihoods.</p>\n\n<p>We reaffirm our support for the Paris Agreement and for scaled-up action, including through enhanced ambition as expressed in recently revised nationally determined contributions (NDCs) and updated climate change action plans, policies and programs. We celebrate Canada and Chile’s 25 years of active cooperation on environmental issues under the <em>Agreement on Environmental Cooperation between the Government of Canada and the Government of the Republic of Chile.</em> We also reaffirm our support for the Paris Declaration on Carbon Pricing in the Americas (December 2017), as well as the Glasgow Declaration on Carbon Pricing in the Americas (November 2021).</p>\n\n<p>We agree in this regard that carbon pricing is one of the most efficient and cost-effective policy tools to reduce greenhouse gas emissions and drive clean innovation. Given the significance of both public and private sector leadership on climate change, we further recognize the need for a clear market signal for private sector investment opportunities and efficient allocation of capital.</p>\n\n<p>Acknowledging that carbon pricing works best when implemented alongside other policies and measures, and in a manner that ensures environmental integrity. We recognize that the impact and effectiveness of carbon pricing increases as more countries adopt it.</p>\n\n<p>To advance the adoption and expansion of carbon pricing systems across the Americas and around the world, Canada, and Chile:</p>\n\n<ol class=\"lowerAlpha\">\n\t<li>Call on all countries to implement or enhance carbon pricing as part of their suite of climate policies, with a goal of tripling the percentage of global emissions covered by pollution pricing to 60 per cent by 2030;</li>\n\t<li>Will work together through the Summit of the Americas and other international fora to advance carbon pricing as an important policy tool;</li>\n\t<li>Offer to jointly share technical support and lessons learned with countries looking to develop and implement carbon pricing systems;</li>\n\t<li>Pledge to identify opportunities to strengthen our respective domestic pricing systems including their potential links with new international carbon markets;</li>\n\t<li>Will advance carbon pricing in a transparent and predictable way to support private sector decision making and decarbonisation;</li>\n\t<li>Commit to continue working bilaterally and multilaterally on opportunities for the implementation of the Paris Agreement, including its article 6 and the Glasgow Climate Pact; and,</li>\n\t<li>Plan to convene a high-level event at COP27 to showcase the role of carbon pricing in the global response to climate change.</li>\n</ol></div>\n      "
}