{
  "path": "/en/news/news-releases/2022/03/29/delivering-clean-air-and-strong-economy-canadians",
  "pageTitle": "Delivering clean air and a strong economy for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians have been clear about what they want: clean air and good jobs, a healthy environment, and a strong economy. Today, the Government of Canada delivered a plan that outlines the next steps to continue delivering on those priorities for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the release of the <em>2030 Emissions Reduction Plan: Canada’s Next Steps to Clean Air and a Strong Economy. </em>The plan is an ambitious and achievable sector-by-sector approach for Canada to reach its new climate target of cutting emissions by 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</p>\n\n<p>Building on the actions of millions of Canadians, Indigenous Peoples, businesses, provinces, territories, and municipalities, the Government of Canada is continuing to take action to fight climate change, create jobs, and ensure that Canadians are global leaders in the transition to clean industries and technologies.</p>\n\n<p>The <em>2030 Emissions Reductions Plan</em> includes $9.1&nbsp;billion in new investments to cut pollution and grow the economy, including:</p>\n\n<ul>\n\t<li><strong>Making it easier for Canadians to switch to electric vehicles</strong>. We are investing more than $2.9&nbsp;billion in charging infrastructure, providing financial support to make buying zero-emission vehicles (ZEVs) more affordable, supporting clean medium- and heavy-duty transportation projects, and developing a regulated sales mandate so that 100 per cent of new passenger vehicles sold in Canada will be zero emission by 2035, with interim targets of at least 20 per cent by 2026, and at least 60 per cent by 2030.</li>\n\t<li><strong>Greening Canada’s homes and buildings.</strong> By investing around $1&nbsp;billion, we will develop a national net-zero by 2050 buildings plan, the Canada Green Buildings Strategy, work with provinces, territories, and other partners to support the adoption of the highest tier building codes, pilot community-scale retrofits, and facilitate deep energy retrofits for large buildings.</li>\n\t<li><strong>Helping industries to adopt clean technology and transition to net-zero emissions</strong>. We are<strong> </strong>delivering historic investments to enable industries to be clean and competitive and creating greater incentives for clean technologies and fuels, such as carbon capture, utilization, and storage.</li>\n\t<li><strong>Making Canada’s grid even cleaner.</strong> We will develop a regulated Clean Electricity Standard, make additional investments of about $850&nbsp;million in clean energy projects like wind and solar power, and work with provinces and territories, stakeholders, and Indigenous partners to move Canada’s electricity grid to net-zero emissions by 2035 while continuing to ensure that Canadians and businesses have access to reliable, affordable power.</li>\n\t<li><strong>Reducing oil and gas emissions</strong>. We will continue working closely with provinces and territories, stakeholders, and Indigenous partners to develop an approach to cap oil and gas sector emissions to achieve net-zero emissions by 2050, reduce oil and gas methane emissions by at least 75 per cent by 2030, and create good jobs. The plan includes a projected contribution for the oil and gas sector of a 31 per cent reduction from 2005 levels, which is equivalent to 42 per cent from 2019 levels and will guide the government’s work to develop the cap on emissions from the oil and gas sector.</li>\n\t<li><strong>Supporting farmers in building a clean, prosperous future. </strong>We are supporting farmers with about $1&nbsp;billion for new and expanded programs to help them develop and adopt sustainable practices, energy-efficient technologies, and solutions like capturing carbon from the air.</li>\n\t<li><strong>Empowering communities to take climate action.</strong> We are investing $2.2 billion in expanding the Low Carbon Economy Fund to support projects from governments, schools, non-profits, Indigenous Peoples, and more to cut pollution and create jobs in communities across the country.</li>\n\t<li><strong>Embracing the power of nature to fight climate change.</strong> We will make an additional investment of $780&nbsp;million to help Canada’s oceans, wetlands, peatlands, grasslands, and agricultural lands capture and store carbon, and explore the potential for negative emission technologies in the forest sector.</li>\n</ul>\n\n<p>The<em> </em><em>2030 Emissions Reduction Plan: Canada’s Next Steps to Clean Air and a Strong Economy</em> reflects submissions from over 30,000 Canadians, provinces and territories, Indigenous partners, industry, civil society, and the independent Net-Zero Advisory Body. The plan represents a whole-of-society approach with practical ways to achieve emission reductions across all parts of the economy.</p>\n\n<p>The Government of Canada will continue working with all Canadians to develop and implement the new policies and initiatives announced today. The government will publish an update on progress toward meeting the emissions reductions targets in late 2023.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Taking real climate action that is not only ambitious, but also achievable, is key to building a strong economy in the 21st century. With the additional measures announced today, we are continuing to deliver on the priorities Canadians asked us to address: clean air, good jobs, a strong economy, and a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is the next major step in our government’s plan to reduce pollution and create good, sustainable jobs in Canada. With our natural resources, highly skilled workforce, and strong financial system, Canada stands to benefit substantially by increasing our climate ambition. Thanks to the actions of millions of Canadians, we have flattened the curve of our pollution trajectory, and this roadmap charts the course to lowering emissions to meet our climate target of 40 to 45 per cent below 2005 levels. By acting collectively now, we are positioning Canada to be a leader in the clean economy.”</p>\n\n<footer class=\"default\">The Hon. Steven Guilbeault, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“The transition to a cleaner, prosperous, and more competitive economy must be an immediate priority and a sustained effort in the years ahead. Canada’s <em>2030 Emissions Reductions Plan</em> outlines how we can achieve our 2030 target, while building pathways to net-zero emissions by 2050 and creating economic opportunities for Canadians across the country.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today’s measures build on Canada’s existing climate actions outlined under the Pan-Canadian Framework on Clean Growth and Climate Change (2016), Canada’s Strengthened Climate Plan: <em>A Healthy Environment and a Healthy Economy</em> (2020), and Budget&nbsp;2021. These actions have already contributed to reducing emissions in 2030 by 36 per cent from 2005 levels, while creating economic opportunities across the country.</li>\n\t<li>The <a href=\"https://laws-lois.justice.gc.ca/eng/acts/C-19.3/FullText.html\"><em>Canadian Net-Zero Emissions Accountability Act</em></a> establishes in law Canada’s 2030 emissions reduction target under the Paris Agreement of 40 to 45 per cent below 2005 levels and net-zero by 2050, and requires Canada to publish a series of plans and progress reports to support the achievement of those targets.</li>\n\t<li>The&nbsp;<a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\"><em>2030 Emissions Reduction Plan: Canada’s Next Steps to Clean Air and a Strong Economy</em></a>&nbsp;is the first of many plans on the pathway to 2050 and fulfills a requirement under the Act.</li>\n\t<li>The 2030 plan is designed to be evergreen – a comprehensive roadmap that reflects levels of ambition to guide emissions reduction efforts in each sector. As governments, businesses, non-profits, and communities across the country work together to reach these targets, we will identify and respond to new opportunities.</li>\n\t<li>To ensure Canada stays on course as it reduces emissions, the plan includes an interim greenhouse gas emissions objective of 20 per cent below the 2005 level for 2026, which is required under the Act. The Act also requires the Government of Canada to prepare progress reports by the end of 2023, 2025, and 2027.</li>\n\t<li>The Net-Zero Advisory Body is a group of experts with a diverse range of experience and expertise that advises the Minister of Environment and Climate Change on the best pathways for Canada to achieve its goal of net-zero emissions by 2050, while growing the economy and creating good jobs.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2022/03/2030-emissions-reduction-plan--canadas-next-steps-for-clean-air-and-a-strong-economy.html\">Backgrounder: 2030 Emissions Reduction Plan – Canada’s Next Steps for Clean Air and a Strong Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\">2030 Emissions Reduction Plan: Clean Air, Strong Economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview.html\">Strengthened Climate Plan: <em>A Healthy Environment and a Healthy Economy</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n\t<li><a href=\"https://forum.globeseries.com/event/f10bfead-5709-4988-87b1-ff4189da0634/summary\">GLOBE Forum&nbsp;2022</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/22/delivering-canadians-now\">Delivering for Canadians now</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/01/prime-minister-trudeau-announces-enhanced-and-ambitious-climate\">Prime Minister Trudeau announced enhanced and ambitious climate action to cut pollution at the COP26 summit</a></li>\n</ul></div>\n      "
}