{
  "path": "/en/news/news-releases/2016/09/28/prime-minister-trudeau-welcomes-start-first-meeting-prime-ministers",
  "pageTitle": "Prime Minister Trudeau welcomes the start of the first meeting of the Prime Minister’s Youth Council | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today introduced the first 15 members of the Prime Minister’s Youth Council. These young leaders will bring their best ideas to bear on issues facing Canada and will plan further engagement with youth in their communities.</p><p>Chosen from applicants across Canada, these young Canadians – aged from 16 to 24 years – will be advising the Prime Minister and the Government of Canada on policies and programs that are important to them.</p><p>Over the coming days and months, the Council will also meet with policy leaders, Cabinet ministers, the Parliamentary Secretary for Youth, Peter Schiefke, and other senior officials.</p><p>At their first meeting later this week, the Council will discuss issues including youth employment, environment and climate change, gender-based violence, and youth service – among others.</p><p><strong>Quote</strong></p><p>“Countries that do not use the talents of all their citizens –regardless of ethnicity, gender or age– risk finding out that the status quo is no way to meet the very real challenges they face. I am excited to work with the Youth Council, to invite them to take part in government policy, and to make clear to Canadian youth that there are many avenues for them to be the leaders of today.”<br><em>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</em></p><p><strong>Quick Facts</strong></p><ul><li>Over 14,000 people signed up to be considered for the Council and almost all of them expressed an interest to participate in other engagement activities domestically and internationally.</li><li>Canadians between the ages of 16 and 24 can apply until October 7 to the second round of applications for the Youth Council. Successful applicants will participate in the 2017 Youth Council meetings.</li><li>Young Canadians will also have additional engagement opportunities on areas of interest to them.<br><br></li></ul><h4>Related Product</h4><ul><li><a href=\"/en/news/backgrounders/2016/09/28/new-members-prime-minister’s-youth-council\">New Council members - Backgrounder<br></a></li></ul><h4>Associated Link</h4><ul><li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Website – Prime Minister’s Youth Council</a></li></ul></div>\n      "
}