{
  "path": "/en/news/news-releases/2017/07/07/prime-minister-deliver-keynote-address-2017-us-national-governors",
  "pageTitle": "Prime Minister to deliver keynote address at 2017 U.S. National Governors Association Summer Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>There is no international relationship more important to Canadian prosperity than Canada’s relationship with the United States. A constructive working relationship with all orders of the U.S. government, especially the federal government, is key to creating good, middle class jobs and economic opportunities on both sides of the border.</p><p>As part of strengthening this vital relationship, the Prime Minister, Justin Trudeau, today announced that he will travel to Providence, Rhode Island, on July 14<sup>th</sup> to deliver the keynote address at the 2017 Summer Meeting of the National Governors Association. The meeting will bring together numerous U.S. governors to discuss issues of common concern.</p><p>The Prime Minister will discuss the close collaboration between our two countries, with a particular focus on Canada-U.S. trade. He will also emphasize the importance of the Canada-U.S. partnership in cross-border security and the potential for common solutions on climate change.</p><p>Meeting with U.S. governors will follow the Prime Minister’s upcoming engagements with President Trump at the G20 Summit in Hamburg, Germany.</p><h2>Quote</h2><blockquote><p>“No countries share a closer bond than Canada and the United States. Each day, hundreds of thousands of people cross the border to work, travel or visit loved ones. Ever more integrated supply chains draw our economies closer together, bringing jobs and prosperity to Canadians and Americans alike. I will continue to work with all orders of the U.S. government to create good, middle class jobs on both sides of the border, and to find solutions to the challenges we face together.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and the United States share the largest trading relationship in the world. Bilateral trade between the two countries was valued at $882 billion in 2016, and Canada is the largest secure supplier of energy to the U.S.</li><li>Canada is the number one export destination for most American states, and bilateral trade and investment supports millions of jobs on both sides of the border. In fact, over two-thirds of the governors at the meeting represent states that have Canada as their number one export destination.</li><li>The two countries share the longest border in the world, by which approximately 400,000 people and $2.4 billion worth of goods and services cross daily.</li><li>The National Governors Association is a bipartisan organization of U.S. governors. It seeks to promote visionary state leadership, share best practices and provide the states with a forum to speak with a collective voice on U.S. national policy. It meets twice annually.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/index.aspx?lang=eng\">Canada and the United States</a></li><li><a href=\"https://www.nga.org/cms/home\">National Governors Association</a></li></ul></div>\n      "
}