{
  "path": "/en/news/news-releases/2017/10/17/prime-minister-announces-appointment-new-chief-justice-court-queens",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of the Court of Queen’s Bench of Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable <a href=\"/en/news/backgrounders/2017/10/17/biographical-notes-–-honourable-mary-t-moreau\">Mary T. Moreau</a>, a judge of the Court of Queen’s Bench of Alberta, to the position of Chief Justice of the Court of Queen’s Bench of Alberta. She replaces the Honourable Neil C. Wittmann, who resigned on May 1, 2017, after nearly 18 years of distinguished service as a judge.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the appointment of Mary T. Moreau as Chief Justice of the Court of Queen’s Bench of Alberta. The first woman appointed to this position, Chief Justice Moreau brings more than 20 years’ experience within this very organization to her new role. I wish her every success as she takes the next step in her remarkable legal career.”<br><cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li><li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li><li>The Court of Queen’s Bench of Alberta hears trials in civil and criminal matters, in addition to appeals from decisions of the provincial court.</li><li>The Court of Queen’s Bench of Alberta currently has 85 full-time and supernumerary judges. Through Budget 2017, the Government of Canada created 11 new judicial positions in Alberta, which will be filled in the coming months.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/10/17/biographical-notes-–-honourable-mary-t-moreau\">Biographical Notes – The Honourable Mary T. Moreau</a></li></ul></div>\n      "
}