{
  "path": "/en/news/statements/2020/08/06/statement-prime-minister-fatal-explosion-lebanon",
  "pageTitle": "Statement by the Prime Minister on the fatal explosion in Lebanon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fatal explosion in Lebanon:</p>\n\n<p>“Canadians were shocked and deeply saddened by the devastating toll of Tuesday’s explosion on the people and city of Beirut, Lebanon. We mourn the tragic deaths of so many people, and wish a full and quick recovery to the thousands who were injured.</p>\n\n<p>“We are also thinking of the many who continue to search for friends and family, and who have lost their homes and livelihoods during this extremely challenging time. You are in our hearts, and we are with you. We know that the people of Lebanon will come together and rebuild, as they have before, and overcome this tragedy.</p>\n\n<p>“Our two countries share a deep and longstanding friendship, which is rooted in close people-to-people ties. Hundreds of thousands of Lebanese Canadians live in communities across the country. For decades, they have strengthened our country and continue to make significant contributions to Canada today. To help the people of Lebanon, Canada is providing <a href=\"https://www.canada.ca/en/global-affairs/news/2020/08/canada-providing-humanitarian-assistance-in-response-to-beirut-explosion.html\">up to $5 million in humanitarian assistance</a>, with an initial $1.5 million going immediately to the Lebanese Red Cross and other trusted humanitarian organizations.</p>\n\n<p>“To the people of Lebanon, Lebanese Canadians, and all those who watched the explosion in shock and horror, worrying about their loved ones and friends: we will always support the people of Lebanon as you work to heal and rebuild your beautiful city. Canada will also work with the international community to keep identifying how we can support urgent needs, and continue to offer emergency support, including medical aid, food, and shelter.</p>\n\n<p>“Friends and relatives of Canadian citizens in Lebanon can contact Global Affairs Canada's 24/7 Emergency Watch and Response Centre by calling 613-996-8885 or 1-800-387-3124, or by sending an email to <a href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a>. Canadian citizens in Lebanon in need of emergency consular assistance should contact the Embassy of Canada in Beirut at 961 (4) 726-700 or <a href=\"mailto:berut-cs@international.gc.ca\">berut-cs@international.gc.ca</a> or call Global Affairs Canada’s Emergency Watch and Response Centre at +1 613-996-8885.\"</p></div>\n      "
}