{
  "path": "/en/news/news-releases/2019/04/18/prime-minister-opens-process-select-next-justice-supreme-court-canada",
  "pageTitle": "Prime Minister opens process to select the next justice of the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today opened the process to select the next justice of the Supreme Court of Canada who will fill the vacancy created by the upcoming retirement of Justice Clément Gascon.</p>\n\n<p>Under the approach launched in 2016, an independent and non-partisan advisory board will identify suitable candidates who are jurists of the highest caliber, functionally bilingual, and representative of the diversity of our country. Former Prime Minister Kim&nbsp;Campbell will again chair the advisory board, and additional members will be announced shortly.</p>\n\n<p>Justice Gascon was appointed to the Supreme Court of Canada from the Quebec Court of Appeal. Under the requirements of the <em>Supreme Court Act</em>, the process is open only to qualified applicants trained in civil law and from Quebec. <strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“On behalf of all Canadians, I thank Justice Gascon for his service on our country’s highest court, which is recognized around the world as a strong, independent judicial institution. The process we are launching today will follow the tradition of appointing only the most exceptional legal minds to the court, while reflecting Quebec’s historic representation on the court and its civil law tradition.”</p>\n\n<p><em>—</em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Qualifying candidates who wish to be considered for the upcoming vacancy must submit an application package (questionnaire, authorization form, and a background check consent form) no later than 23:59 Pacific time on May 17, 2019.</li>\n\t<li>Those interested in applying are encouraged to first review the statutory requirements set out in section 6 of the&nbsp;<em><a href=\"http://laws-lois.justice.gc.ca/eng/acts/S-26/\">Supreme Court Act</a></em>, as well as the Statement of Qualifications and Assessment Criteria that will guide the advisory board in evaluating a candidate’s suitability.</li>\n\t<li>Justice Gascon will retire from the Supreme Court effective September 15, 2019.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-justice/news/2019/04/statement-from-the-minister-of-justice-and-attorney-general-of-canada-on-the-retirement-of-supreme-court-justice-clement-gascon.html\">Statement from the Minister of Justice and Attorney General of Canada on the retirement of Supreme Court Justice Clément Gascon</a></li>\n\t<li><a href=\"http://fja-cmf.gc.ca/scc-csc/index-eng.html\">Supreme Court of Canada Appointments</a></li>\n\t<li><a href=\"http://fja-cmf.gc.ca/scc-csc/2019/qualifications-eng.html\">Qualifications and Assessment Criteria</a></li>\n\t<li><a href=\"http://pm.gc.ca/eng/news/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">New process for judicial appointments to the Supreme Court of Canada</a></li>\n</ul></div>\n      "
}