{
  "path": "/en/news/news-releases/2016/11/10/prime-minister-re-opens-veterans-affairs-canada-office-sydney-nova",
  "pageTitle": "Prime Minister re-opens Veterans Affairs Canada office in Sydney, Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Veterans and their families have earned the respect and gratitude of all Canadians. The Government of Canada is committed to supporting our Veterans – where they live – so that they have access to the critical services they need to help improve their quality of life.</p><p>To meet these objectives, the Prime Minister, Justin Trudeau, and the Minister of Veterans Affairs, Kent Hehr, today marked the re-opening of the Veterans Affairs Canada (VAC) office in Sydney, Nova Scotia. This office will provide the nearly 2,200 Veterans in the area with in-person assistance for services and benefits – including pension medical examinations, applications, rehabilitation, and career transition.</p><p>The re-opening of Veteran services offices in Sydney, Charlottetown, Corner Brook, Windsor, Thunder Bay, Saskatoon, Brandon, Prince George and Kelowna, as well as the opening of an additional office in Surrey, are all important steps to make it easier for Veterans to access services across the country.</p><p>The re-opening of these offices is only one of several measures that the Government of Canada is taking to provide our Veterans the care and compassion they have earned. Other measures include enhanced long-term financial benefits for disabled Veterans and new measures to honour the service, sacrifice and accomplishments of those who have served.</p><h2>Quotes</h2><blockquote><p>“Our Veterans have served our country with bravery, honour, and dignity – protecting the values we cherish. We will now serve them well, providing the services, care and respect they and their families need and are due.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“I am extremely proud to be reopening doors that were previously closed to Veterans and their families here in Sydney, as well as in other parts of the country. Our Veterans have selflessly answered the call to serve our country, and now we are answering their call by enhancing financial benefits, restoring and enhancing access to critical services, and by expanding service in British Columbia and the territories, and hiring more frontline staff. This was part of our commitment to Canadians, and we stand by this promise.”<br>— <cite>The Honourable Kent Hehr, Minister of Veterans Affairs and Associate Minister of National Defence</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The new Veterans Affairs Canada office in Sydney will be staffed by up to 15 employees who will be able to help Veterans by: responding to their questions about services and benefits; helping complete their applications; and conducting pension medical examinations.</li><li>The Minister of Veterans Affairs has already re-opened three other VAC offices: &nbsp;Corner Brook, Newfoundland and Labrador (July 5, 2016); Brandon, Manitoba (October 21, 2016); Kelowna, British Columbia (November 8, 2016) and has expanded outreach to the territories.</li><li>By May 2017, VAC offices will be reopened in Charlottetown, Prince Edward Island; Windsor and Thunder Bay, Ontario; Saskatoon, Saskatchewan; and Prince George, British Columbia. As well a tenth office will open in Surrey, British Columbia by Spring 2017.</li><li>Budget 2016 committed $78.1 million (over the next five years) to opening offices and hiring staff.&nbsp;</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.veterans.gc.ca/eng/contact/office-openings\">Office Openings</a></li><li><a href=\"http://www.veterans.gc.ca/eng/news/info-graphics/service-points\">Points of service for Veterans and their families (Infographic)</a></li><li><a href=\"http://www.veterans.gc.ca/eng/news/info-graphics/points-of-service\">Points of service (Infographic)</a></li><li><a href=\"/en/minister-veterans-affairs-and-associate-minister-national-defence-mandate-letter\">Minister of Veterans Affairs and Associate Minister of National Defence Mandate Letter from the Prime Minister, Justin Trudeau</a></li></ul></div>\n      "
}