{
  "path": "/en/news/news-releases/2023/01/26/prime-minister-announces-appointment-canadas-first-special",
  "pageTitle": "Prime Minister announces appointment of Canada’s first Special Representative on Combatting Islamophobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Islamophobia, discrimination, and hate, in any form, are unacceptable and have no place in this country. The Government of Canada stands with and supports Muslim communities across Canada and reaffirms its commitment to take action to denounce and tackle Islamophobia, hate-fuelled violence, and systemic discrimination whenever and wherever it occurs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the appointment of Amira Elghawaby as Canada’s first Special Representative on Combatting Islamophobia.</p>\n\n<p>Ms. Elghawaby is an award-winning journalist and human rights advocate. A founding board member of the Canadian Anti-Hate Network and past board member at the Silk Road Institute, she has had an extensive career supporting initiatives to counter hate and promote inclusion. She currently leads strategic communications and campaigns at the Canadian Race Relations Foundation and is a member of the National Security Transparency Advisory Group.</p>\n\n<p>As Canada’s Special Representative on Combatting Islamophobia, Ms. Elghawaby will serve as a champion, advisor, expert, and representative to support and enhance the federal government’s efforts in the fight against Islamophobia, systemic racism, racial discrimination, and religious intolerance. She will promote awareness of the diverse and intersectional identities of Muslims in Canada and provide advice to the government in the development of inclusive policies, legislative proposals, programs, and regulations that reflect their realities. In so doing, she will also help advance respect for equity, inclusion, and diversity and shine a light on the important contributions of Muslims to our country’s national fabric.</p>\n\n<p>Islamophobia is a lived experience for Muslim communities across the country and requires ongoing action. The Government of Canada remains unwavering in its commitment to fight hatred, racism, and discrimination. Together, we can build a better future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Diversity truly is one of Canada’s greatest strengths, but for many Muslims, Islamophobia is all too familiar. We need to change that. No one in our country should experience hatred because of their faith. The appointment of Ms. Elghawaby as Canada’s first Special Representative on Combatting Islamophobia is an important step in our fight against Islamophobia and hatred in all its forms. I look forward to working with her as we continue building a country where everyone feels safe and respected.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In Canada, diversity is a fact, but inclusion is a choice. Our government has listened to the lived experiences of Muslim communities from across the country and is taking action in the fight against Islamophobia. As Canada’s first Special Representative on Combatting Islamophobia, Amira Elghawaby will use her vast knowledge and experience as a human rights advocate to help guide and reinforce Canada’s efforts in addressing anti-Muslim hatred, systemic racism, racial discrimination, and religious intolerance. This appointment is a significant step toward building a safer and more inclusive Canada for all.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Housing and Diversity and Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As defined in Canada’s Anti-Racism Strategy, Islamophobia includes racism, stereotypes, prejudice, fear, or acts of hostility directed toward Muslims.</li>\n\t<li>In July 2021, the Government of Canada hosted a virtual National Summit on Islamophobia, which helped identify ways for the government to better work with Muslim communities to implement anti-racism initiatives that specifically address Islamophobia and hate-fuelled violence. The appointment of a Special Representative was one of the recommendations put forward at the summit.</li>\n\t<li>The application process for the new position of Special Representative on Combatting Islamophobia was launched in June 2022. Ms. Elghawaby was appointed following an open, transparent, and merit-based selection process conducted for this Governor in Council position.</li>\n\t<li>In 2021, January 29 was officially designated as the National Day of Remembrance of the Quebec City Mosque Attack and Action Against Islamophobia, a day to remember the victims of this tragedy, denounce Islamophobia and all other forms of racism, hate, and religious discrimination, and advance action to combat them.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2023/01/26/amira-elghawaby\">Amira Elghawaby</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/representative-combatting-islamophobia.html\">Canada’s Special Representative on Combatting Islamophobia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/news/2021/07/the-government-of-canada-concludes-national-summit-on-islamophobia.html\">The Government of Canada concludes National Summit on Islamophobia</a></li>\n</ul></div>\n      "
}