{
  "path": "/en/news/news-releases/2020/09/25/new-agreements-secure-additional-vaccine-candidates-covid-19",
  "pageTitle": "New agreements to secure additional vaccine candidates for COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Canadians continue to deal with the health and economic impacts of the global pandemic, the Government of Canada is signing new agreements to establish a guaranteed supply of potential vaccines that will help keep Canadians safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an agreement with AstraZeneca to procure up to 20 million doses of its COVID‑19 vaccine candidate. This agreement adds to those already reached with Sanofi and GlaxoSmithKline, Johnson &amp; Johnson, Novavax, Pfizer, and Moderna, which were made following the recommendations of the COVID-19 Vaccine Task Force. With these agreements in place, the government has now secured access for Canadians to six leading vaccine candidates.</p>\n\n<p>The Prime Minister also announced Canada’s participation in the COVID-19 Vaccine Global Access (COVAX) Facility, a global procurement mechanism that will help deliver fair, equitable, and timely access to COVID-19 vaccines. The Government of Canada is committing approximately $220 million to the Facility to procure up to 15 million vaccine doses for Canadians. An additional $220 million will be channeled through the COVAX Advance Market Commitment to purchase doses for low- and middle-income countries, because we cannot beat this virus in Canada unless we end it everywhere. By joining this initiative, Canada is helping to develop and deploy safe, effective, and accessible COVID-19 vaccines.</p>\n\n<p>Protecting Canadians from COVID-19 is priority number one, and the first foundation of the Government of Canada’s plan for a stronger and more resilient Canada. Together, we will keep Canadians healthy and ensure they have the support they need, while we work toward beating this virus.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The best way to end this pandemic, and to keep Canadians healthy, is with a safe and effective vaccine. By investing in multiple vaccine candidates and ensuring that we can distribute one quickly from coast to coast to coast, we are taking the necessary steps to put Canadians on the path to recovery from COVID-19.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The health and safety of Canadians is our government's priority. We're taking action on a comprehensive plan that includes investing in clinical trials, securing the supply of an eventual vaccine, and increasing Canada’s biomanufacturing capacity to ensure Canadians have access to a safe and effective vaccine for COVID-19.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada continues to work diligently to protect the health and safety of Canadians during the pandemic. With today’s announcement, we have agreements in place that guarantee Canada access to multiple vaccine candidates of various types including viral vector, protein subunit, and mRNA. The diversity of our portfolio ensures that when these vaccines have been proven to be safe and effective, Canadians will have access to them.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic will only be overcome through coordinated action around the world. We strongly believe that supporting other countries in their fight against COVID-19 is crucial to protect Canadians at home. Canada is committed to supporting the COVAX Facility, and the Advance Market Commitment within it, to ensure all participating countries have rapid, fair, and equitable access to COVID-19 vaccines. The Facility is an example of how multilateral cooperation can allow us to accomplish together what none of us could accomplish alone.”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of International Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has signed agreements with the following companies:\n\t<ul>\n\t\t<li>AstraZeneca, which will supply up to 20 million doses of its viral vector vaccine candidate AZD1222.</li>\n\t\t<li>Sanofi and GlaxoSmithKline, which will supply up to 72 million of doses of their protein subunit vaccine candidate.</li>\n\t\t<li>Johnson &amp; Johnson, which will supply up to 38&nbsp;million doses of its viral vector vaccine candidate Ad26.COV2.S.</li>\n\t\t<li>Novavax, which will supply up to 76&nbsp;million doses of its protein subunit vaccine candidate NVX-CoV2373.</li>\n\t\t<li>Pfizer, which will supply a minimum of 20&nbsp;million doses of its mRNA vaccine candidate, BNT162. The government is negotiating with the company to expand the agreement to include options for obtaining additional doses.</li>\n\t\t<li>Moderna, which will supply up to 56&nbsp;million doses of its mRNA vaccine candidate mRNA-1273.</li>\n\t</ul>\n\t</li>\n\t<li>Currently, no vaccines have been approved to prevent COVID-19 in Canada. Many vaccines are in clinical trials or under development. Once additional studies have been completed, Health Canada will review the evidence of safety, efficacy, and manufacturing quality for each vaccine to determine whether individual vaccines will be approved for use in Canada, before they are made available to Canadians.</li>\n\t<li>Full payments to drug companies are contingent on the vaccines passing clinical trials and obtaining regulatory approval. All contracts the Government of Canada signs with vaccine developers contain off-ramps and exit provisions, should they be required.</li>\n\t<li>The Government of Canada is also securing the equipment and supplies needed for the final phases of vaccine manufacturing and packaging in Canada. The government is also purchasing the equipment required for safe and effective immunization, including syringes, needles, and alcohol swabs.</li>\n\t<li>The COVAX Facility is managed by Gavi, the Vaccine Alliance, in close partnership with the Coalition for Epidemic Preparedness Innovations and the World Health Organization.</li>\n\t<li>The COVAX Facility is currently investing in vaccine production capacity across multiple vaccine candidates so that, upon regulatory approval, doses can be made available to participants.</li>\n\t<li>Canada’s commitment to the COVAX Facility complements its bilateral agreements with vaccine manufacturers and further diversifies Canada’s portfolio of vaccine candidates.</li>\n\t<li>The $440 million in funding announced today is in addition to the up to $25 million (USD) the Government of Canada committed to the COVAX Advance Market Commitment in July 2020. &nbsp;</li>\n</ul>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en/corporate/covid-19-vaccine-task-force\">COVID-19 Vaccine Task Force</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/31/new-measures-ensure-supply-future-vaccines-and-therapies-against\">New measures to ensure the supply of future vaccines and therapies against COVID-19</a></li>\n\t<li><a href=\"https://www.gavi.org/covid19/covax-facility\">Gavi – COVAX Facility</a></li>\n</ul></div>\n      "
}