{
  "path": "/en/news/news-releases/2022/06/30/prime-minister-concludes-successful-first-official-visit-spain-wraps",
  "pageTitle": "Prime Minister concludes successful first official visit to Spain, wraps up international trip | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Spain where he met with Spanish Prime Minister Pedro Sánchez to continue deepening our bilateral relationship, which is characterized by shared values like protecting democracy and human rights, and our strong economic ties.</p>\n\n<p>The Prime Ministers issued a <a href=\"/en/news/statements/2022/06/30/joint-statement-between-canada-spain\">joint statement</a> on opportunities to enhance cooperation on our shared priorities including taking ambitious climate action, advancing gender equality, and building strong economies that benefit people in both countries and create good middle-class jobs. The leaders also spoke about issues of shared interest including democracy, human rights, digital policy, as well as regional issues in Sahel, Latin America, and the Indo-Pacific.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez strongly condemned Russia’s illegal invasion of Ukraine and reaffirmed their support for Ukraine. They also agreed on the need to sustain momentum in responding to Russia’s aggression and committed to continue working together with international partners to address the impacts of the conflict, including food, energy, and economic security and food security.</p>\n\n<p>This visit concluded a 10-day trip by the Prime Minister to Rwanda, Germany, and Spain, where he met with leaders to continue working closely with global partners and democracies around the world to address the real challenges people are facing today, while rising to meet the opportunities of tomorrow.</p>\n\n<p>While in Rwanda, the Prime Minister drove action on food security, climate change, gender equality, and other key priorities at the 2022 Commonwealth Heads of Government Meeting. At the meeting, the Prime Minister announced nearly $500 million to make life better for people in the Commonwealth and beyond, including $250 million in emergency food assistance.</p>\n\n<p>The Prime Minister then headed to Germany to participate in the G7 Summit, where he met with his counterparts to continue advancing our shared priorities, strengthen unity, and coordinate efforts to support Ukraine. During the G7, he announced new, targeted sanctions against Russia and Belarus, and $151.7 million in new humanitarian, development, and peace and security support for Ukraine and a new $200 million loan to Ukraine through the International Monetary Fund.</p>\n\n<p>Following the G7 Summit, the Prime Minister participated in the NATO Summit in Madrid, Spain, where he met with Allies to advance transatlantic security and strengthen the Alliance. Canada also made announcements on additional military support to Ukraine, strengthening NATO’s eastern flank, and expanding Canada’s diplomatic presence in Armenia, Estonia, Lithuania, Slovakia, and Latvia.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Spain are partners and allies that enjoy a strong relationship based on shared interests and values, including respect for human rights, democracy, gender equality, and a commitment to making life better for people. I thank Prime Minister Sánchez for hosting this productive bilateral visit and I look forward to continue working together to further advance our relationship to benefit people in both our countries.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Spain and Canada are committed to defending international peace and global security and work together within several institutions, such as the United Nations (UN).</li>\n\t<li>Spain and Canada are active members of NATO and participants in a variety of multilateral peace and security operations. This includes NATO’s multinational enhanced Forward Presence Battle Group in Latvia, which is led by Canada and to which Spain is the second largest troop contributing country, and the Global Coalition against Daesh in Iraq.</li>\n\t<li>In 2021, bilateral trade in goods and services between Canada and Spain totalled $6.5&nbsp;billion, making Spain Canada’s 18th-largest global trading partner in goods and services.</li>\n\t<li>During his trip to Rwanda, Germany, and Spain, the Prime Minister made additional announcements including:\n\t<ul>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">$250&nbsp;million to help address global food security</a> and increasing global food and nutrition needs, especially for the most vulnerable and with a focus in Sub-Saharan Africa.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/25/prime-minister-drives-action-food-security-climate-change-and-gender\">$246.5&nbsp;million to advance action in key areas</a>, such as global health, gender equality, and sexual and reproductive health, and to further support efforts to tackle climate change and strengthen peace and security throughout the African continent.</li>\n\t\t<li>Expanding Canadian diplomatic representation on the African continent to further strengthen our relationships, help promote our diverse partnerships, and broaden our shared interests.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/28/prime-minister-announces-additional-support-ukraine-and-shared\">$151.7 million in new humanitarian, development, and peace and security support for Ukraine</a>. This includes $75 million in humanitarian assistance to help get food, emergency cash and vouchers, protection, shelter and health services to Ukrainians. It also includes $52 million for agricultural solutions including grain storage units to help improve food security, $15 million to support lifesaving mine clearing efforts, and $9.7 million to support accountability for human rights violations. As well as $200 million loan to Ukraine through the International Monetary Fund to help meet its urgent liquidity needs and $73 million in humanitarian assistance that Canada pledged on April 9, 2022, has now been allocated to address the crisis in Ukraine and neighbouring countries.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/27/prime-minister-announces-additional-sanctions-support-ukraine\">New, targeted sanctions</a> against 34 additional supporters of Putin’s war and 48 entities in the Russian and Belarusian defence sectors. Canada will also sanction state-sponsored disinformation, ban the export of technologies that could improve Russia and Belarus’s manufacturing capability, and ban the import of certain gold goods from Russia.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/30/prime-minister-and-nato-leaders-strengthen-transatlantic-security\">Canada’s offer to host</a> NATO’s North American Regional Office of the Defence Innovation Accelerator for the North Atlantic (DIANA). The DIANA will comprise a network of innovation hubs, accelerator sites and test centres across Europe and North America, which foster and protect Allied innovation, including Canadian innovation.</li>\n\t\t<li>Increasing Canadian diplomatic presence and network in Central and Eastern Europe and the Caucasus, including a new embassy in Armenia, converting current Canadian offices in Estonia, Lithuania, and Slovakia to full embassies with resident ambassadors and strengthening our presence at our embassy in Latvia.</li>\n\t\t<li>Providing an additional six drone cameras and finalizing negotiations to supply Ukraine with up to 39 armoured combat support vehicles (ACSVs), including elements for repairs and servicing.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/29/statement-prime-minister-natos-invitation-finland-and-sweden-join\">Supporting Finland and Sweden’s application to join NATO</a> and has taken domestic action to ensure this occurs as quickly as possible.</li>\n\t</ul>\n\t</li>\n\t<li>While in Rwanda, Prime Minister Trudeau held bilateral meetings with the President of Rwanda, Paul Kagame, the Prime Minister of Antigua and Barbuda, Gaston Browne, the President of Ghana, Addo Dankwa Akufo-Addo, the President of Kenya, Uhuru Kenyatta, the President of Zambia, Hakainde Hichilema.</li>\n\t<li>While in Germany, Prime Minister Trudeau held bilateral meetings with the President of France, Emmanuel Macron, the Chancellor of Germany, Olaf Scholz, the Prime Minister of India, Narendra Modi, the President of Indonesia, Joko Widodo, the Prime Minister of Italy, Mario Draghi, the Prime Minister of Japan, Kishida Fumio, the Prime Minister of the United Kingdom, Boris Johnson and the President of the European Commission Ursula von der Leyen.</li>\n\t<li>While in Spain, Prime Minister Trudeau held bilateral meetings with the NATO Secretary General, Jens Stoltenberg, the Prime Minister of Australia, Anthony Albanese, the Prime Minister of Denmark, Mette Frederiksen, the President of Finland, Sauli Niinistö, the Prime Minister of New Zealand, Jacinda Ardern, the President of South Korea, Yoon Suk-Yeol and the Prime Minister of Sweden, Magdalena Andersson.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2022/06/30/joint-statement-between-canada-spain\">Joint Statement between Canada and Spain</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/spain-espagne/relations.aspx?lang=eng\">Canada-Spain relations</a></li>\n</ul></div>\n      "
}