{
  "path": "/en/news/readouts/2022/11/02/prime-minister-justin-trudeau-speaks-ontario-premier-doug-ford",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Ontario Premier Doug Ford.</p>\n\n<p>The Prime Minister emphasized the critical importance of standing up for Canadians’ rights and freedoms, including workers’ rights. He was clear that the preemptive use of the <em>Canadian Charter of Rights and Freedoms’</em> notwithstanding clause is wrong and inappropriate, and should only ever be used in the most exceptional of circumstances.</p>\n\n<p>The two leaders discussed recent investments in Ontario, including to support the telecommunications sector and to produce components of electric vehicle batteries that will create good middle-class jobs. They also talked about their ongoing work together on health care and affordable housing, notably through the Housing Accelerator Fund.</p>\n\n<p>The Prime Minister and the Premier agreed to continue working together on these and other issues of importance to Ontarians.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/07/13/delivering-good-jobs-and-clean-air-new-electric-vehicle-battery\">Delivering good jobs and clean air with a new electric vehicle battery components facility in Ontario</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/17/strengthening-canadas-position-leader-5g-and-digital-innovation\">Strengthening Canada’s position as a leader in 5G and digital innovation</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/08/making-housing-more-affordable-canadians\">Making housing more affordable for Canadians</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/08/30/prime-minister-justin-trudeau-meets-ontario-premier-doug-ford\">Prime Minister Justin Trudeau meets with Ontario Premier Doug Ford</a></li>\n</ul></div>\n      "
}