{
  "path": "/en/news/readouts/2021/10/20/prime-minister-justin-trudeau-speaks-leader-new-democratic-party-jagmeet",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Leader of the New Democratic Party Jagmeet Singh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Leader of the New Democratic Party, Jagmeet Singh, ahead of the return of Parliament.</p>\n\n<p>The Prime Minister outlined the government’s priorities, including support for Canadians and our universal public health care system during and beyond the pandemic, affordability, climate change, reconciliation, housing, and child care.</p>\n\n<p>The Prime Minister reiterated the government’s steadfast commitment to supporting Canadians through the fight against COVID‑19, including the need to continue investing in our health care systems and support health care workers who have had Canadians’ backs throughout this crisis.</p>\n\n<p>On climate change, the leaders spoke about taking strong action in the fight against climate change ahead of the upcoming COP26 summit.</p>\n\n<p>The Prime Minister reiterated the importance of $10-a-day child care, both now and in the future, and the government’s ongoing work to reach agreements&nbsp;with the remaining provinces and territories. The leaders also spoke about additional ways to make life more affordable for Canadians.</p>\n\n<p>Among the government’s immediate legislative priorities, the Prime Minister raised putting an end to the harmful practice of conversion therapy, legislating 10 days of paid sick leave for federally regulated workers while also working on better sick leave for Canadians across the country, and making it a criminal offence to harass or threaten health care workers.</p>\n\n<p>The Prime Minister emphasized the need for all Members of Parliament in the House of Commons to be fully vaccinated against COVID-19 and continuing hybrid Parliament so that all Members of Parliament can participate safely.</p>\n\n<p>The Prime Minister and Mr. Singh also discussed the current water supply issue and&nbsp;state of emergency&nbsp;in Iqaluit. The Prime Minister spoke about the federal government’s support to date and commitment to be a full partner.</p>\n\n<p>The meeting is part of the Prime Minister’s consultations with opposition leaders to discuss the priorities of Canadians, following the announcement of Parliament’s return.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">Coronavirus disease (COVID-19): Canada’s response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/15/prime-minister-announces-dates-cabinet-swearing-and-return-parliament\">Prime Minister announces the dates of the Cabinet swearing-in and return of Parliament</a></li>\n</ul></div>\n      "
}