{
  "path": "/en/news/readouts/2021/11/13/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Ethiopia, Abiy Ahmed.</p>\n\n<p>The two prime ministers discussed the ongoing conflict in northern Ethiopia.</p>\n\n<p>Prime Minister Trudeau underscored the importance of all parties working toward a political solution and an inclusive national dialogue to bring the conflict to a peaceful resolution. He highlighted the diplomatic efforts by African Union High Representative for the Horn of Africa region, Olusegun Obasanjo, who is working with all parties to negotiate a cessation of hostilities.</p>\n\n<p>The Prime Minister emphasized the need to respect human rights, and to ensure unhindered humanitarian access and delivery of humanitarian assistance to those affected by the conflict.&nbsp;He also expressed concern about the rise of hate speech and inter-ethnic tensions.</p>\n\n<p>The two leaders committed to staying in touch and&nbsp;Prime Minister Trudeau reinforced Canada’s strong and ongoing commitment to supporting efforts to bring a peaceful resolution to the conflict.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/minister-of-foreign-affairs-speaks-with-chairperson-of-african-union-commission.html\">Minister of Foreign Affairs speaks with Chairperson of African Union Commission</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/canada-withdraws-canadian-embassy-staffs-dependants-and-non-essential-personnel-from-ethiopia.html\">Canada withdraws Canadian embassy staff’s dependants and non-essential personnel from Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/statement-by-minister-of-foreign-affairs-and-minister-of-international-development-on-release-of-investigation-report-on-atrocities-in-the-tigray-r.html\">Statement by Minister of Foreign Affairs and Minister of International Development on release of investigation report on atrocities in the Tigray region in Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/canada-announces-new-assistance-for-those-affected-by-conflict-in-ethiopias-tigray-region.html\">Canada announces new assistance for those affected by conflict in Ethiopia’s Tigray region</a></li>\n</ul></div>\n      "
}