{
  "path": "/en/news/statements/2021/05/25/statement-prime-minister-africa-day",
  "pageTitle": "Statement by the Prime Minister on Africa Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Africa Day:</p>\n\n<p>“Today, we join the African Union in celebrating Africa Day. We also commit to continue working to deepen our relationships with the dynamic and diverse countries of Africa.</p>\n\n<p>“Africa Day marks the anniversary of the creation of the Organization of African Unity, which was succeeded by the African Union in 2002. This day is an opportunity to recognize the progress made throughout the continent, and the role of the African Union in promoting peace and security, economic development, and global cooperation.</p>\n\n<p>“During my visit to Ethiopia and Senegal last year, we further strengthened Canada’s partnerships with countries across the continent and committed to creating economic growth, increasing trade and investment, promoting democracy, advancing gender equality, and fighting climate change. Last week, I <a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/18/prime-minister-trudeau-announces-additional-support-hard-hit-african\">announced additional support</a> for hard-hit African economies as part of Canada’s continued commitment to growth and opportunity in Africa.</p>\n\n<p>“Canada and African countries will continue to work together to find solutions to the global challenges of today and prepare for the ones of tomorrow. We cannot defeat COVID-19 unless all countries have the resources to respond to, and recover from, this crisis. The Government of Canada will keep working with international partners to support an equitable access to COVID-19 tests, treatments, and vaccines, and a strong global economic recovery that benefits everyone, including by recognizing the specific needs of African countries.</p>\n\n<p>“On behalf of the Government of Canada, I wish everyone celebrating a happy Africa Day. By working together, we can overcome current and future challenges, and build a better, fairer, and more prosperous future.”</p></div>\n      "
}