{
  "path": "/en/news/readouts/2020/03/19/prime-minister-justin-trudeau-speaks-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Prince Edward Island Premier Dennis King to discuss the evolution of COVID-19.</p>\n\n<p>The two leaders reaffirmed their commitment to continued collaboration and coordination between their respective governments to respond to COVID-19. They discussed the measures announced by the Government of Canada to support workers and businesses through Canada’s COVID-19 Economic Response Plan. As with all organizations, COVID-19 is having an impact on CBC/Radio-Canada’s day-to-day operations. The two leaders agreed that Islanders deserve access to local coverage. The Prime Minister committed to having the minister responsible speak with CBC to explore solutions&nbsp;for Islanders given&nbsp;these extraordinary circumstances.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of Islanders and all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul></div>\n      "
}