{
  "path": "/en/news/readouts/2022/04/29/prime-minister-justin-trudeau-meets-mayor-markham-frank-scarpitti",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Markham Frank Scarpitti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of Markham, Frank Scarpitti, to discuss shared priorities.</p>\n\n<p>The Prime Minister and Mayor spoke of the valuable partnership between the federal government and cities such as Markham, an economic hub that is playing an important role in Canada’s recovery from the COVID-19 pandemic. In particular, they discussed the city’s strong technology sector and its urban innovation district, Markham Innovation Exchange. They also discussed the measures proposed in Budget 2022 to support innovation, such as the launch of a Canada Growth Fund to attract investment and the creation of the Canadian Innovation and Investment Agency to help industries and businesses innovate, grow, create jobs, and be competitive. They spoke of the importance of the Yonge north subway extension in supporting economic growth and job creation in Markham and the Greater Toronto Area as we recover from the pandemic and into the future.</p>\n\n<p>The two leaders discussed the war in Ukraine and emphasized their mutual support for the people of Ukraine in the face of Russia’s ongoing aggression.</p>\n\n<p>Prime Minister Trudeau and Mayor Scarpitti discussed the importance of making housing more affordable for residents of Markham and all Canadians. They spoke of the measures included in Budget 2022 to build more houses, help people save for their first home, and curb speculation and unfair practices that drive up housing prices. The two leaders agreed to continued collaboration on housing, particularly around the federal government’s Rapid Housing Initiative.</p>\n\n<p>The Prime Minister and Mayor agreed on the importance of continuing to take meaningful action to address these issues and working in partnership to achieve results for the people of Markham and Ontario, and for all Canadians.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.budget.gc.ca/2022/home-accueil-en.html\">Budget 2022</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/a-strong-growing-and-resilient-economy.html\">Budget 2022: A Strong, Growing, and Resilient Economy</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.placetocallhome.ca/progress-on-the-national-housing-strategy\">Progress on the National Housing Strategy</a></li>\n</ul></div>\n      "
}