{
  "path": "/en/news/news-releases/2022/05/12/prime-minister-attends-second-global-covid-19-summit-contribute",
  "pageTitle": "Prime Minister attends second Global COVID-19 Summit to contribute to a global solution | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A united global response to COVID‑19 must ensure that vaccines get to people who need them most. Working together is key to developing a global solution to a global problem.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $732 million for the Access to COVID-19 Tools-Accelerator (ACT-A). The announcement was made as part of the second virtual Global COVID-19 Summit, convened by the United States of America and co-hosted by the Governments of Belize, Germany, Indonesia, and Senegal. This funding includes the allocation of $220 million previously announced on April 8, 2022 at the Gavi COVAX Advance Market Commitment Summit. Including prior announcements, these funds will ensure Canada meets its burden share for the 2021-2022 ACT-A budget cycle.</p>\n\n<p>The emergence and spread of new variants of COVID-19, like Omicron, has reinforced the need for a strategy that works to control COVID-19 worldwide, including for high-risk populations. ACT-A is helping to overcome global inequities by providing low- and middle-income countries access to COVID-19 tests, treatments, vaccines, and personal protective equipment. It remains the world’s best solution to end the acute phase of the COVID-19 pandemic.</p>\n\n<p>During the Summit, Prime Minister Trudeau underlined how vaccine supply is no longer the key constraint to combating COVID-19 around the world. However, many countries continue to encounter difficulties getting vaccines from tarmacs into arms, particularly in remote communities and among vulnerable populations. He also stressed the role of misinformation in undermining confidence in COVID-19 vaccines, recognizing that Canada and its global partners must work together to reinforce the continued importance of testing and treatments, both to identify dangerous variants and to contain future outbreaks.</p>\n\n<p>Canada will continue working with its international partners to bolster global health security, and help ensure the world is better equipped to respond to and recover from pandemics and other health crises in the future.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We must continue to work together and support the international response to end this pandemic everywhere and for everyone. Today, I am announcing new and meaningful funding for the Access to COVID-19 Tools Accelerator (ACT-A), bringing Canada’s total contribution to more than $2 billion since the start of the pandemic. Canada is contributing to the international pandemic response and will continue to work with partners to ensure that that we strengthen our collective ability to prevent, prepare and respond to disease outbreaks going forward.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.unicef.ca/en/press-release/act-accelerator-calls-fair-share-based-financing-us-23-billion-end-pandemic-global?ea.tracking.id=20DIAQ01OTE&amp;19DIAQ02OTE=&amp;gclid=EAIaIQobChMI7KWE4ui59wIVCcLCBB1rCwE1EAAYASAAEgKX2PD_BwE\">ACT-Accelerator</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/global_health-sante_mondiale/response_covid-19_reponse.aspx?lang=eng\">Canada’s aid and development assistance in response to the COVID‑19 pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/09/22/prime-minister-justin-trudeau-attends-global-covid-19-summit-hosted\">Prime Minister Justin Trudeau attends the Global COVID-19 Summit hosted by the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}