{
  "path": "/en/news/readouts/2023/01/25/prime-minister-justin-trudeau-speaks-former-prime-minister-new-zealand",
  "pageTitle": "Prime Minister Justin Trudeau speaks with former Prime Minister of New Zealand Jacinda Ardern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the former Prime Minister of New Zealand, Jacinda Ardern.</p>\n\n<p>Prime Minister Trudeau thanked Ms. Ardern for her thoughtful and inspiring leadership, friendship, and valuable partnership while she was in office.</p>\n\n<p>They reflected on the close relationship between Canada and New Zealand, including strong people-to-people ties, common values, and shared priorities, such as advancing human rights, inclusion, and gender equality; defending the rules-based international order; continuing the fight against climate change; and advancing reconciliation with Indigenous Peoples.</p>\n\n<p>They discussed the progress they have made, including the appointment of an Indigenous Governor General in both countries. They also discussed ongoing challenges, such as combatting hate and violent extremism, Russia’s unjustifiable invasion of Ukraine, anti-regime protests in Iran, and the humanitarian and security crisis in Haiti.</p>\n\n<p>They highlighted the excellent cooperation between Canada and New Zealand across a range of themes and in multilateral forums, to help businesses and workers succeed, grow the middle class, and create more jobs and opportunities for people in both countries.</p>\n\n<p>Both Prime Minister Trudeau and Ms. Ardern underscored their ongoing hope for Canada and New Zealand to continue working together as democratic partners on the global stage under New Zealand’s new Prime Minister, Chris Hipkins.</p>\n\n<p>Prime Minister Trudeau wished Ms. Ardern every success as she turns toward her future endeavours.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/new_zealand-nouvelle_zelande/index.aspx?lang=eng\">Canada-New Zealand relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2023/01/24/statement-prime-minister-welcoming-the-new-prime-minister-of-new-zealand\">Statement by the Prime Minister welcoming the new Prime Minister of New Zealand</a></li>\n</ul></div>\n      "
}