{
  "path": "/en/news/statements/2017/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we remember the largest mass murder and terrorist act in Canada’s history. On this day, 32 years ago, 329 innocent people – citizens of Canada, Britain, the United States and India – were killed by a terrorist’s bomb while travelling on Air India Flight 182. This appalling and cowardly act left families and friends grieving the loss of loved ones, and shook our country to its core. Since that day, we have lost hundreds more Canadians to terrorist acts in our country and around the world. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This past year, a Canadian mother was killed and her son injured in a terrorist attack in Jordan. Two young Canadian women were also killed – one in a New Year’s Day attack in Turkey, and one less than a month ago in London. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Here in Canada, we grieved with the people of Ste-Foy, Quebec, after six men – fathers, brothers, uncles – were killed during a shooting at the Centre culturel islamique de Québec. </span><span lang=\"EN\" xml:lang=\"EN\">The attack sought to instill fear and divide Canadians against themselves. Instead, Canadians came together.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“</span><span lang=\"EN\" xml:lang=\"EN\">Our best </span><span lang=\"EN-US\" xml:lang=\"EN-US\">response is to deepen our resolve to uphold democratic values of pluralism, diversity, and inclusiveness. &nbsp;We are a welcoming and generous country, and know that </span><span lang=\"EN\" xml:lang=\"EN\">diversity and openness to the world are sources of strength. They have made Canada not only more prosperous, but safer and more united.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Canada condemns all forms of terrorism, from any source. We will continue to work closely with our allies, and the international community, to </span>prevent radicalization and fight terrorism both at home and abroad. <span lang=\"EN\" xml:lang=\"EN\">We will always promote and defend human rights, justice, and equality – values that are vital tools in the fight against intolerance, hatred, and fear.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, Sophie and I extend our deepest condolences to all who have experienced the pain and trauma of losing a loved one to terrorism. We also thank those in the military, intelligence, and law enforcement communities in Canada and around the world who work, often at great personal risk, to keep us and our families safe.”&nbsp;</span></p></div>\n      "
}