{
  "path": "/en/news/statements/2022/02/24/g7-leaders-statement",
  "pageTitle": "G7 Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Leaders of the Group of Seven (G7), met virtually today and resolved to make progress towards an equitable world. As open democracies, we are driven by shared values and universal human rights, our commitment to the rules-based multilateral system, sustainable development and the needs of the wider global community. We are united in our commitment to addressing both the biggest systemic challenges and immediate crises of our time.</p>\n\n<p>We condemn in the strongest possible terms the Russian invasion of Ukraine. We declare our unwavering support and solidarity for Ukraine and have issued a separate statement on the situation in and around Ukraine.</p>\n\n<p>More broadly, we commit to protect and strengthen democratic systems and to step up our cooperation on global priorities such as climate, environment, and health. The commitments we make today will shape our path towards a sustainable and inclusive economic recovery, and a prosperous and peaceful future.</p>\n\n<p>Working towards a sustainable planet, we reaffirm and will implement our climate commitments made in Paris and Glasgow across mitigation, adaptation and finance, as well as our wider commitments to the environment and biodiversity. We continue to commit to a 1.5°C pathway, transition to a net-zero economy and climate neutrality by 2050 at latest, including through accelerated decarbonisation this decade. To this end we urge all countries, especially major emitters, whose 2030 targets are not yet aligned with these goals, to revisit and strengthen them by COP27 in line with their commitments. We will explore establishing an open, cooperative international Climate Club, consistent with international rules, and with participation beyond the G7. We are committed to achieving a true paradigm shift, by demonstrating that ambitious climate action is conducive to strong and sustainable growth for all economies. We task our relevant Ministers to make progress on concrete policies to effectively reduce emissions such as carbon pricing, on a transformational agenda for our economies, and on international support and engagement to partners beyond the G7 – in particular towards emerging markets and developing countries, including through tailor made just energy transition partnerships. We recommit to the global mission to halt and reverse biodiversity loss by 2030.</p>\n\n<p>We aim to deliver on economic stability and transformation. Following unprecedented economic support for the global economy, stability- and growth-oriented economic policy and sound public finances shall guide our pathway to recovery that supports investment, quality job creation and prosperity for all. In the face of current geopolitical tensions, pandemic-related uncertainties and macroeconomic challenges, notably including elevated inflation dynamics, we remain unwaveringly committed to driving strong, sustainable, balanced and inclusive recovery and long-term growth in our economies and worldwide, in line with the 2030 Agenda for Sustainable Development and the Paris Agreement, enabling the green and digital transformation in a socially just and gender equitable way. We will support progress towards the global ambition of USD 100 bn of support to countries most in need, including through the voluntary channeling of Special Drawing Rights or equivalent contributions. We will also continue to monitor major global risks, including those arising from heightened geopolitical tensions. We are committed to ensuring energy security. Recalling the critical importance of free, fair and sustainable trade, we remain strongly committed to reforming and strengthening the rules-based multilateral trading system and will work together to bolster the resilience and sustainability of global supply chains and energy markets, while continuing to consult on collective approaches to policies and practices which undermine the fair and transparent operation of the global economy. We reaffirm our commitment to ensure the swift global implementation of the historic 2021 G20/OECD two-pillar international tax package towards a fairer global tax system.</p>\n\n<p>To promote healthy lives worldwide, we will step up our efforts to tackle COVID-19 and prepare for future pandemics and health crises globally. We reaffirm our commitment to support the leading and coordinating role of World Health Organisation (WHO) and to contribute to the WHO’s goal of 70% COVID-19 vaccination coverage worldwide. We will support all pillars of the ACT-Accelerator. Our collective action will include following up on all of our 2021 commitments and making new commitments for 2022, including financial pledges and accompanying measures such as vaccine rollout. We will continue our collective efforts to end the pandemic in 2022, and more broadly support health sovereignity at national and regional levels, including by intensifying our support to local vaccine production, distribution and scientific research worldwide. We will fortify long-term pandemic prevention, preparedness and response, including through the One-Health approach, and further improving the coverage of pathogen surveillance networks, advance universal health coverage and strengthen equitable and resilient and gender-responsive health systems as well as the global health architecture while working towards appropriate financing mechanisms.</p>\n\n<p>We are committed to investing in a better future. We reconfirm our resolve to narrow the infrastructure investment gap in emerging markets and developing countries, through partnerships such as Build Back Better World, Global Gateway, Clean Green Initiative, G20 Compact with Africa and others, in particular in Africa and the Indo-Pacific. We will deliver a step change in our approach to sustainable financing and quality infrastructure, highlighting the importance of international rules and standards adhered to by all actors, thereby contributing to a strong and inclusive recovery from the pandemic and rapid progress towards global climate, health, food security, digital, transport and energy connectivity, education infrastructure, gender equality and achievement of the Sustainable Development Goals. To this end, we task relevant Ministers together with Sherpas, to work with developing country and emerging market partners, as well as International Finance Institutions and development banks, to build and strengthen regional and country-led partnerships.</p>\n\n<p>Above all, we share the conviction that we are stronger together. As a community based on shared values, we are committed to open, inclusive and equitable societies and to democracy, human rights, freedom and gender equality, and we are determined to shape the digital transformation, including by updating our regulatory frameworks. We will collaborate with partners to advance democracy and human rights and stand ready to act as bridge-builder and mediator for lasting peace, security and prosperity, in a rules-based multilateral order.</p>\n\n<p>To this end, we will take concrete actions, task our relevant Ministers and Sherpas, and take stock of the progress made at the G7 Leaders’ Summit to be held from 26 to 28 June 2022 in Elmau.</p></div>\n      "
}