{
  "path": "/en/news/statements/2020/12/15/statement-prime-minister-fifth-anniversary-final-report-truth-and",
  "pageTitle": "Statement by the Prime Minister on the fifth anniversary of the Final Report of the Truth and Reconciliation Commission | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the fifth anniversary of the release of the Final Report of the Truth and Reconciliation Commission of Canada:</p>\n\n<p>“Five years ago today, the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1450124405592/1529106060525\">Truth and Reconciliation Commission of Canada</a> released its final report. Established on June 1, 2008, the Commission worked to uncover the truth in one of the darkest and most painful chapters in Canadian history – the Indian Residential Schools system – and the tragic legacy that continues today.</p>\n\n<p>“The report is an appeal to mobilize all orders of government, as well as organizations and individuals, to make concrete changes in Canadian society. It lists 94 Calls to Action to redress the legacy of residential schools and advance the process of reconciliation in Canada.</p>\n\n<p>“The Government of Canada has accepted its responsibilities and its failings, which is why it offered an apology to former students, and has taken important steps to fully implement the Commission’s recommendations. We have worked across all federal government organizations and with our partners so that 80 per cent of the Calls to Action implicating the Government of Canada are now completed or well underway. This includes introducing legislation to allow for the full adoption and implementation of the United Nations Declaration on the Rights of Indigenous Peoples to move forward on the shared path of reconciliation, as well as passing the <em>Indigenous Languages Act</em> to support the revitalization, maintaining, and strengthening of Indigenous languages in Canada.</p>\n\n<p>“We recently announced <a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/27/more-support-advance-reform-services-indigenous-children-and-families\">over $542 million in funding</a> over five years to advance First Nations, Inuit, and Métis engagement to co-develop the implementation of the <em>Act respecting First Nations, Inuit and Métis children, youth and families</em>, and to assist Indigenous communities and groups in building the capacity to establish their own child and family services systems. This funding is in addition to the $3 billion that we have already invested, starting in 2019, to continue delivering and improving the government’s funding support for First Nations child and family services.</p>\n\n<p>“We are implementing <a href=\"https://www.sac-isc.gc.ca/eng/1568396042341/1568396159824\">Jordan’s Principle</a> to make sure all First Nations children in Canada can access the products, services, and supports they need, when they need them. In 2019, we implemented a <a href=\"https://www.sac-isc.gc.ca/eng/1553859736924/1553859762978\">new policy and funding approach</a> for funding First Nations education on reserve – co-developed with First Nations representatives – to transform First Nations education funding to be more directly comparable to provincial education systems. The new approach also provides full-day kindergarten on reserve for children ages four and five, and $1,500 per student, per year, to support language and culture. We are also working with provincial, territorial, and Indigenous partners, to respond to the <a href=\"https://www.mmiwg-ffada.ca/final-report/\">Final Report</a> of the National Inquiry into Missing and Murdered Indigenous Women and Girls and the Calls for Justice, to develop a national action plan to end the systemic causes of violence against Indigenous women, girls, and LGBTQ and two-spirit people.</p>\n\n<p>“We recognize that there is still much more work to do. We will continue to work in partnership with Indigenous peoples, provinces, and territories to implement the Truth and Reconciliation Commission’s Calls to Action. As we outlined in the <a href=\"https://www.canada.ca/en/privy-council/campaigns/speech-throne/2020/speech-from-the-throne.html\">Speech from the Throne</a>, the government is committed to not just moving forward, but moving faster, on ending the unacceptable injustices that too many Canadians still face. That includes addressing systemic inequalities in the criminal justice system, closing the infrastructure gap in Indigenous communities, and legislating First Nations policing as an essential service.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to honour the courage of the former students and families who came forward to share their stories of pain and losses, and to reflect on how we must all play our role in the implementation of the Calls to Action and in our journey of reconciliation.”</p></div>\n      "
}