{
  "path": "/en/news/readouts/2022/04/22/prime-minister-justin-trudeau-meets-mayor-winnipeg-brian-bowman",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Winnipeg Brian Bowman | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of Winnipeg, Brian Bowman, to discuss shared priorities.</p>\n\n<p>The Prime Minister and Mayor spoke about the significance of today’s ceremony and the historic transfer of the Hudson’s Bay Company’s building in downtown Winnipeg to the Southern Chiefs’ Organization. They underlined the importance of making housing more affordable for all Canadians and highlighted that this project will help create almost 300 new, affordable homes.&nbsp;</p>\n\n<p>Prime Minister Trudeau reiterated his support for advancing infrastructure priorities in Winnipeg, notably for public transit and waste management. The Prime Minister and Mayor discussed Winnipeg’s close ties to Ukraine and joint efforts in assisting Ukrainians arriving in Canada. Together, they agreed on the importance of continuing to take meaningful action to address these issues and leveraging positive working relationships to achieve results for the people of Winnipeg, of Manitoba, and for all Canadians.</p>\n\n<p>The Prime Minister conveyed his best wishes to Mayor Bowman and thanked him for his partnership following his decision not to seek reelection at the end of his term this coming fall.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/22/creating-affordable-homes-indigenous-peoples-winnipeg\">Creating affordable homes for Indigenous Peoples in Winnipeg</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/03/canada-expands-settlement-support-for-ukrainians-coming-to-canada.html\">Canada expands settlement support for Ukrainians coming to Canada</a></li>\n</ul></div>\n      "
}