{
  "path": "/en/news/readouts/2022/08/22/prime-minister-justin-trudeau-meets-chancellor-germany-olaf-scholz",
  "pageTitle": "Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Chancellor of Germany, Olaf Scholz, in Montréal, where he welcomed him yesterday during an informal dinner, as part of his first official visit to Canada. The two leaders were joined by Deputy Prime Minister and Minister of Finance, Chrystia Freeland, Minister of Foreign Affairs, Mélanie Joly, Minister of Innovation, Science and Industry, François-Philippe Champagne, and Minister of Natural Resources, Jonathan Wilkinson.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and discussed their commitment to further supporting Ukraine and the Ukrainian people.&nbsp;The two leaders commended the resolve and unity of Allies in supporting Ukraine, and committed to continue working through NATO and the G7 to maintain pressure on Russia to end the conflict and withdraw from Ukraine.</p>\n\n<p>Prime Minister Trudeau, Chancellor Scholz, and their delegations discussed expanding Canada and Germany’s deep and long-standing partnership in areas of common interest, including trade and investment, clean energy and clean technology, and global climate leadership. The leaders and ministers expressed their resolve to address the impacts of climate change, including the importance of expanding the international coverage of carbon pricing in the lead-up to COP27. On energy cooperation, Prime Minister Trudeau reiterated Canada’s commitment as a key partner in addressing Europe’s energy needs now and in the years to come, including through strengthened cooperation on hydrogen and critical minerals. The Prime Minister and the Chancellor underlined the great potential for strengthened supply chains between Canada and Germany, and agreed on the need to further expand commercial and investment ties to help create good jobs and economic prosperity, including through strengthened business-to-business relations and the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p>\n\n<p>The Prime Minister and the Chancellor expressed their concern with respect to the heightened tensions in the Indo-Pacific region, and agreed on the importance of pursuing joint collaboration and engaging constructively in the region. The two leaders and their delegations also discussed priorities for the upcoming G20 Summit and committed to working with G7 Allies to address the concerns and needs of partners in the Global South.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/13/chancellor-germany-olaf-scholz-visit-canada\">Chancellor of Germany Olaf Scholz to visit Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/07/05/prime-minister-justin-trudeau-speaks-chancellor-germany-olaf-scholz\">Prime Minister Justin Trudeau speaks with Chancellor of Germany Olaf Scholz</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}