{
  "path": "/en/news/readouts/2020/11/09/prime-minister-justin-trudeau-speaks-president-elect-united-states-america",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President-elect of the United States of America, Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President-elect of the United States of America, Joe Biden, to congratulate him, as well as Vice-President-elect, Kamala Harris, on their election win. The Prime Minister was the first international leader to speak with the President-elect.</p>\n\n<p>The Prime Minister and the President-elect agreed on the importance of the unique Canada-U.S. partnership, and committed to work together to fight the global COVID-19 pandemic and to support a sustainable economic recovery in both countries and the hemisphere. The two leaders looked forward to cooperating on the fight against climate change, on migration, and on global security, and to working closely together within NATO and the G7. They also agreed on the importance of addressing anti-Black racism.</p>\n\n<p>The Prime Minister looked forward to further strengthening the Canada-U.S. relationship and to engaging on key issues, including trade, softwood lumber, Buy America, and energy cooperation such as Keystone XL.</p>\n\n<p>The Prime Minister also raised the cases of Canadians Michael Kovrig and Michael Spavor, who have been arbitrarily detained in China.</p>\n\n<p>The Prime Minister and President-elect agreed to stay in close contact.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/11/07/statement-prime-minister-canada-result-us-presidential-election\">Statement by the Prime Minister of Canada on the result of the U.S. presidential election</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://www.cer-rec.gc.ca/en/applications-hearings/view-applications-projects/keystone-xl/project-information.html\">Keystone XL Pipeline – Project Information</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canadaextremelyconcerned-by-formal-charges-being-laid-against-michael-kovrig-and-michael-spavor.html\">Canada extremely concerned by formal charges being laid against Michael Kovrig and Michael Spavor</a></li>\n</ul></div>\n      "
}