{
  "path": "/en/news/news-releases/2017/11/28/prime-minister-delivers-apology-lgbtq2-canadians",
  "pageTitle": "Prime Minister delivers apology to LGBTQ2 Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>All Canadians deserve to feel safe and to have their most fundamental rights protected. But for decades, we failed countless individuals who had their lives and livelihoods shattered for simply being who they were or because of who they loved. That is why the Government of Canada is working to address systemic discrimination against people who identify as lesbian, gay, bisexual, transgender, queer, and two-spirit (LGBTQ2).</p><p>The Prime Minister, Justin Trudeau, today delivered a formal apology in the House of Commons to individuals harmed by federal legislation, policies and practices that led to the oppression of and discrimination against LGBTQ2 people in Canada.</p><p>The Prime Minister apologized specifically for the historical unjust treatment of LGBTQ2 federal public servants, including those in the Canadian Armed Forces and the RCMP, and of LGBTQ2 Indigenous Peoples.</p><p>To address the wrongs experienced by those who were unfairly criminalized by unjust laws and actions, the Government of Canada today introduced legislation – Bill C-66, the <i>Expungement of Historically Unjust Convictions Act</i> – that would put into place a process to permanently destroy the records of convictions for offences involving consensual sexual activity between same-sex partners that would be lawful today. &nbsp;</p><p>The Government of Canada has also signed an Agreement-in-Principle to resolve the Todd Edward Ross, Martine Roy and Alida Satalic Class Action in a fair, compassionate, and respectful manner that promotes healing and reconciliation. The Agreement-in-Principle includes measures to support individual compensation and recognition, as well as additional initiatives to promote collective reconciliation and remembrance.</p><p>These are important steps to respond to the historical and ongoing inequality faced by Canada’s LGBTQ2 communities and a vital part of the Government of Canada’s effort to create a stronger, more diverse, and more inclusive society.</p><h2>Quote</h2><blockquote><p>“It is our collective shame that Canadians who identify as lesbian, gay, bisexual, transgender, queer, or two-spirit were unjustly treated – fired from jobs, denied promotions, surveilled, arrested, convicted, and vindictively shamed because of their sexual orientation or gender identity. People lost their livelihoods, their families, and, some, their lives. Today, we offer a long overdue apology to all those whom we, the Government of Canada, wronged. We are sorry. We hope by acknowledging our failings we can make the crucial progress LGBTQ2 people in Canada deserve. We will continue to support each other in our fight for equality because we know that Canada gets stronger every single day that we choose to embrace diversity.”<br>–&nbsp;<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Historically, Canada unjustly convicted and imposed criminal records on people who engaged in consensual sexual activity with same-sex partners – sexual activity that would be lawful today. Many of these offences were prosecuted to target LGBTQ2 communities.</li><li>From the 1950s to the early 1990s, the Canadian government undertook a systematic campaign of oppression against employees who were members, or suspected members, of LGBTQ2 communities. The campaign became known as “The Purge” and involved workers being fired, discharged, or intimidated into resigning.</li><li>The actions announced today are part of the Government of Canada’s commitment to advance LGBTQ2 inclusion. We have also:<ul><li>Named Randy Boissonnault, Member of Parliament for Edmonton Centre, as the Prime Minister’s Special Advisor on LGBTQ2 issues, and established an LGBTQ2 Secretariat within the Privy Council Office to support government initiatives on LGBTQ2 issues.</li><li>Passed legislation – <i>An Act to amend the Canadian Human Rights Act and the Criminal Code</i> – to protect Canadians from discrimination and hate crimes based on gender identity and gender expression and to affirm their equal status in Canadian society.</li><li>Introduced legislation – Bill C-39,<i> An Act to amend the Criminal Code (unconstitutional provisions) and to make consequential amendments to other Acts </i>– to eliminate section 159 of the&nbsp;<i>Criminal Code</i>, which makes anal intercourse illegal except when it is conducted in private between two people who are both 18 years of age or older, or between a married husband and wife.</li><li>Made a commitment in the Minister of Health’s mandate letter of October 4, 2017, to work with provinces and territories to develop a long-term vision for blood services that ensures safety and non-discrimination in donation policies.</li><li>Worked to adopt policies and practices to remove the unnecessary collection of gender markers in government forms as well as to introduce an ‘X’ gender designation on passport applications to ensure Canadians who do not identify as either male or female receive the same services and support as everyone else.</li></ul></li><li>Canada is actively promoting human rights related to sexual orientation, gender identity and gender expression on the international stage. Canada is the co-chair of the Equal Rights Coalition and has provided over $2.9 million in funding since 2014 for projects abroad that support violence-prevention programs, awareness campaigns, and advocacy efforts, including initiatives aimed to combat homophobia, transphobia, and biphobia in education systems.</li></ul><h2>Related Products</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/28/expungement-historically-unjust-convictions\">Expungement of historically unjust convictions</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/28/government-canada-initiatives-support-lgbtq2-communities-and-promote\">Government of Canada initiatives to support LGBTQ2 communities and promote diversity and inclusion</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/28/lgbtq2-agreement-principle\">LGBTQ2 Agreement-in-Principle</a></li><li><a href=\"/en/news/speeches/2017/11/28/remarks-prime-minister-justin-trudeau-apologize-lgbtq2-canadians\">Remarks by Prime Minister Justin Trudeau to apologize to LGBTQ2 Canadians</a></li></ul></div>\n      "
}