{
  "path": "/en/news/news-releases/2018/09/23/prime-minister-announces-increased-collaboration-spain",
  "pageTitle": "Prime Minister announces increased collaboration with Spain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the Prime Minister of Spain, Pedro&nbsp;Sánchez, to set the foundation for an even closer Canada-Spain relationship.</p><p>The two leaders approved the Canada-Spain Cooperation Agenda, an agreement to collaborate more closely to create economic growth that benefits everyone, combat climate change, advance gender equality, and build a safer, more peaceful world.</p><p>As part of the Agenda, the Prime Ministers underlined their commitment to free trade, and highlighted how the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) is creating good, middle class jobs and new opportunities for businesses in both countries.</p><p>Prime Minister Trudeau and Prime Minister Sánchez underscored our countries’ shared commitment to NATO and to peacekeeping, and how Canadians are serving alongside their Spanish allies in peace and security operations around the world, including as part of NATO’s enhanced Forward Presence (eFP) battlegroup in Latvia and the International Coalition against Daesh. Canada and Spain will continue to lead peacebuilding and conflict prevention efforts, support a long-term and humane approach to migration, and empower and protect women and children, especially those in conflict-affected areas.</p><p>The two leaders also approved the Declaration in Favour of Gender Equality, which outlines actions to tackle persistent gender inequalities and meet the goals outlined in the 2030 Agenda for Sustainable Development. Both countries will redouble their efforts to end gender-based violence, take action to reduce gender wage gaps, and encourage the participation of women and girls in science, technology, engineering, and mathematics. Gender equality will also guide both countries’ foreign policy work and engagement in international institutions such as the United Nations.</p><p>Prime Minister Trudeau and Prime Minister Sánchez continued their discussion at the Global Progress Summit, where they talked about shared values, such as diversity and support for democracy, and our common goal of building economies that work for everyone.</p><h2>Quote</h2><blockquote><p>“It was a pleasure welcoming Prime Minister Sánchez to Montreal, where we laid the groundwork for even closer collaboration between our two countries. Canada and Spain will continue to work together to combat climate change, advance gender equality, and build a more peaceful, secure world, while creating new jobs and opportunities for people on both sides of the Atlantic.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau and Prime Minister Sánchez met for the first time during the NATO Summit in Brussels, Belgium, in early July 2018 after Prime Minister Sanchez was officially sworn into office on June 1, 2018.</li><li>Canada and Spain enjoy a strong and growing bilateral economic relationship and both benefit from the Canada-European Union Comprehensive Economic and Trade Agreement provisionally applied since September 2017. In 2017, Canada’s merchandise exports to Spain totalled nearly $1.7 billion and merchandise imports from Spain reached $2.8 billion, making Spain Canada’s seventh-largest merchandise trading partner in the EU.</li><li>In 2017, Canadian direct investments in Spain were valued at $6.4 billion, and the stock of Spain’s direct investment to Canada was valued at more than $5.8&nbsp;billion.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/backgrounders/2018/09/23/joint-declaration-canada-spain-cooperation-agenda\">Canada-Spain Cooperation Agenda</a></li><li><a href=\"/en/news/backgrounders/2018/09/23/declaration-favour-gender-equality-between-government-spain-and\">Declaration in Favour of Gender Equality between the Government of Spain and the Government of Canada</a></li><li><a href=\"http://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada – Spain Relations</a></li><li><a href=\"http://international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li><li><a href=\"https://sustainabledevelopment.un.org/content/documents/21252030%20Agenda%20for%20Sustainable%20Development%20web.pdf\">The 2030 Agenda for Sustainable Development</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_sexes/national_action_plan_wps-plan_national_action_fps.aspx?lang=eng\">Canada’s National Action Plan on Women, Peace and Security</a></li></ul></div>\n      "
}