{
  "path": "/en/news/news-releases/2020/06/18/prime-minister-announces-new-mobile-app-help-notify-canadians-covid",
  "pageTitle": "Prime Minister announces new mobile app to help notify Canadians of COVID-19 exposure | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Canada begins to ease restrictions and take steps to restart the economy, the Government of Canada is working closely with provinces and territories to keep Canadian families and communities safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the upcoming launch of a new nation-wide mobile app to provide notifications of exposure to COVID-19 across Canada, with beta testing to begin in Ontario.</p>\n\n<p>The app, originally developed by the Government of Ontario, will help Canadians and public health officials identify and isolate the spread of the virus more quickly, which is an important step toward containing the virus and safely restarting the economy.</p>\n\n<p>Use of the app will be voluntary. If someone tests positive for COVID-19, a health care provider will give them a unique temporary code, so they can upload their status anonymously to a national network. Other users&nbsp;who have&nbsp;downloaded the app and come in contact with that person will be notified, through the app, that they may have been exposed to the virus. The app will also provide users with information on steps they can take to keep themselves and others safe, and we are working with the provinces and territories so they can customize public health information based on their own jurisdiction.</p>\n\n<p>The Canadian Digital Service is leading the development of the app, in collaboration with the Ontario Digital Service and building upon technology developed by Shopify volunteers. The app will undergo a security review by BlackBerry. It incorporates Bluetooth technology provided by Apple and Google to anonymously record instances where users have come into close contact. To protect confidentiality and privacy, the app will not disclose the identity of users. This information will never be shared with any other entity, will not be stored by the app, and will never leave the user’s phone. No personal information is collected by the app, and it does not track the user’s location to ensure the privacy of all Canadians.</p>\n\n<p>The app will be available to Canadians for free download in the coming weeks, with health authorities in Ontario being the first to distribute the unique, temporary codes to people who test positive for COVID-19. We are working with the other provinces and territories to make it available in their jurisdictions as well. We anticipate other provinces and territories will come on board in the coming weeks and months.</p>\n\n<p>The Government of Canada and provincial and territorial governments will continue to work together to restart our economy through a gradual and phased approach, while protecting the health of all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As we move forward with restarting the economy, we must keep working together to prevent the further spread of COVID-19. This new mobile app will put the privacy of Canadians first, and act as an extra measure of safety to help protect our families and communities from the virus.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This app is another way for Canadians to keep each other safe by protecting themselves and their loved ones. It will complement other public health measures to limit outbreaks of COVID-19, including testing and contact tracing.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“The exposure notification app is a secure and easy to use digital tool that will help protect the health and safety of Canadians. Today’s announcement shows the unprecedented collaboration happening across Canada during this crisis. It is an example of what we can deliver for Canadians when we work in the open, together, across jurisdictions and sectors. I ask all Canadians to help prevent the spread of COVID-19 by downloading this app.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Digital Government</footer>\n</blockquote>\n\n<blockquote>\n<p>“Federal, provincial, and territorial governments agree on the value of innovative solutions to assist in reopening the economy, supporting individuals’ risk management, and further flattening the curve. The advisory council will help bring together some of Canada's best and brightest minds to ensure that the application upholds the highest standards of trust for the benefit of Canadians.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The app will be available for Ontarians to download for free on the Apple App Store and Google Play Store in the coming weeks. The technology will be owned and operated by the Government of Canada, and published under an open source licence.</li>\n\t<li>The protection of Canadians’ privacy is a priority for the Government of Canada. The app will undergo a thorough privacy assessment, and all data provided to the app will be securely stored and protected. The federal government will not store personal health information.</li>\n\t<li>The government is engaging with the Office of the Privacy Commissioner to ensure that the app complies with federal privacy requirements in its design and deployment.</li>\n\t<li>The Government of Canada will establish an external advisory council that includes regional representation, to provide guidance during the roll-out of the app with a view to ensuring it operates in a transparent way and in the public interest.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/28/prime-minister-releases-joint-statement-first-ministers-restarting\">Prime Minister releases joint statement by First Ministers for restarting the economy</a></li>\n</ul></div>\n      "
}