{
  "path": "/en/news/readouts/2020/06/15/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy discussed the COVID-19 situation in Canada and Ukraine, and the significant measures being taken to protect the health and well-being of their citizens. President Zelenskyy thanked Prime Minister Trudeau for the humanitarian support Canada has provided to assist Ukraine in fighting the disease.</p>\n\n<p>The two leaders spoke about the deep and strong bonds shared by Canada and Ukraine. Prime Minister Trudeau reaffirmed Canada’s ongoing commitment to Ukraine’s prosperity, security, and territorial integrity. They agreed on the importance of Operation UNIFIER and the good news that Canadian Armed Forces personnel are returning to Ukraine this month to resume training in support of the Security Forces of Ukraine.<em> &nbsp;</em></p>\n\n<p>The Prime Minister and the President looked forward to continuing Canada and Ukraine’s strong partnership – at the United Nations, at NATO, and in other international organizations – in order to advance shared priorities.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}