{
  "path": "/en/news/news-releases/2017/09/14/prime-minister-announces-new-lieutenant-governor-prince-edward-island",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for Prince Edward Island | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Antoinette Perry as the next Lieutenant Governor of Prince Edward Island.</p><p>Ms. Perry enjoyed a distinguished 32-year career at Tignish Consolidated Elementary School where she taught Music and French after studying Music Education at the Université de Moncton. She has been an active member of various community and cultural organizations, including the West Prince Arts Council and the Tignish Historical Preservation Society.</p><p>The Prime Minister thanks the outgoing Lieutenant Governor, the Honourable H. Frank Lewis, for his work to engage communities, non-profit organizations, and businesses across the province since taking office in 2011.</p><h2>Quote</h2><blockquote><p>“Antoinette Perry is a proud Acadian and a long-time active member of the Tignish community. I know she will work hard to promote the best of Prince Edward Island, a province with an active and growing business community that is known across the country for its beauty and hospitality.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, and visiting communities.</li><li>Lieutenant Governors are appointed by His Excellency the Right Honourable David Johnston, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/09/14/biographical-notes-–-antoinette-perry\">Biographical Notes – Antoinette Perry</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1444999464310\">The Lieutenant Governors</a></li></ul></div>\n      "
}