{
  "path": "/en/news/news-releases/2018/11/05/prime-minister-travel-france",
  "pageTitle": "Prime Minister to travel to France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to France from November 10 to 12, 2018, to attend commemoration events for the 100th anniversary of the First World War Armistice and the first-ever Paris Peace Forum.</p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">On November 10, the Prime Minister, along with the Minister of Veterans Affairs, Seamus&nbsp;O’Regan, will meet with Canadian veterans and thank them for their service and sacrifice. They will also visit the Canadian National Vimy Ridge Memorial, a tribute to the Canadians who fought and gave their lives in the First World War</span>.</p><p>On Remembrance Day, Prime Minister Trudeau will participate in commemoration ceremonies in Paris on the 100th anniversary of the Armistice, which marked the end of the First World War.</p><p>After the ceremony, the Prime Minister will attend the Paris Peace Forum, a new annual event that brings together political, economic, and civil society leaders from across the globe to address some of the world’s most pressing challenges. The leaders will highlight the importance of strengthening multilateralism, global governance, and the rules-based international order.</p><p>The following day, Prime Minister Trudeau will be a key speaker at the GovTech Summit, which will bring together government leaders and innovators to explore how we can use new technologies to improve public services and build stronger, more resilient, and more inclusive democracies.</p><p>During the visit, Prime Minister Trudeau will meet with the President of France, Emmanuel Macron, to further strengthen the deep friendship between our two countries, and explore ways to promote even closer collaboration.</p><h2>Quotes</h2><blockquote><p>“We owe an immense debt of gratitude to our veterans and all the remarkable Canadians serving in our armed forces today. This month, as we mark the 100th anniversary of the Armistice, we honour the Canadians who fought and gave their lives in the First World War, and all those in uniform who have served and continue to serve our country with dedication.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our world today is more interconnected than ever, and the challenges we face know no borders. We must work together to address these challenges, from fighting climate change, to advancing peace and security, to promoting economic growth that benefits everyone. The first Paris Peace Forum will be an important chance to explore real, meaningful solutions to these issues and work to build a better future for everyone.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and France have a longstanding, close relationship based on history, a common language, and shared values, as well as broad social, economic, and political cooperation. France is Canada's fourth most important trading partner within the European Union. In 2017, the value of trade between the two countries was $9.6&nbsp;billion.</li><li>The Paris Peace Forum, created on President Macron’s initiative, is an independent non-governmental organization established in 2018. More than 80 countries are expected to participate in the first Forum, which will be held at La Grande Halle de La Villette in Paris.</li><li>The one-day GovTech Summit will feature more than 90&nbsp;international speakers, covering topics including transport, healthcare, security, international development, e-government, and citizen engagement.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/last-hundred-days/100-anniversary\">Canada’s Hundred Days and the Armistice 100th anniversary</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France relations</a></li><li><a href=\"http://tradecommissioner.gc.ca/france/index.aspx?lang=eng\">The Canadian Trade Commissioner Service - France</a></li><li><a href=\"https://parispeaceforum.org/\">Paris Peace Forum</a></li></ul></div>\n      "
}