{
  "path": "/en/news/news-releases/2015/11/19/canada-pledges-support-developing-apec-economies",
  "pageTitle": "Canada pledges support to developing APEC economies | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, today announced an initiative that will help reduce poverty in developing Asia-Pacific Economic Cooperation (APEC) economies by encouraging micro, small, and medium enterprises (MSMEs) to expand into global and regional markets. The announcement was made on the margins of the APEC Leaders Meeting in Manila, Philippines.</p>\n<p>The APEC-Canada Growing Business Partnership project will help address the challenges that MSMEs face integrating regionally and globally. This will be accomplished with a dedicated sub-fund that will support small-scale projects and help MSMEs in developing APEC economies to innovate, grow, and gain better access to global and regional markets. The project will also support MSME workshops, training sessions, conferences, and research.</p>\n<p>The project will allow Canada to share its policies, research, and best practices on MSMEs with MSMEs in the APEC region.&nbsp;</p>\n<p>The APEC Secretariat and the Asia-Pacific Foundation of Canada will partner in the delivery of the project.</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada has fantastic small businesses that create jobs and growth in communities across our country. I am pleased that through the project announced today, some of their expertise can be shared with the broader APEC community to help entrepreneurs in the region become more competitive and prosperous.” <em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canada welcomes the actions taken by APEC, under the Philippines’ leadership, to help MSMEs benefit from global opportunities to create jobs andgrowth, and to reduce poverty.” <em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The project will provide complementary Canadian training, research, and mentoring support to MSMEs in developing APEC economies.</li>\n<li>MSMEs account for the overwhelming majority of all enterprises in developing APEC economies and are a significant source of employment.</li>\n<li>APEC is working to encourage the participation of MSMEs in global value chains, and to address the issues blocking direct participation of micro and small enterprises in regional and global trade.</li>\n<li>In May 2015, APEC economies pledged to promote inclusive growth to narrow the gap between developing and developed economies, as part of the Boracay Action Agenda to Globalize Micro, Small and Medium Enterprises. The Boracay Action Agenda aims to support MSMEs to more significantly participate in global trade, building on APEC’s work on regional economic integration. The Agenda addresses barriers to trade and investment that disproportionately impact MSMEs.&nbsp;</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"https://www.abaconline.org/v4/index.php\">APEC Business Advisory Council</a></li>\n<li><a href=\"http://www.international.gc.ca/apec/index.aspx?lang=eng\">APEC Working for Canadians</a></li>\n<li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li>\n<li><a href=\"https://www.asiapacific.ca/\">Asia Pacific Foundation of Canada</a></li>\n<li><a href=\"http://www.international.gc.ca/apec/action_agenda_boracay_programme_action.aspx?lang=eng\">Boracay Action Agenda</a></li>\n<li><a href=\"/en/news/backgrounders/2015/11/19/apec-canada-growing-business-partnership-project\">APEC-Canada Growing Business Partnership project</a></li>\n</ul></div>\n      "
}