{
  "path": "/en/news/news-releases/2022/11/28/prime-minister-visits-james-smith-cree-nation-and-announces-mental",
  "pageTitle": "Prime Minister visits James Smith Cree Nation and announces mental health supports for those impacted by the tragic attacks in September | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>The events described below are far-reaching and deeply impactful. If you need someone to talk to, the Hope for Wellness Helpline offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free help line at 1-855-242-3310 or connect to the online chat at&nbsp;</em><a href=\"http://www.hopeforwellness.ca/\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>In September, the horrific attacks that took the lives of 11 people and injured 18 others in James Smith Cree Nation and the nearby community of Weldon, Saskatchewan, shocked Canadians from coast to coast to coast. We came together to mourn those whose lives were taken and support their loved ones. The Government of Canada is continuing to support community members who are coping with the loss and trauma from this tragic and senseless violence.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited James Smith Cree Nation to meet with community leaders, families of victims, and survivors and announce $62.5 million over six years, starting this year, and $4.5 million ongoing to support the healing, mental health, and well-being of community members impacted by the tragic events of September, and to support Indigenous-led approaches to community safety. Everyone should have access to the type of support they need, and today we’re taking action to improve access to culturally grounded mental health and addictions care for the people of James Smith Cree Nation.</p>\n\n<p>From this new funding, $42.5 million will help support mental wellness and healing, including through the building of a new wellness centre in the community and repurposing the existing Sakwatamo Lodge. It will also enable James Smith Cree Nation to develop and design programs that best serve the needs of their members including increasing access to mental health, trauma, and substance use services. This will ensure that both immediate and long-term supports are available for James Smith Cree Nation community members to continue their healing journey.</p>\n\n<p>The Prime Minister also announced an additional $20 million over four years to top-up the <a href=\"https://www.sac-isc.gc.ca/eng/1646747630193/1646747651080\">Pathways to Safe Indigenous Communities Initiative</a>, which builds on our work to implement the Federal Pathway, and end violence against Indigenous women, girls, and 2SLGBTQI+ people. This initiative is supporting James Smith Cree Nation and other communities in developing and delivering community-based safety and wellness projects.</p>\n\n<p>Access to quality mental health care that is culturally relevant and trauma-informed is critical to the well-being of communities and to support recovery from the pain, trauma, and loss inflicted by tragedies such as the horrific violence this past September. The Government of Canada will continue to work in partnership with Indigenous Peoples across the country to advance Indigenous-led approaches to mental wellness. Our priority is for everyone in Canada to have access to the mental health care they need, when they need it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today, I heard first-hand the pain, sorrow, anger, and grief that people here in the community of James Smith Cree Nation are feeling. Canadians are mourning with you. More access to mental health and addictions care will help create a safer and healthier community, and to the people of James Smith Cree Nation: the government will be your partner every step of the way on your healing journey.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“From tragedy to healing is a long journey, but the people and leadership of James Smith Cree Nation have stayed strong. Healing takes time and ongoing support. It’s why we will continue to support and fund Indigenous-led and designed health approaches. There is so much more to do to transform systems of care to ensure Indigenous Peoples can access health and wellness supports that are safe, culturally centred and equitable. The federal government remains committed to being a strong partner in this work.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are thankful for his visit – his kind words were profoundly touching as our community members continue to mourn the loss of their loved ones. We recognize that Prime Minister Trudeau and his government were responsive to our immediate needs for emergency health supports immediately after the incident, which helped us during a time of great turmoil. His visit gives us confidence that we can continue to work together to meet our long-term goals that include our need for treatment centres and self-administered policing.”</p>\n\n<footer class=\"default\">Chief Wally Burns, James Smith Cree Nation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On September 4, 2022, 11 people were murdered and 18 injured in James Smith Cree Nation and the nearby community of Weldon, Saskatchewan. The suspect in these homicides was apprehended by police, went into medical distress, and later died in hospital. The investigation by the Royal Canadian Mounted Police into these tragic events is ongoing.</li>\n\t<li>In the wake of this tragedy, the Government of Canada provided a suite of immediate supports to the local community, including:\n\t<ul>\n\t\t<li>temporary accommodations to address immediate needs for individual counselling, family therapy, and mental wellness supports at the community level;</li>\n\t\t<li>mental health counselling and addiction support through 15 mental health therapists; and</li>\n\t\t<li>over $300,000 to address the specific mental health needs of children at the James Smith Cree Nation School.</li>\n\t</ul>\n\t</li>\n\t<li>In October, the Government of Canada, the Government of Saskatchewan, and the Prince Albert Grand Council announced a partnership with the aim of improving public safety and policing in its 12 member First Nations and 28 communities. This team will advance work on Indigenous-led public safety initiatives, tailored to the needs of each community.</li>\n\t<li>In Budget&nbsp;2022, the government committed an additional $227.6&nbsp;million over two years to maintain Indigenous-led services to improve mental wellness. This builds on funding of $597.6&nbsp;million provided in Budget&nbsp;2021 for distinctions-based Indigenous mental health and wellness strategies.</li>\n\t<li>Funding for the Mental Wellness Program has increased from around $325 million annually in 2015-16 to $580 million in 2021-22. An additional $107 million in that year expanded trauma-informed supports to all forms of trauma, bringing total funding for the program to $687 million in 2021-22.</li>\n\t<li>The Government of Canada is committed to supporting everyone’s mental health in Canada. If you or a loved one is struggling, the <a href=\"https://www.hopeforwellness.ca/\">Hope for Wellness Helpline</a> is available to all Indigenous Peoples across the country. Experienced and culturally competent counsellors are reachable by telephone at 1-855-242-3310 and online chat 24 hours a day, seven days a week. Both telephone and online chat services are available in English and French. Telephone support is also available upon request in Cree, Ojibway, and Inuktitut.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/04/statement-prime-minister-attacks-saskatchewan\">Statement by the Prime Minister on the attacks in Saskatchewan</a></li>\n\t<li><a href=\"https://budget.gc.ca/2022/report-rapport/chap7-en.html\">Budget&nbsp;2022: Moving Forward on Reconciliation</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.hopeforwellness.ca/\">Hope for Wellness Helpline</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1576089278958/1576089333975\">Mental health and wellness in First Nations and Inuit communities</a></li>\n</ul></div>\n      "
}