{
  "path": "/en/news/news-releases/2016/04/22/prime-minister-concludes-his-visit-new-york-paris-agreement-signing",
  "pageTitle": "Prime Minister concludes his visit to New York for the Paris Agreement signing Ceremony | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to New York where, on behalf of Canada, he officially signed the Paris Agreement on Climate Change.</p>\n<p>The Government of Canada views climate change not only as a challenge, but as an opportunity. It is a chance to build a clean growth economy that will help to fight climate change, while also creating well-paying jobs for middle class Canadians.</p>\n<p>In his address during the signing ceremony, the Prime Minister affirmed Canada’s support for the Capacity Building Initiative for Transparency, announcing a $5 million contribution to help developing countries address climate change by meeting their transparency commitments.</p>\n<p>The Prime Minister also joined with his fellow heads of state and government to endorse a carbon pricing vision statement. It is only when nations work together – to learn from each other, build on shared knowledge, and develop clean economies – that there is any hope to sufficiently fight climate change.</p>\n<p>The Government of Canada knows that a sustainable, low-carbon economy is necessary for the collective prosperity, competitiveness, health, and security of all Canadians. Today, we have taken important steps – in collaboration with our international partners – to leave a cleaner, more prosperous world for our children and grandchildren.</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada has previously committed $2.65 billion over the next five years to help the developing world grow in a cleaner, more sustainable way. When nations work together, we can address climate change. It’s only when we work together that we can learn from each other, build on shared knowledge, and develop economies that are as clean as they are competitive.</p>\n<p><em>–</em><em> Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“The Canadian government is working with provincial, territorial and Indigenous partners to develop a more coordinated, pan-Canadian approach to climate change and carbon pricing so that our children and grandchildren can inherit a Canada more prosperous and sustainable than the one we know today.”</p>\n<p><em>–</em><em> Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Associated links</strong></p>\n<ul>\n<li>Government of Canada – <a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Fighting climate change</a></li>\n<li>World Bank – <a href=\"http://www.worldbank.org/en/news/press-release/2016/04/21/leaders-set-landmark-global-goals-for-pricing-carbon-pollution\">Leaders Set Landmark Global Goals for Pricing Carbon Pollution</a></li>\n</ul></div>\n      "
}