{
  "path": "/en/news/news-releases/2019/08/02/new-agreement-help-nunavummiut-find-affordable-homes",
  "pageTitle": "New agreement to help Nunavummiut find affordable homes | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Too many Nunavummiut struggle to find a safe and affordable place to call home. With the fastest growing and youngest population in Canada, Nunavut faces a housing crisis where overcrowded homes are putting families’ health, safety, and well-being at risk. That is why we are making investments through Canada’s first National Housing Strategy to fight homelessness and improve access to affordable housing for people living in Nunavut and across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Nunavut, Joe Savikataaq, today announced a new 10-year agreement between the Government of Canada and the Government of Nunavut that will make it easier for families in the territory to find good, affordable homes.</p>\n\n<p>Under the new agreement, the federal and territorial governments will provide nearly $316&nbsp;million in targeted funding to protect, renew, and expand social and community housing, and to repair and build affordable homes across the territory. Our investments – combined with funding already available through a social housing agreement between Canada and Nunavut – will help preserve more than 1,600 community housing units across the territory. We will also work together to introduce a new Canada Housing Benefit for people living in Nunavut, which will provide direct support to families and people in need.</p>\n\n<p>The agreement reflects our shared commitment to provide long-term, predictable funding for housing that puts people first, helps build stronger communities, creates jobs, and supports the local economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Investing in affordable housing is about giving everyone a strong foundation so they can build a better future. For many Nunavummiut who have lived for years in overcrowded spaces, a new home is an opportunity to raise their families in a safe, healthy environment. With this new agreement, we are doing more than building and repairing housing units – we are making a real difference in the lives of people and families in Nunavut.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“T‎oday's announcement is yet another demonstration of our government's commitment to work in partnership with all provinces and territories in order to ensure that in Canada, when it comes to housing, no one is left behind‎.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development and Minister responsible for the Canada Mortgage and Housing Corporation</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada is working to ensure every Canadian has a safe and affordable place to call home. Long-term, predictable funding for housing has been needed for more than a decade. Today, with the Government of Nunavut, we are taking a significant step toward our goal of building strong communities where Canadian families can prosper and thrive, now and for the future. Our government will continue working in partnership with Nunavut and other provinces and territories to build affordable housing units and renew existing community housing units across the country.”</p>\n\n<footer class=\"default\">Yvonne Jones, Parliamentary Secretary to the Minister of Intergovernmental and Northern Affairs and Internal Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“Nunavut’s housing needs are urgent, and access to safe, affordable housing will relieve many of the barriers Nunavummiut face every day. Helping our families move along the housing continuum also helps to foster their protective factors including social equity, family strength, and cultural stability. We look forward to working with the federal government to increase direct, strategic investments in housing to improve the quality of life of our people.”</p>\n\n<footer class=\"default\">The Hon. Joe Savikataaq, Premier of Nunavut</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Nunavut needs over 3,000 units to meet its current housing demand, with over 4,900 individuals or about 2,500 families on waiting lists for public housing.</li>\n\t<li>The new Canada-Nunavut Housing Agreement includes a total investment of nearly $316 million over 10 years to improve access to affordable housing in Nunavut. This amount consists of:\n\t<ul>\n\t\t<li>more than $265 million from the Government of Canada, including $216&nbsp;million under the Northern Housing Initiative; and</li>\n\t\t<li>more than $49&nbsp;million from the Government of Nunavut.</li>\n\t</ul>\n\t</li>\n\t<li>Combined with funding of $24 million already delivered through the Northern Housing Initiative in 2018-2019, the Government of Canada is investing a total of nearly $290 million to address housing needs in the territory.</li>\n\t<li>These investments are in addition to over $245 million in existing federal funding for Nunavut through the Social Housing Agreement over the next 10 years.</li>\n\t<li>The new agreement recognizes the importance of giving priority to those most in need, and is guided by a human rights-based approach that focuses on accountability, participation, non-discrimination, and inclusion.</li>\n\t<li>The National Housing Strategy is a 10-year, $55 billion plan that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. The strategy sets clear goals to remove 530,000 Canadians from housing need and reduce chronic homelessness by 50 percent.</li>\n\t<li>From November 2015 to June 1, 2019, the Government of Canada invested more than $200 million for housing in Nunavut.</li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.placetocallhome.ca/\">Canada’s National Housing Strategy</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs/federal-provincial-territorial-housing-agreements\">Federal/Provincial/Territorial housing agreements</a></li>\n</ul></div>\n      "
}