{
  "path": "/en/news/news-releases/2019/08/01/prime-minister-welcomes-new-members-youth-council",
  "pageTitle": "Prime Minister welcomes new members to Youth Council | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed new members to the Prime Minister’s Youth Council. Together, these young Canadians are using their voices to push for positive change and work toward a better future for everyone.</p>\n\n<p>Youth Council members are meeting in Iqaluit, Nunavut, this week for the Council’s first-ever meeting in Canada’s North. While there, members will discuss important issues, including the need to advance reconciliation, strengthen infrastructure in remote communities, improve Northern food security, protect Indigenous languages, and support local businesses and Indigenous tourism. During the three-day meeting, council members will take part in local activities, including a service activity, traditional ceremonies, and meet with local Elders and Indigenous youth.</p>\n\n<p>This year, members of the Youth Council, together with other young Canadians from across the country, participated in the first-ever Canada Youth Summit and helped shape Canada’s first youth policy. Their feedback is helping inform government priorities and decisions to the benefit of all Canadians.</p>\n\n<p>We know that engaging and empowering young people helps move our country forward. The Government of Canada is working to provide young people with the platform and opportunities they need to help build a better, more just, and more sustainable future.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I thank the outgoing members of the Youth Council for their many contributions over the last two years. Their hard work, compassion, and thoughtful recommendations have helped challenge the status quo, and will help shape a better tomorrow for us all. I look forward to hearing the perspectives and fresh ideas that the new members will bring to the table.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Council’s second cohort has concluded its mandate and members now begin their work as Youth Council Alumni, which is a network of former Youth Council members who continue to engage in their communities and make significant impacts in the lives of others.</li>\n\t<li>Since 2016, the Youth Council has held nine in-person meetings across the country, leading in-depth discussions with federal ministers, parliamentary secretaries, and other young leaders. In addition to meeting in-person, Youth Council members collaborate virtually and work closely with young people in their communities to inform their advice to the Prime Minister.</li>\n\t<li>Youth Council members come from diverse communities and all regions of Canada, and possess a wide range of knowledge and experience. They are appointed for a two-year mandate.</li>\n\t<li>Canadians can sign-up to receive news and get involved in engagement opportunities in areas of interest to them at <a href=\"https://www.canada.ca/en/youth.html\">canada.ca/youth</a>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada’s Youth Policy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council/council/members.html\">Council Members</a></li>\n</ul></div>\n      "
}