{
  "path": "/en/news/statements/2023/03/21/statement-prime-minister-international-day-elimination-racial",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Racial Discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Racial Discrimination:</p>\n\n<p>“Building a world free of racism requires deliberate, continuous efforts to change perceptions and systems that have been in place for many years. Today, on the&nbsp;<a href=\"https://www.un.org/en/observances/end-racism-day\">International Day for the Elimination of Racial Discrimination</a>,&nbsp;we come together to renew our commitment to building a more inclusive country and world, where everyone has an equal opportunity to succeed.</p>\n\n<p>“On this day in 1960, police officers in apartheid South Africa opened fire and killed 69 people at a peaceful demonstration in a Black township held to protest apartheid laws. The international response led the United Nations (UN) to declare March 21 the International Day for the Elimination of Racial Discrimination. Since then, the apartheid system in South Africa has been dismantled, but this day invites us to continue to stand up against racism and inequities that persist in our societies today, including against Indigenous, Black, Asian, Jewish, Muslim, and other racialized and religious minority communities.</p>\n\n<p>“Here at home, despite significant progress, hate and discrimination – including anti-Indigenous, anti-Black, anti-Asian, antisemitic, and Islamophobic – continue to be a lived reality for many people in our communities. With the support of the Federal Anti-Racism Secretariat, we continue to take action to combat racial discrimination and tackle its effects on people and communities across the country, including in the health care system. This includes initiatives like the <a href=\"https://www.canada.ca/en/public-health/services/funding-opportunities/grant-contribution-funding-opportunities/promoting-health-equity-mental-health-black-canadians-fund.html\">Promoting Health Equity: Mental Health of Black Canadians Fund,</a> which supports community-based projects that promote mental health for Black communities, as well as the new <a href=\"https://www.canada.ca/en/health-canada/corporate/about-health-canada/funding/addressing-racism-discrimination-canada-health-systems-program.html\">Addressing Racism and Discrimination in Canada’s Health Systems Program</a>, which provides funding for projects that address systemic racism in our health systems. This is in addition to the recently announced <a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/02/working-partnership-deliver-high-quality-health-care-indigenous\">Indigenous Health Equity Fund</a>, which demonstrates Canada’s commitment to the implementation of Joyce’s Principle. This principle aims to inform Indigenous health legislation, address the systemic inequities Indigenous Peoples face, and give them access to quality and culturally safe health care services, free from racism and discrimination.</p>\n\n<p>“Internationally, Canada has long been a champion for diversity and inclusion. Guided by the 2030 Agenda for Sustainable Development, we continue to respond to the call to build a more peaceful world where human rights and fundamental freedoms are universally respected. Earlier this year, as part of our international efforts, we were proud to sign the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat/declaration-partnership-equality-racial-justice.html\">Declaration on the North American Partnership for Equity and Racial Justice</a>, which provides a framework for collaboration with the United States and Mexico to combat systemic racism and discrimination. This Partnership will help us create a North America where everyone has an equal opportunity to achieve their full potential and equal participation in social, cultural, economic, and political life.</p>\n\n<p>“Today, and every day, I encourage all Canadians to confront racism, discrimination, and xenophobia in all their forms. Whether in person or online, in our communities, in our schools, or at work, everyone has the right to live a life free of hate and discrimination. Together, we can build a brighter future where everyone is valued, celebrated, and respected in their diversity.”</p></div>\n      "
}