{
  "path": "/en/news/news-releases/2022/02/22/canada-announces-support-address-situation-ukraine",
  "pageTitle": "Canada announces support to address the situation in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and Ukraine are steadfast partners and close friends. Alongside its international partners and allies, and in solidarity with the government and people of Ukraine, Canada unequivocally condemns Russia’s decision to recognize the independence of the Donetsk and Luhansk regions in Ukraine. Russia’s action constitutes a brazen violation of Ukraine’s sovereignty, territorial integrity and independence, and demonstrates a blatant disregard for international law.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canada will be imposing new sanctions under the <em>Special Economic Measures (Russia) Regulations</em> and the <em>Special Economic Measures (Ukraine) Regulations.</em> These new measures will:</p>\n\n<ul>\n\t<li>Impose restrictions on members of the Russian State Duma who voted for the decision to recognize the independence of the Donetsk and Luhansk;</li>\n\t<li>Impose a dealings ban on the non-government controlled areas of Donetsk and Luhansk, which will effectively prohibit Canadians from engaging in specific transactions and activities in these regions;</li>\n\t<li>Place new prohibitions on direct and indirect dealings in Russian sovereign debt; and</li>\n\t<li>Impose sanctions on two significant Russian financial institutions in order to hinder Russia’s ability to further fund its aggressive actions.</li>\n</ul>\n\n<p>The Prime Minister also announced that Canada will be sending additional military contributions to support North Atlantic Treaty Organization (NATO) in the face of rising tensions in the region. These contributions, which fall under Operation REASSURANCE, will strengthen NATO’s deterrence and defence efforts by increasing Canada’s land, maritime, and air capabilities in Europe. Specifically, Canada will provide:</p>\n\n<ul>\n\t<li>Up to an additional 460 personnel to the approximately 800 currently deployed in Europe in support of NATO, including:\n\t<ul>\n\t\t<li>A battery of M777 artillery guns with forward observers and an electronic warfare troop to bolster the Canadian led enhanced Forward Presence Battle Group in Latvia;</li>\n\t\t<li>A second frigate, with an embarked maritime helicopter, to participate in NATO’s Standing Naval Forces; and</li>\n\t\t<li>The re-tasking of a CP-140 Aurora long range patrol aircraft already in the region, which will now operate in the Euro-Atlantic Area under NATO command and control.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<p>In addition, approximately 3,400 Canadian Armed Forces personnel across all branches of the service are authorized to deploy to the NATO Response Force should they be required by NATO.</p>\n\n<p>There is still time for Russia to choose de-escalation and diplomacy, but the window to do so is closing. These measures will apply further pressure on Russian leadership and extend greater support to our allies and partners. Canada will continue working with our allies and partners to impose additional hard-hitting economic measures that will inflict severe costs on Russia if it does not cease its unacceptable aggression against Ukraine. These actions demonstrate Canada’s steadfast support for Ukraine’s sovereignty. The people of Ukraine have the right to decide their own future and live free and without fear.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Russia’s recent actions are a blatant attack on Ukrainian sovereignty, as well as a serious threat to the security and stability of the region and the international rules-based order. The sanctions and the additional military support we are announcing today is the first step Canada will take to stop Russia’s unwarranted aggression. There will be serious consequences for Russia’s actions, and together with our allies and partners, we will continue to take decisive action to support the sovereignty, territorial integrity, and independence of Ukraine.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“President Putin’s recent actions have shown the world that he is using any pretext to further invade Ukraine. Ukraine’s sovereignty and territorial integrity must be respected and the Ukrainian people must be free to determine their own future. Our message to Ukraine and its people is clear: you are not alone; Canada stands with you.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“At this pivotal time for the security of Ukraine, Europe, and the world, Canada will continue to step up and do its part, in close collaboration with our NATO Allies. To reinforce our deterrence measures in Europe, Canada is deploying an even greater contingent to NATO’s enhanced Forward Presence Battle Group in Latvia, and will contribute more troops and assets to bolster NATO forces in the Euro-Atlantic area. We will continue to work with our allies and partners to defend the rules-based international order that has kept us safe since the end of the Second World War.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In response to Russia’s threats and military build-up in and around Ukraine in recent weeks, the Government of Canada invested in additional support for Ukraine. This includes through the extension and expansion of Operation UNIFIER, the Canadian Armed Forces’ military training and capacity-building mission in Ukraine, up to $620&nbsp;million in loans, and the provision of up to $10&nbsp;million in lethal and non-lethal equipment and ammunition.</li>\n\t<li>Since Russia’s attempted annexation and illegal occupation of Crimea in 2014, Canada has sanctioned more than 440 individuals and entities, with many of these sanctions undertaken in coordination with our allies and partners. Canada’s sanctions impose asset freezes and dealings prohibitions on listed persons.</li>\n\t<li>As part of NATO’s enhanced Forward Presence, Canada has assumed a leadership role as one of four Framework Nations and is leading a robust multinational NATO enhanced Forward Presence battle group in Latvia. Canada’s contribution of up to 540 personnel, vehicles and equipment includes a headquarters element, a mechanized infantry company, and combat service support based at Camp Ādaži in Latvia.</li>\n\t<li>Immigration, Refugees and Citizenship Canada (IRCC) has implemented measures to quickly issue travel documents to help Canadian citizens, Canadian permanent residents, and their immediate family members in Ukraine get to Canada as quickly as possible should they wish to do so. IRCC is also increasing operational capacity in the region and has enacted priority-processing of applications for proof of citizenship, permanent residence, and temporary residence, including study and work permits, for Ukrainian nationals who want to study, work, reunite with family, or start a new life in Canada.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s Engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/canada-strongly-condemns-russias-move-to-recognize-independence-of-two-regions-within-ukraine.html\">Canada strongly condemns Russia’s move to recognize independence of two regions within Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n</ul></div>\n      "
}