{
  "path": "/en/news/statements/2020/09/11/statement-prime-minister-anniversary-911-and-national-day-service",
  "pageTitle": "Statement by the Prime Minister on the anniversary of 9/11 and the National Day of Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the terrorist attacks on September 11, 2001, and on the National Day of Service:</p>\n\n<p>“Nineteen years ago today, the deadliest terrorist attacks in the history of the United States shook Canadians and people around the world.</p>\n\n<p>“On this solemn anniversary, we remember the tragedy of 9/11 and its nearly 3,000&nbsp;victims, including 24 Canadians. We offer our condolences to all those who lost loved ones, and those whose lives were forever changed.</p>\n\n<p>“We also recognize the bravery and sacrifice of first responders, including the hundreds who lost their lives while trying to protect and save others. Firefighters, police officers, military personnel, paramedics, and ordinary people climbed the steps of the burning towers to rescue those inside. They battled flames at the Pentagon, tended to the injured through rubble and smoke, and attempted to take back control of a hijacked plane. Amidst the fear, panic, and horror emerged incredible courage, heroism, and selflessness.</p>\n\n<p>“On this National Day of Service, we honour first responders in Canada and around the world, and all those who come to the service of their neighbours, their communities, and their country. We are reminded of the people of Gander in Newfoundland and Labrador who opened their hearts and their homes to thousands of stranded airline passengers on 9/11. They showed us that compassion conquers hate, and that our values of diversity, inclusion, and peace can overcome the darkest of days.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to take part in acts of service today – by giving back in ways big or small – to honour those who courageously and selflessly helped others on 9/11.”</p></div>\n      "
}