{
  "path": "/en/news/news-releases/2020/05/19/prime-minister-announces-expansion-support-workers-and-small",
  "pageTitle": "Prime Minister announces expansion of support for workers and small businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Throughout the pandemic, the Government of Canada has focused on keeping Canadians safe and healthy and helping families pay their bills. That’s why we have introduced strong measures to protect middle class jobs and support businesses, so they can keep Canadians on the payroll during this challenging time.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an expansion to the eligibility criteria for the Canada Emergency Business Account (CEBA) to include many owner-operated small businesses. This extended measure will help small businesses protect the jobs that Canadians rely on.</p>\n\n<p>The changes to the CEBA will allow more Canadian small businesses to access interest free loans that will help cover operating costs during a period when revenues have been reduced, due to the pandemic.&nbsp; &nbsp;</p>\n\n<p>The program will now be available to a greater number of businesses that are sole proprietors receiving income directly from their businesses, businesses that rely on contractors, and family-owned corporations that pay employees through dividends rather than payroll.</p>\n\n<p>To qualify under the expanded eligibility criteria, applicants with payroll lower than $20,000 would need:</p>\n\n<ul>\n\t<li>a business operating account at a participating financial institution</li>\n\t<li>a Canada Revenue Agency business number, and to have filed a 2018 or 2019 tax return.</li>\n\t<li>eligible non-deferrable expenses between $40,000 and $1.5 million. Eligible non-deferrable expenses could include costs such as rent, property taxes, utilities, and insurance.</li>\n</ul>\n\n<p>Expenses will be subject to verification and audit by the Government of Canada. Funding will be delivered in partnership with financial institutions. More details, including the launch date for applications under the new criteria, will follow in the days to come. To date, over 600,000 small businesses have accessed the CEBA, and the government will work on potential solutions to help business owners and entrepreneurs who operate through their personal bank account, as opposed to a business account, or have yet to file a tax return, such as newly created businesses.</p>\n\n<p>This measure is part of the Government of Canada’s COVID-19 Economic Response Plan, which is putting Canadians and the protection of middle class jobs first. We will continue to help all Canadians, and together we will get through this crisis.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians are counting on us to protect their jobs and help them pay their bills during this difficult time. By expanding the CEBA, we will be giving more businesses access to the support they need, so they can help protect workers and the jobs they rely on. Today we are helping to keep more businesses open and more Canadians working, so we are better prepared for the recovery to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government has been taking action since the start of this crisis to support the small businesses that define our Main Streets and provide jobs that Canadians rely on. We have been listening to you throughout this, and will continue to, to make sure we’re delivering the support Canadian businesses need to get through this tough time and be well positioned for success once the recovery begins.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Small businesses are at the heart of our communities, and they drive our national economy. By making our lending supports more generous and inclusive, we’re working hard to save Canadian jobs and businesses. We will continue to be there for Canadian businesses and workers every step of the way through this crisis.”</p>\n\n<footer class=\"default\">The Hon. Mary Ng, Minister of Small Business, Export Promotion and International Trade</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Launched on April 9, 2020, the CEBA provides zero-interest, partially forgivable loans up to $40,000 to small businesses that have experienced diminished revenues due to COVID-19, but face ongoing non-deferrable costs such as rent, utilities, insurance, taxes, and employment costs. Twenty-five per cent of this loan is forgivable if repaid by December 31, 2022.</li>\n\t<li>The CEBA is administered by Export Development Canada, which is working closely with Canadian financial institutions to deliver the loans to their existing business banking customers.</li>\n\t<li>When first launched, the CEBA was designed to allow for rapid deployment of credit to businesses with 2019 payroll between $50,000 and $1 million. The government then expanded the eligibility parameters of the program, by increasing the payroll eligibility range to between $20,000 and $1.5 million.</li>\n\t<li>Since the CEBA’s launch, over 600,000 loans have been approved, representing a total of more than $24 billion in credit.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n</ul></div>\n      "
}