{
  "path": "/en/news/statements/2022/03/23/joint-statement-prime-minister-trudeau-and-president-von-der-leyen",
  "pageTitle": "Joint Statement by Prime Minister Trudeau and President von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We strongly condemn President Putin’s unjustifiable and unprovoked invasion of Ukraine and stand unwavering in our support of Ukraine’s democracy, sovereignty and territorial integrity. We are determined to defend our shared values and the rules-based international system. We are committed to the advancement of human rights, gender equality and inclusion, and the protection of fundamental freedoms. We call on Russia to stop its attacks on Ukraine immediately and unconditionally withdraw its forces and all military equipment from Ukraine, and call on Belarus to stop facilitating and supporting Russia’s invasion.</p>\n\n<h2>Humanitarian support</h2>\n\n<p>We stand by the brave and resilient Ukrainian people as they defend their homeland against Russian aggression and as they suffer from the Russian military’s indiscriminate and illegal attacks against civilians and civilian infrastructure. We abhor Russia’s grave violations of international human rights and humanitarian law, and will support all war crimes investigations in this regard.&nbsp; We urge Russia to ensure unhindered humanitarian access and permanent safe passage for civilians. We will continue to cooperate closely in the delivery of our humanitarian assistance within and outside Ukraine, and in support of a coordinated international response. The European Commission welcomes Canada’s exploration of avenues to work with the European Emergency Response Coordination Centre and the Civil Protection Mechanism hubs in Poland, Romania, and Slovakia to help channel assistance to Ukraine.</p>\n\n<h2>Refugees</h2>\n\n<p>The European Union has generously welcomed almost three and a half million Ukrainians fleeing Russia’s violence, providing them food, shelter, school, and employment opportunities, paying particular attention to the plight of children and providing them protection for the time they need. Canada has launched the&nbsp;<a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/ukraine-measures/cuaet.html\">Canada-Ukraine authorization for emergency travel</a>&nbsp;(CUAET) as part of the Government of Canada’s broader support for the people of Ukraine. The European Commission and Canada will continue to coordinate further support for those who have been forced to flee Ukraine,&nbsp;as well as the assistance to&nbsp;Ukraine’s neighbours most affected.</p>\n\n<h2>Sanctions</h2>\n\n<p>The EU and Canada have already adopted, in close transatlantic cooperation, unprecedented restrictive measures to impose massive costs on Russia for its military aggression against Ukraine. Canada and the EU have closely coordinated on severe sanctions against Russian and Belarussian officials who facilitated Russia’s aggression; disconnecting key Russian banks from SWIFT; the closing of our air spaces; the banning of transactions with the Russian Central Bank, and; the reduction of dependencies to Russian energy commodities. The EU and Canada have commonly suspended Belarus’ accession at the WTO. The Russian regime is paying a severe economic price for its heinous attacks, to the detriment of its people and their future.</p>\n\n<p>Together with our G7 partners and many others, Canada and the European Commission, within the framework of its competences, will further strengthen these sanctions and continue to degrade Russia’s economic, industrial, technological and innovative potential by supporting the extension of restrictive measures on trade, in the financial sector and beyond. In this context, Canada and the European Commission, in line with its competences, will work to further step up enforcement and the fight against sanctions evasion.</p>\n\n<h2>Green transition</h2>\n\n<p>We reconfirm our joint commitment to accelerating the global transition to a green, carbon-neutral future and emphasise the urgency of addressing climate change, including through diligent implementation of commitments made at COP26. We further agree that carbon pricing is an efficient, cost-effective and powerful tool to reduce emissions and drive clean innovation. We recognize each other’s leadership in this area and commit to work together to engage international partners in expanding global carbon pricing coverage.</p>\n\n<p>We will continue to deliver on our climate finance commitments to support developing countries adapt to climate change and achieve their climate goals. We will also work together to ensure an ambitious outcome of the negotiations of the post-2020 Global Biodiversity Framework and remain committed to the transition towards more resource-efficient and circular economies.</p>\n\n<h2>Energy cooperation</h2>\n\n<p>We will deepen our cooperation towards a net-zero energy transition, including by taking concrete steps in our energy cooperation to enhance<strong> </strong>security of supply and work to eliminate the EU and its Member States’ dependence on Russian energy. A dedicated working group on green transition and LNG is being created to develop a concrete action plan on these matters, and our officials will meet this week to further discuss enhancing energy-related cooperation.</p>\n\n<p>We remain committed to organizing a Clean Tech Summit in Canada in 2022 to promote our shared commitment to the green transition of our economies, while at the same time helping to promote our energy security, currently under such threat from Vladimir Putin’s illegal war of aggression against Ukraine<em>.</em></p>\n\n<h2>Safe, Secure Supply Chains, including for Critical Raw Materials</h2>\n\n<p>Building on the strong foundation of trusted trade provided by the Comprehensive Economic and Trade Agreement (CETA), we will work to ensure open and reliable supply chains between and among our businesses. We underline the importance of our joint commitment, as set out under the Canada-EU Strategic Partnership on Raw Materials, to ensure the security of critical minerals and metals value chains and supply, including reducing dependence on Russian minerals and metals, with a view to facilitating the transition to a climate-neutral economy.</p>\n\n<h2>Democracy, Cybersecurity and Countering Disinformation</h2>\n\n<p>President Putin’s attack on Ukraine amounts to an unprecedented attack on democratic principles and the rules-based international system. It has also underscored the need for democracies to strengthen international cooperation and coordination to stand up against authoritarianism and to develop new approaches to promote and protect democracies around the world.</p>\n\n<p>We are committed to advancing our cooperation on hybrid threats such as cybersecurity, both in response to Russia’s aggression and longer-term objectives. Together, we will enhance efforts to coordinate assistance to the Governments of Ukraine and Moldova related to cyber resilience and defence, Internet access and countering disinformation, working with EU Member States and other likeminded partners, and through the G7 Rapid Response Mechanism.</p>\n\n<p>We will seek to reinforce further responsible state behavior in cyberspace and work together with the aim to increase cyber resilience in the face of destructive, disruptive, and destabilizing cyber activity by both states and non-state actors and to hold accountable those responsible for such activity.</p>\n\n<p>We further reconfirm our joint commitment to pursue deepened cooperation on ethical artificial intelligence, safe and secure data flows as well as digital credentials through agile regulation and joint standards.</p>\n\n<h2>Food Security</h2>\n\n<p>We are very concerned about the food crisis caused by President Putin’s war in Ukraine and we are committed to working together to address the immediate and long-term impacts of the war on global agriculture supply chains and food security. We recognize that the impacts will be felt more strongly by the most vulnerable countries, including those already facing humanitarian crisis. We will work together to support humanitarian partners, such as the World Food Program, to help meet the emergency food and nutrition needs of the growing number of acutely food insecure people. We should also work with international partners to support vulnerable countries to enhance the resilience of their agriculture and food systems to conflict, climate and economic shocks.</p>\n\n<p>Despite the many challenges we are facing together at present, it is important to acknowledge key milestones, including the 5<sup>th</sup> anniversary this fall of the provisional application of CETA and the Strategic Partnership Agreement.&nbsp; Both agreements have brought clear and concrete benefits to Europeans and Canadians, and we look forward to full ratification. &nbsp;The dialogue and cooperation on all major geopolitical and global economic, energy and environmental issues in the period up to and at the next Canada-EU Leaders' Summit, should be continued.</p></div>\n      "
}