{
  "path": "/en/news/readouts/2020/04/09/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with premiers to discuss the evolving COVID-19 situation. The leaders discussed preparations and actions taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians, and to support workers and businesses.</p>\n\n<p>First Ministers reaffirmed their commitment to continued collaboration and coordination to address COVID-19. The Prime Minister updated premiers on progress under Canada’s Plan to Mobilize Industry to fight COVID‑19, which will provide vital, made‑in‑Canada protective gear and medical equipment to respond to the outbreak. The Prime Minister noted that increasing domestic production of these items is a top priority. He&nbsp; highlighted work with companies across the country to make sure that we have the medical supplies and equipment needed to keep Canadians safe and healthy. First Ministers welcomed the initiatives of Canadian companies that have offered to re-tool, repurpose, and innovate to fight COVID‑19.</p>\n\n<p>The Prime Minister confirmed that shipments of personal protective equipment (PPE) have been received this week, and that distribution to provinces and territories is underway. Additional orders placed for PPE and medical supplies, including surgical gowns, N95 masks, gloves, and ventilators, were also discussed.</p>\n\n<p>The Prime Minister talked about the need to exhaust all available options to protect the health and safety of Canadians, and the importance of having discussions regarding the <em>Emergencies Act</em>. He encouraged premiers to share their views on how the Act could be used, if required, however he noted that current measures and the great collaboration between governments are helping Canada fight the pandemic.</p>\n\n<p>First Ministers also discussed their approaches to COVID-19 projections and data modelling. They agreed that continued data sharing and other measures currently in place, including physical distancing, quarantining, and self-isolation, are essential to slowing the spread of COVID-19 and to ensuring the safety of frontline workers and the capacity of the health care system.</p>\n\n<p>Addressing COVID-19 must be a Team Canada effort. The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of all Canadians is the government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/04/07/prime-ministers-remarks-production-more-medical-supplies-and-equipment\">Prime Minister’s remarks on production of more medical supplies and equipment in Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n</ul></div>\n      "
}