{
  "path": "/en/news/statements/2015/11/28/statement-prime-minister-death-maurice-strong",
  "pageTitle": "Statement by the Prime Minister on the death of Maurice Strong | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today after learning of the death of Maurice Strong:</p>\n<p>“I was very saddened to learn of the death of Maurice Strong. On behalf of all Canadians, Sophie and I offer our deepest condolences to his family, friends, and colleagues.</p>\n<p>“Mr Strong was an internationally recognized environmentalist and philanthropist who used his remarkable business acumen, organizational skills, and humanity to make the world a better place.</p>\n<p>“In his career he took on extraordinarily challenging positions at the United Nations, including Secretary-General of the United Nations Conference on the Human Environment. He was also first Executive Director of the United Nations Environment Programme, Executive Co-ordinator of the United Nations Office for Emergency Operations in Africa, and was a member of the World Commission on Environment and Development.</p>\n<p>“More recently, Mr. Strong was Secretary-General of the 1992 United Nations Conference on Environment and Development. He was a driving force behind achieving the Kyoto Protocol. In addition, he was considered a legend at the Canadian International Development Agency that he headed earlier in his career.</p>\n<p>“For his work, Mr. Strong received numerous conservation and humanitarian awards as well as honorary doctorates from multiple universities. He was a Companion of the Order of Canada and a member of the Queen’s Privy Council for Canada.</p>\n<p>“Mr. Strong was a global pioneer of sustainable development who left our country and our world a better place. His accomplishments will be remembered and honoured for years to come.\"</p></div>\n      "
}