{
  "path": "/en/news/statements/2016/02/03/joint-statement-prime-minister-canada-and-premier-alberta",
  "pageTitle": "Joint statement by the Prime Minister of Canada and the Premier of Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and the Premier of Alberta, Rachel Notley, issued the following joint statement after their meeting in Edmonton, Alberta:</p>\n<p>“Canada works best when we all work together. Albertans are proud Canadians who have contributed enormously to the economic and social fabric of our country, and Canadians want to be there for Albertans in challenging times.</p>\n<p>“And that is exactly why we met today: so that the province and the Government of Canada can work together to advance the well-being and prosperity of Alberta families, workers and businesses, including those hardest hit by the global downturn in commodity prices.</p>\n<p>“We agreed to take joint action in three principal areas: jobs and the economy, clean growth and climate change, and energy infrastructure and market access.</p>\n<p><strong>Joint Action on Jobs and the Economy</strong></p>\n<p>“Alberta’s economy is important to Canada’s economy and federal-provincial action is needed to promote jobs and growth – especially given how low oil and other commodity prices are affecting the province. Together, we are working to support workers and families.</p>\n<p>“We agreed to work together to support Alberta businesses through access to capital and innovation measures to help them grow, pursue new market opportunities, and create jobs.</p>\n<p>“To this end, the federal government is committing to fast track infrastructure investments for Alberta, which has applied for nearly $700 million under the existing Building Canada allocation to help address urgent economic and infrastructure needs.</p>\n<p>“In addition, in response to a request from Alberta, the Government of Canada stands prepared to provide up to $250 million to the province, in the form of an advance fiscal stabilization payment, as a result of losses in natural resource revenue.</p>\n<p>“Together with Alberta’s capital plan, our two governments will help address urgent economic and infrastructure needs, supporting long-term growth while creating jobs in the short-term.</p>\n<p><strong>Joint Action on Clean Growth and Climate Change</strong></p>\n<p>“We both recognize that the need to act on climate change in concert with the rest of the world is more important than ever to attract new investment, and create jobs and clean growth. We also recognize that growing Canada’s economy and reducing emissions go hand in hand.</p>\n<p>“To this end, we agreed to move forward as strong partners on the environment and the economy and work with other provinces and territories at the upcoming First Ministers’ meeting, to achieve a pan-Canadian framework for driving clean growth and combatting climate change.</p>\n<p><strong>Promoting Energy Infrastructure and Market Access</strong></p>\n<p>“The governments of Alberta and Canada share common goals and principles around energy market access, working together with other provincial, territorial, municipal and Indigenous leaders. Because of the work Alberta has done in introducing its Climate Leadership Plan conversations about pipelines are now easier to have.</p>\n<p>“We agreed that we must get these resources to market in responsible, sustainable ways that Canadians trust, based on robust environmental assessments and that contribute to greater investment and long-term economic growth and job creation.&nbsp;</p>\n<p><strong>New Era of Cooperation</strong></p>\n<p>“Recognizing that Alberta is critical to the social and economic fabric of Canada, we agreed to continue to engage in open and continuous dialogue which we believe is critical to advancing the interests of Alberta families, workers and businesses.”</p></div>\n      "
}