{
  "path": "/en/news/readouts/2020/03/05/deputy-prime-minister-chrystia-freeland-convenes-new-cabinet-committee",
  "pageTitle": "Deputy Prime Minister Chrystia Freeland convenes the new Cabinet Committee on the federal response to the coronavirus disease (COVID-19) | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Deputy Prime Minister Chrystia Freeland convened the new Cabinet Committee on the federal response to the coronavirus disease (COVID-19) to discuss the ongoing COVID-19 outbreak and the measures taken by the Government of Canada to limit the spread of the virus in Canada.</p>\n\n<p>Minister of Health Patty Hajdu and Canada’s Chief Public Health Officer Dr. Theresa Tam provided an update on the evolving situation, and the ongoing and collaborative engagement with provinces and territories, and with international partners, including the United States, to limit the spread of the virus. They also outlined measures underway, including enhanced measures at the border to identify travellers returning to Canada who may be ill, or being planned to continue to protect the health and safety of all Canadians. This includes the public health advice to Canadians provided by the Public Health Agency of Canada.</p>\n\n<p>Ministers Bill Morneau, Mélanie Joly, Navdeep Bains, and Bill Blair provided updates on the impact of the evolving situation on the economy and of the continuing and comprehensive efforts at the border. Ministers, as well as Deputy Leader of the Government in the House of Commons Kirsty Duncan, emphasized the importance of effective and coordinated federal efforts, as well as communications. Ministers committed to continued coordination of federal efforts and to working in close partnership with local, provincial, territorial, and international partners to reduce potential risks to Canadians and our economy.</p>\n\n<p>Ministers discussed the comprehensive, whole-of-government approach being taken to Canada’s preparedness for, response to, and recovery from COVID-19 from a public health, social, and economic perspective. While Canada has not experienced the impacts that other countries are experiencing right now, ministers emphasized the importance of planning for all scenarios and closely following best practices from the past and those from around the world.</p>\n\n<p>The Committee will meet regularly to ensure whole-of-government leadership, coordination, communication, and preparedness for a response to the health and economic impacts of the virus. This includes coordination of efforts with other orders of government.</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/04/prime-minister-creates-committee-covid-19\">Prime Minister creates committee on COVID-19</a></li>\n</ul></div>\n      "
}