{
  "path": "/en/news/statements/2019/03/21/statement-prime-minister-international-day-elimination-racial",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Racial Discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Racial Discrimination:</p>\n\n<p>“Today, on the&nbsp;<a href=\"http://www.un.org/en/events/racialdiscriminationday/\">International Day for the Elimination of Racial Discrimination</a>, we reflect on the progress we have made as a global community to end racial discrimination in all of its forms. We also turn to the work left to do so that everyone’s rights are respected – no matter their race, colour, ethnicity, or national origin.</p>\n\n<p>“Activists around the globe have long led the fight against racial discrimination – across the generations and from country to country. It’s thanks to their leadership – their courage, their vision, and their tenacity – that we have seen real progress toward a just and equal future. But we know we still have a long way to go.</p>\n\n<p>“The Government of Canada is working hard to build a country where everyone’s rights and freedoms are protected, and everyone’s voice is heard. Advancing reconciliation with Indigenous peoples is a key step towards that. We have taken significant steps to renew our relationship with First Nations, Inuit, and Métis peoples, based on recognition of rights, respect, cooperation, and partnership. In 2016, Canada announced its full support for the&nbsp;<a href=\"https://www.aadnc-aandc.gc.ca/eng/1309374407406/1309374458958\">UN Declaration on the Rights of Indigenous Peoples</a>, and we are working to implement it in full partnership and consultation with Indigenous peoples.</p>\n\n<p>“We are also taking concrete action to combat racism and make sure that Indigenous people, Black Canadians, and people of every race, colour, ethnicity, religion, and national origin across the country have the support they need to prosper. With Budget 2019, we announced $45 million over three years to support a new Canada-wide Anti-Racism Strategy. In recognition of the&nbsp;<a href=\"/en/news/news-releases/2018/01/30/prime-minister-announces-government-canada-will-officially-recognize\">International Decade for People of African Descent</a>, we are also investing $25 million to provide support and fund projects to help Black Canadian communities thrive.</p>\n\n<p>“Injustice and inequality harm us all. On behalf of the Government of Canada, I encourage Canadians to stand up against discrimination, racism, and xenophobia, whenever and wherever they occur. By working together, we can build a more just and inclusive world for all of us.”</p></div>\n      "
}