{
  "path": "/en/news/news-releases/2020/12/17/clean-energy-strengthen-economy-and-communities-newfoundland-and",
  "pageTitle": "Clean energy to strengthen the economy and communities in Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in infrastructure and clean energy is key to building strong communities, and a more sustainable and resilient economy. As an important part of Atlantic Canada’s clean energy future, the Lower Churchill Projects will provide a reliable and long-term source of clean power for people in the Atlantic region, and especially in Newfoundland and Labrador.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Newfoundland and Labrador, Andrew Furey, today announced measures to help ensure that the Lower Churchill Projects are financially sustainable. This is part of their shared commitment to electrification and clean energy for Newfoundlanders and Labradorians. Recognizing that the COVID-19 pandemic has further exacerbated construction challenges, these measures will include:</p>\n\n<ul>\n\t<li><strong>Delaying debt and financing payments associated with the Lower Churchill Projects:</strong> The Government<strong> </strong>of Canada has temporarily waived certain financial obligations faced by the provincial Crown corporation Nalcor Energy, to help reduce immediate financial pressures on Newfoundland and Labrador.</li>\n\t<li><strong>Moving forward on a process for a renewed financial structure for the Lower Churchill Projects:</strong> The Government of Canada and the Government of Newfoundland and Labrador will continue to work together on options to ensure a financially sustainable long-term solution for the Lower Churchill Projects, and identify opportunities to support electrification efforts in Newfoundland and Labrador.</li>\n\t<li><strong>Collaborating to study other clean energy projects:</strong> The Government of Canada will work with provinces to identify opportunities to support the Clean Power Roadmap for Atlantic Canada, including the Atlantic Loop.</li>\n\t<li><strong>Appointing a Senior Executive Advisor on the Lower Churchill Projects in Newfoundland and Labrador and electrification in the Atlantic region:</strong> In this role, Serge Dupont will help support, and develop recommendations on, the financial restructuring of the Lower Churchill Projects, and make progress on major electrification priorities to advance the Atlantic Loop.</li>\n</ul>\n\n<p>Clean energy initiatives such as the Lower Churchill Projects and the Atlantic Loop can help Newfoundland and Labrador, Atlantic Canada, and the entire country to fight climate change and phase out coal power, while promoting economic competitiveness and prosperity. The Government of Canada is committed to working collaboratively with provinces and territories, and Indigenous peoples, to build a healthier and cleaner future, and an economy that works for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We are working with Newfoundland and Labrador to ensure the financial sustainability and successful completion of the Lower Churchill Projects, and to advancing the Atlantic Loop. When we invest in clean, renewable energy, we are also making an investment in our environment, our people, and our economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Working in partnership with the federal government, today we are ensuring that Newfoundland and Labrador is at the heart of delivering clean, renewable energy to other parts of Canada. Our collective actions are also easing the financial pressures on Newfoundlanders and Labradorians, and putting our province on a solid path towards a sustainable future.”</p>\n\n<footer class=\"default\">The Hon. Andrew Furey, Premier of Newfoundland and Labrador</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is working collaboratively with the province of Newfoundland and Labrador to build a cleaner and more prosperous future for the next generation of Atlantic Canadians.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“It's important for people to know that the federal government recognizes the scale of the problem and the impact that it could have on the people of this province. We said we would help and we are.”</p>\n\n<footer class=\"default\">The Hon. Seamus O’Regan, Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Lower Churchill Projects are a set of hydroelectric generation and transmission projects that includes the Muskrat Falls Generating Station on the Churchill River in Labrador, the Labrador Transmission Assets, the Labrador–Island Link that connects to the island of Newfoundland, and the Maritime Link that connects to Nova Scotia.</li>\n\t<li>These projects will benefit Atlantic Canada’s regional electricity market and reduce greenhouse gas emissions.</li>\n\t<li>Since the announcement of the Lower Churchill Projects in 2010, the Government of Canada has guaranteed a total of $7.9 billion in debt related to the projects for the benefit of Newfoundland and Labrador.</li>\n\t<li>While the Lower Churchill Projects remain under provincial jurisdiction and the province has responsibility to ensure they are delivered economically, the Government of Canada’s goal remains to ensure the successful completion of these projects and maintain their financial sustainability.</li>\n\t<li>In the recent <em>Fall Economic Statement</em>, the Government of Canada committed $25 million for strategic interties to help complete engineering assessments, community engagement, and environmental and regulatory studies. This will support work with the provinces and territories, and regional partners, to bring clean power to more Canadians, accelerate the country’s transition away from coal, and help build new electricity transmission infrastructure.\n\t<ul>\n\t\t<li>Canada Infrastructure Bank’s (CIB) Growth Plan includes $2.5 billion for clean power. The CIB is currently working in collaboration with provincial and regional partners to connect Canadians to clean electricity across Canada through the Atlantic Loop and other regional projects.</li>\n\t</ul>\n\t</li>\n\t<li>Building on a long history of collaboration, the Government of Canada and the Atlantic provinces agreed to develop a Clean Power Roadmap for Atlantic Canada in March 2019. The roadmap, to be released in 2021, will outline a collective vision for how jurisdictions will collaborate with regional partners over the coming decades to build a clean power network across Atlantic Canada.</li>\n\t<li>The areas of focus when identifying opportunities to support the Atlantic Loop and electrification efforts in Newfoundland and Labrador will include:\n\t<ul>\n\t\t<li>Strengthening regional electricity trade through enhancing transmission opportunities.</li>\n\t\t<li>Increasing energy efficiency, energy storage, and the availability of clean power, and reducing emissions through electrification of the economy.</li>\n\t\t<li>Modernizing the province’s electric vehicle and zero-emission transportation fuel infrastructure.</li>\n\t\t<li>Identifying additional renewable electricity generation opportunities, such as hydro, wind, and solar power development.</li>\n\t</ul>\n\t</li>\n\t<li>As Senior Executive Advisor, Serge Dupont will work with the Government of Newfoundland and Labrador and its lead negotiator Brendan Paddick on the financial restructuring of the Lower Churchill Projects, as well as with the governments of New Brunswick, Nova Scotia, Prince Edward Island, and Quebec on broader electrification projects.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li>Biographical Note: <a href=\"/en/news/backgrounders/2020/12/17/serge-dupont\">Serge Dupont</a></li>\n\t<li><a href=\"https://www.canada.ca/content/dam/acoa-apeca/documents/Towards%20a%20Clean%20Power%20Roadmap%20for%20Atlantic%20Canada.pdf\">Interim Report: Towards a Clean Power Roadmap for Atlantic Canada</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/02/government-of-canada-announces-negotiationson-financial-restructuring-of-lower-churchill-projects.html\">Government of Canada announces negotiations on financial restructuring of Lower Churchill Projects</a></li>\n\t<li><a href=\"https://www.gov.nl.ca/lowerchurchillproject/\">Lower Churchill Project</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-action/powering-future-clean-energy.html\">Powering our future with clean electricity</a></li>\n</ul></div>\n      "
}