{
  "path": "/en/news/statements/2019/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p>\n\n<p>“Today, on&nbsp;<a href=\"https://www.veterans.gc.ca/eng/remembrance/history/korean-war\">Korean War Veterans Day</a>, we honour the more than 26,000 Canadians who answered the call to serve during the Korean War. Despite being known as the ‘Forgotten War’, the Korean War remains Canada’s third-bloodiest overseas conflict, after the First and Second World Wars.</p>\n\n<p>“Alongside several United Nations member countries, Canadians served in the air, on land, and at sea to defend the sovereignty of South Korea. They endured heavy combat, treacherous terrain, and unforgiving weather. Bitter cold during winter months brought progress to a standstill while summer monsoon rains turned even the simplest task into a struggle.</p>\n\n<p>“For civilians, there was no escape from the many hardships the war brought to their homeland. Food became scarce. Homes, schools, and hospitals were destroyed. Families were separated, and many people suffered the disappearances and deaths of their loved ones.</p>\n\n<p>“By the end of the war, the struggle for control of the Korean Peninsula had claimed the lives of millions of people. The brutal fighting ended on July 27, 1953, with an armistice.</p>\n\n<p>“On this solemn anniversary, we remember the more than 500 Canadians who gave their lives during the Korean War so others could live in peace and security.</p>\n\n<p>“In the years following the armistice, almost 7,000 Canadians served in the United Nations Command and built on our veterans’ work toward peace and security in the Korean peninsula.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to pay tribute to our Korean War veterans. Their courageous efforts to defend the lives of South Koreans have built a lasting bond between our countries that continues to deepen today.”</p></div>\n      "
}