{
  "path": "/en/news/news-releases/2019/08/26/governor-general-canada-visit-netherlands-and-poland",
  "pageTitle": "Governor General of Canada to visit the Netherlands and Poland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to the Kingdom of the Netherlands and the republic of Poland, from August 30 to September 2, 2019.</p>\n\n<p>During her visit, the Governor General will meet with His Majesty King Willem-Alexander of the Netherlands, Prime Minister Mark Rutte of the Netherlands, and President Andrzej Duda of Poland. She will highlight the strong relationship Canada shares with both the Netherlands and Poland – ties that were strengthened during the Second World War. She will also underscore the importance of continued collaboration to defend the rules-based international order.</p>\n\n<p>In the Netherlands, the Governor General will attend an event in Terneuzen to commemorate the 75th anniversary of the Battle of the Scheldt. This battle was a major step in the liberation of the Netherlands and the end of the Second World War in Europe, in which Canada played a key role. Later, she will present the Sovereign’s Medal for Volunteers to Dutch recipients who have worked to preserve the memory of Canadian soldiers who served in the Second World War. She will also present a Meritorious Service Decoration to a Dutch captain who served alongside the Canadian Armed Forces.</p>\n\n<p>The Governor General will then travel to Poland, where she will attend an official ceremony in Warsaw marking 80 years since the beginning of the Second World War in the country. She will also present a Meritorious Service Decoration to a serving member of the Polish army. During her visit, she will tour the AstroCeNT Particle Astrophysics Science and Technology Centre and participate in a roundtable, where she will highlight Canada’s scientific collaboration with Poland and Europe.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada shares a strong relationship with both the Netherlands and Poland, based on our shared history and common values. Today, we work together to advance Euro-Atlantic security, and advance peace and stability around the world. This visit is a chance for the Governor General to discuss how we can work together to tackle our world’s most pressing issues – and build a more peaceful, prosperous future on both sides of the Atlantic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Governor General Julie Payette’s first official visit to both the Netherlands and Poland. The last Governor General to visit these two countries was the Right Honourable David Johnston in 2014.</li>\n\t<li>Canada and the Netherlands share a dynamic relationship, based on common values, strong commercial ties, and a rich military and royal history. Today, over one million people of Dutch origin reside in Canada.</li>\n\t<li>The Canada-Poland relationship has a strong historical foundation rooted in rich military cooperation and strong people-to-people ties. Today, more than one million people of Polish origin call Canada their home.</li>\n\t<li>The Canada-European Union Comprehensive Economic and Trade Agreement (CETA) provides opportunities to strengthen the bilateral economic relationship with both countries. Over the first year that CETA was in force, Canada’s two-way trade increased by 30.2 percent with the Netherlands and 7.2 percent with Poland.</li>\n\t<li>Canada, the Netherlands, and Poland are active members of the United Nations, the World Trade Organization, NATO, the Organization for Security and Co-operation in Europe, the Organisation for the Prohibition of Chemical Weapons, and the various international judicial institutions headquartered in The Hague.</li>\n\t<li>The Sovereign’s Medal for Volunteers recognizes the exceptional volunteer achievements of individuals in a wide range of fields and pays tribute to the dedication and commitment of volunteers.</li>\n\t<li>The Meritorious Service Decorations recognize great Canadians for exceptional deeds that bring honour to our country. They recognize remarkable contributions in many different fields of endeavour, from advocacy initiatives and health care services, to research and humanitarian efforts.</li>\n\t<li>The AstroCeNT Particle and Astrophysics Science and Technology Centre, established as part of Poland’s International Research Agendas programme under the Foundation for Polish Science, is an interdisciplinary centre pursuing research in particle astrophysics, with a special focus on dark matter and gravitational waves.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Netherlands Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/poland-pologne/bilateral_relations_bilaterales/canada-poland-pologne.aspx?lang=eng\">Canada – Poland Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/history/second-world-war/scheldt\">The Second World War – The Scheldt</a></li>\n\t<li><a href=\"https://www.gg.ca/en/honours/canadian-honours/sovereigns-medal-volunteers\">Sovereign’s Medal for Volunteers</a></li>\n\t<li><a href=\"https://www.gg.ca/en/honours/canadian-honours/meritorious-service-decorations-civil-division\">Meritorious Service Decorations (Civil Decision)</a></li>\n</ul></div>\n      "
}