{
  "path": "/en/news/statements/2017/12/14/statement-prime-minister-retirement-chief-justice-canada-beverley",
  "pageTitle": "Statement by the Prime Minister on the retirement of Chief Justice of Canada Beverley McLachlin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the retirement of the Right Honourable Beverley McLachlin, Chief Justice of Canada:</p><p>“Today, I join all Canadians to express our sincere gratitude to the Right Honourable Beverley McLachlin, Chief Justice of Canada, on her well-deserved retirement.</p><p>“Chief Justice McLachlin’s accomplishments as a jurist are unparalleled in our country’s history. Appointed to the Supreme Court in 1989 and named as Chief Justice in 2000, she is Canada’s longest serving Chief Justice and the first-ever woman to hold the office. During her career on our highest court, she heard over 2000&nbsp;cases, many of which touched on issues that directly impacted how we define ourselves as a country.</p><p>“Chief Justice McLachlin has championed diversity on the bench and the advancement of women in the legal profession. She resolutely protected judicial independence, as well as the role that a strong and impartial judiciary plays within a healthy and vibrant democracy.</p><p>“She has also shone a spotlight on the importance of access to justice, and advocated for timely access to representation, to courtrooms, and to legal processes for all Canadians.</p><p>“Raised in rural Alberta as the oldest of five siblings, Chief Justice McLachlin remained grounded and down-to-earth despite her meteoric rise through the judiciary since first being named to the bench in 1981. She understood that the law had to be meaningful and accessible to Canadians, and demonstrated this through judicial decisions written in clear, understandable language. She also appreciated the need for the law to evolve to respond to the needs of a changing society, and knew that, for public trust to be maintained, the law and the judiciary had to be relevant to the people they serve.</p><p>“On behalf of the Government of Canada, I thank Chief Justice McLachlin for her long and dedicated service, and for being the trailblazer that this country needed. We are a better country, and a more just society, thanks to her service. We wish her all the best in her retirement.”</p></div>\n      "
}