{
  "path": "/en/news/statements/2022/11/05/statement-prime-minister-veterans-week",
  "pageTitle": "Statement by the Prime Minister on Veterans’ Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Veterans’ Week, which runs from November 5 to 11, 2022:</p>\n\n<p>“Today marks the beginning of <a href=\"https://www.veterans.gc.ca/eng/remembrance/commemorative-events/veterans-week\">Veterans’ Week</a>, an opportunity to honour all the brave Canadians who have served our country and defended the values we hold dear.</p>\n\n<p>“This year marks the 105th anniversaries of the Battle of Vimy Ridge and the Battle of Passchendaele during the First World War, the 80th anniversary of the Dieppe Raid during the Second World War, the 70th anniversary of heavy fighting at Hill&nbsp;355 during the Korean War, and the 30th anniversary of the beginning of the United Nations Protection Force peace support efforts in the Balkans.</p>\n\n<p>“In times of war, in military conflicts, and in times of peace, we have counted on our women and men in uniform. Time and time again, Canadian Veterans and their families have stepped up for us, and we must step up for them. That’s why the Government of Canada will continue to make sure our Veterans are supported.&nbsp;We stepped up to help preserve Juno Beach in France when its integrity was threatened by a proposed condominium development. We are helping cover the costs of mental health care for Veterans with post-traumatic stress, depressive, or anxiety disorders while their disability benefit applications are being processed. We will continue to help ensure Veterans and their families can access the support they need, when they need it. No one should have to wait for the help they need.</p>\n\n<p>“We all have a duty to remember and honour the sacrifices of all those who have answered the call to serve. This week, I encourage all Canadians to read and share their stories on social media using #CanadaRemembers, and to show our support by wearing a poppy close to our hearts. To all those who have put their lives on the line so we may know peace and freedom: we will forever be in your debt.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}