{
  "path": "/en/news/statements/2019/06/08/statement-prime-minister-world-oceans-day",
  "pageTitle": "Statement by the Prime Minister on World Oceans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Oceans Day:</p>\n\n<p>“From the air we breathe and the food we eat, to the land we call home – oceans are essential to sustaining life on our planet.</p>\n\n<p>“We know first‑hand the benefits of healthy waters, and the consequences of what happens when we neglect them. Illegal fishing, pollution, and climate change harm the oceans we need to survive.</p>\n\n<p>“Today, on&nbsp;World Oceans Day, we are all called to do more to protect our oceans and coastal communities. If we fail to act now, we risk losing more than we can measure in a science lab or an environmental report. Climate change is real, and people here in Canada and around the world are already facing its devastating effects.</p>\n\n<p>“Our coastal communities are the first to feel the impacts of increasing global temperatures – from floods and hurricanes, to rising sea levels and melting sea ice, to depleted fish stocks and the loss of jobs. The&nbsp;<a href=\"https://www.ipcc.ch/sr15/\">Intergovernmental Panel on Climate Change</a>&nbsp;report last fall and the more recent report on&nbsp;<a href=\"https://changingclimate.ca/CCCR2019/\">Canada’s Changing Climate</a>&nbsp;force us to face a stark reality: without immediate action, we will not be able to protect the plants, animals, and habitats that we all depend on from the effects of climate change.</p>\n\n<p>“The Government of Canada is taking action to preserve and restore our marine ecosystems. Through the historic&nbsp;<a href=\"https://www.tc.gc.ca/eng/report-canadians-investing-coasts-oceans-protection-plan.html\">Oceans Protection Plan</a>, we have made progress on keeping our waters safe and our coasts clean. We have already protected 8 per cent of marine and coastal areas nationwide, up from less than 1 per cent in 2015. We are on track to protect 10 per cent of these areas by 2020. Last year, we announced additional funding to protect the habitats and food sources of endangered whale populations facing extinction. The funding will also address other threats to whales’ survival, including from noise disturbance and pollution.</p>\n\n<p>“From launching the&nbsp;<a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a>&nbsp;during our 2018 G7 Presidency – now supported by 21 governments and over 60 businesses and organizations – to co-hosting the Sustainable Blue Economy Conference with Kenya and Japan last November, Canada is taking a lead role internationally. At the Conference, we committed to strengthening science and research initiatives, promoting collaboration in sustainable partnerships and projects, and supporting global action that puts people and the environment at the heart of international development. We are also investing $100 million to help prevent plastic waste from entering the oceans, address plastic waste on shorelines, and better manage existing plastic resources in developing countries.</p>\n\n<p>“We all share the responsibility to keep our oceans, coasts, and seas healthy. It is the little things we can all do – like using fewer plastic bags and bottles, choosing more reusable packaging, and buying sustainable seafood – that can make a world of difference for our oceans. Today and every day, let’s do our part to protect them for future generations.”</p></div>\n      "
}