{
  "path": "/en/news/statements/2018/04/16/g7-leaders-statement-syria",
  "pageTitle": "G7 Leaders’ Statement on Syria | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, joined G7&nbsp;Leaders today to issue the following statement on Syria:</p><p>“We, the G7 Leaders of Canada, France, Germany, Italy, Japan, the United Kingdom, the United States of America and the European Union, are united in condemning, in the strongest possible terms, the use of chemical weapons in the April 7 attack in Eastern Ghouta, Syria.</p><p>“We fully support all efforts made by the United States, the United Kingdom and France to degrade the Assad regime’s ability to use chemical weapons and to deter any future use, demonstrated by their action taken on April 13. This response was limited, proportionate and necessary – and taken only after exhausting every possible diplomatic option to uphold the international norm against the use of chemical weapons.</p><p>“Use of chemical weapons is a breach of the Chemical Weapons Convention and constitutes a threat to international peace and security. The repeated and morally reprehensible use of chemical weapons by the Assad regime in the past has been confirmed by independent international investigators. We condemn this deliberate strategy of terrorizing local populations and forcing them into submission. Syria’s possession of chemical weapons and their means of delivery are illegal under UN Security Council Resolution 2118 and the Chemical Weapons Convention. We stand together against impunity for those who develop or use these weapons, anywhere, anytime, under any circumstances.</p><p>“We remain committed to a diplomatic solution to the conflict in Syria. We commend and support UN Special Envoy de Mistura’s efforts towards an inclusive and credible political transition in accordance with UN Security Council Resolution&nbsp;2254 and the Geneva Communiqué.”</p></div>\n      "
}