{
  "path": "/en/news/statements/2018/04/21/statement-prime-minister-92nd-birthday-her-majesty-queen-elizabeth-ii",
  "pageTitle": "Statement by the Prime Minister on the 92nd birthday of Her Majesty Queen Elizabeth II, Queen of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 92<sup>nd</sup> birthday of Her Majesty Queen Elizabeth II, Queen of Canada:</p><p>“Today, we join millions of people in Canada and around the world to celebrate the 92<sup>nd</sup> birthday of Her Majesty Queen Elizabeth II, Queen of Canada.</p><p>“Her Majesty has dedicated her life in service to the Commonwealth and its citizens. Since acceding to the throne in 1952, she has served with grace and strength. Many Canadians feel a warm affection for the Queen and a deep appreciation for her devotion to duty.</p><p>“I met with Her Majesty this week in London, as did many Commonwealth leaders from around the world. What was clear during our time together is that the affection and admiration so many ‎of us feel is equally shared by people from every corner of the world.</p><p>“Today, we celebrate the many milestones of our history in which the Queen played an important role. These include the 100<sup>th</sup> anniversary of the Fathers of Confederation’s meeting in Charlottetown in 1964, Canada’s centennial ceremonies in Ottawa in 1967, and the signing of the Proclamation of the <i>Constitution Act</i> on Parliament Hill in 1982. Through change and transformation, Her Majesty has stood with Canadians – unwavering in her commitment to Canada and its future.</p><p>“On behalf of the Government of Canada, Sophie and I wish Her Majesty a happy 92<sup>nd</sup> birthday. As Canadians, we have shared many special moments with Her Majesty and the Royal Family and we look forward to many more to come.”</p></div>\n      "
}