{
  "path": "/en/news/news-releases/2022/03/28/10-day-child-care-families-ontario",
  "pageTitle": "$10-a-day child care for families in Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and the Premier of Ontario, Doug Ford, today announced an agreement that will deliver affordable, inclusive, and high-quality child care for families in Ontario.</p>\n\n<p>This Canada-Ontario early learning and child care agreement is a five-year deal to reduce child care fees in the short term, deliver $10-a-day child care for Ontario families, and create 86,000 new licensed early learning and child care spaces in the province.</p>\n\n<p>The agreement will reduce licensed child care fees for children under six years old on average by 25 per cent as of April 1, 2022, saving Ontario families an average of about $2,200 per child. By the end of the year, fees will be further lowered, and families will see a total reduction of 50 per cent on average, saving them an average of about $6,000 per child per year. This agreement will deliver on average $10-a-day child care for Ontario families by the end of March 2026.</p>\n\n<p>With the signing of this agreement, the Government of Canada has signed agreements with every province and territory to deliver on its promise to build a Canada-wide affordable, inclusive, and high-quality early learning and child care system. Our plan is already making life more affordable for families, creating new jobs, getting parents back into the workforce, and growing the middle class while giving every child a real and fair chance at success. More than half of Canada’s provinces and territories have already seen reductions in child care fees and, by the end of 2022, average fees for regulated early learning and child care spaces will be cut in half across the country.</p>\n\n<p>This agreement will improve access to early learning and child care programs and services and grow a strong and skilled workforce of early childhood educators, including through better wages and greater opportunities for professional development. It will also support a child care system that is inclusive of vulnerable children and children from diverse populations, including children with disabilities and children needing enhanced or individual supports.</p>\n\n<p>In addition, the agreement includes a clear commitment to begin discussions with Indigenous partners on developing a collaborative plan that supports Indigenous children’s access to affordable, high-quality, and culturally appropriate early learning and child care.</p>\n\n<p>Building a child care system that works for Canadians in every region of the country is a key part of our plan to make life more affordable for families while creating good jobs and growing the economy. Through these signed agreements, the Government of Canada aims to create 250,000 new child care spaces across the country by March 2026 to give families affordable child care options, no matter where they live.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With the signing of today’s agreement, we’re making $10‑a‑day child care a reality for families across country. Today’s announcement will save Ontario families thousands of dollars each year – with fee reductions starting as of Friday this week – while creating jobs, growing the middle class, and giving our kids the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I’m so proud of the work we’ve done with our federal partners to land an agreement that will lower costs for families across the province. Given how complex Ontario’s child care system is, we wanted to get this right. Today, we’re delivering a deal that will keep money in the pockets of hard-working parents.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“A year ago, our government made a commitment to Canadians: to deliver affordable high-quality early learning and child care for young families across the country. Now that agreements have been reached with all provinces and territories, a cause championed by generations of forward-thinking Canadians is about to become reality. I am so pleased that today’s agreement delivers our promise to Canadians to make life more affordable for young families, create jobs, increase women's participation in the workforce and give every child the best possible start in life – no matter where they live.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s historic agreement with Ontario means that all families in Canada now have access to the Canada-wide Early Learning and Child Care system. This is a momentous occasion based on the shared goal that every child deserves the best possible start in life. Our vision and objectives for early learning and child care are quite simple: reduce child care fees, create more spaces, ensure equitable access for all children, and grow a strong and skilled early childhood educator workforce. This agreement is an important step in ensuring that all families have access to high-quality, affordable, flexible, and inclusive child care.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since last summer, the Government of Canada reached similar agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta\">Alberta</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/13/10-day-child-care-families-new-brunswick\">New Brunswick</a>, the&nbsp;<a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/15/10-day-child-care-families-northwest-territories\">Northwest Territories</a>, and <a href=\"https://pm.gc.ca/en/news/news-releases/2022/01/24/10-day-child-care-families-nunavut\">Nunavut</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> to strengthen the early learning and child care system in the province.</li>\n\t<li>In total, the Government of Canada is aiming to create approximately 250,000 new child care spaces through Canada-wide agreements with provinces and territories, and already achieved its goal of creating 40,000 more affordable child care spaces before 2020 through the 2017-18 and 2019-20 Early Learning and Child Care Agreements. These new spaces will be predominantly among licensed not-for-profit, public, and family-based child care providers.</li>\n\t<li>Through this agreement, Ontario will receive $10.2&nbsp;billion in federal funding through 2025-26 and an additional $2.9 billion in 2026-27, as part of the annual and ongoing $9.2 billion federal commitment from Budget 2021 for a total of $13.2 billion, to underscore the long-term commitment to building a better early learning and child care system, subject to the renewal of the agreement.</li>\n\t<li>In addition to the federal contribution, Ontario will provide $267&nbsp;million under this new agreement in addition to the over $2&nbsp;billion the province currently invests in early learning and child care annually.</li>\n\t<li>The governments of Canada and Ontario will create an implementation committee that will monitor progress on child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>As part of Budget&nbsp;2021, the Government of Canada made a transformative investment of over $27&nbsp;billion over five years to build the Canada-wide Early Learning and Child Care system with provinces and territories. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Investments in child care will benefit everyone across Canada. Studies show that for every dollar invested in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n</ul></div>\n      "
}