{
  "path": "/en/news/statements/2017/07/01/statement-prime-minister-canada-day",
  "pageTitle": "Statement by the Prime Minister on Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada Day:</p><p><span lang=\"EN\" xml:lang=\"EN\">“Today, we celebrate the 150<sup>th</sup> anniversary of Confederation. We come together as Canadians to celebrate the achievements of our great country, reflect on our past and present, and look boldly toward our future.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Canada’s story stretches back long before Confederation, to the first people who worked, loved, and built their lives here, and to those who came here centuries later in search of a better life for their families. In 1867, the vision of Sir George-Étienne Cartier and Sir John A. Macdonald, among others, gave rise to Confederation – an early union, and one of the moments that have come to define Canada.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“In the 150 years since, we have continued to grow and define ourselves as a country. We fought valiantly in two world wars, built the infrastructure that would connect us, and enshrined our dearest values – equality, diversity, freedom of the individual, and two official languages – in the <i>Charter of Rights and Freedoms</i>. These moments, and many others, shaped Canada into the extraordinary country it is today – prosperous, generous, and proud.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“At the heart of Canada’s story are millions of ordinary people doing extraordinary things. They exemplify what it means to be Canadian: ambitious aspirations, leadership driven by compassion, and the courage to dream boldly. Whether we were born here or have chosen Canada as our home, this is who we are.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Ours is a land of Indigenous Peoples, settlers, and newcomers, and our diversity has always been at the core of our success. Canada’s history is built on countless instances of people uniting across their differences to work and thrive together. We express ourselves in French, English, and hundreds of other languages, we practice many faiths, we experience life through different cultures, and yet we are one country. Today, as has been the case for centuries, we are strong not in spite of our differences, but because of them.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“As we mark Canada 150, we also recognize that for many, today is not an occasion for celebration. Indigenous Peoples in this country have faced oppression for centuries. As a society, we must acknowledge and apologize for past wrongs, and chart a path forward for the next 150 years – one in which we continue to build our nation-to-nation, Inuit-Crown, and government-to-government relationship with the First Nations, Inuit, and Métis Nation.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Our efforts toward reconciliation reflect a deep Canadian tradition – the belief that better is always possible. Our job now is to ensure every Canadian has a real and fair chance at success. We must create the right conditions so that the middle class, and those working hard to join it, can build a better life for themselves and their families. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Great promise and responsibility await Canada. As we look ahead to the next 150 years, we will continue to rise to the most pressing challenges we face, climate change among the first ones. We will meet these challenges the way we always have – with hard work, determination, and hope. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“</span>On the 150<sup>th</sup> anniversary of Confederation, we celebrate the millions of Canadians who have come together to make our country the strong, prosperous, and open place it is today. <span lang=\"EN\" xml:lang=\"EN\">On behalf of the Government of Canada, I wish you and your loved ones a very happy Canada Day.”</span></p></div>\n      "
}