{
  "path": "/en/news/readouts/2020/05/28/prime-minister-justin-trudeau-speaks-permanent-representatives-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Permanent Representatives of the United Nations’ Latin American and Caribbean Group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Permanent Representatives of the United Nations’&nbsp;Latin American&nbsp;and&nbsp;Caribbean&nbsp;Group&nbsp;to discuss Canada’s candidacy to serve on the United Nations Security Council (UNSC) for 2021-2022.</p>\n\n<p>The Prime Minister&nbsp;highlighted&nbsp;the strong ties between Canada and&nbsp;countries&nbsp;in&nbsp;Latin America&nbsp;and&nbsp;the&nbsp;Caribbean. He recognized the&nbsp;important&nbsp;contributions&nbsp;of&nbsp;Canadians of Latin American or Caribbean descent&nbsp;to&nbsp;a strong and diverse Canada. The Prime Minister&nbsp;spoke of&nbsp;the&nbsp;strong trade ties between Canada and the region&nbsp;and the&nbsp;importance that Canada&nbsp;attaches&nbsp;to&nbsp;maintaining the integrity of global supply chains as a means of increasing global economic security and prosperity.</p>\n\n<p>The Prime Minister reiterated Canada’s commitment to be a productive and collaborative UNSC member, focused on working&nbsp;in an open and transparent way&nbsp;to address complex global issues&nbsp;and&nbsp;strengthen&nbsp;the&nbsp;rules-based&nbsp;international order. He pointed to the challenge posed by the COVID-19 pandemic, noting the importance of multilateral cooperation in addressing the health and economic impacts of the pandemic, and the central role of the United Nations in the international response.</p>\n\n<p>Prime Minister Trudeau spoke of Canada’s efforts to support the fight against climate change,&nbsp;a threat&nbsp;that&nbsp;is already having significant&nbsp;impacts in Latin American and Caribbean countries. He noted&nbsp;the importance Canada attaches&nbsp;to&nbsp;economic security in the face of climate-related challenges.&nbsp;The Prime Minister also expressed concern over the&nbsp;deepening&nbsp;humanitarian crisis&nbsp;in Venezuela&nbsp;and the millions of&nbsp;Venezuelans who have fled their country,&nbsp;agreeing&nbsp;that the solution to the crisis must be a peaceful one.</p>\n\n<p>The Prime Minister and the Permanent Representatives&nbsp;exchanged views on&nbsp;regional and global priorities such as climate action, gender equality,&nbsp;peacebuilding and peacekeeping, and&nbsp;strengthened&nbsp;multilateralism. They spoke of the role that Canada can play in bringing these priorities to the forefront of&nbsp;discussions at the&nbsp;United Nations Security Council.</p>\n\n<p>As Canada pursues its candidacy for election to the United Nations Security Council for 2021-2022, we will continue to advance shared interests to benefit people and businesses in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/campaign-campagne/unsc-csnu/index.aspx?lang=eng\">Canada: UN Security Council Candidate 2021-2022</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/26/prime-minister-join-secretary-general-and-prime-minister-jamaica\">Prime Minister to join UN Secretary General and the Prime Minister of Jamaica to convene high-level meeting to address economic devastation caused by COVID‑19</a></li>\n</ul></div>\n      "
}