{
  "path": "/en/news/readouts/2022/10/25/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Ethiopia, Abiy Ahmed, about the ongoing conflict in northern Ethiopia.</p>\n\n<p>Prime Minister Trudeau expressed his deep concern about the deteriorating situation in Tigray, including the worsening humanitarian situation and renewed military action. The Prime Minister called for the immediate cessation of hostilities and implementation of&nbsp;measures to ensure unhindered access to and delivery of humanitarian assistance for those affected by the conflict.</p>\n\n<p>The Prime Minister underscored the importance of African Union-led peace talks that began today in South Africa and commended Prime Minister Abiy for his commitment to engage his government in the negotiations. The Prime Minister reaffirmed Canada’s support for a peaceful resolution to the conflict that ensures&nbsp;respect for human rights and the protection of civilians.</p>\n\n<p>The leaders discussed rising food security challenges around the world and in the region. The Prime Minister underscored Canada’s commitment to helping address the global challenges stemming from Russia’s illegal and unjustifiable invasion of Ukraine, including by providing assistance to help address global food insecurity. The two leaders exchanged views on the importance of continued reforms for inclusive and sustainable growth benefiting all citizens, as laid out in the Ethiopian Homegrown Economic Reform Agenda.</p>\n\n<p>The leaders agreed to keep in touch in support of efforts for peace, stability, security, and sustainable development in Ethiopia and across the region.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ethiopia-ethiopie/index.aspx?lang=eng\">Canada and Ethiopia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/21/african-union-commission-chairperson-moussa-faki-mahamat-visit-canada\">African Union Commission Chairperson Moussa Faki Mahamat to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/06/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed\">Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}