{
  "path": "/en/news/readouts/2022/07/05/prime-minister-justin-trudeau-meets-mayor-toronto-john-tory",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Toronto John Tory | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of Toronto, John Tory.</p>\n\n<p>The two leaders spoke of the important role that cities like Toronto have played in managing the pandemic across the country and discussed existing federal investments in public transit projects. The Prime Minister reiterated the Government of Canada’s commitment to be a key&nbsp;partner to meet the infrastructure needs of municipalities, including through the permanent public transit fund launched in 2021 and other federal programs.</p>\n\n<p>Prime Minister Trudeau and Mayor Tory discussed federal investments under the National Housing Strategy to fund new housing projects and increase housing supply, and stressed the need for continued mental health services in communities.</p>\n\n<p>The Prime Minister underscored the importance of working in partnership with municipal partners from coast to coast to coast. The two leaders looked forward to continuing to work together on the priorities they discussed and other issues of importance to the people of Toronto and Ontario, and to all Canadians.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">COVID-19: Canada’s response</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/10/new-public-transit-investments-build-strong-communities-fight-climate\">New public transit investments to build strong communities, fight climate change, and create new jobs across Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/20/making-housing-more-affordable-canadians\">Making housing more affordable for Canadians</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.placetocallhome.ca/\">National Housing Strategy</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/public-health/topics/mental-health-wellness.html\">Mental health and wellness</a></li>\n</ul></div>\n      "
}