{
  "path": "/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce",
  "pageTitle": "Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and Inuit leaders signed a declaration today in Iqaluit to create the Inuit-Crown Partnership Committee. The Inuit Nunangat Declaration demonstrates the shared commitment to a renewed Inuit-Crown relationship between Inuit Tapiriit Kanatami and the Government of Canada, and underscores the common goal of creating prosperity for all Inuit, which benefits all Canadians.</p><p>The Committee will advance shared priorities between Inuit and the Government of Canada, including the implementation of Inuit land claims agreements, social development, and reconciliation between Inuit and the Government of Canada. The Committee will monitor and report back on progress on advancing these priorities moving forward.&nbsp;</p><p>As the new Inuit-Crown relationship moves forward, immediate action will be taken to address painful memories of the past, including relocations and the treatment of Inuit during the tuberculosis epidemic of the 1940s-60s.</p><h2>Quotes</h2><blockquote><p>“Last December, I promised that federal ministers and Inuit leaders would meet regularly to tackle important issues. Today, we’re making good on that pledge by signing the Inuit Nunangat Declaration with our Inuit partners. While much remains to be done to address the unique social, cultural, economic, and environmental issues that Inuit face every day, we will move forward together, based on a respectful, renewed Inuit-Crown relationship, for the benefit of all Canadians.”<br> <em>–</em><cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Inuit-Crown Partnership Committee will play an important role as we take action on the priorities that matter to Inuit and Canadians. This committee will enhance cooperation between Inuit Tapiriit Kanatami and the federal government, allowing us to continue renewing the relationship between Inuit and the Crown in a sustainable and positive way.”&nbsp;<br> <em>–</em><cite>Natan Obed, President of Inuit Tapiriit Kanatami</cite></p></blockquote><h2>&nbsp; Quick Facts</h2><ul><li>The Committee includes the Prime Minister and select federal ministers, President Natan Obed on behalf of Inuit Tapiriit Kanatami, Chair/CEO Duane Smith on behalf of the Inuvialuit Regional Corporation, President Aluki Kotierk on behalf of Nunavut Tunngavik Inc., President Jobie Tukkiapik on behalf of Makivik Corporation, and President Johannes Lampe on behalf of the Nunatsiavut Government.</li><li>The Committee also includes the presidents of the National Inuit Youth Council, Pauktuutit Inuit Women of Canada, and the Inuit Circumpolar Council Canada as observers.&nbsp;</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">Inuit Nunangat Declaration on Inuit-Crown Partnership</a></li><li><a href=\"/en/news/statements/2017/02/09/ᐃᓄᐃᑦ-ᓄᓇᖓᓂᕐᒥᐅᑦ-ᓱᓕᓂᕋᕈᑎᖏᑦ-ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ-ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ\">ᐃᓄᐃᑦ ᓄᓇᖓᓂᕐᒥᐅᑦ ᓱᓕᓂᕋᕈᑎᖏᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ</a> (declaration in Inuktitut)</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples</a></li><li><a href=\"https://www.aadnc-aandc.gc.ca/eng/1100100014187/1100100014191\">Indigenous and Northern Affairs Canada - Inuit</a></li><li><a href=\"https://www.itk.ca/\">Inuit Tapiriit Kanatami</a></li></ul></div>\n      "
}