{
  "path": "/en/news/news-releases/2018/05/12/prime-minister-welcomes-voltigeurs-de-quebec-modernized-armoury",
  "pageTitle": "Prime Minister welcomes the Voltigeurs de Québec to modernized Armoury | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>National historic sites reflect the rich heritage of our country and provide an opportunity for Canadians to learn more about our diversity, history, and culture. The Voltigeurs de Québec Armoury is an important landmark of the city. Its reconstruction not only commemorates our Army’s proud history and celebrates our armed forces, it will also create good jobs for years to come.</p><p>The Prime Minister, Justin Trudeau, today welcomed the Voltigeurs de Québec regiment to their new Armoury, which was rebuilt following a fire in 2008. The new building combines modernism with heritage in a space that is energy efficient and environmentally friendly.</p><p>The Government of Canada invested approximately $104 million in the reconstruction of the Armoury, which created close to 700 jobs during the project. In addition to being used for administrative and ceremonial purposes by the Voltigeurs, the new Armoury now includes a large multipurpose space that is available for the general public to host community, cultural, and social events. The additional space has helped modernize this historic building and will continue to support middle-class jobs in Quebec City’s hospitality and events sector.</p><h2>Quotes</h2><blockquote><p>“Today, we celebrate the official return of the Voltigeurs de Québec – the oldest French-Canadian regiment still in existence – to their new home. The Armoury transformation showcases how historical sites can be brought into the 21<sup>st</sup>&nbsp;century and meet modern environmental standards, while maintaining their architectural integrity. I know this Armoury will remain an important landmark in Québec, and continue to serve the regiment and the community.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"Today is an important occasion for the Voltigeurs de Québec and for the city. Rebuilding and expanding this historic place will ensure that you have the resources needed today, while encouraging future generations to join the profession of arms tomorrow. We want to thank all the Canadian Armed Forces members in Quebec City, here in the region, and right across the country, for your continued dedication and your exemplary service.”<br><cite>—The Hon. Harjit S. Sajjan, Minister of National Defence</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Les Voltigeurs de Québec is a reserve infantry unit in the Canadian Armed Forces. The regiment is based in Quebec City, and includes 252 members, including a 35‑member band. The regiment has a long and proud list of Battle Honours that includes the most recent addition of “Afghanistan.”</li><li>In April 2008, the original Voltigeurs de Québec Armoury was damaged by a fire that forced the regiment to move to a temporary site.</li><li>Public consultations with the local community were held to help develop the plan for the new Armoury. The project sought to minimize the overall cost of the building’s reconstruction and operation, while maximizing energy efficiency and preserving the building’s original architectural integrity.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/public-services-procurement/news/2018/04/the-voltigeurs-de-quebec-armoury-inaugurated-heritage-meets-modernism.html\">The Voltigeurs de Québec Armoury inaugurated: Heritage meets modernism</a></li><li><a href=\"http://www.army-armee.forces.gc.ca/en/voltigeurs-quebec/index.page\">Les Voltigeurs de Québec</a></li></ul></div>\n      "
}