{
  "path": "/en/news/news-releases/2018/04/30/amazon-creates-thousands-new-jobs-vancouver",
  "pageTitle": "Amazon creates thousands of new jobs in Vancouver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From shopping and banking, to planning events and getting directions, Canadians rely on online services and applications every day‎. They improve our quality of life, drive innovation and technological advancement, and create new opportunities for the middle class and people working hard to join it.</p><p>The Prime Minister, Justin Trudeau, today welcomed Amazon’s announcement that it will create 3,000 new jobs in Vancouver. Combined with the 1,000 new jobs announced by Amazon in November 2017, this will bring the company’s workforce in Canada to over 9,000&nbsp;employees.</p><p>Canada is known for its excellent post-secondary institutions and robust high-tech sector, which produce top-tier talent in science, technology, engineering, and mathematics. Amazon’s expansion will help Canada develop and retain talented students and professionals, create good, well-paying middle class jobs, and grow our economy.</p><h2><b>Quote</b></h2><blockquote><p>“Today’s announcement is a testament to Canada’s highly-skilled, diverse workforce and tremendous potential as an innovation and tech hub. Tech talent and investment are coming to our country in record numbers, and companies like Amazon are bringing even more energy, vision – and thousands of good jobs – to Canada. We are proud to champion these companies, who invest in our talent and the future of our economy, and create new opportunities for Canadians to succeed.<br> — <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><b>Quick Facts</b></h2><ul><li>Amazon is an e-commerce and cloud computing company offering a range of products and services through its online properties. The company currently employs over 4,100 people in Canada, with offices in Vancouver, Toronto, and Ottawa. It also operates six automated centres in other locations across the country.</li><li>The 3,000 new jobs will be in fields including e-commerce technology, cloud computing, and machine learning.</li><li>Amazon will expand into a brand new location in QuadReal’s The Post redevelopment when the project opens in 2022. Amazon’s future 416,000 square foot Development Centre will sit above the former central Canada Post building, a city landmark.</li><li>Amazon is considering Toronto as a location for its second headquarters.</li><li>Prime Minister Trudeau met with Amazon Chief Executive Officer Jeff Bezos on several occasions, including during his visit to San Francisco in February 2018, where he promoted Canada’s diverse and skilled workforce.</li><li>The Government of Canada’s Innovation and Skills Plan, launched in Budget 2017, has introduced policies and programs to create high-quality jobs for Canadians and make Canada a global centre for innovation.</li><li>Last year, Canada launched a $125 million <a href=\"https://www.cifar.ca/assets/pan-canadian-artificial-intelligence-strategy-overview/\">Pan-Canadian Artificial Intelligence Strategy</a> to retain and attract top academic talent, and to increase the number of post-graduate trainees and researchers studying artificial intelligence and deep learning.</li><li>The Government of Canada recently launched Invest in Canada, a new federal organization dedicated to attracting job-creating investment and simplifying the process for global businesses looking to make Canada their new home.</li></ul><h2><b>Associated Links</b></h2><ul><li><a href=\"https://www.newswire.ca/news-releases/amazon-announces-plans-to-open-new-office-in-vancouver-and-create-1000-jobs-654972153.html\">Amazon announces plans to open new office in Vancouver and create 1,000 jobs</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2018/03/government-of-canada-launches-invest-in-canada-to-attract-global-investment-and-create-jobs.html\">Government of Canada launches Invest in Canada to attract global investment and create jobs</a></li></ul></div>\n      "
}