{
  "path": "/en/news/news-releases/2019/04/05/historic-investments-improve-affordable-housing-toronto",
  "pageTitle": "Historic investments to improve affordable housing in Toronto | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves to have a safe and affordable place to call home. That is why the Government of Canada launched Canada’s very first National Housing Strategy – a once-in-a-generation investment to fight homelessness and improve access to affordable housing for Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a new $1.3 billion partnership with the City of Toronto – the largest federal housing investment with a municipal partner in Canadian history– to support the renovation of more than 58,000 affordable housing units. The renovations, scheduled to begin in spring 2019, will ensure that these units remain available to those who need an affordable place to live, while improving living conditions, safety, accessibility, and comfort for tenants, and making the units more energy efficient.</p>\n\n<p>In Budget 2019, the government also announced measures to make it easier for more Canadians to buy their first home, including increasing the Home Buyers’ Plan withdrawal limit from $25,000 to $35,000. This measure will provide first-time home buyers with greater access to their Registered Retirement Savings Plan savings to buy a home. The Budget also proposes the new First-Time Home Buyer Incentive, where eligible first-time home buyers could share a part of the cost of buying a home with the Canada Mortgage and Housing Corporation (CMHC), reducing the size of their insured mortgage and lowering their monthly mortgage payments.</p>\n\n<p>By making smart investments in housing initiatives that put people first, the Government of Canada is making it easier and more affordable for more Canadians to rent or buy a home, while keeping markets accessible for future generations.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All parents want to give their children the best possible start in life, and that starts with making sure they have a safe and comfortable home. Today’s announcement is about investing in the people of Toronto, and giving them the opportunity they deserve to build bright futures for themselves, their families, and their communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“More than 58,000 Toronto families will have an improved, safe and affordable place to call home thanks to today’s announcement. This is the largest federal housing investment with a municipal partner in Canadian history and it builds on our Government’s commitment to restore the federal leadership in housing through the National Housing Strategy.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development and Minister responsible for Canada Mortgage and Housing Corporation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today's announcement is a clear example the federal government is back in housing. The City of Toronto has been working on a solution to TCHC repair backlog for a decade. I am so proud to be part of a Government that's delivering real support for thousands of Toronto families.”</p>\n\n<footer class=\"default\">Adam Vaughan, Parliamentary Secretary to the Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“I want to thank Prime Minister Trudeau and Minister Duclos for the $1.3 billion commitment to Toronto Community Housing repairs in 1,500 buildings across the city. This investment will ensure more families have access to good homes and it will help make so many communities across Toronto even stronger. It represents the very best of how our governments can work together to get things done for our residents.”</p>\n\n<footer class=\"default\">John Tory, Mayor of Toronto</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This investment in Toronto is part of CMHC’s $13.2 billion National Housing Co-Investment Fund, an initiative under the National Housing Strategy and the Investing in Canada Plan, and the largest program of its kind in Canadian history.</li>\n\t<li>The units being renovated are managed by the Toronto Community Housing Corporation, the largest social housing provider in Canada, and second largest in North America.</li>\n\t<li>The $1.3 billion partnership with the City of Toronto is in addition to the $4.2 billion Canada-Ontario Bilateral Agreement under the National Housing Strategy.</li>\n\t<li>As part of the agreement with the City of Toronto, the Government of Canada will provide $810 million in loans and $530 million in contributions over a 10-year period.</li>\n\t<li>The National Housing Co-Investment Fund provides low-cost loans and financial contributions to support and develop affordable housing that is energy efficient and accessible.</li>\n\t<li>Through the National Housing Co-Investment Fund, in addition to making renovations to existing affordable housing spaces, the Government of Canada will work with partners to build up to 60,000 new affordable homes, and repair up to 240,000 existing affordable and community homes across Canada over the next 10 years.</li>\n\t<li>In 2017, the Government of Canada announced a 10-year National Housing Strategy that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. The strategy sets clear goals to remove 530,000 Canadians from housing need.</li>\n\t<li>Additionally, the Strategy will protect the affordability of 385,000 existing housing units, repair 300,000 homes, build another 100,000, and provide direct support for those in housing need.</li>\n\t<li>The First-Time Home Buyer Incentive, administered by the CMHC, would help eligible Canadians with a household income under $120,000 per year afford to buy their first home.</li>\n\t<li>Through the new Incentive, the CMHC would provide 5 per cent of the value of a home for a first-time homebuyer through a shared investment.</li>\n\t<li>To encourage the construction of new housing supply, the Incentive would increase to 10 per cent for a newly-built home.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.placetocallhome.ca/\" tabindex=\"107\">Canada’s National Housing Strategy</a></li>\n\t<li><a href=\"https://budget.gc.ca/2019/docs/themes/housing-logement-en.html#improving-affordability-today-support-for-first-time-home-buyers\" tabindex=\"108\">Improving Affordability Today: Support for First-Time Home Buyers</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs/co-investment-fund---new-construction-stream\" tabindex=\"109\">National Housing Co-Investment Fund</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\" tabindex=\"110\">Investing in Canada: Canada’s Long-Term Infrastructure Plan</a></li>\n</ul></div>\n      "
}