{
  "path": "/en/news/news-releases/2021/07/14/supporting-renewable-energy-manufacturing-quebec-create-jobs-and",
  "pageTitle": "Supporting renewable energy manufacturing in Quebec to create jobs and build a cleaner future | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Climate change is one of the greatest challenges of our times, but it is also one of the greatest economic opportunities for our workers. That is why, as we work to finish the fight against COVID-19, the Government of Canada continues to take action to support the development of clean technology, so we can strengthen our economy, grow the middle class, create jobs, and build back better for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will collaborate with the Government of Quebec and LM&nbsp;Wind&nbsp;Power, a GE Renewable Energy company, to pursue an over $160-million project that will help the company expand its wind turbine blades manufacturing facility in Gaspé, Quebec. The Government of Canada will provide up to $25&nbsp;million for the project which, once completed, will create up to 200 new highly-skilled jobs and maintain approximately 380 additional&nbsp;jobs for Canadian workers.</p>\n\n<p>Today’s announcement will help increase Canada’s expertise in the area of clean energy technology and will support the reduction of pollution around the world. It is also an example of how working with companies like LM&nbsp;Wind&nbsp;Power can help them meet the demands of global consumers for low-carbon goods and services.</p>\n\n<p>As the world turns to clean technologies, the Government of Canada will continue to make investments that support Canadian workers and businesses, create jobs, grow the middle class, and build a cleaner future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Investments in clean technologies, including wind power, help reduce pollution and create good middle class jobs. Today’s partnership in Gaspé will support innovation, position our country as a leader in renewable energy, and ensure a strong, clean economic recovery. We will continue supporting Canadian workers, businesses, and communities in Quebec and across the country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians need a strong recovery and good jobs that will survive the test of time; that means a green recovery. Our government is here to help Canadian workers and businesses seize the opportunities created by markets demanding clean energy solutions. Today’s announcement to cooperate with LM Wind Power in their project to expand their wind turbine blades facility will help position Canada as a global leader in green energy technology, while creating good jobs in the Gaspésie region.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“GE believes climate change is an urgent global priority. We are pleased to be working with committed partners, like Canada, to provide the myriad technology solutions that will be required for the world to meet its net-zero commitments. The plant expansion aligns perfectly with Canadian and Quebec government policy and economic ambitions, and we are pleased to partner with them on an initiative that underscores the ability of the U.S. and Canada to work together to address the urgent global crisis of climate change.”</p>\n\n<footer class=\"default\">Heather Chalmers, President and CEO, GE Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are committed to helping our customers lead the energy transition by supplying them with state-of-the-art wind turbine blades that enable them to produce clean, renewable energy as sustainably and efficiently as possible. Our existing employees are proud to support this important work and our new colleagues can have confidence that they will receive the training and support they need to contribute to this effort in a state of the art manufacturing facility.”</p>\n\n<footer class=\"default\">Alexandre Boulay, Head of Operations Americas, LM Wind Power</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>LM Wind Power is a Danish subsidiary of General Electric. At its expanded facility in Gaspé, the company will produce the world’s largest blades – 107 metres long – for markets in Europe and the U.S.</li>\n\t<li>LM Wind Power Canada has over 300 employees based in Gaspé, Quebec.</li>\n</ul>\n\n<ul>\n\t<li>The Government of Canada investment announced today is made through the Strategic Innovation Fund.</li>\n\t<li>The Government of Canada’s strengthened climate plan and Budget 2021 priorities identify the growth of clean energy technologies as a way to secure our clean industrial advantage and clean-growth future.</li>\n\t<li>The government is investing $8&nbsp;billion over seven years to accelerate decarbonization projects with large greenhouse gas (GHG) emitters, the transition to clean technologies, and Canada’s industrial transformation across all sectors.</li>\n\t<li>Clean technologies offer significant benefits to Canadians, from reduced electricity costs and clean air, to more than 211,000 well-paying jobs. They also contribute to reducing Canada’s environmental impacts while helping to meet our emission-reduction targets.</li>\n\t<li>Clean technologies contributed more than $28.8&nbsp;billion to the Canadian economy in 2019, including the export of approximately $7.05&nbsp;billion worth of clean technology goods and services.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/12/a-healthy-environment-and-a-healthy-economy.html\">Strengthened Climate Plan: A Healthy Environment and a Healthy Economy</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap5\">Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n\t<li><a href=\"https://www.lmwindpower.com/\">LM Wind Power</a></li>\n</ul></div>\n      "
}