{
  "path": "/en/news/statements/2021/01/22/ta-koldere-nedhe-prime-minister-beyatie-si-ediri-ki-nitelas-tue-la-loche",
  "pageTitle": "T’ą Koldere Nedhé Prime Minister beyatıe sı ɂedırı k’ı́ Nı̨telas Tue La Loche, Saskatchewan dekałk’ath hudher hots’ı̨ 5 nęnę dųhų | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>T’ą K’oldheré Nedhe Prime Minister, Justin Trudeau, dųhų̨n dzı̨ne k’e yatı nedhe thełtsı̨ sı 5 nęnę hudher ɂeją La Loche, Saskatchewan dene kałk’eth nı̨ ghą ɂeją:</p>\n\n<p>“Duhųn dzı̨ne k’e sǫ́la nęnę hudher sı, t’aha k’ojąhıle dene hel nodher ɂeją La Loche, Saskatchewan, dı̨nı̨ dene Canadıans łeghąldé chų łęsdı̨ ɂeya haralyá nı̨. &nbsp;</p>\n\n<p>“Dųhų dzı̨ne k’e nuhexa dué sı̨ ɂeyı nodher t’á, Ɂeją Saskatchewan chu Canada nask’athé dene beł honaghesnı̨ sı neł t’ą dene besdółı̨ nı̨ benahonı̨ ha. T’ą dene beł due nodher ba dayaıłtı sı belot’ı̨ne chu t’ą ghą netą sı bası, t’ą hadaghı̨na chu t’ą dųhųn ts’ęn daghená ɂeyı t’anodher sı t’a ɂedırı nodher nı̨ ɂá. T’ą dene hotthé dene nakoghodı́ ha nı̨deł benahonı̨, Denededłı̨ne ɂeyer honaré dene ts’ı̨raı̨nı̨ hu, t’ą dene ɂası ɂa dene ts’eraı̨nı̨ chu t’ąt’u dene ts’eraı̨nı̨ Dene Hıgh School yısı dene hadaghı̨na ɂeyı t’anółdé ɂá.</p>\n\n<p>“Ɂeją Canada nask’athe dene dzıé łą naté ɂedırı nodher t’a yunı̨ sǫ́la nęnę t’oho ɂedırı nodher huk’é hu horelyų ɂeła sughua k’e nıdeł ha hok’enaraıdé ɂeyer hots’ı̨. Ɂeyer Nı̨telas tue dene naradé beghą nathıyá nı̨ beł ghı́da nı̨ chu t’ąt’u dene naratser chu ɂası due nodher dekulı t’ąt’u ɂeła hudéł ghesɂı̨h nı̨. Ɂeyı ɂa nęn t’ą ɂeyer norodé sı nenahonı̨ hası̨ t’anothúłdé sı ha. Nuhnı̨ t’ą Nıh ts’ęn k’oroı́ldé sı Government Canada hots’ı̨ nets’eraıdı́ ha ɂedırı ląt’e nodhı́ ch’a, norı́łtth’ągh ɂeyı due nodhı́ nadłı̨ hodorı́łɂı̨lé sı.</p>\n\n<p>“Horelyų Canada nask’athe dene ba sughua chu honejer hodorı́łɂı̨lé sı̨, ɂeją dene La Loche naradé sı tth’ı́ beł, yunı̨ nęnę hudher ɂedırı yatı nedhe thı́łtsı̨ nı̨ <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">kǫnełt’e tı̨łk’ıthe 1,500 ɂanełt’e ɂełk’ech’a</a> dene hadayéłya ha dué sı dųhųn, ɂeyı ląt’e tı̨łk’ıthé. Ku ɂeyı heł <a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2020/08/government-of-canada-is-responding-to-immediate-indigenous-mental-wellness-demands-during-the-covid-19-pandemic.html\">$82.5 million</a> tsamba nıt’ą nı̨ denededłı̨ne haralɂá dene nı̨h chu ɂeyı ląt’e ɂası ɂa dene ts’edı́ ha, chu dene ɂeyı ɂası hodorelɂı̨h de ba hoɂą ha. Dųhų dene heł ɂası k’enaı́de ha Denededłı̨ne heł, ɂełk’ech’a t’ą dene ha k’oldé tth’ı́ beł hu Dene godhé beba sughuá hoɂą ha yunadhé de. Ku ɂeją nané hoɂá t’ok’e dene naradé sı beł t’ąt’u sughua hoɂą nı̨t’á ha hok’enaıdé t’a hodorelɂı̨h sı bası. Ɂeła, t’ąt’u dene beł t’a due hoɂąsı sehenųt’a hadé chu ɂeją La Loche chu honezı dene t’ok’e naradé narałtı sı t’a hołé hoɂą hıłtsı dezą dųhų.</p>\n\n<p>“Ɂeyı ɂa nuhnı K’oroıldé Government Canada hots’ı̨, horelyų noreské sı Canada nask’athe hots’ı̨ dų dzı̨ne k’e t’ą dene La Loche naradé sı benółnı̨, t’ą łeghąldé chu hadaghı̨na sı ɂedırı nodher t’a dųhų ts’ęn bets’ıdı ha banáhonı̨ t’á.”</p></div>\n      "
}