{
  "path": "/en/news/statements/2020/04/21/statement-prime-minister-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement on Yom&nbsp;HaShoah:</p>\n\n<p>“On Yom HaShoah, or Holocaust Remembrance Day, we remember the six million innocent Jewish men, women, and children who were systematically murdered by the Nazis during the Holocaust. We also pay tribute to the bravery and resiliency of survivors, and of all those who risked their lives to save others, standing against the Nazi regime.</p>\n\n<p>“In response to the COVID-19 pandemic, we need to mark this day differently than we have in past years. With events and gatherings cancelled, Canadians can still observe Yom HaShoah by watching ceremonies online and participating in the <a href=\"https://www.yadvashem.org/downloads/name-reading-ceremonies.html\">Yad Vashem worldwide name-reading campaign</a> from home, and by lighting a memorial candle and reciting prayers in memory of the victims. As we do so, we make sure these experiences of loss and survival, and of unspeakable suffering and profound courage, are never forgotten.</p>\n\n<p>“This year, we marked the 75th anniversary of the liberation of Auschwitz-Birkenau. While decades have passed, our responsibility to remember the hard lessons of the Holocaust remains.</p>\n\n<p>“Sadly, acts of antisemitic violence are still frequent today and it is our solemn duty to stand united and vigilant against all forms of antisemitism, hatred, and discrimination. We must be clear: attacks against the Jewish community are attacks against all of us.</p>\n\n<p>“Last year, as part of Canada’s new Anti-Racism strategy, we adopted the International Holocaust Remembrance Alliance’s (IHRA) definition of antisemitism. Canada has also recommitted to the principles of the Declaration of the Stockholm International Forum on the Holocaust, and supported the adoption of the 2020 IHRA Ministerial Declaration.</p>\n\n<p>“Today—and every day—we stand with Jewish communities here in Canada and around the world to vow, ‘Never Again’.”</p></div>\n      "
}