{
  "path": "/en/news/news-releases/2018/08/28/prime-minister-formally-recognizes-territorial-senior-judges-chief",
  "pageTitle": "Prime Minister formally recognizes territorial senior judges as Chief Justices | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that senior judges in the territories will be formally recognized as Chief Justices, effective October 1, 2018.</p><p>The following senior judges will assume the title of Chief Justice:</p><ul><li>The Honourable Justice Ronald S. Veale, who has served as Senior Judge of the Supreme Court of Yukon since 2003.</li><li>The Honourable Justice Louise A. Charbonneau, who has served as Senior Judge of the Supreme Court of the Northwest Territories since 2015.</li><li>The Honourable Justice Neil A. Sharkey, who has served as Senior Judge of the Nunavut Court of Justice since 2016.</li></ul><h2>Quotes</h2><blockquote><p>“Territorial senior judges have always fulfilled the same duties to the court and to Canadians as their provincial chief justice counterparts. Starting October 1, territorial senior judges will be properly recognized as Chief Justices. This is about fairness and an equal recognition of roles and powers across the country.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Senior judges in the territories have always played an important and critical role in delivering justice in the North. Changing their title to Chief Justices removes a distinction that existed for too long between them and their counterparts in the provinces.”<br>—<cite>The Hon. Jody Wilson-Raybould, Minister of Justice and Attorney General of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The change in title for senior judges of the territorial superior trial courts was included in amendments to the <i>Judges Act,</i> which were introduced as part of the <i>Budget Implementation Act, No. 2.</i></li><li>In addition to the change in title, future Chief Justices of the territorial superior courts will also be appointed through the same process as their provincial counterparts.</li></ul><h2>Associated link</h2><ul><li><a href=\"https://www.canada.ca/en/department-justice/news/2017/11/government_of_canadadesignatesseniorjudgesintheterritoriesaschie.html\">Government of Canada Designates Senior Judges in the Territories as Chief Justices</a></li></ul></div>\n      "
}