{
  "path": "/en/news/news-releases/2018/05/03/prime-minister-announces-closer-collaboration-portugal",
  "pageTitle": "Prime Minister announces closer collaboration with Portugal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the Prime Minister of Portugal, António Costa, to reaffirm the strong ties between Canada and Portugal, and to discuss the benefits of progressive trade and how the Comprehensive Economic and Trade Agreement (CETA)&nbsp;is helping create good, middle class jobs and new opportunities for people on both sides of the Atlantic.</p><p>In a joint statement released after their meeting, Prime Minister Trudeau and Prime Minister Costa committed to further deepen the Canada-Portugal relationship through a new arrangement on youth mobility. This new collaboration, which provides greater opportunities for engagement and exchange, will help Canadian and Portuguese young people gain international experience – an increasingly important skill in today’s economy – as well as a better understanding of each other’s cultures, languages, and societies. Additionally, the two leaders announced that Canada and Portugal will sign a modernized agreement on social security, and a memorandum of understanding on aeronautical search and rescue operations.</p><p>Prime Minister Trudeau and Prime Minister Costa also underlined our countries’ common commitment to NATO and to peacekeeping, including the UN peacekeeping mission in Mali. They discussed shared approaches to some of the most pressing global issues, and the importance of bilateral and multilateral cooperation, including on promoting gender equality, protecting the world’s oceans, addressing climate change, and building economies that work for everyone.</p><h2>Quote</h2><blockquote><p>“Canada and Portugal know that free and open trade builds our economies, creates good, middle class jobs, and drives growth that works for everyone. Nearly half a million people of Portuguese descent call Canada home, and make invaluable contributions to our country every day. Promoting youth mobility between our countries will deepen these strong people-to-people bonds and help more young people gain international experience as they prepare for the jobs of the future.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is the first formal meeting between Prime Minister Trudeau and Prime Minister Costa.</li><li>Canada is home to a vibrant community of over 480,000&nbsp;Canadians of Portuguese origin.</li><li>Canada and Portugal enjoy a strong relationship, founded on common values, deep and significant people-to-people bonds, and mutually beneficial commercial relations. Two-way merchandise trade between Canada and Portugal totalled nearly $848&nbsp;million in 2017, with Canadian exports valued at $270&nbsp;million.</li><li>On September 21, 2017, the provisional application of CETA took effect. CETA provides new opportunities for Canadian and Portuguese businesses, and will enhance trade and investment in both countries.</li><li>CETA will provide Canadian businesses with greater access to the world's largest integrated market, with over 510 million consumers and a GDP of $22&nbsp;trillion, and will help eliminate barriers in virtually all sectors and aspects of Canada-EU bilateral trade.</li><li>Portugal ratified CETA at the national level on December 21, 2017.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/news/statements/2018/05/03/canada-portugal-statement-enhanced-cooperation\">Canada-Portugal Statement on Enhanced Cooperation</a></li></ul></div>\n      "
}