{
  "path": "/en/news/readouts/2020/10/08/prime-minister-justin-trudeau-speaks-mayor-mississauga-bonnie-crombie",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Mayor of Mississauga Bonnie Crombie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Mayor of Mississauga Bonnie Crombie to discuss the global COVID-19 pandemic.</p>\n\n<p>The Prime Minister and the Mayor spoke about the rising number of COVID-19 cases in Mississauga, and the challenges facing the city with respect to the community spread of the virus.&nbsp;They also discussed the challenges faced by bars, restaurants, pubs, and banquet halls. They both agreed on the importance of supporting our economic recovery while containing the spread of the virus and keeping people safe and healthy, including through increased contact tracing and testing capacity.</p>\n\n<p>They further agreed that, ahead of Thanksgiving, it is essential that Mississaugans and all Canadians follow the advice of public health professionals. Both expressed their hope that, as people limit their exposure to others this weekend, they will help flatten the curve and make holiday gatherings possible in December.</p>\n\n<p>The Prime Minister and the Mayor agreed to continue working together on the response to COVID-19, in order to protect the health and safety of the people of Mississauga, and all Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/01/prime-minister-announces-support-help-communities-create-jobs-and\">Prime Minister announces support to help communities create jobs and restart the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/31/new-mobile-app-help-notify-canadians-potential-covid-19-exposure-now\">New mobile app to help notify Canadians of potential COVID-19 exposure now available</a></li>\n</ul></div>\n      "
}