{
  "path": "/en/news/statements/2021/11/28/statement-prime-minister-mark-start-hanukkah",
  "pageTitle": "Statement by the Prime Minister to mark the start of Hanukkah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the start of Hanukkah:</p>\n\n<p>“At sunset today, Jewish communities in Canada and around the world will welcome the beginning of Hanukkah, also known as the Festival of Lights. The holiday is observed by lighting the candles of the Hanukkiah.</p>\n\n<p>“Taking place over eight nights, Hanukkah, which means dedication in Hebrew, commemorates the successful revolt led by the Maccabees, leading to the liberation of the Jewish people and the rededication of the Second Temple in Jerusalem.</p>\n\n<p>“Across generations, Jewish families and friends have typically gathered to light the candles of the Hanukkiah one by one and proudly display it in their windowsill. This serves as an enduring reminder that light will always drown out darkness, and that even the smallest group of determined individuals have the power to make a profound difference in the world. Celebrations often include singing, spinning the dreidel, and eating latkes and sufganiyot.</p>\n\n<p>“This year, as we continue to follow public health guidelines to keep each other and our communities safe, I know that people will find alternate ways to celebrate the miracle of the relighting of the Hanukkiah at the Holy Temple in Jerusalem, and the triumph and perseverance of the Jewish people in overcoming adversity.</p>\n\n<p>“Hanukkah is also an opportunity to recognize the many contributions that Jewish Canadians have made, and continue to make for our country, particularly on the front lines of the pandemic. As we recover from the pandemic, let us take this opportunity to continue to commit ourselves to combatting antisemitism and hatred in all its form, which has no place in Canada – or anywhere else. The Government of Canada will always stand with the Jewish community and we will continue to ensure that Canada is a country where Jewish Canadians can live proudly and openly. Together, we will persevere to build a better Canada where we celebrate our diversity and promote inclusion.</p>\n\n<p>“On behalf of all Canadians, I wish everyone celebrating a blessed, peaceful, and joyful Hanukkah.</p>\n\n<p>“Chag Hanukkah Sameach.”</p></div>\n      "
}