{
  "path": "/en/news/news-releases/2018/12/06/prime-minister-announces-investment-artificial-intelligence-create",
  "pageTitle": "Prime Minister announces investment in artificial intelligence to create over 16,000 jobs for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced an investment of up to nearly $230 million for the AI-Powered Supply Chains Supercluster (SCALE.AI) based in Quebec. The investment is expected to create more than 16,000 jobs and add more than $16 billion to our economy over 10 years. The funding will be matched dollar-for-dollar by private sector partners. The government of Québec also announced an investment of $60 million to support the initiative.</p><p>SCALE.AI brings the retail, manufacturing, transportation, infrastructure, and information and communications technology sectors together to build intelligent supply chains through artificial intelligence and robotics. This supercluster is helping Canadian small and medium-sized businesses take advantage of new opportunities, and positioning Canada as a global export leader.</p><p>The Prime Minister made the announcement while delivering remarks at the G7 Multistakeholder Conference on Artificial Intelligence in Montréal, Quebec. The conference brought together over 150 technology leaders, academic experts, members of civil society, and government officials from G7 countries, including Minister of Innovation, Science and Economic Development Navdeep Bains, France's Secretary of State for Digital Affairs Mounir Mahjoubi, and Quebec’s Minister of Economy and Innovation Pierre Fitzgibbon. Together, they discussed the opportunities and challenges that stem from advancements in artificial intelligence, and explored ways to collaborate on the responsible use of artificial intelligence and harness its economic and social potential.</p><p>During the conference, Prime Minister Trudeau, alongside Minister Bains and Secretary Mahjoubi, discussed the International Panel on Artificial Intelligence being created by Canada and France, which will become a global point of reference for understanding and sharing research results on artificial intelligence. The Panel will support and guide the responsible development of artificial intelligence that is grounded in human rights, inclusion, diversity, innovation, and economic growth. It will also facilitate international collaboration with the scientific community, industry, civil society, related international organizations, and governments.</p><p>Prime Minister Trudeau also highlighted the Government of Canada’s $950&nbsp;million support for the Innovation Superclusters Initiative. The investment is expected to create more than 50,000&nbsp;middle class jobs and grow Canada’s economy by $50 billion over the next 10&nbsp;years.</p><p>Artificial intelligence has the potential to unlock unprecedented social and economic benefits, and keep our workers and our industries competitive in a rapidly changing economy. As a global leader in innovation, Canada is harnessing new technologies like artificial intelligence to shape a better future for all our citizens.</p><h2>Quotes</h2><blockquote><p>“Today’s announcement is an important step toward making Canada an export and AI leader. Our government launched an ambitious strategy to keep this sector competitive in the long term, and support Canada’s innovators. Together, we can build an innovation economy – one that benefits everyone and provides new opportunities for the middle class to succeed.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><blockquote><p>“From farmers increasing their crop yield to citizens accessing health services, artificial intelligence has the potential to improve the life of every Canadian. Our government's focus is providing businesses with the support they need to thrive and create jobs, equipping Canadians with the tools to seize these opportunities, and ensuring AI advancements reflect Canadians' values.”<br><i><cite>—The Hon. Navdeep Bains, </cite></i><i><cite>Minister of Innovation, Science and Economic Development</cite></i></p></blockquote><blockquote><p>“With our ‘AI for Humanity’ strategy, France is positioning itself as a global leader in artificial intelligence, with a particular emphasis on the ethical issues it raises on the world stage. With Canada, we are proud to have laid the groundwork for the International Panel on Artificial Intelligence, and we invite researchers, businesses, international organizations, and countries that share our values to join us. Together, we will ensure that artificial intelligence is at the service of all of humanity.”<br><i><cite>— </cite></i><i><cite>Mounir Mahjoubi, Secretary of State for Digital Affairs for France</cite></i></p></blockquote><blockquote><p>“Our open and innovative society, which values research and excellence, allows cutting-edge sectors like artificial intelligence to reach critical milestones in their development today. Thanks to the mobilization of an unprecedented network of researchers and partners, and the government support announced today, supply chains will be transformed, and we may also potentially usher in a new chapter in Quebec's economic history. We are proud to contribute to the activities of Canada’s artificial intelligence supply chain supercluster, SCALE.AI.&nbsp;The most recent scientific and technological advances in artificial intelligence will benefit many companies in many industrial sectors, immediately positioning them as key players in the economy of tomorrow.”<br><i><cite>— </cite></i><i><cite>Pierre Fitzgibbon, Minister of Economy and Innovation for Quebec</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>The Innovation Superclusters Initiative is a centrepiece of the Government of Canada’s Innovation and Skills Plan, a multi-year strategy to prepare Canada for the innovative jobs of today and tomorrow.<ul><li>Canada’s five superclusters – the <a href=\"https://www.digitalsupercluster.ca/\">Digital Technology Supercluster</a>, the <a href=\"https://www.proteinindustriescanada.ca/\">Protein Industries Canada Supercluster</a>, the <a href=\"http://www.ngen.ca/\">Next Generation Manufacturing Supercluster (NGen)</a>, the <a href=\"https://aisupplychain.ca/\">AI-Powered Supply Chains Supercluster (SCALE.AI)</a>, and the <a href=\"https://oceansupercluster.ca/\">Ocean Supercluster</a> – promote collaboration between individuals, businesses, and post-secondary institutions across the country.</li><li>Together, the five superclusters represent more than 450 businesses, 60 post-secondary institutions and 180 other participants in sectors covering 78 percent of Canada’s economy.</li><li>Last year, Canada launched a $125 million <a href=\"https://www.cifar.ca/ai/pan-canadian-artificial-intelligence-strategy\">Pan-Canadian Artificial Intelligence Strategy</a> to retain and attract top academic talent, and to increase the number of post-graduate trainees and researchers studying artificial intelligence and deep learning.</li><li>The International Panel on Artificial Intelligence is a key outcome of the <a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/europe/2018-06-07-france_ai-ia_france.aspx?lang=eng\">Canada-France Statement on Artificial Intelligence</a> announced by Prime Minister Trudeau and the President of France Emmanuel Macron prior to the G7 Summit this past June.</li><li>Under Canada’s 2018 G7 presidency, Canada has advanced a common vision on Artificial Intelligence, which the G7 Innovation Ministers set out in their <a href=\"https://g7.gc.ca/en/g7-presidency/themes/preparing-jobs-future/g7-ministerial-meeting/chairs-summary/annex-b/\">Statement on Artificial Intelligence</a> at their meeting in Montreal on March 27-28. The G7 Leaders also set it out in the <a href=\"https://g7.gc.ca/en/official-documents/charlevoix-common-vision-future-artificial-intelligence/\">Charlevoix Common Vision for the Future of Artificial Intelligence</a>&nbsp;during their meeting in Charlevoix on June 8-9, 2018.</li></ul></li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2018/12/06/mandate-international-panel-artificial-intelligence\">Mandate for the International Panel on Artificial Intelligence</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.ic.gc.ca/eic/site/133.nsf/eng/home\">G7 Multistakeholder Conference on Artificial Intelligence</a></li><li><a href=\"https://www.ic.gc.ca/eic/site/093.nsf/eng/00008.html\">Innovation Superclusters Initiative</a></li><li><a href=\"https://aisupplychain.ca/\">AI-Powered Supply Chains Supercluster (SCALE.AI)</a></li></ul></div>\n      "
}