{
  "path": "/en/news/statements/2022/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p>\n\n<p>“On June 25, 1950, in the first open act of aggression since the establishment of the United Nations (UN), North Korean troops crossed the 38th parallel and invaded South Korea. In the face of this illegal, unprovoked, and unjustifiable act, Canada joined forces with our allies and partners in a UN mission to restore peace on the Korean Peninsula.</p>\n\n<p>“Today, on Korean War Veterans Day, we remember and honour the more than 26,000 brave Canadians who fought against brutal totalitarianism on land, at sea, and in the air. Over the course of three years, they fought in grueling conditions and endured heavy attacks from the enemy. More than 1,000 Canadians would be wounded, and 516 others never returned to their families. Many more would bear physical and mental scars for the rest of their lives. Their names are inscribed in the&nbsp;Books of Remembrance on Parliament Hill, alongside those who made the ultimate sacrifice for our country in other military efforts.</p>\n\n<p>“Because of North Korea’s unjustifiable aggression, civilians paid a high price. Millions of Koreans died, became homeless, and suffered lifelong physical and emotional traumas. After the armistice, Canadians stayed in the region to keep the peace, maintaining a presence in UN Command to this day. Their continued service helped lay the foundation for the prosperous and democratic South Korea that exists today, building an everlasting bond between our people.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to learn more about the&nbsp;<a href=\"http://www.veterans.gc.ca/eng/remembrance/history/korean-war\">Korean War</a>, pay tribute to our veterans, and reflect on their heroic sacrifices in defence of international peace. Their strength, bravery, and dedication inspire us all and will never be forgotten.”</p></div>\n      "
}