{
  "path": "/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses",
  "pageTitle": "Prime Minister announces additional support for small businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Small businesses are the backbone of our economy, and are vital for our families and communities across the country. They are facing economic hardship and uncertainty during the COVID-19 pandemic. That is why the Government of Canada is working around the clock to give these businesses the support they need so they can continue to make our country strong at this critical time.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new measures to support Canadian businesses so they can keep their doors open and their employees on the job.</p>\n\n<p>The Government of Canada is:</p>\n\n<ul>\n\t<li>Expanding the Canada Emergency Business Account (CEBA) to businesses that paid between $20,000 and $1.5 million in total payroll in 2019. This new range will replace the previous one of between $50,000 and $1 million, and will help address the challenges faced by small businesses to cover non-deferrable operating costs. Since the launch of the CEBA on April 9, 2020, more than 195,000 loans have been approved by financial institutions, extending more than $7.5 billion in credit to small businesses.</li>\n\t<li>Announcing its intent to introduce the Canada Emergency Commercial Rent Assistance (CECRA) for small businesses. The program will seek to provide loans, including forgivable loans, to commercial property owners who in turn will lower or forgo the rent of small businesses for the months of April (retroactive), May, and June. Implementation of the program will require a partnership between the federal government and provincial and territorial governments, which are responsible for property owner-tenant relationships. We are working with the provinces and territories to increase rent support for businesses that are most impacted by the pandemic and we will have more details to share soon.</li>\n</ul>\n\n<p>These measures are part of the Government of Canada’s COVID-19 Economic Response Plan, which has committed more than $107 billion in support to Canadians and businesses facing hardship as a result of the pandemic. The government will continue to monitor and respond to the wide-ranging impacts of COVID-19, and take additional actions as needed to protect the health and safety of Canadians and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We will always be there to support our Canadian businesses. That is why we are working closely with the business community to make sure that our emergency measures are as effective and inclusive as possible. Expanding the Canada Emergency Business Account and making sure businesses can afford their rent is the smart thing to do. Small businesses are the backbone of our communities, and will keep our economy strong in this uncertain time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are committed to helping Canadians through this difficult period. By making the Canada Emergency Business Account more accessible and introducing new measures to support businesses, we are positioning them to be ready for the recovery that will come. We will continue to do whatever it takes to ensure that Canadians are supported through the outbreak, and that our economy remains resilient during these challenging times.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n</ul></div>\n      "
}