{
  "path": "/en/news/news-releases/2017/08/30/children-and-families-new-brunswick-benefit-improved-early-learning",
  "pageTitle": "Children and families in New Brunswick to benefit from improved early learning and child care | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Each and every child in Canada deserves the best possible start in life. That means having access to the type of high quality early learning and child care services that can make a difference in our children’s development, especially for those most at risk. Investments in child care are smart investments—they help children and families, and strengthen our country’s social and economic fabric.</p><p>The Prime Minister, Justin Trudeau, and the Premier of New Brunswick, Brian Gallant, today announced an agreement that will significantly improve early learning and child care for preschool-aged children in the province.</p><p>Under this important agreement, the governments of Canada and New Brunswick will work together to increase the quality, accessibility, affordability, flexibility, and inclusivity of early learning and child care programs and services. As a result, more high demand spaces, including those for infants and toddlers, will be made available and fees will be lowered for families in need so their children can also benefit from high quality learning environments.</p><p>With increased support for early learning and child care, more Canadian parents can pursue new opportunities to work and learn, and build a better future for themselves and their children.</p><h2>Quotes</h2><blockquote><p>“I have met with many parents across the country, including in the Atlantic provinces, who struggle with trying to find affordable, high quality child care so that they can continue working or going to school. We all want the best for our kids. This agreement with New Brunswick is about doing just that—giving children in the province a head start in life and the tools they need for future success.”<br>— <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"Education and early childhood learning are some of the best investments we can make for the future prosperity of our economy. Providing more affordable and high quality child care will strengthen families, the middle class, and the New Brunswick workforce of tomorrow.\"<br>— <cite>The Honourable Brian Gallant, Premier of New Brunswick</cite></p></blockquote><h2>Quick facts</h2><ul><li>Under this agreement, the federal government will invest close to $30 million to improve early learning and child care for preschool-aged children in New Brunswick. The province will contribute an additional $41 million for a total of $71 million.</li><li>Investments will transform at least 300 current child care providers into designated New Brunswick Early Learning Centres which will provide more quality spaces, have lower fee structures, and implement inclusion policies and guidelines for francophone minority communities. Funding will also be used to provide professional development opportunities for early child care educators and to support other initiatives to improve early learning and child care in the province.</li><li>Budgets 2016 and 2017 announced $7.5 billion over 11 years, starting in 2017‑2018, to support and create more high quality, affordable child care across the country, particularly for families in need. Of this investment:<ul><li>$95 million will go toward closing data gaps to better understand what child care looks like in Canada and track progress;</li><li>$100 million will go towards early learning and child care innovation; and</li><li>A portion will be dedicated to strengthen culturally appropriate early learning and child care programs for Indigenous children. The Government of Canada is working on a distinct Indigenous Early Learning and Child Care Framework in cooperation with Indigenous partners to reflect the unique cultures and needs of First Nations, Inuit, and Métis children across Canada.</li></ul></li><li>Through bilateral agreements such as this one with New Brunswick, the Government of Canada will provide provinces and territories with $1.2 billion over the next three years for early learning and child care programs. Governments will report annually on progress made in relation to the Multilateral Early Learning and Child Care Framework and bilateral agreements.</li></ul><h2>Related product</h2><ul><li><b>Backgrounder</b>: <a href=\"/en/news/backgrounders/2017/08/30/canada-new-brunswick-early-learning-and-child-care-agreement\">Canada-New Brunswick early learning and child care agreement</a></li></ul><h2>Associated links</h2><ul><li><a href=\"https://www.canada.ca/en/employment-social-development/programs/early-learning-child-care.html\">Early learning and child care</a></li><li><a href=\"https://www.canada.ca/en/employment-social-development/programs/early-learning-child-care/reports/2017-multilateral-framework.html\">Multilateral Early Learning and Child Care Framework</a></li></ul></div>\n      "
}