{
  "path": "/en/news/news-releases/2018/11/07/prime-minister-delivers-apology-regarding-fate-passengers-ms-st-louis",
  "pageTitle": "Prime Minister delivers apology regarding the fate of the passengers of the MS St. Louis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today delivered a formal apology in the House of Commons regarding the fate of the MS<i> St. Louis</i> and its passengers. The Prime Minister apologized to the passengers, their families, and Jewish communities in Canada and around the world.</p><p>In May 1939, the MS <i>St. Louis</i> departed Germany with close to a thousand passengers, including over 900 German Jews, who were desperate for safety and refuge from persecution at the hands of the Nazis.</p><p>After Jewish refugees on board were denied entry to Cuba, the United States, and Canada, they were forced to return to Europe, where the United Kingdom, Belgium, France, and the Netherlands agreed to take them in. When the Nazis conquered Belgium, France, and the Netherlands in 1940, 254 MS <i>St. Louis</i> passengers were murdered in the Holocaust.</p><p>The Prime Minister apologized to Jewish refugees Canada turned away, and for the anti-Semitic, ‘none is too many’ immigration policy that led to the MS <i>St. Louis</i> incident. He also apologized to the Jews who were falsely imprisoned during the Second World War, to the members of Canada’s Jewish community whose pleas were ignored, and to all others who paid the price of Canada’s inaction.</p><h2>Quotes</h2><blockquote><p>“Today, I rose in the House of Commons to issue a long overdue apology to the Jewish refugees Canada turned away. By issuing this apology, it is my sincere hope that we can shine a light on this painful chapter of our history and ensure that its lessons are never forgotten. Anti-Semitism, xenophobia, and hatred have no place in this country, or anywhere in this world. Recent attacks on the Jewish community attest to the work we still have to do. We must always stand up against xenophobic and anti-Semitic attitudes and hate in all its forms.”<br><cite><i>—</i><i>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</i></cite></p></blockquote><blockquote><p>“Every year, thousands of people from around the world choose to settle in Canada and are warmly welcomed by our dynamic, inclusive and open country. The memory of the MS <i>St. Louis</i> reminds us of how far we have travelled since 1939 and rekindles our commitment to fight anti-Semitism everywhere. The atrocities that have been and continue to be committed against the Jewish people cannot be forgotten, and we must continue to stand together against hatred and discrimination.”<br><i><cite>—</cite></i><i><cite>The Hon. Pablo Rodriguez, Minister of Canadian Heritage and Multiculturalism</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>Discrimination and violence against Jewish people in Canada and around the world continues at an alarming rate. According to the most recent figures, 17 per cent of all hate crimes in Canada target Jewish people, which is far higher per capita than any other group.</li><li>The Holocaust was a genocide during the Second World War in which Nazi Germany, aided by its collaborators, systematically murdered over six million Jewish people. Millions of others were also killed and suffered atrocities at the hands of the Nazi regime. It is one of the darkest chapters in human history.</li><li>While Canada did not directly experience the Holocaust, its restrictive immigration policies at the time largely closed the door to Jews seeking refuge from persecution in Europe.</li><li>As a nation, Canada has been profoundly shaped by approximately 40,000&nbsp;Holocaust survivors, who resettled across the country after the war. Today, Canadians remember the Holocaust, commemorate its victims, and renew our commitment to fight against racism, discrimination, and anti-Semitism.</li><li>Canada has been a full member of the International Holocaust Remembrance Alliance since 2009. The Alliance aims to support Holocaust education, remembrance, and research in member countries and around the world.</li></ul><h2>Related product</h2><ul><li><a href=\"/en/news/speeches/2018/11/07/statement-apology-behalf-government-canada-passengers-ms-st-louis\">Statement of apology on behalf of the Government of Canada to the passengers of the MS <i>St. Louis</i></a></li></ul><h2>Associated link</h2><ul><li><a href=\"/en/news/news-releases/2018/05/08/prime-minister-announces-st-louis-apology\">Prime Minister announces <i>St. Louis</i> apology</a></li></ul></div>\n      "
}