{
  "path": "/en/news/statements/2023/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p>\n\n<p>“Today, on <a href=\"https://earthday.ca/\">Earth Day</a>, we join people around the world to celebrate our planet and renew our unwavering commitment to protecting it.</p>\n\n<p>“Canadians take pride in the natural beauty of our country, from our coastlines – the longest in the world – to mountain ranges, vast stretches of prairie, and swathes of Arctic tundra. Canadians recognize that we have a responsibility to protect our iconic lands and waters, and that is why the Government of Canada has stepped up our ambition to do just that – both at home and abroad.</p>\n\n<p>“Since 2015, we have taken historic action to protect nature here at home. We have established new national parks, including Rouge National Urban Park, Canada’s first national urban park, conservation areas, marine conservation areas, and Indigenous-protected and conserved areas to ensure that people can enjoy our pristine landscapes today and for generations to come. And we are doing all this work in partnership with Indigenous Peoples, who have been the stewards and caretakers of these lands since time immemorial. This includes programs like <a href=\"https://www.canada.ca/en/environment-climate-change/services/environmental-funding/indigenous-guardians.html\">Indigenous Guardians</a>, which support Indigenous Peoples in protecting and conserving their traditional lands, and help us learn from their deep connection with nature.</p>\n\n<p>“Just last December, we welcomed the world to Montréal, Quebec, for the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity – it was the largest-ever conference of its kind. At COP15, Canada played a leading role in adopting the Kunming-Montréal Global Biodiversity Framework, a historic international agreement with over 190 countries signing on to help protect nature and reverse biodiversity loss around the world.</p>\n\n<p>“To build a clean, healthy future, we know we have to take action on climate change. Through our <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">Emissions Reduction Plan</a>, we are taking bold action to cut pollution and build a clean economy with good, middle-class jobs for Canadians. Our plan is already working, with companies from around the world making historic investments in Canada – a reliable supplier of clean energy and clean technology – and creating and securing thousands of good jobs across the country.</p>\n\n<p>“On this Earth Day, we are reminded that just as we share our planet, we also share the responsibility to protect it. I invite all Canadians to spend time in the nature we are fortunate to have right in our backyards as we recommit – today and every day – to protecting the Earth for generations to come.”</p></div>\n      "
}