{
  "path": "/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms",
  "pageTitle": "Prime Minister announces ban on assault-style firearms | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>One Canadian killed by gun violence is one too many. Violent crimes involving firearms continue to have devastating impacts on communities across the country, and on Canadians who have lost loved ones to these crimes. Events like the recent tragedy in Nova Scotia, the attack in 2017 at the Centre culturel islamique de Québec, and the massacre that took place in 1989 at École Polytechnique de Montréal should never have happened. That is why the Government of Canada is introducing measures to combat gun violence, and help keep us safe.</p>\n\n<p>Prime Minister Justin Trudeau today announced the ban of over 1,500 models and variants of assault-style firearms. These models represent nine categories of firearms and two types identified by characteristic. Some of their components are also prohibited.</p>\n\n<p>The newly prohibited firearms and components cannot be legally used, sold, or imported. Owners must also continue to safely store them, and may only transfer and transport them under limited circumstances. These measures will remove dangerous firearms designed for military use from our communities, and help ensure that Canadian families and communities no longer suffer from gun violence.</p>\n\n<p>There will be a transition period of two years to protect owners of newly prohibited firearms from criminal liability while they take steps to comply with these new rules. This two-year amnesty order under the <em>Criminal Code</em> is in effect until April 30, 2022. There are exceptions under the amnesty for Indigenous peoples exercising Aboriginal or treaty rights to hunt, and for those who hunt or trap to sustain themselves or their families. These exceptions will allow for the continued use of newly prohibited firearms in limited circumstances until a suitable replacement can be found. By the end of the amnesty period, all firearms owners must comply with the ban.</p>\n\n<p>The Government of Canada intends to implement a buy-back program as soon as possible to safely remove these firearms and to introduce legislation as early as possible, working with Parliament and through public consultation.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Because of gun violence, people are dying, families are grieving, and communities are suffering. It must end. Assault-style firearms designed for military use have no place in Canada. By removing them from our streets, we will limit the devastating effects of gun-related violence and help make our country safer.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Prohibiting these firearms immediately freezes the market in Canada for the most prevalent assault-style firearms that are not suitable for hunting or sports shooting purposes. These dangerous firearms are designed for the battlefield, not for communities, but have been used tragically to target women, students and worshippers because they are efficient in maximizing fatalities. Today’s initiative is the first step in a broader firearms strategy that will address illegal activities, violence, and self-harm. Our government is also committed to protecting public safety, while ensuring hunters, farmers, and law-abiding recreational firearms owners are also treated respectfully and fairly.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, Minister of Public Safety and Emergency Preparedness</footer>\n</blockquote>\n\n<blockquote>\n<p>“Weapons designed for the battlefield have no place on our streets or in our communities. Canadians gave us a clear mandate to ban these dangerous weapons. That is exactly what we are doing with the targeted measures we are announcing today.”</p>\n\n<footer class=\"default\">The Hon. David Lametti, Minister of Justice and Attorney General of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In Canada, there are currently over 100,000 restricted firearms among the models that are now prohibited. This number does not include other newly-prohibited models that were not subject to registration requirements.</li>\n\t<li>An individual should not deliver a firearm to a police station without first making arrangements with a police officer for a safe and scheduled delivery or pick up. Individuals should not surrender their firearm while physical distancing requirements are in effect during the COVID-19 pandemic.</li>\n\t<li>Firearms owners must keep their firearms securely stored in accordance with the storage requirements until more information on the buy-back program is available.</li>\n\t<li>A <em>Criminal Code</em> amnesty is in place until April 30, 2022, to protect lawful owners from criminal liability and to enable them to comply with the law. Under the amnesty, the newly prohibited firearms can only be transferred or transported within Canada for specific purposes.</li>\n\t<li>Unless you are an Indigenous person exercising treaty rights to hunt or a sustenance hunter, you can only transfer or transport in accordance with the amnesty, such as to:\n\t<ul>\n\t\t<li>have them deactivated by an approved business</li>\n\t\t<li>return them to a lawful owner’s residence</li>\n\t\t<li>export them lawfully</li>\n\t\t<li>surrender them to police without compensation</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/paf-afa-en.aspx\">Backgrounder: List of prohibited assault-style firearms</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><em><a href=\"http://canadagazette.gc.ca/rp-pr/p2/2020/index-eng.html\">Canada Gazette, Part II</a></em></li>\n\t<li><a href=\"https://laws-lois.justice.gc.ca/eng/acts/f-11.6/\"><em>Firearms Act</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2019/06/royal-assent-of-legislation-strengthening-gun-laws-to-keep-communities-safe.html\">Royal Assent of legislation: Strengthening gun laws to keep communities safe</a></li>\n\t<li><a href=\"http://www.rcmp-grc.gc.ca/cfp-pcaf/index-eng.htm\">Canadian Firearms Program</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-rdcng-vlnt-crm-dlg/index-en.aspx\">Engagement Summary Report – Reducing Violent Crime: A Dialogue on Handguns and Assault-Style Firearms</a></li>\n</ul></div>\n      "
}