{
  "path": "/en/news/news-releases/2016/03/14/prime-minister-travel-new-york-promote-gender-equality-and-canadian",
  "pageTitle": "Prime Minister to travel to New York to promote gender equality and the Canadian economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City from March&nbsp;16 to 17, 2016, to meet with the United Nations Secretary-General, to reiterate Canada’s support for the United Nations, and to promote women’s rights and gender equality.</p>\n<p>During his meeting with Secretary-General Ban Ki-moon, the Prime Minister will emphasize Canada’s commitment to play a positive and constructive role in the world, and to make meaningful contributions to issues that include climate change, respect for diversity and human rights, and support for international peace operations.</p>\n<p>While in New York, Prime Minister Trudeau will also participate in a roundtable on girls’ advocacy at the Permanent Mission of Canada to the United Nations, and will discuss gender equality with the Executive Director of UN Women, Phumzile Mlambo-Ngcuka.</p>\n<p>He will meet with business leaders in order to promote investment in Canada that creates good-paying jobs, strengthens the middle class, and leads to clean and sustainable economic growth.</p>\n<p>Finally, the Prime Minister will receive a special commendation for his leadership to advance inclusiveness, diversity, and gender equality at the annual Catalyst Awards Dinner.</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada will continue to be a vocal part of the conversation on women’s rights and the need for gender equality. Through multilateral fora like the UN, we will work together to advance gender equality around the world, especially for the most poor and vulnerable. We all benefit when women and girls have equal access to the rights and opportunities that help them realize their true potential.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“There has never been a better time to look to Canada to invest. I look forward to showcasing all that Canada has to offer in New York, including a forward-looking Canada that is open to trade and investment.<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}