{
  "path": "/en/news/readouts/2022/05/17/prime-minister-justin-trudeau-meets-newfoundland-and-labrador-premier",
  "pageTitle": "Prime Minister Justin Trudeau meets with Newfoundland and Labrador Premier Andrew Furey | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Newfoundland and Labrador Premier Andrew Furey to discuss shared priorities.</p>\n\n<p>The Prime Minister and Premier spoke about the importance of transitioning toward green energy and renewable energy sources, particularly wind, and noted the potential for the Canada-Newfoundland and Labrador offshore area in this regard. They discussed the war in Ukraine, emphasized their mutual support for the people of Ukraine in the face of Russia’s ongoing aggression, and agreed on the importance of close collaboration to continue supporting Ukrainians fleeing the conflict.</p>\n\n<p>The two leaders highlighted progress in implementing an affordable, quality early learning and child care system across the country, which is helping to improve access to regulated child care spaces across the province. They noted the importance of continuing discussions to ensure Canadians are supported by effective health care systems.</p>\n\n<p>The Prime Minister and Premier agreed to keep in close touch and committed to continuing to work together to further the effective partnership between the Government of Canada and Newfoundland and Labrador.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2022/04/canada-and-newfoundland-and-labrador-announce-intent-to-expand-the-mandate-of-offshore-energy-regime-to-support-the-transition-to-a-clean-economy-a.html\">Canada and Newfoundland and Labrador Announce Intent to Expand the Mandate of Offshore Energy Regime to Support the Transition to a Clean Economy and Create Sustainable Jobs</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">$10 a day child care for families in Newfoundland and Labrador</a></li>\n</ul></div>\n      "
}