{
  "path": "/en/news/statements/2022/08/19/statement-prime-minister-80th-anniversary-dieppe-raid",
  "pageTitle": "Statement by the Prime Minister on the 80th anniversary of the Dieppe Raid | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 80th anniversary of the Dieppe Raid:</p>\n\n<p>“Today, we remember the brave Canadians who took part in the Dieppe Raid, one of the most difficult and tragic days of the Second World War for our country.</p>\n\n<p>“On August 19, 1942, nearly 5,000 Canadian soldiers, along with their British and American allies, approached the beaches of and around Dieppe, in occupied France. Their objective was to test the enemy’s defences, damage its port facilities, and gather important intelligence to help defeat Nazi Germany.</p>\n\n<p>“Unfortunately, the Canadian soldiers who came ashore were met with sustained enemy fire, and only a few small groups of Canadians managed to reach the streets of Dieppe. In the air, the Royal Canadian Air Force and the British Royal Air Force continued the offensive, conducting one of the fiercest air battles of the Second World War. Forced to retreat, the Allies returned to Britain after nine hours of intense fighting.</p>\n\n<p>“During the course of this operation, many Canadian soldiers were wounded, 916 were killed, and 1,946 were taken as prisoners of war. Most of them remained captive until the end of the war in Europe, almost three years later. Despite this devastating setback, Canadian and Allied soldiers showed exceptional heroism, resilience, and courage. Invaluable lessons were learned from the Dieppe Raid and other amphibious assaults – lessons that proved essential in planning further attacks, including on D-Day and during the Battle of Normandy. The Dieppe Raid was instrumental in leading the Allies to victory over Nazi Germany and, as a result, in changing the course of history.</p>\n\n<p>“On this day, we pay tribute to the thousands of Canadians who made the ultimate sacrifice at Dieppe. I invite everyone to take part in <a href=\"https://www.veterans.gc.ca/eng/remembrance/commemorative-events/significant-events/dieppe\">a commemorative event</a> to mark this solemn anniversary, and to honour the memory of those who have defended our values of peace, freedom, and justice.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}