{
  "path": "/en/news/news-releases/2017/03/28/prime-minister-trudeau-highlights-significant-investments-protect",
  "pageTitle": "Prime Minister Trudeau highlights significant investments to protect Canada’s environment and cultural heritage | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians and their families should have every opportunity to explore Canada’s great outdoors and learn more about our country and its history. That is why the Prime Minister, Justin Trudeau, today highlighted several proposed investments in Budget 2017 to support Parks Canada, help complete the Trans Canada Trail, and protect our environment and cultural heritage.</p><p>While in Thousand Islands National Park, Prime Minister Trudeau highlighted proposed investments of up to $364 million over two years on a cash basis, starting in 2018-19, to support Parks Canada’s management of national parks, national marine conservation areas, and national historic sites. He also highlighted a proposed investment of $30 million over five years, starting in 2017-18, to help complete the Trans Canada Trail in partnership with provinces, territories, Indigenous communities, and individual Canadians.</p><p>Together, these investments will enrich our communities, create jobs and economic growth through tourism, and make Canada an even better place to live and raise a family.</p><h2>Quotes</h2><blockquote><p>“These investments are about ensuring Canadians and their families have every opportunity to experience Canada’s natural beauty and learn more about our country and its history. As we celebrate Canada’s 150<sup>th</sup> birthday, I encourage all Canadians to get out there and enjoy Canada’s national parks, marine conservation areas, and historic sites.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Trans Canada Trail offers Canadians the chance to explore our diverse landscapes in every province and territory. These investments will help complete the ‘Great Trail,’ connect 15,000 communities, and make our great outdoors even more accessible to Canadians and their families.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada will also develop a medium- and long-term plan to ensure ongoing support to Parks Canada’s highly valued areas so visitors are able to enjoy Canada’s national parks for years to come.</li><li>Canada’s system of protected areas is also an important part of local economies, directly contributing approximately $1.5 billion to Canada’s gross domestic product while generating almost 22,700 jobs. Enjoyed by millions of Canadians and international visitors each year, they are iconic symbols of our Canadian identity and tell the stories of Canada’s past, including the history, cultures, and contributions of Indigenous Peoples.</li><li>To make it more affordable for more Canadian families to visit and appreciate the outdoors, admission to all national parks, national marine conservation areas and national historic sites is free in 2017.</li><li>Parks Canada created a system of protected areas across Canada. Work is underway to expand this system to contribute towards Canada’s biodiversity targets to protect 17 per cent of land and inland waters, and 10 per cent of coastal and marine waters within the next three years.</li><li>The Trans Canada Trail is one of the world’s longest networks of multi-use recreational trails, comprising land and water routes across urban, rural, and wilderness landscapes. When completed, it will be the longest recreational trail in the world, stretching nearly 24,000 kilometres and connecting Canadians from coast to coast to coast.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.budget.gc.ca/home-accueil-en.html\">Budget 2017</a></li><li><a href=\"http://www.pc.gc.ca/eng/pn-np/on/lawren/visit.aspx\">Thousand Islands National Park of Canada</a></li><li><a href=\"https://thegreattrail.ca/\">Trans Canada Trail</a></li></ul></div>\n      "
}