{
  "path": "/en/news/news-releases/2017/02/17/prime-minister-announces-changes-senior-ranks-public-service",
  "pageTitle": "The Prime Minister announces changes in the senior ranks of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes in the senior ranks of the Public Service:</p><p><a href=\"/en/news/backgrounders/2017/02/17/gavin-liddy\"><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Gavin Liddy</span></b></a><span lang=\"EN-US\" xml:lang=\"EN-US\">, currently Associate Deputy Minister of Public Services and Procurement, becomes Senior Advisor to the Privy Council Office, effective March 6, 2017.</span></p><p><a href=\"/en/news/backgrounders/2017/02/17/les-linklater\"><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Les Linklater</span></b></a><span lang=\"EN-US\" xml:lang=\"EN-US\">, currently Deputy Secretary to the Cabinet (Operations), Privy Council Office, becomes Associate Deputy Minister of Public Services and Procurement, effective March 6, 2017.</span></p><p><a href=\"/en/news/backgrounders/2017/02/17/catrina-tapley\"><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Catrina Tapley</span></b></a><span lang=\"EN-US\" xml:lang=\"EN-US\">, currently Assistant Secretary to the Cabinet, Economic and Regional Development Policy, Privy Council Office, becomes Deputy Secretary to the Cabinet (Operations), Privy Council Office, effective March&nbsp;6,&nbsp;2017.</span></p><p><a href=\"/en/news/backgrounders/2017/02/17/jonathan-fried\"><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Jonathan Fried</span></b></a><span lang=\"EN-US\" xml:lang=\"EN-US\">, currently Ambassador and Permanent Representative of Canada to the World Trade Organization in Geneva, becomes Coordinator, International Economic Relations, Global Affairs Canada, effective April 18, 2017. Mr. Fried will support the Ministers and Deputy Ministers of Foreign Affairs and of International Trade.&nbsp; </span></p><p>The Prime Minister took the opportunity to congratulate <b>John Turner</b>, Associate Deputy Minister of National Defence, on the occasion of his retirement from the Public Service, following a distinguished career marked by dedication and excellence in serving Canadians.</p></div>\n      "
}