{
  "path": "/en/news/readouts/2019/08/26/prime-minister-justin-trudeau-meets-president-emmanuel-macron-france",
  "pageTitle": "Prime Minister Justin Trudeau meets with President Emmanuel Macron of France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, met with Emmanuel Macron, President of France.</p>\n\n<p>Prime Minister Trudeau congratulated President Macron on a productive G7 Presidency. The Prime Minister and President recognized the important progress Canada and France have made in their successive G7 Presidencies in areas such as economic growth that benefits everyone, gender equality, protecting the environment, and peace and security around the world. &nbsp;</p>\n\n<p>They discussed the important contributions of the Gender Equality Advisory Council at the G7 and looked forward to advancing gender equality and women’s empowerment when France hosts the Beijing + 25 conference in 2020.&nbsp;</p>\n\n<p>The leaders discussed key issues on the summit agenda, including their work on the global economy and international challenges such as Iran, fighting climate change and addressing the Amazon wildfires. &nbsp;On China, the Prime Minister thanked the President for France’s support in advocating for the release of the two detained Canadians. They also discussed their shared concern over the situation in Hong Kong.</p>\n\n<p>The Prime Minister welcomed France’s progress towards ratification of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA). The Prime Minister and the President looked forward to working together to maximize CETA’s benefits for the middle class, job creation and bilateral trade.</p>\n\n<p>Prime Minister Trudeau and President Macron spoke about their shared vision to promote the responsible adoption of artificial intelligence (AI) and looked forward to their ongoing collaboration in this area. &nbsp;The President thanked Canada for its generous contribution to the sixth replenishment of the Global Fund to Fight AIDS, Tuberculosis and Malaria which France will host in the autumn.&nbsp;</p></div>\n      "
}