{
  "path": "/en/news/statements/2020/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:</p>\n\n<p>“Thirty-five years ago today, an explosion on Air India Flight 182, bound for the United Kingdom from Canada, killed the 329 innocent people on board, including 280&nbsp;Canadians.</p>\n\n<p>“The attack was an act of unspeakable malice and remains the deadliest terrorist attack in Canadian history. It was a shock to our country, and a threat to our collective sense of security. Terrorism in Canada did not begin with this heinous act and, sadly, did not end there either.</p>\n\n<p>“Today, on the <a href=\"https://laws-lois.justice.gc.ca/eng/regulations/SI-2005-65/page-1.html\">National Day of Remembrance for Victims of Terrorism</a>, I join Canadians across the country to remember and pay tribute to all Canadian victims of terrorism. We offer our deepest sympathies to families and friends who have lost loved ones, and to everyone living with the pain and trauma caused by these senseless acts of violence.</p>\n\n<p>“Those who commit these cowardly acts seek to instill fear and divide us. They will not succeed. Canadians will always choose compassion over hate and acceptance over intolerance. We are at our best and most resilient when we embrace diversity and equality, and these acts of terrorism only strengthen our resolve to build a more inclusive Canada.</p>\n\n<p>“We stand in solidarity with all those affected by terrorism worldwide, and will continue to work closely with our international partners to end violent extremism, promote inclusion, and defend peace and justice within our global community.</p>\n\n<p>“Today and every day, we will honour those we have lost to terrorism by continuing to fight hate and intolerance, and work to make Canada and the world a safer and more secure place for everyone.”</p></div>\n      "
}