{
  "path": "/en/news/news-releases/2016/07/05/prime-minister-canada-and-premier-quebec-announce-new-infrastructure",
  "pageTitle": "The Prime Minister of Canada and the Premier of Quebec announce a new infrastructure agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, and the Premier of Quebec, Philippe Couillard, today confirmed the ratification of the Canada-Quebec Agreement on the Public Transit Infrastructure Fund and the Clean Water and Wastewater Fund.&nbsp;</p><p>This agreement—with funding provided by the Government of Canada, the Province of Quebec, and municipalities—will support public transit projects, as well as projects that will provide improved water and wastewater systems, in order that Quebec families may benefit from modernized infrastructure.</p><p>Both governments are committed to investing in local infrastructure to make sure that families have access to reliable and high-quality services. Investing in infrastructure is vital for creating middle class jobs today, and sustained economic growth for years to come.</p><p>The agreement will allow Quebec municipalities and public transit organizations to access more than $1.2 billion in federal funding over the next three years to implement projects in all regions of Quebec. Combined with funding from the province and municipalities, more than $2.5 billion will be invested in infrastructure projects.</p><p>In practical terms, nearly $924 million in federal funding will go to public transit projects, while $364 million will be earmarked for projects related to clean water and wastewater treatment.&nbsp;</p><p>These investments throughout our regions will ensure that all Quebecers have access to modern infrastructure that will enable them to, among other things, save time on their commute and optimize their work-life balance, while encouraging job creation, particularly among the middle class.</p><p><strong>Quotes </strong></p><p>“We are making investments that will improve the quality of life for our middle class now, while building a strong foundation for the sustainable economy of the future. These investments will help provide the people of Quebec with clean and reliable water sources, and with shorter commute times so they can spend more of their valuable time with their families. Through our solid partnership with Quebec, we are investing in our municipalities so that important shovel-ready infrastructure projects can proceed without delay.”<br><em>— The Prime Minister of Canada, Justin Trudeau</em></p><p>“Quebec is the first province to conclude its agreement with the federal government regarding these two funds. This comprehensive agreement between our governments will make it easier to choose and manage projects, will reduce administrative delays and will get shovels in the ground faster. This first phase will support public transit organizations in their initiatives to improve their equipment and increase their service offerings. This will enable us to support capital projects that are designed to rehabilitate, optimize and modernize public transit infrastructures or to enhance efficiency, accessibility or safety. These investments will benefit Quebec municipalities, which will be able to implement projects that meet their clean water and wastewater treatment infrastructure needs. We will work in partnership with them to complete these projects and thus enhance citizens’ quality of life. These monies are in addition to the Government of Quebec’s investments to modernize our infrastructure, and they will generate benefits in our regions.”<br><em>— Premier of Quebec, Philippe Couillard</em></p><p><strong>Quick Facts</strong></p><ul><li>This funding is part of the first phase of <em>Investing in Canada</em>, the Government of Canada’s historic $120-billion plan to support infrastructure across the country over the next 10 years.</li><li>Phase 1 of <em>Investing in Canada</em> will provide over $10 billion in investments to support public transit systems, green infrastructure projects, and social infrastructure projects. Details on Phase 2 of <em>Investing in Canada</em> will be announced over the next year.</li><li>The funding provided under the Public Transit Infrastructure Fund and the Clean Water and Wastewater Fund will be managed through agreements between the Government of Canada and provincial and territorial governments.</li><li>Under the agreement made today, the Government of Canada has made its funding retroactive to April 1, 2016, so projects can proceed without delay to help ensure a productive construction season this year.</li><li>Note that Quebec announced $88.7 billion in investments of its own over the next 10 years to develop infrastructure in Quebec.&nbsp;</li></ul><p><strong>Associated links</strong></p><ul><li>Infrastructure Canada - <a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\">Investing in Canada: The $120 Billion Infrastructure Plan</a></li><li>Infrastructure Canada - <a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">Public Transit Infrastructure Fund</a></li></ul></div>\n      "
}