{
  "path": "/en/news/readouts/2022/06/29/prime-minister-justin-trudeau-meets-nato-secretary-general-jens",
  "pageTitle": "Prime Minister Justin Trudeau meets with NATO Secretary General Jens Stoltenberg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, on the margins of the NATO Summit.</p>\n\n<p>Prime Minister Trudeau and the Secretary General discussed Russia’s illegal and unjustifiable invasion of Ukraine, and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people. The Prime Minister and the Secretary General discussed Canada’s significant support to Ukraine through the donation of military equipment, training, economic support, and humanitarian assistance. They also expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, including shortages, and rising prices of food, fuel, and fertilizer.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s strong support for Finland and Sweden’s accession to NATO membership and provided assurances of a swift Canadian ratification process. The Prime Minister also reaffirmed Canada’s enduring commitment to transatlantic security and NATO’s Open Door Policy.</p>\n\n<p>The Prime Minister and the Secretary General discussed Canada’s approach to reinforcing NATO’s eastern flank, the leadership role Canada plays as the Framework Nation to NATO’s multinational enhanced Forward Presence Battle Group in Latvia. The Prime Minister and the Secretary General discussed ongoing and future transatlantic security threats and challenges. Prime Minister Trudeau affirmed Canada’s commitment to strengthening our shared security commitments, including through substantial investments in continental and northern defence.</p>\n\n<p>Prime Minister Trudeau and Secretary General Stoltenberg emphasized the need to understand the impacts of climate change. Prime Minister Trudeau invited Secretary General Stoltenberg to visit Canada in August.&nbsp;</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/18/statement-prime-minister-finland-and-swedens-application-join-nato\">Statement by the Prime Minister on Finland and Sweden’s application to join the NATO Alliance</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}