{
  "path": "/en/news/statements/2021/03/25/statement-prime-minister-200th-anniversary-greeces-independence",
  "pageTitle": "Statement by the Prime Minister on the 200th anniversary of Greece’s independence | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Prime Minister, Justin Trudeau, today issued the following statement on the 200th anniversary of Greece’s independence:</span></span></span></p>\n\n<p><span><span><span>“Today, on the 200th anniversary of Greece’s independence, we celebrate with Greeks around the world, including nearly 300,000 Canadians of Greek heritage who call our country home. </span></span></span></p>\n\n<p><span><span><span>“In past years, Greek communities have marked this day with family gatherings and large parades. On several occasions, I have had the opportunity to participate in the annual festivities in Montréal, and to witness first-hand the sense of joy and community that this day brings. Celebrations will be different this year as we continue to fight the global COVID-19 pandemic, but Canadians of Greek heritage will continue to find ways to honour this special anniversary – whether through virtual calls with friends or by sharing a meal of bakaliaros and skordalia at home. </span></span></span></p>\n\n<p><span><span><span>“Canada and Greece have a longstanding and close relationship, built over more than 75 years of diplomatic relations. We collaborate in multilateral organizations such as the United Nations, NATO, and La Francophonie, and enjoy greater commercial success for both Canadian and Greek businesses through the<span><span> Canada-European Union Comprehensive Economic and Trade Agreement.</span></span> We look forward to deepening our partnership as we collaborate on shared priorities, including peace and security.</span></span></span></p>\n\n<p><span><span><span>“On behalf of the Government of Canada, I offer my best wishes to everyone celebrating Greece’s Independence Day, here in Canada and around the world.</span></span></span></p>\n\n<p><span><span><span>“Ζήτω η Ελλάς”</span></span></span></p></div>\n      "
}