{
  "path": "/en/news/itineraries/2018/09/24/itinerary-tuesday-september-25-2018",
  "pageTitle": "Itinerary for Tuesday, September 25, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>New York, New York</h2><p><b>8:00 a.m. </b>The Prime Minister, Minister of Foreign Affairs Chrystia Freeland and Minister of International Trade Diversification Jim Carr will participate in an armchair discussion on Canada’s global outlook, hosted by the Council on Foreign Relations.</p><p>Peter G. Peterson Hall, First Floor<br>Council on Foreign Relations<br>58 East 68<sup>th</sup> Street</p><p><b> Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to arrive no later than 7:15 a.m.</li></ul></ul><p><b>10:00 a.m. </b>The Prime Minister will meet with business leaders.</p><p>The Blackstone Group<br>345 Park Avenue</p><p><i> Closed to media. </i></p><p><b>11:30 a.m.</b> The Prime Minister will meet with Chief Executive Officer of Royal Dutch Shell Ben Van Beurden.</p><p>Alvin Room, Conference Level<br>Grand Hyatt New York Hotel<br>109 East 42<sup>nd</sup> Street</p><p><b>Notes for media</b>:</p><ul><ul><li>Photo opportunity at the beginning of the meeting</li><li>Media are asked to arrive no later than 11:00 a.m.</li></ul></ul><p><b>1</b><b>:15 p.m. </b>The Prime Minister will attend a heads of delegation luncheon hosted by United Nations Secretary-General António Guterres.</p><p>North Delegates’ Lounge, Second Floor<br>United Nations Headquarters</p><p><b>Note for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the luncheon</li></ul></ul><p><b>2:30 p.m.</b> The Prime Minister will hold a bilateral meeting with President of the Republic of Colombia Iván Duque Márquez.</p><p>Room 1520, 15<sup>th</sup> Floor<br>United Nations Headquarters</p><p><b>Note for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li></ul></ul><p><b>4:00 p.m.</b> The Prime Minister will deliver opening remarks and participate in the <i>12 Years to Break Barriers and Leave No Girl Behind: Countdown to 2030</i> event.</p><p>Conference Room 1, First Basement<br>Conference Building<br>United Nations Headquarters</p><p><b>Note for media:</b></p><ul><ul><li>Open coverage</li></ul></ul><p><b>5:00 p.m.</b> The Prime Minister, Prime Minister of the United Kingdom Theresa May, President of Rwanda Paul Kagame and President of Ghana Nana Akufo-Addo will host a leaders’ dialogue with African countries on youth employment through innovative financing.</p><p>Conference Room 6, First Basement<br>Conference Building<br>United Nations Headquarters</p><p><b>Note for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li></ul></ul><p><b>6:30 p.m.</b> The Prime Minister will hold a bilateral meeting with President of the Republic of Paraguay Mario Abdo Benítez.</p><p>Room 1520, 15<sup>th</sup> Floor<br>United Nations Headquarters</p><p><b>Note for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li></ul></ul></div>\n      "
}