{
  "path": "/en/news/statements/2018/09/15/statement-prime-minister-international-day-democracy",
  "pageTitle": "Statement by the Prime Minister on the International Day of Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Democracy:</p><p>“On International Day of Democracy, I am reminded of the words of former Member of Parliament Arnold Chan. He was a close friend and colleague and, above all, a devoted public servant. While Arnold passed away exactly a year ago yesterday, his wisdom lives on and continues to hold lessons for us all – perhaps now more than ever.</p><p>“Arnold believed deeply in our democracy, and never lost sight of the individual, every day actions that make us who we are as a country. He reminded us how small acts of civility are foundational to democracy, as essential as casting a ballot.</p><p>“If Arnold were with us today, I am confident he would still be speaking about the state of democracy in Canada and around the world – and with even greater passion and urgency. The challenge, Arnold used to say, is that no one is listening and everyone is just talking at once.</p><p>“It has become too easy to dismiss opportunities for debate and conversation, and more challenging to find space for moments of pause and reflection. As Arnold pointed out, democracy really only happens when we are listening to each other across our differences. Only then can we truly improve our society, and ensure it stays resilient to the challenges that are testing our democracies.</p><p>“On this day, I hope all Canadians answer Arnold’s call ‘to give heart to their democracy, to treasure it, and to revere it.’ We have an opportunity to strengthen our democracy every day. Acts of common civility, no matter how small, show we are listening to each other and there for one another. They are at the heart of our democracy and the values that bind us together.</p><p>“They are, as Arnold would say, ‘the foundation of what makes Canada great.’”</p></div>\n      "
}