{
  "path": "/en/news/news-releases/2016/06/23/prime-minister-announces-increased-support-millions-canadian-families",
  "pageTitle": "Prime Minister announces increased support for millions of Canadian families | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada understands that a strong economy starts with a strong middle class. Too many Canadian middle class families struggle with the high costs of raising their children, and too many children continue to live in poverty.</p>\n<p>The Prime Minister, Justin Trudeau, today welcomed Royal Assent of the <em>Budget Implementation Act</em> which includes a new Canada Child Benefit that will put more money in the pockets of nine out of ten families, and help them to save, invest, and grow the Canadian economy.</p>\n<p>The new Canada Child Benefit will be paid monthly to eligible families, beginning in July 2016, and is:</p>\n<ul>\n<li>simpler – families will receive a single payment every month;</li>\n<li>tax-free – families will not have to pay back amounts received when they file their tax returns;</li>\n<li>better-targeted to those who need it most – low- and middle-income families will receive more benefits, and those with the highest incomes (generally over $150,000) will receive lower benefits than under the current system; and</li>\n<li>much more generous – families that benefit will see an average increase in child benefits of almost $2,300 in the 2016-17 benefit year.</li>\n</ul>\n<p><strong>Quote</strong></p>\n<p>“The new Canada Child Benefit means more money for healthier groceries, kids’ summer programs, and back-to-school clothes. This is about putting money in the pockets of families who need it most, investing in our future, and helping the Canadian economy grow for the benefit of all.”</p>\n<p><em>­</em><em>-The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The new Canada Child Benefit replaces the old Canada Child Tax Benefit, including the National Child Benefit Supplement and the Universal Child Care Benefit.</li>\n<li>It will provide a maximum annual benefit of up to $6,400 per child under the age of 6 and up to $5,400, per child, aged 6 through 17. Families with less than $30,000 in net income will receive the maximum benefit.</li>\n<li>Families whose children qualify for the disability tax credit can receive an additional amount as part of their Canada Child Benefit, up to a maximum annual benefit of $2,730 per child eligible for the disability tax credit.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.budget.gc.ca/2016/home-accueil-en.html\">Budget 2016</a></li>\n<li><a href=\"http://www.budget.gc.ca/2016/tool-outil/ccb-ace-en.html\">Canada Child Benefit Calculator</a></li>\n</ul></div>\n      "
}