{
  "path": "/en/news/itineraries/2020/09/02/prime-ministers-itinerary-thursday-september-3-2020",
  "pageTitle": "Prime Minister’s itinerary for Thursday, September 3, 2020 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Ottawa, Ontario</h2>\n\n<p>The Prime Minister will speak with the Governor of California, Gavin Newsom.</p>\n\n<p><strong>10:30 a.m.&nbsp;</strong>The Prime Minister will speak with the Premier of Newfoundland and Labrador, Andrew Furey.</p>\n\n<p><strong>11:30 a.m.&nbsp;</strong>The Prime Minister will participate in a virtual meeting with Louisbourg Seafoods, accompanied by Member of Parliament for Cape Breton—Canso Mike Kelloway. They will speak with the owner and employees about how the Canada Emergency Wage Subsidy has helped them continue operations and keep workers employed during the COVID-19 pandemic.</p>\n\n<p><strong>1:30 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual meeting with Distillerie Fils du Roy, accompanied by Member of Parliament for Acadie—Bathurst Serge Cormier. They will speak about the distillery’s production of hand sanitizer for essential workers and public services, as well as support they have received from the Canada Emergency Business Account program.&nbsp;&nbsp;</p>\n\n<p><strong>2:10 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual meeting with Tronosjet Maintenance Inc., accompanied by Member of Parliament for Charlottetown Sean Casey. They will speak about their production of disposable 3D printed protective caps for ear thermometers to address shortages at a local hospital, and ongoing plans for design and development of additional testing equipment.</p>\n\n<p><em>Closed to media.</em></p>\n\n<p><strong>Media appearances</strong></p>\n\n<p><strong>9:40 a.m.&nbsp;</strong>An interview with the Prime Minister will air on VOCM Open Line with Paddy Daly.</p>\n\n<p><strong>3:10 p.m.&nbsp;</strong>An interview with the Prime Minister will air on CBC Radio Mainstreet PEI.</p>\n\n<p>An interview with the Prime Minister will air on CBC Radio Mainstreet Nova Scotia.</p>\n\n<p>An interview with the Prime Minister will be taped with Ocean 100, which will air on Friday.</p></div>\n      "
}