{
  "path": "/en/news/news-releases/2018/09/26/prime-minister-concludes-successful-week-united-nations-general",
  "pageTitle": "Prime Minister concludes successful week at the United Nations General Assembly | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today wrapped up a productive week in New York, where he participated in the 73<sup>rd</sup> United Nations General Assembly (UNGA).</p><p>At UNGA, the Prime Minister reaffirmed Canada’s longstanding commitment to the UN and the importance of countries working together to deliver economic growth that benefits everyone, advance gender equality, fight climate change, and build a more peaceful and secure world.</p><p>Prime Minister Trudeau hosted a roundtable with world leaders to build on the momentum from the G7 Leaders’ Summit, where a historic $3.8 billion CAD was mobilized to advance education for girls and women in crisis and conflict-affected states. Today, Canada welcomed a total contribution of more than $527 million CAD from Denmark, the Netherlands, Norway, and Qatar to help developing countries give every child access to quality education and modern skills training.</p><p>The Prime Minister also delivered remarks at 12 Years to Break Barriers and Leave No Girls Behind, where over 500 stakeholders committed to concrete action to dismantle barriers to girls’ education.</p><p>Together with UK Prime Minister Theresa May, Ghana President Nana Addo Dankwa Akufo-Addo, and Rwanda President Paul Kagame, Prime Minister Trudeau led a roundtable discussion on ways we can create more good quality jobs and opportunities for young people across Africa.</p><p>The Prime Minister also joined UN Secretary-General António Guterres and other world leaders at the Sustainable Development Financing event to discuss how to make Agenda 2030 for Sustainable Development a reality. During the event, the Prime Minister announced that Canada will contribute $20 million to the Global Infrastructure Hub (GI Hub) as part of its efforts to develop transformative infrastructure projects around the world. The GI Hub brings together public and private investors to develop quality infrastructure that creates good jobs, strengthens communities, and drives economic growth.</p><p>The Prime Minister was honoured to speak to the UN General Assembly at the Nelson Mandela Peace Summit. In his remarks, he paid tribute to Nelson Mandela for his contribution to international peace and reconciliation and endorsed the political declaration adopted at the Nelson Mandela Peace Summit.</p><p>In addition, the Prime Minister delivered the prestigious Russell C. Leffingwell Lecture during an armchair discussion at the Council on Foreign Relations where he discussed Canada’s role on the world stage, the importance of multilateralism, and the future of globalization.</p><p>While in New York, the Prime Minister met with many world leaders to discuss shared priorities, including Prime Minister of Nepal, Khadga Prasad Sharma Oli, Prime Minister of Barbados, Mia Mottley, President of Colombia, Iván Duque, President of France, Emmanuel Macron, Prime Minister of the United Kingdom, Theresa May, President of Mexico, Enrique Peña Nieto, and President of Paraguay, Mario Abdo Benítez.</p><h2>Quote</h2><blockquote><p>“The challenges we face today know no borders. Canada is committed to working with partners around the world to build a better future for all of us – from growing economies that benefit everyone, to fighting climate change, to creating a safer, more peaceful world. At UNGA this week, we came together to support resilient, sustainable infrastructure, create more opportunities for young people across Africa, and make sure the world’s most vulnerable women and girls have the chance to learn and succeed. That’s the kind of progress we make when we work together.”<br>— <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></blockquote><h2>Quick facts</h2><ul><li>Canada is the fifth largest donor to the UN system.</li><li>Canada is seeking a non-permanent seat on the UN Security Council for 2021-22</li><li>Canada holds the G7 Presidency for 2018, and is advancing domestic and international priorities framed under the following five key themes:<ul><li>Investing in growth that works for everyone</li><li>Preparing for jobs of the future</li><li>Advancing gender equality and women’s empowerment</li><li>Working together on climate change, oceans, and clean energy</li><li>Building a more peaceful and secure world</li></ul></li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/news-releases/2018/09/24/canada-supports-global-infrastructure-new-hub-toronto\">Canada supports global infrastructure with new hub in Toronto</a></li><li><a href=\"/en/news/news-releases/2018/09/24/canada-supports-global-infrastructure-new-hub-toronto\"></a><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-declaration-quality-education-girls-adolescent-girls-women-developing-countries/\">Charlevoix Declaration on Quality Education for Girls, Adolescent Girls, and Women in Developing Countries</a></li></ul></div>\n      "
}