{
  "path": "/en/news/news-releases/2019/08/16/new-advisory-committee-promote-well-paying-careers-skilled-trades",
  "pageTitle": "New advisory committee to promote well-paying careers in skilled trades for young Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Whether building homes, repairing vehicles, or powering our communities, people in the skilled trades provide services Canadians rely on every single day. That is why, in Budget 2019, we announced funding to help more people – including young people and underrepresented groups, like women – pursue a career in the skilled trades.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the creation of a new advisory committee to help promote apprenticeships and skilled trades across Canada.</p>\n\n<p>The advisory committee currently includes the following members, with further announcements to come:</p>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/08/16/ministerial-advisory-committee-member-biographies#MandyRennehan\">Mandy Rennehan</a>, Founder and CEO of Freshco</li>\n\t<li><a href=\"/en/news/backgrounders/2019/08/16/ministerial-advisory-committee-member-biographies#JamieMcMillan\">Jamie McMillan</a>, Ironworker and Founder of KickAss Careers</li>\n\t<li><a href=\"/en/news/backgrounders/2019/08/16/ministerial-advisory-committee-member-biographies#MattWayland\">Matt Wayland</a>, Executive Assistant to the International Vice-President and Canadian Director of Government Relations for the International Brotherhood of Electrical Workers</li>\n</ul>\n\n<p>The advisory committee will lay the groundwork for a national campaign to encourage apprenticeships and promote the skilled trades as a career of choice. They will lead consultations, explore partnerships, and provide advice to the Minister of Employment, Workforce Development and Labour.</p>\n\n<p>Canada’s skilled trades workers keep our country running and help our communities thrive. The Government of Canada has made key investments to support skilled trades workers and make sure people in underrepresented groups have the opportunities they need to enter the trades. With today’s announcement, we are building on these measures, and helping more young people pursue good, well-paying careers in the trades.</p>\n\n<h2><strong>Quotes</strong></h2>\n\n<blockquote>\n<p>“Canadians count on tradespeople every day. They power our industries, keep our vehicles and public transit moving, and build the places we call home. By promoting in‑demand careers in the trades, we can help more young people find good, well-paying jobs and build a stronger economy for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The skilled trades offer well-paying middle class jobs but many young people never consider this as a first choice career option. A national apprenticeship campaign will encourage Canadians to enter the skilled trades, build our communities and keep the Canadian economy growing.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Employment, Workforce Development and Labour</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In Budget 2019, the Government of Canada announced $6 million over two years to create a national campaign to promote skilled trades to young people.</li>\n\t<li>Canada will need 67,000 new journeypersons to sustain our workforce in the 10 largest <a href=\"http://www.red-seal.ca/about/pr.4gr.1m-eng.html\">Red Seal</a> trades by 2023.</li>\n\t<li>Young women continue to be less likely than young men to express interest in a career in the skilled trades. According to an OECD survey, only 2 percent of 15-year-old female students were planning to pursue a career in the skilled trades.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/08/16/ministerial-advisory-committee-member-biographies\">Ministerial advisory committee member biographies</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2019/08/backgrounder-government-of-canada-investments-in-the-skilled-trades.html\">Government of Canada investments in the skilled trades</a></li>\n</ul></div>\n      "
}