{
  "path": "/en/news/statements/2021/03/08/statement-prime-minister-announcing-national-day-observance-covid-19",
  "pageTitle": "Statement by the Prime Minister announcing a National Day of Observance for COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement to announce the Government of Canada is designating March 11, 2021, as a National Day of Observance to commemorate the people who lost their lives and the significant impacts we have all felt because of COVID-19:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Early last year, our lives, and the lives of everyone around the world, were forever changed by the emergence of COVID-19. Today – one year after the first known death of a Canadian to the disease – we now mourn the tragic loss of more than 22,000 parents, siblings, friends, and loved ones. &nbsp;&nbsp;</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“COVID-19 has infected over 864,000 other Canadians, and has had an immeasurable impact on how we all work and learn, connect with friends and family, and live our daily lives. All Canadians have experienced sacrifice and loss over the past year. Our kids have missed birthday parties, seniors have felt isolated from the ones they love, and for far too many, this virus has meant the loss of their job or the closure of their business. </span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Our health care and other essential workers have put themselves at risk, working long hours, so we could get the services and care we needed. And as efforts continue to get vaccines to every Canadian as quickly as possible, we thank them now more than ever.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“During this crisis, Canadians have remained resilient. They have helped neighbours, given to organizations, put signs in their windows to support our health care workers, and lent a hand wherever possible. As we continue to deal with the impacts of the global pandemic, your government will continue to do whatever it takes, for however long it takes, to support you – because here in Canada, we help each other through challenging times.&nbsp; </span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“We all have a role to play in ending this pandemic, and the crisis is not over yet. In recognition of how far we have come and how far we still have to go, the Government of Canada is designating March 11, 2021, as a National Day of Observance. On this day, I invite all Canadians to join together in honouring the memory of those we have lost, and the people they left behind. We will also recognize everyone who has been impacted by COVID-19, and pay tribute to all those who continue to work hard and make incredible sacrifices in our fight against the virus. Together, we will beat COVID-19.”</span></span></span></p></div>\n      "
}