{
  "path": "/en/news/statements/2022/04/25/statement-prime-minister-national-immunization-awareness-week",
  "pageTitle": "Statement by the Prime Minister on National Immunization Awareness Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark National Immunization Awareness Week, which runs from April 23 to 30, 2022:</p>\n\n<p>“Today, as we mark the 20th National Immunization Awareness Week, I want to take the opportunity to thank Canadians for taking part in the largest vaccination campaign in our country’s history. From coast to coast to coast, people turned out in unprecedented numbers to help protect themselves, their families and communities from COVID‑19. Thanks to these efforts, we are getting us back to doing the things we love, while growing the economy and creating good jobs.</p>\n\n<p>“To date, over 85 per cent of eligible people in Canada are vaccinated with two doses, and more than 18&nbsp;million Canadians have already received booster shots. We know that vaccines are one of the best tools to help fight COVID-19 and I encourage Canadians who have not received their vaccines and boosters to do so as soon as they can.</p>\n\n<p>“This pandemic further illustrated what we have known for a long time: vaccination is a proven and effective public health tool. Vaccines have contributed to protecting generations of Canadians from diseases that put our health at risk and threaten our lives. During the pandemic, many in Canada and around the world have fallen behind in routine vaccinations for other vaccine-preventable diseases, so I encourage all Canadians to stay up to date on their routine vaccinations, such as annual flu vaccines.</p>\n\n<p>“Delivering safe and effective COVID-19 vaccines and strengthening Canada’s life sciences and bio manufacturing capabilities has been a key part of keeping Canadians healthy, while creating jobs and growing the economy. The Government of Canada is investing in bio manufacturing, supporting the development of domestic vaccine and therapeutic candidates, and advancing targeted research to help enhance Canada’s resilience and innovation capabilities. More than $1.6&nbsp;billion have been invested to support 30 projects, from AbCellera in Vancouver to BioVectra in Charlottetown. Through these efforts, we are better equipped to continue responding effectively to the COVID-19 pandemic and deal with future pandemics by leveraging Canada’s industrial capabilities and world-leading science.</p>\n\n<p>“To end the pandemic anywhere, we have to end it everywhere. On the world stage, Canada is delivering millions of vaccines to those who need it most, while ensuring the equitable distribution of COVID‑19 tests, treatments, and vaccines through <a href=\"https://www.who.int/initiatives/act-accelerator\">Access to COVID‑19 Tools (ACT) Accelerator</a>.</p>\n\n<p>“This National Immunization Awareness Week, I want to join all Canadians in thanking the front-line immunizers, health care workers, public health professionals, and scientific researchers across Canada who all continue to work hard to help keep us safe and healthy. Thanks to you – and to the efforts of Canadians across the country – we are recovering from the pandemic and building a better future for everyone.”</p></div>\n      "
}