{
  "path": "/en/news/news-releases/2021/07/05/new-investment-canadas-steel-industry-create-jobs-and-build-cleaner",
  "pageTitle": "New investment in Canada’s steel industry to create jobs and build a cleaner future | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we work to finish the fight against COVID-19, the Government of Canada is taking action to ensure that Canadian companies have the tools and resources they need to build strong communities and a cleaner future for Canadians. By investing in clean technology, we will create good middle class jobs, strengthen our economy, cut pollution, and build back better for all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Algoma Steel Inc. will receive up to $420&nbsp;million to retrofit their operations and phase out coal-fired steelmaking processes at their facility in Sault Ste. Marie, Ontario.</p>\n\n<p>This funding will enable the company to purchase state-of-the-art equipment to support its transition to Electric-Arc Furnace production. This electricity-based process is expected to cut greenhouse gas (GHG) emissions by more than 3 million metric tonnes per year by 2030, making a meaningful contribution to achieving Canada’s climate goals. This is equivalent to taking more than 900,000 passenger vehicles off the road – almost the number of passenger vehicles in Toronto.</p>\n\n<p>The investment will create 500 well-paying jobs, through the project’s construction phase and subcontracting, and will create over 600 new co-op placements for students. Additionally, 75 employees at Algoma will be trained for high-skilled jobs in the science, technology, engineering, and mathematics (STEM) fields.</p>\n\n<p>Our country’s steel producers provide thousands of good middle class jobs to Canadians, and we need to ensure they remain a vital part of our economy as we transition to a cleaner future. Like Canadians across the country, the people of Sault&nbsp;Ste. Marie have shown incredible strength and resilience since the beginning of the pandemic, and today’s announcement will help support a strong economic recovery for their community. The government will continue to support innovative projects that help us tackle climate change, achieve our environmental goals, and create new opportunities for workers and businesses alike.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Investments in clean technology benefit the environment and our economy. Today’s announcement is great news for the people of Sault Ste. Marie. It will help Algoma Steel create good middle class jobs and cut pollution, while positioning Canada as a leader in cleaner and greener steelmaking. The government will continue to support Canadian businesses and workers as we accelerate our transition to a clean-growth economy that leaves no one behind.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are proud to support companies like Algoma Steel Inc. that are seizing the opportunities to lead in the low carbon economy. Today’s investment will ensure that one of Canada’s largest steel producers will play a key part in Canada’s economic recovery and make significant progress towards our climate targets. Our focus on a green recovery means creating good jobs in communities like Sault Ste. Marie and helping us achieve our ambitious target of net-zero by 2050.”</p>\n\n<footer class=\"default\">The Hon. Francois-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“We need to make sure we have the cleanest manufacturing in the world. The Canada Infrastructure Bank’s support to help Algoma Steel decarbonize steelmaking is good for Canadian jobs and the economy and critical to tackling climate change.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“This project, when fully executed, will significantly reduce greenhouse gases, strengthen the competitiveness of the Canadian steel industry, and solidify local economic growth potential. This retrofit of industrial infrastructure is an example of the Canada Infrastructure Bank’s $10B Growth Plan in action.”</p>\n\n<footer class=\"default\">Ehren Cory, Chief Executive Officer, Canada Infrastructure Bank</footer>\n</blockquote>\n\n<blockquote>\n<p>“The 70 per cent carbon reduction resulting from Algoma’s proposed transformation to Electric-Arc Furnace technology represents one of the lowest cost-per-tonne opportunities to achieve large-scale sustainable GHG reductions in Canada. The world can’t get to net-zero without steel. The combination of an Electric-Arc Furnace with Ontario’s low carbon electricity will give our customers and infrastructure investments a green steel advantage. We are most grateful for the Government of Canada’s leadership on this front, and their commitment in support of Algoma Steel’s sustainability transformation.”</p>\n\n<footer class=\"default\">Michael McQuade, Chief Executive Officer, Algoma Steel Inc.</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Headquartered in Sault Ste. Marie, Ontario, Algoma Steel Inc. employs approximately 2,600 Canadians and is Canada’s only fully integrated producer of steel plates, making it a leader in the production of hot- and cold-rolled steel sheet, strip, and plate.</li>\n\t<li>As part of this investment of up to $420 million, Algoma Steel will receive up to $200 million from the Strategic Innovation Fund’s Net Zero Accelerator initiative and $220 million from the Canada Infrastructure Bank. The total cost of Algoma’s project is $703&nbsp;million.</li>\n\t<li>The Canada Infrastructure Bank (CIB) is investing $35&nbsp;billion, and partnering with private and institutional investors as well as other levels of government and Indigenous communities, to support new revenue-generating infrastructure projects, support economic growth, and take action on climate change. Today’s announcement is part of the CIB’s goal to attract private and institutional capital into green infrastructure and reduce GHG emissions through retrofits, as announced in its $10B Growth Plan last year.</li>\n\t<li>All CIB investments are subject to due diligence and final approval by its Board of Directors.</li>\n\t<li>The Government of Canada launched the Net Zero Accelerator in December 2020, as part of its strengthened climate plan,&nbsp;<em>A Healthy Environment and a Healthy Economy</em>. Through this initiative and with additional funding announced in Budget 2021, the government is investing $8 billion over seven years to accelerate decarbonization projects with large GHG emitters, the transition to clean technologies, and Canada’s industrial transformation across all sectors.</li>\n\t<li>In November 2020, the government introduced Bill C-12, the <em>Canadian Net-Zero Emissions Accountability Act</em>, to establish a legally binding process to achieve net-zero emissions by 2050, set rolling five-year emissions-reduction targets, and require plans to reach each target and report on progress. The legislation received Royal Assent in June 2021.</li>\n\t<li>The steel industry currently accounts for 7 per cent of global GHG emissions from the energy industries – equal to global aviation, shipping, and chemicals emissions combined.</li>\n\t<li>In 2019, the Canadian steel industry employed over 25,000 workers and contributed $3.8 billion to Canada’s gross domestic product.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.algoma.com/\">Algoma Steel Inc.</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/00039.html\">Net Zero Accelerator</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/12/a-healthy-environment-and-a-healthy-economy.html\"><em>A Healthy Environment and a Healthy Economy</em></a></li>\n\t<li><a href=\"https://cib-bic.ca/en/\">Canada Infrastructure Bank</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/01/prime-minister-announces-infrastructure-plan-create-jobs-and-grow\">Prime Minister announces infrastructure plan to create jobs and grow the economy</a></li>\n</ul></div>\n      "
}