{
  "path": "/en/news/news-releases/2019/08/14/government-canada-partners-municipalities-create-jobs-and-improve",
  "pageTitle": "The Government of Canada partners with municipalities to create jobs and improve quality of life for Ontarians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Whether getting people to work on time, building recreation centres for young people, or helping communities adapt to climate change, investments in local infrastructure create good, middle class jobs and make our cities and towns better places to live.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Niagara, Ontario, to highlight a one-time Municipal Infrastructure Top-Up in Budget 2019, which doubles this year’s federal transfer to municipalities in support of local infrastructure projects.</p>\n\n<p>More than 600 communities and local roads boards in Ontario are benefitting from the first of two $408.3 million annual installments in federal funding in 2019-20 for local infrastructure projects. These transfers – along with the one-time top-up of $819.4 million – mean that more than $1.6 billion in federal funding is going to Ontario municipalities this year for the infrastructure projects they need.</p>\n\n<p>Communities across Ontario are using the federal funding for a range of different projects. The Township of Tiny is installing a storm water drainage system to protect residents and businesses from damage due to flooding. The Municipality of Chatham-Kent is replacing the Thamesville Bridge to provide safer, easier travel for residents and visitors, while the Toronto Transit Commission is using the federal funding for new subway cars and streetcars to help make services more reliable for transit users.</p>\n\n<p>By working more closely with municipalities, the Government of Canada is making sure that communities across the country have the tools they need to complete important infrastructure projects and make life easier and more affordable for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“This year, we’re doubling the amount of money that municipalities get through the federal transfer in support of local infrastructure projects. What that means for people in Ontario is an extra $819 million for projects that matter to you. With this funding, communities across the province can focus on the infrastructure projects their residents need most. By funding local infrastructure, we’re creating good, middle class jobs, growing our economy, and investing in Canadians and their future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is proud to deliver this stable, predictable long-term funding that communities rely on to develop their public infrastructure. By working with other orders of government, we are making significant progress and delivering concrete results for all Canadians. From improving roads, water services and energy efficiency, to improving transit systems and enhancing recreation and tourism centres, the federal Gas Tax Fund is helping keep families safe, promote economic development and improve people’s quality of life across the country.”</p>\n\n<footer class=\"default\">The Honourable François-Philippe Champagne, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government wants to find smarter and more efficient ways to make life better for all Ontarians. This funding helps support critical local infrastructure, such as drinking water, roads and parks. We’re working closely with municipalities, because they know what their local community needs and at the end of the day, there is only one taxpayer.”</p>\n\n<footer class=\"default\">The Honourable Steve Clark, Ontario Minister of Municipal Affairs and Housing</footer>\n</blockquote>\n\n<blockquote>\n<p>“Thanks to the Government of Canada’s ‘top-up’ to the federal Gas Tax Fund, municipalities in Ontario will be able to move forward on thousands of infrastructure projects. The funds, which flow directly to municipal governments, help build and improve on the infrastructure people use most often, including local roads, public transit, water systems, recreation and much more.”</p>\n\n<footer class=\"default\">Jamie McGarvey, President of the Association of Municipalities of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“The federal government’s commitment to Toronto through the federal Gas Tax Fund reflects a positive relationship between the City and our federal counterparts. It’s these types of partnerships which ensure we can move our city forward. This funding makes it possible for our City to invest in key infrastructure priorities to continue Toronto’s ongoing success.”</p>\n\n<footer class=\"default\">His Worship, John Tory, Mayor of Toronto</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Gas Tax Fund is a strong investment model to build on because it is a direct and reliable tool for municipalities to plan and deliver. The federal government recognized the value of this funding tool by doubling this year’s Gas Tax Fund transfer in Budget 2019— a transformative step forward welcomed by local governments. Right now, municipalities all across Canada are using every new dollar approved in Budget 2019 to deliver on renewal projects quickly and efficiently.\"&nbsp;</p>\n\n<footer class=\"default\">&nbsp;Bill Karsten, President of the Federation of Canadian Municipalities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>With many municipalities across Canada facing serious infrastructure needs, Budget 2019 proposes a one-time transfer of $2.2 billion in 2019-20 through the federal Gas Tax Fund to address short-term priorities in municipalities and First Nations communities. The amount of this one-time top up is based on the amount each recipient was allocated for the 2018-19 Gas Tax Fund transfer.</li>\n\t<li>Projects under this fund can be used for:\n\t<ul>\n\t\t<li>Productivity and economic growth – including highways and local roads, public transit, and regional and local airports</li>\n\t\t<li>Clean environment – including drinking water, wastewater, and community energy systems</li>\n\t\t<li>Strong cities and communities – including sport and recreation, cultural and tourism, and capacity building</li>\n\t</ul>\n\t</li>\n\t<li>The two federal Gas Tax Fund installments for this year, along with the one-time top-up, flow to municipalities through the Association of Municipalities of Ontario, with the exception of the Toronto allocation that flows directly to the City of Toronto. A portion of the annual provincial allocation is also used by the province to improve rural roads in northern Ontario on behalf of local roads boards.</li>\n\t<li>The federal Gas Tax Fund delivers over $2 billion every year to over 3,600 communities across the country. In recent years the funding has supported approximately 4,000 projects each year.</li>\n\t<li>The federal Gas Tax Fund is flexible in allowing communities to apply funding to their most pressing local needs. Communities can invest across 18 different project categories, including transit, recreation, water systems and roads. They can also use the funds immediately for priority projects, bank them for later use, pool the dollars with other communities for shared infrastructure projects, or use them to finance major infrastructure expenditures.</li>\n\t<li>Through its Investing in Canada plan, the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li>\n\t<li>To date, more than 48,000 projects have been approved under the plan and the majority of these projects are either underway, or already completed<strong>.</strong></li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/08/14/ontarios-2019-20-federal-gas-tax-fund-allocations\">Backgrounder: Ontario’s 2019-20 federal Gas Tax Fund allocations</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/home-accueil-en.html\">Budget 2019</a></li>\n\t<li><a href=\"http://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada, Canada’s long-term infrastructure plan</a></li>\n\t<li><a href=\"http://www.infrastructure.gc.ca/investments-2002-investissements/on-eng.html\">Federal infrastructure investments in Ontario</a></li>\n\t<li><a href=\"http://www.infrastructure.gc.ca/plan/gtf-fte-eng.html\">The federal Gas Tax Fund</a></li>\n\t<li><a href=\"https://www.gastaxatwork.ca/\">The federal Gas Tax Fund in Ontario</a></li>\n</ul></div>\n      "
}