{
  "path": "/en/news/news-releases/2020/03/02/making-zero-emissions-vehicles-more-affordable",
  "pageTitle": "Making zero-emissions vehicles more affordable | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians expect their government to take ambitious action to protect our environment, while growing our economy and creating new jobs and opportunities for workers and businesses. To do this, we must support measures to accelerate Canada’s clean energy transition and help our businesses adopt the sustainable technologies of the future.</p>\n\n<p>Today, at the global mineral exploration and mining convention hosted by the Prospectors &amp; Developers Association of Canada, the Prime Minister, Justin Trudeau, announced that the government intends to propose a new incentive that would make it more affordable for Canadian businesses to invest in zero-emission vehicles and automotive equipment.</p>\n\n<p>To help Canada achieve its climate goals and keep our industries competitive, the Government of Canada intends to extend the existing zero emission vehicle incentive to include off-road vehicles. This incentive would provide a 100 per cent write-off of the purchase cost of eligible zero-emission vehicles and automotive equipment in the year they are put in use. &nbsp;</p>\n\n<p>This new incentive would encourage businesses, including in sectors like mining, transportation, and agriculture, to take advantage of opportunities to upgrade to newer, cleaner technologies.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We are supporting businesses that are making investments today to help protect our environment for future generations. By making it more affordable for Canadian businesses to make the switch to zero-emission technologies, we can help accelerate our transition to a low-carbon, clean-growth economy and create good middle-class jobs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Building on measures announced in Budget 2019, this new incentive would make it easier for more businesses to be a part of the clean economy and invest in the technologies of the future. By supporting businesses to convert to zero-emission fleets and equipment, we can ensure they will have more money to invest and create jobs.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government believes in the power of clean technology to create jobs and drive innovation. With today’s announcement, we are proud to continue helping Canadian industry seize the momentum of this clean growth century, so that Canadians can benefit from this fast-growing market now and in the future.”</p>\n\n<footer class=\"default\">The Hon. Seamus O’Regan, Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada intends to expand the temporary incentives announced in Budget 2019 for on-road vehicles, so that incentives would now also apply to off-road vehicles and automotive equipment. This proposed tax relief in support of increased investment on the part of businesses is estimated at $62 million over the 2020-21 to 2024-25 period.</li>\n\t<li>Since March 19, 2019, businesses have been able to claim 100 per cent of the cost of the purchase of on-road passenger vehicles up to a limit of $55,000 per eligible vehicle purchase.</li>\n\t<li>Under this new incentive, to be eligible for an income tax deduction of 100 per cent, vehicles would need to be available for use before 2024. The deduction allowance would decrease to 75 per cent for 2024 and 2025, and would decrease to 55 per cent for 2026 and 2027. Vehicles that are not available for use before 2028 would not be eligible for the accelerated deduction allowance.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.tc.gc.ca/en/services/road/innovative-technologies/zero-emission-vehicles.html\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/business-investment-in-zero-emission-automotive-vehicles-and-equipment.html\">Business Investment in Zero-Emission Automotive Vehicles and Equipment</a></li>\n</ul></div>\n      "
}