{
  "path": "/en/news/news-releases/2020/08/31/new-measures-ensure-supply-future-vaccines-and-therapies-against",
  "pageTitle": "New measures to ensure the supply of future vaccines and therapies against COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s ability to defeat COVID-19 depends on the development, production, and distribution of an effective and proven vaccine. That is why the Government of Canada is working closely with researchers and scientists to better understand the virus and protect the health of Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that agreements in principle have been reached with Johnson&nbsp;&amp; Johnson and Novavax to procure millions of doses of experimental COVID‑19 vaccines. These agreements add to those already reached with Pfizer and Moderna, which were made following the recommendations of the COVID-19 Vaccine Task Force.</p>\n\n<p>With these additional agreements in place, Canada has now secured access to four of the leading vaccine candidates. The government will continue to negotiate and sign other agreements with a number of leading pharmaceutical companies, to ensure the supply of potential vaccines in Canada.</p>\n\n<p>The Prime Minister also announced funding to establish a new biomanufacturing facility at the Human Health Therapeutics Research Centre in Montréal. Through a public-private partnership, the new building will enable the National Research Council of Canada (NRC) to increase vaccine manufacturing to up to two million doses per month by next year. This will help ensure our country’s ability to produce enough doses of the vaccine for Canadians who need them, such as front line workers, long-term care workers, and those at risk of becoming seriously ill if they contract COVID-19.</p>\n\n<p>The Government of Canada will continue to explore and pursue all promising options to ensure the supply of potential vaccines and better protect the health and safety of Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As we continue to work together to limit the impact of the COVID-19 pandemic on the health of Canadians, as well as its social and economic effects, we must also maximize our chances of defeating the virus. To do this, we need to invest in the development of several promising vaccines and ensure that we can manufacture and distribute the vaccine to as many Canadians as possible, as quickly as possible. That is how we will move forward on a sustainable path to a full recovery.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is committed to delivering safe and effective treatments and vaccines against COVID-19. We must therefore grow our biomanufacturing capacity here in Canada. The funding announced today for this new facility will help the NRC increase production of potential vaccine doses to up to two million per month. It will also help manufacture vaccines for clinical trials and priority populations.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“We will continue to ensure that the Government of Canada is doing everything possible to make a safe and effective COVID-19 vaccine available to Canadians. Today’s announcement marks an important milestone in our efforts to protect Canadians from COVID-19 as soon as possible.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we continue our work to purchase the supplies and equipment that are necessary to combat the COVID-19 pandemic, we remain equally focused on planning for the future, including securing potential vaccines for Canadians. We are taking an aggressive approach in procuring a portfolio of the most promising vaccine candidates in order to ensure that Canadians will have access to them as quickly as possible once they have been approved.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada will invest $126&nbsp;million over two years to build the new facility. The government will then provide $20&nbsp;million per year to cover operating costs.</li>\n\t<li>The NRC facilities at the Human Health Therapeutics Research Centre bring together a variety of specialists, equipment, and expertise. They provide a full range of services to therapeutics developers, from preclinical discovery to biomanufacturing, characterization, purification, and the creation of materials for technology transfer.</li>\n\t<li>The Government of Canada has now signed agreements with the following companies to obtain vaccines:\n\t<ul>\n\t\t<li>Johnson &amp; Johnson, which will supply up to 38&nbsp;million doses of its vaccine candidate Ad26.COV2.S.</li>\n\t\t<li>Novavax, which will supply up to 76&nbsp;million doses of its vaccine candidate NVX-CoV2373.</li>\n\t\t<li>Pfizer, which will supply a minimum of 20&nbsp;million doses of its mRNA-based vaccine candidate, BNT162. The government is negotiating with the company to have the agreement include options for obtaining additional doses.</li>\n\t\t<li>Moderna, which will supply up to 56&nbsp;million doses of its vaccine candidate mRNA-1273.</li>\n\t</ul>\n\t</li>\n\t<li>Currently, no vaccines have been approved to prevent COVID-19. Many vaccines are in clinical trials or under development. When additional studies have been completed, Health Canada will review the evidence of safety, efficacy, and manufacturing quality for each vaccine to determine whether individual vaccines will be approved for use in Canada, before they are used to vaccinate Canadians.</li>\n\t<li>In the spring of 2020, the Government of Canada announced a total of $44&nbsp;million in funding to allow the NRC to upgrade its facilities at the Human Health Therapeutics Research Centre. This investment will ensure that the facility complies with good manufacturing practices related to the development, testing, and scale-up and production of promising vaccine candidates. It will also enable the preliminary production of 250,000 doses of vaccine per month starting in November 2020.</li>\n\t<li>On April 23, 2020, the Government of Canada announced an investment of more than $1&nbsp;billion through the Plan to Mobilize Science to fight COVID-19. This funding will be used to develop a vaccine and treatments, as well as to track the virus. Of this amount, $600&nbsp;million will support private sector work to develop a vaccine, conduct therapeutic clinical trials, and pursue biomanufacturing opportunities in Canada.</li>\n\t<li>The Government of Canada is also securing the equipment and supplies needed for the final phases of manufacturing and packaging for vaccine production in Canada. It is also purchasing the equipment required for safe and effective immunization, including syringes, needles, and alcohol swabs.</li>\n</ul>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2020/08/government-of-canada-announces-major-steps-in-treating-and-preventing-covid-19-through-vaccines-and-therapies.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en/corporate/covid-19-vaccine-task-force\">COVID-19 Vaccine Task Force</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/lsg-pdsv.nsf/eng/hn01780.html\">COVID-19 Therapeutics Task Force</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n</ul></div>\n      "
}