{
  "path": "/en/news/statements/2017/06/01/statement-prime-minister-canada-response-united-states-decision-withdraw",
  "pageTitle": "Statement by the Prime Minister of Canada in response to the United States’ decision to withdraw from the Paris Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement in response to the United States’ decision to withdraw from the Paris Agreement:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“We are deeply disappointed that the United States federal government has decided to withdraw from the Paris Agreement. Canada is unwavering in our commitment to fight climate change and support clean economic growth. Canadians know we need to take decisive and collective action to tackle the many harsh realities of our changing climate. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“While the U.S. decision is disheartening, we remain inspired by the growing momentum around the world to combat climate change and transition to clean growth economies. We are proud that Canada stands united with all the other parties that support the Agreement. We will continue to work with our domestic and international partners to drive progress on one of the greatest challenges we face as a world. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This is not only about the huge economic opportunities of clean growth and the need to address the pressing threats of climate change. This is about an ambitious and unshakeable desire to leave a cleaner, healthier and more sustainable planet for our kids and for generations to come. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“We are all custodians of this world, and that is why Canada will continue to work with the U.S. at the state level, and with other U.S. stakeholders, to address climate change and promote clean growth. We will also continue to reach out to the U.S. federal government to discuss this matter of critical importance for all humankind, and to identify areas of shared interest for collaboration, including on emissions reductions.”</span></p></div>\n      "
}