{
  "path": "/en/news/statements/2016/10/10/statement-prime-minister-canada-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on World Mental Health Day:</p>\n<p>“World Mental Health Day is a time to reflect on the importance of mental health and wellness, and to foster open discussion in our families, places of work, and communities.</p>\n<p>“This year’s theme, <em>Psychological First Aid</em>, brings attention to the impact a helping hand can have in the life of someone experiencing a traumatic event or difficult change. Thousands of Canadians provide much needed social and psychological first aid to those who need it most: from the paramedic speaking with someone who has just witnessed a violent accident; to the immigrant services worker helping a refugee claimant integrate successfully into a new community; to a family member, friend, or colleague supporting someone close to them.</p>\n<p>“In recognition of the importance of mental health and wellness, the Government of Canada is taking action to help Canadians create resilient communities that are supportive of mental well-being. This includes working with provincial and territorial governments, Indigenous Peoples, community partners, and other stakeholders to address the stigma attached to mental health issues, and to improve access to quality mental health services.</p>\n<p>“On behalf of the Government of Canada, I would like to thank all those Canadians providing assistance and care to those facing mental health issues. I would also like to thank all those – including my mother Margaret – who have contributed to the public discussion on mental wellness through the openness and courage they have shown in sharing their personal struggles.”</p></div>\n      "
}