{
  "path": "/en/news/news-releases/2023/03/16/prime-minister-announces-canadian-ceremony-mark-coronation-his",
  "pageTitle": "Prime Minister announces Canadian ceremony to mark the Coronation of His Majesty King Charles III | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In less than two months, Canada will mark the Coronation of its new monarch, His Majesty King Charles&nbsp;III.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that a ceremony will be held in Ottawa for His Majesty’s Coronation on May 6, 2023, beginning a new chapter in our country’s history. The ceremony will acknowledge the special relationship His Majesty has had with Canada for over 50 years and celebrate his reign as King of Canada.</p>\n\n<p>The event will include speeches, artistic performances, and special unveilings. Dignitaries from the Table of Precedence of Canada, including members of the King’s Privy Council for Canada, eminent Canadians, and individuals with ties to causes dear to His Majesty will be in attendance.</p>\n\n<p>His Majesty’s Coronation in the United Kingdom will take place at Westminster Abbey, in London, on the same day. It will be followed by various public events on May 7 and 8, 2023, including a Coronation Concert at Windsor Castle. The Canadian delegation attending the Coronation Service will be announced in the coming weeks.</p>\n\n<p>On May 6 and 7, 2023, Canadians will celebrate the King’s Coronation in communities across the country. They will also be invited to take part in activities organized at Rideau Hall, where they will be able to visit the Residence of the Governor General and learn more about the Canadian Crown.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“His Majesty has a long history and a special relationship with Canada, and we look forward to celebrating his Coronation in May. In addition to the ceremony in Ottawa, I invite Canadians to take part in events and activities that will take place in their communities to mark this important occasion. Together, we look to the future and the continued betterment of the Commonwealth and its people.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>Canada is a constitutional monarchy, and The King is Canada’s Head of State.</li>\n\t<li>His Majesty King Charles&nbsp;III acceded to the Throne on September 8, 2022, following the passing of Queen Elizabeth&nbsp;II.</li>\n\t<li>His Majesty and the Queen Consort, then Prince of Wales and Duchess of Cornwall, last visited Canada in 2022 as part of a <a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/19/prime-minister-marks-end-successful-royal-tour\">three-day Royal Tour</a>, with stops in Newfoundland and Labrador, the National Capital Region, and the Northwest Territories, to celebrate the Platinum Jubilee of Queen Elizabeth&nbsp;II, marking the 70th anniversary of her accession to the Throne.</li>\n\t<li>Details on how to watch the Canadian ceremony in Ottawa will be provided in the coming weeks.</li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"http://www.canada.ca/coronation\">Canadian Celebrations of His Majesty King Charles&nbsp;III’s Coronation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/monarchy-crown.html\">Monarchy and the Crown</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/10/statement-prime-minister-proclamation-accession-his-majesty-king-charles\">Statement by the Prime Minister on the proclamation of the accession of His Majesty King Charles&nbsp;III</a></li>\n</ul></div>\n      "
}