{
  "path": "/en/news/statements/2021/11/20/statement-prime-minister-national-child-day",
  "pageTitle": "Statement by the Prime Minister on National Child Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Child Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/public-health/services/national-child-day.html\">National Child Day</a>, we celebrate the rights of children, the fearless leaders of today and tomorrow, and recommit to helping them lead fulfilling lives. We all play a role in ensuring that they are protected from harm, that they are loved and cared for, and have the tools and resources they need to succeed.</p>\n\n<p>“National Child Day commemorates the adoption of the United Nations Convention on the Rights of the Child. This year also marks the 30th anniversary of Canada’s ratification of the Convention. Since then, the Government of Canada has introduced laws, programs, and policies to advance children’s rights related to their protection, provision for their needs and development, and participation in decisions that affect their lives. For example, in March 2021, the government introduced changes to the <em>Divorce Act </em>to focus on children’s best interests, and specifically require that courts consider their views and preferences.</p>\n\n<p>“The COVID-19 pandemic has made life more difficult for Canadian families. This year, the Government of Canada has taken concrete steps to help children and their parents better cope with the pressures of the pandemic, including through the <a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html\">Canada Child Benefit</a> (CCB). Since its introduction in 2016, the CCB has given nine out of ten Canadian families with children more money, to assist with the high cost of raising them, and has helped lift 435,000 children out of poverty.</p>\n\n<p>“Now, as we build back a better country from the COVID-19 pandemic, the government continues to take action to support children and families, including through a Canada‑wide early learning and child care system that will provide parents with, on average, $10-a-day child care by 2025-26. This plan will give Canadian children the best possible start in life, while creating new jobs, getting more people back into the workforce, and growing the middle class. To date, we have signed agreements with eight provinces and one territory, and we continue to work with the remaining jurisdictions, as well as with Indigenous partners, to deliver the best early learning and child care system to all children and families in Canada.</p>\n\n<p>“While we continue to make important progress, we know that there is still much work to do to provide Indigenous children and their families with services that better meet their needs. Every Indigenous child deserves to grow up in their community⁠, surrounded by their loved ones, and immersed in their culture. This past July, the Government of Canada signed a historic Coordination Agreement on child and family services with Cowessess First Nation – Treaty&nbsp;4 Territory – and the Province of Saskatchewan. This agreement – the first of its kind – ensures the community can effectively exercise their jurisdiction and make their own decisions about what is best for their children and families. The government will continue to work with Indigenous partners to implement more agreements with communities across the country. We will continue to support First Nations, Inuit, and Métis partners in their development of child and family services that help reflect the communities’ needs, values, and traditions.</p>\n\n<p>“Additionally, as Canadians continue to come to terms with the tragedy of the unmarked graves and burial sites located near former residential schools, we will ensure that Indigenous women, children, and 2SLGBTQQIA+ people&nbsp;are protected against all forms of violence and discrimination. We will also continue to work to ensure Indigenous children have equitable access to education and health services, a safe home, and clean drinking water.</p>\n\n<p>“Over the past year and a half, Canadian children and youth have displayed incredible resilience as they have had to distance from their loved ones, adjust how and where they learn, and miss out on social gatherings. We recognize the impact the pandemic has had on children and have invested in mental health services, including <a href=\"https://kidshelpphone.ca/\">Kids Help Phone</a>, to ensure that children and youth have access to the supports they need. We also provided $2&nbsp;billion in funding, as part of the Safe Return to Class Fund, to support provinces and territories in their efforts to ensure students, teachers, and staff stay safe and healthy throughout the school year.</p>\n\n<p>“We know that vaccines are one of the most effective ways to protect ourselves, our families, and our communities from COVID-19. Children under the age of 12 have waited patiently while teenagers and adults continue to get their shots, and now, children between the ages of five and 11 will be able to get vaccinated, as Health Canada approved the Pfizer-BioNTech Comirnaty COVID-19 vaccine for this age group yesterday. As vaccines for eligible children become available, the government will continue to work with provinces, territories, and Indigenous partners to distribute doses across the country and to ensure&nbsp;parents and&nbsp;guardians&nbsp;are supported in making informed decisions on COVID-19&nbsp;vaccination.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I invite all Canadians to join us in celebrating National Child Day, learning about the importance of children’s rights, and reflecting on how we can make Canada a better place for all children, especially those who face systemic barriers. Together, we can take steps toward ensuring that all children live up to their full potential in a safe environment, where they have the opportunity to reach their goals and accomplish their dreams.”</p></div>\n      "
}