{
  "path": "/en/news/statements/2021/11/17/statement-prime-minister-selection-new-premier-nunavut",
  "pageTitle": "Statement by the Prime Minister on the selection of the new premier of Nunavut | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the selection of P.J. Akeeagok as the new premier of Nunavut:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate P.J. Akeeagok, who was chosen to serve as the new premier of Nunavut by the Nunavut Leadership Forum.</p>\n\n<p>“The Government of Canada is continuing to work with territorial partners in Nunavut in support of the ongoing response to the contamination impacting the drinking water supply in Iqaluit. Members of the Canadian Armed Forces are currently in Iqaluit, helping with the water emergency and providing clean drinking water for distribution to residents.</p>\n\n<p>“As we build back from the COVID-19 pandemic, we will continue to take action and shape a future where northern and Arctic communities are thriving, strong, and safe. Guided by the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Arctic and Northern Policy Framework</a>, the Government of Canada will also keep working with Indigenous, territorial, and provincial partners to ensure that Inuit, Nunavummiut, and all Northerners have access to the same services and opportunities as other Canadians.</p>\n\n<p>“I look forward to collaborating closely with Premier Akeeagok and the Government of Nunavut on important priorities, including addressing the impacts of climate change in the North, providing Nunavummiut with affordable housing and child care, and advancing reconciliation with Inuit and other Indigenous partners. Nunavummiut will continue to guide the path forward as we keep progressing together on the road to devolution, to give Nunavut more control for decisions on its lands, resources, and economic future.</p>\n\n<p>“I thank Joe Savikataaq for his contributions to Nunavut and to Canada during his time as premier, and wish him the best in his role in Nunavut’s sixth Legislative Assembly.”</p></div>\n      "
}