{
  "path": "/en/news/readouts/2021/04/15/prime-minister-justin-trudeau-speaks-chancellor-angela-merkel-germany",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor Angela Merkel of Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the Chancellor of Germany, Angela Merkel.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel discussed the global COVID-19 pandemic and the measures being taken in Canada and in Germany to keep people safe. They emphasized the critical role of vaccines in the fight against the virus and the importance of international cooperation.</p>\n\n<p>The two leaders shared their deep concern about Russia’s recent military activities in Crimea and along the border with Ukraine. They underlined their commitment to Ukraine’s sovereignty, security, and territorial integrity. The two leaders also discussed common priorities and shared values with respect to relations with China. Prime Minister Trudeau expressed appreciation for Germany’s solidarity regarding the consular cases of Canadians Michael Kovrig and Michael Spavor.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel agreed on the need for ambitious action on climate change. They looked forward to working together and with others to build momentum for bold action.</p>\n\n<p>The leaders also looked forward to ongoing collaboration in the G7 to advance shared priorities, such as defending democracy and human rights, and protecting international peace and security.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/canada-imposes-new-sanctions-on-individuals-and-entities-involved-in-illegal-annexation-of-crimea.html\">Canada imposes new sanctions on individuals and entities involved in illegal annexation of Crimea</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n\t<li><a href=\"https://www.g7uk.org/\">G7 UK 2021</a></li>\n</ul></div>\n      "
}