{
  "path": "/en/news/statements/2017/10/05/statement-prime-minister-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p><p>“Today, we join the international community to celebrate teachers. On <a href=\"http://en.unesco.org/themes/teachers/world-teachers-day\">World Teachers’ Day</a>, we honour the work teachers and educators do to shape our communities and our world for the better.</p><p>“Teachers are compassionate, curious, and constantly seek new ways to solve challenges and explain complex issues. They understand that more important than having all the answers is listening to the needs of their students – and they work tirelessly to empower students to find the answers and take ownership of their own path. Above all, teachers help their students walk away from the classroom with respect for others and for themselves. They know that the world will be shaped by the students they teach – and they have an extraordinary impact on that world, every day, in the classroom.</p><p>“This year’s theme –<i>Teaching in Freedom, Empowering Teachers – </i>highlights the significant part teachers can play to make the United Nations Sustainable Development Goals a reality. When teachers have the freedom and support they need to help students realize their full potential, whole societies benefit from greater prosperity and stronger democracy.</p><p>“Canada is working to advance <a href=\"http://www.un.org/sustainabledevelopment/education/\">Sustainable Development Goal 4</a> – lifelong learning and&nbsp;inclusive, quality education for all. In Budget 2017, we increased access to funding so that adults can more easily go back to school. We are also investing in child care, including in training and support for early childhood educators. Last year, we also created a tax benefit for teachers and early childhood educators, which gives teachers important support to help their students succeed. With our <a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/iap-pai/index.aspx?lang=eng\">Feminist International Assistance Policy</a>, we are promoting equal educational opportunities for women and girls around the world. We are also investing in Canadian schools and in Indigenous education across the country.</p><p>“I am exceptionally proud to have been a teacher, and I have tremendous respect for the work teachers do every day. That is why I am pleased to launch the nomination period for this year’s <a href=\"http://www.ic.gc.ca/eic/home.nsf/html/pma_site-select-eng.html\">Prime Minister’s Awards for Teaching Excellence and Excellence in Early Childhood Education</a>. These awards recognize exemplary teachers who are preparing the next generation for success in our changing economy. This year, we are including 17 new awards that will recognize inspirational Science, Technology, Engineering, and Mathematics (STEM) teachers, who are encouraging the innovation that will drive Canada forward today and tomorrow. I encourage all Canadians to honour teachers who are making a real difference and nominate them for the awards.</p><p>“On behalf of the Government of Canada, I thank all teachers and educators in Canada and around the world for helping us succeed as individuals and prosper as societies. You give the very best of yourselves, and change lives, every day, for the better.”</p></div>\n      "
}