{
  "path": "/en/news/news-releases/2022/04/09/prime-minister-co-convenes-stand-ukraine-pledging-event",
  "pageTitle": "Prime Minister co-convenes the Stand Up for Ukraine pledging event | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau co-convened the Stand Up for Ukraine pledging event with the President of the European Commission, Ursula von der Leyen, with the participation of the President of Poland, Andrzej Duda, in a worldwide show of solidarity with Ukraine, and in partnership with international advocacy organization <a href=\"https://www.globalcitizen.org/en/\">Global Citizen</a>.</p>\n\n<p>Today’s event was the culmination of a global social media rally supported by Global Citizen and in response to an urgent call from Ukrainian President Volodymyr Zelenskyy for the international community to mobilize additional support for people fleeing war in Ukraine. The campaign raised over $12.4 billion in pledges to support Ukrainian refugees and address the humanitarian crisis.</p>\n\n<p>The Prime Minister today announced an additional $100 million in humanitarian support to respond to the worsening humanitarian crisis in Ukraine and neighbouring countries, helping to provide added emergency health services, including trauma care, protection, and necessities such as shelter, water, and food. These funds will be allocated to experienced humanitarian partners who are best positioned to reach those most in need, quickly and efficiently. With today’s announcement, Canada has provided $245 million since January 2022 in humanitarian assistance to respond to the impacts the conflict in Ukraine.</p>\n\n<p>The Prime Minister today also announced a series of measures to make it easier for Ukrainians fleeing Putin’s illegal war to come to Canada including:</p>\n\n<ul>\n\t<li>Targeted charter flights to Canada for Ukrainians;</li>\n\t<li>Short-term income support to ensure basic needs are met; and</li>\n\t<li>Temporary hotel accommodation for up to two weeks.</li>\n</ul>\n\n<p>These new measures will help more Ukrainians take advantage of the dedicated Canada-Ukraine authorization for emergency travel (CUAET) program, while also providing relief to European partners who are currently supporting displaced Ukrainians.&nbsp;</p>\n\n<p>In March, Canada launched the CUAET, a special, accelerated temporary residence pathway for Ukrainians seeking safe haven in Canada while the war in their home country continues. The CUAET is the fastest and most efficient way for Ukrainians and their families to come to Canada, as this new measure streamlines current visa and travel requirements, eliminates most application and processing fees, and offers accelerated, prioritized processing. Since launching last month, Canada has already approved over 30,000 applications for those seeking to come to Canada under the CUAET.</p>\n\n<p>A number of other measures have also been implemented to assist those implicated by the war, including the prioritized processing of Canadian passport and travel documents, citizenship proofs, and permanent resident, temporary resident visa, student and work permit applications from Ukrainian nationals in Ukraine. We have also waived visa application and work and study permit fees for all Ukrainian nationals and their family members.</p>\n\n<p>In Budget 2022, Canada announced more than $1.2 billion in direct contributions in support of Ukraine and its people, in addition to an offer of up to $1.6 billion in loan support for the Ukrainian government.</p>\n\n<p>The Government of Canada continues to work around the clock to help Ukrainians and their families.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today, we raised over $12.4 billion in pledges to continue supporting the Ukrainian people who have been displaced by Putin’s ongoing and unjustifiable war. Whether it’s food, water, shelter, or medical aid – we will continue to have your backs and provide the assistance you need at this time. We are also making it easier for Ukrainians fleeing the war to come to Canada. We are standing up for Ukraine.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada is also providing over 345,000 essential relief items such as blankets, mattresses, etc. from Canada’s National Emergency Strategic Stockpile to help respond to humanitarian needs in Ukraine and the region. These items were specifically requested by our partners and are being dispatched to Ukraine and neighbouring countries.</li>\n\t<li>With today’s announcement, Canada has provided $245 million in humanitarian assistance to Ukraine. Of this, $145 million has been allocated to United Nations organizations, the Red Cross Movement and to non-governmental organizations.</li>\n\t<li>Canada invested an additional $117 million to implement new immigration measures to welcome those fleeing the war in Ukraine.</li>\n\t<li>Canada is also offering temporary federal support to help Ukrainians settle in their new communities, including:\n\t<ul>\n\t\t<li>language training;</li>\n\t\t<li>information about and orientation to life in Canada, such as help with enrolling children in school;</li>\n\t\t<li>information and services to help access the labour market, including mentoring, networking, counselling, skills development and training;</li>\n\t\t<li>activities that promote connections with communities;</li>\n\t\t<li>assessments of other needs Ukrainians may have and referrals to appropriate agencies;</li>\n\t\t<li>services targeted to the needs of women, seniors, youth and LGBTQ2+ persons; and</li>\n\t\t<li>other settlement supports available through the Settlement Program.</li>\n\t</ul>\n\t</li>\n\t<li>The federal government will continue to work closely with our provincial and territorial partners, who have been welcoming and supporting Ukrainians arriving in their jurisdictions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-canada-helping-aide.aspx?lang=eng\">How Canada is helping – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_en\">EU solidarity with Ukraine</a> – available in <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_uk\">Ukrainian</a> and <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_ru\">Russian</a></li>\n</ul></div>\n      "
}