{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-meets-president-zambia-hakainde-hichilema",
  "pageTitle": "Prime Minister Justin Trudeau meets with the President of Zambia Hakainde Hichilema | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with the President of Zambia, Hakainde Hichilema, on the margins of the Commonwealth Heads of Government Meeting.&nbsp;&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Hichilema agreed to work together to advance shared priorities in response to the many crises facing the world.</p>\n\n<p>The two leaders discussed Russia’s illegal invasion of Ukraine, which the Prime Minister condemned as an affront to the fundamental principles of sovereignty, territorial integrity, and international law. They agreed on the need for countries in the Commonwealth to work together to defend democracy, peace and security, and human rights.</p>\n\n<p>Recognizing the invasion is driving up the cost of living across the Commonwealth, Prime Minister Trudeau and President Hichilema agreed to work together to improve food and energy security, support ambitious climate action, create opportunities for youth, and make life better and more affordable for people around the world.</p>\n\n<p>The Prime Minister and the President emphasized their shared commitment to the core values that must bring the countries of the Commonwealth together: free and democratic societies and the promotion of peace and prosperity to improve the lives of all people. They spoke at length about the importance of strong leadership, modernization, and renewal of this important institution.</p>\n\n<p>The two leaders also spoke about the close bilateral partnership between Canada and Zambia. They agreed to deepen economic cooperation, including through investments in information and communication technologies. They welcomed the recent agreement with First Quantum Minerals Ltd. as an example of the strong partnership between both countries in the mining sector. The Prime Minister affirmed Canada’s ongoing support for Zambia’s efforts to secure debt treatment, recognizing the importance of financing for development and recovery from the devastating economic impacts of the pandemic.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/tanzania-tanzanie/bilateral_relations_bilaterales/canada_Zambia-Zambie.aspx?lang=eng\">Canada-Zambia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a><strong> </strong></li>\n</ul></div>\n      "
}