{
  "path": "/en/news/news-releases/2016/06/28/prime-minister-welcomes-renewed-ties-mexico-following-visit-president",
  "pageTitle": "Prime Minister welcomes renewed ties with Mexico following visit from President of Mexico | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the conclusion of the State Visit of Mexican President Enrique Peña Nieto to Canada.</p>\n<p>Through this visit, Canada has renewed its close ties with Mexico, one of our most valued partners in the hemisphere. Both leaders agreed that, while collaboration between our countries is already extensive, now is the time to do more – to bring our students together, to deepen our business relationships, and to create sustainable economic growth for all of our people.</p>\n<p>During their bilateral meeting, the Prime Minister announced the lifting of the visa requirement for Mexican visitors. This important step will strengthen the ties between Canada and Mexico and will increase the flow of travellers, ideas, and business between both countries.</p>\n<p>The two leaders also witnessed a historic signing of a memorandum of understanding on Indigenous cooperation that will allow our countries to share their experiences, their knowledge, and their best practices – all to improve the quality of life for Indigenous Peoples in Canada and Mexico.</p>\n<p>Moving forward, Prime Minister Trudeau and President Peña Nieto made a commitment to work in close cooperation to grow our cultural connections, expand our growing trade and investment relationship, and find solutions to the shared challenges of climate change.</p>\n<p>Canada and Mexico both understand how important it is to have a productive and respectful relationship – one that allows for greater trade, stronger growth, and more clean job creation.</p>\n<p><strong>Quote</strong></p>\n<p>“President Peña Nieto and I came together these past two days in a spirit of friendship and respect to deepen the relationship between our two great countries. Canada and Mexico are more than just friends – we are partners – and the agreements we reached today will spark the exchange of more travellers, goods, and ideas between our countries than ever before.”<br><em>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The two leaders also witnessed the signing of a letter of intent to increase the exchange of information on development, as well as collaboration in the field in Central America and the Caribbean. Areas of interest will include, among others, women and girls, climate change, vector-borne diseases, and disaster preparedness and response.</li>\n<li>During a discussion with Canadian and Mexican youth, the two leaders announced many new education partnerships between Canada and Mexico that will enhance two-way student and research exchange opportunities, and allow for closer collaboration on innovation and technology.</li>\n<li>Canada and Mexico are each other’s third-largest trading partners, and bilateral trade between the two countries, valued at $37.8 billion in 2015, continues to grow annually.</li>\n<li>By some estimates, Mexico’s economy will rival Britain and France within 15&nbsp;years. Its middle class is one of the world’s fastest growing.</li>\n<li>Canada welcomes the decision by Mexico to lift its outstanding restrictions on Canadian beef and beef products by October 2016.</li>\n</ul>\n<p><strong>Related products</strong></p>\n<ul>\n<li><a href=\"/en/news/statements/2016/06/28/joint-statement-prime-minister-canada-and-president-united-mexican\">Joint statement by the Prime Minister of Canada and President of the United Mexican States</a></li>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/canada-mexico-cooperation-security-and-defence\">Canada-Mexico cooperation on security and defence</a></li>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/economic-prosperity-between-canada-and-mexico\">Economic prosperity between Canada and Mexico</a></li>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/environmental-cooperation-between-canada-and-mexico\">Environmental cooperation between Canada and Mexico</a></li>\n<li>Fact sheet – <a href=\"/en/news/2016/06/28/strengthening-cultural-and-social-ties-between-canada-and-mexico\">Strengthening cultural and social ties between Canada and Mexico</a></li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li>News release – <a href=\"/en/news/news-releases/2016/06/28/canada-lift-mexican-visa-requirements\">Canada to lift Mexican visa requirements</a></li>\n<li>Backgrounder – <a href=\"/en/news/backgrounders/2016/06/28/canada-lift-visa-requirements-mexico\">Canada to lift visa requirements for Mexico</a></li>\n<li>News release – <a href=\"/en/news/news-releases/2016/06/28/prime-minister-welcomes-education-cooperation-mexico\">Prime Minister welcomes education cooperation with Mexico</a></li>\n<li>Backgrounder – <a href=\"/en/news/backgrounders/2016/06/28/canada-mexico-education-cooperation\">Canada-Mexico education cooperation</a></li>\n<li><a href=\"http://www.international.gc.ca/world-monde/campaign-campagne/nals-slna/nals-2016-slna.aspx?lang=eng\">North American Leaders’ Summit 2016</a></li>\n</ul></div>\n      "
}