{
  "path": "/en/news/statements/2021/11/23/tusagaksaq-kanataup-sivuliuqtirjuanganit-gavamakkut-tukimuagutiksangit",
  "pageTitle": "ᑐᓴᒐᒃᓴᖅ ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᕐᔪᐊᖓᓂᑦ ᒐᕙᒪᒃᑯᑦ ᑐᑭᒧᐊᒍᑎᒃᓴᖏᑦ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᐅᓇ ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᕐᔪᐊᖓ, ᔭᔅᑏᓐ ᑐᕉᑐ, ᐅᓪᓗᒥ ᐅᑯᓂᖓ ᑐᓴᕐᑎᑦᑎᖃᐅᔪᖅ ᒐᕙᒪᒃᑯᑦ ᑐᑭᒧᐊᒍᑎᒃᓴᖏᓐᓂᒃ:</p>\n\n<p>“ᐊᓂᒍᖅᐳᑦ 19 ᑕᕿᑦ ᓵᑦᑎᓯᒪᒐᑦᑕ&nbsp; ᐊᑕᐅᓯᐊᖅᐸᒃᑐᑦ ᕼᐋᓐᓇᓚᓂᑦ ᐊᕐᕌᒍᓂᑦ, ᑲᓇᑕᒥᐅᑦ ᐱᒋᐊᑲᓐᓂᕈᒪᓕᓚᐅᖅᐳᑦ ᑕᒪᑐᒪᓂ ᓯᑎᐱᕆᒥ. ᑐᓂᓯᓚᐅᖅᑐᑦ ᑲᓇᑕᐅᑉ ᒪᓕᒐᓕᐅᖅᑎᕐᔪᐊᖏᓐᓂᒃ ᑐᑭᓯᓇᑦᑎᐊᖅᑐᓂᒃ ᑐᑭᒧᐊᒍᑎᒃᓴᓂᒃ ᐃᖅᑲᓇᐃᔭᖃᑎᒌᖕᓂᐊᕋᑦᑕ ᑖᓐᓇ ᓄᕙᒡᔪᐊᕐᓇᖅ-19 ᐊᓂᒍᖅᑎᓐᓇᓱᒡᓗᒍ ᑭᒪᖕᓂᐊᕋᑦᑎᒍᑦ ᐊᒻᒪᓗ ᕿᓂᕐᓗᑕ ᐋᕿᒃᓯᔾᔪᑎᒃᓴᓪᓚᕆᖕᓂᒃ ᐋᕿᒃᓱᐃᑦᑎᐊᕐᓂᐊᕋᑦᑕ ᐱᐅᓯᑎᓐᓂᖅᓴᐅᓗᒋᑦ ᓯᕗᓂᒃᓴᖏᑦ ᑕᒪᕐᒥᒃ ᑲᓇᑕᒥᐅᑦ. ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᓈᓚᒃᐸᒃᑐᑦ ᑲᓇᑕᒥᐅᓂᒃ, ᐊᒻᒪᓗ ᐱᑐᐃᓐᓇᕆᐊᖃᓕᖅᓯᒪᕗᒍᑦ ᐅᓇᑖᕆᓗᒍ ᓄᕙᒡᔪᐊᕐᓇᖅ-19, ᓴᖕᖏᔫᔪᓂᒃ ᐱᓕᕆᐊᕆᓗᒍ ᓯᓚᐅᑉ ᖃᓄᐃᓕᖓᓕᕐᓂᖓ, ᐃᓅᓯᑦᑎᓐᓂᓗ ᓱᓇᑐᐃᓐᓇᐃᑦ ᐊᑭᑦᑐᖅᐸᓪᓕᐋᑎᓐᖏᓪᓗᒋᑦ, ᐱᓱᖃᑎᒌᓚᐅᖅᑕ ᐊᑐᖅᓯᔪᐃᓐᓇᐅᓗᑕ ᓴᐃᒪᓕᕈᑎᒃᓴᓄᑦ, ᐋᕿᒃᓗᒋᑦ ᐊᖏᕐᕋᑦᑎᓐᓂᒃ ᓇᖕᒥᓂᖃᕐᓂᖅ ᑕᒪᓐᓇ ᐱᔭᒃᓴᐅᓕᖅᑎᓪᓗᒋᑦ, ᐋᕿᒃᓯᓗᑕ ᐃᖅᑲᓇᐃᔮᕆᔭᐅᓂᐊᖅᑐᓂᒃ, ᐊᒻᒪᓗ ᐱᕈᖅᑎᓪᓗᒋᑦ ᐱᕚᓪᓕᖅᓯᒪᓂᖅᓴᐅᓕᕐᓗᑎᒃ ᑮᓇᐅᔭᓕᐅᕈᓐᓇᖅᑐᑦ.</p>\n\n<p>“ᐋᕿᒃᓱᐃᓂᖅ ᐱᐅᓂᖅᓴᒥᒃ ᓯᕗᒻᒧᐊᒍᑎᒃᓴᓂᒃ ᐱᒋᐊᕐᓂᐊᖅᑐᖅ ᑕᒪᓐᓇ ᖃᓂᒪᓇᖅᑐᖅ ᐊᐃᑦᑐᕐᓗᐃᕙᓪᓕᐊᔪᖅ ᓄᖃᖅᓯᒪᓕᖅᐸᑦ ᐊᒻᒪᓗ ᐱᔭᕇᑦᑎᐊᕐᓗᑕ ᑲᐴᑎᓄᑦ ᐃᓅᓕᓴᐅᑎᓕᕆᓂᖅ. ᑲᑐᔾᔨᓗᑕ, ᐱᕙᓪᓕᐊᑦᑎᐊᖅᐳᒍᑦ. ᐅᖓᑖᓂ 86 ᐳᓴᑎ ᑲᓇᑕᒥᐅᑦ ᑲᐱᔭᐅᓯᒪᓕᖅᑐᑦ ᑲᐱᔭᐅᔪᓐᓇᖅᑐᑦ, ᐊᒻᒪᓗ ᑎᓕᔭᐅᓯᒪᕗᒍᑦ ᑖᒃᑯᐊ ᑕᒪᕐᒥᒃ ᒐᕙᒪᑐᖃᒃᑯᑦ ᐊᒻᒪᓗ ᒐᕙᒪᑐᖃᒃᑯᑎᒍᑦ-ᒪᓕᒐᖃᖅᑎᑕᐅᔪᑦ ᓴᓇᔨᑦ, ᐊᒻᒪᓗ ᑕᒪᕐᒥᒃ ᐊᐅᓪᓚᕐᓂᐊᖅᑐᑦ ᐃᓗᐊᓂ ᑲᓇᑕᑉ ᑖᒃᑯᑎᒍᑦ ᖃᖓᑕᓲᒃᑯᑦ, ᓄᓇᓯᐅᑎᑯᑖᒃ, ᐅᒡᕙᓘᓐᓃᑦ ᐅᒥᐊᕐᔪᐊᖅ ᐳᓚᕋᑎ ᑲᐱᔭᐅᓗᑎᒃ ᐃᓅᓕᓴᐅᑎᒥᒃ. ᐱᓇᓱᐊᕈᓯᐅᓚᐅᖅᑐᒥᒃ ᐋᓐᓂᐊᖃᖅᑕᐃᓕᑎᑦᑎᔨᒃᑯᑦ ᑲᓇᑕ ᑲᐱᔭᐅᔪᓐᓇᖅᓯᑎᑦᑎᓚᐅᖅᑐᑦ ᓄᑕᖃᓂᒃ ᐅᑭᐅᖃᖅᑐᓂᒃ ᐊᕙᑖᓂᑦ 5 ᑎᑭᓪᓗᒍ 11, ᐊᒻᒪᓗ ᒐᕙᒪᒃᑯᑦ ᐋᕿᒃᓯᓯᒪᕙᒌᓕᖅᐳᑦ ᑭᖑᕚᒃᓴᕗᑦ ᑕᑐᒪᖓᑦ ᓄᕙᒡᔪᐊᕐᓇᖅ-19 ᑲᐱᔭᐅᓗᑎᒃ ᐃᓅᓕᓴᐅᑖᓂᒃ ᐊᒻᒪᓗ ᑲᐱᔭᐅᓯᒪᔪᑦ ᐃᓅᓕᓴᐅᑎᒃᓴᖓᓂᒃ ᑲᐱᔭᐅᑲᓐᓂᕐᓗᑎᒃ. ᑲᔪᓯᒍᑦᑕ ᑲᔪᖏᖅᓴᐃᓗᑕ ᑕᒪᐃᓐᓂᒃ ᐊᔪᖏᑦᑐᓂᒃ ᑲᓇᑕᒥᐅᓂᒃ ᓄᕙᒡᔪᐊᕐᓇᖅ-19 ᑲᐱᔭᐅᓗᑎᒃ, ᐋᕿᒃᓱᐃᕙᓪᓕᐊᑦᑎᐊᕐᓂᐊᕋᑦᑕ ᐋᓐᓂᐊᖃᓐᖏᑦᑎᐊᕐᓗᑎᒃ ᐊᒻᒪᓗ ᓴᖕᖏᓂᖅᓴᐅᓕᕐᓗᑎᒃ ᐃᓗᐊᖅᓴᐃᕕᑦ. ᒐᕙᒪᒃᑯᑦ ᐱᐅᓂᖅᓴᒥᒃ ᐃᑲᔫᑎᖃᕐᓂᐊᖅᑐᑦ ᑕᒪᐃᓐᓄᑦ ᑲᓇᑕᒥᐅᓄᑦ ᐋᕿᒃᓱᖅᐸᓪᓕᐊᓕᕐᓗᒋᑦ ᑭᖑᕙᖅᓯᒪᓕᖅᑐᑦ ᐱᐅᓯᕆᔭᐅᔪᑦ ᑕᐃᒪᓐᓇᐃᑎᑕᐅᔪᑦ ᓄᕙᒡᔪᐊᕐᓇᖅ-19, ᓴᖕᖏᒃᑎᒋᐊᕐᓗᒋᑦ ᐊᑯᓂᐅᔪᒃᑯᑦ ᐸᕿᕕᑦ ᐃᓐᓇᕐᓄᑦ, ᐊᒻᒪᓗ ᐱᐅᓯᕚᓪᓕᕐᓗᒋᑦ ᐊᑐᖅᑕᐅᔪᓐᓇᖅᑐᑦ ᐃᓱᒪᒧᑦ ᐋᓐᓂᐊᖃᖅᑕᐃᓕᑎᑦᑎᔾᔪᑎᑦ ᐊᒻᒪᓗ ᐊᔪᓕᖅᓯᒪᔪᓄᑦ ᓄᖃᕆᐊᒃᓴᖅ ᐃᓗᐊᖅᓴᐃᕕᖕᓂᒃ. ᑲᓇᑕᒥᐅᑦ ᐊᑦᑕᕐᓇᖅᑐᒦᑎᑕᐃᓕᓂᐊᖅᑕᕗᑦ ᐊᒻᒪᓗ ᖃᓂᒪᖃᓐᖏᑦᑎᐊᕐᓗᑎᒃ ᒫᓐᓇ ᐊᒻᒪᓗ ᓯᕗᓂᒃᓴᑦᑎᓐᓄᑦ. &nbsp;&nbsp;</p>\n\n<p>“ᑕᐃᑲᓂ ᐋᓐᓂᐊᓇᖅᑐᖅ ᐊᐃᑦᑐᕐᓗᐃᕙᓪᓕᐊᔪᖅ ᑭᒪᒍᑎᓯᒪᓕᕈᑦᑎᒍᑦ, ᐋᕿᒃᓱᑦᑎᐊᑲᓐᓂᕆᐊᖃᕐᓂᐊᖅᑕᕗᑦ ᒪᑭᒪᓇᓱᒍᑎᒃᓴᐃᑦ ᓱᓕᔪᒥᒃ ᐊᔪᖏᓪᓗᑎᒃ ᑕᒪᐃᓐᓄᑦ. ᑕᐃᒪᓐᓇᐅᓂᐊᖅᑐᒍᑦ ᐃᒪᓐᓇᐅᒍᑦᑕ, ᒐᕙᒪᒃᑯᑦ ᑲᔪᓯᓗᑎᒃ&nbsp; ᑲᓇᑕᒥᐅᑦ ᓯᕗᓪᓕᐅᑎᓪᓗᒋᑦ ᐊᒻᒪᓗ ᖃᑭᔾᔪᑎᒃᓴᓕᐅᕐᓗᑎᒃ ᓯᕗᓂᒃᓴᖏᖕᓄᑦ. ᐅᓇ ᑐᑭᖃᖅᑐᖅ ᐱᓕᕆᐊᕆᓗᒋᑦ ᐊᑭᑦᑐᖅᐸᓪᓕᐊᔪᑦ ᐊᒻᒪᓗ ᐱᓕᕆᐊᕆᓗᒋᑦ ᐊᑭᓖᔪᓐᓇᕐᓂᐊᕐᒪᑕ ᐃᒡᓗᒃᓴᖏᓐᓂᒃ ᐊᒻᒪᓗ ᐸᐃᕆᕕᖕᓂᒃ. ᐃᑲᔪᕐᓂᐊᖅᑕᕗᑦ ᓇᖕᒥᓂᖅ ᐃᒡᓗᖃᕈᓐᓇᕐᓂᖅ ᐅᑎᖅᑎᓪᓗᒍ ᑎᑭᐅᑎᓯᒪᓂᐊᕋᑦᑕ ᑲᓇᑕᒥᐅᑦ ᓈᒻᒪᒋᔭᖏᓐᓄᑦ ᐋᕿᒃᓯᒪᔪᓐᓇᖅᑐᓂᒃ ᓯᕗᓪᓕᖅᐹᒥᒃ ᐃᒡᓗᒥᒃ ᓂᐅᕕᕆᐅᖅᑐᑦ. ᐃᑲᔪᕐᓗᒋᑦ ᐃᓚᒌᑦ ᐃᓅᓯᖃᑦᑎᐊᕐᓂᐊᕐᒪᑕ ᐊᑭᓖᔪᓐᓇᕐᓗᑎᒃ ᑮᓇᐅᔭᓕᐅᖅᑎᐅᔪᑦ ᐊᒻᒪᓗ ᐃᖅᑲᓇᐃᔭᖅᑎᐅᔪᑦ ᐊᒃᓱᕈᖅᖢᑎᒃ ᓴᓇᓲᑦ ᐃᓚᐅᔪᓐᓇᐃᓕᓯᒪᕙᒃᑐᑦ. ᑕᐃᒪᓐᓇᐅᓂᖓᓄᑦ ᐊᓂᒍᖅᑐᑦ ᑕᕿᑦ ᐊᒥᓲᓐᖏᑦᑐᑦ ᐊᑎᓕᐅᖅᓯᒪᕗᒍᑦ 9-ᖑᔪᓂᒃ ᐸᐃᕆᕕᖕᓄᑦ ᐊᖏᖃᑎᒌᒍᑎᑦ ᑲᓇᑕᒥ ᐊᕕᒃᑐᖅᓯᒪᔪᓄᑦ ᐊᒻᒪᓗ ᑎᐅᓕᑐᐊᓕᔅᓄᑦ ᐊᑭᖏᑦ ᓇᑲᓐᓂᐊᕋᑦᑎᒍᑦ ᐊᕙᖓᓂᒃ ᐊᒡᒋᖅᑐᒥ ᐊᕐᕌᒍᒥ ᑕᒪᐃᓐᓂ ᓄᓇᖃᑎᒌᓐᖏᑦᑐᓂ, ᐋᕿᒃᓱᐃᓗᑕ ᕼᐊᓐᓇᓚ ᑕᐅᓴᓐ ᓄᑖᓂᒃ ᐸᐃᕆᕕᖕᓂᒃ ᑕᒪᐃᓐᓂ ᑲᓇᑕᒥ, ᐊᒻᒪᓗ ᓴᕿᑦᑎᓗᑕ ᐃᓕᓐᓂᐊᓕᓵᖅᑐᓄᑦ ᐊᒻᒪᓗ ᐸᐃᕆᕕᓕᕆᔾᔪᑎᑦ ᐊᑭᒋᓂᐊᖅᑕᖏᓐᓂᒃ, ᑕᒫᓂ ᖃᓂᒋᔭᖓᓂ, $10 ᐅᓪᓗᖅ ᐊᑕᐅᓯᖅ ᐊᒃᓱᕈᖅᑐᓄᑦ ᓴᓇᔪᓄᑦ ᐊᖓᔪᖅᑳᖏᓐᓄᑦ. ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐱᓕᕆᔭᒥᖕᓂᒃ ᐱᔭᕇᖅᓯᑦᑎᐊᕐᓂᐊᖅᑐᑦ $10 ᐅᓪᓗᖅ ᐊᑕᐅᓯᖅ ᐸᐃᕆᕕᖕᒧᑦ, ᐊᒻᒪᓗ ᑲᔪᓯᑎᓪᓗᒋᑦ ᐃᓅᓯᖅ ᐱᐅᓂᖅᓴᐅᑎᓪᓗᒍ ᐊᒻᒪᓗ ᐊᑭᓕᕈᓐᓇᖅᑕᖏᓐᓂᒃ ᐋᕿᒃᓯᒪᓗᑎᒃ ᑕᒪᐃᓐᓄᑦ ᑲᓇᑕᒥᐅᓄᑦ.&nbsp; &nbsp;&nbsp;</p>\n\n<p>“ᓴᕿᑦᑎᓯᒪᓂᐊᕐᓗᑕ ᐊᓐᓇᐆᒪᑦᑎᐊᖅᑎᑦᑎᔪᓐᓇᖅᑐᓂᒃ ᒪᑭᒪᓇᓱᐊᕈᑎᒃᓴᓂᒃ, ᓴᕿᑦᑎᓗᑕ ᐃᖅᑲᓇᐃᔮᒃᓴᓂᒃ, ᐊᒻᒪᓗ ᐱᕈᖅᑎᓪᓗᒋᑦ ᐃᖅᑲᓇᐃᔮᒃᓴᐃᑦ, ᑲᓇᑕ ᓴᖕᖏᔪᒥᒃ ᐊᒻᒪᓗ ᐊᑦᑕᕐᓇᓐᖏᑦᑎᐊᓕᖅᑎᓪᓗᒋᑦ ᓯᓚᐅᑉ ᖃᓄᐃᓐᓂᖓ ᐱᓕᕆᐊᖑᓗᑎᒃ. ᑕᐃᒪᓐᓇᐅᓂᖓᓄᑦ ᓅᑉᐸᓪᓕᐊᓂᐊᕋᑦᑕ ᓯᕗᒻᒧᑦ ᓄᖃᖅᑎᓪᓗᒋᑦ ᐊᒻᒪᓗ ᓇᑲᓪᓗᒋᑦ ᐅᖅᓱᐊᓗᒃᓴᖅ ᐊᒻᒪᓗ ᒑᓯᑦ ᐃᓯᐊᕿᔪᑦ ᐸᐅᕐᒥᒃ, ᖃᑭᔾᔪᑎᒃᓴᓕᐅᕐᓗᑕ ᐃᓄᓕᒫᓄᑦ ᐃᖏᕐᕋᔾᔪᑎᖏᑦᑎᒍᑦ, ᐊᒻᒪᓗ ᑎᓕᓯᓯᒪᓗᑕ ᓂᐅᕐᕈᑎᖃᕈᓐᓇᕐᓗᑎᒃ ᐃᓯᐊᕿᓐᖏᑦᑐᓂᒃ ᓄᓇᓯᐅᑎᓂᒃ. ᐱᑕᖃᖅᐳᖅ ᓄᓇᒥᑦ ᐊᒻᒪᓗ ᐊᔪᖏᑦᑎᐊᖅᑐᑦ ᓴᓇᔪᓐᓇᖅᑐᑦ ᓴᕿᑦᑎᓗᑎᒃ ᓱᕈᖅᓴᐃᓐᖏᑦᑐᓂᒃ ᓄᓇᑦᑎᓐᓂᒃ ᐱᖁᑎᓂᒃ ᐊᑐᕐᓗᑎᒃ ᐅᑯᐊᓗ ᓯᓚᕐᔪᐊᑉ ᑭᖕᖑᒪᒋᔭᒋᑦ ᓇᑲᑎᕐᓂᐊᕐᓗᒋᑦ ᓱᕈᖅᓴᐃᔪᑦ ᓯᓚᑦᑎᓐᓂᒃ ᐊᒻᒪᓗ ᐋᕿᒃᓯᓯᒪᓗᑕ ᓄᓇᒥᒃ ᓱᕈᖅᓴᐃᓐᖏᑦᑐᓂᒃ ᒪᑭᒪᔾᔪᑎᒃᓴᓂᒃ. ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᑦ ᑲᔪᓯᑎᓐᓂᐊᖅᑕᖏᑦ ᖃᑭᔾᔪᑎᒃᓴᓕᐅᕈᑎᓗᒋᑦ ᓴᓇᔨᑦ ᐊᒻᒪᓗ ᑲᒻᐸᓂᑦ ᐃᑲᔪᕐᓂᐊᕐᒪᑕ ᑎᑭᐅᑎᓗᑕ ᒪᑭᒪᔾᔪᑎᒃᓴᖏᓐᓄᑦ ᑭᖑᕚᕆᓂᐊᖅᑕᑎᓐᓂᑦ, ᑕᐃᑲᓂᓗᑦᑕᐅᖅ ᐱᓕᕆᐊᕆᖕᒥᓗᒋᑦ ᓴᓗᒻᒪᖅᓴᕐᓗᒋᑦ ᓯᓚ ᐊᓂᖅᓵᖅᑕᕗᑦ ᐊᒻᒪᓗ ᓴᐳᒻᒥᓗᒋᑦ ᑲᓇᑕᒥᐅᑦ ᐊᖏᔪᒻᒪᕆᐋᓗᖕᓂᒃ ᓯᓚ ᐱᕐᕈᓗᐊᕿᑎᑦᑎᓐᓂᖅᐸᑦ. ᑲᑐᔾᔨᓗᑕ, ᐊᕗᖕᖔᐅᔨᔪᓐᓇᖅᑐᒍᑦ ᐊᒻᒪᓗ ᓄᒃᑕᕐᓂᖅᐳᑦ ᓱᑲᒃᑎᒋᐋᕐᓗᒋᑦ ᓯᓚᐅᑉ ᖃᓄᐃᑎᑕᖏᓐᓂᒃ ᐱᓕᕆᓗᑕ, ᓴᐳᒻᒥᑐᐃᓐᓇᓐᖏᓪᓗᒍ ᐊᕙᑎᕗᑦ, ᑭᓯᐊᓂ ᐱᕈᖅᑎᓪᓗᒋᑦ ᒪᑭᒪᔾᔪᑎᒃᓴᐃᑦ ᑕᐃᒫᒃ ᓴᓇᔨᒥᒃ ᕿᒪᐃᓂᐊᓐᖏᓐᓇᑦᑕ. &nbsp;&nbsp;&nbsp;</p>\n\n<p>“ᑕᒪᕐᒥᒃ ᑲᓇᑕᒥᐅᑦ ᐃᒃᐱᒍᓱᑦᑎᐊᕆᐊᖃᖅᐳᑦ ᐊᑦᑕᕐᓇᖅᑐᖃᓐᖏᓪᓗᑎᒃ ᑲᑉᐱᐊᓇᖅᑐᖃᓐᖏᓪᓗᑎᒃ ᓄᓇᒥᖕᓂ, ᑭᓯᐊᓂ ᐱᑦᑎᐊᖃᑦᑕᐅᑎᖃᑦᑕᓐᖏᓐᓂᖅ ᐱᕚᓪᓕᖅᓯᒪᖕᒪᑦ ᑲᓇᑕᐅᑉ ᐃᓄᒋᐊᖕᓂᐹᓂ ᓄᓇᓕᖅᐸᐅᔭᖏᓐᓂ. ᐱᓕᕆᔭᕇᖅᓯᒪᓕᖅᐳᒍᑦ ᓴᖕᖏᔪᒥᒃ ᐱᒋᐊᖅᑎᑦᑎᓯᒪᓪᓗᑕ ᐱᔾᔪᑎᒋᓪᓗᒍ ᖁᑭᐅᑎᑦ, ᓱᓕ ᐱᔭᒃᓴᖃᖅᑐᒍᑦ ᑕᒪᑐᒧᖓ. ᑕᐃᒪᓐᓇᐅᓂᖓᓄᑦ ᐋᕿᒃᓱᐃᓂᐊᕋᑦᑕ ᐱᕙᓪᓕᐊᓯᒪᓕᕇᖅᑕᑦᑎᒍᑦ ᐊᒻᒪᓗ ᐊᑐᓕᖅᑕᐅᑎᑦᑎᓗᑕ ᒪᓕᒐᕐᓂᒃ ᓱᕋᐃᔭᕆᐊᖃᓐᖏᓂᖅ ᒪᓕᒐᓕᕐᓗᒋᑦ ᓂᐅᕕᐊᖑᔪᓐᓇᐃᓕᓗᑎᒃ ᑐᖂᑦᑎᔪᓐᓇᖅᑐᑦ ᐊᒥᓱᐋᓗᖕᓂᒃ ᐊᑕᐅᑦᑎᒃᑯᑦ ᐊᒻᒪᓗ ᓴᓇᖃᑎᒋᓗᒋᑦ ᑲᓇᑕᒥ ᐊᕕᒃᑐᖅᓯᒪᔪᑦ ᐊᒻᒪᓗ ᑎᐅᓕᑐᐊᓕᔅ ᐱᔭᐅᔭᕆᐊᖃᕈᓐᓃᖅᑎᓪᓗᒋᑦ ᓂᒃᐸᖅᑎᓲᑦ ᖁᑭᐅᑎᑦ.</p>\n\n<p>“ᒐᕙᒪᒃᑯᑦᑕᐅᖅ ᑲᔪᓯᑏᓐᓇᕐᓂᐊᖅᑕᖓ ᑕᒪᕐᒥᒃ ᖃᓄᐃᖏᑦᑎᐊᖁᓪᓗᒋᑦ ᐊᑦᑕᕐᓇᖅᑐᒦᓐᖏᑦᑎᐊᕋᓗᐊᕐᒪᖔᑕ ᐊᒻᒪᓗ ᓯᕗᓕᐅᕆᓯᒪᑦᑎᐊᕐᓗᑕ ᑭᒃᑯᑐᐃᓐᓇᐅᒐᓗᐊᖅᐸᑕ ᐊᖑᑎᑦ ᐊᕐᓇᐃᑦ, ᐅᑯᐊᓗ ᓇᒡᓕᒋᔭᑎᒃ, ᓇᕿᖕᖔᖅᓯᒪᒐᓗᐊᕈᑎᒃ, ᐅᖃᐅᓯᖃᑎᒌᓐᖏᑲᓗᐊᕈᑎᒃ, ᑭᓇᒧᑦ ᑐᒃᓯᐊᖅᐸᒃᑲᓗᐊᕈᑎᒃ, ᐅᒡᕙᓘᓐᓃᑦ ᐅᕕᓂᖃᑎᒌᓐᖏᒃᑲᓗᐊᕈᑎᒃ. ᑲᔪᓯᑎᓐᓂᐊᖅᑕᕗᑦ ᑕᒪᓐᓇ ᐱᓕᕆᑎᑦᑎᔾᔪᑕᐅᔪᓂᑦ ᐊᑭᕋᖅᑑᑕᐅᕙᒃᑐᑦ ᑭᒃᑭᑎᓂᐅᕙᒃᑐᑦ ᑭᓇᐅᓂᖏᓐᓄᒃ, ᐊᕐᓇᐅᓂᖏᓐᓄᑦ ᐊᖑᑕᐅᓂᖏᓐᓄᑦ, ᐊᒻᒪᓗ ᐊᑭᕋᖅᑐᕐᓂᒃᑯᑦ ᓇᓂᕐᒥᐅᑕᐅᓂᖏᓐᓂᒃ ᓄᓇᑦᑎᓐᓂ, ᐊᒻᒪᓗ ᐊᑐᖅᑕᐅᑎᑦᑎᐊᕐᓗᒋᑦ ᓴᖕᖏᓂᖃᕐᓂᖅ ᕿᖅᓂᖅᑕᐅᒐᓗᐊᕈᕕᑦ ᐊᒻᒪᓗ ᐊᐅᖃᑎᒌᓐᖏᑦᑐᑦ ᑲᓇᑕᒥᐅᑦ, ᐊᒻᒪᓗ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ. ᓇᖏᖅᓯᓯᒪᕗᒍᑦ ᓴᐳᒻᒥᓗᒋᑦ LGBTQ2 ᓄᓇᖃᑎᒌᑦ ᐱᔭᕇᖅᑎᓪᓗᒋᑦ ᒪᓕᒐᐃᑦ ᓄᖃᖅᑎᑦᑎᓯᒪᔪᑦ ᐊᓯᕈᖅᑎᑦᑎᓯᒪᔪᑦ ᒪᒥᓴᐅᑎᑦ, ᐊᒻᒪᓗ ᓴᐳᒻᒥᓗᑕ ᐊᒻᒪᓗ ᐃᑲᔪᕐᓗᒋᑦ ᒪᕐᕉᒃ ᑲᓇᑕᐅᑉ ᐅᖃᐅᓯᖏᑦ, ᑕᒪᕐᒥᒃ ᐃᓗᐊᓂ ᐊᒻᒪᓗ ᓯᓚᑖᓂ ᑯᐸᐃᒃ.</p>\n\n<p>“ᑭᓯᐊᓂ ᐃᓚᓕᐅᑎᑦᑎᓇᓱᒃᑲᓗᐊᕈᑦᑕ ᐊᒻᒪᓗ ᓇᓕᖃᕇᓕᕐᑎᑦᑎᓇᓱᒃᑲᓗᐊᕈᑦᑕ ᑲᓇᑕᒥ ᑕᐃᒪᓐᓇᐅᔪᓐᓇᓐᖏᑦᑐᖅ ᑭᓯᐊᓂ ᓅᑉᐸᓪᓕᐊᓂᖅᐳᑦ ᓱᒃᑲᒃᑎᒋᐊᕈᓂ ᐊᑐᖅᓯᔪᐃᓐᓇᐅᓕᕐᓗᑕ ᓴᐃᒻᒪᖃᑎᒌᖕᓂᕐᒥᒃ. ᑲᓇᑕᒥᐅ ᑲᑉᐱᐊᓇᖅᑐᑰᖅᓯᒪᕗᑦ ᓇᓂᓯᓯᒪᓕᕋᒥᒃ ᐊᑎᖃᓐᖏᑦᑐᑦ ᐃᓗᕖᑦ ᐊᒻᒪᓗ ᐃᓗᕕᖅᓯᕕᐅᖃᑦᑕᖅᑐᕕᓃᑦ ᖃᓂᒋᔭᖓᓂ ᐃᓕᓐᓂᐊᕆᐊᕐᕕᐅᕙᓚᐅᖅᑐᑦ ᐃᓕᓐᓂᐊᕐᕕᖏᓐᓂ. ᑕᐃᒪᓗ ᑲᓇᑕ, ᐊᒻᒪᓗ ᒐᕙᒪᐅᓪᓗᑕ, ᑲᔪᓯᑎᑦᑕᕆᐊᖃᖅᐸᕗᑦ ᐅᖃᐅᓯᕆᓗᒋᑦ ᓱᓕᔪᓂᒃ ᑖᒃᑯᐊ ᑲᑉᐱᐊᓇᖅᑐᒦᑦᑐᕕᓃᑦ ᑕᐃᒪᓗ ᐋᕿᖕᓂᐊᕋᑦᑎᒍᑦ ᑕᒻᒪᖅᓴᕕᓃᑦ ᐊᒻᒪᓗ ᓅᑉᐸᓪᓕᐊᓂᐊᕋᑦᑕ ᑕᕐᓂᖅ ᐊᑐᕐᓗᒍ ᓴᐃᒻᒪᖃᑎᒌᑦᑎᐊᕐᓂᖅ, ᑕᒪᐃᓐᓄᑦ. ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᑲᔪᓯᔪᒥᒃ ᐃᑲᔪᖅᐳᑦ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᓂᒃ ᑖᒃᑯᓇᓂ ᓄᓇᓕᖕᓂ ᖃᑭᔾᔪᑎᒃᓴᓕᐅᖅᖢᑎᒃ ᐊᔾᔨᒌᓐᖏᑦᑐᓄᑦ-ᐊᑐᖅᑕᐅᓂᐊᖅᑐᑦ ᐃᓱᒪᒧᑦ ᐋᓐᓂᐊᖃᖅᑐᓄᑦ ᐊᒻᒪᓗ ᒪᒥᓴᐅᑎᒃᓴᓄᑦ ᐋᕿᒃᓯᒪᔾᔪᑎᒃᓴᓄᑦ, ᐊᒻᒪᓗ ᑭᐅᓯᓂᐊᖅᑐᒍᑦ ᑭᒡᓕᓯᓐᓂᐊᖅᑎᒃᑯᓄᑦ ᑲᓇᑕ ᐱᓕᕆᐊᕆᖁᓯᒪᔭᖏᓐᓂᒃ ᐊᒻᒪᓗ ᑎᒃᑯᐊᖅᓯᓗᑕ ᑐᑭᓯᓇᓱᐊᑦᑎᐊᕐᓂᐊᖅᑐᓂᒃ ᐱᕚᓪᓕᖁᓪᓗᒋᑦ ᑕᒪᒃᑯᓄᖓ ᐱᕋᔭᒃᑕᐅᖃᑦᑕᖅᓯᒪᔪᑦ ᐳᐃᒍᓇᓐᖏᑦᑐᑦ ᐃᓕᓐᓂᐊᕆᐊᖅᑎᑕᐅᕙᓚᐅᖅᑐᑦ ᐃᓕᓐᓂᐊᕐᕕᕕᓂᖏᑦᑎᒍᑦ. ᒐᕙᒪᒃᑯᑦ ᓱᑲᒃᑎᒋᐊᕐᓂᐊᖅᑕᖏᑦᑕᐅᖅ ᓴᓇᖃᑎᒋᓗᒋᑦ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ ᐱᓇᓱᐊᖃᑎᒋᔭᕗᑦ ᐱᓕᕆᐊᕆᓕᕐᓗᒋᑦ ᑲᓇᑕᒥ ᑲᑉᐱᐊᓇᖅᑐᑰᖃᑦᑕᖅᑐᑦ ᐊᓯᐅᖃᔪᑦ ᐊᒻᒪᓗ ᐃᓄᐊᖅᑕᐅᓯᒪᔪᑦ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ ᐊᕐᓇᐃᑦ, ᓂᕕᐊᖅᓵᑦ, ᐊᒻᒪᓗ 2SLGBTQQIA+, ᐊᒻᒪᓗ ᓇᒻᒪᒃᑐᓂᒃ ᐊᒻᒪᓗ ᐱᕚᓪᓕᑦᑎᐊᕈᑎᒃᓴᖏᓐᓄᑦ ᐊᑭᓕᖅᑕᐅᓗᑎᒃ ᑖᒃᑯᐊ ᐋᓐᓂᖅᑕᐅᓯᒪᔪᑦ ᐊᓪᓚᐃᑦ ᓄᑕᖃᓄᑦ ᐊᒻᒪᓗ ᐃᓚᒌᓄᑦ ᐃᑲᔪᖅᑏᑦ ᐱᓕᕆᑎᑦᑎᔾᔪᑕᐅᓯᒪᔪᓂᑦ. ᑲᑐᔾᔨᓗᑕ, ᒪᑐᓂᐊᕋᑦᑎᒍᑦ ᐃᖅᐸᖅᓯᒪᔪᑦ ᑎᑭᐅᑎᓯᒪᓐᖏᓗᐊᖅᑐᑦ ᐊᒥᓱᓄᑦ ᐊᓪᓚᓄᑦ, ᐃᓄᖕᓄᑦ, ᐊᒻᒪᓗ ᐊᓪᓚᐃᖓᔪᓄᑦ ᓄᓇᖃᑎᒌᖕᓄᑦ ᓱᓕ ᓵᓯᒪᔭᖏᑦ ᐅᓪᓗᒥ ᐊᒻᒪᓗ ᐋᕿᒃᓱᐃᓗᑕ ᐱᐅᓂᖅᓴᒥᒃ ᐊᒻᒪᓗ ᐱᕚᓪᓕᕈᑎᑦᑎᐊᕙᒃᓴᓂᒃ ᓯᕗᓂᒃᓴᑦᑎᓐᓂ. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>“ᐃᓱᓕᑦᑎᔾᔪᑎᒋᓗᒍ, ᒐᕙᒪᒃᑯᑦ ᐃᓕᓴᖅᓯᓯᒪᕗᑦ ᓄᓇᖃᕋᑦᑕ ᑲᑎᖓᑦᑎᐊᖅᑐᒧᑦ ᓯᓚᕐᔪᐊᒧᑦ. ᑕᒪᓐᓇ ᐋᓐᓂᐊᓇᖅᑐᖅ ᐊᐃᑦᑐᕐᓗᐃᕙᓪᓕᐊᔪᖅ ᑕᑯᑎᑦᑎᓯᒪᕗᖅ ᐅᕙᑦᑎᓐᓂᒃ ᐱᒻᒪᕆᐅᓂᖓᓂᒃ ᓴᓇᖃᑎᒋᓗᒋᑦ ᓯᓚᕐᔪᐊᒥ ᐱᓇᓱᐊᖃᑎᖃᕐᓗᑕ ᐋᕿᒃᓱᕐᓗᒋᑦ ᐱᔭᕐᓂᓐᖏᑦᑐᑰᖅᑎᑦᑎᔪᑦ ᐅᓪᓗᒥ ᐊᒻᒪᓗ ᖃᐅᒃᐸᒧᑦ. ᐋᕿᒃᓱᕐᓗᒋᑦ ᓯᓚᐅᑉ ᖃᓄᐃᓐᓂᖓᑕ ᐊᒃᓱᕈᕐᓇᖅᑐᒦᑎᑦᑎᔪᑦ ᐋᕿᑦᑎᐊᕐᓗᒋᑦ ᐊᒡᔭᖅᑐᐃᓂᖅ ᑖᒃᑯᐊᓗ ᐃᖅᑲᓇᐃᔮᖃᕐᑎᑦᑎᓂᐊᕐᒪᑕ, ᐊᒻᒪᓗ ᓇᑉᐸᖅᓯᒪᑦᑎᐊᕐᓗᑎᒃ ᐊᑦᑕᑕᖅᑎᑦᑎᓯᒪᔪᑦ ᓯᓚᕐᔪᐊᒥ ᓴᐃᒪᖃᑎᒌᑦᑎᐊᕐᑎᑦᑎᓂᕐᒧᑦ ᐊᒻᒪᓗ ᑲᑉᐱᐊᓇᖅᑐᖂᑕᐃᓕᑎᑦᑎᓂᕐᒧᑦ, ᑲᓇᑕ ᑲᔪᓯᕗᖅ ᓯᕗᓕᐅᖅᑎᒋᔭᐅᔪᖅ ᓯᓚᕐᔪᐊᒥᑦ ᖃᓄᐃᓕᖓᕕᐅᔪᓄᑦ. &nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>“ᑕᐃᒪᓗ ᐋᕿᑦᑎᐊᖅᐸᓪᓕᐊᑎᓪᓗᑕ ᐱᔭᕐᓂᓐᖏᑦᑐᑰᖅᑎᑕᐅᓂᖅᐳᑦ ᓄᕙᒡᔪᐊᕐᓇᖅ-19 ᖃᓂᒪᓇᖅᑐᖅ ᐊᐃᑦᑐᕐᓗᐃᕙᓪᓕᐊᓂᖓ, ᑲᓇᑕᒥᐅᑦ ᓂᕆᐅᒃᐳᑦ ᑖᒃᑯᐊ ᒪᓕᒐᓕᐅᖅᑎᕐᔪᐊᑦ ᓴᓇᖃᑎᒌᒡᓗᑎᒃ ᐊᒻᒪᓗ ᑐᓂᓯᓯᒪᓗᑎᒃ ᓯᕗᓪᓕᐅᑎᖁᔭᕐᒥᖕᓂᒃ. ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ ᐊᖏᖅᓯᒪᑦᑎᐊᖅᑐᑦ ᑲᔪᓯᑎᓪᓗᒋᑦ ᐃᓕᓯᒪᓗᒋᑦ ᑲᓇᑕᒥᐅᑦ ᓯᕗᓪᓕᐅᑏᓐᓇᕐᓗᒋᑦ ᐋᕿᒃᓱᐃᕙᓪᓕᐊᑎᓪᓗᑕ ᓴᓗᒪᓂᖅᓴᐅᔪᒥᒃ ᐊᒻᒪᓗ ᖃᓂᒪᓇᖅᑐᖃᓐᖏᑦᑐᒥᒃ ᓯᕗᓂᒃᓴᖃᕐᓂᐊᕋᑦᑕ. ᑲᑐᔾᔨᓗᑕ ᓅᑉᐸᓪᓕᐊᑦᑎᐊᖅᑕ ᑲᓇᑕ ᓯᕗᒻᒧᐊᒃᑎᓪᓗᒍ - ᑕᒪᐃᓐᓄᑦ.”</p></div>\n      "
}