{
  "path": "/en/news/news-releases/2022/09/26/prime-minister-announces-appointment-two-senators",
  "pageTitle": "The Prime Minister announces the appointment of two Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed Flordeliz (Gigi) Osler and Ian Shugart as independent Senators to fill vacancies for Manitoba and Ontario.</p>\n\n<p>Flordeliz (Gigi) Osler is an internationally renowned surgeon who operates in Winnipeg, an assistant professor at the University of Manitoba, and a dedicated advocate for equity, diversity, and inclusion. She was the first woman surgeon and the first racialized woman elected President of the Canadian Medical Association. Dr.&nbsp;Osler is known for her active involvement within and dedication to the medical community in Canada and abroad. She is also the recipient of numerous honours and awards.</p>\n\n<p>Ian Shugart devoted his life to public service and held increasingly senior leadership positions within the federal public service, most recently as the 24th Clerk of the Privy Council and Secretary to the Cabinet. He served as the principal link between the Prime Minister and the public service of Canada, including by delivering critical and timely support to Canadians during the COVID-19 pandemic. Throughout his career, Mr. Shugart also shaped the modernization of public health, provided leadership on international climate change negotiations, and managed sensitive national security issues and key international relationships.</p>\n\n<p>Dr.&nbsp;Osler and Mr. Shugart were recommended by the Independent Advisory Board for Senate Appointments, and chosen using a merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am pleased to welcome Flordeliz (Gigi) Osler and Ian Shugart as Parliament’s newest independent Senators. I am confident that their dedication, unique perspectives, and stellar careers will help them best serve Canadians from all walks of life. I look forward to working with them, and all Senators, as we continue to make life more affordable, take climate action, and make life better for people.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Senate is the Upper House in Canada’s parliamentary democracy. It unites a diverse group of accomplished Canadians in service of their country. Created to counterbalance representation by population in the House of Commons, the Senate not only defends regional interests, it also creates space for the voices of historically underrepresented groups like Indigenous Peoples, racialized communities, and women.</li>\n\t<li>With today’s announcement, there have been 62 independent appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li>\n\t<li>In 2016, the selection process for Senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n\t<li>The Board is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General, new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/09/26/flordeliz-gigi-osler\">Flordeliz (Gigi) Osler</a></li>\n\t<li><a href=\"/en/news/backgrounders/2022/09/26/ian-shugart\">Ian Shugart</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Senate Appointments Process – Questions and Answers</a></li>\n\t<li><a href=\"https://sencanada.ca/en\">Senate of Canada</a></li>\n</ul></div>\n      "
}