{
  "path": "/en/news/statements/2021/04/09/statement-prime-minister-vimy-ridge-day",
  "pageTitle": "Statement by the Prime Minister on Vimy Ridge Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement on Vimy Ridge Day:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Over 100 years ago today, on a cold Easter Monday in northern France, thousands of Canadians fought together to achieve one of the First World War’s most memorable victories.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“They came from every corner of Canada. They were Francophones, Anglophones, new Canadians, Black Canadians, and Indigenous peoples. Many of them were young men in their late teens and early twenties – homesick and exhausted, but brave and united in their fight for peace, freedom, and justice.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“In the early hours of April 9, 1917, after carefully planning and preparing their attack, they climbed from their trenches and stormed Vimy Ridge, an enemy fortress many thought could never be taken. Members of all four divisions of the Canadian Corps battled uphill through a landscape scarred by years of conflict, fighting side by side for the very first time. They did not stop until they had victory. Over the course of four days, through mud, shelling, and gunfire, they captured the entire ridge, achieving what no Allied army had done.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“The Battle of Vimy Ridge was an important chapter in the Great War and in our country’s history. Canadians proved themselves to be an elite force, and helped refine new fighting techniques. What they accomplished was more than a remarkable military feat. With courage, determination, and grit, they taught us that together, ordinary people can achieve extraordinary things. And in so doing, they helped define Canada as a country.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On this day, we honour the brave Canadians who fought at Vimy Ridge. Nearly 3,600 of them never came back home. Over 7,000 others were wounded. Their sacrifice transcends time and reminds us of the immense debt of gratitude we owe all Canadians in uniform, past and present, for their courage, dedication, and service.</span></span></span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“Lest we forget.”</span></span></p></div>\n      "
}