{
  "path": "/en/news/statements/2018/06/08/statement-prime-minister-world-oceans-day",
  "pageTitle": "Statement by the Prime Minister on World Oceans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Oceans Day:</p><p>“Oceans have a profound impact on our way of life. They are vast sources of food and energy, home to unique habitats and abundant marine life, and the site of historical moments that continue to shape the world.</p><p>“With the longest coastline on earth, Canada’s past – and future – is inseparable from its oceans, coasts, and seas. These natural treasures form the economic bedrock of countless communities. They are gateways to jobs, destinations for recreation and tourism, and hubs of global trade and transportation networks.</p><p>“This year, World Oceans Day coincides with the first day of the G7 Summit, where Canada will bring together world leaders and heads of international organizations to fight climate change and preserve the health and resilience of our oceans, coasts, and seas.</p><p>“Young people from across G7 countries have already brought forward inspiring ideas, and the #myoceans2050 and #G7oceans conversation will continue when the G7 Environment and Energy ministers meet to discuss how to work together on climate change, oceans, and clean energy in the Fall.</p><p>“Since launching the historic Oceans Protection Plan in 2016, the Government of Canada has made meaningful progress to improve the health of our oceans and restore coastal habitats across the country. We are also working in partnership with Indigenous Peoples and coastal communities to help protect and support our vital aquatic ecosystems, including endangered whales species. We will continue to take concrete steps to meet our international commitment to protect 10 per cent of our marine and coastal areas by 2020.</p><p>“World Oceans Day is the perfect day to take action to protect the waters that sustain us. You can make a difference right now by joining an <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/consultations/moving-toward-zero-plastic-waste.html\">online discussion</a> on how Canada can achieve zero plastic waste and reduce marine litter.</p><p>“All of us have a stake in keeping our oceans, coasts, and seas clean, healthy, and resilient. Today, and every day, let’s do our part to protect these great bodies of water and idyllic coasts for generations to come.”</p></div>\n      "
}