{
  "path": "/en/news/news-releases/2022/06/23/prime-minister-announces-reappointment-commissioner-northwest",
  "pageTitle": "Prime Minister announces reappointment of the Commissioner of the Northwest Territories | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the reappointment of the Honourable Margaret Thom as Commissioner of the Northwest Territories for a term of 18 months, effective June 26, 2022.</p>\n\n<p>Ms. Thom has dedicated her career to serving the people of the Northwest Territories. She assumed office as Commissioner of the Northwest Territories in 2017, after serving as Deputy Commissioner from 2005 to 2011. An active community member, leader, and educator, she is a former Governor of the Aurora College board and Vice-Chair of the Nats’ejee Keh Treatment Centre.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Margaret Thom has been a dedicated leader and a passionate advocate for Northerners. Over the past five years, she has represented them with pride as Commissioner of the Northwest Territories. I am pleased that she has agreed to continue in this role and I thank her for her ongoing dedication.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Fact</h2>\n\n<ul>\n\t<li>Territorial Commissioners are Governor in Council appointments. They fulfill many of the same duties as the Lieutenant Governor of a province. Their responsibilities include swearing in Members of the Legislative Assembly and Members of the Executive Council, opening the Legislative Assembly, and providing assent for legislation passed by the Assembly.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/06/23/honourable-margaret-thom-onwt\">The Honourable Margaret Thom, O.N.W.T.</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.ntassembly.ca/about/commissioner-nwt\">Commissioner of the Northwest Territories</a></li>\n</ul></div>\n      "
}