{
  "path": "/en/news/readouts/2020/08/17/prime-minister-justin-trudeau-speaks-president-chile-sebastian-pinera",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Chile Sebastián Piñera | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Chile, Sebastián Piñera.</p>\n\n<p>The two leaders discussed the COVID-19 pandemic and the significant efforts in Canada and Chile to address its health, social, and economic impacts. They also discussed the regional impacts of COVID-19 and the importance of coordination in managing the pandemic and working towards recovery.</p>\n\n<p>Prime Minister Trudeau and President Piñera reaffirmed the importance of maintaining free and open trade, and welcomed the recent Global Trade and Gender Arrangement reached among Canada, Chile, and New Zealand.</p>\n\n<p>The two leaders reaffirmed their commitment to ongoing cooperation between Canada and Chile to advance a range of common priorities, including the situation in Venezuela.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/chile-chili/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Chile Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/inclusive_trade-commerce_inclusif/itag-gaci/2020-08-04-joint-communique-commun.aspx?lang=eng\">Global Trade and Gender Arrangement – Joint Communiqué</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}