{
  "path": "/en/news/readouts/2023/02/07/prime-minister-justin-trudeau-meets-alberta-premier-danielle-smith",
  "pageTitle": "Prime Minister Justin Trudeau meets with Alberta Premier Danielle Smith | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Alberta Premier Danielle Smith, on the margins of the working meeting of First Ministers on health care.</p>\n\n<p>The two leaders discussed shared priorities for Albertans, including for workers and companies in the energy sector. They reaffirmed their commitment to making life more affordable for Canadians and Albertans and to further grow a range of sectors in Alberta.</p>\n\n<p>The Prime Minister highlighted that Albertan workers have long been, and will continue to be, a backbone of the Canadian economy. The Prime Minister and Premier Smith discussed ways to work together to ensure Albertan energy continues to get to global markets, while supporting innovation in the industry that will drive strong economic growth as well as creating and securing good middle-class jobs.</p>\n\n<p>Prime Minister Trudeau noted several investments the Government of Canada is making to support Albertan workers and Albertan projects, like the investment tax credit for capital invested in carbon capture, utilization, and storage projects, and the support for world-leading clean hydrogen projects.</p>\n\n<p>The two leaders committed to remain in contact on these important priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/08/prime-minister-justin-trudeau-speaks-premier-designate-alberta-danielle\">Prime Minister Justin Trudeau speaks with Premier-designate of Alberta Danielle Smith</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/08/additional-design-features-of-the-investment-tax-credit-for-carbon-capture-utilization-and-storage-recovery-mechanism-climate-risk-disclosure-and-k.html\">Additional Design Features of the Investment Tax Credit for Carbon Capture, Utilization and Storage: Recovery Mechanism, Climate Risk Disclosure, and Knowledge Sharing</a></li>\n</ul></div>\n      "
}