{
  "path": "/en/news/statements/2022/08/04/statement-prime-minister-50th-anniversary-ugandan-asian-resettlement",
  "pageTitle": "Statement by the Prime Minister on the 50th anniversary of the Ugandan Asian resettlement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 50th anniversary of the Ugandan Asian resettlement:</p>\n\n<p>“Fifty years ago, Canada welcomed more than 7,000 South Asians expelled from Uganda as part of an international resettlement effort. Today, we honour the resilience, strength, and courage of Ugandans of South Asian descent and reflect on the many important contributions they have made – and continue to make – to Canadian communities across the country.</p>\n\n<p>“On August 4, 1972, the Ugandan President Idi Amin Dada ordered all South Asians to leave Uganda within 90 days. This appalling decision reflected severe anti-South Asian discrimination and led to the rapid and brutal expulsion of tens of thousands of people – many were stripped of their Ugandan citizenship and effectively left stateless.</p>\n\n<p>“In the face of this humanitarian crisis, Canada acted swiftly and accepted to take in over 4,400 South Asian Ugandans, and thousands more followed later. The government sent immigration officers to Uganda to help with processing, and Ugandans of South Asian descent started arriving in Canada the following month. After a 19-hour flight, the first group of South Asian Ugandans landed at the Longue-Pointe detachment of Canadian Forces Base Montreal, where they were provided hot food, warm clothing, and a new country to call home.</p>\n\n<p>“In the five decades since, South Asian Ugandans have become a vibrant part of Canada’s social and economic fabric. Their many important contributions have made our country stronger, more diverse, and more inclusive.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to learn more about the expulsion and resettlement of South Asian Ugandans in Canada and beyond. Canada will continue to honour our longstanding tradition of protecting those fleeing conflict and persecution – no matter who they are and where they are from.”</p></div>\n      "
}