{
  "path": "/en/news/statements/2023/01/22/statement-prime-minister-day-unity-ukraine",
  "pageTitle": "Statement by the Prime Minister on the Day of Unity of Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the Day of Unity of Ukraine:</p>\n\n<p>“Today, as the people of Ukraine continue to fight for their freedom in the face of Russia’s brutal and unjustifiable invasion, we join them in marking the Day of Unity of Ukraine. We celebrate the country’s unification in 1919 and its eventual independence and honour the brave Ukrainians who gave their lives to defend Ukraine’s liberty.</p>\n\n<p>“On January 22, 1919, the <em>Unification Act</em> was proclaimed, joining the Ukrainian People’s Republic and the Western Ukrainian People’s Republic into a single, independent state. This day has traditionally been associated with images of people holding hands to form living chains, representing a strong and united Ukraine. Since Russia’s latest aggression against Ukraine began almost a year ago, people around the world, including right here in Canada, have been forming living chains to express their solidarity with Ukrainians, denounce Russia’s invasion, and share hope for a peaceful future.</p>\n\n<p>“Canada’s ties with Ukraine run deep. We are home to the second largest Ukrainian diaspora in the world, with over 1.4&nbsp;million people of Ukrainian descent living in this country today. When Ukraine again declared its independence in 1991, Canada was the first Western country to recognize that status. And since then, we have enjoyed a close bilateral relationship rooted in deep ties between our peoples and shared values of freedom, democracy, and the rule of law.</p>\n\n<p>“As Russia continues its brutal, unjustifiable invasion, the Government of Canada remains steadfast in its commitment to supporting the Ukrainian people and government to achieve peace and help secure a free and democratic future for Ukraine. We will continue to support Ukraine with military, humanitarian, financial, and social assistance for as long as necessary.</p>\n\n<p>“On this Day of Unity, we stand together against violence, authoritarianism, and threats to democracy. We honour the lives tragically lost in the fight to protect Ukraine’s sovereignty, territorial integrity, and independence. And we continue to uphold the fundamental values of freedom, democracy, and justice that unite our peoples.</p>\n\n<p>“Slava Ukraini!”</p></div>\n      "
}