{
  "path": "/en/news/statements/2022/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/observances/ending-violence-against-women-day\">International Day for the Elimination of Violence against Women</a>, we come together to take action to stop gender-based violence and recognize the tireless work advocacy groups and community organizations do to support survivors and their families.</p>\n\n<p>“Every day, women, girls, and gender diverse people across Canada experience violence because of their gender, gender expression, or perceived gender. Certain groups, such as Indigenous women and girls, racialized women, women living in rural and remote communities, people in 2SLGBTQI+ communities, and women with disabilities, are at even greater risk to experience gender-based violence. This is unacceptable. But together, we can end the cycle. It is everyone’s responsibility to take action against gender-based violence regardless of whether it’s physical, emotional, financial, or sexual violence. Through this year’s <a href=\"https://women-gender-equality.canada.ca/en/gender-based-violence-knowledge-centre/gender-based-violence-its-not-just.html\">It’s Not Just</a> campaign, the Government of Canada is raising awareness of the different forms of gender-based violence, and we’re providing resources so we can all play a role in preventing it.</p>\n\n<p>“As a government, we will continue to take action to prevent and address gender-based violence, too. Earlier this year, we introduced Bill&nbsp;C-21, which proposes Canada’s most significant action against gun violence in a generation. Further to this, we banned the sale, purchase, and transfer of handguns in October, which will make communities safer and help save lives. Recently, the federal government, along with most provinces and territories, also endorsed the <a href=\"https://www.publicsafety.gc.ca/cnt/trnsprnc/brfng-mtrls/prlmntry-bndrs/20210302/015/index-en.aspx\">National Action Plan to End Gender-Based Violence</a>, which sets a framework for anyone facing gender-based violence to have reliable and timely access to protection and services, no matter where they live.</p>\n\n<p>“The work to end gender-based violence is far from over. We continue to work in partnership with Indigenous families, Survivors, leaders, and partners, as well as with provinces and territories to implement the&nbsp;<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway</a> and put an end to the tragedy of missing and murdered Indigenous women, girls, and 2SLGBTQI+ people. We will continue our efforts until everyone in Canada – regardless of their gender, gender expression, or perceived gender – can feel safe and respected.</p>\n\n<p>“Today, as we mark the start of the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/16-days.html\">16 Days of Activism against Gender-Based Violence</a>, I invite all Canadians to join the conversation on ending gender-based violence by using the hashtags #ItsNotJust and #16Days. We all have a role to play in ending the cycle and ensuring everyone can feel safe now and into the future.”</p></div>\n      "
}