{
  "path": "/en/news/statements/2021/08/24/g7-leaders-statement-afghanistan",
  "pageTitle": "G7 Leaders Statement on Afghanistan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, 24 August 2021, under the Presidency of the United Kingdom, we the Leaders of the Group of Seven met virtually to discuss the situation in Afghanistan. We were joined by the Secretaries General of the United Nations (UN) and NATO. We reaffirm our steadfast commitment to the people of Afghanistan, and support the UN Security Council statement of 16 August. We express our grave concern about the situation in Afghanistan and call for calm and restraint to ensure the safety and security of vulnerable Afghan and international citizens, and the prevention of a humanitarian crisis. We call for adherence to obligations under international human rights law, including the rights of women, girls, and minority groups, and that international humanitarian law is upheld in all circumstances. We honour the significant sacrifices made by the Afghan people, people of our own countries, and countless others, who have worked toward a more peaceful, just and secure future for Afghanistan.</p>\n\n<p>The Afghan people deserve to live in dignity, peace and security, reflecting the last two decades of their political, economic and social achievements, in particular for women and girls. Afghanistan must never again become a safe haven for terrorism, nor a source of terrorist attacks on others. Working with partners, in particular NATO allies, we will continue to fight terrorism with resolve and solidarity, wherever it is found. Any future Afghan government must adhere to Afghanistan’s international obligations and commitment to protect against terrorism; safeguard the human rights of all Afghans, particularly women, children, and ethnic and religious minorities; uphold the rule of law; allow unhindered and unconditional humanitarian access; and counter human and drug trafficking effectively. We call on all parties in Afghanistan to work in good faith to establish an inclusive and representative government, including with the meaningful participation of women and minority groups.</p>\n\n<p>We affirm our enduring commitment to the people of Afghanistan, including through a renewed humanitarian effort by the international community. To this end we support the UN in coordinating the immediate international humanitarian response in the region, including unfettered humanitarian access in Afghanistan, and will contribute collectively to that response. As part of that, we will cooperate together and with neighbouring and other countries in the region on supporting Afghan refugees and host communities as part of a coordinated long-term regional response. We call on all partners of Afghanistan to support this effort and wider regional stability through multilateral channels.</p>\n\n<p>As part of this, our immediate priority is to ensure the safe evacuation of our citizens and those Afghans who have partnered with us and assisted our efforts over the past twenty years, and to ensure continuing safe passage out of Afghanistan. We will continue to coordinate closely on this, and we expect all parties to continue to facilitate this, and to ensure the safety of humanitarian and medical personnel, and other international service providers. We will cooperate together, and with neighbouring and other countries in the region hosting refugees, on a coordinated approach to safe and legal routes for resettlement.</p>\n\n<p>We will work together, and with our allies and regional countries, through the UN, G20 and more widely, to bring the international community together to address the critical questions facing Afghanistan. As we do this, we will judge the Afghan parties by their actions, not words. In particular, we reaffirm that the Taliban will be held accountable for their actions on preventing terrorism, on human rights in particular those of women, girls and minorities and on pursuing an inclusive political settlement in Afghanistan. The legitimacy of any future government depends on the approach it now takes to uphold its international obligations and commitments to ensure a stable Afghanistan.</p></div>\n      "
}