{
  "path": "/en/news/statements/2021/02/05/statement-prime-minister-death-christopher-plummer",
  "pageTitle": "Statement by the Prime Minister on the death of Christopher Plummer | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Christopher&nbsp;Plummer: &nbsp;&nbsp;&nbsp; &nbsp;</p>\n\n<p>“Today, Canada and indeed the world lost one of our most iconic and beloved actors – Christopher Plummer.</p>\n\n<p>“Whether performing on stage, in film, or on television, Mr.&nbsp;Plummer showed gravitas, dignity, and heart throughout a career that spanned over six decades. A&nbsp;longtime pillar of Canada’s Stratford Festival, he also performed on Broadway and starred in over 150 feature films, television movies, and miniseries. He gave life to so many characters we grew to love and cherish, from Captain&nbsp;von&nbsp;Trapp, to Richard&nbsp;III and Star Trek’s General&nbsp;Chang.</p>\n\n<p>“Mr.&nbsp;Plummer’s talent earned him numerous accolades. He received an Academy Award, a BAFTA Award, a Genie Award, a Golden Globe Award, two Tony Awards, two Emmy Awards, the Governor General’s Performing Arts Award for Lifetime Achievement, and a Lifetime Achievement Award from the Academy of Canadian Cinema and Television. Mr.&nbsp;Plummer received honorary doctorates from several universities, was invested as Companion of the Order of Canada, and was inducted into Canada’s Walk of Fame and the American Theater Hall of Fame. &nbsp;&nbsp;</p>\n\n<p>“Mr.&nbsp;Plummer was a timeless actor who entertained millions around the world and inspired many to pursue the arts. A true gentleman and a consummate professional, his presence both on and off the stage will be thoroughly missed. On behalf of all Canadians, I extend my deepest condolences to his family, his friends, and his many fans.”</p></div>\n      "
}