{
  "path": "/en/news/readouts/2022/06/16/prime-minister-justin-trudeau-speaks-president-rwanda-paul-kagame",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Rwanda Paul Kagame | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Rwanda, Paul Kagame, about the upcoming Commonwealth Heads of Government Meeting in Kigali.</p>\n\n<p>Prime Minister Trudeau looked forward to travelling to Rwanda next week and to meeting with President Kagame. The two leaders exchanged views on their objectives and the path forward for the modernization and renewal of the Commonwealth, noting the importance of substantive discussions on climate, youth employment, and innovation. The Prime Minister also emphasized the need for countries in the Commonwealth to promote democracy, human rights, and pluralism in line with the Commonwealth Charter.</p>\n\n<p>The two leaders exchanged views on Russia’s invasion of Ukraine and noted that the invasion was contrary to foundational principles of the Commonwealth. Prime Minister Trudeau reiterated that the invasion was an affront to the fundamental principles of sovereignty, territorial integrity, self-determination, and international law, and expressed that it is important for the Commonwealth summit to provide an opportunity for member countries to stand up for democracy and denounce Russia’s invasion of Ukraine. The leaders discussed the impact of the resulting supply chain disruptions, price hikes, and increasing food security issues, that have hit Africa particularly hard.</p>\n\n<p>The two leaders also spoke about the growing depth and scope of bilateral relations. Prime Minister Trudeau looked forward to a fulsome discussion on these issues at next week’s meetings.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_rwanda.aspx?lang=eng\">Canada-Rwanda relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://thecommonwealth.org/chogm\">Commonwealth Heads of Government Meeting</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}