{
  "path": "/en/news/news-releases/2018/02/10/prime-minister-concludes-visit-united-states",
  "pageTitle": "Prime Minister concludes visit to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Chicago, San Francisco, and Los Angeles. During his visit, the Prime Minister met with several political and business leaders to underscore the importance of the Canada-US relationship, and create more opportunities for Canada’s middle class.</p><p>In Chicago, the Prime Minister met with Illinois Governor Bruce Rauner and Mayor of Chicago Rahm Emanuel to discuss the importance of the North American Free Trade Agreement (NAFTA), as well as climate change, cross border tourism, and the energy sector. He also spoke to students at the University of Chicago Institute of Politics, where he stressed the importance of civic duty, youth engagement, gender equality, and multiculturalism.</p><p>In San Francisco, Prime Minister Trudeau met with global business leaders to promote Canada as one of the best places to invest. He met with Chief Executive Officer of Salesforce Marc Benioff, who announced that his company would invest US$2 billion over the next five years in Canada. This investment will expand Salesforce’s client relationship management services and lead to the creation of thousands of good, middle class jobs. The Prime Minister also met with AppDirect President and Chief Executive Officer Daniel Saks, who announced that he would create 300 new jobs and expand the company’s footprint in Canada.</p><p>The Prime Minister also held meetings with Amazon Chief Executive Officer Jeff Bezos, AMGen Chairman and Chief Executive Officer Robert Bradway, and eBay President and Chief Executive Officer Devin Wenig.</p><p>The next day, Prime Minister Trudeau met with Governor of California Jerry Brown and Lieutenant Governor of California Gavin Newsom to discuss the benefits of NAFTA for both California and Canada, and the importance of continued collaboration on climate change.&nbsp;</p><p>In the Los Angeles area, the Prime Minister delivered an address at the Ronald Reagan Presidential Foundation and Institute in Simi Valley. During the address, he spoke about the historic partnership between Canada and the United States, and how it is essential to our shared security, prosperity, and to millions of middle class jobs.</p><p>While in Los Angeles, the Prime Minister also met with Mayor of Los Angeles Eric Garcetti to discuss diversity, inclusion, and the need to help middle class families.</p><h2>Quote</h2><p>“The connections between Canada and the United States are as old as our countries themselves – from deep family ties, to businesses that work back and forth across the border, to the world’s most important trade relationship. All of us benefit when we work together. This trip was a chance to build on our unique relationship, and continue to work together to create opportunities for the middle class on both sides of the border.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p><h2>Quick Facts</h2><ul><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade between the two countries was valued at nearly $882&nbsp;billion in 2016, and Canada is the largest secure supplier of energy to the U.S.</li><li>The two countries share the longest, secure border in the world, over which some 400,000 people and $2.4 billion worth of goods and services cross daily.</li><li>Canada buys more goods from the United States than China, Japan and the UK combined.</li><li>Canada is the number one export destination for most American states, and cross-border trade and investment supports nearly nine millions jobs in the United States.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/01/19/prime-minister-travel-united-states\">Prime Minister to travel to the United States</a></li><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States Relations</a></li></ul></div>\n      "
}