{
  "path": "/en/news/statements/2020/11/30/statement-prime-minister-launch-christmas-lights-across-canada",
  "pageTitle": "Statement by the Prime Minister on the launch of Christmas Lights Across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the launch of the 36th edition of Christmas Lights Across Canada, which will run until January&nbsp;7, 2021:</p>\n\n<p>“Tonight, we will mark the beginning of the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/christmas-lights.html\">Christmas Lights Across Canada</a> program, and although we will not be able to come together in person on Parliament Hill this year, Canadians will still be able to marvel at the beauty of the lights.</p>\n\n<p>“At a time of the year when the days are getting shorter and colder, this Canadian tradition offers us a heartwarming moment, and brings us together from coast to coast to coast. This year more than ever, we need celebrations like these to remind us that, despite the hardships, we are all united as Canadians.</p>\n\n<p>“This beautiful display also reminds us that there is light at the end of the tunnel, that we will get through this global COVID-19 pandemic, and that we must continue to stand together. Our values of unity and of being there for one another, and our confidence in the future, will allow us to continue working to build an even better Canada.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to be amazed by the virtual show IllumiNATION, which will premiere on the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/christmas-lights.html\">Canadian Heritage website</a> on Thursday, December 17 at 8 p.m. ET. The show will feature a wide range of artistic performances from Ottawa, Montréal, Toronto, Halifax, Moncton, Calgary, Vancouver, Yellowknife, and Old Crow, Yukon. It will be a wonderful opportunity to celebrate what unites us on these cold winter days, while respecting health guidelines. Sophie and I wish you all a happy holiday season.”</p></div>\n      "
}