{
  "path": "/en/news/news-releases/2017/12/15/toronto-york-spadina-subway-extension-reduces-gridlock-and-commute",
  "pageTitle": "Toronto-York Spadina Subway Extension reduces gridlock and commute times | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Easy access to public transit means Canadians spend less time commuting and more time doing the things they love. A well-functioning transit system supports middle class jobs, grows the economy, reduces air pollution, and creates inclusive communities. That is why the governments of Canada, Ontario, Toronto, and York Region are investing in modern, green public transit infrastructure.</p><p>The Prime Minister, Justin Trudeau, the Premier of Ontario, Kathleen Wynne, the Mayor of Toronto, John Tory, the Chairman and CEO of York Region, Wayne Emmerson, and the Chair of the Toronto Transit Commission (TTC), Josh Colle, today announced the completion of the Toronto-York Spadina Subway Extension.</p><p>The new extension, also known as the TTC Line 1 Extension, connects Sheppard West Station in Toronto to the Vaughan Metropolitan Centre Station in York Region. The 8.6&nbsp;kilometre extension will reduce commute times and make it easier and faster for residents and tourists to get around.</p><p>The Government of Canada contributed close to $700 million to the project, and the Province of Ontario provided $974 million through the Move Ontario Trust. In addition, the City of Toronto and the Regional Municipality of York contributed $904 million and $604 million in funding, respectively.</p><h2>Quotes</h2><blockquote><p>“Modernizing our public transit infrastructure is about creating good, middle class jobs and transforming the way that Canadians move, work, and live. This project is an example of what can be accomplished when all levels of government work together to make our communities more connected and more welcoming.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Today marks an incredible public transit achievement. The new Line 1 subway extension crosses regional boundaries and will make York Region and the Greater Toronto Area more inclusive and sustainable. This vital public transit improvement project will contribute to ensuring that Canadians communities remain among the best places in the world to live, work and raise a family.”<br>— <cite>The Hon. Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><blockquote><p>“The Toronto-York Spadina Subway Extension is a major milestone in our government's commitment to building transit across Ontario. With the Ontario government's $974 million investment and the strong partnership of all levels of government, these new connections will help build an even Greater Toronto Area. This historic subway extension will slash travel times for transit riders and ease road congestion for drivers. It's just one of the many transit and transportation projects underway all across the province, designed to get you where you need to go in record time - and home to your family sooner.”<br>— <cite>The Hon. Kathleen Wynne, Premier of Ontario</cite></p></blockquote><blockquote><p>\"Today's rapid transit milestone benefits Toronto residents, students and businesses. This opening is another example of all levels of government working together cooperatively to deliver billions of dollars in transit infrastructure and our ongoing commitment to getting Toronto moving. This is the first subway extension we've opened in 15 years and we're determined we won't be waiting another 15 years to expand the transit system. Beyond this subway extension, we have a transit plan that will make sure we get on with building SmartTrack, the Relief Line, the Scarborough Subway Extension and to expand the City's LRT network. More transit is a good thing for our city, our province and our country.\"<br>— <cite>John Tory, Mayor of the City of Toronto</cite></p></blockquote><blockquote><p>\"This is a monumental occasion for 1.2 million people who call York Region home. In addition to moving people and goods more efficiently, this subway extension offers an once-in-a-lifetime opportunity. It reinforces our Council's support of transportation and transportation-related initiatives, and will help further develop an urban community that is transit-oriented, forward-thinking and has economic development opportunities to benefit current and future generations. We offer our sincerest gratitude and appreciation to the federal and provincial governments for their ongoing support and vision.\"<br>— <cite>Wayne Emmerson, York Region Chairman and CEO</cite></p></blockquote><blockquote><p>\"This is a historic milestone for the TTC with the opening of a critical extension of our subway system, with 6 new stations featuring Wi-Fi, public art, transit connections, commuter parking, the Presto fare system, and new fare gates. The subway will also be the first time ever that the TTC subway system will cross a municipal border, linking Toronto and York University with York Region with fast and frequent rapid transit.\"<br>— <cite>Josh Colle, TTC Chair and Toronto City Councillor for Ward 15 Eglinton-Lawrence</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Line 1 extension project – which created an estimated 20,000 well-paying, middle class jobs during its construction – includes six new stations: Downsview Park, Finch West, York University, Pioneer Village, Highway 407 and Vaughan Metropolitan Centre. It also includes three new commuter parking lots and TTC, York Region, and GO bus terminals.</li><li>The Government of Canada provided $622 million through the Building Canada Fund and an additional $75 million through a one-time transfer to the Government of Ontario’s Move Ontario Trust.</li><li>This is the first subway service in Ontario’s history that moves across regional boundaries.</li><li>The Government of Canada will provide more than $180 billion in infrastructure funding over 12 years for public transit, green infrastructure, social infrastructure, transportation that supports trade, and Canada’s rural and northern communities.</li><li>To support public transit, Budget 2017 proposed $25.3 billion, which includes $5&nbsp;billion that will be invested in public transit systems by the Canada Infrastructure Bank.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada, the Government of Canada’s new $180 billion infrastructure plan</a></li><li><a href=\"http://www.infrastructure.gc.ca/prog/bcf-fcc-eng.html\">Building Canada Fund</a></li><li><a href=\"https://www.ontario.ca/page/buildon-2017-infrastructure-update\">Build ON 2017 Infrastructure Update</a></li><li><a href=\"https://www.ttc.ca/Spadina/index.jsp\">Toronto-York Spadina Subway Extension</a></li></ul></div>\n      "
}