{
  "path": "/en/news/news-releases/2017/06/30/governor-general-canada-visit-peoples-republic-china",
  "pageTitle": "Governor General of Canada to visit the People’s Republic of China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Excellency the Right Honourable David Johnston, Governor General of Canada, will pay an official visit to the People’s Republic of China, with stops in Chongqing, Guiyang, and Beijing, from July 10 to 14, 2017.</p><p>During his visit, the Governor General will highlight opportunities for further collaboration in science, technology and innovation. He will also promote Canadian agri-food products, and stronger education and tourism ties with China.</p><p>The official visit will provide an opportunity for the Governor General to meet with key national and regional leaders in Chinese business and government.</p><p>His Excellency will be accompanied by the Honourable Bardish Chagger, Leader of the Government in the House of Commons and Minister of Small Business and Tourism; the Honourable Carla Qualtrough, Minister of Sport and Persons with Disabilities; and a delegation of parliamentarians and civil society leaders.</p><h2>Quote</h2><blockquote><p>“Canada is committed to deeper and broader engagement with China. A closer, more balanced relationship with China is essential to creating jobs, strengthening the middle class, and growing the Canadian economy. The Governor General’s visit is an opportunity to deepen our relationship, and further strengthen our social and commercial ties.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Following his state visit in 2013, this will be the Governor General’s second visit to China.</li><li>Canada and China enjoy an active working relationship in international fora, such as the G20, the United Nations, the Asia-Pacific Economic Cooperation forum, and the World Trade Organization.</li><li>China is Canada’s second-largest trading partner, largest and fastest growing source market for international students, and third-largest source of tourists.</li><li>Chinese (including Mandarin, Cantonese and other dialects) is Canada’s third most spoken language after English and French. Immigrants born in China form one of the largest groups within Canada’s population.</li><li>Canada and China benefit from significant bilateral trade and investment flows, with close cooperation on natural resources and energy, health, and technology.</li></ul><h2>Associated link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/index.aspx?lang=eng\">Canada in China</a></li></ul></div>\n      "
}