{
  "path": "/en/news/news-releases/2016/11/15/prime-minister-announces-special-advisor-lgbtq2-issues",
  "pageTitle": "Prime Minister announces Special Advisor on LGBTQ2 issues | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Randy Boissonnault, Member of Parliament for Edmonton Centre, has been named Special Advisor on LGBTQ2 issues.</p><p>Mr. Boissonnault’s principal role will be to advise the Prime Minister on the development and co-ordination of the Government of Canada’s LGBTQ2 agenda. This will include working with LGBTQ2 organizations from across the country to promote equality for the LGBTQ2 community, protect the rights of its members, and address discrimination against them – both historical and current.</p><p>This kind of discrimination was documented in a report recently released by Egale Canada Human Rights Trust (Egale) on June 10, 2016, entitled “The Just Society Report”. The Government of Canada welcomed this report, supports the values, principles, and objectives it espouses, and will work with Egale and other partners to take action against the discrimination the report describes.</p><p>The actions being announced today are part of the Government of Canada’s overall efforts to ensure that all Canadian citizens are treated equally and with respect. Another important measure it took in May 2016 was tabling historic legislation (Bill C-16) to recognize and reduce the vulnerability of trans and other gender-diverse persons to discrimination, hate propaganda, and hate crimes, and to affirm their equal status in Canadian society. The Government also intends to repeal section 159 of the <em>Criminal Code</em>.</p><p>Canada is also actively promoting LGBTQ2 rights on the international stage. It is funding and implementing LGBTQ2-related projects abroad supporting violence-prevention programs, awareness-raising campaigns and advocacy efforts, including initiatives aimed to combat homophobia and transphobia in education systems.</p><h2>Quotes</h2><blockquote><p>“We have made great strides in securing legal rights for the LGBTQ2 community in Canada – from enshrining equality rights in the Charter to the passage of the <em>Civil Marriage Act</em>. But the fight to end discrimination is not over and a lot of hard work still needs to be done. Canadians know our country is made stronger because of our diversity, not in spite of it.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“It is an honour and a privilege to be named to this role. I will work hard with the Prime Minister and the LGBTQ2 community to advance and protect their rights and address historical injustices they have endured.&nbsp; I look forward to collaborating closely with Egale and other organizations in the coming months to advance the government’s agenda for equality.”<br>– <cite>Member of Parliament Randy Boissonnault, Parliamentary Secretary to the Minister of Canadian Heritage and the Prime Minister’s Special Advisor on LGBTQ2 issues</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In addition to being the Prime Minister’s Special Advisor on LGBTQ2 issues, Mr. Boissonnault retains his current duties as Parliamentary Secretary to the Minister of Canadian Heritage.</li><li>Canada also takes every opportunity to raise important issues related to LGBTQ2 rights in multilateral forums, like at the UN Human Rights Council (HRC)&nbsp; and will continue to do so in close partnership with other governments and civil society organizations.</li><li>Founded in 1995, Egale Human Rights Trust is a national charity promoting lesbian, gay, bisexual and trans human rights. Their vision is a Canada, and ultimately a world, without homophobia, biphobia, transphobia and all other forms of oppression so that every person can achieve their full potential, free from hatred and bias.</li><li>If Bill C-16 (An Act to amend the Canadian Human Rights Act and the Criminal Code) is passed, gender identity and gender expression will become prohibited grounds of discrimination under the Canadian Human Rights Act (CHRA). Hate propaganda offences in the Criminal Code will be expanded to protect identifiable groups who are targeted for their gender identity or expression. The Criminal Code will be amended to clarify that where there is evidence that someone committed a crime motivated by bias, prejudice or hate based on gender identity or gender expression, a judge must consider that as an aggravating factor in deciding what sentence to impose.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://egale.ca/wp-content/uploads/2016/06/FINAL_REPORT_EGALE.pdf\">The Just Society Report</a></li><li><a href=\"http://news.gc.ca/web/article-en.do?nid=1066579\">News Release – Government moves to strengthen laws against discrimination based on gender identity and expression</a></li><li><a href=\"http://news.gc.ca/web/article-en.do?mthd=index&amp;crtr.page=1&amp;nid=1066589\">Backgrounder – Gender identity and gender expression</a></li></ul></div>\n      "
}