{
  "path": "/en/news/news-releases/2019/06/25/ukrainian-president-volodymyr-zelenskyy-visit-canada",
  "pageTitle": "Ukrainian President Volodymyr Zelenskyy to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of Ukraine, Volodymyr Zelenskyy, will visit Canada from July 1 to 3, 2019. The two leaders will meet in Toronto on July 2, 2019, during the Ukraine Reform Conference.</p>\n\n<p>During the meeting, Prime Minister Trudeau will reiterate Canada’s unwavering support for the people of Ukraine and its sovereignty and territorial integrity. The two leaders will discuss Ukraine’s reform efforts on its path to Euro-Atlantic integration, the security situation in the region, and how to further deepen Canada-Ukraine commercial relations.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Ukraine share a deep and historic friendship built on shared values and strong people-to-people bonds. I look forward to my meeting with President Zelenskyy, where I will reaffirm Canada’s commitment to the Ukrainian people, and discuss ways to deepen our economic partnership and create good, middle class jobs in both of our countries.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Ukraine Reform Conference will take place in Toronto on July 2-4, 2019. Co-hosted by Canada and Ukraine, the Conference brings together key international friends and partners to support Ukraine. It is an opportunity for further progress in its ambitious reform programme, designed to bring security and prosperity to the people of Ukraine.</li>\n\t<li>Canada and Ukraine have enjoyed a close bilateral relationship since Canada became the first Western nation to recognize Ukraine’s independence on December 2, 1991.&nbsp;</li>\n\t<li>Canada and Ukraine’s warm people-to-people ties are strengthened by the more than 1.3&nbsp;million-strong Ukrainian-Canadian community.&nbsp;</li>\n\t<li>Since January 2014, Canada has committed more than $785 million in support to Ukraine, covering a broad range of financial, development, stabilization, and security, non-lethal military and humanitarian assistance.</li>\n\t<li>On March 31 and April 21, over 200 Canadians participated as election observers for each round of the Ukrainian presidential elections. Canada will also support the deployment of over 300 long-term and short-term observers to observe the Parliamentary elections scheduled for July 21.</li>\n\t<li>Since 2015, the Canadian Armed Forces have trained more than 12,000 members of the Ukrainian armed forces as part of Operation UNIFIER, Canada’s military training mission in Ukraine.</li>\n\t<li>Canada and Ukraine cooperate in a range of international organizations, including the United Nations, the Organization for Security and Co-operation in Europe (OSCE), and La Francophonie.</li>\n\t<li>The coming into force of the Canada-Ukraine Free Trade Agreement on August 1, 2017, represents an important milestone in the countries’ bilateral relationship, and provides the framework for promoting new private sector partnerships and generating economic benefits for Canada and Ukraine.</li>\n\t<li>Canada's two-way merchandise trade with Ukraine totalled&nbsp;$346&nbsp;million&nbsp;in 2018.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://www.canadainternational.gc.ca/ukraine/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Ukraine Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ukraine_reform-reformes/index.aspx?lang=eng\">Ukraine Reform Conference</a>&nbsp;</li>\n</ul></div>\n      "
}