{
  "path": "/en/news/news-releases/2017/02/08/prime-minister-justin-trudeau-address-european-parliament-france-and",
  "pageTitle": "Prime Minister Justin Trudeau to address European Parliament in France and visit Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Strasbourg, France, on February 16 to address the European Parliament, and will visit Berlin and Hamburg, Germany, on February 16 and 17.</p><p>The Prime Minister was invited by the President of the European Parliament, Antonio Tajani, to address the European Parliament on the importance of the Canada-European Union (EU) relationship. This will be the first time that a sitting Canadian Prime Minister addresses the full European Parliament.</p><p>The Prime Minister will then travel to Berlin to meet with German Chancellor, Angela Merkel, to discuss key foreign policy and commercial priorities for Canada and Germany. The Prime Minister will then travel to Hamburg to attend the city’s annual St. Matthew’s Day banquet as this year’s guest of honour. &nbsp;</p><p>This visit will serve to deepen the close bonds between Canada, Germany, and the EU. It will also be an opportunity to promote Canada’s role as a leader on progressive trade and investment, including by highlighting how the implementation of the Canada-EU Comprehensive Economic and Trade Agreement (CETA) will create jobs, bolster our shared prosperity, and help grow the middle class.‎</p><h2>Quotes</h2><blockquote><p>“CETA is the most progressive trade agreement ever negotiated by Canada or the European Union. CETA sets a high standard for free trade agreements of the future. It will benefit Canada and the European Union by opening new markets and creating new opportunities for Canadian businesses and workers on both sides of the Atlantic.”<br> <cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Germany is an important friend and ally, and I look forward to meeting with Chancellor Merkel to further strengthen this relationship. Our two countries enjoy robust commercial ties that cover trade, investment, science, technology and innovation, and we are always open to new ways to expand this relationship and grow the middle class in both our countries.”<br> <cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>On October 30, 2016, CETA and the Canada-EU Strategic Partnership Agreement were signed at the Canada-EU Summit in Brussels.</li><li>The EU is Canada’s second largest trading partner after the United States, and the world’s second largest economy.</li><li>Germany has the largest economy in the EU and the fourth largest in the world. It is also an important trade and investment partner for Canada. In 2016, two-way bilateral trade reached more than $21 billion, making it our sixth largest trading partner. It is also one of the top ten foreign investors in Canada.</li><li>The Prime Minister and Chancellor Merkel last met in July 2016 on the margins of the NATO Summit in Warsaw, Poland.</li><li>Germany holds the G20 presidency in 2017 and will host the G20 leaders’ Summit on July 7 and 8, 2017, in Hamburg.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2016/10/30/canada-and-eu-sign-historic-trade-agreement-during-eu-canada-summit\">Canada and EU sign historic trade agreement during EU-Canada Summit</a></li><li><a href=\"http://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li><li><a href=\"http://www.international.gc.ca/europe/eu-ue.aspx?lang=eng\">Canada and Europe</a></li></ul></div>\n      "
}