{
  "path": "/en/news/statements/2018/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p><p>“Millions of Canadians live with a disability. They are our parents, spouses, children, colleagues, neighbours, and friends. They are entitled to the same rights and protections as everyone else. Yet, every day, many Canadians with disabilities face unacceptable barriers that hold them back and keep our country from becoming a truly equal place.</p><p>“While we have made progress towards a more accessible and inclusive society, much work remains to be done. Too many Canadians with disabilities continue to have to break down barriers and fight battles, seen and unseen, alone. Too many face stigma and exclusion where they should find acceptance and support. And too many find their potential limited because of stereotypes and closed minds.</p><p>“Over the last three years, the Government of Canada has taken steps to promote the rights of Canadians with disabilities and build a fairer, more accessible country for all. We met with and listened to thousands of Canadians with disabilities to draft Canada’s first national accessibility law – <a href=\"https://www.canada.ca/en/employment-social-development/programs/accessible-people-disabilities.html\">the Accessible Canada Act</a>. The proposed Act, which passed in the House of Commons last week, would help remove and prevent barriers to accessibility across Canada, and promote equal opportunities for all people in Canada, no matter their disability.</p><p>“On behalf of the Government of Canada, I invite all Canadians to join me in marking the International Day of Persons with Disabilities. We celebrate the extraordinary accomplishments and contributions of people living with disabilities, and rededicate ourselves to building a barrier-free and better country for everyone.”</p></div>\n      "
}