{
  "path": "/en/news/news-releases/2019/06/07/prime-minister-concludes-travel-united-kingdom-and-france-75th",
  "pageTitle": "Prime Minister concludes travel to United Kingdom and France for the 75th anniversary of D-Day and the Battle of Normandy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Portsmouth, Juno Beach, and Paris, where he attended commemorative events to mark the 75th anniversary of D-Day and the Battle of Normandy.</p>\n\n<p>During the visit, Prime Minister Trudeau joined other world leaders in Portsmouth for a D-Day commemorative event organized by the United Kingdom. There, he paid tribute to Lieutenant-Colonel Cecil Merritt, the first Canadian awarded with a Victoria Cross in the Second World War. He also met with the Prime Minister of the United Kingdom Theresa May and the Mayor of London Sadiq Khan.</p>\n\n<p>Prime Minister Trudeau later attended the Canadian commemorative ceremony at Juno Beach, where he honoured Canadians who took part in D-Day and the Battle of Normandy. Following the ceremony, he walked along Juno Beach with Canadian Veterans, and listened to their personal accounts. Later in the day, he attended an international commemorative ceremony organized by France.</p>\n\n<p>While in France, Prime Minister Trudeau also met with the President of France Emmanuel Macron and the Prime Minister of France Édouard Philippe. Prime Minister Trudeau and President Macron continued their discussions on France’s G7 Presidency priorities, including reducing economic inequality, advancing gender equality, and fighting climate change.</p>\n\n<p>The two leaders discussed the progress made on the Canada-France climate partnership and how the two countries can further advance their cooperation on protecting our oceans and biodiversity, and reducing pollution.</p>\n\n<p>Prime Minister Trudeau noted that Canada has been invited to join the Sahel Alliance as an observer and looks forward to working more closely with partners to address challenges facing the Sahel. The leaders welcomed the increase in trade and highlighted the commercial benefits for both Canada and France of the Comprehensive Economic and Trade Agreement (CETA). The Prime Minister also welcomed President Macron’s commitment to begin the process for ratification of CETA immediately.</p>\n\n<p>The Prime Minister also took part in a roundtable discussion with Canadian and French business leaders, to promote further trade and investment between Canada and France.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For the thousands of Canadians who landed on Juno Beach 75 years ago, it was a day they could never forget. Neither can we. The living memory of the Second World War will soon pass. We share a sacred responsibility to keep Veterans’ stories alive, to recognize the cost of war, and honour their immeasurable sacrifices.”</p>\n\n<p>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Portsmouth, an important British industrial city and port during the Second World War, was a major point of departure for the Allied fleet that sailed to the beaches of Normandy in June 1944.</li>\n\t<li>The Allied high command made the decision to attack on June 6, 1944 – a date that has become known to history as “D-Day.” A massive Allied force would cross the English Channel, heading for an 80-kilometre stretch of the Normandy coast. There were five landing zones assigned to the forces of Allied nations: Juno Beach (Canada); Gold Beach (United Kingdom); Sword Beach (United Kingdom and France); and Utah Beach and Omaha Beach (United States).</li>\n\t<li>On August 25, 1944, the Allies liberated Paris, officially ending the Battle of Normandy.</li>\n\t<li>More than 45,000 Canadians lost their lives during the Second World War, of whom over 5,000 were killed during the Battle of Normandy and 359 on D-Day.</li>\n\t<li>During the business roundtable, Prime Minister Trudeau met with senior leadership of the following companies: Axper, Ballard Power Systems Inc., CGI, Décathlon, Effenco, Element AI, Fonds Transatlantique, Kanata, Hootsuite, Laporte Euro, Moment Factory.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/history/historical-sheets/d-day\">75th Anniversary of the D-Day and the Battle of Normandy</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng&amp;_ga=2.65907431.858348360.1558665629-442098123.1558665629\">Canada-France bilateral relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.236244552.858348360.1558665629-442098123.1558665629\">Canada-United Kingdom bilateral relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2018/04/16/canada-france-climate-and-environment-partnership\">Canada-France Climate and Environment Partnership</a></li>\n</ul></div>\n      "
}