{
  "path": "/en/news/itineraries/2022/02/24/prime-ministers-itinerary-friday-february-25-2022",
  "pageTitle": "Prime Minister’s itinerary for Friday, February 25, 2022 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>National Capital Region, Canada</h2>\n\n<p>Private meetings</p>\n\n<p><strong>9:00 a.m.</strong> The Prime Minister will participate in the NATO Leaders Meeting to discuss the situation in Ukraine.</p>\n\n<p class=\"Indent2\"><em>Closed to media</em></p>\n\n<p>The Prime Minister will speak with the Prime Minister of the United Kingdom, Boris Johnson.</p>\n\n<p><strong>4:30 p.m.&nbsp;</strong>The Prime Minister will deliver remarks and hold a media availability on the situation in Ukraine with Minister of Foreign Affairs Mélanie Joly. Deputy Prime Minister and Minister of Finance Chrystia Freeland, Minister of National Defence Anita Anand, Minister of Immigration, Refugees and Citizenship Sean Fraser, and Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada, Harjit S. Sajjan will join virtually.</p>\n\n<p class=\"Indent2\">Room 200<br>\nSir John A. Macdonald Building<br>\n144 Wellington Street</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Participation in the question and answer portion of this event is for accredited members of the Parliamentary Press Gallery only. Media who are not members of the Parliamentary Press Gallery may contact&nbsp;<a href=\"mailto:pressres2@parl.gc.ca\">pressres2@parl.gc.ca</a>&nbsp;for temporary access.</li>\n\t<li>A teleconference line is also available for listening to the event.</li>\n\t<li>Participant dial-in numbers:<br>\n\tLocal: 613-954-9003<br>\n\tToll-free: 1-866-206-0153<br>\n\tPass code: 1456570#</li>\n</ul>\n\n<p><strong>6:00 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual celebration to mark the end of Black History Month hosted by Minister for Women and Gender Equality and Youth Marci Ien.</p>\n\n<p>Media interested in watching the event live can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</p></div>\n      "
}