{
  "path": "/en/news/news-releases/2022/06/01/prime-minister-announces-appointment-honourable-stephane-dion-canadas",
  "pageTitle": "Prime Minister announces appointment of the Honourable Stéphane Dion as Canada’s Ambassador to France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Stéphane Dion as Canada’s Ambassador to France. Mr. Dion will remain the Prime Minister’s Special Envoy to the European Union and Europe, a position he has held since 2017. He will also be accredited to Monaco.</p>\n\n<p>Mr. Dion has a proven record of advancing Canada’s priorities in Europe for the benefit of people on both sides of the Atlantic, including in the areas of security, democracy, the environment, and trade. He most recently served as Canada’s Ambassador to Germany where he helped deepen Canada’s relationship with one of our closest European partners. He was elected as a Member of Parliament in 1996 and re-elected seven consecutive times, during which he also served as a federal cabinet minister and the Leader of the Official Opposition.</p>\n\n<p>Canada and France share a strong and longstanding friendship rooted in a common language, shared history, economic partnership, and deep cultural and people-to-people ties. As the senior Canadian diplomat in France and in Europe, Mr. Dion will represent the Government of Canada, work to continue strengthening our bilateral relationship, and provide strategic guidance to the Prime Minister.</p>\n\n<p>The Prime Minister also took the opportunity to thank Isabelle Hudon for her contributions to Canada-France relations as Canada’s Ambassador to France from 2017 to 2021.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Stéphane Dion is a proven diplomat and a dedicated public servant. Over the course of his distinguished career, he has served our country with honour and dignity, and I know that he will continue to advance our interests and our common values as Canada’s representative to France and my Special Envoy to Europe.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/05/31/honourable-stephane-dion\">The Honourable Stéphane Dion</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/04/24/statement-prime-minister-result-frances-presidential-election\">Statement by the Prime Minister on the result of France’s presidential election</a></li>\n</ul></div>\n      "
}