{
  "path": "/en/news/statements/2022/11/15/joint-statement-new-just-energy-transition-partnership",
  "pageTitle": "Joint Statement on new Just Energy Transition Partnership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2><strong>Joint Statement by the Government of the Republic of Indonesia (GOI) and the Governments of Japan, the United States of America, Canada, Denmark, the European Union, the Federal Republic of Germany, the French Republic, Norway, the Republic of Italy, and the United Kingdom of Great Britain and Northern Ireland (together the “International Partners Group” or IPG)</strong></h2>\n\n<ol>\n\t<li>Recognizing the need for accelerated action toward Agenda&nbsp;2030, including Sustainable Development Goal&nbsp;7, and the goals of the Paris Agreement, as well as implementation of the Glasgow Climate Pact, to avoid the worst impacts of climate change on our countries, our people, and the environment;</li>\n\t<li>Recognizing that limiting the impacts of climate change by keeping a warming limit of 1.5°C above pre-industrial levels within reach depends on the international community collectively halving global CO2 emissions by 2030 relative to the 2019 level and achieving global net zero CO2 emissions by mid-century;</li>\n\t<li>Underlining the urgency of decarbonizing energy systems by expediting a reduction in power sector emissions, increasing energy efficiency, and hastening renewable energy deployment, while strengthening efforts to reach universal, affordable, and reliable access to energy;</li>\n\t<li>Recognizing the need to take actions to enable transition finance to support orderly, just and affordable transitions towards a low-greenhouse gas emissions and climate-resilient economy in line with the practical and voluntary recommendations of the transition finance framework in the 2022 G20 Sustainable Finance Report;</li>\n\t<li>Recognizing the need to encourage the mobilization of private finance to support the transition to a net-zero emission world, to prevent the possibility of stranded assets;</li>\n\t<li>Recognizing the importance of Environmental, Social, and Governance standards as a consideration for developing transition financial frameworks and the existing gap between current standards and energy transition needs;</li>\n\t<li>Recognizing the importance of a just energy transition that brings about opportunities for industrial innovation to create quality green jobs, and considers all communities and societal groups affected directly or indirectly by an expedited reduction of power sector emissions – through early retirement of coal-fired power plants – including women, youth, and others vulnerable to the transition; and that there are several important sectors of Indonesia’s economy that are impacted by such a transition;</li>\n\t<li>Noting that the Just Energy Transition Partnership (JETP) can alleviate poverty and unemployment and also should see to provide robust protection for the population, especially the poorest and the most vulnerable to potential disruptions from energy transitions;</li>\n\t<li>Further underlining that a just process of transition is based on the full involvement of relevant actors including organized labour and business to implement human capital development programs through reskilling and upskilling, creating employment and providing other forms of collaboration so that workers are major beneficiaries of the transition to a greener future;</li>\n\t<li>Recognizing and acknowledging Indonesia’s important contribution to the global efforts in climate change mitigation, including the progress the Government of the Republic of Indonesia, as well as State Owned Enterprises, are already making towards a net zero future by preparing a Long-Term Strategy for Low Carbon and Climate Resilience to 2050; committing to economy-wide net-zero emissions by 2060 or sooner; enacting the Presidential Decree on Renewable Energy; working to reduce the pipeline of on-grid coal fired pipeline<strong>;</strong> and working to develop and implement necessary policies, laws, and regulations in both the energy and financial sectors to enable renewable energy deployment as well as to phase down subsidies for domestic coal supply and energy tariffs;</li>\n\t<li>Acknowledging the establishment of a country platform to manage some funds as necessary related to energy transition under PT Sarana Multi Infrastructure (PT SMI), a Special Mission Vehicle (SMV) of the Ministry of Finance;</li>\n\t<li>Recognizing Indonesia’s intention to be an early leader of the just energy transition, its endeavour to receive the benefits of renewables while minimizing economic and social costs of the green transition, and the importance of global collaboration;</li>\n\t<li>Recognizing the need for long-term cooperation and partnership, given the decades-long timeframe needed to enact a sustainable and just energy transition, and noting the ability to extend the partnership beyond the initial three-to-five-year period;</li>\n\t<li>Recognizing the importance of continuing to scale up collaboration, including finance from a wide variety of sources, technical assistance, and human capital development for Indonesia’s efforts;</li>\n\t<li>Acknowledging that the JETP aims to provide an opportunity for Indonesian companies to improve their capacities and become part of the manufacturing value chain for clean energy solutions, including renewables and energy efficiency;</li>\n\t<li>Recognizing the need for enhanced financing to pursue the above objectives, which potentially comes from IPG, additional sources of sustainable financing and the inclusion of international partners to leverage existing international initiatives, e.g., the G7 Partnership for Global Infrastructure and Investment;</li>\n\t<li>Supporting the Climate Investment Fund’s Accelerating Coal Transition Investment Program and the Asian Development Bank’s Energy Transition Mechanism; and</li>\n\t<li>Recognizing Indonesia’s commitment as the G20 Presidency in 2022 to reiterate global support for the energy transition in three priority areas namely energy access, technology, and finance, to achieve better economic growth that is inclusive, sustainable, and equitable.</li>\n</ol>\n\n<p><strong>Intends to: </strong></p>\n\n<ol>\n\t<li>Establish a JETP as a long-term partnership to help Indonesia pursue an accelerated and ambitious just energy transition that supports a trajectory that keeps a warming limit of 1.5°C above pre-industrial levels within reach, and includes an ambitious power sector emissions reduction pathway and strategy based on the expansion of renewable energies and the phase down of on and off-grid coal-fired electricity generation; and the implementation of concrete actions achieving a just energy transition for workers and communities, particularly those most affected by an energy transition away from coal.</li>\n\t<li>Implement the JETP as a partnership between the Government of Indonesia and the IPG to enable the accelerated decarbonization of Indonesia’s power sector to achieve the most ambitious emissions cuts possible. This partnership will also include the Glasgow Financial Alliance for Net Zero (GFANZ) Working Group, which includes an initial set of financial institutions including Bank of America, Citi, Deutsche Bank, HSBC, Macquarie, MUFG, and Standard Chartered, and it will also leverage the expertise, resources, and operations of the multilateral development banks.</li>\n\t<li>The partnership aims to develop a comprehensive investment plan (JETP Investment and Policy Plan) aiming at the following joint targets for the power sector, which include on-grid and off-grid power, and captive power systems for industrial uses:\n\t<ol class=\"lowerRoman\">\n\t\t<li>Peaking power sector emissions by 2030 at an absolute value of no more than 290 MT CO2 (down from a 2030 baseline value of 357 MT CO2) and immediately declining thereafter on an ambitious trajectory and achieving net zero emissions in the power sector by 2050, including with the accelerated retirement of coal plants, conditional on international support.</li>\n\t\t<li>Accelerating the deployment of renewable energy so that renewable energy comprises at least 34% of all power generation by 2030.</li>\n\t\t<li>Accelerating, with IPG support, the early retirement of coal-fired power plants as prioritized and identified by the Indonesian Government in the JETP Investment and Policy Plan as a necessary element to achieve the above targets.</li>\n\t\t<li>Accelerating the widespread deployment of energy efficiency and electrification tools, technologies, and reforms, including through standards to access the resulting energy and cost savings with support from the IPG.</li>\n\t\t<li>Accelerating the development of a vibrant and competitive local industry in renewable energy and energy efficiency, as appropriate and as feasible, by investing in local technological capacity and knowledge in collaboration with IPG.</li>\n\t\t<li>Delivering a just energy transition by developing a robust plan, in consultation with relevant stakeholders, to identify and support the segments of Indonesia’s population most vulnerable to potential negative impacts of the transition, workers and all societal groups with a special focus on women, youth, and vulnerable populations that earn a living in the coal industry or in jobs connected with the coal industry.</li>\n\t\t<li>Restricting the development of captive coal fired power plants in accordance with the Perpres&nbsp;112/ 2022 and collaborating to find and implement potential zero-emission and renewable solutions for power generation facilities outside Jawa-Bali, including captive power facilities, provided that the solutions are affordable (priced similar or better than the non-renewable alternatives), reliable (can provide base load), accessible, and timely (can be deployed within similar or better timeline than the non-renewable alternatives) to balance the imperative of industrial development and economic growth of Indonesia with the commitment on net zero.&nbsp;</li>\n\t\t<li>Freezing the existing pipeline of planned on-grid coal-fired power plants included in the current Rencana Usaha Penyediaan Tenaga Listrik (RUPTL) for 2021-2030, and reaffirming a full moratorium on any new on-grid coal power generation capacity in accordance with Presidential Decree on Renewable Energy (Perpres&nbsp;112/ 2022).</li>\n\t\t<li>Aligning local content requirements with the roadmap for domestic renewable manufacturing capability in order to achieve the renewable goals in RUPTL and to scale renewable deployment to support robust domestic renewable energy manufacturing capability. The progression of local content requirements should take into account the size and scale of a viable domestic market.</li>\n\t\t<li>Mobilizing sufficient capital to achieve the targets through a combination of instruments that may include grants, concessional loans, market-rate loans, guarantees, and technical assistance some of which will be used to de-risk and catalyze private investments.</li>\n\t\t<li>Mobilizing $20&nbsp;billion over the next three to five years through the partnership, of which $10&nbsp;billion will be mobilized by the IPG members. Working closely with the Government of Indonesia and the IPG, the GFANZ Working Group members will work to mobilize and facilitate at least $10&nbsp;billion in private finance in support of an ambitious transition path and investment plan. Private sector finance will be subject to catalytic public finance and with collective ambition by all parties, including enhanced engagement by the multilateral development banks, the public sector finance has the potential to generate significantly more in private finance than the amount above. These resources are subject to concurrence on the JETP Investment and Policy Plan that includes a competitively tendered pipeline of projects, including&nbsp;continued&nbsp;progress in improvements to the country’s policy and enabling environment, in line with budgetary procedures and terms, responsive to progress by the Indonesian Government and relevant actors, and transparently reported. The continuation of the partnership is expected to be contingent on no new coal power capacity for instances where timely, zero-emissions, affordable, and reliable alternatives are available, including developing a strategy to avoid new captive coal and to successfully identify investments in renewable electricity supply as alternatives for all new captive projects.</li>\n\t</ol>\n\t</li>\n\t<li>The Joint Statement constitutes political commitments of the Government of Indonesia and the members of the International Partners Group and is not a binding international agreement.</li>\n</ol>\n\n<h2><strong>Annex: Partnership Action Plan</strong></h2>\n\n<p>Over the next six months, the partnership intends to carry out the following plan:</p>\n\n<ol>\n\t<li>Within the first three months:\n\t<ol class=\"lowerAlpha\">\n\t\t<li>Finalize an inclusive political dialogue on the accelerated and just energy transition (including non-governmental actors such as civil society, private sector, etc.), identify an existing entity to act as secretariat, and provide leader-level updates on the partnership’s progress;</li>\n\t\t<li>Determine the scope of supported actions to operationalize the Joint Statement’s “intends to” section;</li>\n\t\t<li>Develop a policy reform strategy in both the energy and financial sectors to catalyze investment, including from the private sector, in an efficient and market-driven manner, in support of the JETP goals;</li>\n\t\t<li>Identify a clear strategy for private sector engagement;</li>\n\t\t<li>Further articulate and elaborate terms of financing;</li>\n\t\t<li>Finalize initial sources of financing for specific JETP projects and efforts;</li>\n\t\t<li>Assist Indonesia with structuring sustainable financial and technical support within the broader energy transition to a net-zero economy; and</li>\n\t\t<li>Set up coordination platforms with development finance institutions and key stakeholders to solicit input to further develop the conceptual approach and leverage additional technical and financial support towards their most impactful uses in the JETP Investment and Policy Plan.</li>\n\t</ol>\n\t</li>\n\t<li>Within six months:\n\t<ol class=\"lowerAlpha\">\n\t\t<li>Develop a roadmap for domestic renewable manufacturing capability that addresses local content requirements.&nbsp;</li>\n\t\t<li>Develop a biannual review process to assess adherence to the top-line targets included in the joint statement and to the commitment to limiting additional coal capacity in instances where timely, zero-emissions, affordable and reliable alternatives are available.</li>\n\t\t<li>Develop a JETP Investment and Policy Plan to identify the investment requirements and opportunities to deliver on the just energy transition. This should be led by the Government of Indonesia with administrative and technical support provided by a Secretariat and with the collaboration of PT SMI. The Investment and Policy Plan will also provide an outline of the policy reforms necessary to address any regulatory barriers in the energy and financial markets that hinder private investment for a just energy transition.</li>\n\t\t<li>Develop a full program of work for this partnership on the basis of the JETP Investment and Policy Plan, with the work program drawn up in an inclusive process – with participation from non-governmental actors including the private sector and civil society – that addresses the social and economic impacts of Indonesia’s just energy transition.</li>\n\t\t<li>Develop a roadmap for 2030 in the power sector in line with the net zero target to support a clear pathway to green development.</li>\n\t\t<li>Identify a plan to accelerate the early retirement or avoid construction of on and off-grid coal-fired power plants both before and after 2030 in a manner that substantially decreases emissions while maintaining stable and affordable power for the Indonesian people.</li>\n\t\t<li>Identify potential financing instruments and policies that will act to improve Perusahaan Listrik Negara’s (PLN), and relevant subsidiaries, long-term financial sustainability.</li>\n\t\t<li>Develop a strategy to leverage further financial resources, including from domestic institutions, to support Indonesia’s just energy transition activities.</li>\n\t</ol>\n\t</li>\n</ol></div>\n      "
}