{
  "path": "/en/news/readouts/2022/04/06/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Ethiopia, Abiy Ahmed.</p>\n\n<p>The two leaders discussed recent developments in the ongoing conflict in northern Ethiopia. Prime Minister Trudeau emphasized the importance of the announcement by the Government of Ethiopia on March 24 of an open-ended indefinite humanitarian truce, and called for further access to and delivery of humanitarian assistance to those affected by the conflict.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s strong and ongoing commitment to supporting a peaceful resolution to the conflict, including negotiations toward a peace agreement. The two leaders discussed the importance of creating positive momentum through an inclusive national dialogue process. Prime Minister Trudeau underscored the importance of taking all steps necessary to address accountability and justice for any human rights violations alleged to have occurred during the conflict.</p>\n\n<p>The prime ministers also discussed Russia’s illegal and unjustifiable invasion of Ukraine and its impacts on global peace and security.</p>\n\n<p>They agreed to continue to stay in close touch.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/15/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed\">Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}