{
  "path": "/en/news/statements/2020/05/17/statement-prime-minister-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p>\n\n<p>“Today, on the <a href=\"https://may17.org/\">International Day Against Homophobia, Transphobia, and Biphobia</a>, we join Canadians and people everywhere to support LGBTQ2 rights, and speak out against the stigma, discrimination, and violence that continue to affect LGBTQ2 communities here in Canada and around the world.</p>\n\n<p>“This year’s theme in Canada, ‘Family support is essential: Send&nbsp;love to your LGBTQ+ relatives,’ recognizes the importance of support networks for LGBTQ2 individuals who continue to face stigma and discrimination for simply being themselves. This theme emphasizes the simple actions we can take, like picking up the phone or sending a text, to offer solidarity and support. These actions can go a long way in helping to break down barriers, and make our country a more welcoming and inclusive place for all.</p>\n\n<p>“On this day, we also thank and recognize those organizations from coast to coast to coast that help provide support and allyship to LGBTQ2 Canadians. This includes&nbsp;<a href=\"https://www.fondationemergence.org/?lang=en\">Fondation Émergence</a>, which created the first day against homophobia in 2003, and continues to raise public awareness on the issues that those in the LGBTQ2 communities face.</p>\n\n<p>“The current COVID-19 pandemic is a challenging time for everyone and it is having a disproportionate impact on marginalized populations, including vulnerable members of LGBTQ2 communities. That is why we are providing even more support to charities and non-profit organizations that serve our communities through the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need\">Emergency Community Support Fund</a>. During this uncertain time, it is more important than ever to show our fellow Canadians that we are in this together.</p>\n\n<p>“Though we still have a great deal of work left to do, the Government of Canada has committed to taking further action for LGBTQ2 communities. This includes the launch of the <a href=\"https://cfc-swc.gc.ca/fun-fin/lgbtq2/index-en.html\">LGBTQ2 Community Capacity Fund</a>, which will provide funding to LGBTQ2 organizations working to advance equality in Canada, as well as the introduction of legislation in March to criminalize the cruel and harmful practice of conversion therapy. If passed, <a href=\"https://www.parl.ca/LegisInfo/BillDetails.aspx?Language=E&amp;billId=10686845\">Bill C-8</a> would help ensure that all Canadians can be free to be themselves, just as they are.</p>\n\n<p>“Today, and every day, I encourage all Canadians to do their part to make our country a place where LGBTQ2 people can be themselves without fear. We are all stronger when we embrace diversity, and when all Canadians are free to live their lives to the fullest.”</p></div>\n      "
}