{
  "path": "/en/news/readouts/2021/01/13/prime-minister-justin-trudeau-speaks-ontario-premier-doug-ford",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Ontario Premier Doug Ford to discuss the global COVID-19 pandemic.</p>\n\n<p>Prime Minister Trudeau and Premier Ford spoke about the rising number of COVID-19 cases in Ontario and ways to help contain the spread of the virus, including through increased testing and contact tracing, and the additional public health measures announced by the provincial government yesterday.&nbsp;They agreed on the importance of continuing close federal-provincial collaboration in the vaccine rollout, and both supported maintaining a Team Canada approach to protect the health and safety of Canadians. As the federal government continues delivering tens of thousands of vaccines to Ontario every week, the Prime Minister reiterated his full support to Premier Ford in vaccinating as many Ontarians as possible, as quickly as possible.</p>\n\n<p>Both leaders talked about how important it is for Canadians to limit their exposure to others, avoid gatherings, and stay home when possible. Prime Minister Trudeau and Premier Ford spoke about the priority vaccination of residents and employees of long-term care homes, and the Prime Minister offered continued federal support for rapid testing and further assistance from the Canadian Red Cross where needed.</p>\n\n<p>The Prime Minister and the Premier also spoke about priority infrastructure projects, including broadband, and agreed to continue working together on these and other issues of importance to both governments.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/10/prime-minister-hosts-first-ministers-meeting-fighting-covid-19-and\">Prime Minister hosts First Ministers’ Meeting on fighting COVID-19 and strengthening health care</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n</ul></div>\n      "
}