{
  "path": "/en/news/statements/2015/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p>\n<p>“Today,<sup> </sup>it is important for us to reflect on all of the women and girls, both here in Canada and abroad, for whom violence is a daily reality, and to mourn those who have died as a result.</p>\n<p>“This day is held in remembrance of the 14 young women who were murdered on this date in 1989 at l'École Polytechnique de Montréal for no other reason than being women. It is with a heavy heart that I join the families and friends of those promising young women here in Montréal today to mourn their tragic loss.</p>\n<p>“This was a senseless act of violence that shocked the nation and remains, to this day, one of the darkest periods in Canadian history.</p>\n<p>“Sadly on any given day in Canada, approximately 8,000 women and children are housed in shelters, largely for reasons of abuse. That is why we need to raise awareness of this flagrant violation of basic human rights, help prevent it, and support the victims who have experienced it, both at home and around the world.</p>\n<p>“One of the major initiatives I have committed to here at home is launching an inquiry into missing and murdered Indigenous women and girls to recommend concrete actions to address and prevent violence against them. We will also introduce legislation that will provide greater support for survivors of domestic violence and sexual assault.</p>\n<p>“We all have an important role to play in stopping violence against women and girls, and in denouncing misogyny in all its forms. Like all parents, I want my daughter to grow up in a safe community and a safe world. I therefore urge all Canadians to make a commitment to stopping this degrading and dangerous behaviour.</p>\n<p>“I am confident that by taking action and working together we can build a society that respects women and girls as equals and repudiates all forms of violence against them.”</p></div>\n      "
}