{
  "path": "/en/news/news-releases/2020/06/30/prime-minister-announces-new-lieutenant-governor-alberta",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Salma&nbsp;Lakhani as the new Lieutenant Governor of Alberta.</p>\n\n<p>A long-time community advocate and successful business owner, Ms. Lakhani has dedicated her life to helping people in need and those who face obstacles to success in our society. Through her work to advance education, health care, women’s empowerment, human rights, and support for new immigrants, she continues to be a champion of diversity, pluralism, and inclusion.</p>\n\n<p>An immigrant to Canada, she has mentored young students with English as a second language. She is a founding member of a movement that helps vulnerable women access education, and has served on its advisory committee for the past decade.</p>\n\n<p>Ms. Lakhani will be the first Muslim Lieutenant Governor in Canadian history. She will assume office upon her installation.</p>\n\n<p>The Prime Minister thanked the outgoing Lieutenant Governor, the Honourable Lois&nbsp;Mitchell, for her dedication and service to the people of Alberta.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Ms. Lakhani is devoted to supporting people in her community, from new immigrants and young people, to women and families. As Lieutenant Governor of Alberta, I know she will serve the people of her province and our country well, and continue to be a source of inspiration for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws.</li>\n\t<li>Lieutenant Governors are appointed by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/06/30/salma-lakhani\">Salma Lakhani</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/crown-canada/lieutenant-governors.html\">The Lieutenant Governors</a></li>\n</ul></div>\n      "
}