{
  "path": "/en/news/news-releases/2019/06/13/prime-minister-travel-united-states",
  "pageTitle": "Prime Minister to travel to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Washington, D.C., on June 20, to meet with United States President Donald J. Trump.</p>\n\n<p>Canada and the United States share one of the largest and most comprehensive economic partnerships in the world. This partnership supports millions of good, middle class jobs on both sides of the border.</p>\n\n<p>During the visit, Prime Minister Trudeau and President Trump will discuss the ratification of the new North American Free Trade Agreement, which will create even more well-paying jobs and new opportunities for Canadians and Americans alike. They will also exchange views on efforts to resolve outstanding trade issues.</p>\n\n<p>In addition, ahead of the upcoming G20 Osaka Summit, the two leaders will discuss key global challenges, including China’s wrongful detention of two Canadian citizens.</p>\n\n<p>The Prime Minister and President also expect to discuss the strong security and defence partnership between our two countries.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians and Americans are better off when we work together to grow the middle class and create new opportunities on both sides of the border. I look forward to meeting with President Trump to discuss the ratification of the new NAFTA, and how we can continue to strengthen our vital trade and economic partnership.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the United States share one of the largest trading relationships in the world. The two countries also share the longest, secure border in the world, over which some 384,000 people and $2.6 billion worth of goods and services cross daily.</li>\n\t<li>Bilateral merchandise trade between the two countries increased 5.7 percent to $742.9&nbsp;billion in 2018.</li>\n\t<li>Canada buys more goods from the United States than China, Japan, and the United Kingdom combined.</li>\n\t<li>The U.S. is the single greatest investor in Canada. In 2018, U.S. stock investment in Canada was $406 billion, representing nearly half of all investment in Canada.</li>\n\t<li>Trade between NAFTA members—Canada, the United States, and Mexico—was valued at nearly $1.5 trillion in 2018.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/country-pays/united_states-etats_unis/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}