{
  "path": "/en/news/readouts/2020/09/17/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of France, Emmanuel Macron, to discuss the COVID‑19 pandemic and recent international developments.</p>\n\n<p>Prime Minister Trudeau and President Macron discussed ongoing efforts in Canada and France to contain the coronavirus, keep people safe and healthy, restart the economy, and ensure a safe return to school. They expressed their shared commitment to international collaboration on a green recovery that is sustainable, inclusive and supports jobs and businesses.</p>\n\n<p>The two leaders exchanged views on global issues. The Prime Minister and the President underscored the need for an impartial investigation of the poisoning of Russian political opposition figure, Alexei Navalny. They spoke about relations with China, including the outcomes of the recently concluded EU-China virtual summit. They agreed on the importance of de-escalation to reduce tensions in the Eastern Mediterranean.</p>\n\n<p>Prime Minister Trudeau and President Macron discussed the strong bilateral relations, and cultural and trade ties between Canada and France, including the Canada-European Union (EU) Comprehensive Economic and Trade Agreement (CETA). They noted the close collaboration between the two countries on Artificial Intelligence and digital issues.</p>\n\n<p>Canada and France will continue to work together to address global security and foreign policy challenges, including through the G7 and the G20.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng&amp;_ga=2.227742173.1913500617.1600291451-212419443.1569709158\">Canada-France Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/09/minister-of-foreign-affairs-condemns-alexei-navalny-poisoning.html\">Minister of Foreign Affairs condemns Alexei Navalny poisoning</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}