{
  "path": "/en/news/statements/2019/08/24/statement-prime-minister-ukrainian-independence-day",
  "pageTitle": "Statement by the Prime Minister on Ukrainian Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ukrainian Independence Day:</p>\n\n<p>“Today, we join Ukrainian communities in Canada and around the world to celebrate the 28th anniversary of Ukraine’s independence.</p>\n\n<p>“Canada was the first Western country to recognize Ukraine’s independence in 1991 – and we’ve been close friends and partners ever since. From co-hosting the third <a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ukraine_reform-reformes/index.aspx?lang=eng\">Ukraine Reform Conference</a>, to training members of the Security Forces of Ukraine as part of <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a>, to establishing <a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ukraine/index.aspx?lang=eng\">free trade between our two countries</a>, we are working with the people of Ukraine as they build a secure, sovereign, and prosperous future for their country.</p>\n\n<p>“In July, <a href=\"https://pm.gc.ca/en/news/news-releases/2019/07/02/canada-and-ukraine-further-strengthen-cooperation\">I met with President of Ukraine, Volodymyr Zelenskyy</a>, to reaffirm Canada’s steadfast support for the people of Ukraine and their country’s sovereignty and territorial integrity. I also highlighted Canada’s support for Ukraine’s ambitious democratic reform path, focused on inclusive and accountable governance, the rule of law, and respect for human rights.</p>\n\n<p>“For generations, the Ukrainian-Canadian community – now more than 1.3 million people strong – has woven its threads into our national fabric. Through their vibrant language, culture, and traditions, Ukrainian-Canadians have shaped and continue to shape our country for the better.</p>\n\n<p>“They have also created close ties between our two countries, connecting Canadians and Ukrainians from Kelowna to Kyiv, Edmonton to Enerhodar, and Dauphin to Dnipro. These deep and lasting bonds of family and friendship, together with our common values, are at the heart of the strong Canada-Ukraine relationship.</p>\n\n<p>“On behalf of all Canadians, Sophie and I wish everyone celebrating a happy Ukrainian Independence Day.</p>\n\n<p>“Slava Ukraini!”</p></div>\n      "
}