{
  "path": "/en/news/readouts/2022/09/30/prime-minister-justin-trudeau-speaks-president-chile-gabriel-boric",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Chile Gabriel Boric | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Chile, Gabriel Boric.</p>\n\n<p>Prime Minister Trudeau and President Boric acknowledged the strong friendship and ties between their countries. The two leaders reiterated their commitment to continue collaborating on shared priorities, including promoting democracy and human rights, increasing trade, creating economic growth that benefits all, and protecting the environment and oceans.</p>\n\n<p>Prime Minister Trudeau conveyed Canada’s support for Chile’s ratification of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), to ensure the benefits of trade are more widely shared. The CPTPP is intended to advance economic growth that will benefit everyone, and create more opportunities for small and medium-sized enterprises as well as Indigenous Peoples.</p>\n\n<p>The two leaders agreed to continue working closely together to advance progressive values. Prime Minister Trudeau denounced Russia’s sham referendums in occupied regions of Ukraine and expressed his support for those who are protesting peacefully in Iran, especially women.</p>\n\n<p>Prime Minister Trudeau and President Boric looked forward to staying in regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/chile-chili/relations.aspx?lang=eng\">Canada-Chile relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/13/prime-minister-justin-trudeau-speaks-president-chile-gabriel-boric\">Prime Minister Justin Trudeau speaks with President of Chile Gabriel Boric</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN conference on biodiversity: COP15 in Montréal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/27/statement-prime-minister-results-russias-sham-referendums-occupied\">Statement by the Prime Minister on the results of Russia’s sham referendums in occupied regions of Ukraine</a></li>\n</ul></div>\n      "
}