{
  "path": "/en/news/news-releases/2018/11/21/governor-general-canada-visit-mexico-presidential-inauguration",
  "pageTitle": "Governor General of Canada to visit Mexico for presidential inauguration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Mexico from November 30 to December 1, 2018.</p><p>Mexico is one of Canada’s most valued partners in the hemisphere. Our two countries share common goals, deep people-to-people bonds, and a robust trade and investment relationship.</p><p>During the visit, the Governor General will represent Canada at the inauguration ceremony of the new President of Mexico, Andrés Manuel López Obrador, at the San Lazaro Legislation Palace on December 1.</p><h2>Quote</h2><blockquote><p>“Canada and Mexico are close friends and longtime partners. The Governor General will represent Canada at the inauguration of President-elect López&nbsp;Obrador, as our countries continue to strengthen and deepen our relationship. I look forward to working with the new President to build a better future for Canadians and Mexicans alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>This will be Governor General Julie Payette’s first visit to Mexico. The last Governor General to visit Mexico was the Right Honourable David&nbsp;Johnston, who attended the inaugural speech of President Enrique Peña Nieto in 2012.</li><li>Canada and Mexico share a vibrant, multi-faceted relationship defined by strong people-to-people ties, rich cultural connections, and growing trade and investment.</li><li>The Mexican presidential election took place on July 1, 2018.</li><li>Mexico is Canada’s third-largest partner for trade in goods.</li><li>On October 1, 2018, Canada reached an agreement-in-principle with the United States and Mexico on a modernized trade agreement – the United States-Mexico-Canada Agreement.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada – Mexico relations</a></li><li><a href=\"/en/news/statements/2018/07/01/statement-prime-minister-results-mexican-presidential-election\">Statement by the Prime Minister on the results of the Mexican presidential election</a></li><li><a href=\"/en/news/news-releases/2018/10/01/prime-minister-canada-welcomes-new-united-states-mexico-canada\">Prime Minister of Canada welcomes new United States-Mexico-Canada Agreement</a></li></ul></div>\n      "
}