{
  "path": "/en/news/statements/2018/10/05/statement-prime-minister-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p><p>“Today, on <a href=\"https://en.unesco.org/commemorations/worldteachersday\">World Teachers’ Day</a>, we recognize teachers who, day in and day out, empower young people and shape our future for the better.</p><p>“Great teachers bring out the best in us. They discover talents and passions that become the basis of lifelong careers. They introduce us to people and passages, on the page and out in the world, that broaden our horizons and help us better understand ourselves. They are generous listeners who champion the needs of every student.</p><p>“Few people wear more hats than teachers. On any given day, they are tutors, friends, coaches, and counsellors. Above all, teachers are role models and guides, who lead generation after generation to richer lives and better futures.</p><p>“This year’s theme – <i>The right to education means the right to a qualified teacher</i> – calls attention to the shortage of teachers worldwide, particularly among vulnerable populations, including girls, children with disabilities, refugee and migrant children, and those living in rural or remote areas.</p><p>“Canada is playing a leading role to give women and girls greater access to quality education and learning opportunities. At the G7 Leaders’ Summit, we joined international partners to mobilize a historic investment of close to $3.8 billion CAD in education for women and girls in crisis and conflict situations. Canada built on this momentum at last month’s United Nations General Assembly, where we welcomed an additional $527 million CAD to help developing countries give every child access to quality education and modern skills training.</p><p>“Through these investments, partners will support important initiatives, including to improve training for teachers to provide better curriculums for women and girls. Quality education is key to creating a more equal world, where everyone has a fair chance at success.</p><p>“I am exceptionally proud to have been a teacher, and I am pleased to launch the nomination period for the 2019 <a href=\"https://www.ic.gc.ca/eic/site/pmate-ppmee.nsf/eng/h_wz00010.html\">Prime Minister’s Awards for Teaching Excellence, Teaching Excellence in STEM and Excellence in Early Childhood Education Competition</a>. For over twenty-five years, these awards have recognized exemplary teachers who have helped prepare young Canadians for the jobs of the future. I encourage Canadians to recognize an outstanding educator from their community who has made a real difference in their life, or the life of one of their children, by nominating them for the awards.</p><p>“On behalf of the Government of Canada, I thank all teachers and educators in Canada and around the world for the incredible work they do. From early childhood to secondary school and beyond, they inspire us to become the very best versions of ourselves and change the world for the better.”</p></div>\n      "
}