{
  "path": "/en/news/statements/2020/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p>\n\n<p>“Seven decades ago, North Korean forces crossed the 38th parallel into South Korea, marking the first open act of aggression since the establishment of the United Nations (UN). In response, Canada joined forces with other UN Member States to protect the sovereignty of South Korea.</p>\n\n<p>“On Korean War Veterans Day, we honour the more than 26,000 brave Canadians who answered the call to defend the principles of peace and freedom in the ‘Land of the Morning Calm’.</p>\n\n<p>“This year marks the 70th anniversary of the start of the Korean War. It remains the third deadliest overseas conflict in Canada’s history, surpassed only by the First and Second World Wars. Canadians who served in the air, on land, and at sea faced heavy attacks and gruelling conditions. As the seasons changed, they fought against more than just enemy forces, taking on both bitter cold temperatures and torrential monsoon rains. Over 500 Canadians, whose names are inscribed in the Korean War Book of Remembrance, lost their lives in the conflict.</p>\n\n<p>“The war was devastating for Koreans, as people struggled to find safety, and saw their homes, schools, and memories shattered. Families were separated, and many lost loved ones. By the time the armistice was signed in Panmunjom on July 27, 1953, the war had claimed the lives of millions of people, many of whom were civilians. &nbsp;</p>\n\n<p>“Canada’s work to preserve peace and security on the Korean Peninsula did not end with the armistice. Canadians served in the UN Command in the years that followed the ceasefire, and continue to do so today. Our contribution in Korea helped bring in a new era of international engagement for Canada, which saw our troops deployed around the world in support of international peace and security efforts. It also built an everlasting bond and friendship between Canada and South Korea that continues today.</p>\n\n<p>“We must never forget those who fought and sacrificed in defence of peace and freedom. On behalf of the Government of Canada, I invite all Canadians to join me in recognition of our Korean War veterans and their lasting contribution to protecting the values we hold dear.”</p></div>\n      "
}