{
  "path": "/en/news/statements/2021/11/23/weestamakaywin-ouschi-kischee-li-ministr-didawn-lee-plawn-ka",
  "pageTitle": "Weestamakaywin ouschi Kischee Li Ministr didawn Lee plawn ka Peekishkwachikawtayk ouschi li Paarlimawn | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kischee Li Ministr, Justin Trudeau, anoush pakitinam ooma ikouhk weestamakaywin ouschi Lee plawn ka Peekishkwachikawtayk ouschi li Paarlimawn:</p>\n\n<p>“Apray jiznaef li mwawn kaw-nakishkamahk awyawshkuw sawn zawn en malajee kaw-awshoupayik, Aen zhawnd di Kenadaw nawashoonamwuk chiahkamaymouw anavaan ooma Septawmbr. Keemiyaywak kischee opaminikaywak klayr la direksyoon tout awn sawmbl chiatoushkawchikawtayk nakinikayin ooma COVID-19 ayimun chi-ishpayihk akwa chimishkikawtayk vray shoohkayihtumowin ka natawayihtakwun chioushchikawtyak pleu boon li tawn ki vyaen poor kahkiyuw Aen zhawnd di Kenadaw. Li Gouvarnimaw di Kenadaw kinatouhtawayw li Aen zhawnd di Kenadaw, akwa ou li tout paree chipoonistayahk nootinikaywin pakwatem COVID-19, chioutinamahk la for kawshikeeshikawk mawchistawin, wayschipayin pimatishiwin, chipimouhteyahk en pawr aen ptsi shmaen ishi naayihtumowin, chiashtahk la maezoun tipayihchaywin keehtwawm chikakway ayawhk, oushistowin atoushkaywina, meena ahkikiwuk li miljeu kushkischikaywak.</p>\n\n<p>“Kaw-oushchikawtyak aen pleu boon li tawn ki vyaen mawchihtawn avek chinakinikawtayk ooma en malajee kaw-awshoupayik akwa chipoonistahk atoushkaywin ouschi cheestahouwina. Tout awn sawmbl, ayshkum atimyeupayin. Ayiwawk kil i katravaen saenk parsawn ouschi keekushkihtamawshoow Aen zhawnd di Kenadaw ki poonistawuk cheestahouwin, akwa niki kakayeshkimiwanawn aykwawnima kahkiyuw la gouvarnimaw akwa la gouvarnimaw-la lway ouschi atoushkaywak, akwa kahkiyuw awiyuk ou wayaezh didawn Kenadaw ishi li playn, lee shawr, keema aen bachimaw chi cheestahouhk. Ashpinay la smenn pawsee La sawntee Kenadaw la paarmisyoon maykiw aen awpachistawhk cheestahouwina poor lee zawnfawn awntor deu lawzh saenk akwa oonz, akwa li gouvarnimaw zhi garawnchee keestwawm awn partawn li moud COVID-19 cheestahouwina akwa kawkeestwawm cheestahouwina. Keeshpin ki ahkamaymounaw chiawnkourazhee kahkiyuw keekushklhtamawshoow Aen zhawnd di Kenadaw chiayachik soon COVID-19 cheestahouwina, chikee oushchikawtyak si boon la sawntee dimaen akwa for la sawntee nakahtoohkaywin aen system. Li gouvarnimaw chikee nawut neekawneestamakayw kahkiyuw Aen zhawnd di Kenadaw ishi chimawchistaw il i klayr ooma mawachichikaywin ouschi pleu tar ka ashtahk paaminikaywin akooz ouschi COVID-19, la for kinwaysh-keniwaymowin, akwa zaenproovmawn chikawschitinamaen ishi aen sarvel la sawntee akwa ashpayimouwin tretman. Nakenayminawnik Aen zhawnd di Kenadaw pishkaymowin akwa si boon la sawntee anoush akwa ishi li tawn ki vyaen.</p>\n\n<p>“Ka ashtayahk ooma en malajee kaw-awshoupayik awn nawrayr kiyanawn, pikou chikeehtwawmi oushtawhk manawchischikaywin akwaynima atoushkaymakun poor kahkiyuw awiyuk. Akoushi chitaytouchikawtayk, li gouvarnimaw chiahkamaymouww chi neekawnahew Aen zhawnd di Kenadaw akwa nakatoohkayw dan soon li tawn ki vyaen. Aykwawnima eweetwaywin chiakatoohkachikawtayk kaw-ishi kakwawyakakistayk kapimawchihouhk akwa chimawchistahk la maezoun wayhtakihtaywin akwa lee zawnfawn keniwaymowin. Naweechihiwanawn chiashtahk la maezoun tipayihchaywin keehtwawm chikakway ayawhk poor Aen zhawnd di Kenadaw avek ayiwawk mashkuweemakun Neekawn-Kaw-Atawayhk La maezoun Kawatawwayt Awnkourazhee, neu Li Rent-Chi-Tipayistamin paaminikaywin, akwa waystakistaywin ka kipahikawtayk itakistaywin poor neekawn-kaw-atawayhk. Weechihiwaywin li famee chiwayschipayin pimatishiwin poor li miljeu kushkischikaywak akwa li moond ka shoohkatoushkayw chigeetakouht. Akouschi paschi aen pchi braen li mwawn niki aen sinn naef lee zawnfawn keniwaymowin awn nagrimawn avek enn provayns akwa li territwayr aykwawnima chimenisham ikouhouhk etipahikayhk la mwachee didawn keestwawm l'anee poor mischayt oushami pikou tipayihchikaywina, oushchikawtyak nanduw sawn lee mil neu lee zawnfawn keniwaymowin la plas kushkimik la tayr, akwa oushistowin weeput kishkayhtamowin akwa lee zawnfawn keniwaymowin aen system aykwawnima chiitakihtayw, ikouhk, $ jis pyass enn zhournee poor kashoohkatoushkaychik la famee. Li Gouvarnimaw di Kenadaw chipoonistaw atoushkaywin ishi $ jis pyass enn zhournee lee zawnfawn keniwaymowin, akwa ahkamaymouwnaw pleu boon pimatishiwin akwa ayiwawk wayschipayin poor kahkiyuw Aen zhawnd di Kenadaw.</p>\n\n<p>“Chikee oushistowin ayiwawk mashkuwsheewin manawchischikaywin, oushistowin atoushkaywina, akwa ahkikiwuk li miljeu kushkischikaywak, Kenadaw piko chioutinahk la for akwa braev kawshikeeshikawk mayshkouchipayiwin. Akouschi anavaan ka itouhtayahk chinakinamahk akwa li kouvayr li wil akwa li gas itayshkamik kapimohtachikawtayk, nakatoohkaywin didawn li piblik ka awwachikayhk, akwa kakayeshkimiwaywin en sale ouschi kaya kaykwuy ka pimohtachikawtayk awwachikayhk. Niayawnawn kreu awpacihchikanaa akwa mamiyoowin atoushkaywak chioushistahk payhkun oushihtawina aykwawnihi en tayr kanataweyistam chinakinahk weenistawniwun akwa oushistowin awn vayr manawchischikaywin. Li Gouvarnimaw di Kenadawwill ahkamaymouwnaw chinakatoohkayt atoushkaywak akwa paaminikaywin chiweechikooyahk ishi ooma manawchischikaywin ouschi li tawn ki vyaen, akwa meena mawchistaw chipayhkuhk layr shikawpakitatawmouyahk akwa manawchihayw Aen zhawnd di Kenadaw machikeeshikawin oushi. Tout awn sawmbl, pikou wawhiyuw nawut chi-itouhtayahk akwa nawut chikakwayyawhouyahk ishi kawshikeeshikawk mayshkouchipayiwin, namoo wiya pikou chimanawchistawyahk itaykawweekihk, mawka chiahkikihk kiyanawn manawchischikaywin ishi namoo wiya nakatayw atoushkaywak.</p>\n\n<p>“Kahkiyuw Aen zhawnd di Kenadaw kashkistamashoowuk chipishkaymowin didawn soon a lawntour, mawka pawshkishan la shikaan nawut ayiwawk ouhpipayin didawn Kenadaw en grous vil. Maykwawt awta kahkiyuw li tout paree awnshay la for mawchistawin ishi pawshkishan paminikaywin, kiyawpit ayiwawk chi-itouchikawtayk. Akouschi chioushchikawtyak ayshkum atimyeupayin akwa chipimoustatahk si nissisayr atawaywin ouschi nootinikaywin-itowahk pawshkishana akwa chiatoushkatamahk avek enn provayns akwa li territwayr aykwawnihi ka nohtay nakinahk pawshkishana.</p>\n\n<p>“Li gouvarnimaw meena ahkamaymouww chikayshchinahow kahkiyuw awiyuk chi pishkaymow akwa ayow en shawns chineekawnouhtayt kiyawm ouschi soon nishtawinikashoowin, awina shawkihayw, tawnday ouschi, kaykwuy la lawn kapeekishkwayt, awin keeyamiheeshtawat, keema la poo lee kouleur. Niki ahkamaymouwnawn chinootinamahk systemic paakwatitowin, kishchiitaymishoowin, akwa kitimahiwaywin didawn a lawntour, akwa chipishkapahtamahk mashkuwsheewin ouschi Lee naengr akwa paakwatitowin ouschi Aen zhawnd di Kenadaw, akwa Indigene li moond. Niki meena neepawinawn poor LGBTQ2 dan a lawntour maykwawt kapoonistahk nakinikaywin ouschi jeufarawn tretma, akwa niki meena manawchistanawn akwa neekawnayshtamakanawn deu kischee la lawngaezh, tou lee deu peehchee akwa ouhpimaen ouschi Quebec.</p>\n\n<p>“Mawka ka oushistahk ayiwawk takwashtawin akwa nayikouhk Kenadaw namoo wiya chikee ishpayin keespin pikou nawut chikakwayyawhouyahk ishi en pawr aen ptsi shmaen ishi naayihtumowin. Aen zhawnd di Kenadaw ki kakawkakwawyakishaykihikoow kaw-mishkikataykihk noo la mark en fous akwa aykeenahiniwayhk ashtayw araw ashpinay amihawi l’ikol. Ishi li tayraen, akwa ishi li gouvarnimaw, pikou chiahkamaymouyahk chiweestamahk tapwaywin ouschi oohin ka ki mawipayihk akoushi ishi kwayesh chioushtahk ka ki kichimahiwayhk akwa anavan didawn l'ispree ouschi naayihtumowin, poor kahkiyuw awiyuk. Li Gouvarnimaw di Kenadaw chiahkamaymouww chiweechihayw Indigene li moond didawn oohin dan li a lawntour ishi nakatoohkaywin didawn ispray-nakishkamakaywin ishi aen sarvel la sawntee akwa si boon la sawntee pamnikaywin, akwa meena niki ripoond ishi Li vayritee akwa Naayihtumowin Peehkishkwayshtamakaywin ouschi Kenadaw chi Mawhcheemakun Mawchistawin akwa akishoow kischee peekishkwayshtamakayw anavawn chiayiwawk kwayesh chitoutamakayhk ka ki nakatamakayhk ouschi amihawi l’ikol. Li gouvarnimaw meena kakway yahoow atoushkaywin avek Indigene en partineuz chinatakouhkawtayk ooma tooroon not grawn piyee ka ki mawipayihk Namataywin akwa nipahaywin Indigene Lee faem, Lee fee, akwa 2SLGBTQQIA+ li moond, akwa meena nakayshchinahounawn miyoutootamowin akwa nayikouhk chitipahamakaywin poor aykwawniki ka ki mayiitotakout Li Promyee Nawsyoon Lee zawnfawn akwa Famee Li Service paaminikaywin. Tout awn sawmbl, kakipahaynaw oohin youhtaypayowina aykwawnihi oosam mischayt Li Promyee Nawsyoon, aen Niskimoo, akwa Michif dan li a lawntour tahkinay kiyawpit nakishkam anoush akwa chioushchikawtyak nawut pleu boon akwa ayiwawk nayikouhk li tawn ki vyaen.</p>\n\n<p>“Peeyish, li gouvarnimaw nishtawinum eweekiyahk didawn mitouni eshakamohtahk tooroon not grawn piyee. Ooma en malajee kaw-awshoupayik kiwapastahikoonaw aenportaan chiatoushkayahk avek mishiway itay en partineuz chinakishkamahk muwnayshkawkaywin anoush ouschi akwa li tawn ki vyaen. Nootinikaywin ouschi ooma kawshikeeshikawk mayipayiwin ishi manawchistawin kaw-oustinamawkayhk supply aykwawnihi si boon oushistowin li miljeu kushkischikaywak atoushkaywina, akwa neepaweeshtamakywin chimashkuwsheehtahk tooroon not grawn piyee la pay akwa pishkaymowin, Kenadaw chiahkamaymouw neekawnaywin didawn tooroon not grawn piyee ikouhk.</p>\n\n<p>“Ka oushchikawtyak keestwam ashpinay muwnayshkawkaywin ouschi COVID-19 en malajee kaw-awshoupayik, Aen zhawnd di Kenadaw pakoshayimoowuk kischee opaminikaywak chiatoushkaychik tout awn sawmbl akwa chipimouhtatawak see ayndawayishchikatwina. Li Gouvarnimaw di Kenadaw ashoutamakayw chi ahkamaymouw chineekawnahew Aen zhawnd di Kenadaw maykwawt ka oushchikawtyak nawut payhkun akwa si boon la sawntee li tawn ki vyaen. Tout awn sawmbl anavawn kiyanawn Kenadaw–poor kahkiyuw awiyuk.”</p></div>\n      "
}