{
  "path": "/en/news/news-releases/2019/08/01/new-protections-high-arctic-boost-climate-change-resiliency-and",
  "pageTitle": "New protections for High Arctic to boost climate change resiliency and create opportunities for Inuit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In Canada’s North, rising sea levels and thinning sea ice caused by climate change threaten the lives, cultures, and identities of Inuit – and the survival of the species their communities depend on. That is why the Government of Canada is taking action to address these threats, support new economic opportunities for Inuit, and exceed our goal to protect 10 per cent of Canada’s marine and coastal areas by 2020.</p>\n\n<p>The Prime Minister, Justin Trudeau, Premier of Nunavut, Joe Savikataaq, and President of the Qikiqtani Inuit Association (QIA), P.J. Akeeagok, today announced the first step in the creation of a long term protected area in Canada’s High Arctic Basin – the new Tuvaijuittuq Marine Protected Area. They also announced the completion of the Tallurutiup Imanga National Marine Conservation Area through an Inuit Impact and Benefit Agreement.</p>\n\n<p>Together, these areas cover more than 427,000 square kilometres, which is larger than Newfoundland and Labrador. Now, nearly 14 per cent of Canada’s marine and coastal areas will be protected – exceeding our target of protecting 10 per cent of Canada’s marine and coastal areas by 2020.</p>\n\n<p>The Inuit Impact and Benefit Agreement supports Inuit stewardship of Tallurutiup Imanga and Tuvaijuittuq. It also creates economic development opportunities in local communities, including Inuit training and employment, through $55 million in Government of Canada funding.</p>\n\n<p>In addition, the Government of Canada is investing in infrastructure for communities in the Tallurutiup Imanga area. These infrastructure investments – which include funding for the construction of harbours and a training centre – total approximately $190 million over seven years.</p>\n\n<p>The Prime Minister also underlined that the government is committed to upholding Canadian sovereignty in the Arctic. The government has made significant investments in the Canadian Coast Guard and Navy, so we have greater capabilities to defend Canada’s national interests.</p>\n\n<p>The Government of Canada is working to support a healthy Arctic, fight climate change, and advance reconciliation with Indigenous peoples by recognizing their unique relationship with traditional lands and waters and expertise in their management. We will continue to work closely with Inuit communities and Northern partners to determine how best to protect our Arctic marine areas for the benefit of all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Whether on the shores of the Atlantic, Arctic, or Pacific, Canada’s coastal communities are among the first to feel the effects of climate change. We are taking steps to tackle these effects, and to protect the increasingly fragile ecosystems in Canada’s North. By protecting these vital areas, we are safeguarding our environment for future generations while advancing Inuit self-determination and preserving Inuit cultural practices, languages, and customs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, on the official creation of Tallurutiup Imanga, the Government of Nunavut shares in the celebration, hard work, and possibility associated with this historic announcement. Conservation, balanced with responsible development and economic potential for the region, will change the lives of those in the High Arctic and ensure a legacy of prosperity and stewardship.”</p>\n\n<footer class=\"default\">Joe Savikataaq, Premier of Nunavut and Minister of Environment</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s historic announcement is the culmination of decades of work by visionary Inuit leaders to preserve our waters and sea ice. By protecting Tallurutiup Imanga, and seeking permanent protection for Tuvaijuittuq, we not only save these pristine Arctic ecosystems, but also lay the foundation for a conservation economy in sustainable industries such as fisheries. These investments in jobs and infrastructure will have profound impacts in the High Arctic and serve as a model of what can be achieved when we work as equal partners in the spirit of reconciliation.”</p>\n\n<footer class=\"default\">P.J. Akeeagok, President of the Qikiqtani Inuit Association</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Under the Nunavut Agreement, an Inuit Impact and Benefit Agreement must be negotiated with the designated Inuit organization prior to establishing any protected area in Nunavut.</li>\n\t<li>On April 11, 2019, the Government of Canada, the Government of Nunavut, and the QIA signed a Memorandum of Understanding, committing to work together to explore the potential protection of areas in the High Arctic Basin or Tuvaijuittuq, while supporting the development of a conservation economy.</li>\n\t<li>Tuvaijuittuq means “the place where the ice never melts” and refers to the area off the northwest coast of Ellesmere Island, Nunavut, in the Arctic Ocean.</li>\n\t<li>Tuvaijuittuq is the last Arctic area expected to retain year-round sea ice until at least 2050. It is an important area for ice-dependent and culturally important species like polar bears, walruses, and seals as sea ice declines due to climate change.</li>\n\t<li>The Tallurutiup Imanga National Marine Conservation Area is the primary eastern gateway to the central Arctic for large numbers of migrating marine mammals, and serves as a breeding and foraging habitat for seabird colonies.</li>\n\t<li>The Government of Canada, with support from provincial and territorial governments, signed and ratified the United Nations Convention on Biological Diversity in 1992. It has since developed a national biodiversity strategy that commits to conserve at least 10&nbsp;per cent of Canada’s marine and coastal areas by 2020.</li>\n\t<li>The Government of Canada has designated several marine protected areas in Inuit Nunangat, including the <a href=\"https://www.dfo-mpo.gc.ca/oceans/mpa-zpm/anguniaqvia-niqiqyuam/index-eng.html\">Anguniaqvia niqiqyuam</a> and <a href=\"https://www.dfo-mpo.gc.ca/oceans/mpa-zpm/tarium-niryutait/index-eng.html\">Tarium Niryutait</a> marine protected areas in the Northwest Territories, and <a href=\"https://www.canada.ca/en/environment-climate-change/services/national-wildlife-areas/locations/ninginganiq.html\">Ninginganiq</a>, <a href=\"https://www.canada.ca/en/environment-climate-change/services/national-wildlife-areas/locations/akpait.html\">Akpait</a>, <a href=\"https://www.canada.ca/en/environment-climate-change/services/national-wildlife-areas/locations/qaqulluit.html\">Qaqulluit</a>, and <a href=\"https://www.canada.ca/en/environment-climate-change/services/national-wildlife-areas/locations/nirjutiqavvik.html\">Nirjutiqavvik</a> national wildlife areas in Nunavut. These areas protect a variety of fish, seabird, and marine mammal species, including important concentrations of beluga and bowhead whales.</li>\n\t<li>Canada has protection measures in place for 13.81 per cent of our marine and coastal areas, up from around 1 per cent four years ago. Since 2015, Canada has designated:\n\t<ul>\n\t\t<li>1 national marine conservation area</li>\n\t\t<li>1 marine national wildlife area</li>\n\t\t<li>6 marine protected areas</li>\n\t\t<li>59 marine refuges</li>\n\t</ul>\n\t</li>\n\t<li>The Tallurutiup Imanga National Marine Conservation Area represents 1.9&nbsp;per&nbsp;cent of this total, while the Tuvaijuittuq Marine Protected Area represents 5.55&nbsp;per&nbsp;cent.</li>\n\t<li>In May 2019, the Government of Canada amended the <em>Oceans Act </em>to strengthen the protection of marine ecosystems through interim protection measures for up to five years, until a long term protection designation is made.</li>\n</ul>\n\n<h2>Related product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2019/08/01/government-canada-working-partners-protect-canadas-high-arctic\">Government of Canada working with partners to protect Canada’s High Arctic</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.dfo-mpo.gc.ca/oceans/conservation/index-eng.html\">Meeting Canada’s marine conservation targets</a></li>\n\t<li><a href=\"http://www.dfo-mpo.gc.ca/oceans/mpa-zpm/tuvaijuittuq/index-eng.html\">Tuvaijuittuq Marine Protected Area</a></li>\n\t<li><a href=\"https://www.pc.gc.ca/en/amnc-nmca/cnamnc-cnnmca/tallurutiup-imanga\">Tallurutiup Imanga National Marine Conservation Area</a></li>\n\t<li><a href=\"https://www.dfo-mpo.gc.ca/oceans/maps-cartes/conservation-eng.html\">Map of marine conservation targets</a></li>\n</ul></div>\n      "
}