{
  "path": "/en/news/news-releases/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and",
  "pageTitle": "Canada and partners announce historic investment in education for women and girls in crisis and conflict situations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gender equality is a fundamental human right and a top priority for Canada and its G7 Presidency. To make gender equality a reality, all women and girls around the world must have equal access to quality education and learning opportunities. When women and girls have an equal chance to learn, grow, and succeed, they help build an economy that works for everyone.</p><p>Canada, along with the European Union, Germany, Japan, the United Kingdom, and the World Bank, today announced an investment of close to $3.8 billion CAD, marking a fundamental shift toward improving access and reducing barriers to quality education around the world. Today’s announcement represents the single largest investment in education for women and girls in crisis and conflict situations. It has the potential to make a difference in the lives of millions of the world’s most vulnerable women and girls.</p><p>These investments will support global action to:</p><ul><li>Equip women and girls with the skills needed for the jobs of the future</li><li>Improve training for teachers to provide better curriculum for women and girls</li><li>Improve the quality of available data on women’s and girls’ education</li><li>Promote greater coordination between humanitarian and development partners</li><li>Support innovative education methods, especially for vulnerable and hard to reach groups, including refugees and displaced people</li><li>Support developing countries in efforts to provide equal opportunities for girls to complete at least 12 years of quality education, from primary to secondary school</li></ul><p>Canada will work with these partners along with others to support women’s and girls’ education around the world. They will also make sure the voices of women and girls are included when decisions are made on education and employment.</p><h2>Quote</h2><blockquote><p>“We need to work together to ensure all women and girls have access to quality education and modern skills training. From primary school to secondary school and beyond, women and girls in crisis and conflict situations must have the same opportunities to succeed. Investing in their education is not just the right thing to do, it’s the smart thing to do. Given the chance, we know women and girls will drive positive change, and help build better lives for themselves, their families, their communities, and, in turn, the world.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Of the total funding announced today, international partners committed to make the following investments:<ul><li>Canada is investing $400 million CAD over three years, in addition to the $180&nbsp;million we provided in January 2018 to the Global Partnership for Education for 2018-2020.</li><li>The European Union is investing 72 million euros over three years.</li><li>Germany is investing 75 million euros.</li><li>Japan is investing $200 million USD in girl’s and women’s&nbsp;quality education, including in emergencies or in conflict-affected or fragile states.</li><li>The United Kingdom is investing £187 million, which builds on Prime Minister May’s announcement at the Commonwealth Heads of Government Meeting in April when she pledged £212 million to get almost one million girls in developing countries across the Commonwealth learning.</li><li>The World Bank is investing $2 billion USD over five years.</li></ul></li><li>In February 2018, France committed to provide 200 million euros to the Global Partnership for Education to support girls’ education and help strengthen education systems in developing countries.</li><li>At the end of 2016, globally there were 65.5 million forcibly displaced people, over half of whom were under 18 years of age, with little to no access to quality education and learning opportunities.</li><li>Girls are more likely to be taken out of school due to displacement-related poverty, more likely to be forced into early marriage, and are disproportionately affected by gender and sexual-based violence.</li><li>Canada holds the G7 Presidency for 2018, and is advancing domestic and international priorities framed under the following five key themes:<ul><li>Investing in growth that works for everyone</li><li>Preparing for jobs of the future</li><li>Advancing gender equality and women’s empowerment</li><li>Working together on climate change, oceans, and clean energy</li><li>Building a more peaceful and secure world</li></ul></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://g7.gc.ca/en\">G7&nbsp;2018 Charlevoix</a></li><li><a href=\"/en/news/news-releases/2018/01/25/prime-minister-announces-funding-global-partnership-education\">Prime Minister announces funding for the Global Partnership for Education</a></li></ul></div>\n      "
}