{
  "path": "/en/news/statements/2019/08/23/statement-prime-minister-black-ribbon-day",
  "pageTitle": "Statement by the Prime Minister on Black Ribbon Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black Ribbon Day, the National Day of Remembrance for the Victims of Communism and Nazism in Europe:</p>\n\n<p>“Today, we join people around the world to pay tribute to the survivors and victims of Communism and Nazism in Europe. We also stand in solidarity with all those around the world who continue to fight against the brutality, violence, and repression of totalitarian and authoritarian regimes.</p>\n\n<p>“Black Ribbon Day marks the sombre anniversary of the Molotov-Ribbentrop Pact. Signed between the Soviet Union and Nazi Germany in 1939 to divide Central and Eastern Europe, the infamous pact set the stage for the appalling atrocities these regimes would commit. In its wake, they stripped countries of their autonomy, forced families to flee their homes, and tore communities apart, including Jewish and Romani communities, and others. The Soviet and Nazi regimes brought untold suffering upon people across Europe, as millions were senselessly murdered and denied their rights, freedoms, and dignity.</p>\n\n<p>“Many people who escaped found refuge in Canada, bringing with them the hope of a better future for themselves and their families. Despite all they had endured, many shared an unshakeable belief in the power of individuals to make positive change and influence society for the better. They, along with their children and grandchildren, have helped build the strong, diverse, and prosperous country we all call home.</p>\n\n<p>“It is up to all of us to safeguard human rights and protect freedom and democracy. It is up to all of us to make sure crimes like these never happen again. On behalf of the Government of Canada, I encourage all Canadians to honour the victims and survivors of Communism and Nazism, and of all totalitarian and authoritarian regimes, past and present. It is in their name that we will continue to defend human rights, and uphold the inherent dignity of every human being.”</p></div>\n      "
}