{
  "path": "/en/news/news-releases/2019/06/12/prime-minister-names-first-ambassador-women-peace-and-security",
  "pageTitle": "Prime Minister names first Ambassador for Women, Peace and Security | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gender equality plays a critical role in creating lasting solutions to the challenges we face around the world – from building economies that work for everyone to advancing peace and security. To build a more just, peaceful, and secure world, we must make sure women and girls can participate freely and fully in our societies.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Jacqueline O’Neill has been appointed as Canada’s first Ambassador for Women, Peace and Security.</p>\n\n<p>Ms. O’Neill will help advance Canada’s feminist foreign policy by championing our women, peace, and security priority commitments at home and around the world. She will also work across all federal departments and with partners to advise on the implementation of Canada’s National Action Plan on Women, Peace and Security.</p>\n\n<p>In addition to providing advice to ministers on this critical challenge, Ms.&nbsp;O’Neill will also recommend actions we can take to protect the rights of women facing insecurity and violence and promote their meaningful participation in our development, humanitarian, and peace and security efforts around the globe.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When women play an active role in conflict prevention and peacebuilding, and when their rights are respected, we are better able to achieve long-term, sustainable peace. As Canada’s first Ambassador for Women, Peace and Security, Ms. O’Neill will lead our country’s efforts to support women, help prevent and end conflict, and build a better and fairer world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am thrilled that Ms O’Neill will serve as Canada’s first Ambassador for Women, Peace and Security. She is a world-leader in this field and a champion of gender equality in Canada and internationally. The appointment of the first ambassador is a tangible demonstration of Canada’s national and global leadership in the area of women, peace, and security, and our continued efforts to increase respect for the rights of women and girls, and their participation in conflict prevention and resolution.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“We look forward to working with Ms. O’Neill in advancing women’s participation in peace and security. Women are vital to forging peace and making it last in nations overcoming conflict. As part of the Elsie Initiative for Women in Peace Operations, the Canadian Armed Forces is pleased to be partnering with Ghana’s Armed Forces to develop innovative approaches to increase women’s participation in uniformed military roles.”</p>\n\n<footer class=\"default\">The Hon. Harjit S. Sajjan, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada is a proud global advocate for women, peace and security. In fact, gender equality is a more reliable predictor of peace than a country’s GDP or level of democracy. That’s why I am honoured to welcome Ms. O’Neill to the role of Ambassador for Women, Peace and Security and look forward to working with her to improve the lives of women and people of all gender identities and expressions here in Canada and around the world.”</p>\n\n<footer class=\"default\">The Hon. Maryam Monsef, Minister of International Development and Minister for Women and Gender Equality</footer>\n</blockquote>\n\n<h2>&nbsp;Quick Facts</h2>\n\n<ul>\n\t<li>The Ambassador for Women, Peace and Security is appointed by the Governor in Council to hold office on a full-time basis for up to three years.</li>\n\t<li>In 2000, the United Nations Security Council adopted resolution 1325, the first of nine resolutions to recognize the unique effects of armed conflict on women and girls, and their important role in resolving conflict and building peace. It urges Member States to increase women’s participation and incorporate gender perspectives in all United Nations peace and security efforts, and to take measures to protect women and girls in conflict situations.</li>\n\t<li>To date, approximately 80 national action plans on women, peace and security have been adopted globally. Canada launched its first National Action Plan in 2010, and its second in 2017.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/06/12/jacqueline-o’neill\">Jacqueline O’Neill</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/women_peace_security-femmes_paix_securite-rep.aspx?lang=eng\">Canada’s Ambassador for Women, Peace and Security</a></li>\n\t<li><a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/cnap_wps-pnac_fps.aspx?lang=eng\">Canada’s National Action Plan on Women, Peace and Security</a></li>\n</ul></div>\n      "
}