{
  "path": "/en/news/readouts/2021/07/07/prime-minister-justin-trudeau-meets-alberta-premier-jason-kenney",
  "pageTitle": "Prime Minister Justin Trudeau meets with Alberta Premier Jason Kenney | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Alberta Premier Jason Kenney in Calgary.</p>\n\n<p>The Prime Minister and the Premier discussed areas of shared importance to Alberta and Canada’s future economic prosperity, including a range of public and private sector energy and infrastructure initiatives. The Prime Minister reiterated the government’s commitment to banning harmful plastics. Both leaders agreed that Alberta plays a key role in helping Canada achieve zero plastic waste by 2030.</p>\n\n<p>The Prime Minister underscored that the Government of Canada is working constructively with provinces and territories toward a strong economic recovery, noting Alberta’s successes in attracting foreign investment. The two leaders also agreed on the importance of re-opening Canada’s borders, noting that this would be discussed at an upcoming meeting of First Ministers.</p>\n\n<p>Prime Minister Trudeau and Premier Kenney reflected on the recent findings at residential schools, and reaffirmed their commitment to supporting Indigenous peoples in Canada. They also agreed on the need to stand up against Islamophobia and hate, and reiterated their commitment to combatting all forms of discrimination.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/07/prime-minister-highlights-public-transit-investment-create-jobs-grow\">Prime Minister highlights public transit investment to create jobs, grow the economy, and build back stronger communities in Calgary</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/06/government-of-canadas-first-phase-to-easing-border-measures-for-travellers-entering-canada3.html\">Government of Canada’s first phase to easing border measures for travellers entering Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2021/06/01/prime-ministers-remarks-house-commons-tragic-legacy-residential-schools\">Prime Minister’s remarks in the House of Commons on the tragic legacy of residential schools</a></li>\n</ul></div>\n      "
}