{
  "path": "/en/news/news-releases/2018/08/08/prime-minister-announces-new-project-create-jobs-and-improve-training",
  "pageTitle": "Prime Minister announces new project to create jobs and improve training in Canada’s aerospace and healthcare sectors | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is making smart, ambitious investments to help Canadians get the skills, training, and opportunities they need to thrive in the global economy and succeed in the workforce, now and into the future.</p><p>The Prime Minister, Justin Trudeau, today announced an investment of $150 million to CAE through the Strategic Innovation Fund. With this investment, CAE will harness the power of artificial intelligence, cloud computing, big data, and augmented and virtual reality to develop the next generation of simulation and training products.</p><p>This funding will secure a $1 billion investment in research and development in Canada. It will help CAE create 400 new engineering and manufacturing jobs over the next five years, and retrain 1,700 employees with new digital skills. This will allow the company to fully transform its products and operations with cutting-edge digital technology.</p><p>CAE will develop new simulation tools and training programs with the latest technologies, making sure Canadian professionals in the aerospace and healthcare sectors get the skills they need and the most relevant training possible.</p><h2>Quotes</h2><blockquote><p>“Today’s announcement is about creating high-skilled jobs in Canada today, while making sure Canada’s next generation of pilots, engineers, doctors, and nurses have access to some of the most advanced simulation tools and training programs in the world. With this funding, CAE will continue to raise the bar for training standards, from the cockpit to the operating room, and help drive the success of Canada’s aerospace industry.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Aerospace is one of the most innovative industries in Canada. Our government’s investment in CAE will help maintain Canada’s global leadership in a sector critical to our economy. Canadians will benefit from more middle class jobs, more skills training opportunities, and innovative new products thanks in part to this investment.”<br><cite>—The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development</cite></p></blockquote><h2>Quick Facts</h2><ul><li>CAE is a global leader in training for the aerospace and healthcare sectors, and the world's leading supplier of flight simulators. Established in 1947, CAE has offices in 18 locations, and employs approximately 4,000&nbsp;people across the country.</li><li>Canada’s aerospace industry includes 700 firms, contributes close to $12.6&nbsp;billion in GDP to Canada’s economy, and employs more than 85,000&nbsp;Canadians.</li><li>CAE will invest $1 billion in research and development by 2023, retrain 1,700&nbsp;employees with new digital skills, and collaborate with 50 post-secondary institutions and research centres across Canada.</li><li>The Government of Canada’s contribution to CAE includes an unconditionally repayable investment of $140&nbsp;million and a non-repayable investment of $10&nbsp;million.</li><li>The Strategic Innovation Fund is a $1.26 billion program to support research, development, and commercialization of new products that pave the way for Canada as a global innovation leader and attract investments that create jobs. The Government of Canada launched the Strategic Innovation Fund in Budget 2017 to ensure Canada remains a top destination for businesses to invest, grow, and create jobs.</li></ul><h2>Associated Link</h2><ul><li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/programs/strategic-innovation-fund.html\">Strategic Innovation Fund</a></li></ul></div>\n      "
}