{
  "path": "/en/news/statements/2022/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p>\n\n<p>“Tonight, Canadians across the country will gather with loved ones to celebrate the accomplishments of the past year and ring in the new one.</p>\n\n<p>“We have a lot to be thankful for this past year. We got back to doing the things we love, like gathering with friends and family. As our economy reopened, we experienced one of the strongest economic recoveries in the G7 – creating more jobs than we lost to the pandemic. And we welcomed the world back to Canada over the summer to share the natural beauty that we’re all so proud of.</p>\n\n<p>“This year also had challenges, but when things got hard, we were there for each other. We rolled up our sleeves, looked out for our neighbours, and supported each other. We got boosted to protect ourselves and our loved ones. We came together to help Atlantic Canadians in the wake of Hurricane Fiona. We have been there to support the people of Ukraine as they bravely defend their country. And as global inflation drove up the cost of living, we delivered much-needed relief to those who need it the most – to help with groceries, rent, child care, and to ensure kids get the dental coverage they need.</p>\n\n<p>“As we look ahead to the New Year, the Government of Canada will continue to build an economy that works for all Canadians. We will keep attracting historic investments in our electric vehicle supply chain – from critical minerals to manufacturing – which are already securing tens of thousands of jobs across the country. We will continue our work to make our communities safer by strengthening gun control. And we will continue to be there for people by making life more affordable.</p>\n\n<p>“In 2023, let’s continue to show up for one another, and together, let’s build a better future for everyone. On behalf of our family, Sophie and I wish you and your loved ones a wonderful night and all the best for the New Year.</p>\n\n<p>“Happy New Year everyone!”</p></div>\n      "
}