{
  "path": "/en/news/news-releases/2022/11/07/producing-vaccines-creating-good-jobs-and-building-economy-works-all",
  "pageTitle": "Producing vaccines, creating good jobs, and building an economy that works for all Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Amid global economic uncertainty, the Government of Canada will continue to be there for people – just like we were throughout the pandemic. By continuing to attract investment in research and development and manufacturing, we will continue to create good, middle class jobs and build an economy that works for all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, took part in the ground-breaking of vaccine developer Moderna’s new state-of-the-art mRNA vaccine manufacturing facility in Laval, Quebec. When completed, this new facility will be able to produce up to 100&nbsp;million made-in-Canada mRNA vaccine doses annually and will create hundreds of good jobs. The Prime Minister also took the opportunity to remind Canadians to keep up to date with their COVID-19 vaccinations, including getting booster shots when eligible to protect themselves and their loved ones.</p>\n\n<p>The facility is expected to be completed in 2024 at the earliest. In addition to COVID-19 vaccines, it is expected to be able to produce vaccines for other respiratory diseases, such as influenza – pending their ongoing development by Moderna and approval by Health Canada.</p>\n\n<p>During the pandemic, we worked hard to secure life-saving personal protective equipment, invest in our health care system, and ensure everyone eligible in Canada could get vaccinated. As we move forward, we will strengthen our biomanufacturing and life sciences sector to re-establish Canada’s domestic vaccine manufacturing capability, bring Canadian innovation to the front lines of tomorrow’s health solutions, and ensure we are better prepared for future health crises – all while growing the economy and creating good jobs.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“COVID-19 vaccines saved lives and got Canadians back to doing the things they love. Breaking ground on this vaccine manufacturing facility is an important milestone toward ensuring that Canadian workers and Canadian innovation play a key role in keeping our communities safe building an economy that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s ground-breaking for Moderna’s facility in Laval brings us one step closer to seeing the future of vaccines being developed right here in Canada. With talented workers, researchers and students, Laval will play a key role in global health and health innovation. Moderna’s presence in Canada will strengthen our national biomanufacturing ecosystem, positioning the entire sector to continue to grow and to create even more jobs right across the country.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Staying up to date with vaccination continues to be one of the most effective ways to protect ourselves against serious illness, hospitalization, and death from COVID-19. By bolstering Canada’s domestic manufacturing capacity, we are strengthening domestic health security and pandemic preparedness through timely access to innovative, cutting-edge vaccines that help us save lives.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is continuing to ensure Canadians have access to the latest vaccines now and into the future. Breaking ground on this new facility is another important step in our partnership with Moderna to build a domestic biomanufacturing capacity for mRNA vaccines. Access to made-in-Canada vaccines will help ensure we are ready in the event of a future pandemic. We have, and will always work to protect the health and safety of everyone in Canada.”</p>\n\n<footer class=\"default\">The Hon. Helena Jaczek, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am very pleased that we were able to attract Moderna to Laval. Its arrival strengthens Laval’s long-established biopharmaceutical sector and kicks off Phase II of Biotech City.”</p>\n\n<footer class=\"default\">Stéphane Boyer, Mayor of Laval</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today marks another milestone for Moderna and our long-term strategic partnership with the Government of Canada to support pandemic preparedness. We are moving quickly to ensure local supply and manufacturing capabilities of mRNA vaccines for Canadians, with the goal of completing our manufacturing facility in Quebec by the end of 2024.”</p>\n\n<footer class=\"default\">Noubar Afeyan, Co-founder and Chairman, Moderna</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Moderna is a pioneering biotechnology company specializing in mRNA therapeutics and vaccines. In August 2021, the Government of Canada announced a memorandum of understanding with Moderna to build a state-of-the-art mRNA vaccine production facility in Canada. In April 2022, the Prime Minister announced that plans were moving forward toward building this new facility in Quebec. Since then, a definitive agreement has been finalized between the Government of Canada and Moderna.</li>\n\t<li>Moderna is partnering with Canada’s leading research universities and institutions to help advance cutting-edge research and development here at home.</li>\n\t<li>Through the <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a>, the government has supported projects from coast to coast to coast. This includes up to $415&nbsp;million to support Sanofi in building an end-to-end influenza vaccine manufacturing facility in Toronto, Ontario; up to $175.6&nbsp;million for AbCellera toward its antibody therapy research and the construction of an antibody production facility in British Columbia; $39.8&nbsp;million for BioVectra to build a state-of-the-art facility in Prince Edward Island and reconfigure their facilities in Nova Scotia.</li>\n\t<li>The government has also invested $126&nbsp;million to build a new Biologics Manufacturing Centre at the National Research Council Canada’s Royalmount site in Montréal. The facility received its drug establishment licence in August 2022 and will be capable of large-quantity, end-to-end production of vaccines ‒ approximately 24&nbsp;million doses annually.</li>\n\t<li>Budget&nbsp;2021 provided a total of $2.2&nbsp;billion over seven years toward growing a vibrant domestic life sciences sector and securing pandemic preparedness. This funding will help build Canada’s talent pipeline and research systems, as well as foster the growth of Canadian life sciences firms.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/08/government-of-canada-announces-agreement-with-leading-covid-19-vaccine-developer-moderna-inc-to-build-mrna-vaccine-facility-in-canada.html\">Government of Canada announces agreement with leading COVID-19 vaccine developer Moderna, Inc. to build mRNA vaccine facility in Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/29/producing-made-canada-vaccines-and-creating-hundreds-good-jobs\">Producing made-in-Canada vaccines and creating hundreds of good jobs</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/vaccines.html\">Vaccines for COVID-19</a></li>\n\t<li><a href=\"https://www.modernatx.com/\">Moderna</a></li>\n</ul></div>\n      "
}