{
  "path": "/en/news/news-releases/2017/04/12/luxembourg-prime-minister-xavier-bettel-visit-canada",
  "pageTitle": "Luxembourg Prime Minister Xavier Bettel to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that Xavier Bettel, Prime Minister of the Grand Duchy of Luxembourg, will visit Canada from April 18 to 20, 2017.</p><p>During the working visit, Prime Minister Bettel will meet with Prime Minister Trudeau to discuss issues of mutual interest, strengthen commercial ties, and explore how to harness innovation and technology to create jobs in both countries, including by taking advantage of opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p><h2>Quote</h2><blockquote><p>“Canada and Luxembourg enjoy a long-standing friendship that has resulted in a strong trade and investment partnership. I look forward to meeting with Prime Minister Bettel to discuss how CETA will expand trade opportunities between our two nations, bolster our shared prosperity, and create good, well-paying middle class jobs on both sides of the Atlantic.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Luxembourg enjoy a thriving investment relationship built on our high-performing sectors.</li><li>Luxembourg's cumulative direct investment in Canada amounted to almost $61 billion in 2015, making Luxembourg the third most important source of foreign direct investment in Canada.</li><li>Canada's investment in Luxembourg reached over $50 billion in 2015 and ranks fourth worldwide for direct Canadian investment abroad.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/belgium-belgique/bilateral_relations_bilaterales/canada_luxembourg_relations.aspx?lang=eng&amp;menu_id=29\">Canada-Luxembourg Relations</a></li></ul></div>\n      "
}