{
  "path": "/en/news/statements/2022/09/11/statement-prime-minister-anniversary-911-and-national-day-service",
  "pageTitle": "Statement by the Prime Minister on the anniversary of 9/11 and the National Day of Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the terrorist attacks on September&nbsp;11, 2001, and the National Day of Service:</p>\n\n<p>“Twenty-one years ago today, the world witnessed the deadliest terrorist attacks in the history of the United States of America, our closest neighbour and ally.</p>\n\n<p>“Today, we pay tribute to the nearly 3,000 victims of this tragedy from more than 50 countries, including 24 Canadians, and the thousands more who were injured. We offer our condolences to the families and friends who lost loved ones. Our thoughts are also with all those who continue to live with the pain and trauma caused by these horrific events.</p>\n\n<p>“That day and in the days that followed, firefighters, paramedics, police officers, military personnel, and ordinary people risked their lives to save others. Amidst the attacks and destruction, these heroes demonstrated countless acts of service, bravery, and resilience. Today, we thank them and the many first responders who put themselves in harm’s way every day to keep Canadians safe.</p>\n\n<p>“On this National Day of Service, we are reminded of the generosity shown in the face of tragedy. We think about people and communities across Canada, like Gander, Newfoundland and Labrador, where residents provided stranded airline passengers with warm meals, clean bedding, and hot showers, and converted schools, churches, and community halls into temporary homes. Their hospitality showed the world what it means to be Canadian and reminds us that, when we come together, we get through the darkest of times.</p>\n\n<p>“On behalf of the Government of Canada, I&nbsp;encourage Canadians to take part in acts of service today to honour those who bravely and selflessly helped others on 9/11. We will never forget.”</p></div>\n      "
}