{
  "path": "/en/news/news-releases/2022/10/17/strengthening-canadas-position-leader-5g-and-digital-innovation",
  "pageTitle": "Strengthening Canada’s position as a leader in 5G and digital innovation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Now more than ever, Canadians depend on fast and reliable technology to work, do business, and stay in touch with their families and friends. That’s why the Government of Canada is supporting innovative solutions to strengthen and grow our country’s wireless infrastructure for generations to come. By continuing to invest in digital innovation, we will continue to create good middle-class jobs and new opportunities for Canadians and small businesses across the country to help them succeed in the economy of today and tomorrow.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Premier of Ontario, Doug Ford, the President and CEO of Nokia, Pekka Lundmark, and the President of Nokia Canada, Jeffrey Maddox, to announce a new project from global telecommunications company Nokia that would help Canada successfully transition to the next generation of 5G wireless technology.</p>\n\n<p>This transformative $340&nbsp;million project would expand Nokia’s Ottawa facility and revitalize its laboratories with the goal to further advance wireless technology research and development in Canada. It is expected to create more than 340 good middle-class jobs, and to increase co-op and intern positions for university and college students in Science, Technology, Engineering, and Mathematics (STEM).</p>\n\n<p>This new investment is an important step toward strengthening Canada’s wireless network, paving the way for new opportunities in innovative technology, including in the areas of clean energy, smart cities, precision agriculture, autonomous vehicles, and advanced telemedicine. We will continue to support innovation to grow our economy, connect our communities, and create good middle-class jobs for Canadians from coast to coast to coast.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The project we’re announcing will help connect Canadians to the jobs of today and tomorrow. It will bring economic benefits to the National Capital Region and stimulate Canada’s tech ecosystem. This is about building a strong economy and a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This monumental investment from Nokia shows once again that there is no better place for businesses to grow and jobs to be created than here in Ontario. We are proud to work alongside our partners to secure hundreds more in demand, high-skill jobs for the Ottawa region and we welcome this long-term commitment from Nokia to our province, and our workers.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians rely on wireless and Internet services for virtually everything: working, school, commuting, as well as staying in touch with loved ones. That is why it’s essential we have access to the most advanced digital telecommunications tools. Today’s announcement will help enable exciting new technologies that will have a transformative effect on Canada’s economy and the day-to-day lives of Canadians. By partnering with Nokia, Canada is strengthening its digital infrastructure and cementing its position at the forefront of the digital technology.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Nokia is helping to drive Canada’s tech leadership. This world-class, sustainable R&amp;D hub will be one of Nokia’s most dynamic developments – and I’m proud that it will benefit the people of Ottawa also. This is an exciting day. I want to express my appreciation to the local, provincial, and national governments for working with us on this project.”</p>\n\n<footer class=\"default\">Pekka Lundmark, President and CEO of Nokia</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement reinforces Nokia’s commitment to the Canadian market, where we have invested $1.4 billion in R&amp;D over the past five years. Nokia’s R&amp;D hub will generate net-new Canadian IP and bring innovative advanced telecommunications and cyber security technologies to market, helping us achieve our goal of improving people’s lives in Canada and across the world.”</p>\n\n<footer class=\"default\">Jeffrey Maddox, President of Nokia Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The next generation of 5G wireless technology is expected to add $40 billion annually to Canada’s economy in the next four years.</li>\n\t<li>Nokia is a global leader in telecom equipment, operating in 130 countries and employing 88,000 people. In 2022, the company had $28&nbsp;billion in global sales.</li>\n\t<li>Over the past five years, Nokia has invested $1.4&nbsp;billion in research and development in Canada, with innovations being used by communications service providers and web-based companies, such as Amazon and Google.</li>\n\t<li>Nokia employs 2,200 people in Canada and Nokia’s research and development operation in Ottawa is the largest single telecom employer in the region.</li>\n\t<li>The information and communications technology sector plays an essential role in Canada’s economy and provides Canadians with good middle-class jobs. Each new job created by an investment in this sector creates 2.3 new jobs in the broader Canadian economy. Every dollar spent in this sector adds almost two dollars to our economy.</li>\n\t<li>Consultations will first take place between the Government of Canada and Nokia to inform funding decisions in support of this project. If an agreement is finalized, federal funding would be provided through the Strategic Innovation Fund (SIF). Since its creation in 2017, the SIF has helped Canadian companies create and maintain close to 100,000 jobs, and has leveraged $57&nbsp;billion in additional investments.</li>\n\t<li>Through the SIF, the Government of Canada has already committed to invest $5.6&nbsp;billion in Canadian industries, providing support for innovative projects that&nbsp;help position Canada to prosper in the global economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://ised-isde.canada.ca/site/strategic-innovation-fund/en\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.nokia.com/\">Nokia Corporation</a></li>\n\t<li><a href=\"https://ised-isde.canada.ca/site/communications-research-centre-canada/en/crc-videos/video-what-5g\">What is 5G?</a></li>\n</ul></div>\n      "
}