{
  "path": "/en/news/news-releases/2016/07/15/prime-minister-canada-and-premier-alberta-announce-new-major",
  "pageTitle": "The Prime Minister of Canada and the Premier of Alberta announce new major Infrastructure funding | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister of Canada, Justin Trudeau, and the Premier of Alberta, Rachel Notley, announced funding to construct the southwest portion of the Calgary Ring Road.</p>\n<p>The new highway will reduce congestion and commute times, so that Alberta families can spend less time on the road and more time with their loved ones. The Ring Road will also strengthen the economy and make it easier for people – and products – to move across the province and the country.</p>\n<p>Both governments agree that modern and efficient roadways are crucial to encouraging economic activity, facilitating trade, and creating good-paying, middle class jobs. When well-planned infrastructure makes it easier for middle class Canadians to get to work on time, bring their kids to school, or make it to the grocery store, the entire economy benefits.&nbsp;</p>\n<p>The Government of Canada remains committed to making significant investments in infrastructure that will improve travel time, strengthen our communities, and help grow the Canadian economy.&nbsp;</p>\n<p><strong>Quotes</strong></p>\n<p>“Strategic investments in infrastructure not only create good, well-paying jobs that help the middle class grow and prosper today, they also deliver sustained economic growth that will help build the Canada of tomorrow. We need our transportation networks to be as modern and efficient as possible. Less congestion means less time spent in traffic, increased connections between our communities, and more support for tourism and for local, national, and international trade.”<br><em>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</em>&nbsp;</p>\n<p>“This agreement has been a long time in the making. It has been achieved now by a partnership that is based on a shared commitment to the economy, families and quality of life in the Calgary region and the Tsuut’ina Nation. We welcome the federal contribution to this important transportation project. Alberta values the partnership that is achieving the benefits of the Calgary Ring Road, and its potential to realize future opportunities for Albertans.”<br>—<em>Rachel Notley, Premier of Alberta</em></p>\n<p>“The Southwest Calgary Ring Road has been a long time coming and I’m very pleased to see it moving ahead. This project requires unprecedented partnership between all orders of government including our Tsuut’ina neighbours. I’m proud of the work my colleagues at the City of Calgary have done to support this project and we remain available to help in whatever way we can.”<br><em>—His Worship Naheed Nenshi, Mayor of Calgary</em><strong>&nbsp;</strong></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Government of Canada will be contributing up to $582.9 million to this project through the 2014 New Building Canada Plan – National Infrastructure Component, with the Province of Alberta contributing the balance of the funding.</li>\n<li>The project will be delivered using a Design/Finance/Build/Operate procurement approach, in which the contractor will design, build, operate and maintain the asset on behalf of the Government of Alberta for the contract period of 30 years. Three consortia were considered and Mountain View Partners was selected as the preferred proponent, with a commercial close date anticipated in September 2016.</li>\n<li>The Southwest Calgary Ring Road project is a large and complex project with 49 bridges which includes three river crossings and one roadway flyover; 31 kilometres of six- and eight-lane divided roadway; 14 interchanges; one railway overpass; and the reconstruction of Glenmore Trail from Sarcee Road to east of 37 Street Southwest.</li>\n<li>The new highway will also help reduce travel times and increase traffic flow for tourists from the United States visiting Banff, Yoho, Glacier and Jasper National Parks.</li>\n<li>The southwest and west portions are the two remaining sections of the larger Calgary Ring Road, commonly known as Stoney Trail. The completion of the southwest section, anticipated for 2021, will mark the 90 per cent completion mark of Stoney Trail as a whole, leaving only the west Calgary portion.</li>\n<li>The Government of Canada already provided funding to support the construction of two of the completed sections of Stoney Trail: $75 million in the Northwest section under the Canada Strategic Infrastructure Fund, and $100 million in the southeast section under the Building Canada Fund – Major Infrastructure Component.</li>\n<li>The Government of Alberta has provided $1.9 billion in funding for the completed sections of Stoney Trail.</li>\n</ul>\n<p><strong>&nbsp;<br></strong><strong>Associated links</strong></p>\n<ul>\n<li><a href=\"http://www.infrastructure.gc.ca/map-carte/ab-eng.html\">Federal infrastructure investments in Alberta</a></li>\n<li><a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\"><em>Investing in Canada</em>, the Government of Canada’s new $120 billion infrastructure plan</a></li>\n<li><a href=\"http://www.infrastructure.gc.ca/plan/nbcp-npcc-eng.html\">New Building Canada Plan</a></li>\n<li><a href=\"http://www.transportation.alberta.ca/sw-crrgp.htm\">Southwest Calgary Ring Road Project</a></li>\n<li><a href=\"http://www.infrastructure.gc.ca/plan/nic-vin-prog-eng.html\">The New Building Canada Fund – Provincial-Territorial Infrastructure Component – National Infrastructure Component</a></li>\n</ul></div>\n      "
}