{
  "path": "/en/news/news-releases/2021/11/01/prime-minister-trudeau-announces-enhanced-and-ambitious-climate",
  "pageTitle": "Prime Minister Trudeau announces enhanced and ambitious climate action to cut pollution at the COP26 summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since signing the historic Paris Agreement in 2015, the Government of Canada has taken significant action to address climate change. As a climate leader, Canada has put in place measures to reduce pollution to work toward meeting our Paris commitments, and achieving a net-zero economy by 2050. As the world shifts to a cleaner and greener economy, Canada will continue to take a leadership role in the fight against climate change, so we can keep creating new middle class jobs across all sectors and building a better future for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced Canada’s ambitious and enhanced plans to support the global phase-out of thermal coal, help developing countries transition to clean fuel alternatives as quickly as possible, and reduce pollution in the oil and gas sector.</p>\n\n<p>Ending coal power emissions is one of the single most important steps the world must take in the fight against climate change. That is why the Prime Minister today announced that Canada is working toward ending exports of thermal coal by no later than 2030. The ban would follow action already taken, including accelerating the phasing out of conventional coal-fired electricity in our country by 2030, and putting in place investments of more than $185 million to support coal workers and their communities through the transition to cleaner energy.</p>\n\n<p>To further support the global community’s efforts to phase out coal-fired electricity, the Prime Minister also announced up to $1 billion for the Climate Investment Funds Accelerated Coal Transition Investment Program, through Canada’s international climate finance contribution, to help developing countries transition from coal-fired electricity to clean power as quickly as possible. This investment will lead to the successful implementation of country-level strategies and associated kick-start projects, build support at the local and regional levels, and accelerate the retirement of existing coal mines and coal power plants, while enabling new economic activities and contributing to a socially inclusive and gender equal transition. In addition, the Prime Minister announced $25 million in funding to the Energy Sector Management Assistance Program, a partnership with the World Bank. This will help develop and implement clean energy alternatives, and support low- and middle-income countries in the transition to a cleaner economy.</p>\n\n<p>Canada is among the world’s biggest oil and gas producers, and all Canadians have benefitted from the sector’s contributions to our economy. As our country and the world move to clean energy alternatives, we need the sector to continue to adapt, which will spur innovation and help create the jobs of the future. The Prime Minister today announced that Canada is the first major oil-producing country moving to capping and reducing pollution from the oil and gas sector to net zero by 2050. To help do this at a pace and scale needed to achieve the shared goal of net zero by 2050, the government will set 5-year targets, and will also ensure that the sector makes a meaningful contribution to meeting Canada’s 2030 climate goals. In a letter sent today from Ministers Guilbeault and Wilkinson, the government is seeking the advice of the Net-Zero Advisory Body on how best to move forward on this approach.</p>\n\n<p>Canada is leading the way toward a clean energy future by finding real solutions that the world is seeking. Together with Canadians, global partners, and industry, the government will continue to tackle the climate crisis so we can create new middle class jobs and build a better, cleaner future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Climate action can’t wait. Since 2015, Canada has been a committed partner in the fight against climate change, and as we move to a net-zero future, we will continue to do our part to cut pollution and build a cleaner future for everyone. Together, we will beat this crisis while creating a green economy and new middle class jobs for Canadians.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since the world came together for the Paris climate agreement in 2015, Canada has taken great strides in the fight against climate change – but there’s still much work to be done. With our global partners, we will continue to play a constructive leadership role to move from ambitious hopes to realizing the benefits to our environment. Together, we will create jobs, build healthy communities, and transition to net zero.”</p>\n\n<footer class=\"default\">Hon. Steven Guilbeault, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Coal-fired electricity is responsible for 20 per cent of global greenhouse emissions.</li>\n\t<li>Moving away from coal will improve overall public health by creating cleaner, more breathable air. A recent analysis found that more than 800,000 people around the world die each year from the pollution generated by burning coal.</li>\n\t<li>Canada’s electricity generation mix is already one of the cleanest in the world. But by phasing out coal-fired electricity, Canada will cut carbon pollution by nearly 13 million tonnes in 2030, representing a significant step toward reaching Canada’s national target of reducing emissions by 40 to 45 per cent below 2005 levels by 2030.</li>\n\t<li>Canada is the fourth largest producer and third largest exporter of oil in the world. The oil and gas sector is the largest contributor to Canada’s greenhouse gas emissions, accounting for about 25 per cent of total emissions.</li>\n\t<li>In 2020, Canada released its strengthened climate plan,&nbsp;<a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview.html\"><em>A Healthy Environment and a Healthy Economy</em></a>, to accelerate emissions reductions and build a stronger, cleaner, more resilient and inclusive economy, putting in place some of the actions Canada will take to reach to net-zero emissions by 2050.</li>\n\t<li>The Climate Investment Funds Accelerated Coal Transition Investment Program will support both public sector utilities and private sector operators with the relevant toolkit for transition, as appropriate and consistent with national priorities and Nationally Determined Contributions.</li>\n\t<li>The World Bank Energy Sector Management Assistance Program provides support to low- and middle-income countries to encourage low carbon development through a wide range of sustainable energy solutions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/25/prime-minister-travel-netherlands-italy-and-united-kingdom\">The Prime Minister to travel to the Netherlands, Italy, and the United Kingdom</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/un-climate-change-conference/cop26-summit.html\">UN conference on climate action: COP26 in Glasgow</a></li>\n\t<li><a href=\"https://ukcop26.org/\">UK COP26 2021</a></li>\n\t<li><a href=\"https://www.esmap.org/\">Energy Sector Management Assistance Program</a></li>\n</ul></div>\n      "
}