{
  "path": "/en/news/readouts/2022/10/25/prime-minister-justin-trudeau-meets-edmonton-mayor-amarjeet-sohi",
  "pageTitle": "Prime Minister Justin Trudeau meets with Edmonton Mayor Amarjeet Sohi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau and the Minister of Tourism and Associate Minister of Finance, Randy Boissonnault, met with the Mayor of Edmonton, Amarjeet Sohi, to discuss key areas for cooperation.</p>\n\n<p>The leaders explored opportunities to make further progress on shared priorities. This includes partnering with Indigenous Peoples in Edmonton and advancing reconciliation; moving forward on housing initiatives to help address homelessness, including Indigenous displacement; introducing new technologies to reduce emissions, such as Edmonton’s move to test hydrogen-powered buses; and promoting international investment. The Prime Minister highlighted a number of recent investments from the federal government to support people and communities in Edmonton, including under the Rapid Housing Initiative, for zero-emission buses, and for the hydrogen sector.</p>\n\n<p>Prime Minister Trudeau thanked Mayor Sohi for his leadership and both leaders committed to keep working together on these and other shared priorities, notably to advance net-zero technologies and grow Edmonton’s economy.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2022/canada-supports-rapid-housing-projects-edmonton\">Canada supports rapid housing projects in Edmonton</a></li>\n\t<li><a href=\"https://cib-bic.ca/en/projects/public-transit/city-of-edmonton-zero-emission-buses/\">City of Edmonton Zero-Emission Buses</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/06/government-collaboration-supporting-the-future-of-albertas-clean-hydrogen-sector.html\">Government collaboration supporting the future of Alberta’s clean hydrogen sector</a></li>\n</ul></div>\n      "
}