{
  "path": "/en/news/statements/2019/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:&nbsp;</p>\n\n<p>“Today, on the National Day of Remembrance for Victims of Terrorism, we remember every Canadian at home and abroad whose lives were cut short or forever changed by a terrorist attack.&nbsp;</p>\n\n<p>“In 1985, Canadians were stunned by reports of an explosion on Air India Flight 182, bound for the United Kingdom from Canada. The bomb killed the 329 innocent people on board, including 280 Canadians. This despicable act of terror left families and friends grieving the loss of loved ones, and shook our country to its core. It remains the deadliest terrorist attack in Canadian history.&nbsp;</p>\n\n<p>“We have lost many others to acts of terrorism since that day. Those who commit these acts want to sow discord, divide us, and weaken our values. Time after time, they fail. In moments of tragedy, we find out how truly resilient we are. The shared values that unite us – inclusion, compassion, and equality – are stronger than fear and hatred.&nbsp;</p>\n\n<p>“In recent months, we have seen terrorist and extremist online content spill out into the real world with tragic and deadly consequences. We are working hard to modernize and enhance our security efforts and stop violent extremism, both online and offline. Through the <a href=\"https://www.christchurchcall.com/call.html\">Christchurch Call to Action</a>, Canada and countries around the world are stepping up to prevent people from abusing the internet to promote terrorism.&nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I extend my condolences to Canadians who have lost loved ones to terrorist acts. I also want to thank all those – women and men in uniform, the intelligence community, diplomats, and security and law enforcement professionals – who work every day to keep our communities and country safe.”</p></div>\n      "
}