{
  "path": "/en/news/news-releases/2016/09/17/prime-minister-hosts-successful-global-fund-replenishment-conference",
  "pageTitle": "Prime Minister hosts successful Global Fund Replenishment Conference to fight AIDS, Tuberculosis, and Malaria | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is once again taking a leadership role to make a positive difference for the world’s poorest and most vulnerable – in particular women and girls.</p><p>By uniting around a common vision of a better and healthier future, the international community can fight diseases more effectively, and tackle the associated issues – including poverty, lack of access to education, and social and political inequality – which disproportionately impact women, girls, and young people.</p><p>To help accomplish these goals, the Prime Minister, Justin Trudeau, today concluded a successful Fifth Replenishment Conference of the Global Fund to fight AIDS, Tuberculosis, and Malaria, which Canada hosted in Montréal, Quebec.</p><p>The Prime Minister announced that Canada will pledge $804 million to the Global Fund, for 2017 to 2019. In total, the conference raised over $12.9 billion in pledges, a remarkable amount which will be instrumental in ending these devastating diseases as epidemics by 2030.</p><p>Canada is committed to creating a fairer world for the most vulnerable – especially women and girls – and will continue to challenge world leaders to step up and contribute to the Global Fund, and address the gender inequality that fuels these epidemics.</p><h2>Quotes</h2><blockquote><p>“It was inspiring to see so many leaders from every corner of the world come together in Montréal to support the Global Fund. We are honoured to have hosted this conference. Canada will continue to lead by example, and show the world what we can accomplish when we unite in pursuit of a larger goal.”<br>—<cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The impact of AIDS, tuberculosis, and malaria is far reaching, and we know that these diseases disproportionately affect the world’s poorest and most vulnerable, especially women and children. Canada will continue to champion the important work being done to end these epidemics, so that our world’s most vulnerable can turn their efforts to growing their communities and supporting their families.”<br>—<cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Women and girls often bear the brunt of poverty and diseases such as AIDS, tuberculosis, and malaria. To end these epidemics for good, we must address the fear, discrimination, and gender inequality that fuel them. By investing in the Global Fund, we are ensuring that women and girls not only have better health outcomes, but that they are empowered to become positive agents of change in their families, communities, and countries. When we work together, we can truly transform the world. We have demonstrated that here in Montréal.”<br>—<cite>The Honourable Marie-Claude Bibeau, Canada’s Minister of International Development and La Francophonie</cite></p></blockquote><blockquote><p>“The Global Fund is one of the most effective ways Canadians can improve the lives of the world’s poorest, particularly women and girls. I believe it will go down in history as one of humanity’s greatest achievements. Today’s replenishment demonstrates what’s possible when Canada takes a leadership role in development and helps make the world more equitable and secure for all.”<br>—<cite>Bill Gates, Co-Chair, Bill &amp; Melinda Gates Foundation</cite></p></blockquote><blockquote><p>“We have the knowledge and tools to end AIDS, TB, and malaria as epidemics by 2030, but we need to invest smartly and with focus to make it happen. When we work together, we can achieve more than anyone dreamed possible.”<br>—<cite>Mark Dybul, Executive Director of the Global Fund</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Global Fund is the world’s main funding body for activities related to the prevention and treatment of AIDS, tuberculosis, and malaria, and is one of Canada’s key partners in improving global health, specifically the 2030 Agenda for Sustainable Development’s target of ending these three epidemics.</li><li>The Global Fund is a partnership between governments, civil society, the private sector, as well as people affected by three of the world’s most devastating diseases: AIDS, tuberculosis, and malaria.</li><li>The Global Fund raises funding to support programs - run by local experts in countries and communities most in need - that focus on prevention, treatment, care, and the strengthening of health systems. These programs also work to end the gender inequalities that are major drivers of the spread of these three diseases.</li><li>The Global Fund currently supports programs in more than 100 countries which have resulted in an estimated 20 million lives saved since 2002, mostly in Africa, where the burden of disease is greatest. It is on track to save 22 million lives by the end of 2016.</li><li>Replenishment conferences held every three years are the Global Fund’s main mechanism to secure funding.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/news-releases/2016/05/09/canada-host-global-fund-replenishment-conference-fight-aids\">Canada to host Global Fund Replenishment Conference to fight AIDS, Tuberculosis, and Malaria</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.acdi-cida.gc.ca/cidaweb/cpo.nsf/fWebProjListEn?ReadForm&amp;profile=GFATM\">Global Fund to Fight AIDS, Tuberculosis and Malaria - International Development Projects</a></li><li><a href=\"http://international.gc.ca/world-monde/campaign-campagne/gfatm-fmstp/replenishment-conference-reconstitution.aspx?lang=eng\">Fifth Replenishment Conference of the Global Fund to Fight AIDS, Tuberculosis, and Malaria</a></li><li><a href=\"http://www.theglobalfund.org/en/\">The Global Fund</a></li></ul></div>\n      "
}