{
  "path": "/en/news/readouts/2019/11/12/prime-minister-justin-trudeau-meets-saskatchewan-premier-scott-moe",
  "pageTitle": "Prime Minister Justin Trudeau meets with Saskatchewan Premier Scott Moe | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with Saskatchewan Premier Scott Moe today to discuss important priorities. The Prime Minister reaffirmed his commitment to work collaboratively with the provincial government on behalf of the people of Saskatchewan.</p>\n\n<p>The Prime Minister reiterated the Government of Canada’s determination to see the Trans Mountain Expansion (TMX) project completed, and highlighted to the Premier that there are currently over 2,200 people working on its construction outside Edmonton and in Burnaby.&nbsp;He thanked Premier Moe for intervening on the side of the federal government in the British Columbia Court of Appeal on its reference case related to the TMX project.&nbsp;Both are aligned in wanting this project built.&nbsp;In addition to TMX, the Prime Minister highlighted four other major energy projects in western Canada that this government fully supports: Keystone XL, Line 3, LNG Canada and the Manitoba-Minnesota Transmission Line.&nbsp;Taken together, these projects demonstrate Ottawa’s support of Canada’s energy industry.&nbsp; &nbsp;</p>\n\n<p>The Prime Minister invited Premier Moe to provide suggestions for improvements to the <em>Impact Assessment Act</em>, and said he would consider suggestions for improvements to federal transfers, including the Fiscal Stabilization Program. The Prime Minister reminded Premier Moe that the current Equalization formula is the same one that the previous federal government put in place with support of the federal cabinet ministers of the day. The Prime Minister suggested that Premier Moe, in his capacity as Chair of the Council of the Federation, work with all of his fellow premiers to gain consensus on potential changes to the formula.&nbsp;</p>\n\n<p>The Prime Minister reaffirmed the importance of putting a price on pollution as a key part of Canada’s efforts to address climate change, and expressed an openness to work with any provincial government that plans to meet the federal benchmark; he also noted the net benefits Saskatchewan residents will receive from Climate Action Incentive payments. The Prime Minister and Premier Moe also discussed infrastructure investments that governments are making in Saskatchewan through the Investing in Canada Plan, and reviewed a number of other issues of national importance, including ensuring market access for Canadian agricultural products in China and diversifying international trade.&nbsp;</p>\n\n<p>The Prime Minister said he looks forward to hearing about the discussions from the premiers’ meeting next month, which Premier Moe will chair, and to seeing Premier Moe at a First Ministers’ Meeting in the new year.&nbsp;</p></div>\n      "
}