{
  "path": "/en/news/news-releases/2021/06/17/prime-minister-announces-nomination-honourable-mahmud-jamal-supreme",
  "pageTitle": "Prime Minister announces the nomination of the Honourable Mahmud Jamal to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of the Honourable Mahmud Jamal to the Supreme Court of Canada.</p>\n\n<p>Justice Jamal had a distinguished career as a litigator with a deep commitment to pro bono work prior to his appointment to the Court of Appeal for Ontario in 2019. He appeared in 35 appeals before the Supreme Court of Canada on civil, constitutional, criminal, and regulatory issues. He also taught constitutional law at McGill University and administrative law at Osgoode Hall Law School. He is bilingual.</p>\n\n<p>The Minister of Justice and Attorney General of Canada and the Chairperson of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments will soon appear before a special hearing of the House of Commons Standing Committee on Justice and Human Rights to discuss the selection process and the reasons for the nomination.</p>\n\n<p>Members of the House of Commons Standing Committee will then take part in a question and answer period with the nominee, joined by the Standing Senate Committee on Legal and Constitutional Affairs and a member of the Green Party of Canada. This session will be moderated by Marie-Eve Sylvestre, Dean of the Civil Law section at the University of Ottawa’s Faculty of Law.</p>\n\n<p>This nomination will fill the vacancy created by the upcoming retirement of Justice Rosalie Silberman Abella. It represents the fourth nomination under the Supreme Court appointment process launched by the Government of Canada in 2016 to promote greater openness, transparency, and accountability.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am pleased to announce the nomination of Justice Mahmud Jamal to the Supreme Court of Canada. Respected around the world, Canada’s Supreme Court is known for its strength, independence, and judicial excellence. I know that Justice Jamal, with his exceptional legal and academic experience and dedication to serving others, will be a valuable asset to our country’s highest court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The selection process was launched on February 19, 2021, to fill the vacancy created by the upcoming retirement of Justice Rosalie Silberman Abella.</li>\n\t<li>Under the requirements of the <em>Supreme Court Act</em>, the process was open only to qualified applicants from Ontario. Candidates submitted applications, and a shortlist was developed.</li>\n\t<li>During the selection process, the non-partisan Independent Advisory Board for Supreme Court of Canada Judicial Appointments identified jurists of the highest calibre who were functionally bilingual and met the statutory eligibility requirements for an Ontario seat.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"913ecfba-d7d7-4575-afc9-aab2205a21c6\" href=\"/en/news/backgrounders/2021/06/17/honourable-mahmud-jamal\">The Honourable Mahmud Jamal</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://fja-cmf.gc.ca/scc-csc/2021/nominee-candidat-eng.html\">Candidate questionnaire filled out by the Honourable Mahmud Jamal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/19/prime-minister-launches-process-select-next-justice-supreme-court\">Prime Minister launches process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/index-eng.html\">Supreme Court of Canada Appointment Process</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/qualifications-eng.html\">Qualifications and Assessment Criteria for Supreme Court of Canada Appointments</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/questions-eng.html\">Frequently Asked Questions</a></li>\n\t<li><a href=\"https://www.scc-csc.ca/home-accueil/index-eng.aspx\">Supreme Court of Canada</a></li>\n</ul></div>\n      "
}