{
  "path": "/en/news/statements/2021/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p>\n\n<p>“Today, we celebrate the beginning of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a>, a time to honour the legacy of Black Canadians, past and present, and reflect on the many contributions they have made to our country.</p>\n\n<p>“In February 2021, we mark the 25th celebration of Black History Month in Canada. We owe this to the Hon. Jean Augustine, the first Black woman elected to the House of Commons. This year also marks the 75th anniversary of Viola Desmond resisting racial segregation and fighting injustice in Nova Scotia.</p>\n\n<p>“Black people have helped shape our history and collective identity, and stood proud as leaders in communities across the country. Despite all this, systemic anti-Black racism still exists in Canada, and has undermined the livelihoods of Black Canadians and caused deep pain. Many in our communities continue to face discrimination, hate, and a lack of opportunity and resources every day. This needs to stop.</p>\n\n<p>“This year’s theme – The Future is Now – reminds us of the importance of learning about Black experiences in Canada, recognizing and addressing injustices, and building back better together, especially as we recover from the global COVID-19 pandemic. This is also an opportunity to highlight the incredible impact of young Black change makers who took to the streets last year and continue to fight to make a difference. We felt their anger, heartbreak, and frustration, and heard their calls for accountability, justice, and equality. With the pandemic further highlighting social, health, and economic disparities for racialized Canadians, religious minorities, and Indigenous peoples, we know we must act now to address these complex and long-standing issues.</p>\n\n<p>“We’ve been taking concrete action to help empower Black communities across the country by investing in capacity building, addressing the root causes of inequalities, and building an economy that works for everyone. Last year, we launched Canada’s first-ever <a href=\"http://www.ic.gc.ca/eic/site/150.nsf/eng/home\">Black Entrepreneurship Program</a>, through which we are investing up to $93 million to help ensure Black business owners and entrepreneurs receive equitable access to support opportunities, while helping them recover from the pandemic and grow their businesses. Through our <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a>, we will continue to address anti-Black racism and systemic inequalities in Canada, including in our criminal justice system. More still needs to be done and the government remains committed to this work.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to take part in online events for Black History Month to reflect on the challenges and accomplishments of Black Canadians, and to learn more about the vital role they continue to play in building a stronger, fairer, and more inclusive country. We will continue to listen to communities and combat anti-Black racism and all forms of racism, discrimination, and xenophobia.”</p></div>\n      "
}