{
  "path": "/en/news/statements/2022/09/07/statement-prime-minister-200th-anniversary-brazils-independence",
  "pageTitle": "Statement by the Prime Minister on the 200th anniversary of Brazil’s independence | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 200th anniversary of Brazil’s independence:</p>\n\n<p>“Two hundred years ago today, Brazil gained its independence. Today, we join Brazilian communities in Canada and around the globe in celebrating this important milestone and recognizing the many contributions Brazilian people have made around the world.</p>\n\n<p>“Relations between Canada and Brazil can be traced to 1866, before Confederation, when the first Canadian trade office opened in Brazil. Our diplomatic ties were officially established with the opening of the Brazilian embassy in Ottawa in 1941 and our embassy in Brazil three years later. During the Second World War, Canadian and Brazilian soldiers fought as partners to help liberate Europe from Nazi Germany, creating strong bonds between our two countries that endure to this day.</p>\n\n<p>“Over the years, the bonds between Canada and Brazil have been further strengthened through partnership in regional and multilateral institutions such as the G20, the Organization of American States, and the United Nations. We also collaborate on a range of issues, including supporting refugees and migrants to promote peace and stability throughout the Americas, expanding trade and investment to foster economic growth and benefit everyone, and promoting agricultural innovation to support food security globally.</p>\n\n<p>“Our two countries are united by strong people-to-people ties, with more than 120,000 people of Brazilian descent living in Canada today. Their many contributions to our social, cultural, and economic fabric help make Canada stronger, more diverse, and more inclusive. Canada is also proud to be one of the top destinations for young Brazilians choosing to study abroad, and we are committed to further strengthening academic and scientific exchanges between our two countries.</p>\n\n<p><a name=\"_Hlk112333799\" id=\"_Hlk112333799\">“</a>On behalf of the Government of Canada, Sophie and I extend our best wishes to all those celebrating Brazil’s Independence Day.</p>\n\n<p>“Feliz Dia da Independência!”</p></div>\n      "
}