{
  "path": "/en/news/statements/2017/08/19/statement-prime-minister-world-humanitarian-day",
  "pageTitle": "Statement by the Prime Minister on World Humanitarian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Humanitarian Day:</p><p>“Today, we join the United Nations in recognizing the humanitarian workers who risk their lives to protect the millions of civilians affected by crises around the world, and who uphold the humanitarian principles of neutrality, impartiality, and independence. &nbsp;</p><p>“Rising insecurity, poverty, and the impacts of persecution and climate change have led to incredibly complex and protracted crises globally. More people are displaced today, fleeing conflict and violence, than at any time since the Second World War.</p><p>“Escalating unrest and violence have made humanitarians’ lifesaving work even more difficult and dangerous. Aid workers brave kidnapping, roadside bombs, and countless other threats. They can lack reliable access to basic amenities like electricity and running water, and suffer greater risk of exposure to infectious disease.</p><p>“In the face of these challenges, humanitarians deliver vital assistance, relief, and hope to millions of people. They do so without discrimination based on race, ethnic origin, religion, sex, or any other factor – setting an example for all of us.</p><p>“The people workers help are often among the world’s most vulnerable, including women and girls, who bear different and disproportionate effects of violent conflict and natural disaster. Recognizing these unequal burdens, Canada has refocused its international assistance – through the new Feminist International Assistance Policy – to promote gender equality and better assist the unique needs of women and girls in crisis situations.</p><p>“Many humanitarian crises are rooted in enduring divisions and inequality. As an international community, we have a responsibility to show that diversity and inclusion are strengths – and a force that can vanquish intolerance, radicalism, and hate.</p><p>“On behalf of the Government of Canada, I thank Canadian aid workers and all those engaged in humanitarian efforts around the world. In extremely difficult circumstances, you support those in need, and stand up for the dignity and potential of all human beings.”</p></div>\n      "
}