{
  "path": "/en/news/readouts/2021/07/14/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss wildfires and extreme weather across the country | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the wildfires and extreme weather conditions in Northwestern Ontario, Western Canada, and Yukon. The Prime Minister and all ministers reiterated that supporting Canadians affected by the devastating wildfires and taking all necessary measures to help them get through these difficult times remains their number one priority.</p>\n\n<p>Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Transport Omar Alghabra, and Minister of Indigenous Services Marc Miller provided an update on the situation in B.C., where wildfires have devastated the community of Lytton and are threatening several other communities throughout the province. The Prime Minister and all ministers reflected on the lessons learned from the Lytton tragedy, including on issues related to information sharing with communities and the public, and inclusivity in emergency management systems. They agreed on the need to better engage communities, including Indigenous communities, as well as private sector operators, both before, during, and in the aftermath of emergencies, and to work with provinces and territories to further refine how we work together to ensure a fast and effective response to wildfires and floods.</p>\n\n<p>Minister Alghabra gave an overview of the work underway to address safety issues related to rail transportation infrastructure across Canada, starting with B.C., and the actions needed to maintain strong supply chains when rail transportation is suspended during emergencies. The Prime Minister asked ministers to continue to proactively engage their provincial and territorial counterparts as well as Indigenous communities and private sector operators to further determine and address how to prevent and mitigate the impacts of the wildfires on communities and critical infrastructure in order to keep people safe.</p>\n\n<p>Minister Blair and Minister of Natural Resources Seamus O’Regan Jr. provided a broader outlook on wildfires and flooding across the country throughout the summer months.&nbsp;In addition to B.C., they noted that Alberta, Saskatchewan, Manitoba, and Yukon remain under significant threat from wildfires, and that Northwestern Ontario is also now dealing with several active wildfires and increased evacuations, particularly involving Indigenous communities. Minister Blair highlighted the important work being delivered by the Government Operations Centre to process provincial and territorial requests for assistance expeditiously. The Prime Minister and ministers discussed strategies to ensure such requests can continue to be processed effectively and in a rapid manner.</p>\n\n<p>Minister of National Defence Harjit Sajjan provided an overview of the readiness of the Canadian Armed Forces (CAF) to assist in responding to emergencies across the country and highlighted the support being given by the CAF in response to the floods in Yukon. The Prime Minister thanked the CAF for their exceptional help and support to Canadians both throughout the pandemic and in response to these extreme events.</p>\n\n<p>The Prime Minister and all ministers agreed on the need to continue to work closely with provinces, territories, private sector operators, and Indigenous communities to further improve communications around impacts, resources, and response and recovery efforts. The Government of Canada will continue to monitor the situation throughout the coming weeks and provide the necessary resources as needed to protect the health and safety of Canadians across the country.</p>\n\n<h2>Information for evacuees</h2>\n\n<ul>\n\t<li>Service Canada has made the Outreach Support Centre (OSC) available for evacuees to access government assistance. Any Canadians seeking to access Employment Insurance (EI) due to lost employment, replace lost documents or redirect&nbsp;existing pension or other benefits should call 1&nbsp;800&nbsp;O-Canada (1-800-622-6232) during working hours. Under the <em>Federal Emergency Response Plan</em>, the Government of Canada maintains delivery of financial compensation, social benefits, and access to key programs and services such as EI, Old Age Security (OAS), and Canada Pension Plan (CPP), as well as document replacement such as SIN cards and passports, with as little disruption as possible.</li>\n</ul>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/07/government-of-canada-provides-federal-assistance-to-british-columbia-for-wildfires.html\">Government of Canada provides federal assistance to British Columbia for wildfires</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/07/government-of-canada-provides-wildfire-evacuation-support-to-residents-of-poplar-hill-first-nation.html\">Government of Canada provides wildfire evacuation support to residents of Poplar Hill First Nation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/07/government-of-canada-and-government-of-british-columbia-to-establish-donation-matching-with-the-canadian-red-cross-for-bc-wildfires.html\">Government of Canada and Government of British Columbia to establish donation-matching with the Canadian Red Cross for BC wildfires</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/07/minister-of-transport-announces-precautionary-measures-to-address-safety-concerns-resulting-from-extreme-weather-and-wildfire-risks.html\">Minister of Transport announces precautionary measures to address safety concerns resulting from extreme weather and wildfire risks</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2021/07/statement-by-ministers-committing-to-on-going-engagement-with-first-nations-affected-by-wildfires-in-british-columbia-and-additional-resources-to-a.html\">Statement by Ministers Committing to On-going Engagement with First Nations Affected by Wildfires in British Columbia and Additional Resources to Advance Emergency Response Measures</a></li>\n</ul></div>\n      "
}