{
  "path": "/en/news/readouts/2023/02/09/prime-minister-justin-trudeau-meets-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with Prince Edward Island Premier Dennis King to discuss shared priorities.</p>\n\n<p>The Prime Minister and Premier reiterated their commitment to work together to improve the health care system for Islanders and all Canadians and spoke about the additional federal funding which will help deliver concrete outcomes. This includes prioritizing investments in mental health, long-term care, and community care, and promoting greater transparency and accountability on results for Canadians.</p>\n\n<p>The two leaders discussed&nbsp;Prince Edward Island’s Climate Adaptation Plan and&nbsp;post-Hurricane Fiona recovery. The Prime Minister commended the Premier on his leadership on climate change. They also highlighted the collaboration on projects that will increase the resilience of P.E.I.’s infrastructure and mitigate against the impacts of future hurricanes and other extreme weather events.&nbsp;</p>\n\n<p>The Prime Minister and the Premier also spoke about support for P.E.I.’s clean technology sector and bioscience sector as well as making meaningful investments in infrastructure and housing. The leaders discussed affordability issues, notably tolls on the Confederation Bridge and Wood Islands ferry as well as programs to support those most in need.</p>\n\n<p>Prime Minister Trudeau and Premier King agreed to stay in close contact on these important priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul class=\"Indent1\">\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/27/prime-minister-justin-trudeau-meets-prince-edward-island-premier-dennis\">Prime Minister Justin Trudeau meets with Prince Edward Island Premier Dennis King</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/04/rebuilding-after-hurricane-fiona\">Rebuilding after Hurricane Fiona</a></li>\n</ul></div>\n      "
}