{
  "path": "/en/news/readouts/2022/09/21/prime-minister-justin-trudeau-meets-president-moldova-maia-sandu",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Moldova Maia Sandu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Moldova, Maia Sandu, on the margins of the 77th Session of the United Nations General Assembly.</p>\n\n<p>Prime Minister Trudeau commended Moldova for its ongoing response to the crisis in Ukraine and its continued humanitarian efforts to assist those fleeing Russia’s violence. He reaffirmed the importance of the Moldova Support Platform and Canada’s ongoing support to help mitigate the pressures of the humanitarian crisis on Moldova and its institutions.</p>\n\n<p>The two leaders highlighted the strong bilateral relations between Canada and Moldova. President Sandu shared Moldova’s interest in joining the European Union.</p>\n\n<p>Prime Minister Trudeau and President Sandu thanked one another for their mutual cooperation and looked forward to meeting again in the near future.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/romania-roumanie/bilateral_relations_bilaterales/canada_moldova.aspx?lang=eng\">Canada-Republic of Moldova Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/26/prime-minister-justin-trudeau-speaks-president-moldova-maia-sandu\">Prime Minister Justin Trudeau speaks with President of Moldova Maia Sandu</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/17/prime-minister-attend-united-nations-general-assembly-new-york\">Prime Minister to attend United Nations General Assembly in New York</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}