{
  "path": "/en/news/statements/2017/06/11/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement for National Public Service Week, which runs from June 11 to 17, 2017:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Every day, Canada’s public servants work hard to strengthen the middle class, deliver services to Canadians, and help tackle the challenges we face as a country. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Over the past year, federal public servants have negotiated international trade agreements, responded to the wildfire in Fort McMurray and the flooding that struck many communities, and helped Syrian refugees resettle here, in their new country. No matter the challenge, they rise to the occasion, and put the needs of Canadians at the centre of all they do.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“At the same time, public servants have experienced many hardships caused by the implementation of the Phoenix pay system. This problem is unacceptable, and we are working tirelessly to make sure every employee gets the pay they are owed.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year’s theme is ‘Proudly Serving Canadians for 150 years’. As we mark the 150<sup>th</sup> anniversary of Confederation, we honour the tremendous work of our federal public servants and their important contributions to building our nation. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“With passion, professionalism, and an unwavering commitment to Canadians, federal public servants often go above and beyond in their work in all regions of the country. They play a vital role in our democracy, and have become the envy of governments around the world.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“As we look ahead to the next 150 years, we remain committed to a world-class Public Service that is modern, efficient, and reflects the diversity of the people and country it serves. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“To federal public servants, I say thank you. You play an integral role in our society, and your hard work and dedication benefit us all. I look forward to continuing to work with you to strengthen the middle class and build a Canada where everyone has a chance to succeed.”</span></p></div>\n      "
}