{
  "path": "/en/news/statements/2016/10/01/statement-prime-minister-canada-womens-history-month",
  "pageTitle": "Statement by the Prime Minister of Canada for Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Women’s History Month:</p>\n<p>“This October, I am pleased to join Canadians from coast to coast to coast to celebrate Women’s History Month.</p>\n<p>“This year’s theme – <em>Because of Her</em> – gives all Canadians the chance to recognize and appreciate the significant achievements and contributions women have made to our great country.</p>\n<p>“Despite historical hurdles and barriers, women have taken their place – as politicians and advocates, as entrepreneurs and leaders, as artists and academics – pushing for advances and changes that have benefited us all.</p>\n<p>“The Government of Canada has chosen to make gender equality a priority. We formed Canada’s first gender-balanced cabinet, and appointed the first woman Government House leader as well as the first ever Minister fully dedicated to gender issues. Our government has embraced the opportunity to serve on the UN Commission on the Status of Women, and we are ardent supporters of the UN Women’s HeforShe campaign. I am honoured to be the youth ambassador for HeforShe. In this role I will advocate for both gender equality and the full support and involvement of youth around the world – youth who can help us achieve gender equality faster and more effectively.</p>\n<p>“Our government will also continue to support the implementation of gender-based analysis across government departments to ensure gender implications are considered in all government policies, programs, and legislation.</p>\n<p>“While we celebrate the progress made, we remain keenly aware of the important work that still needs to be done to achieve true gender equality. By highlighting stories of how women have shaped our lives, we can inspire both current and future generations to continue to fight for a society in which all people feel empowered, and have the same opportunities to reach their full potential.</p>\n<p>“On behalf of the Government of Canada, Sophie and I encourage all Canadians to join us in celebrating Women’s History Month. I also urge you to become part of the Government of Canada’s #BecauseofHer campaign, to share and learn more about all of the remarkable women – past and present – who have influenced us, and who have helped build a better, stronger, and much more inclusive Canada.”</p></div>\n      "
}