{
  "path": "/en/news/statements/2021/11/20/statement-prime-minister-death-honourable-josee-forest-niesing",
  "pageTitle": "Statement by the Prime Minister on the death of the Honourable Josée Forest-Niesing | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Josée Forest-Niesing, Senator for Ontario:</p>\n\n<p>“It is with sadness that I learned today of the passing of Josée Forest-Niesing, Senator for Ontario.</p>\n\n<p>“A proud Franco-Ontarian of Métis heritage, Senator Forest-Niesing was called to the Ontario Bar in 1990. For nearly 20 years, she led cases through trial, in her hometown of Sudbury and other communities, specializing in family law, estate law, and employment law. A dedicated lawyer, she was also a former judge of Ontario’s Superior Court of Justice Small Claims Court and a member of several professional associations, including the Association des juristes d’expression française de l’Ontario (AJEFO), for which she served two terms as President. She had been appointed to the Senate in 2018.</p>\n\n<p>“Throughout her life, Senator Forest-Niesing passionately defended and promoted access to justice and public services in both official languages as well as in sign language, including for Indigenous communities. She contributed to her community as an active member or chair of numerous boards of directors, notably for the Art Gallery of Sudbury, the Carrefour francophone de Sudbury, and the University of Sudbury. She was the founding chair of the Centre canadien de français juridique, a former chair of the Ontario Bar Association’s Official Languages Committee, and a recipient of the AJEFO’s Order of Merit. She was inducted into the University of Ottawa’s Common Law Honour Society in 2013 and had been appointed to the Ontario Arts Council in 2018.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our deepest condolences to the family, friends, and colleagues of Senator Forest-Niesing, a dedicated public servant and a champion for minority language communities.”</p></div>\n      "
}