{
  "path": "/en/news/news-releases/2018/05/04/canadas-investment-toyota-supports-thousands-jobs-ontario",
  "pageTitle": "Canada’s investment in Toyota supports thousands of jobs in Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>With its talented workers, world-class companies, and innovative technologies, Canada’s auto sector is well positioned to design and build cars that meet the needs of people today and tomorrow.</p><p>The Prime Minister, Justin Trudeau, today announced a $110 million investment to support Toyota Motor Manufacturing Canada’s $1.4&nbsp;billion investment in its Cambridge and Woodstock plants. Prime Minister Trudeau was joined at the announcement by the Premier of Ontario, Kathleen Wynne.</p><p>The investment will support more than 8,000 jobs in Southwestern Ontario, and will create 450 new jobs as well as 1,000 new co-op placements. Toyota will also invest $200 million in Canadian research and development over ten years. Together, these actions will help maintain and create good, well-paying jobs for the middle class, and promote economic growth and long-term prosperity.</p><p>Toyota’s investment will bring a new advanced manufacturing platform to the company’s plants in Ontario. Once complete, Canada will be the North American hub for the RAV4 and home to Toyota’s largest hybrid vehicle production in North America.</p><h2>Quotes</h2><blockquote><p>“Companies have confidence in Canada and Canadian workers, and know that we are ready to build the cars of the future. Today’s investment will support thousands of jobs for Canadians, and keep our auto sector globally competitive and at the centre of the growing demand for hybrid cars. We welcome Toyota’s decision to invest in our highly skilled workforce and expand its presence in Canada. This is a smart decision that further establishes our country as the place where cars of the future are built.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Ontario's $110 million investment in Toyota is about making sure our province stays competitive during a time of rapid economic change, and building the kind of global partnerships that support long-term prosperity. This partnership will establish Cambridge and Woodstock as the North American manufacturing hub for Toyota's RAV4, including hybrid versions. This is a vote of confidence in our highly-skilled, talented workforce, and our entire province.”<br>—<cite>Kathleen Wynne, Premier of Ontario</cite></p></blockquote><blockquote><p>“Toyota Motor Manufacturing Canada has always had a strong partnership with the Canadian government. With 30 years of manufacturing experience, our success is a result of TMMC team members, who are known for their dedication, high levels of skill, and challenge mindset. We're aggressively adopting new technology and innovative processes to ensure our ongoing success.”<br>—<cite>Fred Volf, President of Toyota Motor Manufacturing Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The vehicles to be manufactured at Toyota’s plants will be significantly more fuel efficient, and select process improvements within the manufacturing process will reduce volatile organic compound emissions in select shops by 10 per cent.</li><li>Toyota built 153 cars the first year it began manufacturing in Canada in 1988. Today, the plants in Cambridge and Woodstock can produce more than half a million vehicles every year – making Toyota Motor Manufacturing Canada the largest automotive manufacturer in Canada.</li><li>This project is funded under the Strategic Innovation Fund, a $1.26 billion program to support research, development, and commercialization of new products that pave the way for Canada as a global innovation leader and attract investments that create jobs. The Government of Canada launched the Strategic Innovation Fund in Budget 2017 to ensure Canada remains a top destination for businesses to invest, grow, and create jobs.</li><li>In addition to the Strategic Innovation Fund, we continue to invest in key programs and services to help businesses innovate, create jobs, and grow Canada’s economy.</li><li>With a simple, story-based user interface, the new Innovation Canada platform can match businesses with the most fitting programs and services in about two minutes.</li><li>The automotive sector is Canada’s largest export industry, supporting over 500,000 jobs and contributing $18 billion annually to our economy.</li><li>On average, the Canadian auto sector manufactures one car every 13 seconds.</li><li>This is the largest of several recent investments in the Canadian auto sector. Recent investments include:<ul><li>In March 2017, with support from the federal and provincial governments, Ford Motor Company of Canada announced more than $1 billion in investments, including the establishment of a new connected vehicle research centre, and the creation and maintenance of almost 800 jobs.</li><li>In January 2017, also with support from the federal and provincial governments, Honda of Canada Manufacturing launched a project worth $492 million that will maintain Canadian jobs by supporting advanced and clean technologies.</li><li>In June 2016, General Motors announced an increase in spending for research and development, which will increase its total number of software engineers in Canada to 1,000.</li></ul></li></ul><h2>Associated Link</h2><ul><li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/programs/strategic-innovation-fund.html\">Strategic Innovation Fund</a></li></ul></div>\n      "
}