{
  "path": "/en/news/statements/2018/04/07/statement-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</p><p>“Today, as we celebrate the 70<sup>th</sup> anniversary of the founding of the World Health Organization, we recommit ourselves to a world where everyone has access to the health care they need.</p><p>“The theme for this year’s <a href=\"http://www.who.int/campaigns/world-health-day/2018/en/\">World Health Day</a> – <i>Universal health coverage: everyone, everywhere</i> – reminds us of the importance of health care that leaves no behind.</p><p>“In Canada, Medicare is a source of pride and, more importantly, a system we can all count on, without risk or fear of financial hardship. But for almost half of the world’s population, universal health care coverage remains a distant reality. Every day, countless people must make the choice to pay for health care or go without. Too many people simply have no access to essential health services at all.</p><p>“At home, we are working with provinces and territories to improve the accessibility and affordability of prescription medications. As part of Budget 2018, we created an Advisory Council on the Implementation of National Pharmacare to recommend options on how to move forward on this important project. Budget 2018 also pledges over $1.5 billion over five years to help close the gaps in the health outcomes between Indigenous and non-Indigenous people.</p><p>“In support of better health outcomes around the world, we adopted the United Nations’ <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">2030 Agenda for Sustainable Development</a>, which aims to create a healthier, safer, and more prosperous world by the year 2030. Budget 2018 reaffirmed Canada’s commitment to achieve these goals, and provided targeted funding of $109.2&nbsp;million over 13 years to support their implementation. In addition, Budget 2018 provided new support to the International Assistance Envelope, which will strengthen Canada’s ability to deliver on the Feminist International Assistance Policy and help close persistent health gaps for women and girls. We believe that everyone should have access to quality health care, proper nutrition, and education, regardless of gender.</p><p>“Everyone – no matter where they live – should have access to essential health services. Canada will continue to work with our domestic and international partners to promote health care that is high quality, affordable, and available to all.”</p></div>\n      "
}