{
  "path": "/en/news/news-releases/2020/11/25/prime-minister-announces-special-envoy-preserving-holocaust",
  "pageTitle": "Prime Minister announces Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Holocaust was one of the darkest chapters in human history. Seventy-five years after the liberation of Nazi concentration and extermination camps revealed the full horrors of the Holocaust, Jewish communities in Canada and around the world face rising antisemitism. The Government of Canada will always stand with the Jewish community, and fight the antisemitism, hatred, and racism that incites such despicable acts. We will also continue to preserve the stories of survivors through younger generations, and work to promote and defend pluralism, inclusion, and human rights.</p>\n\n<p>That is why Prime Minister Justin Trudeau today named the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism.</p>\n\n<p>The Government of Canada is committed to reinforcing and strengthening Canada’s efforts to advance Holocaust education, remembrance and research, and to combat antisemitism as key elements of the promotion and protection of human rights at home and abroad.</p>\n\n<p>With a longstanding record of leadership in the fight against racism, antisemitism, and hate, and extensive experience in human rights and justice including in cases related to mass atrocities, Mr. Cotler will lead the Government of Canada’s delegation to the International Holocaust Remembrance Alliance (IHRA). He will work with other member countries and both domestic and international partners to strengthen and promote Holocaust education, remembrance, and research in Canada and around the world.</p>\n\n<p>On June 25, 2019, Canada adopted IHRA’s working definition of antisemitism as part of its anti-racism strategy. As Special Envoy, Mr. Cotler will also support advocacy and outreach efforts with Canadians, civil society, and academia to advance the implementation of this definition across the country and its adoption internationally.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We must never forget the painful lessons of the Holocaust, or the memories of those who lived through it. As Canada’s first Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism, Irwin Cotler will use his vast knowledge and experience to promote Holocaust education, remembrance, and research as we continue working with partners in Canada and around the world to fight against hate and intolerance. Because antisemitism has no place in Canada – or anywhere else.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism will work with the Minister of Foreign Affairs, the Minister of Diversity and Inclusion and Youth, and other implicated ministers to inform Government of Canada policy and programming.</li>\n\t<li>The International Holocaust Remembrance Alliance (IHRA) is an intergovernmental organization dedicated to strengthening, advancing, and promoting Holocaust education, research, and remembrance.</li>\n\t<li>The IHRA includes 34 member countries, and eight partner organizations with Holocaust-related issues as part of their mandate. Canada joined the IHRA in 2009.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/11/25/honourable-irwin-cotler\">Irwin Cotler</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement.html\">Canada's Anti-Racism Strategy</a></li>\n\t<li><a href=\"https://www.holocaustremembrance.com/\">International Holocaust Remembrance Alliance</a></li>\n</ul></div>\n      "
}