{
  "path": "/en/news/statements/2017/10/02/statement-prime-minister-welcome-canadas-new-governor-general-right",
  "pageTitle": "Statement by the Prime Minister to welcome Canada’s new Governor General, the Right Honourable Julie Payette | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome Canada’s new Governor General, the Right Honourable Julie Payette:</p><p>“It is my honour to welcome, on behalf of all Canadians, Canada’s 29<sup>th</sup> Governor General, Her Excellency the Right Honourable Julie Payette.</p><p>“In welcoming Her Excellency, we also honour Her Majesty Queen Elizabeth II, the Queen of Canada. This is the 12<sup>th</sup> Governor General whose appointment was made by Her Majesty during her 65 year reign. We honour her commitment to ensuring that this office is held by an individual who represents the best of our country.</p><p>“Many Canadians already know much of the story of Her Excellency’s life – a story that testifies to her talent and drive, and marks her as a truly exceptional Canadian. Her Excellency flew two missions to space, was Chief Astronaut for the Canadian Space Agency, and proudly carried the Olympic flag during the opening ceremonies of the Vancouver 2010 Winter Olympics. As the second Canadian woman in space and only the fourth woman Governor General, Her Excellency has been and continues to be a trailblazer and an inspiration for all of us.</p><p>“Her Excellency’s knowledge, determination, and curiosity about the world around her led her to achieve her dreams – and in doing so, she showed a whole country that their dreams were within reach, too. Her Excellency’s achievements are a testament to her hard work, discipline, and passion, and her work has been recognized with many distinctions and 27 honorary doctorates. As an astronaut, engineer, scientific broadcaster, and corporate director, Her Excellency has proven herself to be a tireless and respected leader, a team player, and a powerful agent of change.</p><p>“Above all, Her Excellency represents the very best of what it means to be Canadian. She embodies dedicated service and a commitment to integrity. In her new role, she will continue to do vital work to promote our unique Canadian identity. She will travel to communities across the country to discuss with Canadians the issues that matter to them and to honour those who demonstrate exceptional service to their communities and our world.</p><p>“As Commander-in-Chief, she will help highlight the importance of Canada’s military and the selfless sacrifices of its members and their families. Her Excellency will also represent Canada while visiting and hosting international dignitaries, to further strengthen our links with countries and people around the world.</p><p>“This has been an important year for Canada. The 150<sup>th</sup> anniversary of Confederation has given us an opportunity to reflect on our past and present, as well as on our dreams and aspirations for our future. Her Excellency will help us realize these shared hopes for tomorrow. Her life has already inspired so many to dream big, push boundaries, and explore what exists beyond the here and now. I have no doubt that she will excel at representing this wonderful country and continue to inspire countless Canadians in her new role.</p><p>“On behalf of the Government of Canada, I thank Her Excellency for accepting this call to service. We look forward to seeing her fulfill her mandate while engaging Canadians on our path forward and promoting the values that make this country strong.</p><p>“I also join all Canadians to again extend our sincere gratitude to the Right Honourable David Johnston and Mrs. Sharon Johnston for their service over the past seven years. Their grace, dedication, and humility will continue to inspire us.”</p><h2>Associated Link</h2><ul><li><a href=\"/en/news/statements/2017/09/28/statement-prime-minister-thank-outgoing-governor-general-canada-his\">Statement by the Prime Minister to thank the outgoing Governor General of Canada, His Excellency the Right Honourable David Johnston</a></li></ul></div>\n      "
}