{
  "path": "/en/news/news-releases/2021/11/12/prime-minister-concludes-participation-2021-apec-economic-leaders",
  "pageTitle": "Prime Minister concludes participation at 2021 APEC Economic Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in a virtual meeting with leaders of the Asia-Pacific Economic Cooperation (APEC). This meeting brought together leaders from member economies across the Pacific Ocean and focused on creating an inclusive, sustainable, and prosperous region for all. The leaders issued the following declaration:</p>\n\n<p>We, the Economic Leaders of APEC met on 12 November 2021. The COVID-19 pandemic continues to take lives and impact livelihoods. The evolving nature of the COVID-19 pandemic and its variants will create ongoing uncertainty and an uneven economic recovery across the Asia-Pacific region. Responding to this deepest of challenges has been a top priority in 2021. In this regard, we are taking steps to ensure growth rebounds quickly and to boost the global economic recovery.</p>\n\n<p>This year Asia-Pacific Economic Cooperation (APEC) economies have reaffirmed their commitment to join together; to respond to the immediate crisis generated by the pandemic through urgent work; and to strengthen our cooperation so that our region can return to growth in a way that is more innovative, inclusive and sustainable.</p>\n\n<h2>Responding to COVID-19</h2>\n\n<p>In July, we met to discuss APEC’s response to the COVID-19 pandemic. We recognised the inequities in widespread access to COVID-19 vaccines, and therefore, we continue to strongly support equitable access to safe, effective, quality-assured and affordable COVID-19 vaccines, diagnostics, therapeutics, and other related essential medical products. Because nobody is safe until everyone is safe, we are determined to ensure extensive immunisation of our people against COVID-19 as a global public good. It remains a priority that we expand vaccine manufacture and supply.</p>\n\n<p>In this context, we have demonstrated that trade and investment is a critical enabler for addressing the impact of the COVID-19 pandemic and ensuring our economies recover stronger. APEC members will continue work to:</p>\n\n<ul>\n\t<li>Support global efforts to share vaccines equitably and expand vaccine manufacture and supply, including through the voluntary transfer of vaccine production technologies on mutually agreed terms.</li>\n\t<li>Facilitate trade in COVID-19 vaccines and related essential medical products, including by embedding digitalised trade facilitation measures and implementing best practices in customs procedures.</li>\n\t<li>Build understanding and transparency of the types of border measures taken in response to the pandemic and encourage the elimination of unnecessary export restrictions and other non-tariff barriers.</li>\n\t<li>Voluntarily reduce the cost of COVID-19 vaccines and related essential COVID-19 medical goods.</li>\n\t<li>Ensure that the TRIPS Agreement supports efforts to research, develop, invest in, manufacture, and distribute, more COVID-19 vaccines.</li>\n\t<li>Seek a pragmatic, effective, and forward-looking multilateral response to COVID-19 at the 12th World Trade Organization (WTO) Ministerial Conference at the end of this month.</li>\n</ul>\n\n<p>Much of the Asia-Pacific’s growth has been stimulated by the ability of people to move across borders for business, tourism, and education. As a result of restrictions on the cross-border movement of people due to the COVID-19 pandemic, unrealised economic activity losses have been substantial. As we each look at reopening without undermining efforts to prevent the spread of COVID-19, we support APEC playing a greater role in promoting information exchange and coordination measures related to cross-border movement of people, including in relation to air and maritime crew, and COVID-19 testing and vaccination certificates. We will work towards tangible outcomes in 2022.</p>\n\n<p>We are strengthening our health systems to respond to the COVID-19 pandemic and prepare for future health threats. We recognise the importance of maintaining ongoing essential health services, improving digital solutions, pursuing increased health equity and our goal to achieve universal health coverage. We support deeper regional and international collaboration on COVID-19, in a way that puts people at the centre of our response through coordinated, multi-sectoral approaches and consultation.</p>\n\n<h2>The Road to Recovery</h2>\n\n<p>While an immediate response to the health challenges posed by the crisis remains essential, we are also now cooperating on policy responses to the significant economic, social and environmental challenges we will face in coming years. We have the opportunity to ensure an economic recovery that includes all our people, supports a more sustainable planet, and ensures that the Asia-Pacific remains the world’s most dynamic and interconnected regional economy.</p>\n\n<p>Our macro-economic policies have played a key role in responding to the impacts of the COVID-19 pandemic, preserving jobs and livelihoods, funding necessary public services and supporting those most affected by the pandemic. With the COVID-19 crisis far from over, we are determined to use all available macroeconomic tools to address the adverse consequences of COVID-19 and sustain economic recovery, while preserving long-term fiscal sustainability. Our economic recovery will be built on a stable, inclusive, sustainable and resilient macroeconomic environment that supports innovation, dynamism and improved productivity. In this respect, we welcome the work of APEC Finance Ministers and in particular, the New Strategy for the Implementation of the Cebu Action Plan, which contributes to achieving our goal of a more financially integrated, transparent, resilient, and connected APEC.</p>\n\n<p>We welcome the historic agreement on a more stable and fairer international tax architecture reached in October. We strongly reaffirm our commitment to promoting tax certainty and tackling tax avoidance and evasion in the APEC region.</p>\n\n<p>Structural reform will also be a critical tool for promoting economic recovery. We welcome the Enhanced APEC Agenda for Structural Reform (EAASR), which provides for collaboration on growth-focused reforms designed to be inclusive, resilient, sustainable and innovation-friendly.</p>\n\n<p>The pandemic has highlighted how structural reform of services sectors can be a powerful enabler of economic growth and inclusion. We note the uneven progress in increasing services competitiveness in the region and in delivering a more open and predictable environment for access to services markets. We commit to accelerate work in response to the mid-term review with the aim of fully implementing the APEC Services Competitiveness Roadmap (ASCR) by 2025.</p>\n\n<p>We have witnessed a remarkable acceleration in digital adoption and transformation across our economies. To sustain this enormous growth potential, we will accelerate the implementation of the APEC Internet and Digital Economy Roadmap (AIDER), further develop digital infrastructure, encourage the development and application of new technologies, and work towards a digital business environment that is open, fair and inclusive, including by narrowing the digital divide. We will also strive to implement structural reforms and increase information sharing regarding our respective domestic policies and practices in support of digital connectivity and inclusion. We acknowledge the key importance of interoperability of digital systems and tools across the region. We will also cooperate on facilitating the flow of data, and strengthen consumer and business trust in digital transactions.</p>\n\n<p>Trade should be a pillar for the development and future prosperity of all our people. At this time of extraordinary disruption, the rules-based multilateral trading system, with the WTO at its core, can play an important role in economic recovery. We will engage constructively to ensure MC12 is a success and delivers concrete outcomes.</p>\n\n<p>We will cooperate to enhance further the role of the WTO in establishing rules that support a free, open, fair, non-discriminatory, transparent and predictable trade and investment environment. This approach is at the core of our long-standing commitment to the WTO.</p>\n\n<p>We are committed to working together to shape a responsive, relevant and revitalised WTO, in particular through the necessary reform of the WTO with a view to improving all its functions. Seized of the opportunity presented by MC12, our economies will work together with the wider WTO membership to advance efforts to ensure the Organization is delivering for our economies in the twenty-first century.</p>\n\n<p>We will advance economic integration in the region in a manner that is market driven. We support ongoing efforts to conclude, ratify, implement and upgrade trade agreements in the region that benefit our people and our businesses. In this context, we will advance the APEC Free Trade Area of the Asia-Pacific agenda (FTAAP) in line with implementing the Lima Declaration, to contribute to high quality and comprehensive regional undertakings. We also note that ABAC considers the realisation of FTAAP its preeminent economic priority.</p>\n\n<p>We will intensify efforts to ensure goods continue to flow even under challenging circumstances. APEC’s work on resilient supply chains, quality infrastructure development and investment, as well as on ports cooperation are essential components of this work. We will continue to implement the APEC Connectivity Blueprint to further improve physical, institutional and people-to-people connectivity. We are encouraged by APEC work taking place to strengthen customs cooperation, and to digitalise border processes and increase the uptake of paperless trading. This work contributes to accelerating APEC’s efforts to implement the WTO Trade Facilitation Agreement.</p>\n\n<p>We will strive to ensure our recovery efforts are free from the serious threats of corruption, fraud, waste, and abuse. We will continue to deny safe haven to corruption offenders and their assets. We are committed to effective, practical, and timely cooperation between competent authorities. We will promote transparency, accountability, and integrity as a basis for preventing and combatting corruption.</p>\n\n<h2>Our Commitment to Sustainability and Inclusion</h2>\n\n<p>In 2021, the world continues to confront unprecedented challenges posed by the impacts of climate change. We acknowledge the need for urgent and concrete action to transition to a climate resilient future global economy and appreciate net zero or carbon neutrality commitments in this regard. We commit to work together to ensure that our economic and environmental policies are mutually supportive.</p>\n\n<p>APEC has made some progress in strengthening the region’s capacity to adopt renewable energy and other environmentally sound technologies, as part of sustainable energy transitions that reduce our dependence on fossil fuels. In this context, we will continue to work together to support energy resilience, access, and security in the region. We acknowledge the importance of stable energy markets, and supporting clean energy transitions.</p>\n\n<p>Building on this, we commit to leverage APEC’s role as an incubator of ideas and capacity building to tackle climate change. We will further integrate action on climate change across relevant APEC workstreams.</p>\n\n<p>We need to support the wellbeing and security of all of our people, and their equitable participation in the economy, so that no one is left behind. Recognising the disproportionate impacts of COVID-19 on MSMEs, women and others with untapped economic potential, we are also taking action to drive a more inclusive economic recovery. The La Serena Roadmap for Women and Inclusive Growth is bringing women’s economic empowerment to the foreground, with a significant number of initiatives currently underway across APEC. We support the full and accelerated implementation of this Roadmap. APEC has also paid particular attention to the economic empowerment of other groups with untapped economic potential. This year this has included Indigenous Peoples and those in rural and remote areas, among others. We will continue to deepen our cooperation in these areas where relevant, to ensure their access to economic opportunities, including to improve access to global markets, and encourage the transition of economic actors from the informal to the formal economy.</p>\n\n<p>We have provided unprecedented levels of support to all our businesses, including Micro, Small and Medium Enterprises (MSMEs), to help them navigate the crisis. We will continue supporting MSME digital empowerment by tackling systemic barriers to entrepreneurship and reinforcing capacity building. We will also deepen our efforts to respond to the impact of the pandemic on labour market participation and the future of work.</p>\n\n<p>Digital connectivity and innovation are critical across our efforts towards an inclusive, resilient and sustainable recovery. We need to continue to narrow the digital divide by promoting digital skills, encouraging the adoption of innovative working methods, expanding access to digital tools and infrastructure, and ensuring our MSMEs and start-ups are able to harness new and emerging technologies and digital eco-systems.</p>\n\n<p>We welcome the Food Security Roadmap Towards 2030. This will guide APEC’s work towards our goal of sufficient, safe, nutritious, accessible and affordable food for all. We support efforts to reduce food waste and loss. We will also continue to take concrete measures to implement the APEC Roadmap on Combatting Illegal, Unreported and Unregulated (IUU) Fishing.</p>\n\n<h2>Looking forward</h2>\n\n<p>Last year we adopted the Putrajaya Vision 2040, which will guide our work for the next twenty years.&nbsp; We endorse the Aotearoa Plan of Action, which will be key to implementing this Vision. This will inject new momentum into APEC, at a time when our region faces significant challenges. It demonstrates the confidence we have in sharing our individual approaches, working together collectively where we can, and being willing and open to ideas addressing new challenges.</p>\n\n<p>The Aotearoa Plan of Action is designed to be a living document. We will monitor our progress and update it every five years. All of this in pursuit of our Vision: an open, dynamic, resilient and peaceful Asia-Pacific community by 2040, for the prosperity of all our people and future generations.</p>\n\n<p>We welcome the outcomes of the 2021 APEC Ministerial Meeting as well as the 2021 sectoral Ministerial Meetings for Trade, Structural Reform, Food Security, Health, Women and the Economy, Small and Medium Enterprises, and Finance.</p>\n\n<p>We thank New Zealand for hosting APEC in 2021 and we look forward to APEC in 2022, which will be hosted by Thailand.</p>\n\n<p><em>Haumi ē, Hui ē, Tāiki ē<br>\nJoin, Work, Grow. Together</em></p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.apec.org/meeting-papers/leaders-declarations/2021/2021-leaders-declaration/annex-aotearoa-plan-of-action\">Aotearoa Plan of Action</a></li>\n</ul></div>\n      "
}