{
  "path": "/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy<strong>, </strong>to discuss security concerns in Eastern Europe.</p>\n\n<p>The Prime Minister and President discussed their shared concerns about the continuing buildup of Russian military forces in and around Ukraine, as well as Russia’s ongoing aggression and destabilization activities. Prime Minister Trudeau reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine and emphasized that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions. Referencing yesterday’s discussion with the President of the United States of America and European leaders, Prime Minister Trudeau emphasized the coordination underway between Ukraine’s partners in order to stand united in support of Ukraine.</p>\n\n<p>The Prime Minister emphasized Canada’s strong support for Ukraine, which includes military training and capacity building through Operation UNIFIER, and financial assistance to the Government of Ukraine. He underlined that Ukraine’s security is also Europe’s security and that of all democratic states seeking to uphold fundamental principles of international law and state sovereignty. President Zelenskyy thanked Prime Minister Trudeau for Canada’s assistance and the two leaders discussed ways in which Canada could continue to support Ukraine in the future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/11/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with President of the United States of America Joe Biden and European leaders on Russia and the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/01/canada-extends-and-expands-military-and-other-support-for-the-security-of-ukraine.html\">Canada extends and expands military and other support for the security of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/government-of-canada-announces-loan-of-up-to-120-million-to-support-ukraines-economic-resilience-and-development.html\">Government of Canada announces loan of up to $120 million to support Ukraine’s economic resilience and development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n</ul></div>\n      "
}