{
  "path": "/en/news/readouts/2022/02/04/prime-minister-justin-trudeau-speaks-prime-minister-norway-jonas-gahr",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Norway Jonas Gahr Støre | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Norway, Jonas Gahr Støre.</p>\n\n<p>In this first call, the two leaders reaffirmed the deep relationship and ongoing collaboration between Canada and Norway, based on common values, interests, and priorities.</p>\n\n<p>The prime ministers shared their concerns over Russia’s aggressive and destabilizing actions in and around Ukraine, and underlined the need for Russia to engage constructively in diplomacy. Reaffirming Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine, Prime Minister Trudeau commended the strength of the NATO Alliance and its unity, and emphasized the importance of continued coordination and dialogue between Allies and partners. The two leaders emphasized the right of every country to choose its own security arrangements.</p>\n\n<p>Prime Minister Trudeau commended Prime Minister Støre and Norway’s leadership in hosting the upcoming Global Disability Summit on February 16 and 17. He underlined that inclusive development for all marginalized groups, including persons with disabilities, is an important part of Canada’s Feminist International Assistance Policy.</p>\n\n<p>The prime ministers stressed the importance of continuing to work with the international community to address ongoing human rights issues in Afghanistan, which are overwhelmingly affecting women and girls. They discussed the ongoing impacts of the COVID-19 pandemic,&nbsp;highlighting the need for continued international cooperation to increase global equitable access to COVID-19 vaccines. On the topic of climate change, Prime Minister Trudeau commended Norway for its global leadership on pollution pricing, and both leaders committed to tackling the climate crisis together, moving to a net-zero future, and working to create good middle-class jobs for people and new opportunities for businesses in both countries.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Støre looked forward to staying in contact and working together on issues that matter to Canadians and Norwegians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/norway-norvege/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Norway Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/10/14/statement-prime-minister-formation-new-government-norway\">Statement by the Prime Minister on the formation of a new government in Norway</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/18/prime-minister-justin-trudeau-speaks-ministers-situation-ukraine\">Prime Minister Justin Trudeau speaks with ministers on the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/01/canada-welcomes-over-200-afghan-refugees-to-vancouver.html\">Canada welcomes over 200 Afghan refugees to Vancouver</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/01/prime-minister-trudeau-announces-enhanced-and-ambitious-climate\">Prime Minister Trudeau announces enhanced and ambitious climate action to cut pollution at the COP26 summit</a></li>\n</ul></div>\n      "
}