{
  "path": "/en/news/statements/2022/07/06/statement-prime-minister-ninth-anniversary-lac-megantic-tragedy",
  "pageTitle": "Statement by the Prime Minister on the ninth anniversary of the Lac-Mégantic tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the ninth anniversary of the Lac-Mégantic tragedy:</p>\n\n<p>“Nine years ago, a train carrying crude oil derailed, caught fire, and exploded in the heart of Lac-Mégantic, Quebec. This tragedy took the lives of 47 people, forced many more to leave their homes, and destroyed much of the downtown.</p>\n\n<p>“On this solemn day, I join the people of Lac-Mégantic and all Canadians in honouring the victims of this horrible tragedy. It was the deadliest railway accident in our modern history and no community should ever have to experience what Lac-Mégantic and the neighbouring communities went through.</p>\n\n<p>“The safety of all Canadians is our top priority and we continue to take actions to strengthen regulatory requirements. In May, we updated both the <em>Canadian Rail Operating Rules</em> and the <em>Railway Locomotive Inspection and Safety Rules</em> to bring an additional layer of protection for the communities who live and work along rail lines and help prevent accidents like this tragedy from happening again.</p>\n\n<p>“The Government of Canada continues to work with our provincial, municipal, and private sector partners to ensure the safety of the people in the region and to support the affected communities, including by completing the <a href=\"https://tc.canada.ca/en/rail-transportation/lac-megantic-rail-bypass\">Lac-Mégantic rail bypass project</a>, and we continue to engage the people of Lac-Mégantic and the neighbouring communities as we move forward with the next steps.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to remember those whose lives were tragically lost or changed forever on July 6, 2013. To the people of Lac‑Mégantic: your strength, resilience, and courage are an inspiration to all.”</p></div>\n      "
}