{
  "path": "/en/news/news-releases/2020/09/03/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable J. Michal Fairburn, a Justice of Appeal of the Court of Appeal for Ontario, as the new Associate Chief Justice of Ontario.</p>\n\n<p>Associate Chief Justice Fairburn replaces the Honourable Alexandra H. Hoy, who elected to become a supernumerary judge effective June 1, 2020, after more than 18 years of distinguished service as a judge.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable J. Michal Fairburn every success as the new Associate Chief Justice of Ontario. She brings six years of service as a judge, and over two decades of experience as Crown counsel and general counsel with the Ministry of the Attorney General for Ontario. I am confident she will continue to serve Ontarians well in this new role.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/09/03/honourable-j-michal-fairburn\">The Honourable J. Michal Fairburn</a></li>\n</ul></div>\n      "
}