{
  "path": "/en/news/readouts/2021/01/14/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of France, Emmanuel Macron.</p>\n\n<p>Prime Minister Trudeau and President Macron discussed steps being taken in Canada and in France to combat the COVID-19 virus, and the approaches both countries have taken to save lives and support people through the crisis. They talked about the rollout of safe and effective vaccines to as many people as possible, as quickly as possible, starting with vulnerable people and frontline workers. They also spoke about the importance of international coordination to advance global health and economic responses to the COVID-19 pandemic, and highlighted the need for equitable access to vaccines and the important work COVAX is doing in this area.</p>\n\n<p>The two leaders discussed opportunities to make progress on shared priorities, such as protecting international peace and security, and promoting democracy and human rights, including in the G7, the G20, and other multilateral forums. Prime Minister Trudeau and President Macron highlighted their commitment to fighting climate change and protecting the environment, and the success of the recent One Planet Summit for biodiversity, organized by France in cooperation with the United Nations and the World Bank.</p>\n\n<p>The leaders discussed relations with China, with Prime Minister Trudeau expressing concern about the human rights situation in Xinjiang and recent arrests in Hong Kong.</p>\n\n<p>The Prime Minister and the President emphasized their commitment to continue working with countries in the Sahel to help restore peace, stability, and prosperity in the region.</p>\n\n<p>The Prime Minister and the President underlined the dynamic and deep relations between Canada and France, and ongoing bilateral and multilateral cooperation – including on digital issues such as artificial intelligence – that will build even stronger links. Increasing trade and commercial ties creates jobs and opportunities for both countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2021/01/11/prime-ministers-remarks-one-planet-summit\">Prime Minister’s remarks at the One Planet Summit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canada-joins-international-coalition-for-the-sahel.html\">Canada joins International Coalition for the Sahel</a></li>\n</ul></div>\n      "
}