{
  "path": "/en/news/news-releases/2020/11/27/more-support-advance-reform-services-indigenous-children-and-families",
  "pageTitle": "More support to advance reform of services for Indigenous children and families | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Indigenous child deserves to grow up in their community⁠ – immersed in their culture and surrounded by their loved ones. That is why the Government of Canada worked with Indigenous partners to co-develop legislation to reform child and family services and reduce the number of Indigenous children in care, through the historic <em>Act respecting First Nations, Inuit and Métis children, youth and families</em>.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced over $542 million in funding to advance First Nations, Inuit, and Métis engagement to co-develop the implementation of the<em> </em>Act, and to assist Indigenous communities and groups in building the capacity to establish their own child and family services systems.</p>\n\n<p>To build capacity for establishing their own systems, funding will support Indigenous partners in developing legislation and delivery models, engaging their communities, and hiring experts. The investment will also fund participation of Indigenous groups at coordination agreement tables with provinces and territories, which will facilitate our continued efforts to make the system child-centered, community-directed, and focused on prevention and early intervention. Funding will be distributed based on needs identified through ongoing discussions with Indigenous partners, with the aim of developing child and family services models that reflect their communities’ values and traditions.</p>\n\n<p>The <em>Act respecting First Nations, Inuit and Métis children, youth and families </em>will also address the Calls to Action from the Truth and Reconciliation Commission of Canada, and will advance Calls for Justice as set out by the National Inquiry into Missing and Murdered Indigenous Women and Girls.</p>\n\n<p>Today’s announcement is in addition to the $3 billion that has already been invested, starting in 2019, to continue delivering and improving the government’s funding support for First Nations child and family services. With both investments, the government is strengthening its commitment to First Nations, Inuit, and Métis to reform the child and family services system as it relates to Indigenous children, ensuring that Indigenous partners can exercise their jurisdiction and decide what is best for their children, their families, and their communities.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When it comes to providing child and family services to Indigenous children, we must always put the well-being and best interests of the children first. Today, we are investing in our shared work with First Nations, Inuit, and Métis partners to do just that. We are keeping our promise to give them the support they need to keep children within their families and their communities, so they can grow up surrounded by the strength of their culture to achieve their full potential.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>\"We promised to give Indigenous communities the support they need to keep their children safe, to keep their families together, and to have the opportunity to thrive. We know we have a long way to go and today’s announcement is a step forward toward keeping that promise. This marks an important next step in seeing the full and effective implementation of the <em>Act respecting First Nations, Inuit and Métis children, youth and families</em> so that we can better support Indigenous communities to stand up jurisdiction over their child and family services.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The over-representation of First Nations, Inuit and Métis children in the child and family services system has been described as a humanitarian crisis. According to data from the 2016 Canadian Census, Indigenous children make up 7.7 per cent of all children between the ages of 0 and 14, but account for 52.2 per cent of children in foster care.</li>\n\t<li>Today’s announcement of over $542 million in funding over five years, committed as part of the July 2020 Economic and Fiscal Snapshot, includes:\n\t<ul>\n\t\t<li>$425 million over five years for capacity-building funding for Indigenous jurisdictions.</li>\n\t\t<li>Nearly $73 million over five years for coordination agreement discussions.</li>\n\t\t<li>Over $35 million for internal services.</li>\n\t\t<li>Nearly $10 million over two years for governance engagement mechanisms.</li>\n\t</ul>\n\t</li>\n\t<li>On January 1, 2020, the <em>Act respecting First Nations, Inuit and Métis children, youth and families</em> came into force. The Act provides a pathway for Indigenous communities to exercise jurisdiction over child and family services, and establishes national minimum standards to ensure the best interests of Indigenous children, cultural continuity, and substantive equality.</li>\n\t<li>On July 7, 2020, Indigenous Services Canada and the Assembly of First Nations signed a Protocol that was co-developed by both organizations to establish a new structure to support discussions on the implementation of the <em>Act respecting First Nations, Inuit and Métis children, youth and families</em>.</li>\n\t<li>The Government of Canada is also implementing the orders of the Canadian Human Rights Tribunal and has more than doubled funding to First Nations child and family services agencies, based on their actual needs and with an emphasis on prevention – from $681 million in 2015-2016 to $1.7 billion in 2019-2020.</li>\n\t<li>The Government of Canada will also work closely with provincial and territorial governments to facilitate the transformation of Indigenous child and family services and to clarify associated roles and responsibilities.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/services/publications/economic-fiscal-snapshot.html\">Economic and Fiscal Snapshot 2020</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1100100035204/1533307858805\">First Nations Child and Family Services Program</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1541187352297/1541187392851\">Reducing the number of Indigenous children in care</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2020/07/the-assembly-of-first-nations-and-canada-sign-a-historic-protocol-agreement-to-advance-the-transfer-of-child-and-family-services-to-first-nations.html\">The Assembly Of First Nations and Canada Sign a Historic Protocol Agreement to Advance the Transfer Of Child And Family Services To First Nations</a></li>\n</ul></div>\n      "
}