{
  "path": "/en/news/statements/2019/03/15/statement-prime-minister-terrorist-attack-two-mosques-new-zealand",
  "pageTitle": "Statement by the Prime Minister on terrorist attack on two mosques in New Zealand | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the terrorist attack on two mosques in Christchurch, New Zealand:</p>\n\n<p>“Canadians across the country were appalled to wake up to news of the terrorist attack on two mosques in Christchurch, New Zealand, that killed and injured so many people, including children.</p>\n\n<p>“We extend our deepest condolences to the families and friends who lost loved ones in this senseless tragedy. To the people of New Zealand and to Muslim communities around the world: you are in our hearts and minds. We join in your grief and stand with you at this incredibly difficult time.</p>\n\n<p>“Far too often, Muslims suffer unimaginable loss and pain in the places where they should feel safest. Canada remembers too well the sorrow we felt when a senseless attack on the Centre culturel islamique de Québec in Ste-Foy claimed the lives of many innocent people gathered in prayer.</p>\n\n<p>“To move forward as a world, we need to recognize diversity as a source of strength, and not a threat. Last night’s victims were fathers, mothers, and children. They were neighbours, friends, and family members. As with every life taken too soon, the full measure of their loss will never be known.</p>\n\n<p>“Canada condemns this attack, and will continue to work closely with New Zealand, our close partner and friend, and others to take action against violent extremism. Hate has no place anywhere. We must all confront Islamophobia and work to create a world in which all people—no matter their faith, where they live, or where they were born—can feel safe and secure.”</p></div>\n      "
}