{
  "path": "/en/news/news-releases/2017/07/08/prime-minister-announces-support-women-entrepreneurs-developing",
  "pageTitle": "Prime Minister announces support for women entrepreneurs in developing countries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Women entrepreneurs in developing countries are creating jobs, advancing gender equality, and helping build economies that work for everyone. Despite the vital role they play, women entrepreneurs often face major obstacles to financing and growing their businesses. These obstacles include limited options for loans and capital, financial services not tailored to their specific needs, and other legal, political, and social barriers.</p><p>As part of our Government’s commitment to gender equality and women’s economic empowerment, the Prime Minister, Justin Trudeau, today announced that Canada will contribute $20 million toward the Women Entrepreneurs Finance Initiative (We-Fi). Led by the World Bank, We-Fi will help women-owned and women-led businesses in developing countries to access the resources they need, including financial and technical assistance.</p><p>We-Fi will leverage US$200 million of donor funding to attract an additional US$800&nbsp;million in private capital. The World Bank will direct these funds toward the needs of women entrepreneurs in developing countries. We-Fi will target small and medium-size businesses and will also invest in other projects and programs that support women entrepreneurs.</p><h2>Quote</h2><blockquote><p>“Everyone benefits when women have the resources they need to participate fully in our economies and societies. Our Government is determined to help women gain the tools they need to be successful entrepreneurs and leaders. This important investment will help women in developing countries to create jobs, build economies that work for everyone, and have a real and fair chance at success.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Seventy per cent of women-owned small and medium-sized businesses in developing countries are either shut out by financial institutions or are unable to receive financing on adequate terms to meet their needs.</li><li>Canada’s support for We-Fi&nbsp; complements our new Feminist International Assistance Policy, which recognizes that gender equality and the empowerment of women and girls are the best way to build a more peaceful, inclusive and prosperous world.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/iap-pai/index.aspx?lang=eng&amp;utm_campaign=iap-pai-2017&amp;utm_source=media&amp;utm_medium=media-en&amp;_ga=2.169527329.1843276450.1498507022-406518861.1494432559\" title=\"Canada’s new Feminist International Assistance Policy\">Canada’s Feminist International Assistance Policy</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_sexes/index.aspx?lang=eng\">Gender equality and empowering women and girls</a></li><li><a href=\"http://www.worldbank.org/en/programs/women-entrepreneurs\">Women Entrepreneurs Finance Initiative</a></li></ul></div>\n      "
}