{
  "path": "/en/news/readouts/2021/02/16/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen discussed the ongoing efforts in Canada and the European Union to fight the global COVID-19 pandemic and to vaccinate people as quickly as possible. The Prime Minister emphasized the importance of timely vaccine shipments in order to meet vaccination goals, noting that Canada is expecting an increase in vaccine deliveries over the coming weeks. He expressed appreciation for the European Union’s efforts to facilitate exports of doses to Canada, and welcomed President von der Leyen’s continued commitment to ensuring that the European Union vaccine export transparency mechanism would not disrupt exports of vaccines destined for Canada. The two leaders agreed on working closely together to ensure necessary medicines and medical products get to people in Canada, Europe, and around the world.</p>\n\n<p>The Prime Minister and the President highlighted their shared commitment to support more vulnerable countries in responding to the pandemic, including through the COVAX Facility.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen looked forward to meeting virtually with other G7 leaders on February 19, to discuss global priorities such as beating COVID-19 around the world, growing the middle class, and building an economic recovery that benefits everyone.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/29/joint-press-release-eu-canada-leaders-virtual-meeting\">Joint press release: EU-Canada Leaders' Virtual Meeting</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}