{
  "path": "/en/news/readouts/2021/04/06/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy discussed the situation in eastern Ukraine, with the Prime Minister condemning Russia’s&nbsp;escalation of violence in the Donbas and ongoing ceasefire violations.&nbsp;Prime Minister Trudeau also expressed deep concern about Russia’s destabilizing actions and recent military activities in Crimea and along the border with Ukraine.&nbsp;Prime Minister Trudeau emphasized Canada’s unwavering commitment to support Ukraine’s sovereignty, security, and territorial integrity. President Zelenskyy thanked Canada for its ongoing contribution to military training in Ukraine though Operation UNIFIER.</p>\n\n<p>The two leaders spoke about the tragic downing of Ukraine International Airlines Flight PS752, and highlighted the need and ongoing work for transparency, accountability, and justice for the victims and their families.</p>\n\n<p>The Prime Minister and the President discussed the global COVID-19 pandemic and the measures in place in Canada and in Ukraine to protect people and save lives. They agreed on the importance of international collaboration to fight the pandemic and to roll out vaccines as quickly as possible.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy underlined the close friendship and strong people-to-people links between Canada and Ukraine. They looked forward to continue deepening the relationship between their two countries.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/canada-imposes-new-sanctions-on-individuals-and-entities-involved-in-illegal-annexation-of-crimea.html\">Canada imposes new sanctions on individuals and entities involved in illegal annexation of Crimea</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-canada-mark-first-anniversary-downing-ukraine\">Statement by the Prime Minister of Canada to mark the first anniversary of the downing of Ukraine International Airlines Flight&nbsp;752</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n</ul></div>\n      "
}