{
  "path": "/en/news/statements/2022/08/23/statement-prime-minister-black-ribbon-day",
  "pageTitle": "Statement by the Prime Minister on Black Ribbon Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black Ribbon Day, the National Day of Remembrance for the Victims of Communism and Nazism in Europe:</p>\n\n<p>“Today, we join people from around the world to honour the victims and survivors of communism and Nazism in Europe, and pledge to continue standing up for all those who still face violence and oppression at the hands of authoritarian regimes.</p>\n\n<p>“Black Ribbon Day marks the anniversary of the Molotov-Ribbentrop Pact, which was signed on this day in 1939 between the Soviet Union and Nazi Germany and resulted in the division of Poland and the annexation of the Baltic states as well as part of Romania by the Soviet Union.</p>\n\n<p>“Across Central and Eastern Europe, millions of people suffered tremendously under totalitarian regimes, including Jewish, Romani, Slavic, disability, and LGBTQ2 communities. They were robbed of their basic human rights, forced to flee their homes, and murdered. Many of those who escaped the Soviet and Nazi regimes found new homes in Canada and have helped shape the strong and diverse country we know today. Their stories remind us that we all have a responsibility to ensure atrocities like these never happen again.</p>\n\n<p>“This year, we also stand in solidarity with the Ukrainian people, who continue to face brutal violence from Russia’s illegal, unjustifiable, and expansionist war of choice in their country. Canada, together with our Allies and international partners, will continue to support Ukraine and stand up for democracy and human rights everywhere.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to pay tribute to those who have suffered or lost their lives to totalitarian and authoritarian regimes – past or present. Together, we must continue to reject extremism, intolerance, and oppression, while promoting human rights, freedom, and democracy here in Canada and around the world.”</p></div>\n      "
}