{
  "path": "/en/news/news-releases/2018/11/26/governor-general-canada-visit-kazakhstan",
  "pageTitle": "Governor General of Canada to visit Kazakhstan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Kazakhstan from December 3 to 5, 2018.</p><p>During the visit, the Governor General will meet with the President of Kazakhstan, Nursultan&nbsp;Nazarbayev, and senior officials to deepen the relationship between our two countries. The Governor General will also attend the launch of Expedition 58 on the Soyuz spacecraft at the Baikonur Cosmodrome, where Canadian David&nbsp;Saint-Jacques and two crewmates will depart for the International Space Station.</p><p>After attending the launch, the Governor General will visit Kazakhstan’s National Space Center in Astana and meet representatives of Kazakhstan’s National Space Agency to highlight our partnership in space exploration. She will also meet with prominent Kazakhstani women leaders to discuss the importance of gender equality and the need to eliminate barriers that hold women and girls back.</p><h2>Quote</h2><blockquote><p>“The Governor General – the former Chief Astronaut for the Canadian Space Agency – will have the opportunity to visit Kazakhstan, which is home to the world’s oldest and largest space launch facility. She’ll give her best wishes to David Saint-Jacques, on behalf of all Canadians, as he leaves for his first ever space mission.”<br><i><cite><i><cite>— </cite></i>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick facts</h2><ul><li>This will be the first visit of a Governor General to Kazakhstan.</li><li>Kazakhstan is an important regional player, currently sitting as a non-permanent member in the United Nations Security Council. Kazakhstan is a partner for Canada in many multilateral forums and international organizations, including the United Nations, the Organization for Security and Co-operation in Europe, the International Monetary Fund, the World Bank, and the World Trade Organization.</li><li>Expedition 58 will be Canadian Space Agency astronaut David Saint-Jacques’ first mission in space. During his assignment, he will conduct a series of scientific experiments and robotics tasks, and test new technologies.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/kazakhstan/bilateral_relations_bilaterales/canada_kazakhstan.aspx?lang=eng\">Canada – Kazakhstan relations</a></li><li><a href=\"http://www.asc-csa.gc.ca/eng/missions/expedition58/default.asp\">Expedition 58</a></li></ul></div>\n      "
}