{
  "path": "/en/news/readouts/2022/05/18/prime-minister-justin-trudeau-speaks-prime-minister-sanna-marin-finland",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Sanna Marin of Finland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Finland, Sanna Marin, to express Canada’s support for Finland’s accession to the North Atlantic Treaty Organization (NATO) Alliance.</p>\n\n<p>Prime Minister Trudeau welcomed Finland’s decision to apply for NATO membership today, noting that Finland has long been a like-minded, highly capable, and closely interoperable NATO partner and a strong contributor to Euro-Atlantic security. He stressed the importance of Finland’s accession to NATO to further strengthen transatlantic security and defence, and committed to a swift Canadian ratification process. Discussing the state of international security, Prime Minister Trudeau assured Prime Minister Marin that Canada would support Finland in response to threats to its security between the time of its application for membership and its formal accession to NATO.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Marin looked forward to meeting in person and agreed to continue working together to advance shared priorities, including climate action, gender equality, inclusive democracy, and effective multilateralism.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/finland-finlande/relations.aspx?lang=eng\">Canada-Finland relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/18/statement-prime-minister-finland-and-swedens-application-join-nato\">Statement by the Prime Minister on Finland and Sweden’s application to join the NATO Alliance</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/04/canada-finland-joint-statement-on-bilateral-cooperation.html\">Canada-Finland joint statement on bilateral cooperation</a></li>\n</ul></div>\n      "
}