{
  "path": "/en/news/readouts/2023/05/01/prime-minister-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Trudeau speaks with President of Ukraine, Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister reiterated Canada’s solidarity with the Ukrainian people as they remain resolute in the face of Russia’s brutal and unjustifiable aggression, including strikes on civilian targets and the unlawful deportation of Ukrainian children to Russia.</p>\n\n<p>The two leaders discussed the situation on the ground and how Canada can continue to support Ukraine, now and in the future. The Prime Minister reiterated Canada’s commitment to stand by Ukraine with military, humanitarian, financial, and other assistance for as long as it takes.</p>\n\n<p>The Prime Minister also expressed support for Ukraine’s diplomatic efforts toward a just peace, and looked forward to President Zelenskyy’s virtual participation in the upcoming G7 Summit in Hiroshima, Japan.</p>\n\n<p>The two leaders reaffirmed their intention to remain in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"/en/news/readouts/2023/04/04/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/24/supporting-ukraine-long-it-takes\">Supporting Ukraine for as long as it takes</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada-Ukraine relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n</ul></div>\n      "
}