{
  "path": "/en/news/readouts/2021/05/28/prime-minister-justin-trudeau-speaks-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Prime Minister Boris Johnson of the United Kingdom.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson spoke about the deep ties that unite Canada and the United Kingdom, including trade that benefits workers and businesses on both sides of the Atlantic. They welcomed the coming into force of the Canada-UK Trade Continuity Agreement, and looked forward to future negotiations on a bilateral<strong> </strong>free trade agreement. The Prime Minister welcomed the UK’s interest in joining the Comprehensive and Progressive Agreement for Trans-Pacific Partnership.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson discussed the global COVID-19 pandemic and the measures taken in Canada and in the United Kingdom to keep people safe and protect livelihoods. They highlighted the importance of a coordinated international response that leaves no country behind, and ongoing efforts to ensure efficient and equitable access to vaccines.</p>\n\n<p>The two leaders discussed the importance of accelerating action on climate change and opportunities for collaboration during the G7 Leaders’ Summit in Carbis Bay, UK, from June 11 to 13. They looked forward to making progress on shared priorities, including ending COVID-19 and strengthening pandemic preparedness, as well as a global economic recovery that benefits everyone, climate change, and gender equality. They emphasized the importance of G7 shared values and solidarity in addressing today’s global challenges.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson looked forward to the next Commonwealth Heads of Government Meeting taking place in Rwanda when conditions allow.</p>\n\n<p>Prime Minister Trudeau expressed appreciation for the United Kingdom’s strong support regarding the Arbitrary Detention initiative. The two leaders discussed the tragic downing of Ukraine International Airlines Flight 752 and the need for transparency, accountability, and justice for the families of the victims.</p>\n\n<p>The two leaders discussed the importance of upholding the rules-based international order and ensuring that international organizations and rules are strengthened to confront today’s challenges. Prime Minister Trudeau and Prime Minister Johnson exchanged views on the need for solidarity against rising authoritarianism and committed to continue working together with other partners.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cuktca-acccru/read_agreement-consultez_accord.aspx?lang=eng\">Canada-UK Trade Continuity Agreement (Canada-UK TCA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/g7-statement-on-belarus.html\">G7 statement on Belarus</a></li>\n</ul></div>\n      "
}