{
  "path": "/en/news/news-releases/2019/08/19/new-investments-quebec-citys-public-transit-network",
  "pageTitle": "New investments in Quebec City’s public transit network | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In Quebec and across the country, we need to make sure our public transit infrastructure keeps pace with our growing cities. By investing in public transit, we can strengthen the middle class and build better, greener communities. &nbsp;</p>\n\n<p>Prime Minister Justin Trudeau and Quebec’s Minister of Transport and Minister Responsible for the Estrie Region, François Bonnardel, today announced joint funding to establish a structuring public transit network in Quebec City. The project, which also includes an investment from the City of Québec, will integrate several modes of public transit and provide comfortable, high-quality services to transit users.</p>\n\n<p>Once complete, Quebec City’s public transit network will include two trambus lines over a total of 15 kilometres, as well as a 23 kilometre-long tramway line. Today’s funding will also help improve current Métrobus lines and build 16 kilometres of dedicated bus lanes and four new park-and-ride lots.</p>\n\n<p>Four hubs will allow users to transfer from one system to another within the transit network, and two new automated links will make travel between Lower Town and Upper Town easier.</p>\n\n<p>Thanks to the new structuring public transit network, people in Quebec City will be able to move more quickly around their city and benefit from modern, efficient, and flexible public transit services, designed to meet the needs of current and future residents.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>\"Today is a great day for the people of Quebec City. With this historic investment in the city’s public transit network, we are helping residents get around more quickly and access the services they need, while making Quebec City greener. We will continue to listen to communities across Canada, and work together to invest in the infrastructure they need.\"</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>\"As we have said from the start, we are here for Quebec City. Our major contribution will help Quebec City build a modern, 21st-century public transit system. This new infrastructure will enhance access to sustainable means of transport, and make it easier for residents to travel, so they spend less time in traffic and more time with their loved ones. More than ever, we have great hopes for Quebec City, and we are committed to building a greener future for all.\"</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>\"We’re proud to support Quebec City’s modern, structuring public transit project. From day one, we’ve promised we’d be part of this, and we’ve kept our word. Today, we can finally take this project forward. That’s what real progress looks like!\"</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am very pleased that the funding for the Quebec City structuring public transit network project is now secured. This is an important step, which will enable us to continue with the preparations for this major project for Quebec City. The structural network will extend over more than 54 kilometres, making travel faster and more efficient for users. It is clear that this project will contribute to Quebec City’s development, and help it to remain on the cutting edge with respect to public transit.\"</p>\n\n<footer class=\"default\">François Bonnardel, Minister of Transport and Minister Responsible for the Estrie Region</footer>\n</blockquote>\n\n<blockquote>\n<p>\"Today, full funding for the largest public transit project in Quebec City’s history has at last been confirmed. The structuring public transit network is an ambitious project, custom-made for Quebec City. Its primary goal is to positively transform citizens’ quality of life for decades to come and make our city the most attractive in the country. The network will be planned and built in a spirit of transparency, and we will regularly consult with citizens. Quebec City will now be among the Canadian cities with over 500,000 residents that have modern public transit infrastructure. I would like to thank the governments of Quebec and Canada for their support for and confidence in this project.”</p>\n\n<footer class=\"default\">Régis Labeaume, Mayor of Quebec City</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2016, the Government of Canada launched the largest infrastructure plan in Canada’s history. Since then, it has funded hundreds of infrastructure projects to expand our highways, build new roads, and help drivers throughout Canada get around more easily and safely.</li>\n\t<li>The Government of Canada will invest up to $1.2 billion in Quebec City’s structuring public transit network through the Investing in Canada infrastructure program. The Government of Quebec will invest $1.8 billion to deliver the project, and the City of Québec will provide $300 million.</li>\n\t<li>Through the Investing in Canada plan, the Government of Canada is investing over $180 billion over 12 years in public transit, green and social infrastructure, transportation infrastructure that supports business, and rural and northern communities.</li>\n\t<li>Of that funding, $28.7 billion will go to public transit projects, including $5 billion available for investment through the Canada Infrastructure Bank.</li>\n\t<li>Through the Public Transit Infrastructure Fund, the Government of Canada has so far invested over $737 million to carry out 312 projects in Quebec, to improve public transit services in the province.</li>\n\t<li>The Quebec Infrastructure Plan provides $115.4 billion in investments over 2019-2029, to maintain and develop public infrastructure, up 15% over the preceding period.</li>\n\t<li>The transportation sector accounts for 25% of greenhouse gas emissions in Canada. Investments in public transit help to improve travel, reduce air pollution, build stronger communities, and help grow Canada’s economy.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html#popupSettings\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/investments-2002-investissements/qc-eng.html\">Infrastructure Canada Projects and Programs (since 2002) - Quebec</a></li>\n</ul></div>\n      "
}