{
  "path": "/en/news/readouts/2022/12/09/prime-minister-justin-trudeau-meets-northwest-territories-premier-caroline",
  "pageTitle": "Prime Minister Justin Trudeau meets with Northwest Territories Premier Caroline Cochrane | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Premier of the Northwest Territories, Caroline Cochrane, to discuss shared priorities. The Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency, Dan Vandal, and the Member of Parliament for Northwest Territories, Michael V. McLeod, were also in attendance.</p>\n\n<p>The Prime Minister and the Premier agreed on the importance of ongoing collaboration between the federal and territorial governments to advance infrastructure development, expand access to affordable housing, and support economic development opportunities while recognizing the Northwest Territories’ unique needs. The Prime Minister noted the importance of critical minerals for the North and Canada’s economic growth, and highlighted Canada’s Critical Minerals Strategy, which was released today.</p>\n\n<p>The Prime Minister and the Premier discussed the significance of the Taltson Hydro Expansion Project and the Mackenzie Valley Highway for the territory. The leaders also reaffirmed their commitment to addressing the impacts of climate change, expanding clean energy opportunities in the North, and advancing the shared work of reconciliation.</p>\n\n<p>The Prime Minister and the Premier looked forward to continue working together.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/readouts/2022/06/17/prime-minister-justin-trudeau-speaks-northwest-territories-premier\">Prime Minister Justin Trudeau speaks with Northwest Territories Premier Caroline Cochrane</a></li>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2022/12/minister-wilkinson-releases-canadas-38-billion-critical-minerals-strategy-to-seize-generational-opportunity-for-clean-inclusive-growth.html\">Minister Wilkinson releases Canada’s $3.8-billion Critical Minerals Strategy to seize general opportunity for clean, inclusive growth</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadian-critical-minerals-strategy.html\">The Canadian Critical Minerals Strategy</a></li>\n</ul></div>\n      "
}