{
  "path": "/en/news/statements/2018/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p><p>“Happy New Year, everyone!</p><p>“Tonight, as we come together with family and friends, I want to thank you. Every success and milestone our country celebrates tonight, we’re able to celebrate because of you.</p><p>“It’s your hard work, your ambition, and all your acts of perseverance and kindness that change lives and our country for the better.</p><p>“Thanks to you, we’re heading into the New Year with the lowest unemployment rate in over 40 years. Wages are up and, today, 800,000 more people are working than in 2015.</p><p>“Together, we negotiated a new NAFTA – and got a good deal for Canada – so that Canadians can count on well-paying jobs, and our businesses can count on the access they need to expand and thrive.</p><p>“We hosted the G7 and, while there, got leaders of the world to commit $3.8 billion to supporting women and girls’ education in crisis and conflict situations – the largest investment of its kind ever made. We also launched the Ocean Plastics Charter, a historic initiative to eradicate plastic pollution and protect our oceans.</p><p>“At home, we have a lot to celebrate: from the introduction of Canada’s first national accessibility law, to the single largest investment in discovery science in Canadian history, to the biggest private sector investment project our country has ever seen.</p><p>“Together, we’ll keep the momentum going. We’ll continue to open the door to new markets, build on progress toward real, meaningful reconciliation with Indigenous peoples, and create more jobs while protecting the environment.</p><p>“Starting tomorrow, small businesses in Canada will benefit from a combined federal-provincial-territorial average income tax rate of 12.2 per cent – the lowest in the G7. It will also no longer be free to pollute anywhere in Canada, as we put a price on pollution&nbsp;to cut emissions and fight climate change.</p><p>“Our government’s resolution is to stay focused on you, and every Canadian who works hard, day in, day out, to make tomorrow better than yesterday, and this year better than the last.</p><p>“On behalf of the Government of Canada, Sophie and I wish you and your loved ones a wonderful night and health, peace, and happiness for 2019.”</p></div>\n      "
}