{
  "path": "/en/news/news-releases/2017/12/04/prime-minister-announces-appointment-two-new-senators",
  "pageTitle": "Prime Minister announces the appointment of two new Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General has appointed two independent Senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2017/12/04/mary-coyle\">Mary Coyle (Nova Scotia) </a></li><li><a href=\"/en/news/backgrounders/2017/12/04/mary-jane-mccallum\">Mary Jane McCallum (Manitoba)</a></li></ul><p>Ms. Coyle is a long-time champion for women’s leadership, gender equality, and the rights of Indigenous Peoples, who has enjoyed a distinguished career in the post-secondary education and non-profit sectors, with a focus on international and local development.</p><p>Dr. McCallum is an advocate for social justice, who has provided vital dental and health services to northern, First Nations, and Indigenous communities throughout her career.</p><p>Both of these remarkable individuals have devoted their lives to helping others in Canada and around the world. They were chosen using the open merit-based process the Government put in place in early 2016.</p><h2>Quote</h2><blockquote><p>“I am pleased to welcome Parliament’s newest independent senators. Ms. Coyle and Dr. McCallum have already built legacies in their respective fields, and I trust that they will represent their regions well while bringing the depth of experience and knowledge needed to serve in the best interest of all Canadians.” &nbsp;<br> – <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>These are the 29<sup>th</sup> and 30<sup>th</sup> appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Since 2016, the selection process for Senators has been opened to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides the Prime Minister with recommendations. From the recommended pool of candidates, the Prime Minister selects the individuals he then recommends to the Governor General for appointment to the Senate.</li><li>The Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified people.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li></ul><h2>Biographical notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/12/04/mary-coyle\">Mary Coyle </a></li><li><a href=\"/en/news/backgrounders/2017/12/04/mary-jane-mccallum\">Mary Jane McCallum</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/7/minister-of-democratic-institutions-announces-launch-of-the-permanent-phase-of-the-independent-senate-appointments-process.html\">Minister of Democratic Institutions announces launch of the permanent phase of the Independent Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/1/minister-of-democratic-institutions-announces-establishment-of-the-independent-advisory-board-for-senate-appointments.html\">Minister of Democratic Institutions announces establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2015/12/government-announces-immediate-senate-reform.html\">Government announces immediate Senate reform</a></li></ul></div>\n      "
}