{
  "path": "/en/news/news-releases/2018/02/14/government-canada-create-recognition-and-implementation-rights",
  "pageTitle": "Government of Canada to create Recognition and Implementation of Rights Framework | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For too long, Indigenous Peoples in Canada have had to prove their rights exist and fight to have them recognized and fully implemented. To truly renew the relationship between Canada and Indigenous Peoples, the Government of Canada must make the recognition and implementation of rights the basis for all relations between Indigenous Peoples and the federal government.</p><p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will develop – in full partnership with First Nations, Inuit, and Métis Peoples – a Recognition and Implementation of Rights Framework.</p><p>The contents of the Framework will be determined through <a href=\"http://www.aadnc-aandc.gc.ca/eng/1512679042828/1512679061367\">national engagement activities</a> led by the Minister of Crown-Indigenous Relations and Northern Affairs. Engagement will continue throughout the spring, with the intention to have the Framework introduced in 2018 and implemented before October 2019.</p><p>While the results of this engagement will guide what the final Framework looks like, we believe that, as a starting point, it should include new legislation and policy that will make the recognition and implementation of rights the basis for all relations between Indigenous Peoples and the federal government going forward. The Framework can also include new measures to support the rebuilding of Indigenous nations and governments, and advance Indigenous self-determination, including the inherent right of self-government.</p><p>Through this Framework, we will lay the foundation for real and lasting change on issues that matter most to people, including eliminating long-term boil water advisories, improving primary and secondary education on reserve, and taking further steps toward reconciliation.</p><h2>Quotes</h2><blockquote><p>“Reconciliation calls upon us all to confront our past and commit to charting a brighter, more inclusive future. We must acknowledge that centuries of colonial practices have denied the inherent rights of Indigenous Peoples. The recognition and implementation of Indigenous rights will chart a new way forward for our Government to work with First Nations, Inuit, and Métis Peoples and to undo decades of mistrust, poverty, broken promises, and injustices. We have listened and learned and we will work together to take concrete action to build a better future and a new relationship.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Today we begin the engagement that will finally address Canada’s uncomfortable truth – centuries of colonial practices have denied the inherent rights of Indigenous Peoples. As we enter the next 150 years of Canada, we will write our future together in partnership with First Nations, Inuit and Métis. The recognition and implementation of Indigenous rights is critical to reconciliation. We&nbsp;invite all Canadians to work to better understand the damage done by our colonial past and join us in the&nbsp;journey of reconciliation.”<br><cite>—The Honourable Carolyn Bennett, Minister of Crown-Indigenous Relations and Northern Affairs</cite></p></blockquote><blockquote><p>“This is a historic moment, one for which Indigenous Peoples have been advocating for generations. Today, our Prime Minister announced that our Government will ensure that the recognition of Indigenous rights, including Indigenous self-determination and the inherent right of self-government, is the foundation of our relationship with Indigenous Peoples. We have heard loud and clear that true reconciliation with Indigenous Peoples requires federal legislation and policies to be changed to reflect the full promise of Section 35 of our Constitution. Through a Recognition and Implementation of Rights Framework, we can continue along the path of decolonization, transform relations with Indigenous Peoples, achieve greater equality, address socio-economic gaps, and build a better Canada.”<br><cite>—The Honourable Jody Wilson-Raybould, Minister of Justice and Attorney General of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In 1982, Aboriginal and treaty rights were recognized and affirmed through Section 35 of the <i>Constitution Act, 1982</i>, but the work to define these rights was not undertaken.</li><li>In addition to Indigenous Peoples, provincial and territorial governments will be engaged, as well as individuals from civil society, the business community, and the public at large.</li><li>These engagement activities will also focus on the creation of the two new departments that will replace Indigenous and Northern Affairs Canada, as well as the mandates of each Minister. The feedback will help the Government of Canada better serve the distinct priorities of First Nations, Inuit, and Métis Peoples.</li><li>This work builds on the Government of Canada’s ongoing reconciliation efforts, including:<ul><li>The unqualified endorsement of the United Nations Declaration on the Rights of Indigenous Peoples;</li><li>A commitment to implement the Truth and Reconciliation Commission’s 94 Calls to Action;</li><li>The creation of the Working Group on the Review Laws and Policies Related to Indigenous Peoples;</li><li>The release of the Principles Respecting the Government of Canada’s Relationship with Indigenous Peoples; and</li><li>The ongoing work at Recognition of Indigenous Rights and Self-Determination tables where the government and Indigenous Peoples work in partnership on the priorities identified by Indigenous partners.</li></ul></li><li>A clear Recognition and Implementation of Rights Framework across the federal government will provide clarity and certainty on Canada’s responsibilities toward engaging with Indigenous Peoples in a respectful, cooperative partnership–from coast to coast to coast.</li><li>Many studies, reports, and organizations have recommended in recent decades recognizing Indigenous rights in legislation, including the report of the Royal Commission on Aboriginal Peoples and the Truth and Reconciliation Commission, and the First Ministers’ Conferences on the Rights of Aboriginal Peoples.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/backgrounders/2017/08/28/new-ministers-support-renewed-relationship-indigenous-peoples\">New Ministers to support the renewed relationship with Indigenous Peoples</a></li><li><a href=\"https://nctr.ca/assets/reports/Calls_to_Action_English2.pdf\">Truth and Reconciliation Commission Calls to Action</a></li><li><a href=\"http://www.justice.gc.ca/eng/csj-sjc/principles-principes.html\">Principles Respecting the Government of Canada’s Relationship with Indigenous Peoples</a></li><li><a href=\"https://www.canada.ca/en/privy-council/services/review-laws-policies-indigenous.html\">Working Group of Ministers on the Review of Laws and Policies Related to Indigenous Peoples</a></li><li><a href=\"/en/news/speeches/2018/02/14/remarks-prime-minister-house-commons-recognition-and-implementation-rights\">Remarks by the Prime Minister in the House of Commons on the Recognition and Implementation of Rights Framework</a></li></ul></div>\n      "
}