{
  "path": "/en/news/statements/2022/11/13/asean-canada-45th-anniversary-commemorative-summit-joint-statement",
  "pageTitle": "ASEAN-Canada 45th Anniversary Commemorative Summit Joint Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Member States of the Association of Southeast Asian Nations (ASEAN) and Canada, gathered in Phnom Penh, Kingdom of Cambodia on 12 November 2022 for the Commemorative Summit to celebrate the 45th Anniversary of ASEAN-Canada Dialogue Relations, which coincides with the 55th Anniversary of ASEAN;</p>\n\n<p>Recalling the significant progress achieved in the ASEAN-Canada relationship over 45 years since its establishment in 1977;</p>\n\n<p>Acknowledging Canada’s consistent support for ASEAN in dealing with regional issues, and for a regional response to global challenges which provides a concrete demonstration of Canada’s commitment to ASEAN Centrality and to advancing cooperation under the ASEAN Outlook on Indo-Pacific (AOIP);</p>\n\n<p>Reaffirming that the ASEAN-Canada partnership is essential to tackle these shared challenges by building up the political-security, economic, and socio-cultural capacities and people-to-people connectivity in the Indo-Pacific region, in line with the AOIP and the development of the ASEAN Community’s Post 2025 Vision;</p>\n\n<p>Recognising the increasingly complex and cross-cutting challenges the region continues to face, arising from geopolitical shifts, protectionism, complex transnational threats, regional and international conflicts, climate change and rapid technological change, as well as rising food and energy insecurity which are exacerbated by the COVID-19 pandemic and its adverse impact on our peoples’ livelihoods and well-being, societies and economies and reaffirming our belief that regionalism and multilateralism are important principles and frameworks of cooperation;</p>\n\n<p>Emphasizing the importance of adhering to key principles, shared values and norms enshrined in the Charter of the United Nations, the ASEAN Charter, the Treaty of Amity and Cooperation in Southeast Asia (TAC) and the 1982 United Nations Convention on the Law of the Sea (UNCLOS);</p>\n\n<p>Emphasizing our shared desire to see an economically thriving ASEAN that is competitive, innovative, sustainable resilient and inclusive, underpinned by open, stable and transparent access to markets including through the ASEAN-Canada Free Trade Agreement, which is under negotiation, is an articulation of these ambitions;</p>\n\n<p>Recognising the continued growth in ASEAN-Canada economic ties, with increase of bilateral merchandise trade by 17.5 percent and Canadian investment in ASEAN by 9.3 percent in 2021, and increase of ASEAN investment in Canada by 4.6 percent in 2021 as compared to those of the year prior;</p>\n\n<p>Reaffirming, with regard to Ukraine, as for all nations, our respect for sovereignty, political independence, and territorial integrity. We reiterate our call for compliance with the UN Charter and international law. We underline the importance of an immediate cessation of hostilities and creating an enabling environment for peaceful resolution. We support the efforts of the UN Secretary-General in the search for a peaceful solution. We also call for the facilitation of rapid, safe and unhindered access to humanitarian assistance for those in need in Ukraine, and for the protection of civilians, humanitarian personnel, and persons in vulnerable situations;</p>\n\n<p>Noting Canada’s forthcoming announcement of its Indo-Pacific Strategy which among others outlines its commitment to enhance the ASEAN-Canada cooperation;</p>\n\n<p>As we celebrate the 45th anniversary of ASEAN-Canada Dialogue Relations in 2022, we commit to establish an ASEAN-Canada Strategic Partnership. We look forward to the early completion of the necessary process.</p>\n\n<p>We hereby agree to the following:</p>\n\n<h2>Political Security Cooperation</h2>\n\n<ol>\n\t<li>Continue to cooperate towards the full, effective and timely implementation of the Plan of Action to Implement the Joint Declaration on ASEAN-Canada Enhanced Partnership (2021-2025).</li>\n\t<li>Affirm the ASEAN Regional Forum as a key platform for dialogue and consultation on regional political and security issues of common interest and concern and reaffirm the need to further enhance its effectiveness and maintain its relevance in the evolving regional security architecture, while acknowledging its contributions to promoting confidence building measures and preventive diplomacy in the region.</li>\n\t<li>Welcome Canada’s support for ASEAN-led mechanisms and note with appreciation its interest in joining the East Asia Summit (EAS), the ASEAN Defence Ministers Meeting Plus and the observership program of the ADMM-Plus Experts’ Working Groups Maritime Security, and on Humanitarian Assistance and Disaster Relief, subject to these mechanisms’ respective enlargement processes.</li>\n\t<li>Promote maritime security and safety, freedom of navigation and overflight, unimpeded commerce, mutual trust and confidence, the exercise of self-restraint, the non-use of force or the threat to use force, and the resolution of disputes by peaceful means, in accordance with universally recognised principles of international law, including the 1982 United Nations Convention on the Law of the Sea (UNCLOS), the relevant Standards and Recommended Practices of the International Civil Aviation Organisation (ICAO), and the relevant instruments and conventions of the International Maritime Organisation (IMO).</li>\n\t<li>Enhance cooperation in maintaining peace, security and stability, and addressing common traditional and non-traditional security challenges in the region, including transnational crime, non-proliferation, cybersecurity, terrorism and violent extremism, trafficking in persons and people smuggling and maritime security.</li>\n\t<li>Engage in discussions for transfer of knowledge and expertise in border management to ASEAN member states with the view to supporting ASEAN in working towards establishing a border management cooperation roadmap.</li>\n\t<li>Remain deeply concerned over the crisis in Myanmar. We highlight Myanmar’s commitment to the ASEAN Five-Point Consensus during the ASEAN Leaders’ Meeting on 24 April 2021 and urge the timely and complete implementation of the Five-Point Consensus. We will continue to support ASEAN’s efforts to facilitate a peaceful solution in the interest of the people of Myanmar, including through the work of the Special Envoy of the ASEAN Chair on Myanmar, in building confidence and trust with full access to all parties concerned, and effective delivery of humanitarian assistance to the people of Myanmar, including those who are the most in need, without discrimination. We reiterate our commitment to peace and stability in the region and continue to call for the immediate cessation of violence in Myanmar and for the release of all political detainees, including foreigners. We will redouble our collective efforts towards a peaceful solution in Myanmar that also reflects a continued commitment to human rights and fundamental freedoms, as outlined in the ASEAN Charter. We welcome close coordination between the Special Envoy of the ASEAN Chair on Myanmar and the Special Envoy of the UN Secretary-General on Myanmar to ensure synergy in this important endeavor. We take note of Canada’s investment of $288.3 million in development and humanitarian assistance to advance efforts toward an inclusive political settlement and sustainable peace in Myanmar.</li>\n</ol>\n\n<h2>Economic Cooperation</h2>\n\n<ol start=\"8\">\n\t<li>Enhance ASEAN-Canada economic cooperation, including through the timely conclusion of the ASEAN-Canada Free Trade Agreement which will bring both economic and strategic benefits to Canada and ASEAN by enhancing ASEAN’s connections to global value chains and improve market access and encourage investment for both ASEAN and Canada.</li>\n\t<li>Intensify Canada’s commitment on provision of targeted technical assistance, aligned with ASEAN bodies and priorities, including through the Expert Deployment Mechanism and Canadian Trade and Investment Facility for Development to support ASEAN’s Community-building efforts, as ASEAN moves towards a stronger and more resilient ASEAN Economic Community.</li>\n\t<li>Enhance cooperation in key sectors such as, Industry 4.0, Cybersecurity, digital trade, 5G, Internet of Things (IoT) and other emerging technologies, aiming to connect ASEAN and Canadian companies, including MSMEs and the ASEAN’s digital transformation agenda, including the Bandar Seri Begawan Roadmap for mutual benefits.</li>\n\t<li>Strengthen collaboration by encouraging new initiatives among research institutes, higher education institutes and enterprises to promote science, education technology, technology and innovation development in the region through capacity-building, technology transfer, and sharing of best practices on advanced applicable technology and commercialisation.</li>\n\t<li>Welcome Canada’s support for the implementation of the Master Plan on ASEAN Connectivity (MPAC 2025) and exploring possible synergies between the MPAC 2025 and Canada’s connectivity-related initiatives in line with the “Connecting the Connectivities” approach.</li>\n\t<li>Strengthen cooperation on food security and nutrition, in particular to promote trade and investment, capacity building, sharing of experience and best practices, research and development, agricultural product and agro-food innovation, as well as infrastructure development in the agricultural sector.</li>\n\t<li>Welcome Canada’s ongoing support for women’s economic empowerment in ASEAN, including work on strengthening MSME policies to promote the full economic potential of women entrepreneurs.</li>\n</ol>\n\n<h2>Socio Cultural Cooperation</h2>\n\n<ol start=\"15\">\n\t<li>Reiterate our commitment for an ASEAN fit for the future that is agile, resilient and can respond to all hazards. We welcomed Canada’s support to ASEAN’s COVID-19 efforts including the contribution of CAD3.5 million to the COVID-19 ASEAN Response Fund; provision of more than 10 million items of personal protective equipment (PPE) to ASEAN; support to the ASEAN BioDiaspora Virtual Centre (ABVC) to enhance and accelerate ASEAN efforts to prevent, detect and respond to COVID-19; provision of PPE and other critical supplies to the Institut Pasteur du Laos; support to the International Atomic Energy Agency to enable the provision of COVID-19 diagnostic kits, equipment and training in nuclear-derived detection techniques.</li>\n\t<li>Continue to support the ASEAN Post-2015 Health Development Agenda and the ASEAN Comprehensive Recovery Framework (ACRF) through Canada’s long-term Mitigation of Biological Threats (MBT) Programme, which also helped ASEAN combat the COVID-19 pandemic.</li>\n\t<li>Deepen cooperation on the ASEAN Agreement on Disaster Management and Emergency Response (AADMER) (Work Programmes, including by building the capacity of the ASEAN Coordinating Centre for Humanitarian Assistance on disaster management (AHA Centre)). We welcomed Canada’s commitment to further bolster ASEAN health-security capabilities through targeted investments (biosafety, biosecurity and disease surveillance) in the new ASEAN Centre for Public Health Emergencies and Emerging Diseases (ACPHEED).</li>\n\t<li>Support the implementation of the Action Plan (2018-2025) of the ASEAN Consensus on the Protection and Promotion of the Rights of Migrant Workers through cooperation with the ASEAN Committee on the Implementation of the ASEAN Declaration on the Protection and Promotion of the Rights of Migrant Workers (ACMW) under the Tripartite Action for the Protection and Promotion of the Rights of Migrant Workers in the ASEAN Region (TRIANGLE) in ASEAN Programme.</li>\n\t<li>Support the announcement to create an ASEAN-Canada Trust Fund, as a responsive mechanism to advance the Plan of Action to implement the Joint Declaration on ASEAN-Canada Enhanced Partnership.</li>\n\t<li>Welcome Canada’s strong commitment to advance gender equality and empowerment of women and girls under its Feminist Foreign Policy and Feminist International Assistance Policy to narrow the development gap, and building a more peaceful, more inclusive and more prosperous world.</li>\n\t<li>Promote a sustainable and resilient future of the region, including through pursuing complementarities between the ASEAN Community Vision 2025 and the UN 2030 Agenda for Sustainable Development.</li>\n\t<li>Strengthen efforts in advancing the Women, Peace and Security (WPS) agenda globally, including through the Elsie Initiative for Women in Peace Operations and regionally, the ‘Empowering Women for Sustainable Peace’ initiative and cooperation with UN Women and the ASEAN Institute for Peace and Reconciliation such as the ASEAN-led WPS module development and training for the ASEAN officials. Welcome Canada’s commitment to host a series of WPS dialogues in 2023, to support the implementation of the WPS agenda in ASEAN and meaningfully engaging women for an inclusive and sustainable approach to peace.</li>\n\t<li>Support for ASEAN Community building efforts including ASEAN institutions through the utilisation of the Canada Fund for Local Initiatives.</li>\n\t<li>Enhance people-to-people ties between Canada and ASEAN, by strengthening the ongoing Canada-ASEAN Scholarships and Educational Exchanges for Development (SEED) program, which to date, has welcomed 325 ASEAN students to Canada.&nbsp;</li>\n</ol></div>\n      "
}