{
  "path": "/en/news/statements/2021/06/24/canadian-report-blames-iranian-recklessness-shoot-down-ukraine",
  "pageTitle": "Canadian report blames Iranian recklessness for shoot-down of Ukraine International Airlines Flight 752 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, as well as the Minister of Foreign Affairs, Marc Garneau, and the Minister of Transport, Omar Alghabra, today issued the following statement on the release of the Government of Canada’s report entitled “The Downing of Ukraine International Airlines Flight 752: Factual Analysis:”</p>\n\n<p>“Today, the Government of Canada released a report that confirms that Iranian civilian and military authorities, through their decisions, actions, and omissions, are fully responsible for the downing of Flight PS752, which tragically took the lives of 176 innocent people, including 55 Canadian citizens, 30 permanent residents, and many more with ties to Canada. The report highlights the Iranian authorities’ recklessness, incompetence, and wanton disregard for human life. It also concludes that Iran’s official account of events is disingenuous, misleading, and superficial, and deliberately ignores key factors. This confirms Canada’s view that Iran’s actions and omissions in relation to Flight PS752 amount to violations of its obligations under international law.</p>\n\n<p>“The report was produced by the Canadian Forensic Examination and Assessment Team, led by former CSIS Deputy Director Jeff Yaworski. The Government established the Forensic Team in October 2020 and mandated it to compile and analyze all available information about Flight PS752. This work is part of Canada’s broader efforts to uncover the truth about what happened and hold the perpetrators to account.</p>\n\n<p>“According to the report, Iranian authorities positioned anti-aircraft systems on high alert near a civilian airport, without implementing basic protections like closing the airspace over Tehran or notifying airlines. All planes flying into or out of Tehran’s airport that night were at risk, including four civilian flights that took off immediately before Flight PS752 with hundreds of passengers on board going to major international hubs. In fact, the totality of available information leads the Forensic Team to conclude that Iran tracked multiple targets, but could not differentiate between passenger aircraft and legitimate threats.</p>\n\n<p>“The families and loved ones of the victims deserve a full explanation of Iran’s dangerous and deliberate choice to keep its airspace open, and a full accounting of the Iranian military’s training and command and control procedures for anti-aircraft operations. Iran has not addressed the numerous deficiencies the Forensic Team has identified.&nbsp;</p>\n\n<p>“Iran must also account for the cover-up that followed the downing of Flight PS752, including bulldozing the crash site before investigators arrived. Iran still owes these answers to the victims’ loved ones so they can have a measure of closure. And Iran owes these answers to the world, because without them, no country, airline, or passenger can have confidence in the safety of Iranian airspace.</p>\n\n<p>“Canada will vigorously pursue full reparations for the downing and the harm that Iran has caused to the victims and their families. This includes, but is not limited to, seeking a full accounting of the events that took place, complete transparency regarding the ongoing criminal prosecutions, and concrete guarantees by Iran that measures have been taken to ensure such a tragedy never happens again. Canada also will be taking action to demand accountability from Iran in international forums.</p>\n\n<p>“In addition, we will continue working with international partners to improve investigative protocols for shoot-down situations, and to advance the Safer Skies Initiative to better protect passengers from the risk of flying in or near conflict zones.</p>\n\n<p>“To the families and loved ones of the victims: we will never walk away from our commitment to get you the answers you deserve, and we will take every measure necessary to ensure justice is served. As a country, we are here to support you through this heartbreak and sadness, and we will continue to honour the memory of those who were lost.”</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/publications/flight-vol-ps752/factual_analysis-analyse_faits.aspx?lang=eng\">The Downing Of Ukraine International Airlines Flight 752: Factual Analysis</a><strong>&nbsp;&nbsp; </strong></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/flight-vol-ps752.aspx?lang=eng\">Canada’s response to Ukraine International Airlines Flight 752 tragedy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/10/forensic-team-to-support-canadas-ongoing-response-to-ukraine-international-airlines-flight-ps752-tragedy.html\">Forensic team to support Canada’s ongoing response to Ukraine International Airlines Flight 752 tragedy</a></li>\n\t<li><a href=\"https://www.bst-tsb.gc.ca/eng/medias-media/discours-speeches/2021/03/a20f0002-20210318.html\">Release of Iran’s final safety investigation report into the downing of PS752</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-national-day-remembrance-victims-air-disasters\">Prime Minister of Canada marks first anniversary of downing of Ukraine International Airlines Flight 752</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-national-day-remembrance-victims-air-disasters\">Prime Minister of Canada marks National Day or Remembrance for Victims of Air Disasters</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/initiatives/safer-skies-initiative\">Safer Skies Initiative </a></li>\n</ul></div>\n      "
}