{
  "path": "/en/news/itineraries/2018/09/22/itinerary-sunday-september-23-2018",
  "pageTitle": "Itinerary for Sunday, September 23, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>Montréal, Quebec</h2><p><b>1:30 p.m. </b>The Prime Minister will attend the welcoming ceremony with military honours for Prime Minister of Spain Pedro Sánchez.</p><p>The Royal Canadian Hussars Armoury<br>4185 chemin de la Côte-des-Neiges</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to arrive no later than 1:00 p.m.</li></ul></ul><p><b>2:30 p.m.</b> The Prime Minister will hold a bilateral meeting with Prime Minister of Spain Pedro Sánchez.</p><p>Monet Room, Sofitel Montreal Golden Mile Hotel<br>1155 rue Sherbrooke Ouest <b>&nbsp;</b></p><p><b>Notes for media: </b></p><ul><ul><li>Photo opportunity at the beginning of the meeting</li><li>Media are asked to present themselves to the accreditation desk on the second floor no later than 2:00 p.m.</li></ul></ul><p><b>3:45 p.m.</b> The Prime Minister will hold a joint media availability with Prime Minister of Spain Pedro Sánchez.</p><p>Paloma Picasso Room, Sofitel Montreal Golden Mile Hotel<br>1155 rue Sherbrooke Ouest</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to present themselves to the accreditation desk on the second floor no later than 3:15 p.m.</li></ul></ul><p><b>5:00 p.m.</b> The Prime Minister will participate in an armchair discussion with Prime Minister of Spain Pedro Sánchez at the Canada 2020 Global Progress Summit.</p><p>Oval Ballroom, The Ritz-Carlton Hotel<br>1228 rue Sherbrooke Ouest</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to present themselves to the green room on the second floor no later than 4:30 p.m.</li></ul></ul></div>\n      "
}