{
  "path": "/en/news/itineraries/2018/03/11/itinerary-monday-march-12-2018",
  "pageTitle": "Itinerary for Monday, March 12, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Itinerary for the Prime Minister, Justin Trudeau, for Monday, March 12, 2018:</p><p><b>Ville de Saguenay (Chicoutimi), Quebec</b></p><p><strong>10 a.m.</strong> The Prime Minister and the Premier of Quebec, Philippe Couillard, will participate in a roundtable with aluminum industry leaders.</p><p>NRC’s Aluminium Technology Centre<br>501 Boulevard de l’Université Est</p><p><b>Notes to media: </b></p><ul><li>Photo opportunity at the beginning of the roundtable</li><li>Media are asked to arrive no later than 9:15 a.m.</li></ul><p><b>Ville de Saguenay (Jonquière), Quebec</b></p><p><strong>1 p.m.</strong> The Prime Minister and the Premier of Quebec will participate in a brief tour and meet with workers of the Rio Tinto AP60 Technology Centre. A joint media availability will follow.</p><p>Rio Tinto AP60 Technology Centre</p><p><b>Notes to media: </b></p><ul><li>Pooled photo opportunity of visit</li><li>Open coverage of media availability</li><li>Media must present themselves to the Aluminium Operations Centre at 1655 Rue Powell, Jonquière, no later than 11:30 am. Media will be escorted by bus to the AP60 Technology Centre. Satellite trucks will be able to follow.</li><li>Attire: Long pants, long sleeve shirts, and closed toe footwear must be worn.</li></ul><p><b>Alma, Quebec</b></p><p><strong>3:30 p.m.</strong> The Prime Minister will meet with workers of the Rio Tinto Alma Smelter.</p><p><i>Closed to media</i></p><p><b>Media appearances</b></p><p><strong>7:40 a.m.</strong> An interview with the Prime Minister will air on ICI Radio-Canada Première Saguenay–Lac-Saint-Jean, <i>Y'a des matins</i>.</p><p><strong>2:10 p.m.</strong> A live interview with the Prime Minister will air on the CNBC network.</p><p><strong>8 p.m.</strong> An interview with the Prime Minister will air on CNN, <i>Anderson Cooper 360°</i>.</p></div>\n      "
}