{
  "path": "/en/news/news-releases/2017/10/03/prime-minister-travel-united-states-and-mexico",
  "pageTitle": "Prime Minister to travel to the United States and Mexico | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Washington, D.C., from October 10 to 11, and to Mexico City from October 12 to 13.</p><p>The Prime Minister will visit Washington, D.C. to take part in a keynote conversation with Pattie Sellers at the 2017 Fortune Most Powerful Women (MPW) Summit on October 10. The conversation will be an opportunity to discuss the importance of gender equality and the ways women’s economic empowerment helps create economic growth that works for everyone.</p><p>While in Washington, D.C., the Prime Minister will also meet with United States President Donald J. Trump to discuss issues of importance to both countries, including international security and our vital trade and economic relationship.</p><p>On October 12, Prime Minister Trudeau will travel to Mexico City for his first official visit to Mexico. There, he will meet with Mexican President Enrique Peña Nieto to discuss trade, regional cooperation and ways to further strengthen Canada-Mexico ties. While in Mexico, the Prime Minister will honour the victims of recent earthquakes and participate in events with civil society.</p><h2>Quotes</h2><blockquote><p>“Gender equality is a priority for Canada, both at home and abroad. When women have an active voice at the table, we all benefit – communities, businesses and governments. At Fortune’s MPW Summit this year, I look forward to sharing how Canada is working to advance gender equality.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The United States is Canada’s top economic partner, and it’s important that we continue to work together to strengthen trade, investment and economic opportunity for people on both sides of our border. I look forward to discussing with President Trump how to enhance our mutual prosperity and security.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and Mexico are important partners on many issues, including trade, culture, the environment and regional cooperation. I am excited to visit Mexico for the first time as Prime Minister to meet with President Peña Nieto and engage with civil society to deepen relations between our two countries.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade between the two countries was valued at nearly $882&nbsp;billion in 2016, and Canada is the largest secure supplier of energy to the U.S.</li><li>The two countries share the longest, secure border in the world, over which 400,000 people and $2.4 billion worth of goods and services cross daily.</li><li>Canada is the number one export destination for most American states, and cross-border trade and investment supports nearly nine millions jobs in the United States.</li><li>Canada and Mexico are among each other’s largest two-way trading partners, and bilateral trade between the two countries, valued at over $40 billion in 2016, continues to grow annually.</li><li>Canada offered assistance to Mexico in the wake of recent devastating earthquakes.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States Relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico Relations</a></li><li><a href=\"https://www.fortuneconferences.com/most-powerful-women-summit-2017/\">Fortune Most Powerful Women Summit</a></li></ul></div>\n      "
}