{
  "path": "/en/news/readouts/2020/05/11/prime-minister-justin-trudeau-speaks-president-colombia-ivan-duque-marquez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of Colombia Iván Duque Márquez | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Colombia,&nbsp;Iván&nbsp;Duque&nbsp;Márquez,&nbsp;to discuss the latest developments on COVID-19 in&nbsp;each of their&nbsp;countries, and&nbsp;around the world.</p>\n\n<p>President Duque offered his condolences for the loss of the six Canadian Armed Forces members in the CH-148 helicopter accident near Greece last month.</p>\n\n<p>The two leaders exchanged information on their respective efforts to fight the pandemic&nbsp;and protect the health, safety, and economic well-being of their citizens, particularly the most vulnerable.</p>\n\n<p>The two leaders also discussed the crisis&nbsp;in Venezuela and&nbsp;its humanitarian impact in the region&nbsp;which is heightened by the pandemic. They underscored the&nbsp;need for&nbsp;continued&nbsp;close collaboration&nbsp;and a concerted international effort to address this challenging situation.</p>\n\n<p>Prime Minister Trudeau offered his warm congratulations to President Duque on Colombia’s accession to the&nbsp;Organisation&nbsp;for Economic Co-operation and Development, becoming its 37<sup>th </sup>member.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial,&nbsp;territorial, and international&nbsp;partners&nbsp;to minimize&nbsp;its&nbsp;health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/colombia-colombie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Colombia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}