{
  "path": "/en/news/news-releases/2019/06/29/prime-minister-concludes-productive-g20-leaders-summit",
  "pageTitle": "Prime Minister concludes productive G20 Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G20 Leaders’ Summit in Osaka, Japan, and welcomed the conclusions outlined in the G20 Leaders Declaration.</p>\n\n<p>At the Summit, Prime Minister Trudeau highlighted the importance of working together to grow economies that benefit everyone. He underscored the need to create new opportunities for the middle class in order to help people regain confidence in the future.</p>\n\n<p>Under Japan’s leadership, this year’s G20 Summit built on many of the themes of Canada’s 2018 G7 Presidency, including combatting climate change, promoting clean energy, growing the middle class, and advancing gender equality.</p>\n\n<p>In advance of the Summit, the Prime Minister took part in a meeting with European partners to discuss a number of global issues, and agreed on the importance of G20 collaboration in addressing the world’s most pressing challenges.</p>\n\n<p>During the Summit, the Prime Minister stressed the need for G20 countries to work together to defend the rules-based international order, build economies that work for more people, and protect our shared environment for future generations. He also promoted open trade and investment, and met with several world leaders to discuss the opportunities for businesses and working people created by the new CPTPP trade agreement.</p>\n\n<p>At the Summit, the Prime Minister also called for stronger and more decisive action to counter violent extremism in all its forms, including online. He took part in a conversation with the President of France, Emmanuel Macron, and the Prime Minister of Australia, Scott Morrison, to build on this call.</p>\n\n<p>Prime Minister Trudeau attended the launch of EMPOWER along with Her Majesty Queen Maxima of the Netherlands and Ivanka Trump. A Canadian-led initiative, the EMPOWER program will advance women’s economic empowerment and representation at senior levels of business around the world.</p>\n\n<p>As part of G20 efforts on global health, the Prime Minister announced $150 million in funding for the Global Financing Facility in support of Every Woman Every Child, to advance the health and nutrition of women, children, and adolescents in developing countries. The decision follows Canada’s recent <a href=\"https://pm.gc.ca/eng/news/2019/06/04/government-canada-makes-historic-investment-promote-health-and-rights-women-and\">historic investment</a> in women and girls’ health and sexual and reproductive health rights, announced at the Women Deliver conference earlier this month.</p>\n\n<p>Prime Minister Trudeau welcomed Japan's leadership on fighting climate change and eliminating plastic pollution, including through the G20 plastic waste implementation framework. He stressed the need to step up our collective climate action and leverage international organizations like the G20 to face this challenge. The Prime Minister also highlighted Canada’s leadership to safeguard our world’s oceans, coasts, and coastal communities, and called on others to come together to protect these shared resources.</p>\n\n<p>While in Osaka, the Prime Minister hosted a Lima Group meeting. Leaders discussed the ongoing crisis in Venezuela and continued to call for a democratic, peaceful, Venezuelan-led resolution.</p>\n\n<p>The Prime Minister also met with the President of South Korea, Moon Jae-in, the Prime Minister of Vietnam, Nguyễn Xuân Phúc, the Prime Minister of Spain, Pedro Sánchez, and the United Nations Secretary General, Antonio Guterres.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Making sure more people share in the benefits of economic growth is the best way we can help people around the world feel confident in the future. The G20 Summit was a chance to promote economies that work for everyone, and help create new opportunities for the middle class. By working together, we can make life better for people in all our countries, and build a better future that everyone can share in.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>EMPOWER is a Canadian-led initiative that will help make sure women have equal access to the necessary financing, capital, land, skills development and training, leadership opportunities, and market opportunities to grow their own businesses.</li>\n</ul>\n\n<ul>\n\t<li>As a founding donor to the Global Financing Facility (GFF), Canada has committed a total of $410 million to the GFF Trust Fund from 2015 to 2023.</li>\n\t<li>The GFF works with 36 countries where women, children, and adolescents face the greatest health and nutrition needs, and helps countries transform how they invest in health to accelerate progress towards the Sustainable Development Goals.</li>\n\t<li>On June 17, 2019, Canada announced the signing of two memoranda on clean energy cooperation with Japan. One commits both countries to advance cooperation in the areas of clean energy, energy efficiency, and oil and gas, and to accelerate action on climate change in multilateral fora. The second commits to greater collaboration in clean energy areas like carbon capture utilization and storage technologies.</li>\n</ul>\n\n<ul>\n\t<li>On June 26, 2019 Canada announced two new initiatives that will build on work already underway to address extremist and terrorist online content and advance the Christchurch Call commitments. Canada committed up to $1 million to Tech Against Terrorism to create a digital repository to notify smaller companies when new terrorist content is detected. Canada will also collaborate on a Youth Summit on Countering Violent Extremism Online.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.g20.org/en/\">G20</a></li>\n\t<li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada’s participation at the 2019 G20 Leaders’ Summit</a></li>\n\t<li>&nbsp;<a href=\"https://pm.gc.ca/eng/news/2019/06/29/statement-members-lima-group\">Statement by Members of the Lima Group </a>&nbsp;</li>\n\t<li><a href=\"https://www.globalfinancingfacility.org/\">Global Financing Facility</a></li>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2019/06/canada-and-japan-announce-clean-energy-cooperation-at-g20.html\">Canada and Japan Announce Clean Energy Cooperation at G20</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2019/06/government-of-canada-announces-initiatives-to-address-violent-extremist-and-terrorist-content-online.html\">Government of Canada Announces Initiatives to Address Violent Extremist and Terrorist Content Online</a></li>\n</ul></div>\n      "
}