{
  "path": "/en/news/statements/2018/03/08/prime-minister-welcomes-second-report-canada-united-states-council",
  "pageTitle": "Prime Minister welcomes second report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the second report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders:</p><p>“I am pleased to welcome today, on <a href=\"http://www.swc-cfc.gc.ca/commemoration/iwd-jif/index-en.html\">International Women’s Day</a>, the <a href=\"https://advancingwomeninbusiness.com/\">Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders</a>’ second report, which explores how we can expand women’s role in science, technology, engineering, and mathematics (STEM).</p><p>“This report highlights the important work that we all need to do – businesses, governments, and educational institutions – around education, promotion, mentorship and empowerment so more women have the opportunities they need to thrive in STEM on both sides of the border.</p><p>“We have seen incredible progress in recent years as more and more women entered the field and started changing the game, but more progress is needed. I thank the Council for their thoughtful recommendations on what can and needs to be done to address the specific barriers that girls and women face, and to eliminate the gender gap that continues to exist.</p><p>“As underscored in <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a>, Canada will continue to be a strong supporter of openness and diversity in STEM as we know how important it is for the future of our communities, our environment, our health, and our economy.”</p></div>\n      "
}