{
  "path": "/en/news/news-releases/2022/08/19/secretary-general-north-atlantic-treaty-organization-jens-stoltenberg",
  "pageTitle": "Secretary General of the North Atlantic Treaty Organization Jens Stoltenberg to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, will travel to Canada from August 24 to 26, 2022. He will visit Edmonton, Alberta, Cambridge Bay, Nunavut, and Cold Lake, Alberta.</p>\n\n<p>During the visit, the Prime Minister and the Secretary General will advance shared priorities and discuss global challenges including threats to Euro-Atlantic security – particularly Russia’s illegal and unjustifiable invasion of Ukraine – as well as climate change and its impacts on defence and security, especially in the Arctic.</p>\n\n<p>On August 25, while in Cambridge Bay, the Prime Minister and the Secretary General will visit one of the sites of the North Warning System – a significant part of the North American Aerospace Defence Command (NORAD) – and the <a href=\"https://www.canada.ca/en/polar-knowledge/CHARScampus.html\">Canadian High Arctic Research Station</a>. They will also meet with local community and Inuit leaders, as well as Canadian Armed Forces personnel deployed to Cambridge Bay as part of <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-nanook.html\">Operation NANOOK</a>-NUNAKPUT.</p>\n\n<p>On August 26, the Prime Minister and the Secretary General will travel to <a href=\"https://www.canada.ca/en/air-force/corporate/wings/4-wing.html\">4 Wing Cold Lake</a>, &nbsp;one of Canada’s fighter bases, to discuss Canada’s contributions to NATO as well as Canada’s partnership in NORAD and Canada’s recently announced plan to modernize continental defence, including $38.6 billion over the next twenty years, thereby bolstering NATO’s western and northern flank. They will also meet with Canadian Armed Forces personnel. Prime Minister Trudeau and Secretary General Stoltenberg will hold a bilateral meeting to advance shared priorities, including ambitious climate action, Canada’s ongoing commitment to NATO, the Defence Innovation Accelerator for the North Atlantic, which will harness the best of new technology for transatlantic security, and the NATO Climate Change and Security Centre of Excellence, which is being established in Montreal.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I look forward to welcoming Secretary General Stoltenberg back to Canada, where we will advance action on critical issues for Canada and the Alliance, ranging from international security to climate change and its impacts. Together, we will continue working closely with Allies and partners to address today’s threats and security challenges, defend our values and way of life, and reinforce the rules-based international system now and into the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau and Secretary General Stoltenberg last met on the margins of the NATO Summit in Madrid, Spain in June&nbsp;2022.</li>\n\t<li>The Secretary General last visited Canada in July 2019.</li>\n\t<li>Canada is a founding member of NATO. Since its inception in 1949, NATO has been a central pillar of Euro-Atlantic defence and a cornerstone of Canadian defence and security policy.</li>\n\t<li>At the latest NATO Summit in Madrid, the Prime Minister announced Canada’s intention to host NATO’s North American Regional Office of the Defence Innovation Accelerator for the North Atlantic (DIANA). DIANA will concentrate on new emerging and disruptive technologies that NATO has identified as priorities including artificial intelligence, big-data processing, quantum-enabled technologies, autonomy, biotechnology, novel materials, and space.</li>\n\t<li>Canada is currently contributing to the following NATO operations, missions, and activities:\n\t<ul>\n\t\t<li>Supporting NATO assurance and deterrence measures in Central and Eastern Europe through <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a>. This includes:\n\t\t<ul>\n\t\t\t<li>leading NATO’s multinational enhanced Forward Presence Battle Group Latvia, as Framework Nation, since 2017;</li>\n\t\t\t<li>providing a General Officer and staff to Multinational Division Headquarters - North in Latvia;</li>\n\t\t\t<li>providing CF-18 fighter aircraft to conduct surveillance and air policing activities in Europe; and</li>\n\t\t\t<li>providing two Kingston-class maritime coastal defence vessels to Standing NATO Mine Countermeasures Group 1.</li>\n\t\t</ul>\n\t\t</li>\n\t\t<li>Supporting training and capacity building efforts in the Middle East under <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-impact.html\">Operation IMPACT</a>, including through NATO Mission Iraq; and</li>\n\t\t<li>Deploying personnel to NATO’s Kosovo Force through <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-kobold.html\">Operation KOBOLD</a>.</li>\n\t</ul>\n\t</li>\n\t<li>Canada has placed 3,400 Canadian Armed Forces personnel across all branches of the service at a higher state of readiness to deploy to the NATO Response Force in Eastern Europe, should these forces be requested by NATO.</li>\n\t<li>Canada is providing two CC-130 Hercules aircraft, operating out of the United Kingdom, to support Allies’ bilateral donations to Ukraine.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.nato.int/\">North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/30/prime-minister-and-nato-leaders-strengthen-transatlantic-security\">Prime Minister and NATO Leaders strengthen transatlantic security</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/29/prime-minister-justin-trudeau-meets-nato-secretary-general-jens\">Prime Minister Justin Trudeau meets with NATO Secretary General Jens Stoltenberg</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/29/statement-prime-minister-natos-invitation-finland-and-sweden-join\">Statement by the Prime Minister on NATO’s invitation to Finland and Sweden to join the Alliance</a></li>\n</ul></div>\n      "
}