{
  "path": "/en/news/readouts/2022/03/23/prime-minister-justin-trudeau-meets-prime-minister-finland-sanna-marin",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Finland Sanna Marin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Finland, Sanna Marin.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Marin strongly condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and praised the courage and leadership of President Volodymyr Zelenskyy and the Ukrainian people. The leaders discussed the effects of Russian President Vladimir Putin’s war of choice on global security. They agreed to strengthen coordination among partners and allies to defend democratic values and the rules-based international&nbsp;system.</p>\n\n<p>The prime ministers discussed the economic and social consequences of the war in Ukraine, including rising energy and food prices, and efforts by Canada and Finland to provide support to Ukrainians fleeing violence.</p>\n\n<p>The two leaders committed to creating good jobs and economic opportunities, including through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA). Prime Minister Trudeau shared his appreciation for Finland’s leadership on climate change and the transition to a circular economy that retains and recovers as much value as possible from resources, including through ambitious targets and innovation.</p>\n\n<p>The leaders discussed the effective cooperation of Arctic Council members in pausing participation under Russia’s leadership and agreed to further coordinate the council’s engagements to maintain stability in the Arctic region.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Marin agreed to continue coordinating closely on efforts to put an end to Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/21/prime-minister-travel-belgium-meet-allies-and-partners-continue\">Prime Minister to travel to Belgium to meet with allies and partners to continue addressing Russia’s invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/arctic_council-conseil_arctique/index.aspx?lang=eng\">Canada and the Arctic Council</a></li>\n</ul></div>\n      "
}