{
  "path": "/en/news/statements/2018/10/11/statement-prime-minister-international-day-girl",
  "pageTitle": "Statement by the Prime Minister on the International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the Girl:</p><p>“On the&nbsp;<a href=\"https://www.swc-cfc.gc.ca/commemoration/whm-mhf/girl-fille-en.html\">International Day of the Girl</a>, we celebrate girls around the world: their voices, their power, their future. We also take a hard look at the challenges they face, and keep working to make sure girls everywhere can thrive.</p><p>“In Canada and around the globe, girls are changing their communities and shaping their societies for the better. They show us that when girls have the support and opportunities to achieve their highest potential, they transform our world. Yet even in 2018, girls across the board face higher rates of violence, poverty, discrimination, and other systemic barriers that hold them back. It’s long past time for that to change. The activists on the frontlines of that fight are girls – demanding their rights be respected and that their voices be heard.</p><p>“This year’s United Nations theme for the day – <a href=\"http://www.un.org/en/events/girlchild/\">With Her: A Skilled GirlForce</a> – reminds us that everyone benefits when girls have the chance to excel. We need to increase learning opportunities for girls so they can succeed in the workforce of today and tackle the jobs, and challenges, of tomorrow.</p><p>“Every young person should have access to quality education and modern skills training. Canada is helping bring the international community together to make this a priority. At the G7 Summit earlier this year, Canada and partners announced a historic investment of nearly $3.8 billion – the largest of its kind – to support quality education for women and girls in conflict and crisis situations. At the United Nations General Assembly last month, Canada built on this momentum, and welcomed an additional $527 million to help developing countries give every child access to the education and training they need to succeed.</p><p>“In Canada, women in the workforce have been one of the most powerful sources of growth in recent decades – but we need to do more to increase girls’ access to career guidance, mentorship, and networks they need to transition from school to work. The Government of Canada is expanding training and education programs for women and girls in science, technology, engineering and mathematics fields, and helping girls enter careers in skilled trades through the new <a href=\"https://www.canada.ca/en/employment-social-development/services/apprentices/grants.html\">Apprenticeship Incentive Grant for Women</a>. These measures will help reduce gender gaps and build a more prosperous future for all Canadians.</p><p>“International Day of the Girl falls in the middle of <a href=\"https://www.swc-cfc.gc.ca/commemoration/whm-mhf/index-en.html\">Women’s History Month</a> – a reminder that girls grow up to change the world. It’s up to all of us to teach girls that they can be anything they want to be – and to recognize the girls making an impact right now in our communities. Together, we can make sure girls have the freedom and support they need to keep transforming our world and chasing down their dreams.”</p></div>\n      "
}