{
  "path": "/en/news/readouts/2021/10/05/prime-minister-justin-trudeau-speaks-prime-minister-australia-scott",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Australia Scott Morrison | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Australia, Scott Morrison, who congratulated him on his re-election.</p>\n\n<p>The two leaders discussed the close cooperation between Canada and Australia in strengthening global trade and upholding human rights as well as the rules-based international order.</p>\n\n<p>Prime Minister Trudeau noted the importance of international solidarity in helping to secure the release of Michael Kovrig and Michael Spavor, and thanked Prime Minister Morrison for Australia’s strong support.</p>\n\n<p>The prime ministers underscored the important role of the Five Eyes partnership in addressing common security challenges. They also discussed the new trilateral security partnership between Australia, the United Kingdom, and the United States. They agreed that Canada and Australia will continue to strengthen their partnership to advance common objectives in the Indo-Pacific region.</p>\n\n<p>The two leaders discussed ongoing efforts in Canada and in Australia to fight the COVID-19 pandemic, save lives, and support people and communities through the crisis. They also discussed the importance of fighting climate change and building a cleaner future.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Morrison agreed to continue coordinating efforts to help resettle vulnerable Afghans fleeing the Taliban. They committed to keeping in touch in the months ahead.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/australia-australie/bilateral_relations_bilaterales/canada_australia-australie.aspx?lang=eng\">Canada-Australia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/videos/2021/09/24/prime-minister-trudeau-announces-release-michael-kovrig-and-michael-spavor\">Prime Minister Trudeau announces the release of Michael Kovrig and Michael Spavor</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/ntnl-scrt/fv-cntry-mnstrl-en.aspx\">Five-Country Ministerial</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2021/09/more-than-3000-evacuees-arrive-in-canada-from-afghanistan.html\">More than 3,000 Evacuees Arrive in Canada from Afghanistan</a></li>\n</ul></div>\n      "
}