{
  "path": "/en/news/statements/2018/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p><p>“Today, on the <a href=\"http://www.un.org/en/events/indigenousday/\">International Day of the World’s Indigenous Peoples</a>, we celebrate Indigenous peoples around the world, and reaffirm our commitment to make sure the rights of Indigenous peoples are recognized and implemented.</p><p>“Indigenous peoples span 90 countries and as many as 5,000 distinct cultures and languages. In Canada, First Nations, Inuit, and Métis peoples have shaped our history and identity as a country. Their cultures have marked every aspect of Canada’s past and present, and today, Indigenous peoples continue to make our country a better place to live. Through initiatives like the new Reconciliation Framework Agreement for Bioregional Oceans Management and Protection, Indigenous peoples continue to play an instrumental role in safeguarding Canada's rich natural environment.</p><p>“As we celebrate Indigenous cultures, we also take a hard look at the past and present. We must acknowledge the oppression and discrimination Indigenous peoples have faced for centuries, work to right persisting historic wrongs, and build – together – a more equal and inclusive Canada for everyone.</p><p>“We cannot move forward as a country if Indigenous peoples continue to be held back. In the coming months and years, we will continue to work together with Indigenous peoples on the basis of a nation-to-nation, Inuit-Crown, and government-to-government relationship, in a spirit of inclusion and reconciliation. We will pursue a renewed partnership that embodies the principles laid out in the United Nations Declaration on the Rights of Indigenous Peoples. Together, we will work to improve the quality of life for Indigenous peoples in Canada and to ensure that they have full control over their own lives.</p><p>“On behalf of the Government of Canada, I encourage you to reflect on the many distinct cultures and traditions of Indigenous peoples, and the tremendous contributions they have made to societies everywhere. Together, we can build a world where the rights of Indigenous peoples are respected, where their voices are honoured, and where their communities thrive.”</p></div>\n      "
}