{
  "path": "/en/news/statements/2022/09/06/statement-prime-minister-welcoming-new-prime-minister-united-kingdom",
  "pageTitle": "Statement by the Prime Minister welcoming the new Prime Minister of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the new Prime Minister of the United Kingdom, Elizabeth Truss:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Elizabeth Truss on becoming Prime Minister of the United Kingdom.</p>\n\n<p>“Canada and the United Kingdom enjoy one of the strongest relationships in the world, rooted in centuries of shared history, values, and traditions. I look forward to working with Prime Minister Truss to further strengthen the relationship between our two countries and make life better for people on both sides of the Atlantic. This includes continuing to build a strong economic recovery from the pandemic that benefits everyone, and strengthening democracy, human rights, and the rules-based international system, while also standing up for Ukraine in the face of Russia’s ongoing aggression. With the goal of being the world’s first net-zero consistent cap and trade market, the United Kingdom is a longstanding partner on climate action and pollution pricing, as well as protecting nature and biodiversity.</p>\n\n<p>“The United Kingdom is Canada’s largest commercial partner in Europe and one of our most important globally. As we continue negotiations toward a comprehensive, ambitious, and inclusive Canada-United Kingdom Free Trade Agreement, as well as the U.K.’s accession to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, we will keep working to increase trade and create good middle-class jobs and new opportunities for people in both countries. Our countries also work closely together through the United Nations, the World Bank, and other international organizations. We are the only two countries to be members of the G7, the G20, the North Atlantic Treaty Organization, and the Commonwealth.</p>\n\n<p>“I thank former Prime Minister Boris Johnson for his partnership over the years and wish him all the best in his future endeavours.”</p></div>\n      "
}