{
  "path": "/en/news/readouts/2020/09/10/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the eighteenth call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>First Ministers continued their discussion on COVID-19, and the coordinated actions being taken by federal, provincial, and territorial governments to support Canadian workers and businesses during the pandemic. The leaders talked about measures to support economic recovery, as well as the implementation of the Safe Restart Agreement and the Safe Return to Class Fund. They also spoke about the Canada Emergency Wage Subsidy, and the transition from the Canada Emergency Response Benefit to the Employment Insurance program. The Prime Minister also committed to holding a meeting with First Ministers to discuss health transfers.</p>\n\n<p>First Ministers also discussed the measures at the Canada-U.S. border and trade issues between the two countries, including U.S. tariffs on Canadian aluminum products. The Prime Minister confirmed that he would continue to engage with premiers on decisions regarding the border. He also reiterated the Government of Canada’s commitment to stand up for aluminum workers across the country. &nbsp;</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, and the need to continue closely coordinating their efforts to minimize the impacts of possible future waves of COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/07/16/joint-communique-safe-restart-agreement\">Joint Communiqué – Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school\">Prime Minister announces support for a safe return to school</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/07/supporting-canadian-workers-and-businesses-with-a-redesigned-canada-emergency-wage-subsidy.html\">Supporting Canadian Workers and Businesses with a redesigned Canada Emergency Wage Subsidy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2020/08/government-of-canada-announces-plan-to-help-support-canadians-through-the-next-phase-of-the-recovery.html\">Government of Canada announces plan to help support Canadians through the next phase of the recovery</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/statements/2020/08/06/statement-deputy-prime-minister-us-tariffs-imports-canadian-aluminum\">Statement by the Deputy Prime Minister on US tariffs on imports of Canadian aluminum</a></li>\n</ul></div>\n      "
}