{
  "path": "/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support",
  "pageTitle": "First Ministers’ statement on shared public health approach to support restarting the economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2><strong>Context </strong></h2>\n\n<p>Governments in Canada have taken wide-ranging steps within their own constitutional jurisdictions to slow and contain the spread of COVID‑19, including through strong and continued federal/provincial/territorial (FPT) collaboration. As the first wave of the virus’ activity passes, all governments want to safely restore economic activity, while protecting the health of Canadians. Until there is a vaccine or effective treatment for COVID‑19, strong measures must be in place for this new normal phase of living with COVID‑19 to contain future waves or outbreaks and protect Canadians and economies across the country.</p>\n\n<p>While there will be regional differences during this process, all governments intend to continue their present collaboration in the interest of all Canadians. Governments will make decisions suited to their jurisdictions, geography, and disease activity. These decisions will be informed by experiences in other countries in Asia, Europe, and around the world – particularly those who had outbreaks earlier than Canada and who have achieved demonstrable successes. A shared key objective is to minimize the risk of another wave of COVID‑19 that forces governments to re-impose severe restrictions, further damaging the social and economic fabric of communities.</p>\n\n<p>Using public health as a foundation, these principles, criteria, and measures will help guide governments to ease restrictions as they work to restore economic activity and address future outbreaks. Continued collaboration will help to protect the health of Canadians and the economy.</p>\n\n<p>First Ministers acknowledge the importance of restarting the economy through a gradual and phased approach. As governments develop plans to gradually lift restrictions, they will focus on:&nbsp;</p>\n\n<ul>\n\t<li>protecting the health of Canadians;</li>\n\t<li>easing restrictions gradually;</li>\n\t<li>protecting high-risk groups (e.g., those vulnerable due to age, underlying health conditions, remote location, close living spaces, and temporary or unstable living spaces);</li>\n\t<li>ensuring our public health capacity remains strong to prepare for, and respond to, any future waves of the pandemic, including through enhanced testing and contact tracing; and,&nbsp;&nbsp;</li>\n\t<li>supporting a broad range of economic sectors.</li>\n</ul>\n\n<h2><strong>Principles</strong></h2>\n\n<p>Science and evidence-based decision-making – Decisions to ease and/or reinstate measures should be based on current public health situations, as advised by public health officials.</p>\n\n<p>Coordination and collaboration – First Ministers firmly believe that strong collaboration to date has served Canadians well, and that continued collaboration is key to ongoing success. First Ministers agree to support the continuation of supply chains across borders to maintain economic activity, access to protective equipment, and food security for all Canadians. Governments will continue to share information about challenges and opportunities. Since provinces and territories and the Government of Canada may need to move forward at different times and in potentially different ways, it will be important to maintain the coordination and collaboration that has taken place throughout the pandemic (e.g., consistent guidance on occupational health and safety requirements).</p>\n\n<p>Accountability and transparency – Each government will continue to be accountable to its residents, and will monitor the impacts of measures to restart the economy and provide updates on progress. Data sharing is critical to understanding the situation across Canada and is essential to informing efforts to re-open segments of the economy.</p>\n\n<p>Flexibility and proportionality – Public health measures should be relaxed based on the level of threat, and in a controlled and phased manner, based on information that may change over time. This includes information on risks around the disease and health of Canadians as well as social and economic benefits to them. It also includes local and sectoral contexts (e.g., different workplaces, educational institutions, and social activities). It is recognized that there will be differences within jurisdictions on approaches taken and that measures may need to be re-imposed if the understanding of the information changes.</p>\n\n<h2><strong>Criteria and measures needed to restart the economy</strong></h2>\n\n<p>Epidemiological analysis, health care service arrangements, population distribution, geographic considerations, and economic dynamics are some of the factors that might affect decisions on where, when, and how measures are lifted. Within this context, First Ministers agree that decisions should be informed by the following criteria and measures:</p>\n\n<p>COVID-19 transmission is controlled – The incidence of new cases should be maintained at a level that health care systems can manage, with substantial clinical care capacity in reserve. There is a stabilisation in the number of hospitalisations and/or new cases, with the possible exception of isolated outbreaks.</p>\n\n<p>Sufficient public health capacity is in place to test, trace, and isolate all cases – Testing and contact tracing are in place so that suspected cases are detected quickly and all confirmed cases are effectively isolated, while all close contacts are traced, quarantined, and monitored.</p>\n\n<p>Expanded health care capacity exists for all patients, COVID-19 and non-COVID-19 – Health care systems should support all needs, including dealing with any future outbreaks, recognizing that this will be achieved through having surge capacity in place and other means (e.g. virtual care) to enable the system support for COVID and non-COVID patients. Provinces and territories are best suited to determine how comprehensive health care services are supported, including primary care, diagnostic services, and acute care services including elective surgeries and non-COVID emergencies. Measures should address health-sector human resource capacity, and resources for personal protective equipment, drugs, and other medical supplies. Procurement of supplies will ensure that there is adequate supply on hand in case of a resurgence of the virus and to support enhanced testing.</p>\n\n<p>Supports are in place for vulnerable groups/communities and key populations – Measures are in place to prevent the uncontrolled spread of the virus in vulnerable populations, which can directly lead to increased community spread. Sustained measures are in place to protect seniors, residents of group living facilities, workers in close quarters, inmates, homeless people, and Indigenous people and those living in remote locations, along with health care workers and other essential workers. Sufficient testing and personal protective equipment is available to monitor and limit COVID‑19 infection in these groups.</p>\n\n<p>Workplace preventative measures – Support and monitoring of workplace protocols are in place to prevent the introduction and spread of COVID‑19. These protocols could include administrative controls, hand hygiene, environmental cleaning, and access to personal protective equipment where physical distancing is not possible. Strong collaboration and oversight processes are in place to ensure protocols are being met.</p>\n\n<p>Avoiding risk of importation – Restrictions on non-essential domestic travel should be eased and managed in a coordinated manner. Re-opening of international borders and access for non-Canadian residents may only happen in later stages, taking into account the spread of the virus outside Canada, and measures to avoid the spread of the virus for everyone entering the country (e.g., self-isolation, testing).</p>\n\n<p>Engage and support – The success of managing COVID-19 will depend on the ability of communities to use and keep the necessary measures, particularly for public services. Governments will support communities in managing local disease activity, including in child care, schools, and public transportation. Governments will also work with industry and economic sectors to support optimal health, reduced viral activity, and protection of the economy as it restarts.</p>\n\n<h2><strong>Ongoing collaboration as Canada transitions to a new normal</strong></h2>\n\n<p>First Ministers will continue to meet regularly to discuss measures taken to restart the Canadian economy in a gradual way that support a new normal of living with COVID‑19, while protecting the health of Canadians.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2020/04/28/prime-minister-releases-joint-statement-first-ministers-restarting\">Prime Minister releases joint statement by First Ministers for restarting the economy</a></li>\n</ul></div>\n      "
}