{
  "path": "/en/news/news-releases/2020/11/22/prime-minister-concludes-virtual-g20-leaders-summit",
  "pageTitle": "Prime Minister concludes virtual G20 Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the G20 Virtual Leaders’ Summit, hosted by the Kingdom of Saudi Arabia, and welcomed the conclusions outlined in the G20 Leaders’ Declaration.</p>\n\n<p>​In virtual meetings at the Summit, Prime Minister Trudeau highlighted the importance of G20 leadership and coordinated action to beat the COVID-19 pandemic, restore economic growth, and take ambitious action to fight climate change. He also stressed the need to respect and defend the rule of law and&nbsp;human rights, including women’s rights, in order to prevent persecution and mistreatment around the world. Now, more than ever, our global success depends on attaining a better path towards peace, prosperity, and sustainability.</p>\n\n<p>He advocated for the equitable access to vaccines, therapeutics, and diagnostics, because we can’t end the pandemic in Canada without ending it everywhere. He also reaffirmed Canada’s support and contributions to initiatives like COVAX and multilateral institutions like the World Health Organization, which are essential in our fight against COVID-19.</p>\n\n<p>During the Summit, the Prime Minister noted the importance of putting people at the heart of recovery efforts. From creating new jobs to building economic growth that benefits all our citizens, we must work to rebuild societies that are safer, fairer, and more resilient. As we all work towards recovering from the virus, we need to prioritize support for marginalized groups, empower women and youth, and continue to respect fundamental democratic principles, including freedom of the press. This also involves the need to reduce the digital divide and ensure equal access to quality education and financial services to people around the world. He also raised the importance of predictable, inclusive, sustainable, and transparent rules-based trade to the global economic recovery efforts.</p>\n\n<p>The Prime Minister also underscored the need to take meaningful action to fight climate change, and reiterated the importance of collective G20 action to support a cleaner, greener, and more competitive world, in line with the Paris Agreement commitments and the Sustainable Development Goals.</p>\n\n<p>Together, through shared values and effective multilateral cooperation, the world will be able to build back better and emerge stronger from the pandemic.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Only together can we tackle the greatest challenges of today and tomorrow, and create a more resilient world that works for everyone. The G20 Virtual Leaders’ Summit was an opportunity to expand global efforts to fight COVID-19, restore economic growth, and combat climate change.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The G20 is the premier forum for international economic cooperation. It gathers the ​leaders of the largest economies of the world to discuss financial and socioeconomic issues.</li>\n\t<li>The G20 Summit included sessions entitled: Overcoming the Pandemic and Restoring Growth and Jobs; and Building an Inclusive, Sustainable and Resilient Future. It also included leaders’ side events on pandemic preparedness and response, as well as on safeguarding the planet.</li>\n\t<li>Collectively, G20 members represent around 80 per cent of the world’s economic output, two-thirds of global population, and three-quarters of international trade.</li>\n\t<li>Italy will host the G20 Summit in 2021.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/11/22/g20-leaders-declaration\">G20 Leaders’ Declaration</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://g20.org/en/Pages/home.aspx\">G20</a></li>\n</ul></div>\n      "
}