{
  "path": "/en/news/statements/2016/12/31/statement-prime-minister-canada-mark-new-year",
  "pageTitle": "Statement by the Prime Minister of Canada to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p>\n<p>\"Happy New Year, everyone.</p>\n<p>\"Tonight is 150 years in the making, and a once-in-a-lifetime opportunity to ring in the New Year together. From coast to coast to coast, spectacular events are planned to usher in Canada's 150<sup>th&nbsp;</sup>birthday.</p>\n<p>\"Before we leave 2016 behind, I want to thank you. Over the last year, we have accomplished a great deal together to strengthen the middle class and those working hard to join it.</p>\n<p>\"We cut taxes on middle-class Canadians, and put more money in the pockets of nine out of ten families through a new, more generous Canada Child Benefit; we also signed one of the most progressive free trade deals in history that will benefit Canadians across the country.</p>\n<p>“As we mark Canada 150 over the next year, we will honour the generations of Canadians who have come together to create opportunities for one another. We will celebrate the courage and vision of those who came before us, and the hard work and ambition of Canadians – like you – who have made Canada the success story that it is today.</p>\n<p>“For my part as Prime Minister, I will always stand against the politics of fear and division, and focus on what brings us together – that is my New Year’s resolution to you.</p>\n<p>\"In 2017, and beyond, our government will take further steps to help the middle class and those working hard to join it. And, together, I know we will continue to build the diverse and prosperous country that we are all so proud to call home.</p>\n<p>\"Canada, let's make this year&nbsp;<em>our</em>&nbsp;year.</p>\n<p>\"On behalf of our family, Sophie and I wish you a wonderful night and all the best in 2017.\"</p></div>\n      "
}