{
  "path": "/en/news/news-releases/2020/03/26/prime-minister-announces-canadas-ambassador-united-states",
  "pageTitle": "Prime Minister announces Canada’s Ambassador to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and the United States enjoy a unique and strong relationship based on deep people-to-people connections, shared geography, common values and interests, and mutually beneficial economic and security ties.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Kirsten Hillman has been appointed as Canada’s Ambassador to the United States.</p>\n\n<p>Ms. Hillman has served as Canada’s Acting Ambassador to the United States since August 2019, and was previously the Deputy Ambassador. Ms. Hillman has played critical roles in the negotiations of important trade agreements for Canada, including the new NAFTA and the Comprehensive and Progressive Agreement for Trans-Pacific Partnership. More recently, she has worked in close collaboration with partners in the United States and around the world to support Canada’s efforts to fight the COVID-19 pandemic, including the temporary border agreement reached last week between Canada and the United States.</p>\n\n<p>As Canada’s Ambassador to the United States, Ms. Hillman will continue to lead important outreach efforts to build on the already strong relationship enjoyed by our two countries.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today, we are announcing Kirsten Hillman as our country’s next Ambassador to the United States. When we worked together to negotiate the new NAFTA, I saw Ms. Hillman’s ability to stand up for Canadians and fight for their interests. She combines exceptional knowledge and skills, and is a gifted diplomat. Ms. Hillman will remain a trusted advisor, friend, and counsellor in Washington and is our point person with Congress and the U.S. administration. I know that Canadians will be well represented by her.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada has an embassy in Washington, D.C. and consulates general in Atlanta, Boston, Chicago, Dallas, Denver, Detroit, Los Angeles, Miami, Minneapolis, New York, San Francisco and Seattle. The United States maintains an embassy in Ottawa and consulates general across Canada.</li>\n\t<li>The United States is also Canada’s most important ally and defence partner. We have worked side by side in the North American Aerospace Defence Command since the pact was created in 1957, and cooperate closely in support of international peace and security.</li>\n\t<li>Canada and the United States share a land border nearly 9,000 kilometres long, which facilitates over $2.4 billion dollars in daily trade generated by deeply integrated supply chains across many sectors of the economy.</li>\n\t<li>Canada is the largest customer for the United States, and buys more goods from the United States than China, Japan and the United Kingdom combined. Canada is also the top trading partner for most U.S. states.</li>\n</ul>\n\n<h2>Biographical notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/03/26/kirsten-hillman\">Kirsten Hillman</a></li>\n</ul></div>\n      "
}