{
  "path": "/en/news/statements/2020/04/28/statement-prime-minister-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on the National Day of Mourning:</p>\n\n<p>“Today, flags across Canada will be flown at half-mast as we pause to remember those who died, were injured, or became ill from their work. On the National Day of Mourning, we pay tribute to these Canadians, and remind ourselves of the need to do all we can to protect workers.</p>\n\n<p>“The Government of Canada is committed to helping prevent further tragedies and protect the health and safety of Canadians in the workplace. This year, we recognize the thousands of Canadians who continue to provide essential services during the COVID-19 pandemic. They go to work so that we can put food on the table for our families, get the prescriptions we need to stay healthy, and access the services we need to be well – and we will continue to do everything we can to keep them safe and healthy.</p>\n\n<p>“That includes working with our labour and industry partners to ensure the right resources, like <a href=\"https://www.ccohs.ca/products/publications/covid19/\">additional sector-specific best practices</a>, are in place, and offering a number of <a href=\"https://www.ccohs.ca/topics/hazards/health/pandemics/\">online courses and resources related to COVID-19</a> free of charge through the Canadian Centre for Occupational Health and Safety. We encourage all employers to go above and beyond standard health and safety measures to make sure that workers are safe in this extraordinary situation, and we thank the many employers who are doing just that.</p>\n\n<p>“As individuals, we also need to do our part to protect these workers. That means listening to our public health experts, and following guidelines put in place by retailers, health care facilities, and other essential service providers, so we can keep them and their families safe. We are grateful for the tireless work of those on the front lines, and we will do whatever we can to help them do their job and support them through this difficult time.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to take a moment today to pay tribute the workers who have lost their lives, been injured, or fallen ill on the job. The health and safety of all workers is a priority for us, and we will continue to work closely with provinces and territories and other partners to make sure that all Canadians can work in a healthy and safe workplace.”</p></div>\n      "
}