{
  "path": "/en/news/statements/2018/05/23/statement-prime-minister-anniversary-komagata-maru-incident",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the Komagata Maru incident | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 104<sup>th</sup>&nbsp;anniversary of the Komagata Maru incident:</p><p>“In 1914, the Komagata Maru, a steamship chartered by businessman Gurdit Singh, docked at a quiet pier in Vancouver. On board were 376&nbsp;passengers of Sikh, Muslim, and Hindu faith seeking a better life in Canada. As fellow British subjects, they thought they would be treated with dignity and respect by the Canadian authorities, and would be allowed entry to this land.</p><p>“At the time, unjust federal regulations prohibited passengers from disembarking in Canada if their vessel had stopped at any non-Canadian port during their journey. The government forced most of the passengers onboard the Komagata Maru to return to India, where some were later killed and others imprisoned.</p><p>“Two years ago in the House of Commons, I <a href=\"/en/news/speeches/2016/05/18/komagata-maru-apology-house-commons\">apologized on behalf of the Government of Canada</a> to all those affected by this tragic incident. They came to Canada to be part of our community and help build this country – and we turned them away. In the years since, we have learned, and continue to learn, from the mistakes of our past. We have chosen a more compassionate path, dedicated ourselves to doing better, and grown prosperous by opening our arms and hearts to people from around the world.</p><p>“Today, we remember the victims of the Komagata Maru incident. We honour the contributions of Canada’s South Asian community and all people who have come to this country and offered the best of who they are. We will always stand up for – and celebrate – the diversity that makes Canada strong, proud, and prosperous.”</p></div>\n      "
}