{
  "path": "/en/news/news-releases/2016/01/14/prime-minister-announces-support-innovative-water-technologies",
  "pageTitle": "Prime Minister announces support for innovative water technologies in Southern Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will invest $12&nbsp;million in the Southern Ontario Water Consortium (SOWC) – a group of post-secondary institutions that work together to advance clean and innovative water technologies.</p>\n<p>Canadians want to live in a country where a clean environment and a strong economy go hand-in-hand. Today’s funding will allow the SOWC to partner with 90 businesses and not-for-profit organizations to support their efforts to increase innovation in 80&nbsp;collaborative projects. &nbsp;</p>\n<p>These funds will help partners accelerate the commercialization of new water-related technologies, bring their products to market, and take advantage of growing global demand.</p>\n<p>In southern Ontario, these technologies will also assist municipalities better manage their wastewater, reduce energy consumption in treatment plants, improve water quality, and create a more sustainable environment.</p>\n<p><strong>Quotes</strong></p>\n<p><strong>“</strong>This project is a great example of government, post-secondary institutions, not-for-profit organizations, and businesses working together to drive innovation and create new jobs and opportunities for Canadians. We are committed to building a more sustainable economy that ensures we leave a cleaner and healthier environment for our children and grandchildren.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;</em></p>\n<p>\"The University of Waterloo is leading research efforts to find effective solutions for water-based concerns in southern Ontario. This new funding will allow us to continue this work that will benefit the region, the environment and ultimately all Canadians.”<br><em>- Dr. Feridun Hamdullahpur, President, University of Waterloo&nbsp;</em></p>\n<p>“The support announced today will be a catalyst for industry-led collaborations in the water sector.&nbsp;It will enable the SOWC to help Ontario companies leverage world-class academic expertise and real-world demonstration facilities to develop much-needed water technologies. We look forward to working with our many partners to advance globally-competitive and market-ready products and services in this important sector.”<br>- <em>Brenda Lucas, Executive Director, Southern Ontario Water Consortium</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The new clean technologies that will be developed by the SOWC are related to wastewater treatment and reuse, drinking water treatment, groundwater monitoring and remediation.</li>\n<li>The up to $12 million in Government of Canada support is being provided to the University of Waterloo, on behalf of the SOWC, through FedDev Ontario’s Investing in Commercialization Partnership initiative.</li>\n<li>Through this investment, the SOWC is expected to create or maintain 520 jobs over the course of the project and support at least 14 new partnerships.</li>\n<li>The SOWC’s 10 strategic partners include: Fleming College, McMaster University, Queen’s University, Ryerson University, University of Guelph, University of Ontario Institute of Technology, University of Toronto, University of Waterloo, Western University, and Wilfrid Laurier University.</li>\n</ul>\n<p><strong><br>Related Products</strong></p>\n<p><a href=\"/en/news/backgrounders/2016/01/14/funding-southern-ontario-water-consortium\">Backgrounder: Funding for the Southern Ontario Water Consortium</a></p>\n<p><strong>Associated Links</strong></p>\n<p><a href=\"http://www.feddevontario.gc.ca/eic/site/723.nsf/eng/00598.html\">News Release: Government of Canada Invests in Clean Water Technology</a><br><a href=\"https://sowc.ca\">Southern Ontario Water Consortium</a><br><a href=\"http://www.feddevontario.gc.ca/eic/site/723.nsf/eng/h_01864.html\">Investing in Commercialization Partnerships</a></p></div>\n      "
}