{
  "path": "/en/news/itineraries/2021/01/13/prime-ministers-itinerary-thursday-january-14-2021",
  "pageTitle": "Prime Minister’s itinerary for Thursday, January 14, 2021 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2><strong>Ottawa, Ontario</strong></h2>\n\n<p>Private meetings.</p>\n\n<p><strong>10:00 a.m.&nbsp;</strong>The Prime Minister will attend the Cabinet retreat.</p>\n\n<p><em>Closed to media.</em></p>\n\n<p><strong>11:30 a.m.&nbsp;</strong>A pre-recorded keynote interview with the Prime Minister will air as part of the REUTERS NEXT Virtual Forum to discuss Canada’s domestic and international response to COVID-19. Viewers can register to watch the interview via the following link: <a href=\"https://reutersevents.com/events/next/register.php\">https://reutersevents.com/events/next/register.php</a></p>\n\n<p><strong>2:15 p.m.&nbsp;</strong>The Prime Minister, joined by the Minister of National Defence Harjit Sajjan, will participate in a virtual ceremony to mark the change of command of the Canadian Armed Forces. Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay will be in attendance.</p>\n\n<p>The ceremony will be livestreamed on the Canadian Armed Forces’ official Facebook page: <a href=\"https://www.facebook.com/CanadianForces/\">https://www.facebook.com/CanadianForces/</a></p>\n\n<p><strong>7:00 p.m.&nbsp;</strong>The Prime Minister will participate in “A New Home in Canada,” a virtual celebration hosted by the Syrian Canadian Foundation to mark the fifth anniversary of Canada welcoming Syrian refugees as part of Operation Syrian Refugees. Minister of Immigration, Refugees and Citizenship Marco Mendicino, Minister of Families, Children and Social Development Ahmed Hussen, and Minister of Transport Omar Alghabra will be in attendance.</p>\n\n<p>The event will be livestreamed on the Syrian Canadian Foundation’s Facebook page: <a href=\"https://www.facebook.com/SyrianCanadianFoundation/\">https://www.facebook.com/SyrianCanadianFoundation/</a></p></div>\n      "
}