{
  "path": "/en/news/statements/2021/11/08/statement-prime-minister-75th-anniversary-viola-desmond-challenging",
  "pageTitle": "Statement by the Prime Minister on the 75th anniversary of Viola Desmond challenging racial segregation and discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75th&nbsp;anniversary of Viola Desmond challenging racial segregation and discrimination:</p>\n\n<p>“On this day in 1946, Viola Desmond, a successful Black Canadian businesswoman, refused to leave the segregated whites‑only section of the Roseland Theatre in New Glasgow, Nova Scotia. Ms. Desmond simply wanted to watch a movie that day, and to do so in dignity. Instead, she was forcibly removed from the theatre, then jailed, convicted, and fined.</p>\n\n<p>“Exclusion and segregation, through laws, policies, and practices, have been a reality for Black Canadians and their communities since before Confederation. Ms.&nbsp;Desmond’s courageous act of defiance was bold and very necessary. Her subsequent appeal inspired the pursuit of equality and the fight against racial discrimination throughout the country. By taking a stand against the injustice of segregation, she helped advance the civil rights movement across Canada and laid the groundwork for the movement to fight anti-Black racism.</p>\n\n<p>“It took decades for Ms.&nbsp;Desmond to be exonerated, having been posthumously pardoned by the Lieutenant Governor of Nova Scotia in 2010. Since then, her contributions to Canadian society have been recognized in a number of ways. A stamp was issued by Canada Post in 2012 to honour Ms.&nbsp;Desmond’s bravery. In 2017, she was designated a <a href=\"https://www.pc.gc.ca/en/culture/clmhc-hsmbc/res/information-backgrounder/Viola_Desmond\">national historic person</a> by the Government of Canada. In 2018, she became the first Canadian woman and the first Black Canadian featured on a regularly circulating Canadian bank note. Her story is also part of the permanent collection at the Canadian Museum for Human Rights.</p>\n\n<p>“Ms.&nbsp;Desmond was a hero, and her challenge of racial segregation and discrimination has helped shape the Canada we know today. Unfortunately, the struggle for equality is not over, as many Black Canadians and their communities continue to face discrimination, racism, and a lack of equal opportunity every day. The government is committed to bringing an end to it. On this anniversary, I hope that Ms.&nbsp;Desmond’s story, and her quest for freedom, justice, and equality, will help inspire a new generation of Canadians to work on ending racism, and protecting and promoting human rights across the country.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to honour Viola Desmond today, as well as her courage, her work to advance equality, and her dedication to creating a better, fairer, and more inclusive country.”</p></div>\n      "
}