{
  "path": "/en/news/readouts/2022/02/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy<strong>, </strong>to express solidarity and support to the people in Ukraine.</p>\n\n<p>Prime Minister Trudeau strongly condemned the large-scale military aggression by the Russian Federation against the territorial integrity, sovereignty and independence of Ukraine. He reiterated that Ukraine’s security is also Europe’s security and that of all democratic states seeking to uphold fundamental principles of international law and state sovereignty. The Prime Minister reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine. President Zelenskyy thanked Prime Minister Trudeau for announcing meaningful and punitive sanctions against those in Russia who are directly responsible for this tragedy or who help support it. President Zelenskyy also welcomed recently arrived lethal aid from Canada, noting that two shipments had arrived earlier this week. Prime Minister Trudeau commended the President’s courage and resolve to lead the Ukrainian people through this unprovoked and unjustified attack.</p>\n\n<p>The Prime Minister stressed that Russia’s actions are blatant violations of international law, and will not be tolerated. Prime Minister Trudeau committed to follow developments very closely in the coming days, and the two leaders discussed ways in which Canada could continue to support Ukraine in the immediate future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine\">Statement by the Prime Minister on Russia’s attack in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/22/canada-announces-support-address-situation-ukraine\">Canada announces support to address the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/canada-strongly-condemns-russias-move-to-recognize-independence-of-two-regions-within-ukraine.html\">Canada strongly condemns Russia’s move to recognize independence of two regions within Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}