{
  "path": "/en/news/readouts/2020/06/04/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their twelfth weekly call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>The Prime Minister began by&nbsp;acknowledging the thousands of Canadians peacefully protesting in recent days against anti-Black racism and systemic discrimination in Canada and around the world.&nbsp;Leaders discussed the real need to fight racism and injustice.&nbsp;</p>\n\n<p>First Ministers discussed measures that federal, provincial, and territorial governments could put in place to safely restart Canada’s economy, while preparing for any future resurgence of the virus.</p>\n\n<p>First Ministers continued their discussions of the tools and investments needed to significantly expand testing and contact tracing to manage current COVID-19 cases, while quickly containing any potential future outbreaks.</p>\n\n<p>They also discussed initiatives to ensure frontline healthcare workers and other essential workers receive the personal protective equipment they need to do their jobs safely, and protect our most vulnerable citizens, particularly seniors.&nbsp;</p>\n\n<p>The Prime Minister updated the premiers on continuing measures at the Canada-US border to curtail non-essential travel, while permitting the free flow of trade and commerce.</p>\n\n<p>First Ministers reiterated that a national economic restart must be done safely and collaboratively.&nbsp;</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, and the need to closely co-ordinate their efforts, moving forward.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/06/02/prime-ministers-remarks-securing-personal-protective-equipment-and\">Prime Minister’s remarks on securing personal protective equipment and supplies</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/01/prime-minister-announces-support-help-communities-create-jobs-and\">Prime Minister announces support to help communities create jobs and restart the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/05/22/prime-ministers-remarks-testing-contact-tracing-and-sharing-data-fight\">Prime Minister’s remarks on testing, contact tracing, and the sharing of data to fight COVID-19</a></li>\n</ul></div>\n      "
}