{
  "path": "/en/news/news-releases/2021/07/06/kanataup-sivuliuqtinga-agajuqaamariga-tusaqtitijuq-taapsuma-queen",
  "pageTitle": "Kanataup Sivuliuqtinga Agajuqaamariga tusaqtitijuq taapsuma Queen agiqtanga taapnauniaqtuq Atanialuk Kikgaqtuqti Kanatamut | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Una Kanataup Angajuqaamariga, Justin Trudeau, oblumi tusaqtitivuq taapsuminga atuliqtauqujaminik, taapna Queen Elizabeth II agiqtuq tikkuaqtauqulugu Mary Simon iniganut Atanialuk Kigaqtuqti Kanatamut.</p>\n\n<p>Atanialuk Kigaqtuqti Kanatamut pinasuaqvigilugu, Ms. Simon kigaqtuqtiuniaqtuq Queen-mut Kanatami. Taapna Kanataup 30-nga Atanialuk Kigaqtuqti Kanatamut taimanganit Kavamaqaliqmata, ammalu 13-nga Atanialuk Kigaqtuqti Kanatamut tikkuaqtanga taapsuma Queen taimanganit 69 aqgaagunik Queengulirami.</p>\n\n<p>Taimanganit ilisariyauqataqsimaluni iqanaijaaqaqsimavuq, Ms. Simon nuqarunagituq uqaujiujuivuq Inuit pijunautiqaqniginik ammalu piusituqaqaqmatta, ammalu pijunautiginik tamaqmik nunaqaqqaaqsimajut. Taimanganit ugataani 40 ukiunut, iqanaijaaqaqsimayuq ajigiingitunik angajuqaarijauluni sivuliuqtini iqanaijaaksani, taikanilu agajuqaaquluni Makivik Corporation, taikani ikajuqpuq sapummilugit ammalu atuqtauquligit Inuit pijunaqniqaqmata tamauna atuliqtitautilugu James Bay ammalu Quebec Taqragani Angiruti. Unatauq agajuqaagulauqtuq maqruiqlluni niruatauluni Inuit Silaqjuaqmi katjiani Katimajit, maana pijitiraqtut Inuit Silaqjuaqmi Katjiani Katimajiujuq, ammalu agajuqaagusimayuq Inuit Tapiriit Kanatami.</p>\n\n<p>Taapna sivuliqpaaq kigaqtuqtimariusimayuq nunaup asingani taapkunuga Silaqjuaq Ukiuqtaqtuq Kajjianut, Ms. Simon sivuliuqtiusimavuq sangitigiaqsimalugit katigajunaqnigat avataannit Inugit ukiuqtaqtuq nunangini aviktuqsimayutigut ammalu silaqjuaqtigut, iqagiyauluni saqitiqatauluni Ukiuqtaqtuq Katimajigit. Taapnatauq aaqiksisimayuq Ukiuaqtaqtuqmi nutaqqat ammalu makkuktut tunngavinganik, ammalu kigaqtuqtiusimavuq nunaup asiginut Kanata tikillugu Denmark.</p>\n\n<p>Niruaqtaujuq tusaqtitaulauqtuq taapkutigut uqatijausimaluta Uqaujiujit Tatimajiginit niruasuut kigaqtuqtiksamik Atanialuk Kigaqtuqti Kanatamut. Ukua katimajiit tiliyausimajut aajiiqatigiiklutik ammalu tunisilutik atiqnik ajungitunik Kanatamiunik taapsumuga Kanataup Agajuqaamariganut sivuliuqtumut isumaginiaqtangit initaaqrunaqtuq taapsumuga.</p>\n\n<h2>Uqaqtut imanna</h2>\n\n<blockquote>\n<p>“Quviasuktunga tusaqtitijunnarama taapna Queen agiqtuq tikkuaqtaujunnaqtuq Mary Simon iniganut Atanialuk Kigaqtuqti Kanatamut. Mary Simon piliriaqainaqtuq inuusiqmini pivaaliqtitivalialuni inuusiliriniqmi, kiinaujaliuqniqmut, ammalu isumaqsurunautimi sapummijautit pijunautinut pijutaujunut Kanatamiunit ammalu atuqtautitiluni pinnarijattinik ammalu malitiaqniqmigut. Tamauna taapna tikkuaqtauniga, qaujimajugut Kanata kigaqtuqtautiaqniaqtuq uukutuutiqattiaqsimakmat piulaamik nunaqaratta. Unattauq Kanatamiutitut qujanamiirumajara Rt. Hon. Richard Wagner, pijitiraqsimayuq aulatsijiuluni Katataup Kavamakuginut aniguqtut amisuuluangitut taqqinik.”</p>\n\n<footer class=\"default\">Una Sivuliuqti Justin Trudeau, Agajuqaamarik Kanatamut</footer>\n</blockquote>\n\n<h2>Sulijut</h2>\n\n<ul>\n\t<li>Kanataup maligaliuqtiqjuangit Queenkunnut angajuqaaqjuanguvuq malikllutik atuqsisimalutik nunaqutitaarisimajamiknut, ukua maligaliaksanut tuttaqvik ammalu Kanataup Katimavikjuanga, Kanata Kavamaqaqpuq tunnganiqattiaqtumik ammalu siraktaujaangituq silaqjuamit. Initaarijauvakllutik pilirijiqaqtut taapkua pitaqaqput kavamaqaramik, una atanialuk kigaqtuqti Kanatamut kigaqtuijuq nunaqaqtitinikkut, Kanataup aviktuqsimajunut angayuqaagat.</li>\n\t<li>Una Atanialuk Kigaqtuqti Kanatamut pijaksangit taapkua kajusitilugit maligaliuqniqmut pijaksani, pijitiraqluni kavamakkunut, kigaqtuqlluni Kanata angiramini ammalu akiani nunalinnut, kajugiqsailuni piulaagutitiluni ammalu Kanatamiut kigaqtutiaqlugit.</li>\n</ul>\n\n<h2>Tamatumiga Titiraqsimajut</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/07/06/mary-simon-oc-oq-0\">Inuusiganik titiraqsimayut</a></li>\n</ul>\n\n<h2>Tamatuminga Uqalimaagatsait</h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en\">Una Atanialuk Kigaqtuqti Kanatamut </a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2021/03/minister-leblanc-announces-advisory-group-to-assist-with-the-selection-of-the-next-governor-general.html\">Minista LeBlanc tusaqtitivuq uqaujiujit tatimajiit ikajuqulugit nirualutik kigaqtuqtiksamik Atanialuk Kigaqtuti Kanatamut </a></li>\n</ul></div>\n      "
}