{
  "path": "/en/news/statements/2019/09/11/statement-prime-minister-anniversary-911-and-national-day-service",
  "pageTitle": "Statement by the Prime Minister on the anniversary of 9/11 and the National Day of Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the terrorist attacks on September 11th, 2001, and on the National Day of Service:</p>\n\n<p>“Like so many Canadians and people around the world, I will never forget where I was on September 11, 2001—the day the United States experienced the deadliest terrorist attacks in its history.</p>\n\n<p>“Today, on the 18th anniversary of this tragedy, we remember the nearly 3,000&nbsp;victims of the attacks, which included 24 Canadians. We offer our condolences to those who continue to grieve their lost loved ones.</p>\n\n<p>“We also pay tribute to the courage, perseverance, and sacrifice of the brave first responders, including the hundreds who lost their lives. Surrounded by destruction and debris, firefighters, police officers, military personnel, and ordinary people raced up the steps of the collapsing towers to rescue survivors, and fought for days to extinguish flames at the Pentagon.</p>\n\n<p>“On this National Day of Service, we pay tribute to these heroes, and every first responder who has made sacrifices in service to their communities and their country.</p>\n\n<p>“We are also reminded of the compassion of Canadians in the small town of Gander in Newfoundland and Labrador, who welcomed stranded airline passengers with open arms. On a day when we witnessed such dark, terrifying events, they showed us all the power of kindness and generosity.</p>\n\n<p>“On behalf of the Government of Canada, I encourage Canadians to honour those who lost their lives, and all those who selflessly offered their help to others on 9/11.”</p></div>\n      "
}