{
  "path": "/en/news/statements/2020/09/18/statement-prime-minister-rosh-hashana",
  "pageTitle": "Statement by the Prime Minister on Rosh Hashana | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Rosh Hashana:</p>\n\n<p>“Tonight at sunset, Jewish communities in Canada and around the world will celebrate Rosh Hashana, the Jewish New Year.</p>\n\n<p>“Rosh Hashana is the beginning of the High Holidays, culminating in Yom Kippur. Normally, it’s a time for families and loved ones to reflect on the past year and their hopes for the future, and come together to pray and share meals.</p>\n\n<p>“This year, we may not be able to celebrate in person, but we’ll continue to dip apples in honey and pray for a sweet and healthy new year for our friends and family, and for all Canadians. As you take part in celebrations over the next few days, please follow official health guidelines to celebrate responsibly, maintain physical distance from others, and wash your hands frequently.</p>\n\n<p>“Although the last few months have been difficult amid the COVID-19 pandemic, let’s look ahead with optimism at the year to come. Since the beginning of the pandemic, you’ve shown us the best of what it means to serve your community. Whether it be by supporting local organizations, or being there for neighbours and essential workers, you have helped your fellow citizens.</p>\n\n<p>“Today is a chance for all of us to celebrate the many contributions of Jewish Canadians. It’s also a time to recommit to fighting antisemitism, hatred, and discrimination in all their forms. We will always stand with the Jewish community, and stand united against hate – and together, we will make our world a better one. Together, we will build a more inclusive Canada.</p>\n\n<p>“On behalf of our family, Sophie and I wish you a healthy, peaceful, and prosperous New Year.</p>\n\n<p>“Shana Tova U’metuka!”</p></div>\n      "
}