{
  "path": "/en/news/statements/2023/03/20/prime-minister-international-day-la-francophonie",
  "pageTitle": "Statement by the Prime Minister on the International Day of La Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of La&nbsp;Francophonie:</p>\n\n<p>“Today, on the <a href=\"https://www.francophonie.org/journee-internationale-de-la-francophonie-2023\">International Day of La&nbsp;Francophonie</a> (in French only), we join Francophones and Francophiles in Canada and around the world to celebrate the richness of the French language, and the heritage and diversity of Francophonie cultures.</p>\n\n<p>“Official bilingualism is one of the pillars of Canada’s identity, and Francophone communities are central to our history and our heritage. French is the first official language of nearly a quarter of all Canadians, and it plays an essential role in making Canada a more inclusive, prosperous, and vibrant country.</p>\n\n<p>“Last year, the Government of Canada held extensive consultations in all provinces and territories to hear from Canadians about the realities and challenges surrounding our two official languages. These conversations are guiding our work to develop the Action Plan for Official Languages 2023-28, which will be introduced later this year. The Action Plan is an important part of our efforts to modernize Canada’s linguistic regime, in addition to improvements to the <em>Official Languages Act</em> set out in Bill&nbsp;C-13 to ensure the promotion of French across the country.</p>\n\n<p>“The French language allows us to maintain close ties with over 300&nbsp;million Francophones on five continents. Canada works with a number of states and governments to promote the French language, cultural diversity, and important shared values. This includes peace, democracy, human rights, gender equality, inclusive growth, education, and economic cooperation for sustainable development. That is why Canada intends to strengthen the already strong ties we have with other Francophone countries.</p>\n\n<p>“On behalf of the Government of Canada, I encourage you to take part in activities taking place in your communities to mark this important day and to share the hashtags #Francophoniedelavenir and #mon20mars on social media. I wish all Francophones and Francophiles in Canada and around the world a wonderful International Day of La&nbsp;Francophonie.”</p></div>\n      "
}