{
  "path": "/en/news/statements/2022/10/01/statement-prime-minister-national-seniors-day",
  "pageTitle": "Statement by the Prime Minister on National Seniors Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Seniors Day:</p>\n\n<p>“Seniors worked hard all their lives to build a better Canada for today and for future generations. On National Seniors Day, I join all Canadians in honouring seniors and their many contributions to our communities across the country.</p>\n\n<p>“Unfortunately, the rising cost of living is hitting many seniors hard. The Government of Canada is putting more money back in the pockets of seniors across the country this year. This past July, we permanently increased the <a href=\"https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security.html\">Old Age Security pension</a> for seniors 75 years old and over by 10 per cent – putting more than $800 in the pockets of full pensioners, and increasing benefits for over three million seniors this year. This builds on improvements we have made to the <a href=\"https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security/guaranteed-income-supplement.html\">Guaranteed Income Supplement</a> to lift thousands of low-income single seniors out of poverty, and as part of our plan to make life more affordable this year, we are working to put an additional $225, on average, in the pockets of qualifying seniors by doubling the GST tax credit for six months.</p>\n\n<p>“Seniors deserve to have a safe and dignified place to call home. Learning from the hard lessons of the pandemic, the Government of Canada has signed agreements with every province and territory to improve long-term care and protect the health and safety of seniors. Earlier this year, we launched the $90&nbsp;million <a href=\"https://www.canada.ca/en/employment-social-development/news/2022/06/backgrounder-age-well-at-home.html\">Age Well at Home initiative</a> to support organizations working to help low-income and vulnerable seniors with everyday tasks such as snow removal, home maintenance, and meal preparation. In addition, through the <a href=\"https://www.canada.ca/en/employment-social-development/programs/new-horizons-seniors.html\">New Horizons for Seniors Program</a>, we provided funding to over 3,000 local projects led by and for seniors that make a difference in communities and help improve seniors’ quality of life. For example, in Port Coquitlam, British Columbia, seniors are engaging virtually with elementary school students through the “Senior Connections: Decreasing Loneliness and Isolation through Music and Memory” project.</p>\n\n<p>“Canada’s seniors have always been there for us, and we need to be there for them. Today, I invite Canadians of all ages to take a moment to connect with a senior in their lives, be it a relative, a family friend, or a neighbour. Lend them a listening ear, run an errand or a chore to support them, or volunteer at a local seniors’ centre. One small action can make a world of difference.”</p></div>\n      "
}