{
  "path": "/en/news/statements/2021/02/07/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 7 to 13, 2021:</p>\n\n<p>“Today, on the first day of the 31st <a href=\"https://www.international.gc.ca/campaign-campagne/idw-sdi/index.aspx?lang=eng\">International Development Week</a>, we recognize the workers, volunteers, and partners whose hard work and sacrifices are making a difference in international development efforts. We also renew our commitment to the United Nations <a href=\"https://www.un.org/sustainabledevelopment/\">Sustainable Development Goals</a>, which lay out an ambitious path for us to build a better world together.</p>\n\n<p>“This year, International Development Week is especially significant, as the global COVID-19 pandemic has reminded us all of the importance of international community and global cooperation. This pandemic has shown us that health crises on one side of the world can rapidly spread and transform the lives of those on the other. That’s why, as we continue to secure millions of vaccines for Canadians, we are also working with our international partners to help people around the world – because no one is safe from COVID-19 until everyone is safe.</p>\n\n<p>“Over the last year, Canada has committed <a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canadas-investments-to-support-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">$1.6 billion to global COVID-19 response efforts</a>. Most recently, in December, Canada announced <a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">$485 million to increase access to medical countermeasures</a> against COVID-19 for developing and vulnerable countries, and ensure vaccines and treatments successfully reach the people that need them most. We also committed to provide $220 million through the COVID-19 Vaccine Global Access (COVAX) Facility’s Advance Market Commitment to purchase vaccine doses for low- and middle-income countries, which will help ensure high-risk people around the world are protected from COVID-19.</p>\n\n<p>“The pandemic has had major social and economic impacts everywhere, and low- and middle-income countries often lack the resources to address these impacts. That’s why we are committed to increasing investments in international development to support developing countries in their response and recovery efforts, and to help them build resilience. Canada is co-leading the Financing for Development in the Era of COVID‑19 and Beyond initiative with the United Nations and Jamaica, which has brought the global community together to propose creative solutions to enable recovery and build a future that is inclusive, sustainable, and resilient. As part of our <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">feminist approach to development</a>, Canada is also working to address the effects of the pandemic on the world’s most vulnerable and marginalized, including its disproportionate social, economic, and psychological impacts on women.</p>\n\n<p>“As people around the world look to a brighter future beyond COVID-19, we must redouble our efforts to build back better. In moving toward this goal, Canada will continue to take action to promote equal access to health care and education, eliminate poverty and inequalities, protect the planet, and advance gender equality at home and abroad. Together, we can create a world where everyone is safe, healthy, and able to reach their full potential.”</p></div>\n      "
}