{
  "path": "/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-vice-president-united-states-america",
  "pageTitle": "Prime Minister Justin Trudeau meets with Vice President of the United States of America Kamala Harris | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Vice President of the United States of America, Kamala Harris, on the margins of the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting.</p>\n\n<p>The Prime Minister and the Vice President reaffirmed their commitment to deepening the U.S.-Canada relationship and covered progress on their implementation of the Roadmap for a Renewed U.S.-Canada Partnership. They discussed the importance of the economic ties between our countries, and of continuing to keep them strong in the interests of all of our citizens. This includes deepening cooperation on supply chains, critical minerals, and clean economic growth as part of our mutual commitment to combatting climate change, which is critical to the health of our societies and to our economies.</p>\n\n<p>Prime Minister Trudeau highlighted the upcoming release of Canada’s Indo-Pacific Strategy. He underlined Canada’s interest in collaborating with the United States to advance shared priorities in the Indo-Pacific, including climate action, infrastructure development, and regional security.</p>\n\n<p>Prime Minister Trudeau thanked Vice President Harris for convening a meeting earlier in the day with the leaders of Japan, Australia, South Korea, and New Zealand to condemn North Korea’s latest missile launch and urge the regime to end its missile and nuclear programs. Prime Minister Trudeau reaffirmed Canada’s commitment to the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON.</p>\n\n<p>The Prime Minister and the Vice President noted the importance of providing continued military, financial, and humanitarian assistance to Ukraine. They pledged to continue working together to hold Russia to account and to help address the conflict’s severe impacts on food and energy security.</p>\n\n<p>The two leaders discussed the ongoing crisis in Haiti, expressing concern at the evolving security and humanitarian crisis. They agreed to continue to work closely with partners in the region to facilitate access for the delivery of humanitarian assistance to those affected, and hold those responsible for the unrest to account.</p>\n\n<p>The Prime Minister and Vice President also discussed our unwavering commitment to upholding our democratic values, and defending people’s rights and freedoms, including a woman’s fundamental right to choose. They denounced the Iranian regime’s continued attacks on the brave women, students, and the people of Iran who are peacefully protesting the tragic killing of Mahsa Amini at the hands of the regime’s so-called ‘morality police.’ The Prime Minister reiterated that Canada is listening to and joining our voice with those who are demanding change and respect for their fundamental human rights.</p>\n\n<p>Prime Minister Trudeau and Vice President Harris agreed to remain in close contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-united-states-vice-president-kamala\">Prime Minister Justin Trudeau meets with United States Vice President Kamala Harris</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n</ul></div>\n      "
}