{
  "path": "/en/news/readouts/2022/06/27/prime-minister-justin-trudeau-meets-prime-minister-japan-kishida-fumio",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Japan, Kishida Fumio, on the margins of the G7 Summit.</p>\n\n<p>The leaders reaffirmed the strategic partnership between Canada and Japan and their shared commitment to a free, open, and inclusive Indo-Pacific region. They agreed to deepen bilateral cooperation on shared priorities, including climate action, energy security, and a strong economic growth that benefits everyone. The leaders also pledged to continue working closely on strengthening the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) to create good middle-class jobs, opportunities for businesses, and increased trade between our countries, while maintaining our commitment to the CPTPP’s high standards.</p>\n\n<p>The prime ministers discussed Russia’s illegal and unjustifiable invasion of Ukraine and agreed to continue close cooperation to protect Ukraine’s sovereignty and territorial integrity. Prime Minister Trudeau underlined Canada’s strong and enduring commitment to support Ukraine’s recovery and welcomed Japan’s assistance to Ukraine.</p>\n\n<p>The leaders expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, notably for the Global South, with shortages and rising prices of food, fuel, and fertilizer. They committed to working together to find practical ways to mitigate these impacts, particularly for the most vulnerable, and to addressing the significant implications for the Indo-Pacific region.</p>\n\n<p>The two leaders discussed their concerns about China’s actions in the region, including in the East China Sea and the South Pacific. They agreed on the importance of continued G7 coordination to uphold the rules-based international order. They also noted their deep concern with the threat of North Korea’s nuclear weapons and ballistic missile programs and reiterated their support for a complete, verified, and irreversible dismantlement of North Korea’s nuclear weapons. The prime ministers reaffirmed their commitment to the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON.</p>\n\n<p>The prime ministers agreed to remain in close contact in the months ahead as Japan prepares to assume the G7 presidency in 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/japan-japon/index.aspx?lang=eng\">Canada and Japan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/09/prime-minister-justin-trudeau-speaks-prime-minister-japan-kishida-fumio\">Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}