{
  "path": "/en/news/statements/2017/05/29/statement-prime-minister-canada-international-day-united-nations",
  "pageTitle": "Statement by the Prime Minister of Canada on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the <a href=\"http://www.un.org/en/peacekeeping/operations/pkday.shtml\">International Day of United Nations Peacekeepers</a>:</p><p>“Today, we honour the brave United Nations (UN) peacekeepers who work selflessly to provide safety and security for people around the world. We also pay tribute to the over 3,500 UN peacekeepers – including 122 Canadians – who have died in the service of peace.</p><p>“The women and men who serve as UN peacekeepers protect people from the worst effects of war – and set the stage for peace. They protect civilians, monitor ceasefires, help combatants disarm, and support peace processes as groups move forward after conflict. Peacekeepers work at the centre of many tense and dangerous situations, often endangering their own lives to help those most in need.</p><p>“Our country has a long and proud history of peacekeeping. Lester B. Pearson, Canada’s fourteenth Prime Minister and then Secretary of State for External Affairs, proposed the first large-scale UN peacekeeping mission during the 1956 Suez Crisis. For his commitment to a peaceful resolution to the crisis, he was awarded the Nobel Peace Prize in 1957.</p><p>“Sixty years later, <a href=\"https://www.canada.ca/en/department-national-defence/news/2017/05/canada_to_host_2017unitednationspeacekeepingdefenceministerialco.html\">Canada will host the 2017 UN Peacekeeping Defence Ministerial</a> as we continue to work with our international partners to strengthen peacekeeping efforts.</p><p>“Peacekeeping embodies Canada’s commitment to the protection of human rights and the empowerment of women and girls. We must ensure women’s voices and experiences are represented in peace processes. There cannot be lasting peace without women.</p><p>“On behalf of the Government of Canada, I thank UN peacekeepers past and present who have dedicated themselves to advance peace and human rights around the world. Their bravery represents humanity at its most selfless. We will continue to work closely with the UN to support peacekeeping operations.”</p></div>\n      "
}