{
  "path": "/en/news/news-releases/2017/04/13/prime-minister-canada-and-president-metis-national-council-welcome",
  "pageTitle": "The Prime Minister of Canada and President of the Métis National Council welcome the Signing of the Canada-Métis Nation Accord | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and the President of the Métis National Council, Clément Chartier, today welcomed the signing of <a href=\"http://www.metisnation.ca/wp-content/uploads/2017/04/Canada-Me%CC%81tis-Nation-AccordEn.pdf\">the Canada-Métis Nation Accord</a> during the first Métis Nation-Crown Summit in Ottawa.</p><p>The Accord marks a significant step towards a renewed government-to-government relationship based on recognition of rights, respect, co-operation and partnership. It outlines the ways in which the Government of Canada and the Métis National Council and its Governing Members will work together to set priorities and develop policy in areas of shared interest. The Accord will bring a coordinated focus across the federal government in setting priorities and obtaining concrete actions and tangible results.</p><p>With initiatives like this, Canadians and the Métis Nation are mapping a way forward on a path of reconciliation and renewal toward a shared, prosperous future.</p><h2>Quotes</h2><blockquote><p>“Last December, I made the promise that federal ministers and Métis Nation leaders would work together to solve important challenges. We did not take that commitment lightly. Today, we are proud to announce our joint signing of the Canada-Métis Nation Accord. While there is still much that needs to be done if we are to address the unique social, cultural, economic, and environmental issues faced by the Métis, we now have a solid foundation upon which to move forward with a respectful, renewed Métis Nation-Crown relationship, for the benefit of all Canadians.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“We are greatly encouraged by entering into a government-to-government, nation-to nation process of engagement with the government of Canada under Prime Minister Trudeau. It offers the opportunity to advance the interests and rights of the citizens of the Métis Nation.”&nbsp;<br>– <cite>Clément Chartier, President of the Métis National Council</cite></p></blockquote><h2>&nbsp; Quick Facts</h2><ul><li>Today's Summit was the second of the three permanent forums to which the Prime Minister committed on December 15, 2016.</li><li>The Métis Nation is represented by the Métis National Council and its Governing Members:&nbsp; the Métis Nation of Ontario, Manitoba Metis Federation, Métis Nation-Saskatchewan, Métis Nation of Alberta and Métis Nation British Columbia.</li><li>As outlined in Budget 2017, the Government of Canada is investing $84.9 million over the next five years and $28.3 million per year afterward on an ongoing basis to build the governance capacity of the Métis National Council and its five provincial Governing Members, as well as to support collaborative work with the Government of Canada on Métis self-government and self-determination.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/canada-metis-nation-accord\">Canada-Métis Nation Accord</a></li><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples</a></li><li><a href=\"https://www.aadnc-aandc.gc.ca/eng/1100100014427/1346434788986\">Indigenous and Northern Affairs Canada - Métis</a></li><li><a href=\"http://www.metisnation.ca/index.php/who-are-the-metis/mnc\">Métis Nation</a></li><li><a href=\"http://www.budget.gc.ca/2017/home-accueil-en.html\">Budget 2017</a></li></ul></div>\n      "
}