{
  "path": "/en/news/news-releases/2018/06/13/prime-minister-welcomes-new-members-youth-council",
  "pageTitle": "Prime Minister welcomes new members to Youth Council | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed 10 new members to his Youth Council. Together, these young Canadians will continue to provide important, non-partisan advice to the Prime Minister and the Government of Canada on issues that matter to young people and all Canadians – including mental health, reconciliation with Indigenous Peoples, diversity, innovation, economic growth that works for everyone, as well as youth employment and youth service.</p><p>They will join the 11 current members, bringing the Youth Council to a total of 21 members. The original 15 members named in 2016 have concluded their mandate and now begin their work as Youth Council Alumni.</p><p>During the last year, the Youth Council has also worked with the Government of Canada to develop Canada’s first-ever youth policy. As part of the consultation phase, the Youth Council, youth-serving organizations, and other youth ambassadors led in-person roundtable discussions across the country and engaged young people on what a youth policy should look like. Young people also submitted ideas through <a href=\"https://youthaction.ca/\">YouthAction.ca</a>.</p><p>Over the summer, further discussions will be held with young people to explore how to create a national youth policy that reflects their priorities and addresses the issues young Canadians care about.</p><h2>Quotes</h2><blockquote><p>“I thank the original 15 members of the Youth Council for their dedication and advice over the last two years. I look forward to hearing the innovative ideas that the new members will bring with them. Their perspectives are crucial to shaping policies that will benefit young people and all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p></blockquote><blockquote><p>“Through the Youth Council, young Canadians have a distinctive platform to convey their unique perspectives, and those of their communities, to the highest levels of government. Their input has immense value to policy-makers, who regularly seek their honest, fearless advice.”<br>—<cite>Peter Schiefke, Parliamentary Secretary to the Prime Minister (Youth)</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Youth Council meets with the Prime Minister, ministers, and other leaders to offer advice on the pressing challenges of our time. Since its creation, the Youth Council has held 6 in-person meetings across the country, leading in-depth discussions with federal ministers, parliamentary secretaries, and other youth leaders. In addition to meeting in-person, Youth Council members collaborate virtually and work closely with youth in their communities to inform their advice to the Prime Minister.</li><li>Youth Council members come from diverse communities and all regions of Canada, and possess a wide range of knowledge and experience. They are appointed for a two-year term.</li><li>The Youth Council Alumni is a network of former Youth Council members who will continue to engage in their communities and make significant impacts in the lives of others.</li><li>In addition, cross-Canada, youth-led consultations were held to inform the development of the <a href=\"/en/news/news-releases/2018/02/13/young-canadians-guide-country’s-first-youth-policy\">first-ever youth policy for Canada</a>.</li><li>Canadians can sign-up to receive news and get involved in engagement opportunities in areas of interest to them on&nbsp;<a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">canada.ca/youth</a>.</li><li>Budget 2018 invested $448.5 million over five years to support the continued doubling of the number of job placements under the Canada Summer Jobs program and to modernize the Youth Employment Strategy.&nbsp;Last summer, nearly 70,000 students received hands-on work experience through summer employment, generating income for their post-secondary education.</li><li>This builds on significant investments through Budgets 2016 and 2017 in the Youth Employment Strategy to help more than 33,000 vulnerable youth develop the skills they need to find work, create 15,000 new green jobs for young Canadians, and provide over 1,600 new employment opportunities for youth in the heritage sector.</li><li>Budget 2017 also introduced the CanCode Program, which provides coding and digital skills education to young Canadians – from kindergarten to grade 12 – and gives them the head start they need to find and keep good, well-paying, in-demand jobs.</li><li>Through a new Student Work Integrated Learning Initiative, the Government of Canada has also created more opportunities for co-op and work-integrated learning experiences for students in science, technology, engineering, and mathematics (STEM) and business programs.</li></ul><h2>Related Product</h2><ul><li>Backgrounder - <a href=\"/en/news/backgrounders/2018/06/13/new-members-prime-minister’s-youth-council\">New Members of the Prime Minister’s Youth Council</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://youthaction.ca/\">Building a youth policy for Canada</a></li><li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li></ul></div>\n      "
}