{
  "path": "/en/news/news-releases/2021/07/06/kanataup-sivuliuqtinga-angajuqkaammaringa-tusartittivuq-kuing",
  "pageTitle": "ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᖓ ᐊᖓᔪᖅᑳᒻᒪᕆᖓ ᑐᓴᕐᑎᑦᑎᕗᖅ ᑯᐃᖕ ᐊᖏᖅᑕᖓ ᑖᓐᓇᐅᓂᐊᖅᑐᖅ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧᑦ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᐅᓇ ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᒻᒪᕆᖓ, ᔭᔅᑎᓐ ᑐᓗᑕᐆ, ᐅᓪᓗᒥ ᑐᓴᕐᑎᑦᑎᕗᖅ ᑖᔅᓱᒥᖓ ᐊᑐᓕᖅᑕᐅᖁᔭᒥᓂᒃ, ᑖᓐᓇ ᑯᐃᖕ ᐃᓕᓴᐱ ll ᐊᖏᖅᑐᖅ ᑎᒃᑯᐊᖅᑕᐅᖁᓪᓗᒍ ᒥᐊᓕ ᓴᐃᒪᓐ ᐃᓂᖓᓄᑦ ᒐᕗᓄ ᔭᓄᓗ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧᑦ. &nbsp;</p>\n\n<p>ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧ ᐱᓇᓱᐊᕐᕕᒋᓗᒍ, ᒥᐊᓕ ᓴᐃᒪᓐ ᑭᒡᒐᖅᑐᐃᓂᐊᖅᑐᖅ ᑯᐃᖕᒥᒃ ᑲᓇᑕᒧᑦ. ᑖᓐᓇ ᑲᓇᑕᐅᑉ 30-ᖓ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎᐅᔪᓂ ᑲᓇᑕᒥ ᑕᐃᒪᖓᓂ ᒐᕙᒪᖃᓕᕋᒥᒃ, ᐊᒻᒪᓗ 13-ᖓ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧ ᑎᒃᑯᐊᖅᑕᐅᔪᖅ ᑖᑉᓱᒪᖓᑦ ᑯᐃᖕ ᑕᐃᒪᖓᓂ 69 ᐊᕐᕌᒍᓂ ᑯᐃᖕᖑᓕᕋᒥ.</p>\n\n<p>ᑕᐃᒪᖓᓂᑦ ᐃᓕᓴᕆᔭᐅᖃᑦᑕᖅᓯᒪᓪᓗᓂ ᐃᖅᑲᓇᐃᔮᖃᖅᓯᒪᕗᖅ, ᒥᐊᓕ ᓴᐃᒪᓐ ᓄᖃᕈᓐᓇᓐᖏᑦᑐᖅ ᐅᖃᐅᔾᔪᐃᔨᐅᕗᖅ ᐃᓄᐃᑦ ᐱᔪᓐᓇᐅᑎᖃᕐᓂᖏᓐᓂᒃ ᐊᒻᒪᓗ ᐱᐅᓯᑐᖃᖃᕐᒪᑕ, ᐊᒻᒪᓗ ᐱᔪᓐᓇᐅᑎᖏᓐᓂᒃ ᑕᒪᕐᒥᒃ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ. ᑕᐃᒪᖓᓂ ᐅᖓᑖᓂ 40 ᐅᑭᐅᓄᑦ, ᐃᖅᑲᓇᐃᔮᖃᖅᓯᒪᔪᖅ ᐊᔾᔨᒌᓐᖏᑦᑐᓂ ᐊᖓᔪᖅᑳᕆᔭᐅᓪᓗᓂ ᓯᕗᓕᐅᖅᑎᓂ ᐃᖅᑲᓇᐃᔮᒃᓴᓂ, ᑕᐃᑲᓂᓗ ᐊᖓᔪᖅᑳᖑᓪᓗᓂ ᒪᑭᕕᒃ ᑯᐊᐳᕆᓴᓐ, ᑕᐃᑲᓂ ᐃᑲᔪᖅᐳᖅ ᓴᐳᒻᒥᓪᓗᒋᑦ ᐊᒻᒪᓗ ᐊᑐᖅᑕᐅᖁᓪᓗᒋᑦ ᐃᓄᐃᑦ ᐱᔪᓐᓇᕐᓂᖃᕐᒪᑕ ᑕᒪᐅᓐᓇ ᐊᑐᓕᖅᑕᐅᑎᓪᓗᒍ ᔭᐃᒻᔅ ᐸᐃ ᐊᒻᒪᓗ ᑯᐸᒃ ᑕᕐᕋᖓᓄᑦ ᐊᖏᕈᑎ. ᐅᓇᑦᑕᐅᖅ ᐊᖓᔪᖅᑳᖑᓚᐅᖅᑐᖅ ᒪᕐᕈᐃᖅᖢᓂ ᓂᕈᐊᖅᑕᐅᓪᓗᓂ ᐊᖓᔪᖅᑳᖅ ᐃᓄᐃᑦ ᓯᓚᕐᔪᐊᒥ ᑲᔾᔨᐊᓂ ᑲᑎᒪᔨᑦ, ᒫᓐᓇ ᐱᔨᑦᑎᕋᖅᑐᖅ ᐃᓄᐃᑦ ᓯᓚᕐᔪᐊᖅ ᑲᔾᔨᐊᓂ ᑲᑎᒪᔨᐅᔪᖅ, ᐊᒻᒪᓗ ᐊᖓᔪᖅᑳᖑᓚᐅᖅᑐᖅ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ.&nbsp; &nbsp;</p>\n\n<p>ᑖᓐᓇ ᓯᕗᓪᓕᖅᐹᖅ ᑭᒡᒐᖅᑐᖅᑎᒻᒪᕆᒃ ᓄᓇᐅᑉ ᐊᓯᖓᓂ ᑖᒃᑯᓄᖓ ᓯᓚᕐᔪᐊᒥ ᐅᑭᐅᖅᑕᖅᑐᖅ ᑲᔾᔨᐊᓄᑦ, ᒥᐊᓕ ᓴᐃᒪᓐ ᓯᕗᓕᐅᖅᑎᐅᓯᒪᕗᖅ ᓴᖕᖏᒃᑎᒋᐊᖅᑎᓯᒪᓪᓗᒋᑦ ᑲᑎᖓᔪᓐᓇᕐᓂᖓᑦ ᐊᕙᑖᓂ ᐃᓄᖏᑦ ᐅᑭᐅᖅᑕᖅᑐᖅ ᓄᓇᖏᓐᓂ ᐊᕕᒃᑐᖅᓯᒪᔪᑎᒍᑦ ᐊᒻᒪᓗ ᓯᓚᕐᔪᐊᑎᒍᑦ, ᐃᓚᒋᔭᐅᓪᓗᓂ ᓴᕿᑦᑎᖃᑕᐅᓪᓗᓂ ᐅᑭᐅᖅᑕᖅᑐᖅ ᑲᑎᒪᔨᓂᒃ. ᐅᓇᑦᑕᐅᖅ ᐋᕿᒃᓯᓯᒪᔪᖅ ᐅᑭᐅᖅᑕᖅᑐᒥ ᓄᑕᖃᑦ ᐊᒻᒪᓗ ᒪᒃᑯᒃᑐᑦ ᑐᓐᖓᕕᖓᓂ, ᐊᒻᒪᓗ ᑭᒡᒐᖅᑐᖅᑎᐅᓯᒪᔪᖅ ᓄᓇᐅᑉ ᐊᓯᖏᓐᓄᑦ ᑲᓇᑕ ᑎᑭᓪᓗᒍ ᑎᓐᒫᒃ.&nbsp;&nbsp; &nbsp;</p>\n\n<p>ᓂᕈᐊᖅᑕᐅᔪᖅ ᑐᓴᖅᑎᑕᐅᓚᐅᖅᑐᖅ ᑖᒃᑯᑎᒍᑦ ᐅᖃᐅᑎᔭᐅᓯᒪᓪᓗᑕ ᐅᖃᐅᔾᔪᐃᔨᑦ ᑲᑎᒪᔨᓂᑦ ᓂᕈᐊᓲᑦ ᑭᒡᒐᖅᑐᖅᑎᒃᓴᒥᒃ ᐊᑕᓂᐋᓗᒃ ᑲᓇᑕᒥᐅᓄᑦ ᒐᕗᓄ ᔭᓄᓗ. ᐅᑯᐊ ᑲᑎᒪᔩᑦ ᑎᓕᔭᐅᓯᒪᔪᑦ ᐋᔩᖃᑎᒌᒡᓗᑎᒃ ᐊᒻᒪᓗ ᑐᓂᓯᓗᑎᒃ ᐊᑎᕐᓂᒃ ᐊᔪᖏᑦᑐᓂᒃ ᑲᓇᑕᒥᐅᓂᒃ ᑖᔅᓱᒧᖓ ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᒻᒪᕆᖓᓄᑦ ᓯᕗᓕᐅᖅᑎᒧᑦ ᐃᓱᒪᒋᓂᐊᖅᑕᖏᑦ ᐃᓂᑖᕈᓐᓇᖅᑐᑦ ᑖᑉᓱᒧᖓ.</p>\n\n<h2>ᐅᖃᖅᑐᑦ ᐃᒪᓐᓇ</h2>\n\n<blockquote>\n<p>“ᖁᕕᐊᓱᒃᑐᖓ ᑐᓴᕐᑎᑦᑎᔪᓐᓇᕋᒪ ᑖᓐᓇ ᑯᐃᖕ ᐊᖏᖅᑐᖅ ᑎᒃᑯᐊᖅᑕᐅᔪᓐᓇᖅᑐᖅ ᒥᐊᓕ ᓴᐃᒪᓐ ᐃᓂᖓᓄᑦ ᒐᕗᓄ ᔭᓄᓗ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧᑦ. ᒥᐊᓕ ᓴᐃᒪᓐ ᐱᓕᕆᐊᖃᐃᓐᓇᖅᑐᖅ ᐃᓅᓯᕐᒥᓂ ᐱᕚᓪᓕᕐᑎᑦᑎᕙᓪᓕᐊᓗᓂ ᐃᓅᓯᓕᕆᓂᕐᒥ, ᑮᓇᐅᔭᓕᐅᕐᓂᕐᒧᑦ, ᐊᒻᒪᓗ ᐃᓱᒪᖅᓱᕈᓐᓇᕐᓂᕐᒥ ᓴᐳᒻᒥᔭᐅᑎᑦ ᐱᔪᓐᓇᐅᑎᑦ ᐱᔾᔪᑕᐅᔪᓄ ᑲᓇᑕᒥᐅᑦ ᐃᓄᐃᑦ ᐊᒻᒪᓗ ᓄᓇᖅᑲᖅᑳᖅᓯᒪᔪᑦ, ᐊᒻᒪᓗ ᖃᐅᔨᒪᑦᑎᐊᖅᐳᖓ ᑖᓐᓇ ᐱᔨᑦᑎᕋᑦᑎᐊᕐᓂᐊᖅᑐᖅ ᑲᓇᑕᒥᐅᓂᒃ ᐊᒻᒪᓗ ᐊᑐᖅᑕᐅᑎᑦᑎᓗᓂ ᐱᓐᓇᕆᔭᑦᑎᓐᓂᒃ ᐊᖏᖅᓯᒪᑦᑎᐊᕐᓂᕐᒥᒍᑦ ᐊᒻᒪᓗ ᒪᓕᒋᐊᕐᓂᕐᒥᒍᑦ. ᑕᒪᐅᓐᓇ ᑖᓐᓇ ᑎᒃᑯᐊᖅᑕᐅᓂᖓ, ᖃᐅᔨᒪᔪᒍᑦ ᑲᓇᑕ ᑭᒡᒐᖅᑐᖅᑕᐅᑦᑎᐊᕐᓂᐊᖅᑐᖅ ᐆᒃᑑᑎᖃᑦᑎᐊᖅᓯᒪᖕᒪᑦ ᐱᐅᓛᒥᒃ ᓄᓇᖃᕋᑦᑕ. ᐅᓇᑦᑕᐅᖅ ᑲᓇᑕᒥᐅᑎᑐᑦ ᖁᔭᓐᓇᒦᕈᒪᕙᕋ ᐅᓕᑦᓱᑦ ᒍᐊᖕᓄ, ᐱᔨᑦᑎᕋᖅᓯᒪᔪᖅ ᐊᐅᓚᑦᓯᔨᐅᓪᓗᓂ ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᓐᓄᑦ ᐊᓂᒍᖅᑐᓂ ᐊᒥᓲᓗᐊᓐᖏᑦᑐᓂ ᑕᕿᓂ.”&nbsp;</p>\n\n<footer class=\"default\">ᐅᓇ ᓯᕗᓕᐅᖅᑎ ᔭᔅᑎᓐ ᑐᓗᑕᐆ, ᐊᖓᔪᖅᑳᒻᒪᕆᒃ ᑲᓇᑕᒧᑦ</footer>\n</blockquote>\n\n<h2>ᓱᓕᔪᑦ</h2>\n\n<ul>\n\t<li>ᑲᓇᑕᐅᑉ ᒪᓕᒐᓕᐅᕐᑎᒃᔪᐊᖏᑦ ᑯᐃᖕ ᐊᖓᔪᖅᑳᕐᔪᐊᖑᕗᖅ ᒪᓕᒡᖢᑎᒃ ᐊᑐᖅᓯᑎᑦᑎᓪᓗᓂ ᓄᓇᖁᑎᑖᕆᓯᒪᔭᒥᓄᑦ , ᐅᑯᐊ ᒪᓕᒐᓕᐊᒃᓴᓄᑦ ᑐᑦᑕᕐᕕᑦ ᐊᒻᒪᓗ ᑲᓇᑕᐅᑉ ᑲᑎᒪᕕᒃᔪᐊᖓ, ᑲᓇᑕ ᒐᕙᒪᖃᖅᐳᖅ ᑐᓐᖓᓂᖃᑦᑎᐊᖅᑐᒥᒃ ᐊᒻᒪᓗ ᓱᕋᒃᑕᐅᔮᓐᖏᑦᑐᖅ ᓯᓚᕐᔪᐊᒥᑦ. ᐃᓂᑖᕆᔭᐅᕙᒡᖢᑎᒃ ᐱᓕᕆᔨᖃᖅᑐᑦ ᑖᒃᑯᐊᓗ ᐱᑕᖃᖅᐳᑦ ᒐᕙᒪᖃᕋᒥᒃ, ᐅᓇ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧᑦ ᑭᒡᒐᖅᑐᖅᑐᖅ ᓄᓇᖃᕐᑎᑦᑎᓂᒃᑯᑦ, ᑲᓇᑕᐅᑉ ᐊᕕᒃᑐᖅᓯᒪᔪᓄᑦ ᐊᖓᔪᖅᑳᖓᑦ.</li>\n\t<li>ᐅᓇ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒧᑦ ᐱᔭᒃᓴᖏᑕ ᐃᓚᖏᑦ ᑖᒃᑯᐊ ᑲᔪᓯᑎᓪᓗᒋᑦ ᒪᓕᒐᓕᐅᕐᓂᕐᒧᑦ ᐱᔭᒃᓴᓂ, ᐱᔨᑦᑎᕋᕐᓗᓂ ᒐᕙᒪᒃᑯᓄᑦ, ᑭᒡᒐᖅᑐᖅᓗᓂ ᑲᓇᑕ ᐊᖏᕐᕋᒥᓂᒃ ᐊᒻᒪᓗ ᐊᑭᐊᓂᓄᓇᓕᖕᓄᑦ, ᑲᔪᖏᖅᓴᐃᓗᓂ ᐱᐅᓛᖑᑎᑦᑎᓗᓂ ᐊᒻᒪᓗ ᑲᓇᑕᒥᐅᑦ ᑲᑎᖓᑦᑎᐊᕐᑎᓪᓗᒋᑦ.</li>\n</ul>\n\n<h2>ᑕᒪᑐᒥᖓ ᑎᑎᕋᖅᓯᒪᔪᑦ</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/07/06/miali-saiman-oc-oq\">ᐃᓅᓯᖓᓂᒃ ᑎᑎᕋᖅᓯᒪᔪᑦ</a></li>\n</ul>\n\n<h2>ᑕᒪᑐᒥᖓ ᐅᖃᓕᒫᒐᒃᓴᐃᑦ</h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en\">&nbsp;ᐅᓇ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎ ᑲᓇᑕᒥ</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2021/03/minister-leblanc-announces-advisory-group-to-assist-with-the-selection-of-the-next-governor-general.html\">&nbsp;ᒥᓂᔅᑕ ᓕᐸᓚᖕ ᑐᓴᕐᑎᑦᑎᕗᖅ ᐅᖃᐅᔾᔪᐃᔨᑦ ᑲᑎᒪᔨᕋᓛᖏᓐᓂᒃ ᐃᑲᔪᖅᑕᐅᔪᒪᓪᓗᓂ ᓂᕈᐊᖅᓯᓗᑎᒃ ᐊᑕᓂᐋᓗᒃ ᑭᒡᒐᖅᑐᖅᑎᒃᓴᒥᒃ ᑲᓇᑕᒧᑦ</a></li>\n</ul></div>\n      "
}