{
  "path": "/en/news/news-releases/2022/06/02/major-historical-claim-settlement-siksika-nation",
  "pageTitle": "Major historical claim settlement with Siksika Nation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, and Chief Ouray Crowfoot of Siksika Nation, took part in a ceremony at Blackfoot Crossing Historical Park in Alberta to announce the signing of a historic $1.3 billion land claim settlement – one of the largest agreements of its kind reached in Canada.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>\n\n<p>This settlement aims to right past wrongs dating back over a century when the Government of Canada broke its Blackfoot Treaty (Treaty 7) promise and wrongfully took almost half of Siksika Nation’s reserve land, including some of the most productive agricultural and mineral-rich lands, to sell to settlers. The settlement agreement provides financial compensation to Siksika Nation to resolve several outstanding land claims and their related litigation.</p>\n\n<p>Today’s announcement will make a real difference in people’s lives in Siksika Nation. It will create new opportunities to invest in community, culture, and economic development projects.</p>\n\n<p>Across the country, the Government of Canada is addressing historical wrongs and the lasting impacts of colonialism, while supporting healing for First Nations. The co-development of this historic claim settlement with Siksika Nation is an important step forward to advance reconciliation and renew our nation-to-nation relationship based on mutual respect, cooperation, and partnership.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today, we right a past wrong committed by the Government of Canada. This agreement is the culmination of over 60 years of relentless advocacy and leadership by Siksika Nation, whose people have fought to right this historic wrong. It is also an opportunity to look forward as we build a better future together – one that is based on nation-to-nation dialogue, partnership, and respect.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In order to move forward as a country, we will work together to address the harms of the past. This landmark settlement with Siksika Nation demonstrates our commitment to address injustices and build a renewed relationship. Today’s celebrations mark a turning point in our relationship with Siksika Nation, as we continue to move forward to strengthen our relationship and support Siksika’s vision of a better future for their people.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Crown-Indigenous Relations</footer>\n</blockquote>\n\n<blockquote>\n<p>“Settling this case, which dates back to 1910, is long overdue for the People of Siksika Nation. I want to make that clear: Canada is not giving $1.3 billion to Siksika. Canada is righting a wrong committed over a century ago when Canada illegally took 115,000 acres of lands provided to Siksika along with other illegal acts. Now that this case has been settled, the compensation from the settlement can assist Siksika to develop true financial sovereignty and provide more opportunities for our People. This case was filed in 1960 under Chief Clarence McHugh and many leaderships and technicians have worked tirelessly over several decades to see this day come to fruition. I want to take the time to share my gratitude for the leaders that came before us and other ancestors who help build the foundation we stand upon today.”</p>\n\n<footer class=\"default\">Chief Ouray Crowfoot, Siksika Nation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Blackfoot Treaty Flats, the location of today’s signing ceremony, is where Blackfoot Treaty (Treaty 7) was signed in 1877 between the Government of Canada and five First Nations, including the Siksika Nation.</li>\n\t<li>The 1910 Surrender Claim concerns 115,000 acres of Siksika’s Reserve and certain mineral rights taken by Canada.</li>\n\t<li>The settlement today also addresses longstanding claims related to the Bow River Irrigation District, the Canadian Pacific Railway Claim, and other land-based historical grievances.</li>\n\t<li>Under the settlement, Siksika can acquire over time up to 115,000 acres of land for addition to their reserve land base on a willing-seller/willing-buyer basis.</li>\n\t<li>There are a number of steps to be completed before land is given reserve status, including consultations with municipalities and other Indigenous groups.</li>\n\t<li>The land claim was first filed by Siksika Nation in court in 1960.&nbsp;\n\t<ul>\n\t\t<li>In 2008, exploratory talks began between Siksika Nation and Canada to resolve these matters outside of the courts.</li>\n\t\t<li>In November 2021, negotiators for the parties initialed a settlement agreement.</li>\n\t\t<li>In December 2021, Siksika Nation members approved the settlement in a community vote. Over 77 per cent of eligible voters who voted were in favour of the settlement.</li>\n\t\t<li>In April 2022, Siksika Nation and Canada signed the settlement.</li>\n\t</ul>\n\t</li>\n\t<li>To date, Canada has settled over 590 specific claims through negotiated settlements with First Nations across the country. This includes over 180 claims settled through negotiations since 2016.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://siksikanation.com/\">Siksika Nation</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1100100030291/1539617582343\">Specific First Nations Claims</a></li>\n</ul></div>\n      "
}