{
  "path": "/en/news/statements/2022/04/27/statement-prime-minister-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom HaShoah, Holocaust Remembrance Day:</p>\n\n<p>“Tonight at sundown, we will join Jewish communities and others in Canada and around the world to observe Yom HaShoah and remember the six million innocent Jews who were imprisoned, tortured, and murdered at the hands of Nazis.</p>\n\n<p>“The Holocaust, known as the Shoah in Hebrew, is one of the darkest chapters in human history. We must all continue to work to ensure that its victims are never forgotten and that these atrocities never happen again.</p>\n\n<p>“On this dark, sombre day, I encourage all Canadians to listen to the stories of survivors, who keep the memories of the Shoah’s victims alive. Last month, I was humbled by the opportunity to visit the Platform 17 Memorial in Berlin, Germany – dedicated to those who were deported during the Holocaust, many of whom never returned.</p>\n\n<p>“As Jewish people in Canada and around the world continue to face violence and hate, the Government of Canada is working to counter the rise in antisemitism and Holocaust denial. We are moving forward to deliver on our Budget 2022 commitment to amend the&nbsp;<em>Criminal Code&nbsp;</em>to prohibit denying or downplaying the Holocaust in Canada. In Budget 2022, we also committed to providing ongoing funding to support Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism and proposed investments in the renewal of Canadian Holocaust museums.</p>\n\n<p>“In 2021, the government hosted Canada’s first <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat/national-summits.html\">National Summit on Antisemitism</a> to identify actions the government can take to address key issues facing Jewish communities and also made <a href=\"https://www.canada.ca/en/canadian-heritage/services/canada-holocaust/canada-pledges.html\">concrete pledges</a> at the Malmö International Forum on Holocaust Remembrance and Combating Antisemitism. Additionally, we are developing a companion handbook to the International Holocaust Remembrance Alliance’s (IHRA) working definition of antisemitism, which we adopted as part of Canada’s&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a>, and playing a leading role in advancing IHRA priorities.</p>\n\n<p>“Despite the work that is underway, there is much more to be done. Today, modern antisemitism and Holocaust denial is also prevalent in the spread of disinformation on the Internet and on social media. Through the <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a>, the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, and the international Inter-Parliamentary Task Force to Combat Online Antisemitism, we are addressing the challenges, threats, and repercussions of online hate, antisemitism, and disinformation in Canada and around the world.</p>\n\n<p>“We have a shared responsibility to continue to pay tribute to the victims of the Holocaust and ensure that their stories continue to resonate with generations to come. Together, let us all vow, ‘Never again.’”</p></div>\n      "
}