{
  "path": "/en/news/readouts/2022/06/28/prime-minister-justin-trudeau-meets-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of France, Emmanuel Macron, on the margins of the G7 Summit.</p>\n\n<p>Prime Minister Trudeau and President Macron exchanged notes on the advancement of G7 priorities including climate action, food security, energy, and sustainable growth and development, and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people.</p>\n\n<p>The Prime Minister and the President discussed upcoming milestones to advance the bilateral partnership, including the convening of a joint Council of Ministers as soon as possible. Leaders underscored&nbsp;the urgency of accelerating efforts to address climate change with&nbsp;President Macron welcoming Canada’s hosting of the United Nations Summit on Biodiversity (COP 15) in Montréal and committing to supporting related efforts. The leaders also highlighted ongoing bilateral collaboration on artificial intelligence and the work of the Global Partnership on Artificial Intelligence, based in Montréal, as central to international efforts in the sector.</p>\n\n<p>The two leaders underlined the importance of the Organisation internationale de la Francophonie in addressing current international challenges and the imperative of promoting democratic values and human rights through its work.</p>\n\n<p>The leaders looked forward to further engagement at the NATO summit in Madrid, Spain, in the coming days.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/france/relations.aspx?lang=eng\">Canada-France relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2022/06/canada-welcomes-delegates-to-montreal-for-biological-diversity-conference-cop15.html\">Canada welcomes delegates to Montréal for biological diversity conference, COP15</a></li>\n</ul></div>\n      "
}