{
  "path": "/en/news/news-releases/2023/04/17/strengthening-canadas-position-global-tech-leader-while-growing-our",
  "pageTitle": "Strengthening Canada’s position as a global tech leader while growing our economy and creating jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Fast and reliable wireless services connect us to our loved ones, help us work better, and fuel Canadian innovation in areas from smart cities and connected cars to e-health and online education. Canada is already a global leader in next-generation networks, which is driving economic growth and creating good, middle-class jobs for Canadians across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the Government of Canada will support a project from wireless networking technology company Ericsson Canada to advance research and development toward next-generation 5G and 6G networks – meaning faster and more secure wireless services for people here at home and beyond.</p>\n\n<p>Valued over $470&nbsp;million, this project will create and reskill hundreds of jobs in Ottawa, Ontario, and Montréal, Quebec. It will establish Canada as one of Ericsson’s leading global research and development hubs and help strengthen Canada’s leadership in the development of wireless technologies. The project will also support research in other cutting-edge fields, including artificial intelligence and quantum technologies.</p>\n\n<p>The Government of Canada will continue to create good, middle-class jobs by attracting investment in our world-leading industries and growing our economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is further evidence that Canadian workers have the talent the world needs to develop faster and more secure internet connection and other wireless services. As we continue to support innovation, we are creating good jobs, strengthening the middle class, and ensuring Canada remains a global leader in technology.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<blockquote>\n<p>“Canadians deserve strong, secure, and reliable wireless networks and services. By investing in Ericsson Canada, our government continues to support and strengthen the 5G networks of today and 6G networks of the future. The partnership also further solidifies Canada as a global leader in next-generation networks and creates more well-paying jobs.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer></blockquote>\n\n<blockquote>\n<p>“We are already seeing the benefits of next-generation technologies such as 5G and artificial intelligence, yet we are still in the early days of their potential to transform our work, leisure and social lives. Ericsson’s R&amp;D investment partnership with the Canadian government, supported by world-class talent in Ottawa and Montréal, will boost innovation and ultimately help to improve the lives of millions of people. We are determined to lead our industry through continued R&amp;D investment.”</p>\n\n<footer class=\"default\">Börje Ekholm, President and CEO, Telefonaktiebolaget LM Ericsson</footer></blockquote>\n\n<blockquote>\n<p>“Ericsson is proudly commemorating 70 years of innovation and operations in Canada this year. Today, we demonstrate our continued commitment to Canada with this high-tech R&amp;D investment announcement. The benefits of this project will strengthen Canada’s technology expertise that is second-to-none, will bolster Ericsson’s world-class&nbsp;R&amp;D centres, and is a testament to the concentration of talent here in the Ottawa-area and in Montréal.”</p>\n\n<footer class=\"default\">Jeanette Irekvist, President, Ericsson Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>Today’s announcement marks the signing of a Memorandum of Understanding between the Government of Canada and Ericsson Canada. Discussions are ongoing, and details of the project, including timelines and the level of federal support, will be confirmed in the near future.</li>\n\t<li>The next generation of 5G wireless technology is expected to add over $100&nbsp;billion to Canada’s economy by 2036.</li>\n\t<li>The information and communications technology sector plays an essential role in Canada’s economy. Each new job created by an investment in this sector creates 1.3 additional jobs in the broader Canadian economy. Every dollar spent in this sector adds almost another additional dollar to our economy.</li>\n\t<li>Ericsson Canada is a subsidiary of Telefonaktiebolaget LM Ericsson (Ericsson), a global Swedish telecommunications equipment company offering hardware, software, and services for mobility, broadband, and the cloud. The company currently supports over 125 5G networks in 55 countries. It employs more than 3,000 people across Canada at facilities in Toronto, Montréal, Ottawa, and Vancouver.</li>\n\t<li>Supporting the development of next-generation networks is an important part of the federal government’s telecom strategy, to ensure Canadians can benefit from the latest technologies. In recent years, the government has supported projects such as&nbsp;<a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2018/03/new-canadian-partnership-in-next-generation-wireless-technology.html\">ENCQOR</a>, <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2019/01/government-of-canada-invests-in-research-and-development-for-technologies-behind-5g-networks.html\">Nokia Canada’s Bell Labs</a>, a&nbsp;<a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/17/strengthening-canadas-position-leader-5g-and-digital-innovation\">new partnership with Nokia</a>, and an <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/10/government-of-canada-to-support-exfo-in-developing-the-next-generation-5g-centre-of-excellence-using-ai.html\">EXFO project</a> to create a 5G Centre of Excellence in Montréal, Quebec.</li>\n</ul><h2>Associated Link</h2>\n\n<ul><li><a href=\"https://www.ericsson.com/en/about-us/company-facts/ericsson-worldwide/canada\">Ericsson in Canada</a></li>\n</ul></div>\n      "
}