{
  "path": "/en/news/news-releases/2022/05/30/further-strengthening-our-gun-control-laws",
  "pageTitle": "Further strengthening our gun control laws | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Keeping Canadians safe is the Government of Canada’s top priority. We know that one Canadian killed by gun violence is one too many, which is why, two years ago, we banned over 1,500 types of military-style assault firearms. We also strengthened our gun control laws to expand background checks and keep firearms out of the wrong hands. These measures are helping to keep our children and communities safe.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the introduction of new legislation to further strengthen gun control in Canada and keep Canadians safe from gun violence. Bill C-21 puts forward some of the strongest gun control measures in over 40 years.</p>\n\n<p>These new measures include:</p>\n\n<ul>\n\t<li><strong>Implementing a national freeze on handguns </strong>to prevent individuals from bringing newly acquired handguns into Canada and from buying, selling, and transferring handguns within the country.</li>\n\t<li><strong>Taking away the firearms licenses </strong>of those involved in acts of domestic violence or criminal harassment, such as stalking.</li>\n\t<li><strong>Fighting gun smuggling and trafficking</strong> by increasing criminal penalties, providing more tools for law enforcement to investigate firearms crimes, and strengthening border security measures.</li>\n\t<li><strong>Addressing intimate partner violence, gender-based violence, and self-harm involving firearms </strong>by<strong> </strong>creating a new “red flag” law that would enable courts to require that individuals considered a danger to themselves or others surrender their firearms to law enforcement, while protecting the safety of the individual applying to the red flag process, including by protecting their identity. In addition, the government will invest $6.6 million to help raise awareness of the new law and provide supports to vulnerable and marginalized groups to navigate the provisions.</li>\n</ul>\n\n<p>In addition to this new legislation, the Government of Canada will require long-gun magazines to be permanently altered so they can never hold more than five rounds and will ban the sale and transfer of large capacity magazines under the <em>Criminal Code.</em></p>\n\n<p>These are the measures that chiefs of police, families of survivors, doctors, and advocates have been asking us to take, and they build on the many concrete actions we have already taken. The Government of Canada will work with provinces, territories, Indigenous communities, and municipalities to implement these measures, and will continue to do whatever it takes to keep guns out of our communities and make Canada a safer country for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“One Canadian killed by gun violence is one too many. I’ve seen all too well the tragic cost that gun violence has in our communities across the country. Today, we’re proposing some of the strongest measures in Canadian history to keep guns out of our communities and build a safer future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We made a commitment to Canadians to tackle gun violence. The legislation we introduced today is part of our comprehensive strategy to promote safe and responsible gun laws, invest in law enforcement to stop organized crime and illegal gun smuggling at the border, and to invest in communities to address root causes and prevent gun crime from occurring in the first place. This legislation will help to reduce gun violence and keep Canadians safe.”</p>\n\n<footer class=\"default\">The Hon. Marco E. L. Mendicino, Minister of Public Safety</footer>\n</blockquote>\n\n<blockquote>\n<p>“Violent crime involving firearms has devastating impacts on communities across the country. This bill combines evidence-based policies and tougher <em>Criminal Code</em> penalties, among other measures, to better protect our communities. This includes people who are vulnerable to intimate partner violence and gender-based violence, and those who are at risk of hurting themselves. That is what we promised we would do, and that is what we are doing with this bill.”</p>\n\n<footer class=\"default\">The Hon. David Lametti, Minister of Justice and Attorney General of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>To ensure the national freeze on handguns can be implemented swiftly, the Minister of Public Safety has already tabled regulatory amendments in both the House of Commons and the Senate. These regulations will help stop the growth of personally owned handguns in Canada and are expected to come into force in Fall 2022.</li>\n\t<li>In 2020, the Prime Minister announced the ban of over 1,500 models and variants of assault-style firearms. A buyback program will be introduced to offer fair compensation to affected owners and businesses.</li>\n\t<li>Going forward, we will also ensure military-style assault weapons are automatically prohibited when they enter the market. We will continue working to ensure any new weapons that fit the definition of assault-style weapon are captured.</li>\n\t<li>Earlier this year, the government announced an investment of $250 million through the Building Safer Communities Fund (BSCF) to help communities across the country prevent gun and gang violence by tackling its root causes, particularly for at-risk children.</li>\n\t<li>Budget 2021 provided more than $312 million in new funding to increase firearms tracing capacity and implement stronger border control measures to fight gun smuggling and trafficking. Law enforcement agencies seized more than double the number of firearms at the border in 2021, compared to 2020, which is also the highest number of firearms seized in recent years.&nbsp;</li>\n\t<li>The number of registered handguns in Canada increased by 71 per cent between 2010 and 2020, reaching approximately 1.1 million. Handguns were the most serious weapon present in the majority of firearm-related violent crimes (59 per cent) between 2009 and 2020.</li>\n\t<li>In 2018, firearms were present in over 600 intimate partner violence incidents in Canada. Victims of intimate partner violence are approximately five times more likely to be killed when a firearm is present in the home.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.parl.ca/LegisInfo/en/bill/44-1/c-21\">Bill C-21, An Act to amend certain Acts and to make certain consequential amendments (firearms)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">Prime Minister announces ban on assault-style firearms</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/03/government-takes-action-to-prevent-gun-violence-with-250-million-building-safer-communities-fund.html\">Government takes action to prevent gun violence with $250 million Building Safer Communities Fund</a></li>\n\t<li><a href=\"https://www150.statcan.gc.ca/n1/pub/85-002-x/2021001/article/00017-eng.htm\">Homicide in Canada, 2020</a></li>\n\t<li><a href=\"https://www150.statcan.gc.ca/n1/pub/85-002-x/2022001/article/00009-eng.htm\">Trends in firearm-related violence crime in Canada, 2009 to 2020</a></li>\n</ul></div>\n      "
}