{
  "path": "/en/news/news-releases/2019/08/15/better-flood-protection-fredericton-residents-and-businesses",
  "pageTitle": "Better flood protection for Fredericton residents and businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The climate crisis is driving extreme weather events in communities from coast to coast to coast. As these events become more frequent, more severe, and more damaging, they threaten our health and safety and disrupt local economies. With three major floods over the past 11 years, residents in Fredericton and the surrounding area have faced the impacts of the climate crisis first hand, including the high cost of recovery.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new funding to help protect the wider Fredericton community from future flooding.</p>\n\n<p>Federal investments of $11.4 million will help the city better protect key transportation systems and municipal infrastructure so essential services can continue during floods. They will also create and expand wetland areas to improve local resilience to flooding. In the coming weeks, further investments totalling $120 million will be announced to help other flood-prone regions across Canada, and support climate resiliency and disaster mitigation projects in our communities.</p>\n\n<p>These funds will come from the $2-billion Disaster Mitigation and Adaptation Fund, launched in 2017. Through the Fund, the Government of Canada is making sure Canadian communities are better equipped to withstand damage caused by the climate crisis and extreme weather events. These investments will help keep Canadians safe, protect local businesses, and support a stronger economy.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Droughts, fires, floods, and heatwaves – communities across the country are facing the impacts of the climate crisis. In Fredericton, people have seen first-hand the damage and uncertainty caused by extreme weather events. That’s why our government is stepping up. By investing in the infrastructure our towns and cities need, we are building safer, more resilient communities, and helping to protect the businesses and services that Canadians rely on.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Once complete, this project will help protect over 27,500 residents within a 12&nbsp;square kilometre area. According to the City of Fredericton, it will reduce the number of people directly affected by future flooding by 83 per cent. It is also expected to provide long-term savings in recovery and replacement costs.</li>\n\t<li>The Disaster Mitigation and Adaptation Fund is a 10-year program that helps communities build the infrastructure they need to better withstand extreme weather events such as floods, wildfires, earthquakes, and droughts.</li>\n\t<li>The Disaster Mitigation and Adaptation Fund is part of the federal government’s Investing in Canada infrastructure plan, which is providing more than $180 billion over 12 years for public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and rural and northern communities.</li>\n\t<li>Of this amount, $26.9 billion supports green infrastructure projects that help communities cope with the intensifying effects of climate change and support Canada’s transition to a more resilient, low-carbon economy.</li>\n\t<li>To date, the Government of Canada has provided more than $480 million to over 200 projects in New Brunswick through the Investing in Canada Infrastructure Plan.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.infrastructure.gc.ca/dmaf-faac/index-eng.html\">Disaster Mitigation and Adaptation Fund</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada's Long-Term Infrastructure Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/investments-2002-investissements/nb-eng.html\">Federal infrastructure investments in New Brunswick</a></li>\n\t<li><a href=\"http://www.infrastructure.gc.ca/gmap-gcarte/index-eng.html\">Investing in Canada plan project map</a></li>\n</ul></div>\n      "
}