{
  "path": "/en/news/news-releases/2021/11/22/prime-minister-welcomes-returning-speaker-house-commons",
  "pageTitle": "Prime Minister welcomes the returning Speaker of the House of Commons | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the re-election of the Honourable Anthony Rota as Speaker of the House of Commons as part of the return of Parliament.</p>\n\n<p>Canadians expect Members of Parliament to work together to address the issues that matter most to the country. Canada’s democracy relies on trust in our public institutions, healthy debate, and the right of all elected representatives to speak freely and be heard in the House of Commons.</p>\n\n<p>The role of the Speaker is critically important, as they interpret parliamentary rules and traditions in an impartial manner. The Speaker is also responsible for overseeing the administration and management of the House of Commons, and for fulfilling ceremonial and diplomatic duties.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Anthony Rota is respected and recognized as a skilled Parliamentarian. In voting for Speaker Rota, Members of Parliament have shown every confidence in his ability to oversee the House of Commons during the 44th Parliament in a thoughtful, fair, and impartial manner. I offer my congratulations to Speaker Rota on his re-election and look forward to continue working with him – and all members of the House – to finish the fight against COVID-19 and build a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Honourable Anthony Rota is the 37th Speaker of the House of Commons.</li>\n\t<li>At the beginning of a new Parliament, the House of Commons elects a Speaker of the House. Through a secret ballot, Members of Parliament choose who among them will be Speaker.</li>\n\t<li>The Speaker also serves as the spokesperson for the House of Commons in its relations with the Senate, the Crown, and other bodies outside Parliament.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.ourcommons.ca/speaker/en/role\">Role of the Speaker</a></li>\n</ul></div>\n      "
}