{
  "path": "/en/news/news-releases/2017/01/19/prime-minister-canada-announces-chief-government-whip",
  "pageTitle": "The Prime Minister of Canada announces Chief Government Whip | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Pablo Rodriguez, Member of Parliament for Honoré–Mercier, has agreed to serve as Chief Government Whip.</p><p>Mr. Rodriguez was the Member of Parliament for Honoré–Mercier from 2004 to 2011 and returned in 2015. He was named Parliamentary Secretary to the Minister of Infrastructure and Communities in December of that year.</p><p>A graduate in business administration, Mr. Rodriguez worked in the field of international development for nearly ten years for a Montréal based non-governmental organization.</p><p>As a Member of Parliament, Mr. Rodriguez has taken on numerous responsibilities, including as the official spokesperson for culture, languages, economic development, and La Francophonie. He has also been closely involved in efforts to address climate change and to protect and promote culture, language, and minority rights.</p><h2>Quote</h2><blockquote><p>“Pablo Rodriguez is an experienced parliamentarian who has shown great commitment to the important work we do on behalf of Canadians and their families. He will ensure our members in Parliament are on time and at the right locations, and that they remain focused on implementing the priorities of the Government of Canada. Pablo has the respect and confidence of myself and the whole caucus, and I know he will carry out his new duties with professionalism, dedication, and care.”<br><cite>—&nbsp;Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Fact</h2><ul><li>Each recognized party in the Parliament of Canada has a whip. The whips ensure that enough party members are in the Chamber for debates and votes. They also determine which committees a party member will sit on, assign offices and seats in the House, and encourage members to follow party commitments<strong>.</strong></li></ul></div>\n      "
}