{
  "path": "/en/news/news-releases/2018/03/27/canada-acts-further-prevent-transshipment-and-diversion-steel-and",
  "pageTitle": "Canada acts to further prevent transshipment and diversion of steel and aluminum to protect North American workers against unfair trade | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The transshipment and diversion of unfairly cheap foreign steel and aluminum is a threat to Canadian jobs and the North American market.</p><p>Canada already has one of the toughest enforcement regimes in the world to combat this practice. We currently have 71 trade remedy measures in force on steel and aluminum imports alone. And we are strengthening enforcement further to stop foreign exporters from avoiding duties meant to level the playing field.</p><p>The following regulatory changes will be brought forward and be subject to a 15-day consultation period through the <i>Canada Gazette</i>:</p><ul class=\"sm-spacing\"><li>New anti-circumvention investigations will allow the Canada Border Services Agency to identify and stop companies that try to dodge duties (for example, by slightly modifying products or assembling them in Canada or a third country).</li><li>In calculating duties, the Canada Border Services Agency will have greater flexibility in determining whether prices charged in the exporter’s domestic market, which we use for comparison, are&nbsp;reliable or distorted.</li><li>Unions will gain standing to participate in trade-remedy proceedings, including at the Canadian International Trade Tribunal, into whether foreign exports are hurting domestic producers.</li></ul><p>In addition, the Government of Canada will:</p><ul class=\"sm-spacing\"><li>Coordinate more closely with our partners to strengthen enforcement at the border, including by increasing the frequency of meetings between border agencies. This will improve the sharing of information and enforcement action. We will also urgently undertake a review to make sure our enforcement agencies have all the resources they need to take action on unfair trade.</li><li>Look to meet more often with the United States and Mexico to identify and discuss solutions to issues that harm all three countries, including transshipment, diversion, and global overcapacity.</li><li>Participate in new federal-provincial-territorial-stakeholder committees, which will meet regularly to monitor steel and aluminum trade to ensure imports do not hurt Canadian and North American jobs.</li></ul><p>These changes form part of what will be a continuous process of making Canada’s trade remedy investigations and enforcement more robust, responsive and timely.</p><p>We will always stand up for Canadian steel and aluminum workers and the Canadian steel and aluminum industry.</p><h2>Quote</h2><blockquote><p>“Canada is a trading nation, and we will not allow North American industries to be hurt or threatened by unfair trade practices, like the diversion of steel and aluminum. Our businesses and workers rely on our integrated industries, and we will take strong action to defend and protect our most important trade relationships. Canada will not be used as a backdoor into other North American markets. Our people have worked hard to be competitive in this global economy, and they deserve a level playing field.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada’s trade remedy system helps preserve a fair and open trading environment for our producers. It protects Canadian businesses from the impacts of foreign goods that have benefited from unfair subsidies or that are being sold in Canada at artificially low prices.</li><li>Our trade remedy system includes a robust compliance regime to impose duties. Currently, we have imposed trade remedies against 17 different steel products and 23 countries.</li><li>In Budget 2017, the Government of Canada announced measures to strengthen and modernize our trade remedy system. Changes to the <i>Special Import Measures Act</i> received Royal Assent in June 2017 as part of the <i>Budget Implementation Act, 2017, No. 1</i>, and regulatory changes are being proposed to support and fully implement these measures in the weeks to come.</li><li>In 2017, the Canadian steel industry employed more than 23,000 Canadians and contributed $4.2 billion to Canada’s gross domestic product (GDP). The Canadian aluminum industry employed 10,500 workers while contributing $4.7 billion to Canada’s GDP. These industries are vital suppliers to the Canadian manufacturing, energy, automotive, and construction industries.</li><li>The North American Steel Trade Committee, established in October 2003, provides a venue for the North American steel industry and governments to exchange information on the steel market, and for governments to discuss and coordinate policies and activities that may have an impact on trade in steel.</li><li>During the 2016 North American Leaders’ Summit, Canada, the United States, and Mexico agreed to establish a trilateral Customs Steel Enforcement Dialogue to help coordinate compliance efforts and information sharing regarding the enforcement of anti-dumping and countervailing measures on steel products. Since its creation, the Dialogue has held three meetings, which facilitated a number of joint enforcement operations.</li></ul></div>\n      "
}