{
  "path": "/en/news/readouts/2020/11/05/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of France, Emmanuel Macron.</p>\n\n<p>Prime Minister Trudeau expressed Canada’s solidarity with the people of France following recent terrorist attacks and violence. The two leaders agreed on the importance of defending freedom of expression and human rights&nbsp;and on their shared commitment to fighting terrorism and violent extremism.&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Macron spoke about the response to the COVID-19 pandemic in Canada and France. They discussed the significant actions being taken in their respective countries to protect the health and safety of their citizens, and to ensure a sustainable economic recovery, including through support for businesses.&nbsp;The leaders also discussed the accelerated work to develop safe and effective vaccines and ensure their effective and equitable distribution.</p>\n\n<p>The Prime Minister and the President exchanged views on global issues, such as the tensions in the Eastern Mediterranean and the importance of dialogue and diplomacy in seeking a peaceful resolution to the conflict in Nagorno-Karabakh. The two leaders emphasized their commitment to continue working together in international organizations such as NATO, the G7, and the G20, and to advance common priorities such as protecting international peace and security, and fighting climate change.&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID‑19 pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/10/minister-champagne-travels-to-europe-to-meet-with-key-partners-on-the-situations-in-belarus-nagorno-karabakh-and-the-eastern-mediterranean.html\">Minister Champagne travels to Europe to meet with key partners on the situations in Belarus, Nagorno-Karabakh and the Eastern Mediterranean</a></li>\n</ul></div>\n      "
}