{
  "path": "/en/news/readouts/2022/09/09/prime-minister-justin-trudeau-meets-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau meets with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with British Columbia Premier John Horgan for a working lunch in Vancouver.&nbsp;Together, they acknowledged with sadness the passing of Her Majesty Queen Elizabeth&nbsp;II, noting the tremendous influence The Queen had throughout Canada during her 70-year reign.</p>\n\n<p>The two leaders spoke about pressures on Canada’s health care systems, and agreed on the importance of federal, provincial, and territorial governments working together on accountable solutions to make measurable improvements for patients and health care workers.</p>\n\n<p>The Prime Minister and the Premier also discussed opportunities for British Columbia and Canada to become reliable sources of energy and natural resources in a net-zero world.</p>\n\n<p>They agreed to continue working closely together on shared priorities, including reconciliation with Indigenous Peoples and economic development initiatives.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen.html\">Commemoration for Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/07/government-of-canada-makes-significant-additional-transfers-to-provinces-and-territories-in-support-of-health-care-and-transit.html\">Government of Canada makes significant additional transfers to provinces and territories in support of health care and transit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/net-zero-emissions-2050.html\">Net-Zero Emissions by 2050</a></li>\n</ul></div>\n      "
}