{
  "path": "/en/news/readouts/2021/03/18/prime-minister-justin-trudeau-speaks-managing-director-international",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Managing Director of the International Monetary Fund Kristalina Georgieva | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span>Today, Prime Minister Justin Trudeau spoke with Managing Director of the International Monetary Fund, Kristalina&nbsp;Georgieva, about the ongoing global economic recovery.</span></span></p>\n\n<p><span><span>They spoke about the importance of building back better to ensure a strong economic recovery that benefits everyone. They agreed on the need for international collaboration to address debt and liquidity challenges associated with the economic impacts of COVID-19, including through the Financing for Development in the Era of COVID-19 and Beyond initiative at the United Nations.</span></span></p>\n\n<p><span><span>The Prime Minister and Managing Director also discussed the need to foster international action to address the unique challenges of highly vulnerable countries, including small island developing states in the Caribbean region, such as susceptibility to climate change, natural disasters, and access to financing.</span></span></p>\n\n<p><span><span>Prime Minister Trudeau commended Managing Director Georgieva for her strong leadership since the beginning of the pandemic, and committed to continue working together on advancing innovative and creative solutions to helping the most vulnerable countries.</span></span></p>\n\n<p><span><span>The two spoke about today’s release of the IMF’s annual Article IV Staff Report on Canada’s economy, which highlights the government’s strong, decisive and well-coordinated action in response to the COVID pandemic. </span></span></p>\n\n<h2><span><span>Associated Links</span></span></h2>\n\n<ul>\n\t<li><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/imf-fmi.aspx?lang=eng\">Canada and the International Monetary Fund</a></span></span></span></span></li>\n\t<li><span><span><span><span><a href=\"https://www.canada.ca/en/department-finance/news/2021/03/international-monetary-fund-report-validates-canadas-economic-response-to-covid-19.html\">International Monetary Fund report validates Canada's economic response to COVID-19</a></span></span></span></span></li>\n\t<li><span><span><span><span><a href=\"https://www.canada.ca/en/department-finance/news/2021/02/international-monetary-fund-praises-canadas-covid-19-economic-response-plan.html\">International Monetary Fund praises Canada’s COVID-19 economic response plan</a></span></span></span></span></li>\n\t<li><span><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></span></span></span></span></li>\n\t<li><span><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></span></span></span></span></li>\n</ul></div>\n      "
}