{
  "path": "/en/news/statements/2021/11/16/statement-prime-minister-louis-riel-day",
  "pageTitle": "Statement by the Prime Minister on Louis Riel Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Louis Riel Day:</p>\n\n<p>“Today, we join the Métis Nation and all Canadians in commemorating the legacy of Métis leader and founder of Manitoba, Louis Riel.</p>\n\n<p>“A politician, an impassioned activist, and a visionary, Louis Riel advocated and fought for equality, social justice, and minority language rights. Although he was elected to represent Manitobans in Ottawa, he was never permitted to take his duly elected seat in Parliament. In spite of this injustice, his contributions to defending the rights and culture of the Métis Nation and Francophones have left a lasting impact on Confederation and paved the way for a more inclusive country.</p>\n\n<p>“As we celebrate Louis Riel’s life, we also acknowledge the injustices and systemic racism the Métis people – and all Indigenous peoples – have faced for centuries, and continue to face today. We know that it is only by working together that we will make real progress in righting these wrongs.</p>\n\n<p>“The Government of Canada continues to work with Indigenous peoples to build a renewed relationship based on affirmation of rights, respect, cooperation, and partnership. We are working with the Métis Nation to amplify its voices, address its unique needs and concerns, and advance its inherent right to self-determination and self-government. Louis Riel’s vision will keep inspiring us as we continue to walk the shared path of reconciliation and to strengthen the Canada-Métis Nation relationship for the benefit of our country and all Canadians.</p>\n\n<p>“On this day, I invite everyone to honour Louis Riel’s enduring influence, and to celebrate and learn about the Michif language as well as the culture, traditions, and way of life of the Métis. Let us recognize the essential role they have played, and continue to play, in building a better Canada.”</p></div>\n      "
}