{
  "path": "/en/news/news-releases/2018/10/16/prime-minister-netherlands-visit-canada",
  "pageTitle": "Prime Minister of the Netherlands to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Prime Minister of the Netherlands, Mark Rutte, will visit Ottawa on October&nbsp;25, 2018.</p><p>Canada and the Netherlands share a rich history and deep friendship rooted in decades of cooperation and generations of people-to-people bonds.</p><p>During their meeting, Prime Minister Trudeau and Prime Minister Rutte will underline our countries’ common commitment to build economies that benefit everyone, promote international peace and security, champion free trade, advance gender equality, and fight climate change. They will also explore how to further leverage the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which is creating good jobs, growth for the middle class, and new opportunities for people and businesses on both sides of the Atlantic.</p><p>Prime Minister Trudeau will then host a lunch with Prime Minister Rutte and representatives from Canadian and Dutch companies to identify opportunities for increased trade and collaboration between our two countries.</p><p>The two leaders – who have both worked as teachers – will then take part in a town hall event with local high school students. They will discuss the importance of education, civic engagement, and how best to prepare for the jobs of today and tomorrow.</p><p>During his visit, Prime Minister Rutte will deliver an address to Parliament. This will be the first time that a Dutch prime minister addresses the Canadian Parliament. He will also lay a wreath at the Tomb of the Unknown Soldier in the presence of Canadian veterans who served during WWII.</p><h2>Quote</h2><blockquote><p>“Canada and the Netherlands are dear friends who share a rich history, common values, and many shared goals. I look forward to meeting again with Prime Minister Rutte to deepen our friendship and advance the good work we are already doing to create new opportunities for Canadians and Dutch alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau and Prime Minister Rutte last met during the NATO Summit in Brussels, Belgium, in July 2018.</li><li>In 1988, the Queen of the Netherlands, Her Majesty Queen Beatrix, addressed the Canadian Parliament.</li><li>Canada and the Netherlands share a dynamic and forward-looking relationship, based on common values, and a rich military and royal history. Today, about one million people of Dutch origin reside in Canada.</li><li>The Netherlands and Canada are active members of the UN, WTO, NATO, the Organisation for Security and Cooperation in Europe, the Organisation for the Prohibition of Chemical Weapons and the various international judicial institutions headquartered in The Hague. The two countries also work together in various multilateral peace and security operations, including the UN peacekeeping mission in Mali, NATO’s Enhanced Foreign Presence in the Baltics and the Global Coalition against Daesh in Iraq.</li><li>In 2017, Canada's merchandise exports to the Netherlands totaled $3.1 billion and merchandise imports from the Netherlands reached over $4 billion, making the Netherlands Canada's fifth-largest merchandise trading partner in the EU.</li><li>In 2017, Canadian direct investment in the Netherlands was valued at $32 million and Dutch direct investment in Canada was valued at nearly $92 million.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands Relations</a></li><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement </a></li></ul></div>\n      "
}