{
  "path": "/en/news/readouts/2022/02/16/prime-minister-justin-trudeau-convenes-incident-response-group-ongoing",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group on the ongoing illegal blockades | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened a fourth meeting of the Incident Response Group to discuss the public order emergency the government declared under the <em>Emergencies Act</em>, and how it continues to help address the ongoing&nbsp;illegal blockades and occupations that are hurting Canadians across the country. He was joined by ministers and senior officials focused on evaluating actions being taken to end the illegal occupations and restore public safety.</p>\n\n<p>The Prime Minister and ministers emphasized the importance of ensuring the measures continue to be targeted, temporary, proportional to the threats posed to Canadians, and compliant with the&nbsp;<em>Canadian Charter of Rights and Freedoms</em>.</p>\n\n<p>The Prime Minister and ministers discussed the role the emergency measures will play in strengthening and supporting law enforcement across the country, as well as restoring confidence, safeguarding institutions, and protecting the safety of everyone in Canada after almost three weeks of illegal blockades. The group discussed the implementation of finance-related measures under the&nbsp;<em>Emergency Economic Measures Order&nbsp;</em>to provide stricter oversight of foreign funds, identify accounts suspected to be involved in criminal activity, and provide authority for all orders of government to share relevant information with financial institutions.</p>\n\n<p>The Prime Minister and ministers were briefed on the work of the Canada Border Services Agency, Royal Canadian Mounted Police (RCMP), and Ontario Provincial Police (OPP) who, together with other law enforcement agencies, including the Windsor Police Service, have brought a safe and successful resolution to the blockade of key ports of entry, which involved arrests and weapon seizures. This includes three of the most important border crossings in Canada, including the Ambassador Bridge in Windsor, Ontario, the port of entry at Coutts, Alberta, and the Pacific Highway border crossing south of Surrey, British Columbia, which are now open to trade and travel. The Prime Minister and ministers were also briefed on the clearing earlier today of the port of entry in Emerson, Manitoba.</p>\n\n<p>The Prime Minister and ministers were updated on the latest situation facing Ottawa, and local enforcement efforts to end the illegal occupation of downtown. The group was briefed on the collaboration of the joint RCMP, OPP, and Ottawa Police Service enhanced Integrated Command Centre. They also discussed the importance of preventing further blockades from emerging in other communities, and committed to continue providing all appropriate available federal resources to&nbsp;provinces, municipalities, and law enforcement agencies to protect public order&nbsp;and&nbsp;keep people and communities safe.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/02/federal-government-declares-a-public-order-emergency-under-the-emergencies-act-to-end-disruptions-blockades-and-the-occupation-of-the-city-of-ottawa.html\">Federal government declares a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades, and the occupation of the city of Ottawa</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/02/15/canada-invokes-emergencies-act-limit-funding-illegal-blockades-and\">Canada invokes the <em>Emergencies Act</em> to limit funding of illegal blockades and restore public order</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/10/prime-minister-justin-trudeau-convenes-incident-response-group\">Prime Minister Justin Trudeau convenes the Incident Response Group</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-convenes-incident-response-group-ongoing\">Prime Minister Justin Trudeau convenes the Incident Response Group on the ongoing illegal blockades</a></li>\n</ul></div>\n      "
}