{
  "path": "/en/news/news-releases/2016/07/08/canada-makes-commitment-nato-defence-and-deterrence-measures",
  "pageTitle": "Canada makes commitment to NATO Defence and deterrence measures | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is a leading member of NATO that has always deployed our troops and equipment when and where they are needed most. The Government of Canada is committed to taking concrete action so that Canadians – and people around the world – can feel safe and secure in their communities.</p>\n<p>Today, the Prime Minister, Justin Trudeau, announced Canada’s largest sustained military presence in Europe in more than a decade. Canada will lead a robust multinational NATO battlegroup in Latvia, becoming one of four Framework Nations, as part of the Alliance’s enhanced Forward Presence in Eastern Europe.</p>\n<p>Additionally, &nbsp;the Canadian Armed Forces (CAF) will deploy a frigate that will undertake operational tasks with NATO’s maritime forces in the region. Canada will also deploy an Air Task Force – which will include up to six CF-18 fighter aircraft – to conduct periodic surveillance and air policing activities in Europe.</p>\n<p>The land, maritime and air initiatives announced today form Canada’s renewed mandate under Operation REASSURANCE and demonstrate Canada’s unwavering commitment to NATO, to the protection of Alliance territories, and to the ultimate goal of protecting the safety and security of our citizens.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada is a playing a strong and constructive role in the world. We are ready to respond to support NATO with some of the most effective soldiers, sailors, and airmen and airwomen in the world. We will continue to work closely with our Allies and partners to create a safer and more prosperous world for everyone.”</p>\n<p>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Since 2014, Canada has actively participated alongside our NATO Allies in measures to maintain security and stability in Central and Eastern Europe, including through training, exercises and other operational tasks.</li>\n<li>Operation REASSURANCE refers to the military activities undertaken by the Canadian Armed Forces to support NATO assurance and deterrence measures in Eastern and Central Europe. It includes operational and tactical level demonstrations, manoeuvres and enhanced interoperability activities with Allies and partners.</li>\n<li>As part of NATO’s enhanced Forward Presence, Canada, the United States, the United Kingdom and Germany, will constitute the four Framework Nations responsible for establishing separate NATO battlegroups. &nbsp;</li>\n<li>Canada, along with 11 other countries, founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. Over the past 67 years, NATO has proven itself to be a major contributor to international peace and security.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li>News Release: <a href=\"/en/news/news-releases/2016/06/20/prime-minister-attend-nato-summit-poland-and-visit-ukraine\">Prime Minister to attend NATO Summit in Poland and visit Ukraine</a></li>\n<li>&nbsp;<a href=\"http://www.nato.int/\">North Atlantic Treaty Organization</a></li>\n</ul>\n<p></p></div>\n      "
}