{
  "path": "/en/news/statements/2018/10/24/statement-prime-minister-united-nations-day",
  "pageTitle": "Statement by the Prime Minister on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:</p><p>“Since its creation in 1945, the United Nations (UN) has inspired a global community built on higher aspirations and shared values – and made a difference in the lives of millions of people around the world.</p><p>“The UN has confronted some of the world’s gravest challenges – fighting AIDS, ending war, averting famine – and brought to light once invisible issues, such as modern-day slavery and the use of child soldiers.</p><p>“Thanks to decades of international cooperation, we have inherited a safer, more peaceful, and more prosperous world. But like every generation, we face new and complex challenges, and threats to the very institutions that have helped deliver stability and prosperity for generations.</p><p>“Climate change, violent extremism, escalating numbers of displaced people and migrants – none of these issues can be solved in isolation. More than ever, we need to come together as a global community, find shared solutions, and uphold a common set of ideals and principles.</p><p>“At the <a href=\"/en/news/news-releases/2018/09/26/prime-minister-concludes-successful-week-united-nations-general\">United Nations General Assembly</a> last month, Canada reaffirmed its longstanding commitment to the UN and built on our momentum from the G7 Summit in Charlevoix. We will continue to work together with our international partners to deliver economic growth that benefits everyone, advance gender equality, fight climate change, and build a more peaceful and secure world. We look forward to continuing these productive discussions at the upcoming G20 Summit in Argentina.</p><p>“We accomplish more together – united as people, communities, and countries – than we do alone. Today, I encourage Canadians to reflect on what the UN has achieved for humanity, and thank all of the people involved in affiliated programs, funds, and agencies who make our world a safer, more prosperous, and just place.”</p></div>\n      "
}