{
  "path": "/en/news/news-releases/2021/10/29/prime-minister-concludes-successful-visit-netherlands",
  "pageTitle": "Prime Minister concludes successful visit to the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful bilateral visit to the Netherlands. The visit reinforced the strong relationship between our countries – rooted in Canada’s role in the liberation of the Netherlands at the end of the Second World War – and our common commitment to combating climate change and promoting human rights and justice.</p>\n\n<p>Canada and the Netherlands cooperate on a variety of initiatives aligned with our shared values of multilateralism, climate action, human rights, and the rule of law. Our two countries will co-chair the Media Freedom Coalition in 2022, and the Netherlands has supported Canada’s proposal to establish and host a NATO Centre of Excellence on climate and security. Both Canada and the Netherlands have committed to phasing out coal-fired electricity, putting a price on pollution, and investing in renewable energy. We have also worked closely together, with common goals and approaches, on the situation in Afghanistan.</p>\n\n<p>During the visit, Prime Minister Trudeau delivered an address to the Dutch Parliament. In his remarks, Prime Minister Trudeau emphasized the unique bond between Canada and the Netherlands, our work together to address pressing global challenges, and the benefits of Canada-European Union Comprehensive Economic and Trade Agreement (CETA) for the creation of jobs and growth for people and businesses in both countries.</p>\n\n<p>The Prime Minister laid a wreath at the Bergen-op-Zoom Canadian War Cemetery to honour the Canadians who fought and died in the liberation of the Netherlands, and to thank the Dutch communities and organizations who keep their memory alive. He was joined by Her Royal Highness Princess Margriet of the Netherlands, who was born, and spent her early childhood, in Ottawa after Canada offered the Dutch royal family safe haven in Canada during the Second World War.</p>\n\n<p>The Prime Minister also travelled to Rotterdam, where he hosted a roundtable on climate change and adaptation with youth and business and government leaders at the Global Centre on Adaptation. During the roundtable discussion, the Prime Minister highlighted the historic action Canada is taking to cut pollution, while creating green middle class jobs. As a leader in green technology, the Netherlands offers many opportunities for clean trade and investment with Canada, which will benefit both economies as in the recovery from the COVID-19 pandemic.</p>\n\n<p>After visiting Rotterdam, the Prime Minister met with the Prime Minister of the Netherlands, Mark Rutte. The two leaders discussed efforts to build a better future for their countries after the pandemic. The leaders committed to build on our solid trade and investment ties, especially through CETA, which will help ensure a strong economic recovery for businesses and workers in both countries. The leaders agreed to the Canada-Netherlands Hydrogen Memorandum of Understanding, paving the way for increased cooperation between our two countries, and further cementing hydrogen’s role in building a cleaner net-zero future. They discussed their upcoming participation in the 26th UN Climate Change Conference of the Parties (COP26), and their ongoing partnership in tackling other global challenges, including in the areas of defence and security, international justice, and human rights.&nbsp;Prime Minister Trudeau and Prime Minister Rutte agreed to establish a more regular and formal set of bilateral consultations to advance the relationship in the years ahead.</p>\n\n<p>Prime Minister Trudeau also reaffirmed Canada’s support for the International Criminal Court (ICC), based in The Hague, and announced that Canada will provide $4 million in funding over five years to a Mali-based ICC Trust Fund for Victims to offer rehabilitation and psychological services, as well as better access to justice. He also highlighted the deployment of experts from Canadian police forces to the ICC Office of the Prosecutor. The work of these Canadians is proof of Canada’s strong commitment to the ICC and to international efforts that advance international justice in fragile and conflict-affected states.</p>\n\n<p>Following the meeting, Prime Minister Trudeau joined Prime Minister Rutte for an informal discussion with Dutch students at the Leiden University campus in The Hague. They discussed a range of topics, including peace and security, climate change, gender equality, and how we can build a better world where no one is left behind.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the Netherlands have a strong relationship based on our shared values of democracy, climate action, respect for human rights, and equality. Together, we are focused on growing our trade relationship to create new middle class jobs in both our countries, fighting the climate crisis to build a cleaner future, and tackling other global challenges for a safer and more peaceful world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>&nbsp;In October 2018, Prime Minister Rutte visited Ottawa and addressed Canada’s combined houses of Parliament.</li>\n\t<li>About one million people of Dutch origin live in Canada. Canada celebrated its inaugural Dutch Heritage Day on May 5, 2019.</li>\n\t<li>The Canadian Tulip Festival was inspired by the Dutch Royal Family’s gift of 100,000 tulip bulbs to Canada after the Second World War. Now, it symbolizes the unique friendship between the peoples of Canada and the Netherlands.</li>\n\t<li>The Netherlands is a key strategic partner on defence and security, climate change, human rights, arbitrary detention, and efforts to uphold the rules-based international order, including rules-based trade.</li>\n\t<li>Bilateral merchandise trade between Canada and the Netherlands in 2020 was more than 18 per cent above its pre-CETA level in 2016, totaling $8.6 billion, with Canadian merchandise exports to the Netherlands at $5.4 billion, and imports at $3.2 billion.</li>\n\t<li>In 2020, trade in services increased by nearly 50 per cent since pre-CETA levels.</li>\n\t<li>In line with Canada’s longstanding and steadfast support for the ICC, Canadian police deployments assist the ICC‘s Prosecutor Office’s efforts to end impunity for the perpetrators of the most serious crimes of concern to the international community, including genocide, war crimes, and crimes against humanity.</li>\n\t<li>Canada appreciates the increasing bilateral cooperation with the Netherlands. This includes efforts at the International Court of Justice, mutual support on the downing of Flight PS752 by Iran and of Flight MH17 over Ukraine, and the Netherlands’ support for the Canadian Safer Skies Initiative.</li>\n\t<li>The Global Center on Adaptation is an international organization spearheaded by the Netherlands which works as a solutions broker to accelerate action and support for adaptation solutions, in partnership with the public and private sector, to ensure they learn from one another and work together for a climate resilient future. In 2018, Canada joined and contributed $7.5 million to the Global Commission on Adaptation to raise the profile of climate change adaptation and to mobilize adaptation solutions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://gca.org/\">Global Center on Adaptation</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/icc-cpi/index.aspx?lang=eng\">Canada and the International Criminal Court</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/climate-change/the-hydrogen-strategy/23080\">The Hydrogen Strategy</a>&nbsp;</li>\n</ul></div>\n      "
}