{
  "path": "/en/news/news-releases/2022/09/06/historic-partnership-between-canada-and-skwxwu7mesh-uxwumixw-squamish",
  "pageTitle": "Historic partnership between Canada and Sḵwx̱wú7mesh Úxwumixw (Squamish Nation) to create nearly 3,000 homes in Vancouver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, was joined today by Sḵwx̱wú7mesh Úxwumixw (Squamish Nation) Council Chairperson Khelsilem on Sḵwx̱wú7mesh Úxwumixw traditional territory to announce the federal government will provide $1.4&nbsp;billion to create nearly 3,000 homes on traditional lands in Vancouver’s Kitsilano neighbourhood. This project is the largest First Nations economic partnership and the largest loan from the Canada Mortgage and Housing Corporation (CMHC) in Canadian history.</p>\n\n<p>These funds will support Sen̓áḵw, an on-reserve residential and commercial development project that will be owned and operated by Sḵwx̱wú7mesh Úxwumixw (Squamish Nation). Sen̓áḵw, “the place inside the head of False Creek,” is located on land that was forcibly taken away from Sḵwx̱wú7mesh Úxwumixw (Squamish Nation) in the early 1900s and returned by the courts in 2003. The ancient Sen̓áḵw village, located on this land, was burned down and the people who lived there were forced to relocate.</p>\n\n<p>When complete, the Sen̓áḵw development project will feature striking Coast Salish architecture and design across a ten-acre site, over half of which will be publicly accessible, with green spaces, parks, and plazas. Everyone in the community, Indigenous or non-Indigenous, will be able to live at Sen̓áḵw. Sen̓áḵw’s vision will demonstrate how humanity and nature can co-exist, and the development aims to be the largest net-zero residential project in the country. In addition to thousands of rental units, including affordable units, the project is expected to create hundreds of good jobs and long-term economic opportunities for Sḵwx̱wú7mesh Úxwumixw (Squamish Nation). Construction is already underway, with the first residents expected to move in in 2025.</p>\n\n<p>With today’s announcement, the Government of Canada is supporting Sḵwx̱wú7mesh Úxwumixw’s (Squamish Nation) long-term vision for the Sen̓áḵw lands, while helping to define a new generation of First Nations reconciliation and leadership, grow our economy, and create good jobs. We will continue to work together to advance meaningful reconciliation, including economic reconciliation, and ensure everyone has a safe place to call home.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Everyone should have a safe place to call home. Today’s announcement not only builds more much-needed homes for Vancouverites, it supports the Squamish Nation’s vision for their traditional lands and their path to continued economic independence and self-determination. When we all work together as partners – federal and Indigenous governments, private sector, local communities – we innovate, and we find solutions to the challenges we face.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Squamish Nation and the federal government’s partnership to support the residential development of Sen̓áḵw is a historic moment in Canada’s relationship with Indigenous communities. This economic partnership is the largest in Canadian history between a First Nation and the federal government. This investment will build many needed rental apartments and generate long-term wealth for Squamish People across many generations. The wealth generated from these lands can then be recirculated into our local economies and communities to address our people’s urgent needs for affordable housing, education, and social services.”</p>\n\n<footer class=\"default\">Sḵwx̱wú7mesh Úxwumixw (Squamish Nation) Council Chairperson Khelsilem</footer>\n</blockquote>\n\n<blockquote>\n<p>“Everyone deserves a safe place to call home. Through our National Housing Strategy, we’re creating more housing supply in communities that need it most by working closely with partners from all levels of government, industry leaders, organizations, and of course, Indigenous governments. With projects like Sen̓áḵw, these partnerships are leading the way in building a better future for generations to come, as we continue to move forward together on the path to reconciliation.”</p>\n\n<footer class=\"default\">The Honourable Ahmed Hussen, Minister of Housing and Diversity and Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Sen̓áḵw development project was proposed by Sḵwx̱wú7mesh Úxwumixw (Squamish Nation), Westbank Corporation, and OP Trust, under a joint venture, working with the Government of Canada.</li>\n\t<li>In total, the Sen̓áḵw development project will create 6,000 homes when complete. The Government of Canada has committed to financing the first two of the four phases.</li>\n\t<li>The funds announced today are being provided by the Canada Mortgage and Housing Corporation (CMHC) through its Rental Construction Financing Initiative (RCFI). Launched in 2017 and part of Canada’s National Housing Strategy (NHS), the RCFI provides low-interest, repayable loans to support construction projects from coast to coast to coast and encourage a stable supply of rental housing for middle-income families in expensive housing markets, with a total target of more than 71,000 new rental housing units.</li>\n\t<li>Canada’s NHS is an ambitious, 10-year plan to invest over $72&nbsp;billion to give more Canadians a place to call home. Since its launch in 2017, the government has committed over $26.5&nbsp;billion to support the creation of over 106,100 units and the repair of over 254,600 units.</li>\n\t<li>In addition to today’s announcement, the government proposed over $4&nbsp;billion in new funding through Budget&nbsp;2022 to create access to safe and affordable housing for Indigenous Peoples, including through targeted investments and the development of an Urban, Rural, and Northern Indigenous Housing Strategy in partnership with Indigenous Peoples.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget&nbsp;2022 Backgrounder: Making Housing More Affordable</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/moving-forward-on-reconciliation.html\">Budget&nbsp;2022 Backgrounder: Moving Forward on Reconciliation</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.squamish.net/\">Sḵwx̱wú7mesh Úxwumixw (Squamish Nation)</a></li>\n\t<li><a href=\"https://senakw.com/\">Sen̓áḵw</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rental-construction-financing-initiative\">Rental Construction Financing Initiative</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\">National Housing Strategy</a></li>\n</ul></div>\n      "
}