{
  "path": "/en/news/statements/2021/05/09/statement-prime-minister-europe-day",
  "pageTitle": "Statement by the Prime Minister on Europe Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Europe Day:</p>\n\n<p>“Today, on Europe Day, we join our international partners to celebrate alongside our friends and allies in Europe. The European Union is a true example of cooperation among states, and represents hope for democracy and peaceful pluralism.</p>\n\n<p>“This year, we also mark the 45th anniversary of the European Union’s diplomatic presence in Canada, and celebrate our long history as strategic partners. The relationship between Canada and the European Union is based on shared values, close cooperation, and strong people-to-people ties. Canada is one of the European Union’s oldest international partners and today, around 25 million people who share some European descent call our country home. From Vancouver and Toronto, to Montréal and Halifax, they continue to shape our vibrant and diverse communities, and represent one of the largest European diasporas in the world.</p>\n\n<p>“The European Union is also our second-largest trading partner. Through the Canada-European Union Comprehensive Economic and Trade Agreement, we are building trade and investment, and creating opportunities and jobs for people on both sides of the Atlantic. The Canada-European Union Strategic Partnership Agreement also marks an important chapter in our relationship, deepening our cooperation on an even wider range of issues, and establishing regular meetings between leaders, ministers, and senior officials.</p>\n\n<p>“Canada will continue working with the European Union to address the greatest challenges of our times. Together, we are taking steps to fight the global COVID‑19 pandemic, including rolling out safe and effective vaccines and supporting more vulnerable countries, and driving economic growth and recovery. We will also continue to advance our common priorities, from fighting climate change and protecting human rights, to promoting peace, security, democracy, and the rule of law.</p>\n\n<p>“Today is a time to celebrate the close partnership and strong ties that unite our country and the European Union. On behalf of the Government of Canada, I offer my best wishes to everyone celebrating Europe Day, here in Canada and around the world.”</p></div>\n      "
}