{
  "path": "/en/news/readouts/2019/12/13/prime-minister-justin-trudeau-deputy-prime-minister-chrystia-freeland-and",
  "pageTitle": "Prime Minister Justin Trudeau, Deputy Prime Minister Chrystia Freeland, and Leader of the Government in the House of Commons and Quebec Lieutenant Pablo Rodriguez meet with Quebec Premier François Legault | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau, Deputy Prime Minister and Minister of Intergovernmental Affairs Chrystia Freeland, and Leader of the Government in the House of Commons and Quebec Lieutenant Pablo Rodriguez met today with Quebec Premier François Legault to discuss common priorities. Premier Legault was accompanied by the Minister responsible for Canadian Relations and the Canadian Francophonie, Sonia LeBel. Prime Minister Trudeau reaffirmed his commitment to work collaboratively with Premier Legault and the Government of Quebec.</p>\n\n<p>The leaders discussed the importance of ratifying and implementing the new North American Free Trade Agreement (NAFTA). They also discussed the important role of the provinces and territories in promoting Canada’s trade interests and strengthening ties with our international partners for the benefit of all Canadians.</p>\n\n<p>The Prime Minister, the Deputy Prime Minister, the Quebec Lieutenant, the Premier, and the Minister affirmed their commitment to other shared priorities including infrastructure, public transit, the VIA Rail high frequency rail project, the environment and the fight against climate change, digital taxation, and health. They also agreed on the importance of a collaborative approach to immigration to address labour shortage issues. In addition, the leaders expressed their desire to finalize negotiations in the near future for an asymmetrical housing agreement.</p>\n\n<p>They agreed to continue to collaborate on these important priorities, and look forward to the next First Ministers’ Meeting.</p></div>\n      "
}