{
  "path": "/en/news/statements/2018/03/21/statement-prime-minister-international-day-elimination-racial",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Racial Discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Racial Discrimination:</p><p>“As Canadians, we embrace diversity as a defining aspect of our identity. Yet, over the centuries, people in Canada have not felt progress equally. Far too many have faced discrimination, often on the basis of the way they look or where they are from.</p><p>“Today, we take a hard look at the present, and recognize a reality at home that does not always live up to the values we project to the world. Racial discrimination persists in our communities, and every day denies friends and neighbours – fellow Canadians – the opportunity and justice they deserve.</p><p>“Change starts when we examine our own attitudes and beliefs, and question how they came to be. It takes daily, deliberate effort to recognize the biases we hold, especially those we are unaware of. Biases, whether out in the open or unseen, are barriers of our own making that bring us all down.</p><p>“The Government of Canada is committed to a future where all Canadians, in particular those whose identities have been historically marginalized, experience full and equal participation in society. We will continue to <a href=\"/en/news/news-releases/2018/02/14/government-canada-create-recognition-and-implementation-rights\">take steps</a> to renew the relationship between Canada and Indigenous Peoples, based on recognition of rights, respect, cooperation, and partnership. We will work harder to emphasize the stories and contributions of all Canadians, through initiatives recognizing the <a href=\"/en/news/news-releases/2018/01/30/prime-minister-announces-government-canada-will-officially-recognize\">International Decade for People of African Descent</a>. And we will always stand up to racism, xenophobia, and hate in all its forms.</p><p>“Despite the progress we have made, the fight against racial discrimination is far from over. We cannot be complacent. It’s up to each of us to make sure Canada lives up to its promise – for everyone.”</p></div>\n      "
}