{
  "path": "/en/news/news-releases/2021/01/29/support-students-and-school-staff-through-safe-return-class-fund",
  "pageTitle": "Support for students and school staff through the Safe Return to Class Fund | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>This school year has been difficult for students, teachers, staff, and families as our country continues to deal with the impacts of the global COVID-19 pandemic. Students are being asked to learn in new ways, teachers are adapting their teaching styles, and parents are finding ways to keep their children engaged with their schoolwork while they may be working from home. With the continued rise in COVID-19 cases across the country, the Government of Canada will continue to be there for them, and to support provinces and territories in their efforts to protect the health of students and staff.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the second instalment of the Safe Return to Class Fund, to ensure students, teachers, and staff have the support they need to stay safe and healthy throughout this difficult school year.</p>\n\n<p>The second instalment of up to $1 billion is provided to the provinces and territories, and can be used for various measures, such as supporting adapted learning spaces and remote learning, improving air ventilation, increasing hand sanitation and hygiene, purchasing personal protective equipment and cleaning supplies, and providing health and safety training for staff. Provinces and territories will continue working alongside local school boards and administering the funding, to ensure the safety of students and staff members during the pandemic.</p>\n\n<p>The Government of Canada will continue to work together with provincial and territorial partners to provide a healthy school environment for students, teachers, and staff members in this challenging time. Until a safe and effective vaccine becomes available for all Canadians, we will continue to do whatever it takes, for as long it takes, to beat COVID-19 and protect Canadians through the crisis.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“School is so important for kids’ ability to learn and grow. We must make sure that our children are learning in a safe environment, and that teachers are safe on the job. Our government will continue to ensure that provinces and territories can make decisions based on public health advice, not budget limitations, as we work together to keep students, teachers, staff, and families healthy and safe during this unprecedented school year.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The pandemic has been a difficult time for families. Children in particular have shown remarkable resilience, whether they are adjusting to learning at home, diligently wearing masks while at school, or not being able to spend as much time with their friends. Now, more than ever, we need to make sure that we are protecting their health and that of their teachers and school staff, so that they can continue to learn in a safe and healthy way.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government committed to protecting Canadians during the pandemic. Through the Safe Return to Class Fund, we are helping to keep students and their teachers safer. This investment will help premiers from coast to coast to coast support children, their families, and everyone working in schools.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2><strong>Quick Facts</strong></h2>\n\n<ul>\n\t<li>On August 26, 2020, the Prime Minister announced up to $2 billion in funding to support provinces and territories in their efforts to ensure a safe return to school, through the Safe Return to Class Fund. A first instalment of $1 billion was provided to provinces and territories in September 2020.</li>\n\t<li>The funding by province and territory is allocated based on the number of children aged between 4 and 18 years old, with a $2 million base amount provided to each jurisdiction.</li>\n\t<li>On July 16, 2020, the Prime Minister and Deputy Prime Minister announced more than $19 billion as part of the Safe Restart Agreement to help provinces and territories safely restart their economies while protecting the health of Canadians.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school\">Prime Minister announces support for a safe return to school</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement\">More support for Canadians through the Safe Restart Agreement</a></li>\n</ul></div>\n      "
}