{
  "path": "/en/news/statements/2017/06/21/statement-prime-minister-canada-national-aboriginal-day",
  "pageTitle": "Statement by the Prime Minister of Canada on National Aboriginal Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Aboriginal Day:</p><p><span lang=\"EN\" xml:lang=\"EN\">“Over twenty years ago, the Government of Canada, together with Indigenous organizations, designated this day – the summer solstice – as <a href=\"https://www.aadnc-aandc.gc.ca/eng/1100100013248/1100100013249\">National Aboriginal Day</a>. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Every year, we join together on this day to recognize the fundamental contributions that First Nations, Inuit, and the Métis Nation have made to the identity and culture of all Canadians. The history, art, traditions, and cultures of Indigenous Peoples have shaped our past, and continue to shape who we are today. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“No relationship is more important to Canada than the relationship with Indigenous Peoples. Our Government is working together with Indigenous Peoples to build a nation-to-nation, Inuit-Crown, government-to-government relationship – one based on respect, partnership, and recognition of rights.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“We are determined to make a real difference in the lives of Indigenous Peoples – by&nbsp;closing&nbsp;socio-economic gaps,&nbsp;supporting greater self-determination, and establishing opportunities to work together on shared priorities.&nbsp;</span>We are also <span lang=\"EN\" xml:lang=\"EN\">reviewing&nbsp;all federal laws and policies that concern Indigenous Peoples and&nbsp;making progress on the Calls to Action outlined in the Final Report of the Truth and Reconciliation Commission.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“On behalf of the Government of Canada, I wish everyone a happy National Aboriginal Day. I invite all Canadians to take part in the #NADCanada activities in their community and to learn about the history, cultures and traditions of Indigenous Peoples. The 150<sup>th</sup> anniversary of Confederation this year reminds us of the legacy of the past. As we look forward to the next 150 years, we commit to move ahead together in a spirit of reconciliation and respect.</span></p><p><strong><span lang=\"EN\" xml:lang=\"EN\">“</span></strong><span lang=\"EN\" xml:lang=\"EN\">This year, I am also pleased to announce that from here forward the Government’s intention is to rename this day National Indigenous Peoples Day.”</span></p></div>\n      "
}