{
  "path": "/en/news/news-releases/2023/01/23/supporting-canadas-leadership-quantum-computing-grow-economy-and",
  "pageTitle": "Supporting Canada’s leadership in quantum computing to grow the economy and create jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Quantum technologies are at the leading edge of science and innovation. As Canadian researchers, workers and businesses continue to demonstrate leadership on the world stage in innovating and developing quantum technologies, we have the potential to transform how we work and live in Canada and around the world – in areas from fighting climate change to making advancements in health care. The Government of Canada will continue to support Canadian companies to help them keep growing and staying competitive, while driving economic growth and creating highly skilled and well-paying jobs for Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a new federal investment of $40&nbsp;million to enable the Toronto-based Canadian quantum computing company Xanadu Quantum Technologies Inc. to build and commercialize the world’s first photonic-based, fault-tolerant quantum computer. Once developed, this computer will have the potential to provide world leading capabilities to help solve complex data problems and could be used in a variety of sectors such as finance, transportation, environmental modelling, and health.</p>\n\n<p>Supported through the government’s Strategic Innovation Fund, this $177.8&nbsp;million project is expected to create 530 new highly skilled positions in the high-tech and quantum computing fields.</p>\n\n<p>Home to some of the world’s largest quantum tech hubs, Canada is well positioned to become a global leader in the developing quantum sector, which will create new opportunities for Canadians and Canadian businesses. The Government of Canada will continue to invest in innovative companies to grow the economy and create highly skilled and well-paying jobs for Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Quantum technology is changing the world as we know it. With the potential to solve difficult problems in key areas such as health care, finance, and climate sciences, this sector expands the realm of possibility. Today’s announcement is great news for Canadian workers and businesses. This investment will bring good jobs, spur economic growth, boost innovation, and solidify Canada as a world leader in quantum technology.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Quantum technologies will set the course of the future and thanks to companies like Xanadu, Canada is at the forefront ready to lead. With today’s announcement, our government is strengthening Canada’s position in quantum technology and helping to create more economic growth and good jobs for Canadians. We’ll continue to build this sector through our National Quantum Strategy and support made-in-Canada technology so Canada remains a world leader for decades to come.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“The government's continued investment in quantum technologies has been invaluable to our success. We are proud to be a Canadian company and, with this investment, are excited to enter the next phase in our mission to build quantum computers that are useful and available to people everywhere.”</p>\n\n<footer class=\"default\">Christian Weedbrook, Founder and CEO, Xanadu</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the birth of quantum science more than 100 years ago, quantum technologies have been the source of many game-changing innovations such as semiconductors and the laser.</li>\n\t<li>Quantum science is the study, manipulation, and control of systems at the atomic and subatomic level.</li>\n\t<li>It is estimated that by 2045, the Canadian quantum industry will be a $139&nbsp;billion industry, including all economic effects, and account for over 200,000 jobs, according to a study commissioned by the National Research Council in 2020.</li>\n\t<li>Earlier this month, the Government of Canada launched its National Quantum Strategy, which invests an additional $360&nbsp;million to help solidify Canada as a global leader in quantum technologies.</li>\n\t<li>Over the past 10 years, the Government of Canada has invested more than $1&nbsp;billion in quantum research and science.</li>\n\t<li>Additionally, the government has invested in bringing new quantum technologies to the Canadian and global markets, including investments through Canada’s regional development agencies, the Strategic Innovation Fund, and the National Research Council of Canada’s Industrial Research Assistance Program.</li>\n\t<li>Xanadu is a notable contributor to Canada’s innovation ecosystem and has committed to continuing to support innovation, growth, and Canada’s research and development sector.</li>\n\t<li>Founded in 2016, Xanadu is a Toronto-based Canadian quantum computing company with the mission to build quantum computers that are useful and available to people everywhere. Xanadu has become one of the world’s leading quantum hardware and software companies and leads the development of PennyLane, an open-source software library for quantum computing and application development.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://ised-isde.canada.ca/site/national-quantum-strategy/en\">Overview of Canada’s National Quantum Strategy</a></li>\n\t<li><a href=\"https://ised-isde.canada.ca/site/strategic-innovation-fund/en\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en\">National Research Council Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-building-an-innovation-economy-of-the-future.html\">Budget&nbsp;2021: Building an Innovation Economy of the Future</a></li>\n</ul></div>\n      "
}