{
  "path": "/en/news/news-releases/2022/12/07/protecting-more-nature-partnership-indigenous-peoples",
  "pageTitle": "Protecting more nature in partnership with Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Indigenous Peoples have been caring for the lands and waters of Canada since time immemorial. First Nations, Inuit, and Métis have unique relationships with nature and knowledge of responsible stewardship as a way of life. By working together and supporting Indigenous Peoples in protecting more nature across the country, we are continuing to listen to their voices and helping ensure the world we leave to future generations is safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $800&nbsp;million over seven years, starting in 2023-24, to support up to four Indigenous-led conservation initiatives. Once completed, these projects could protect an additional up to one million square kilometres. This investment is a major step forward in protecting nature across the country and will drive progress toward Canada’s ambitious goals of conserving 25 per cent of land and waters by 2025, and 30 per cent of each by 2030.</p>\n\n<p>This investment will support the establishment of protected areas through an innovative funding model – Project Finance for Permanence (PFP) – which is based on partnership. It brings together Indigenous organizations, governments, and the philanthropic community to identify shared goals for protecting nature and ultimately halting biodiversity loss. The government recognizes the community leadership and the work of philanthropic organizations in support of this important work.</p>\n\n<p>With this funding, the Government of Canada is helping to bring together 30 Indigenous governments and organizations in the Northwest Territories. Funding is also intended to support the conservation of lands and waters in the Northernshelf Bioregion in British Columbia, in Qikiqtani Region in Nunavut, and in Ontario’s Hudson Bay Lowlands, as well as the coastline of Western Hudson Bay and southwestern James Bay – one of North America’s most carbon-rich and biodiverse ecosystems.</p>\n\n<p>As delegates from around the world come to Montréal for the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, Canada will continue to champion its role as a leader in nature conservation. We will continue to support Indigenous-led efforts to conserve nature and biodiversity, protect Indigenous cultures and ways of life, and build a healthy future for generations to come, while making significant progress toward meeting Canada’s conservation goals.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Our government is here as a partner. And today, we took an important step forward – together – to deliver a vision of conservation that has partnership and reconciliation at its core. I’m looking forward to our shared work to deliver results for communities and for the nature that sustains us all.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Indigenous Peoples have been guardians of the land, waters, and ice of this continent for millennia. Canada’s ambitious biodiversity goals can only be met in partnership with First Nations, Inuit, and Métis. By coupling Indigenous and Western science, we can fight the twin crises of climate change and biodiversity loss, strengthen our relationships with Indigenous communities, and build a better future for everyone.”</p>\n\n<footer class=\"default\">The Hon. Steven Guilbeault, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“Indigenous Peoples have been stewards of the land and water for generations, and are profoundly connected to them. This new funding will support Indigenous-led marine conservation initiatives to protect our shared coasts and oceans for the next seven generations.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today’s funding will help leverage third-party investments to contribute toward Canada’s conservation targets, and advance reconciliation with Indigenous Peoples.</li>\n\t<li>The Government of Canada has made historic investments in Indigenous-led conservation initiatives that support Indigenous rights and responsibilities in protecting and conserving ecosystems, developing and maintaining sustainable economies, and continuing the profound connections between natural landscapes and Indigenous cultures including:\n\t<ul>\n\t\t<li>Investing more than $118&nbsp;million in Budget&nbsp;2018, to support Indigenous-led conservation initiatives, including Indigenous Guardians and Indigenous Protected and Conserved Areas; and</li>\n\t\t<li>Investing almost $454&nbsp;million in Budget&nbsp;2021 to support a host of Indigenous-led conservation initiatives, such as Indigenous-Led Area-Based Conservation, Indigenous Guardians, conservation on Inuit Owned Lands, and Indigenous Partnerships for Species at Risk.</li>\n\t</ul>\n\t</li>\n\t<li>Grounded in science, Indigenous knowledge, and local perspectives, Canada is committed to working with partners to conserve 25 per cent of lands and waters by 2025, and 30 per cent by 2030.</li>\n\t<li>United Nations data suggests that lands for which Indigenous Peoples are stewards comprise around 20 per cent of the Earth’s territory and contain as much as 80 per cent of the world’s remaining biodiversity.</li>\n\t<li>The United Nations Convention on Biological Diversity is the international legal instrument for the conservation of biological diversity, the sustainable use of its components, and the fair and equitable sharing of the benefits arising out of the utilization of genetic resources. The Convention has been ratified by 196 nations.</li>\n\t<li>Canada stepped up to be the host location of the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity from December 7 to 19, 2022, in Montréal, where we will renew the call for ambitious action to protect nature.</li>\n\t<li>Along with international partners, Canada is committed to both the development of an ambitious Global Biodiversity Framework with clear targets, as well as the inclusion of Indigenous knowledge, to conserve and protect natural environments at home and around the world.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/06/canada-welcomes-world-cop15-protect-nature\">Canada welcomes the world for COP15 to protect nature</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/nature-legacy/indigenous-leadership-funding.html\">Indigenous environmental leadership, funding, and initiatives</a></li>\n\t<li><a href=\"https://www.ilinationhood.ca/\">Indigenous Leadership Initiative</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN Biodiversity Conference: COP15 in Montréal</a></li>\n</ul></div>\n      "
}