{
  "path": "/en/news/readouts/2022/11/17/prime-minister-justin-trudeau-meets-prime-minister-thailand-prayut-chan-o",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Thailand Prayut Chan-o-cha | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Thailand, Prayut Chan-o-cha, on the margins of the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting.</p>\n\n<p>Prime Minister Trudeau thanked Prime Minister Prayut for organizing the APEC Summit as host, and discussed Thailand’s emphasis on sustainable and clean economic growth.</p>\n\n<p>The leaders talked about the positive and growing trade between Canada and Thailand, and the tremendous potential for growth. They also recognized the strong and growing ties between our peoples.</p>\n\n<p>The prime ministers talked about how a Canada-Association of Southeast Asian Nations (ASEAN) free-trade agreement would help drive prosperity and create good middle-class jobs in both countries, and across the region.&nbsp; They also talked about the elevation of Canada’s status as a Strategic Partner to ASEAN.</p>\n\n<p>Prime Minister Trudeau discussed Canada’s Indo-Pacific Strategy, and the work we are doing to grow our relationships in Thailand and throughout the region.</p>\n\n<p>The leaders also discussed human rights, education, and the importance of clean technology and climate-resilient infrastructure to help prevent and manage the increasingly serious impacts of climate change across the Indo-Pacific region.</p>\n\n<p>Prime Minister Trudeau expressed Canada’s support for efforts by ASEAN to bring an end to the crisis in Myanmar, and reiterated Canada’s condemnation of the grave human rights violations perpetrated by Myanmar’s military regime.</p>\n\n<p>The prime ministers also exchanged views on Russia’s illegal invasion of Ukraine, and the severe impacts the conflict is having on food, fuel, and energy security in the Indo-Pacific region and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/thailand-thailande/relations.aspx?lang=eng\">Canada-Thailand relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/myanmar.aspx?lang=eng\">Canada’s response to the Rohingya and Myanmar</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}