{
  "path": "/en/news/readouts/2021/01/19/prime-minister-justin-trudeau-speaks-prime-minister-israel-benjamin",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Israel Benjamin Netanyahu  | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with&nbsp;the&nbsp;Prime Minister of Israel, Benjamin Netanyahu.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Netanyahu discussed the measures in Canada and in Israel to fight the COVID-19 virus, save lives, and support people. They underlined the vital role of safe and effective vaccines to control and end the pandemic around the world, and exchanged views on effective strategies for vaccine rollout. They agreed on the importance of a coordinated international response&nbsp;to advance equitable access to vaccines, diagnostics, and therapeutics.</p>\n\n<p>The two leaders reaffirmed their commitment to the&nbsp;long-standing relationship&nbsp;between Canada and Israel founded on close people-to-people ties.&nbsp;They&nbsp;looked forward to the continued collaboration between&nbsp;both their countries&nbsp;on shared priorities, including trade.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Israel Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-by-international-development-minister-on-appointment-to-the-covax-advance-market-commitment-engagement-group.html\">Statement by International Development Minister on Appointment to the COVAX Advance Market Commitment Engagement Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n</ul></div>\n      "
}