{
  "path": "/en/news/news-releases/2022/10/21/african-union-commission-chairperson-moussa-faki-mahamat-visit-canada",
  "pageTitle": "African Union Commission Chairperson Moussa Faki Mahamat to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the African Union Commission (AUC) Chairperson Moussa Faki Mahamat, will visit Ottawa from October 26 to 27, 2022.</p>\n\n<p>On October 26, Prime Minister Trudeau will meet with Chairperson Faki to reiterate Canada’s recognition of the African Union’s important role in promoting an integrated, prosperous, and peaceful African continent. The leaders will build on the collaborative partnership between Canada and the African Union and advance shared priorities including protecting democracy, advancing gender equality and women’s empowerment, and addressing challenges of shared concern like food security and climate change. They will work together to drive economic growth that benefits everyone, expand trade and investment, enhance peace and security, and create good middle class jobs.</p>\n\n<p>The meeting between the leaders will be followed by a historic first, the Canada-African Union Commission High-Level Dialogue, from October 27 to 28, co-hosted by Chairperson Faki and Minister of Foreign Affairs Mélanie Joly. Minister of International Trade, Export Promotion, Small Business and Economic Development &nbsp;Mary Ng, and Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada, Harjit Sajjan will also attend. The High-Level Dialogue is the fulfillment of an agreement between the Prime Minister with Chairperson Faki when they met on the margins of the 33rd African Union Summit in Ethiopia in February 2020.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I look forward to welcoming Chairperson Faki in the context of the first ever Canada-African Union Commission High-Level Dialogue. Canada has long supported the African Union’s vision of African-led solutions to support economic and political development. Together, we will drive economic growth that benefits everyone, create good middle class jobs, and build a better future for people in Canada and in Africa.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau was the first Canadian Prime Minister to attend an African Union Summit, when he travelled to Ethiopia in 2020.</li>\n\t<li>This is Chairperson Faki’s first visit to Canada as Chairperson of the African Union Commission.</li>\n\t<li>Prime Minister Trudeau directed Minister Ng to develop an economic cooperation strategy with Africa to advance shared priorities.</li>\n\t<li>The African Union is a continental body consisting of 55 members on the African Continent.</li>\n\t<li>The African Union is led by its Assembly, which includes heads of states and governments who meet annually at the Summit to develop, negotiate, and adopt common positions on key continental issues and priorities, promote peace and security, socio-economic development, governance, climate change, and continental integration.</li>\n\t<li>Canada has been accredited as a permanent observer to the African Union since 2009.</li>\n\t<li>In June 2022&nbsp;on the margins of the Commonwealth Heads of Government Meeting in Rwanda, Canada announced it would establish a dedicated permanent observer mission to the African Union, based&nbsp;in&nbsp;Addis Ababa, Ethiopia, which will enable Canada to bring a renewed focus to its relationship with the African Union and strengthen ongoing efforts on shared priorities.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2020/02/08/prime-minister-justin-trudeau-meets-african-union-commission-chairperson\">Prime Minister Justin Trudeau meets with African Union Commission Chairperson Moussa Faki Mahamat</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/06/minister-joly-announces-expansion-of-diplomatic-relations-with-rwanda-and-appointment-of-new-ambassador-to-african-union.html\">Minister Joly announces expansion of diplomatic relations with Rwanda and appointment of new ambassador to African Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://au.int/\">The African Union</a><a href=\"https://au.int/\"> </a></li>\n</ul></div>\n      "
}