{
  "path": "/en/news/statements/2023/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p>\n\n<p>“Each and every day, women and girls help shape Canada into a fairer and stronger country. As we mark <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/international-womens-day/2023-theme.html\">International Women’s Day</a>, we celebrate and recognize the achievements of women and girls in Canada and reaffirm our commitment to removing systemic barriers to advance gender equality in Canada and around the world.</p>\n\n<p>“This year’s theme, Every Woman Counts, is a reminder that all women, from all ages and walks of life, have a place in every aspect of Canadian society. With a disturbing recent rise in anti-transgender hate here in Canada, we reiterate today that trans women are women and we will always stand up to hate whenever and wherever it occurs.</p>\n\n<p>“When we invest in empowering women and girls, we help entire families, communities, and societies succeed. That is why increasing women's participation in the work force and closing the gender wage gap has long been a key priority for the Government of Canada, and why supporting and empowering women and girls will continue to be at the heart of the decisions we make.</p>\n\n<p>“Last year, labour force participation for working-age women in Canada reached a record-high 85 per cent. This was bolstered by our Canada-wide <a href=\"https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories.html\">early learning and child care</a> system, which is already delivering $10-a-day child care in nearly half of Canadian provinces and territories and has reduced fees by at least 50 per cent in all other jurisdictions, with work on track to reach $10-a-day across the country in just three years. In addition, we launched the <a href=\"https://ised-isde.canada.ca/site/women-entrepreneurship-strategy/en\">Women Entrepreneurship Strategy</a>, which has provided funding to address systemic barriers to women’s equality and advance their full and equal participation in the economy through greater access to financing, mentorship, and training. By enabling more women, especially mothers, to participate in the workforce, and by advocating for gender parity at the management level through programs like the <a href=\"https://ised-isde.canada.ca/site/ised/en/50-30-challenge-your-diversity-advantage\" target=\"_blank\" title=\"https://ised-isde.canada.ca/site/ised/en/50-30-challenge-your-diversity-advantage\">50 – 30 Challenge</a>, we build better futures for everyone.</p>\n\n<p>“Internationally, <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a>&nbsp;continues to guide our efforts to advance gender equality around the world. In 2021-22, Canada allocated 99 per cent of its bilateral international development assistance toward initiatives that either targeted or integrated gender equality and the empowerment of women and girls. This included funding to tackle gender-based discrimination and to provide access to sexual and reproductive health services to ensure women and girls can exercise their right to make decisions about their own bodies. It also included funding to help more women start a business or secure decent work. Canada is committed to supporting the efforts of women leaders and feminist groups that work tirelessly and bravely to promote peace and protect the rights of women and vulnerable groups, including through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/wvl_projects-projets_vlf.aspx?lang=eng\">Women’s Voice and Leadership program</a> and the co-creation of the Alliance for Feminist Movements. Working with our international partners, we will continue to make gender equality a priority, for the benefit of women, girls, and all people around the world.</p>\n\n<p>“On this International Women’s Day, I invite all Canadians to amplify the voices of women and girls, celebrate their enormous contributions in every aspect of Canadian society, and stand up for a more equal and equitable world.”</p></div>\n      "
}