{
  "path": "/en/news/statements/2022/09/05/statement-prime-minister-labour-day",
  "pageTitle": "Statement by the Prime Minister on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p>\n\n<p>“Today, on Labour Day, we celebrate Canada’s workers, the backbone of our communities and our economy.</p>\n\n<p>“Our workforce built this country. From constructing the roads we drive on, to maintaining the technology that connects us, to delivering food to our grocery stores, and so much more – we rely on workers every single day.</p>\n\n<p>“Canadians have recovered more than all of the jobs lost since the beginning of the pandemic. Now, as we continue to recover and our economy continues to grow, our workforce is confronting new challenges and rising to meet the opportunities that lie ahead. For example, as we grow a clean economy, we are ensuring that workers in our automotive sector benefit from Canada’s leadership on electric cars. From mining critical minerals to building batteries and manufacturing vehicles, we have already secured tens of thousands of jobs and attracted billions of dollars in investments. And there is more to do.</p>\n\n<p>“In energy, technology, infrastructure, skilled trades, and so much more, the expertise of the Canadian workforce is invaluable. The Government of Canada will continue to support workers and create opportunities for them so we can build a better future for everyone. From protecting the rights of organized labour to improving workplace safety and job training, we have been a partner of the labour movement. Earlier this year, we launched the <a href=\"https://www.canada.ca/en/services/jobs/training/initiatives/skills-success.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_skills-success\">Skills for Success</a> program to help Canadians acquire the skills they need to succeed at work. We are modernizing Employment Insurance to better meet the evolving needs of Canadian workers and to reflect new realities, like more gig economy jobs. We also increased the federal minimum wage to $15.55-an-hour – indexed to inflation – and are introducing 10 days of paid sick leave for federally regulated workers.</p>\n\n<p>“While Canadians work hard each and every day, we know that families are feeling the impacts of inflation, particularly through rising food and gas costs. That’s why we’re focused on making life more affordable, now. We expanded the Canada Workers Benefit (CWB) to put up to $2,400 back in the pockets of families and we are reducing the cost of housing, child care, and dental care as part of our <a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">Affordability Plan</a> to help the middle class and those working hard to join it.</p>\n\n<p>“On behalf of the Government of Canada, I wish all Canadians a safe and happy Labour Day. Today, we not only recognize the hard work and determination of the labour activists who fought for paid holidays, universal health care, and employment insurance, we also commit to building on their successes and continuing to make our workplaces safe and our future brighter.”</p></div>\n      "
}