{
  "path": "/en/news/statements/2016/12/24/statement-prime-minister-canada-christmas",
  "pageTitle": "Statement by the Prime Minister of Canada on Christmas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p></p><br>\n<p>The Prime Minister, Justin Trudeau, today issued the following statement to mark Christmas:</p>\n<p>“Merry Christmas, Canada!</p>\n<p>“The holiday season is truly my favourite time of the year. As we come together with loved ones, let us reflect on how fortunate we are to call this beautiful country home.</p>\n<p>“Living in Canada comes with a responsibility to be there for each other – and not just during this time of year, but each and every day. After all, Canadians helping others – no matter the distance that separates them – is what this country is all about.</p>\n<p>“When tragedy struck Fort McMurray, and thousands of Canadians were forced to leave their homes, thousands more came together to make sure evacuated families had a place to stay, clothes to wear, and food to eat.</p>\n<p>“Today, as Canadians continue to welcome Syrian refugees, we open our hearts and homes to those most in need. Together, we demonstrate that better is always possible and that, in difficult times, we are at our very best.</p>\n<p>“So, during this season of hope, let us reach out to those who are hurting most. Let us give back in whatever way we can, and make sure this holiday season is a happy time for everyone. There is no holiday tradition more timeless than that.</p>\n<p>“I also ask you take a moment to remember the brave women and men of the Canadian Armed Forces – and their families – who make incredible sacrifices to protect our country.</p>\n<p>“As we look to the new year, and get ready to celebrate Canada’s 150th birthday, I know our best days are yet to come.</p>\n<p>“From Ella-Grace, Hadrien, Xavier, Sophie and me, to your family: Merry Christmas, happy holidays, and all the best in 2017.”&nbsp;</p></div>\n      "
}