{
  "path": "/en/news/readouts/2020/02/08/prime-minister-justin-trudeau-meets-president-ethiopia-zewde-sahle-work",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Ethiopia Zewde Sahle-Work | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the President of Ethiopia, Zewde Sahle-Work.</p>\n\n<p>Prime Minister Trudeau and President Sahle-Work discussed opportunities to deepen trade and investment linkages, creating jobs and opportunities for people in Canada and Ethiopia. The Prime Minister expressed Canada’s interest in entering into negotiations on a Foreign Investment Protection Agreement with Ethiopia.</p>\n\n<p>The two leaders also met with members of a Canadian trade delegation, including Export Development Canada, Canadian Commercial Corporation, and FinDev Canada, to discuss how to strengthen commercial ties between both countries.</p>\n\n<p>Prime Minister Trudeau, accompanied by the Minister of Small Business, Export Promotion and International Trade, Mary Ng, showcased Canada’s world-class expertise in sectors with potential to support Ethiopia’s growth, such as clean technologies, infrastructure, and information and communication technologies. He noted the importance of Ethiopia as a market for Canadian companies seeking to expand their global reach, building upon the strong connections between people in both countries.</p>\n\n<p>The two leaders also welcomed greater collaboration between Canada and Ethiopia on public-private partnerships for infrastructure development.</p>\n\n<p>The Prime Minister and the President discussed mobilizing creativity and capital in the private sector to help drive Africa’s economic transformation and create opportunities for all, especially youth.</p>\n\n<p>The two leaders discussed ways to continue advancing gender equality and women’s empowerment, building upon their successful collaboration at Women Deliver hosted by Canada in 2019.</p>\n\n<p>They exchanged views on regional peace and security and agreed to continue to work together to advance the Women, Peace and Security agenda.</p>\n\n<p>The Prime Minister’s visit to Ethiopia builds upon the deep friendship between Canada and Ethiopia, founded upon close people-to-people ties, strong commercial relations, and extensive bilateral cooperation.</p></div>\n      "
}