{
  "path": "/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight",
  "pageTitle": "Prime Minister announces new partnerships with Canadian industries to fight COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian businesses and manufacturers are stepping up to fight the COVID-19 pandemic. The Government of Canada is working with these companies to ensure our health care workers have the tools they need to care for Canadians across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced progress under Canada’s Plan to Mobilize Industry to fight COVID-19, which increases Canada’s ability to respond to the outbreak with necessary medical equipment and supplies.</p>\n\n<p>The Government of Canada is investing $2 billion to support diagnostic testing and to purchase ventilators and protective personal equipment, including for bulk purchases with provinces and territories. Personal protective equipment includes things like more masks and face shields, gowns, and hand sanitizer.</p>\n\n<p>On March 20, 2020, the Government of Canada called on Canadian businesses and manufacturers to help deliver critical health supplies. Since then, the government has spoken directly with almost 3,000 Canadian companies that have offered their expertise and capacity to meet the country’s need for personal protective equipment and critical health supplies.</p>\n\n<p>The Government of Canada has signed new procurement agreements with Canadian companies Thornhill Medical, Medicom, and Spartan Bioscience to purchase and boost capacity to manufacture equipment and supplies including portable ventilators, surgical masks, and rapid testing kits. The government has ordered millions of supplies to ease the pressure on health care facilities. It has also signed letters of intent with five companies – Precision Biomonitoring, Fluid Energy Group Ltd., Irving Oil, Calko Group, and Stanfield’s – to produce additional test kits, hand sanitizer, and protective apparel including masks and gowns.</p>\n\n<p>The government welcomes the cooperation of other companies and industries that have answered the call to action and offered their support in the fight against the COVID-19 pandemic. This includes efforts from companies to re-tool their facilities and double their production capacity, to collect and donate existing supplies and equipment, and to combine resources to manufacture needed supplies more quickly. Companies like Magna, General Motors, Toyota Motor Manufacturing Canada, Ford, Linamar, Shell, Suncor, Alibaba Group, and The Home Depot have helped Canada’s health care professionals by donating personal protective and safety equipment and sanitizing supplies.</p>\n\n<p>In addition, $50 million has been made available in funding for members of the Next Generation Manufacturing Supercluster to develop and scale-up new, in-demand technologies, equipment, and medical products. This includes technologies and products to test and treat Canadians, such as novel virus detection tests, vaccines, therapeutics, and symptom management treatments. It also includes medical equipment to care for Canadians, such as ventilators, peripherals, personal protective equipment, and cleaning and sterilization chemicals and equipment.</p>\n\n<p>These measures are part of the larger strategy the Government of Canada is implementing to protect Canadians and prevent the spread of the virus. Collaboration with Canadian manufacturing and innovation is an important part of this strategy, which will ultimately result in better health and safety for Canadians, as well as a more resilient health care system.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadian companies are answering the call to provide critical support to our health care workers, who are on the front lines of our country’s fight against COVID-19. As the situation continues to evolve, the Government of Canada will be there to work with Canadian industry to find solutions that will support our medical professionals and protect the health and safety of all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is mobilizing its resources to confront COVID-19, and Canadian industry is doing their part. We are in this together. From researchers to business there is a coordinated effort to protect the health and safety of Canadians. Today’s announcement will help strengthen our country’s response to COVID-19, while reinforcing our preparedness in responding to future health challenges.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are taking an aggressive, proactive procurement approach to secure life-saving equipment and supplies. Industry has answered the call and we have successfully tapped into both existing and new supply sources. As a result, we have placed orders for millions of essential supplies in the fight against COVID-19.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada will provide additional funding of $1.5 billion over two years, starting in 2019-20, to the Public Health Agency of Canada to support diagnostic testing and the urgent purchase of personal protective equipment, ventilators, and supplies needed to respond to COVID-19. The Government will also provide the Public Health Agency of Canada with a provision of $500 million in 2020-21.</li>\n\t<li>The Government of Canada launched a call to action under Canada’s Plan to Mobilize Industry to fight COVID-19, and offers have been received from companies with products:\n\t<ul>\n\t\t<li>ready to be purchased or ordered, that can be supported through procurement agreements with the Government of Canada</li>\n\t\t<li>under development, but not yet authorized, for which the Government of Canada can provide help with the expedited regulatory process through Health Canada</li>\n\t\t<li>needing technical or financial assistance to get into market, and which can be supported by the Government of Canada through the Strategic Innovation Fund, the National Research Council of Canada’s Industrial Research Assistance Program, Export Development Canada, and the Business Development Bank of Canada</li>\n\t</ul>\n\t</li>\n\t<li>The Strategic Innovation Fund will allow for rapid support to Canadian companies that are working on large-scale and later-stage promising research and development projects aimed at providing medical countermeasures to COVID-19, including vaccines and critical medical supplies.</li>\n\t<li>The National Research Council of Canada is partnering with Innovative Solutions Canada to launch challenges seeking near-to-market solutions from Canadian small and medium-sized businesses that need financial support to refine and sell their products or solution to meet a COVID-19-related need.</li>\n\t<li>The National Research Council of Canada is organizing a COVID-19 Pandemic Response Challenge Program, composed of teams of government, academic, and private sector partners to specific COVID-19 gaps and challenges identified by Canadian health experts. The Challenge Program is structured around three main research themes: rapid detection and diagnosis, therapeutics and vaccine development, and digital health.</li>\n\t<li>On March 11, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">announced a more than $1&nbsp;billion package</a> to help minimize the health, economic, and social impacts of the COVID-19 outbreak, which includes $50&nbsp;million to help ensure adequate supplies of personal protective equipment for provinces and territories, as well as to address federal needs.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/03/31/partnerships-canadian-industry-fight-covid-19-pandemic\">Partnerships with Canadian industry to fight the COVID-19 pandemic</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update.html\">COVID-19: Changes to Canadian taxes and benefits</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n</ul></div>\n      "
}