{
  "path": "/en/news/news-releases/2021/05/03/safe-and-dignified-retirement-canadian-seniors",
  "pageTitle": "A safe and dignified retirement for Canadian seniors | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The global COVID-19 pandemic has been devastating for Canada’s seniors, especially those living in long-term care homes. On top of this crisis, too many seniors are worried about their retirement savings running out and concerned about being able to live independently in their own homes. The Government of Canada will learn the hard lessons of this pandemic and take further action to protect the health and safety of Canadian seniors, while also supporting a retirement that is free from financial worry and provides a better quality of life.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted Budget 2021 measures that will raise benefits for seniors and put more money in their pockets, make sure those in long-term care live in safe and dignified conditions, and help them lead more healthy and independent lives.</p>\n\n<p>To give more than three million seniors greater financial security and put more money in their pockets as they advance in their retirement, Budget 2021 proposes to increase the Old Age Security (OAS) pension by 10 per cent for seniors 75 and over as of July 2022. It also proposes a one-time payment of $500 in August 2021 to OAS pensioners who will be 75 or over as of June 30, 2022.</p>\n\n<p>The government is also fulfilling its commitment to ensure the tragedies that took place in long-term care homes across the country this year never happen again. Budget 2021 intends to ensure a high standard in long-term care homes with $3 billion in funding over five years. The federal government will work collaboratively with provincial and territorial partners to make sure seniors in long-term care homes live in safe and dignified conditions.</p>\n\n<p>To support the independence of seniors who live at home, Budget 2021 proposes to launch the Age Well at Home Initiative. This new initiative will assist community-based organizations in providing support to seniors – such as matching seniors with volunteers who can help with meal preparations, home maintenance, daily errands, yard work, and transportation – and will allow them to live independently in their homes for longer.&nbsp;</p>\n\n<p>These measures build on the work that the government has been doing over the past year, and since 2015, to support Canadian seniors and help them retire in dignity after a lifetime of hard work. The Government of Canada will continue to take additional actions to better support seniors, and improve their quality of life, now and into the future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The COVID-19 pandemic has taken a devastating toll on Canada’s seniors and exposed systemic issues in long-term care homes across the country. Through Budget 2021, we will boost Old Age Security benefits, help implement new standards for long-term care, and give more seniors, and their families, the support they need as we recover and rebuild from the pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“While finishing the fight, Canada must also learn some painful lessons from this pandemic. Better support and protections for our seniors, particularly those in long-term care facilities, is essential. The past year has been difficult, but better days are ahead. Until then, the Government of Canada will do whatever it takes to keep Canadians safe. With our investments in Budget 2021, we will ensure that our seniors receive the support they need, now and in the years to come.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“As seniors age, their health and home care costs rise, all the while they are more likely to be unable to work, have disabilities or be widowed. Through Budget 2021, the government proposes to help address these pressures by increasing the Old Age Security pension for seniors aged 75 and up, strengthening Canadians’ financial security and peace of mind later in life. We’re also supporting seniors who want to live in their homes as long as possible. Budget 2021 proposes a new initiative to provide practical support to low-income and otherwise vulnerable seniors that helps them age well at home.”</p>\n\n<footer class=\"default\">The Hon. Deb Schulte, Minister of Seniors</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2021 proposes to provide $41.3 million over six years, and $7.7 million ongoing, starting in 2021-22, for Statistics Canada to improve data infrastructure and data collection on supportive care, primary care, and pharmaceuticals.</li>\n\t<li>Budget 2021 also proposes to provide additional funding of $100 million over two years, starting in 2021-22, to Employment and Social Development Canada to triple funding for the Enabling Accessibility Fund and support small and mid-sized projects with not-for-profit organizations, women’s shelters, child care centres, small municipalities, Indigenous organizations, territorial governments, small businesses, and businesses of all sizes. This would help offset the costs of renovations, retrofits, and accessible technologies in workplaces by supporting project activities that create or improve accessibility features, such as ramps to help improve access for people with wheelchairs or walkers.</li>\n\t<li>Since the pandemic began, community service non-profit and charitable organizations have struggled to provide the programs and community building projects that Canadians rely on, including seniors programs. To help these organizations adapt and modernize so they can better support the economic recovery in our communities, Budget 2021 proposes to provide $400 million in 2021-22 for Employment and Social Development Canada to create a temporary Community Services Recovery Fund.</li>\n\t<li>Budget 2021 also proposes to provide $100 million over three years, starting in 2021-22, to the Public Health Agency of Canada to support projects for innovative mental health interventions for populations disproportionately impacted by COVID-19, including seniors.</li>\n\t<li>The Government of Canada has taken a number of actions to support seniors through the global COVID-19 pandemic, such as providing a one-time, tax-free payment to those eligible for the OAS pension, along with extra support for those eligible for the Guaranteed Income Supplement (GIS). And more than 4 million seniors received an HST/GST Credit supplement. Through these measures, we provided over $900 more for low-income single seniors and more than $1,500 for low-income senior couples, on top of their existing benefits.</li>\n\t<li>Since 2015, the government has provided supports to seniors, such as:\n\t<ul>\n\t\t<li>Increasing the GIS for nearly 900,000 low-income single seniors, lifting an estimated 57,000 seniors out of poverty.</li>\n\t\t<li>Putting thousands of dollars back in the pockets of future Canadian seniors by restoring the age of eligibility for the OAS pension and the GIS benefits to 65.</li>\n\t\t<li>Enhancing the GIS earnings exemption for working low-income seniors, to help them keep more of their benefits.</li>\n\t\t<li>Ensuring that Canadian workers receive the full value of their pension by proactively enrolling Canada Pension Plan (CPP) contributors who are 70 years old or older and who have not yet applied to receive their retirement pension.&nbsp;</li>\n\t\t<li>Reducing income taxes through increases to the Basic Personal Amount. When they are fully implemented in 2023, 4.3 million seniors will benefit, including 465,000 whose federal income tax will be reduced to zero. Every year, singles will save close to $300 and couples will save nearly $600.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2021/05/backgrounder-increased-costs-for-older-seniors.html\">Backgrounder: Increased Costs for Older Seniors</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget 2021</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p3-en.html#178\">Budget 2021: Increasing Old Age Security for Canadians 75 or Over</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p1-en.html#2\">Budget 2021: Strengthening Long-term Care and Supportive Care</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p1-en.html#3\">Budget 2021: Helping Seniors Age Well at Home</a></li>\n</ul></div>\n      "
}