{
  "path": "/en/news/statements/2016/06/12/statement-prime-minister-canada-national-public-service-week-2016",
  "pageTitle": "Statement by the Prime Minister of Canada on National Public Service Week 2016 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for National Public Service Week 2016:</p>\n<p>“This National Public Service Week, I invite Canadians to join me in celebrating our federal Public Service.</p>\n<p>“Every day, public servants work hard to strengthen the middle class and improve the lives of all Canadians. Their commitment ensures that we receive the services we need, no matter the pressures they face or the challenges before them.</p>\n<p>“The theme of National Public Service Week, ‘Proudly Serving Canadians,’ could not be more apt. Since last November, my team and I have seen the passion and dedication of Canada’s public servants in every task and project that they undertake. Whether helping resettle more than 25,000 Syrian refugees into Canada, or assisting the thousands of Canadians affected by the devastating wildfires in Fort McMurray, Canada’s public servants make a real difference – day in and day out – in the lives of Canadians and people around the world.&nbsp;&nbsp;</p>\n<p>“Our public servants understand that to remain focused on the people we serve, we must work together to make openness and transparency key values of our institutions. They understand the need to renew and modernize so that together we can – effectively and efficiently – meet the needs of Canadians today and into the future.</p>\n<p>“Now is also the time to build and promote a welcoming and healthy federal Public Service environment in which public servants can access the support they need in times of personal crisis. A healthy workplace is a proud workplace – a dynamic, engaging, and appealing one to young Canadians looking for an exciting career that helps them make a real difference in the lives of others.</p>\n<p>“To public servants, I say thank you for all that you do to help us tackle the real challenges that we face as a country. You serve a vital role in our democracy, and are a source of pride and a model to other countries and governments. It is truly a privilege to work with you every single day.</p>\n<p>“I look forward to the great things we will achieve together for all Canadians.”</p></div>\n      "
}