{
  "path": "/en/news/readouts/2020/03/19/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of Ukraine, Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy, to discuss COVID‑19.</p>\n\n<p>Prime Minister Trudeau expressed solidarity with President Zelenskyy and all Ukrainians as they take all necessary measures to contain COVID‑19 and respond to its health, social, and economic impacts.</p>\n\n<p>The two leaders discussed the additional measures being taken to contain the spread of the virus, safeguard people in their respective countries, and help people abroad who want to return home. They agreed on the importance of a coordinated international response to COVID‑19, including to ensure the continued flow of goods and to support global economic activity.</p>\n\n<p>The Prime Minister discussed the importance of continuing to work on the investigation of Ukraine International Airlines Flight&nbsp;PS752, including the transfer of the black boxes to Ukraine as soon as the COVID‑19 crisis allows. He also reiterated the International Coordination and Response Group’s objectives of closure, accountability, transparency, and justice for the families and loved ones of the victims.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul></div>\n      "
}