{
  "path": "/en/news/news-releases/2016/03/11/prime-minister-trudeau-answers-questions-students-american-university",
  "pageTitle": "Prime Minister Trudeau answers questions from students at American University in Washington, D.C. | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, today engaged with students from American University in Washington, D.C. in a question and answer session which touched on many topics, including First Nations' issues, Canada's role in the fight against ISIL, and his commitment to gender parity. Several students asked questions on diversity. The Prime Minister took the opportunity to underline Canada's commitment on this matter, noting reasonable, respectful, discussion is key to democracy.</p>\n<p>Students were enthusiastic about Canada's role in addressing the Syrian refugee crisis, in particular the decision to bring 25,000 Syrian refugees to Canada. They were equally impressed with the choice made to&nbsp;bring gender parity to the federal Cabinet.</p>\n<p>When asked about climate change, PM Trudeau said that he saw a role for North America to not only work together to fight climate change, but be an example for the rest of the world. He stressed that collaboration with NAFTA partners is an important part of this. The Prime Minister also noted that science is essential to developing solutions and innovations.</p>\n<p><strong>Quote</strong></p>\n<p>“Our two countries share a vision of a strong and sustainable North American economy. One built on collaboration, clean growth, and economic diversification. Our partnership is vital to the success of both our countries. I’ll leave this visit very encouraged and extremely confident about the future of our nations.”<br>–&nbsp;<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em>&nbsp;</p>\n<p><strong>Quick Facts:</strong></p>\n<ul>\n<li>American University is located in Washington, D.C. It has students from all 50 states, the District of Columbia, and 140 countries.</li>\n<li>The university is known for its academic programs in international service, public policy and public affairs, international law and human rights.</li>\n<li>The Prime Minister is in Washington on his first official visit, the first for a Canadian Prime Minister since 1997.&nbsp;</li>\n</ul></div>\n      "
}