{
  "path": "/en/news/statements/2022/10/10/statement-prime-minister-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister on World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Mental Health Day:</p>\n\n<p>“Today, we mark <a href=\"https://www.who.int/campaigns/world-mental-health-day/2022\">World Mental Health Day</a>, an opportunity to raise awareness of the mental health challenges that can impact all of us. We all know someone who struggles with their mental health, or is struggling themselves. Whether it’s you personally, a family member, or a friend, we are working to get everyone the access to the mental health care they need, when they need it.</p>\n\n<p>“Mental health is health. Over the past couple of years, Canadians have experienced rising levels of depression and anxiety. That’s why we launched the <a href=\"https://wellnesstogether.ca/en-CA\">Wellness Together Canada</a> portal and the <a href=\"https://www.wellnesstogether.ca/en-CA/pocketwell\">PocketWell</a> app to provide free on-demand access to direct counselling, live community support, and a large network of other mental health resources. From coast to coast to coast, we are investing in projects that deliver mental health supports to those who need it most, while we work with the provinces and territories to improve mental health care by developing national standards.</p>\n\n<p>“This year’s theme for World Mental Health Day is ‘Make mental health &amp; well-being for all a global priority.’ We are working with our global partners to make mental health care a reality around the world. This includes supporting experienced humanitarian partners worldwide in providing life-saving immediate assistance, such as psychosocial support in emergency settings and helping address the mental health needs of people in low- and middle-income countries, in particular young people.</p>\n\n<p>“Today, on behalf of the Government of Canada, I thank all those who provide invaluable services in support of mental health well-being, in Canada and around the world. Let’s continue to take good care of ourselves and one another when we need it most – because that’s what Canadians do. And let’s keep working together to end the stigma and improve mental health care for everyone.”</p></div>\n      "
}