{
  "path": "/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo",
  "pageTitle": "Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the Association of Southeast Asian Nations (ASEAN) Summit, hosted by Cambodia in Phnom Penh, where Canada was invited as a guest of the Chair.</p>\n\n<p>Convening under the theme of “Addressing Challenges Together,” the Prime Minister further strengthened Canada’s relationship as a reliable and engaged partner with ASEAN and expanded partnerships in the Indo-Pacific. His priorities included promoting regional peace and stability, expanding and diversifying trade to create good, middle-class jobs in Canada and Southeast Asia, strengthening economic resilience, and investing in and connecting our peoples, while building a clean future.</p>\n\n<p>During an ASEAN-Canada Commemorative Summit on November 12, which marked the 45th anniversary of ASEAN-Canada dialogue relations, Canada and ASEAN committed to establish a Canada-ASEAN Strategic Partnership. This new Strategic Partnership represents a strong endorsement of Canada’s engagement in the region and an important symbolic step to continue deepening our relations with ASEAN moving forward. The Prime Minister also announced an investment of $40 million to launch a new Indo-Pacific Engagement Initiative (IPEI), through which Canada will support the participation of Canadian civil society in the region and enhance Canadian engagement in the Indo-Pacific, including through new research and study opportunities for Canadians. At the Commemorative Summit, Canada and ASEAN released a <a data-entity-type=\"node\" data-entity-uuid=\"0677cf2d-536a-41b5-a327-e4711e60bf72\" href=\"/en/news/statements/2022/11/13/asean-canada-45th-anniversary-commemorative-summit-joint-statement\">joint statement</a> highlighting their strong bilateral relationship and priorities for future bilateral cooperation.</p>\n\n<p>Ahead of the release of Canada’s Indo-Pacific Strategy, the Prime Minister announced initiatives to strengthen Canada’s trade and investment relationship in the region:</p>\n\n<ul>\n\t<li>$24.5&nbsp;million for a new office of the Asia-Pacific Foundation of Canada in the region, to help build and strengthen relations with local partners, including in the areas of foreign policy, cultural diplomacy, and academic ties;</li>\n\t<li>$24.1&nbsp;million to establish the Canadian Trade Gateway in Southeast Asia, an enhanced Canadian hub that will help expand Canada’s business and investment networks by linking businesses to existing incubators and accelerators – thereby strengthening the economy and creating jobs on both sides of the Pacific; and</li>\n\t<li>A $13.1&nbsp;million contribution to the ASEAN-Canada Plan of Action Trust Fund to help close development gaps, ensure strong regional engagement with ASEAN, and advance negotiations toward a Canada-ASEAN Free Trade Agreement.</li>\n</ul>\n\n<p>At the Summit, the Prime Minister also announced an investment of $14.2 million to expand the successful Canada-ASEAN Scholarships and Educational Exchanges for Development (SEED) program. The enhanced program, which is expected to award over 800 new scholarships, will reach developing Indo-Pacific countries, encourage valuable exchanges and skills sharing, and introduce more education and research in shared areas of interest.</p>\n\n<p>At a Women, Peace, and Security (WPS) roundtable with government and development partners as well as civil society organizations with ties to Canada, the Prime Minister announced:</p>\n\n<ul>\n\t<li>$32.8&nbsp;million for a call for proposals to support civil society organizations that have expertise in delivering development assistance in the Indo-Pacific with the goal to promote gender equality and inclusion, in particular for those most at risk of being left behind; and</li>\n</ul>\n\n<ul>\n\t<li>A new series of Women, Peace, and Security (WPS) dialogues with ASEAN in 2023 to provide a platform for discussions on the implementation of the WPS agenda in ASEAN and meaningfully engage women on an inclusive and sustainable approach to peace.</li>\n</ul>\n\n<p>To promote sustainable development in the region, the Prime Minister announced the following initiatives:</p>\n\n<ul>\n\t<li>$100 million in Feminist International Assistance Policy development funding to support development initiatives in the Indo-Pacific; and</li>\n\t<li>$85,000 for Canada to host a Canada–Indo-Pacific symposium on post-pandemic border and migration management where we will reinforce partnerships and share Canadian knowledge and expertise with ASEAN Member States, including to support economic recovery and post-pandemic growth, improve border management and fight transnational crime, and protect gender rights and vulnerable populations.</li>\n</ul>\n\n<p>With a particular focus on supporting demining initiatives in ASEAN Members States, the Prime Minister announced:</p>\n\n<ul>\n\t<li>$750,000 to help build Laos’ demining capacity by establishing comprehensive standards for landmine clearance and supporting the recruitment, training, and supervision of personnel to ensure the safety of demining activities in Laos;</li>\n\t<li>$190,000 to accelerate mine-clearing in Cambodia and reduce risks from landmines, including by delivering training so women can safely participate in demining activities and by leveraging Canadian expertise for faster, more effective mine clearing; and</li>\n\t<li>$50,000 to support a training project that will build on longstanding Canadian assistance to Cambodia in the field of demining to help protect demining personnel and clear landmines in the country.</li>\n</ul>\n\n<p>With a focus on building a sustainable and green future for everyone, the Prime Minister also announced $84.3 million for the new Shared Ocean Fund, which will reinforce a healthy marine environment in the Indo-Pacific region and support measures against illegal, unreported, and unregulated fishing.</p>\n\n<p>While at the ASEAN Summit, Prime Minister Trudeau condemned Russia’s illegal and unjustifiable invasion of Ukraine, which has created significant threat to global peace and stability, food and energy security issues as well as challenges in global supply chains, and is a threat to the post-pandemic economic recovery.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and ASEAN have a long history of partnership. Canada stands with ASEAN as a steadfast partner, working together to secure an inclusive, strong, and people-centered future. I look forward to working with ASEAN and its Member States, as well as the greater Indo-Pacific region, to grow and diversify trade, create good, middle-class jobs, promote regional peace and security, and build closer ties between our peoples for a safer, cleaner world.”</p>\n\n<footer class=\"default\">&nbsp;The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the third time Prime Minister Trudeau has participated in an ASEAN Summit and is his first visit to Cambodia.</li>\n\t<li>ASEAN is a regional intergovernmental organization comprising 10 Member States. Established by Indonesia, Malaysia, the Philippines, Singapore, and Thailand in 1967, it was later joined by Brunei, Cambodia, Laos, Myanmar, and Vietnam.</li>\n\t<li>Together, ASEAN Member States represent the fifth largest economy in the world (combined GDP of US$3 trillion). With 661 million people, ASEAN has the third largest population in the world.</li>\n\t<li>As a group, ASEAN Member State economies represent Canada’s fourth-largest trading partner. In 2021, Canada-ASEAN merchandise trade was valued at $31.5 billion.</li>\n\t<li>Canada has been an ASEAN Dialogue Partner since 1977.</li>\n\t<li>In 2021, Canada launched negotiations toward a Free Trade Agreement (FTA) with ASEAN. The ASEAN-Canada FTA would be the foundation for a more strategic ASEAN-Canada relationship that drives economic growth, innovation, and job creation on both sides of the Pacific.</li>\n\t<li>Since 2001, Canada has provided $4.4 billion in development assistance to ASEAN and to its Member States.</li>\n\t<li>Indonesia will assume the ASEAN Chairmanship for 2023.</li>\n\t<li>In Cambodia, the Prime Minister also toured the Tuol Sleng prison, where he paid his respects to the victims of the Cambodian genocide, expressed Canada’s ongoing support for peace and democracy in Cambodia, and reinforced the message that crimes against humanity, war crimes, and genocide should never be repeated. He expressed Canada’s support for Cambodia’s work in education, memorialization, and intergenerational dialogue on the Cambodian genocide.</li>\n\t<li>The Minister of Foreign Affairs, Mélanie Joly, and the Minister of International Trade, Export Promotion, Small Business and Economic Development, Mary Ng, accompanied the Prime Minister at the Summit.</li>\n\t<li>At the Summit, the Prime Minister held bilateral meetings with:\n\t<ul>\n\t\t<li>The Prime Minister of Cambodia, Hun Sen</li>\n\t\t<li>The Prime Minister of Vietnam, Pham Minh Chinh</li>\n\t\t<li>The Secretary-General of ASEAN, Dato Lim Jock Hoi</li>\n\t\t<li>The President of the Philippines, Ferdinand Marcos Jr.</li>\n\t</ul>\n\t</li>\n\t<li>Canada and Cambodia have a history of political, economic, development, and regional security collaboration and look forward to further strengthening their commercial relationship. Canada is one of Cambodia’s top export destinations.</li>\n\t<li>Canada and Cambodia will celebrate 70 years of diplomatic relations in 2023.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/11/13/strengthening-canadas-ties-asean-and-expanding-partnerships-indo\" tabindex=\"-1\" target=\"_blank\" title=\"https://pm.gc.ca/en/news/backgrounders/2022/11/13/strengthening-canadas-ties-asean-and-expanding-partnerships-indo\">Backgrounder: Strengthening Canada’s ties with ASEAN and expanding partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"/en/news/statements/2022/11/13/asean-canada-45th-anniversary-commemorative-summit-joint-statement\">ASEAN-Canada 45th Anniversary Commemorative Summit Joint Statement</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/12/prime-minister-justin-trudeau-meets-prime-minister-cambodia-hun-sen\">Prime Minister Justin Trudeau meets with Prime Minister of Cambodia Hun Sen</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/12/prime-minister-justin-trudeau-meets-prime-minister-vietnam-pham-minh-chinh\">Prime Minister Justin Trudeau meets with Prime Minister of Vietnam Pham Minh Chinh</a></li>\n\t<li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/cambodia-cambodge/relations.aspx?lang=eng\">Canada-Cambodia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}