{
  "path": "/en/news/statements/2016/03/10/statement-prime-minister-canada-bilateral-meeting-president-obama",
  "pageTitle": "Statement by the Prime Minister of Canada on the bilateral meeting with President Obama | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after a bilateral meeting with U.S. President Barack Obama:</p>\n<p>“Today, President Obama and I had a very productive meeting that will help our countries transition to low-carbon economies, foster clean growth, and create good jobs and great opportunities for our citizens.</p>\n<p>“The President and I agreed to formally join the Paris Agreement in the global fight against climate change, and to take ambitious actions to reduce methane, hydroflurocarbon, and greenhouse gas emissions.</p>\n<p>“We announced a new partnership to build a sustainable Arctic economy, and we will work together to develop new, science-based standards for commercial fishing, low-impact shipping, sustainable development, and Arctic biodiversity.</p>\n<p>“We also committed to make our borders more open and more secure, and we agreed in principle to expand preclearance to Billy Bishop Airport in Toronto, Jean Lesage International Airport in Quebec City, as well as rail service in Montreal and Vancouver.</p>\n<p>“The President and I reaffirmed our commitment to streamline trade between our countries. Each day, $2.4 billion worth of goods and services cross the border. We agreed to work in collaboration to bring trade and investment to new heights.</p>\n<p>“Finally, we agreed that Canada will host the North American Leaders Summit in the Summer of 2016. President Obama will address Parliament during his visit to Canada for the summit.</p>\n<p>“Canada and the United States share the same values, the same origins, and the same space. We face many of the same challenges, and we are all better off when we tackle them together.”&nbsp;&nbsp;</p></div>\n      "
}