{
  "path": "/en/news/statements/2018/05/24/statement-prime-minister-100th-anniversary-women-winning-right-vote",
  "pageTitle": "Statement by the Prime Minister on the 100th anniversary of women winning the right to vote in federal elections | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 100th anniversary of women winning the right to vote in federal elections:</p><p>“One hundred years ago, women in Canada gained the right to vote in federal elections for the first time. Today, we recognize the countless women who have transformed politics in Canada and shaped a better country for all of us.</p><p>“This decision was a turning point for gender equality and a victory for Canadian democracy. When more voices are heard, we shape laws that reflect who we are and decisions that improve the lives of Canadians. Social activists and feminists worked hard to win the right to vote. Our democracy is stronger because of their commitment to their convictions, and their vision for a more just future.</p><p>“While this anniversary represents an important milestone in the quest for equal rights in Canada, not all women benefitted from this progress. Indigenous women, Asian women, and others were denied the right to vote. These exclusions remind us that progress does not always happen equally, and we must do more to make sure everyone’s rights are respected, promoted, and valued.</p><p>“Canada continues to work hard to address the obstacles women and girls face. Here at home, we are taking steps to promote women’s participation in the workforce, support women’s leadership, reduce the gender wage gap, and fight gender-based violence. In 2018, Canada put gender equality at the core of the federal budget, and made empowering women and girls a key theme for our G7 presidency. Thanks to measures like our Feminist International Assistance Policy, we are working to empower women and girls and advance gender equality around the world.</p><p>“The 100th anniversary of women winning the right to vote in federal elections reminds us that we are stronger when everyone, no matter their gender identity, can participate freely, fully, and equally in our democracy. A century later, women’s leadership continues to push Canada forward. Today, let’s celebrate the achievements of the many women who have shaped our country. Let’s honour their legacy, push for justice and equality, and make sure all voices can be heard.”</p></div>\n      "
}