{
  "path": "/en/news/statements/2021/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p>\n\n<p>“Every day, women and girls strengthen our communities, our country, and our world. They drive our economy as business leaders, help advance our knowledge in all fields, and create opportunity and security as heads of state and government.</p>\n\n<p>“Today, on International Women’s Day, we celebrate the achievements of women in all their diversity, here in Canada and around the world, and we honour those who have challenged norms, lifted up others, and created lasting and substantial change. We also reaffirm our commitment to gender equality, so that all women and girls can contribute to their full potential, and we can build a better, safer, and more inclusive world. &nbsp;</p>\n\n<p>“This year’s theme, <a href=\"https://cfc-swc.gc.ca/commemoration/iwd-jif/index-en.html\">#FeministRecovery</a>, reminds us that women and girls have been disproportionately affected by the consequences of the global COVID-19 pandemic. This crisis has created a she-cession and has threatened to roll back the hard-fought social and economic progress of all women. And for some women, the impacts of the pandemic have been far more challenging. This is especially true for many marginalized groups, including Indigenous, Black and racialized women as well as women living with disabilities, and those who are members of LGBTQ2 communities. To build a fairer and more equal Canada, we must ensure a feminist, intersectional recovery from this crisis.</p>\n\n<p>“Since the beginning of the pandemic, the closure of schools and child care services has resulted in many parents having to reduce their hours of work or leave their jobs to look after their families. These impacts have been felt disproportionately by mothers, but our country, and our economy, cannot succeed if half of the country is held back. That is why we are committed to making a significant, sustained, and long-term investment to create a Canada-wide early learning and child care system. Access to affordable, quality child care will give our children a good start in life, help Canadians find and keep good jobs, and create a more resilient country and economy.</p>\n\n<p>“To build back better, we know that our economic recovery must benefit everyone, including women. That is why we have established a Task Force on Women in the Economy to advise the government on a feminist, intersectional action plan to address issues of gender equality in the wake of the pandemic. The Government of Canada has also created the Feminist Response and Recovery Fund. Through this initiative, we will provide funding to organizations that are working to create economic opportunity for women and girls, improving their access to leadership and decision-making positions, and ending gender-based violence. Women’s organizations across the country have done a lot to help women and children during this challenging time, and we will continue to support their important work. Together, these measures will help build a stronger economy and advance gender equality in Canada.</p>\n\n<p>“The pandemic has also had a significant impact on women and girls beyond our borders. That is why the Government of Canada will continue to provide support through its <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>. We will also support initiatives that promote gender equality and the empowerment of women and girls. By ensuring that the rights of women and girls are respected and fulfilled, we will continue to help create a world where no one is left behind.</p>\n\n<p>“This year, women have helped lead our response to the global COVID-19 pandemic and have fought on the front lines of this crisis. They have put their health, and that of their loved ones, at risk to protect our community and country, and as we begin to build back better for everyone, we must defend the rights of women and girls and ensure everyone has the chance to reach their full potential.</p>\n\n<p>“We all have a role to play – as partners and allies – in achieving gender equality, and building a world where women and girls can do anything and be anything. Only by working together will we make gender equality a reality here in Canada and around the world.”</p></div>\n      "
}