{
  "path": "/en/news/news-releases/2022/03/24/prime-minister-congratulates-joe-friday-his-reappointment-public",
  "pageTitle": "Prime Minister congratulates Joe Friday on his reappointment as Public Sector Integrity Commissioner of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today congratulated Joe Friday on his reappointment as Public Sector Integrity Commissioner of Canada for a term of 18&nbsp;months.</p>\n\n<p>With jurisdiction over most federal public sector organizations, including the Royal Canadian Mounted Police and Crown corporations, the Public Sector Integrity Commissioner of Canada works to strengthen accountability and oversight of government operations. This includes investigating wrongdoing in the federal public sector and helping protect whistleblowers and those who participate in investigations from reprisal. The Commissioner reports directly to Parliament. The Office of the Public Sector Integrity Commissioner of Canada is an independent federal organization that was created in 2007 under the&nbsp;<a href=\"https://laws-lois.justice.gc.ca/eng/acts/P-31.9/\" target=\"_blank\"><em>Public Servants Disclosure Protection Act</em></a>.</p>\n\n<p>Mr. Friday was first appointed to this role in 2015. Working in the federal public service since 1992, he joined the Office of the Public Sector Integrity Commissioner of Canada in 2008 as General Counsel and was Deputy Commissioner from 2011 until his appointment as Commissioner.</p>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/03/24/joe-friday\">Joe Friday</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/21/prime-minister-announces-nomination-joe-friday-reappointment-public\">Prime Minister announces nomination of Joe Friday for reappointment as Public Sector Integrity Commissioner of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/topics/appointments/governor-council.html\">Governor in Council appointments</a></li>\n\t<li><a href=\"https://psic-ispc.gc.ca/en/meet-joe-friday\">Meet Joe Friday</a></li>\n\t<li><a href=\"https://www.psic-ispc.gc.ca/en\">Office of the Public Sector Integrity Commissioner of Canada</a></li>\n</ul></div>\n      "
}