{
  "path": "/en/news/statements/2022/05/02/statement-prime-minister-mental-health-week",
  "pageTitle": "Statement by the Prime Minister on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p>\n\n<p>“Today, we mark the beginning of <a href=\"https://mentalhealthweek.ca/\">Mental Health Week</a>. This week is a time for Canadians to come together to speak openly about mental health, listen with empathy to the stories of others, and support those who are struggling.</p>\n\n<p>“Mental health challenges affect many of us, yet these issues are often treated differently than physical health. No one should ever suffer in silence, and by being open with others, we can help break down the stigma surrounding mental health and ensure people seek the care they need.</p>\n\n<p>“The past two years have been difficult for everyone. The Government of Canada is working hard to ensure every Canadian can receive the mental health supports they need, no matter where they live – through the pandemic and beyond.</p>\n\n<p>“In order to improve mental health services for Canadians, we are developing national mental health and substance use standards in collaboration with stakeholders and partners. We have announced our commitment to a permanent, ongoing Canada Mental Health Transfer to help expand the delivery of high-quality, accessible, and free mental health services and intend to engage with provinces and territories in the short-term to meet this commitment.</p>\n\n<p>“As we reflect on the importance of taking care of our mental health, let’s continue to support our loved ones and reach out for help when we need it. If you are struggling, or know someone who is, the <a href=\"https://www.wellnesstogether.ca/en-ca/\" target=\"_blank\" title=\"https://www.wellnesstogether.ca/en-ca/\">Wellness Together Canada</a> portal provides 24-hour, free, and confidential mental health and substance use tools and resources in English and French. You can also access new resources, including a self-assessment tool and tracker that monitors mood and mental well-being through the PocketWell app.&nbsp;PocketWell connects seamlessly to the Wellness Together Canada portal, allowing access to free and confidential sessions with social workers, psychologists and other professionals.</p>\n\n<p>“This week, I invite everyone to join the conversation and use the hashtags #GetReal and #MentalHealthWeek on social media platforms. Together, we will end the stigma that surrounds mental health issues, and build a better future for everyone.”</p>\n\n<p><em>If you or someone you know is thinking about suicide, call the Canada Suicide Prevention Service at 1-833-456-4566. Additional resources can also be accessed through the&nbsp;</em><a href=\"https://www.wellnesstogether.ca/en-CA\"><em>Wellness Together Canada</em></a><em> portal.</em></p></div>\n      "
}