{
  "path": "/en/news/readouts/2022/02/26/prime-minister-justin-trudeau-speaks-prime-minister-romania-nicola-ciuca",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Romania Nicola Ciucă | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Romania, Nicola Ciucă.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Ciucă strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. Prime Minister Trudeau praised Romania’s&nbsp;generous efforts&nbsp;in welcoming over 25,000 Ukrainians over the last two days, mainly women and children, fleeing war in Ukraine. The prime ministers also praised the heroism of Ukrainian resistance to the Russian invasion and agreed that these acts of resistance have inspired NATO allies and&nbsp;citizens of&nbsp;democracies&nbsp;around the world.</p>\n\n<p>Prime Minister Ciucă welcomed Canada’s announcement to deploy&nbsp;up to an additional 460 military personnel to Latvia and elsewhere in Eastern Europe, in support of NATO. Prime Minister Trudeau expressed support for France’s announcement to act as the framework nation for a NATO battle group in Romania.&nbsp;Prime Minister Trudeau and Prime Minister Ciucă also&nbsp;agreed that this&nbsp;will be an important&nbsp;step for&nbsp;the&nbsp;reinforcement of NATO’s eastern flank and for wider&nbsp;European security.</p>\n\n<p>The prime ministers stressed that Russia’s actions are blatant violations of international law, and will not be tolerated. The two leaders committed to continue their&nbsp;efforts in close coordination with allies and partners&nbsp;in support of Ukraine.&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/25/statement-nato-heads-state-and-government-russias-attack-ukraine\">Statement by NATO Heads of State and Government on Russia’s Attack on Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/romania-roumanie/bilateral_relations_bilaterales/canada_romania-roumanie.aspx?lang=eng\">Canada-Romania Relations</a></li>\n</ul></div>\n      "
}