{
  "path": "/en/news/readouts/2021/06/14/prime-minister-justin-trudeau-meets-prime-minister-pedro-sanchez-spain",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Pedro Sánchez of Spain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the Prime Minister of Spain, Pedro Sánchez, on the margins of the NATO Summit in Brussels, Belgium.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez discussed the global impacts of the COVID-19 pandemic. Prime Minister Trudeau expressed Canada’s gratitude for Spain’s ongoing support for exporting vaccines to Canada. The two leaders also spoke about the strength of transatlantic relations and their collaboration within NATO.</p>\n\n<p>The prime ministers discussed how to promote a strong and inclusive economic recovery that leaves no one behind, including by ensuring that families have access to child care and that the most vulnerable are protected.&nbsp;They also spoke about the opportunities that the digital transformation is creating for societies around the world and the global economy.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez exchanged views on migration issues in Latin America.&nbsp;They agreed to continue to work together to promote a long-term, comprehensive vision of migration and displacement and encourage a positive and humane approach to address its challenges.</p>\n\n<p>The Prime Ministers reaffirmed the strong friendship between Canada and Spain, built on shared values and deep people-to-people ties. They looked forward to continuing to work together on common global interests, emphasizing a shared commitment to effective multilateral action to advance key priorities, such as equitable access to vaccines.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada-Spain Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new\">Prime Minister announces additional support for equitable access to new COVID-19 medical solutions</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2018/09/23/joint-declaration-canada-spain-cooperation-agenda\">Canada-Spain Cooperation Agenda</a></li>\n</ul></div>\n      "
}