{
  "path": "/en/news/readouts/2022/01/27/prime-minister-justin-trudeau-speaks-prime-minister-latvia-krisjanis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Latvia Krišjānis Kariņš | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Latvia, Krišjānis Kariņš.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Kariņš shared their concerns about Russia’s aggressive and destabilizing actions in and around Ukraine, and underlined the need for Russia to engage constructively in diplomacy. Prime Minister Trudeau stated that the strength of the NATO Alliance was its unity and emphasized the importance of continued coordination and dialogue between allies and partners. Prime Minister Kariņš welcomed Canada’s renewal and expansion of Operation UNIFIER, Canada’s military training mission in Ukraine, and stated that this strengthened contribution would continue to help meet the needs of Ukraine’s security forces. The two leaders expressed hope that a diplomatic solution with Russia was possible, but emphasized that any further military incursion into Ukraine would have severe costs and serious consequences, including through coordinated sanctions.</p>\n\n<p>Prime Minister Kariņš thanked Prime Minister Trudeau for Canada’s leadership of the multinational NATO enhanced Forward Presence Battle Group in Latvia, to which Canada contributes approximately 540 Canadian Armed Forces members as part of Operation REASSURANCE.</p>\n\n<p>The prime ministers looked forward to pursing their strong relationship rooted in the shared values of human rights, democracy, and the rules-based international system. They also agreed to work together to pursue Canada and Latvia’s security interests and to grow the economic partnership between the two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/01/canada-extends-and-expands-military-and-other-support-for-the-security-of-ukraine.html\">Canada extends and expands military and other support for the security of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/government-of-canada-announces-loan-of-up-to-120-million-to-support-ukraines-economic-resilience-and-development.html\">Government of Canada announces loan of up to $120 million to support Ukraine’s economic resilience and development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/18/prime-minister-justin-trudeau-speaks-ministers-situation-ukraine\">Prime Minister Justin Trudeau speaks with ministers on the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n</ul></div>\n      "
}