{
  "path": "/en/news/news-releases/2019/01/23/prime-minister-announces-funding-la-loche-high-school",
  "pageTitle": "Prime Minister announces funding for La Loche high school | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Greater opportunities, brighter futures, a better quality of life – nothing is more important than giving our kids the best possible education. Every child in Canada, no matter where they live, has the right to a quality education, and to receive that education in a safe and secure environment.</p><p>The Prime Minister, Justin Trudeau, today announced funding for Dene High School in La Loche, Saskatchewan, to support cultural and language-based programs, on-the-land activities, and mental health services for students.</p><p>The funding follows through on recommendations from the community, and supports the Holistic Healing Plan that Dene High School developed after the tragic shootings of 2016. It also builds on work that the Government of Canada is already doing in La Loche, including funding mental health services, and supporting high-risk youth and their families.</p><p>The Government of Canada will continue to advance initiatives that bring change and hope to La Loche and Clearwater River Dene Nation, and Indigenous communities throughout northwestern Saskatchewan and across Canada.</p><h2>Quote</h2><blockquote><p>“That dark day in 2016 will never be forgotten, but it isn’t what defines La Loche. People here have shown strength, resilience, and determination to move forward. This funding is about supporting the community on its journey of healing, empowering young people, and building a better future for everyone who calls La Loche home.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada is providing over $2.2 million in funding over five years through an agreement with the Northern Lights School Division.</li><li>The Dene High School’s Holistic Healing Plan includes health, nutrition, and fitness services, and upgrades to facilities. The Plan will also provide new programming to improve the student experience and incorporate Indigenous language and cultural programming into school activities.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/news/statements/2019/01/22/statement-prime-minister-third-anniversary-shootings-la-loche\">Statement by the Prime Minister on the third anniversary of the shootings in La Loche, Saskatchewan</a></li></ul></div>\n      "
}