{
  "path": "/en/news/readouts/2021/11/29/prime-minister-justin-trudeau-speaks-nunavut-premier-pj-akeeagok",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Nunavut Premier P.J. Akeeagok | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Nunavut Premier P.J. Akeeagok to congratulate him on his election and selection as the new premier, and to discuss key areas for cooperation.</p>\n\n<p>Premier Akeeagok conveyed his pride in the Governor General’s delivery of parts of the recent Speech from the Throne in Inuktitut, as well as key commitments that it outlined, such as advancing reconciliation.</p>\n\n<p>The Prime Minister and Premier discussed the importance of working together to improve access to high-quality, affordable, flexible, and inclusive early learning and child care for families in Nunavut. They also underlined the need to recognize the unique challenges in the North to make progress on this shared priority.</p>\n\n<p>The two leaders discussed other shared priorities of importance to Nunavummiut, which include addressing housing, infrastructure, and mental health needs across the territory. They further committed to close collaboration in the short term, to identify ways to ensure both governments make concrete and lasting progress on these priorities.</p>\n\n<p>The Prime Minister and Premier looked forward to the opportunity to collaborate closely.&nbsp;&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/11/17/statement-prime-minister-selection-new-premier-nunavut\">Statement by the Prime Minister on the selection of the new premier of Nunavut</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/11/23/statement-prime-minister-speech-throne\">Statement by the Prime Minister on the Speech from the Throne</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/11/23/tusagaksaq-kanataup-sivuliuqtirjuanganit-gavamakkut-tukimuagutiksangit\">ᑐᓴᒐᒃᓴᖅ ᑲᓇᑕᐅᑉ ᓯᕗᓕᐅᖅᑎᕐᔪᐊᖓᓂᑦ ᒐᕙᒪᒃᑯᑦ ᑐᑭᒧᐊᒍᑎᒃᓴᖏᑦ</a> (Statement by the Prime Minister on the Speech from the Throne in Inuktitut)</li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2021/08/targeted-infrastructure-investments-planned-for-inuit-nunangat.html\">Targeted infrastructure investments planned for Inuit Nunangat</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/elcc-nr-nunavut.html\">The Government of Canada and the Government of Nunavut announce extension of support for quality early learning and child care across the territory</a></li>\n</ul></div>\n      "
}