{
  "path": "/en/news/statements/2020/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on &nbsp;</p>\n\n<p>Canadian Multiculturalism Day:</p>\n\n<p>“Today on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/multiculturalism-day.html\">Canadian Multiculturalism Day</a>, I join Canadians across the country to celebrate our diversity and reaffirm our commitment to equity, inclusion, and mutual respect.</p>\n\n<p>“Canadian Multiculturalism Day is an opportunity to recognize the important contributions that Canadians from different backgrounds have made – and continue to make – to build and shape a stronger, more diverse, and inclusive society.</p>\n\n<p>“Multiculturalism is one of Canada’s greatest strengths and a vital component of our national fabric. All Canadians – regardless of ethnicity, religion, culture, or language – have the right to be true to who they are, and to live peacefully as friends, neighbours, and colleagues.</p>\n\n<p>“While we have much to celebrate, we also recognize that we still have a lot of work to do to make this country fairer and more equal for everyone. Far too many racialized Canadians, including Indigenous peoples, Black Canadians, and Asian Canadians, face systemic racism and discrimination as a lived reality every single day. This includes micro-aggressions, which are harder to see by those who do not experience them, and systemic racism within our institutions, which too often condone, normalize, and perpetuate inequity and injustice against racialized Canadians.</p>\n\n<p>“In the face of the pandemic, we’ve seen Canadians, from all backgrounds and walks of life, help their neighbours and support each other. But even during a time where we have come together, these last few weeks have highlighted that there’s more work to do as a country – especially when it comes to issues of discrimination and systemic racism.</p>\n\n<p>“People across Canada and around the world have raised their voices and asked that we address the systemic racism that exists in our countries and in our institutions. We, the Government of Canada, need to work with racialized Canadians and Indigenous peoples in a meaningful way to end it. It does exist. It needs to stop. Racism and discrimination have no place in our society.&nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to take part in one of the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/multiculturalism-day/list-events.html\">virtual events</a> being held across the country and celebrate the diversity that makes us who we are. I also encourage you to talk with your neighbours, and take time to listen and learn from someone who has had a different life experience. By gaining a deeper understanding and appreciation of the differences that make us stronger, we can build a more inclusive society.”</p></div>\n      "
}