{
  "path": "/en/news/readouts/2021/07/28/prime-minister-justin-trudeau-meets-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with Prince Edward Island Premier Dennis King to discuss shared priorities.</p>\n\n<p>Prime Minister Trudeau and Premier King underscored the strong collaborative relationship between Canada and the province. They discussed the historic early learning and child care agreement between Canada and PEI announced yesterday, which will make life better and more affordable for families, help parents – especially women – advance their careers while raising families, and give every child a real and fair chance at success.</p>\n\n<p>The two leaders spoke about the development of Prince Edward Island’s clean technology sector, support for the province’s bioscience sector, and initiatives to protect the environment, stop biodiversity loss, and fight climate change. They agreed to continue working together to improve care for seniors in long-term facilities and advance pharmacare to make medication more accessible for Prince Edward Islanders – and all Canadians.</p>\n\n<p>The Prime Minister and the Premier also discussed the status of COVID-19 vaccinations in the province and across the country, and collaboration on recovery and growth. They noted the importance of supporting the tourism sector and investing to support businesses, create jobs, and grow the economy.</p>\n\n<p>Prime Minister Trudeau and Premier King agreed to stay in close contact to advance further shared priorities in the months ahead.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">$10 a day child care for families in Prince Edward Island</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Shipments and deliveries</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/07/the-government-of-canada-supporting-prince-edward-islands-tourism-sector.html\">The Government of Canada supporting Prince Edward Island’s tourism sector</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/07/15/prime-minister-justin-trudeau-holds-33rd-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 33rd call with premiers on COVID-19 response</a></li>\n</ul></div>\n      "
}