{
  "path": "/en/news/statements/2020/07/06/statement-prime-minister-seventh-anniversary-lac-megantic-tragedy",
  "pageTitle": "Statement by the Prime Minister on the seventh anniversary of the Lac-Mégantic tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the seventh anniversary of the Lac-Mégantic tragedy:</p>\n\n<p>“On July&nbsp;6, 2013, a runaway train carrying crude oil derailed and exploded in Lac‑Mégantic, Quebec. The accident killed 47 people, forced thousands more from their homes, and destroyed much of the downtown.</p>\n\n<p>“Today, I join the people of Lac-Mégantic and all Canadians to pay tribute to those who lost their lives in this tragedy – the deadliest railway accident in our country’s modern history.</p>\n\n<p>“On this solemn anniversary, we offer our deepest sympathies to the families and loved ones left behind, and our support to everyone still living with the pain and trauma from that tragic night. We also salute the courage and selflessness of the first responders, whose actions – and the support they offered to so many families in a time of great need – will never be forgotten.</p>\n\n<p>“Despite the challenges caused by the COVID-19 pandemic, we have made <a href=\"https://www.canada.ca/en/transport-canada/news/2020/06/government-of-canada-provides-an-update-on-the-most-recent-developments-and-progress-concerning-the-lac-megantic-bypass.html\">progress on the Lac-Mégantic rail bypass</a> project in recent months, and our government is still committed to its successful completion. We will continue to work closely with the surrounding communities and other partners to ensure the well-being of residents.</p>\n\n<p>“On behalf of the Government of Canada, I encourage Canadians to take a moment today to remember all those whose lives were tragically lost or changed forever that night. The safety of our railways and our communities is a top priority. We will continue to collaborate with the provinces, territories and other partners to ensure such a tragedy never happens in Canada again.”</p></div>\n      "
}