{
  "path": "/en/news/news-releases/2022/03/22/delivering-canadians-now",
  "pageTitle": "Delivering for Canadians Now | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, announced an agreement reached by the Liberal Party of Canada and the New Democratic Party in Parliament,&nbsp;<em>Delivering for Canadians Now, A Supply and Confidence Agreement</em>.</p>\n\n<p>Canadians are working hard to overcome the challenges of the global pandemic and now face a world made less secure because of Russia’s criminal war in Ukraine. Despite the challenges, Canadians are determined to build a better, more prosperous future. Voters have given this Parliament a clear mandate and do not want to endure needless delays in this important moment. They want to build a growing economy that supports their families with green jobs and climate action, more housing and child-care affordability, and stronger healthcare. Politics is supposed to be adversarial, but no one benefits when increasing polarization and parliamentary dysfunction stand in the way of delivering these results for Canadians.</p>\n\n<p>In these highly uncertain and difficult times, Canadians expect us to come together and get to work to help make their lives better. The Liberal Party of Canada and Canada’s New Democratic Party have agreed to improve the way we approach politics over the next three years for the benefit of Canadians. The parties have identified key policy areas where there is a desire for a similar medium-term outcome. We have agreed to work together during the course of this Parliament to put the needs of Canadians first. This work will be focused on growing our economy by creating green jobs that fight the climate crisis, making people’s lives more affordable with housing and childcare, and expanding and protecting our healthcare. As the basis for this work, it is fundamental for the parties to advance reconciliation with Indigenous peoples. Both parties hope that by approaching this Parliament more collaboratively, we will be able to deliver on these shared policy objectives before the next election.</p>\n\n<p>Both parties believe strongly in Parliament’s role to hold the government to account. Nothing in this agreement will undermine that critical function. The parties will not always agree. The government will pursue elements of its agenda that the NDP may oppose and nothing in this agreement prevents either party from doing that. Both parties will continue to seek to work with other parties in Parliament on the priorities that are the subject of this agreement and for other objectives. This agreement is not about compromising either party’s core beliefs or denying their differences. It is about ensuring those differences do not stand in the way of delivering on shared goals for the benefit of each and every Canadian.</p>\n\n<p><strong><em>Therefore, the parties agree to Delivering for Canadians Now: A Supply and Confidence Agreement from March 22, 2022 until when Parliament rises in June of 2025, in order to achieve the following:</em></strong></p>\n\n<p class=\"Indent1\"><strong>A Parliament that works for Canadians</strong></p>\n\n<p class=\"Indent1\">The arrangement lasts until Parliament rises in June 2025, allowing four budgets to be presented by the government during this time. To ensure coordination on this arrangement, both Parties commit to a guiding principle of “no surprises”.</p>\n\n<p class=\"Indent1\">The agreement will mean that the NDP agrees to support the government on confidence and budgetary matters – notably on budgetary policy, budget implementation bills, estimates and supply – and that the Liberal Party commits to govern for the duration of the agreement. The NDP would not move a vote of non-confidence, nor vote for a non-confidence motion during the term of the arrangement. Other votes which impede the government from functioning may be declared confidence by the government, in which case the government will commit to informing the NDP as soon as possible if a vote will be declared confidence, and the NDP will inform the government of their vote intentions before declaring publicly to permit discussions around confidence to take place.</p>\n\n<p class=\"Indent1\">Regarding committees, both parties agree to the importance of parliamentary scrutiny and the work done by Members of Parliament at committees. To ensure committees are able to continue their essential work, both parties agree to communicate regarding any issues which could impede the government’s ability to function or cause unnecessary obstructions to legislation review, studies and work plans at committees.</p>\n\n<p class=\"Indent1\">Both parties agree to the minimum standing meetings:</p>\n\n<ul class=\"Indent1\">\n\t<li>Leaders meeting at least once per quarter</li>\n\t<li>Regular House Leader meetings</li>\n\t<li>Regular Whip meetings</li>\n\t<li>Monthly stock-take meetings by an oversight group</li>\n</ul>\n\n<p class=\"Indent1\">The oversight group will consist of a small group of staff and politicians. This group will discuss overall progress on key commitments and upcoming issues.</p>\n\n<p class=\"Indent1\">In addition to briefings provided by the public service and ministers on policy matters related to the arrangement, including the budget and legislation, the government will ensure public servants remain available to brief the NDP on other matters. Briefings should be done in a timely fashion to allow for constructive feedback and discussion.</p>\n\n<p class=\"Indent1\">Both parties agree that parliamentary debate is essential. Both parties agree to identify priority bills to expedite through the House of Commons, including by extending sitting hours to allow for additional speakers, if needed. The NDP will support a limited number of programming motions to pass legislation that both parties agree to.</p>\n\n<p class=\"Indent1\">The agreement will serve to ensure Parliament continues to function in the interest of Canadians.</p>\n\n<p><strong><em>The Parties agree to prioritize the following actions, while continuing to work on other possible shared priorities through the oversight group.</em></strong></p>\n\n<p><strong>1. A better healthcare system</strong></p>\n\n<ul>\n\t<li>Launching a new dental care program for low-income Canadians. Would start with under 12-year-olds in 2022, then expand to under 18-year-olds, seniors and persons living with a disability in 2023, then full implementation by 2025. Program would be restricted to families with an income of less than $90,000 annually, with no co-pays for anyone under $70,000 annually in income.</li>\n\t<li>Continuing progress towards a universal national pharmacare program by passing a Canada Pharmacare Act by the end of 2023 and then tasking the National Drug Agency to develop a national formulary of essential medicines and bulk purchasing plan by the end of the agreement.&nbsp;</li>\n\t<li>Recognizing that health systems have been stretched because of COVID, the parties realize that additional ongoing investments will be needed in the immediate future to address these pressures. We will work with the provinces and territories to determine how together we can deliver better health outcomes for Canadians, including more primary care doctors and nurses, mental health support, aging at home, and better data.</li>\n\t<li>Tabling a Safe Long-Term Care Act to ensure that seniors are guaranteed the care they deserve, no matter where they live.</li>\n</ul>\n\n<p><strong>2. Making life more affordable for people </strong></p>\n\n<ul>\n\t<li>Extending the Rapid Housing Initiative for an additional year.</li>\n\t<li>Re-focusing the Rental Construction Financing Initiative on affordable units (under 80% AMR) and use 80% AMR or below as definition of affordable housing.</li>\n\t<li>Moving forward on launching a Housing Accelerator Fund.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</li>\n\t<li>Implementing a Homebuyer’s Bill of Rights and tackling the&nbsp;financialization of the housing market&nbsp;by the end of 2023.&nbsp;&nbsp;</li>\n\t<li>Including a $500 one-time top-up to Canada Housing Benefit in 2022 which would be renewed in coming years if cost of living challenges remain.</li>\n\t<li>Through introducing an Early Learning and Child Care Act by the end of 2022, ensuring that childcare agreements have long-term protected funding that prioritizes non-profit and public spaces, to deliver high quality, affordable child care opportunities for families.</li>\n</ul>\n\n<p><strong>3. Tackling the climate crisis and creating good paying jobs</strong></p>\n\n<ul>\n\t<li>Advancing measures to achieve significant emissions reductions by 2030 compared to 2005 levels. Continuing to identify ways to further accelerate the trajectory to achieve net-zero emissions no later than 2050.</li>\n\t<li>Moving forward in 2022 on the creation of the Clean Jobs Training Centre to support workers retention, redeployment and training.</li>\n\t<li>Moving forward with Just Transition legislation, guided by the feedback we receive from workers, unions, Indigenous peoples, communities, and provinces and territories.</li>\n\t<li>Developing a plan to phase-out public financing of the fossil fuel sector, including from Crown corporations, including early moves in 2022<em>.</em></li>\n\t<li>Moving forward in 2022 on home energy efficiency programs that both enhance energy affordability for Canadians and reduce emissions, with investments to support multiple streams including low-income and multi-unit residential apartments. We will also ensure that this funding includes support for creating Canadian supply chains for this work to ensure the jobs stay in Canada and that we create the skills to export these valuable energy efficiency products around the world.</li>\n</ul>\n\n<p><strong>4. A better deal for workers</strong></p>\n\n<ul>\n\t<li>Ensuring that the 10 days of paid sick leave&nbsp;for all federally regulated workers starts as soon as possible in 2022.</li>\n\t<li>Introducing legislation by the end of 2023 to prohibit the use of replacement workers, “scabs,” when a union employer in a federally regulated industry has locked out employees or is in a strike.</li>\n</ul>\n\n<p><strong>5. Reconciliation</strong></p>\n\n<ul>\n\t<li>Making a significant additional investment in Indigenous housing in 2022. It will be up to First Nations, Inuit and Métis communities to determine how housing investments are designed and delivered.</li>\n\t<li>Accelerating the implementation of the Federal Pathway to Address Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People with Indigenous partners.</li>\n\t<li>Creating a standing Federal-Provincial-Territorial table on Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People to facilitate and coordinate this work.</li>\n\t<li>Providing the necessary supports for First Nations, Inuit and Métis communities who wish to continue to undertake the work of burial searches at the former sites of residential schools.</li>\n</ul>\n\n<p><strong>6. A fairer tax system</strong></p>\n\n<ul>\n\t<li>Moving forward in the near term on tax changes on financial institutions who have made strong profits during the pandemic.</li>\n\t<li>Implementing a publicly accessible beneficial ownership registry by the end of 2023.</li>\n</ul>\n\n<p><strong>7. Making democracy work for people</strong></p>\n\n<ul>\n\t<li>Recognizing our shared commitment to maintaining the health of our democracy and the need to remove barriers to voting and participation, we will work with Elections Canada to explore ways to expand the ability for people to vote, such as:\n\t<ul>\n\t\t<li>An expanded “Election Day” of three days of voting.</li>\n\t\t<li>Allowing people to vote at any polling place within their Electoral District.</li>\n\t\t<li>Improving the process of mail-in ballots to ensure that voters who choose this method of voting are not disenfranchised.</li>\n\t\t<li>We commit to ensuring that Quebec’s number of seats in the House of Commons remains constant.</li>\n\t</ul>\n\t</li>\n</ul></div>\n      "
}