{
  "path": "/en/news/readouts/2021/02/23/prime-minister-justin-trudeau-speaks-prime-minister-israel-benjamin",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Israel Benjamin Netanyahu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Israel, Benjamin Netanyahu.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Netanyahu discussed the measures in place in Canada and Israel to limit the spread of the COVID-19 virus, save lives, and support people. They agreed on the vital role of safe and effective vaccines to protect people and end the pandemic around the world. The prime ministers committed to continuing to work with the international community to help respond to the pandemic and promote recovery.</p>\n\n<p>The two leaders also discussed the International Criminal Court’s decision regarding its jurisdiction over the West Bank and Gaza.&nbsp;Prime Minister Trudeau reaffirmed Canada’s support of the ICC and commitment to a two-state solution to the Israeli-Palestinian conflict. He reiterated that until such negotiations succeed, Canada’s longstanding position remains that it does not recognize a Palestinian state and therefore does not recognize its accession to international treaties, including the Rome Statute of the International Criminal Court.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Netanyahu reaffirmed their commitment to the long-standing friendship between Canada and Israel rooted in close people-to-people ties. They looked forward to the continued collaboration between the two countries on shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Israel Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/02/statement-by-minister-of-foreign-affairs-on-international-criminal-courts-decision-regarding-its-jurisdiction-over-west-bank-and-gaza.html\">Statement by Minister of Foreign Affairs on International Criminal Court’s decision regarding its jurisdiction over West Bank and Gaza</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-by-international-development-minister-on-appointment-to-the-covax-advance-market-commitment-engagement-group.html\">Statement by International Development Minister on Appointment to the COVAX Advance Market Commitment Engagement Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n</ul></div>\n      "
}