{
  "path": "/en/news/news-releases/2017/09/02/new-road-access-improvements-help-grow-yukons-natural-resources",
  "pageTitle": "New road access improvements to help grow Yukon’s natural resources sector | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investments in modern transportation infrastructure are vital to the development of a thriving and sustainable economy in Yukon. These investments create middle class jobs and improve the quality of life for all residents.</p><p>The Prime Minister, Justin Trudeau, and the Premier of Yukon, Sandy Silver, today announced over $360&nbsp;million in combined federal and territorial funding to improve road access in two mineral-rich areas: the Dawson Range in central Yukon and the Nahanni Range Road in southeastern Yukon.</p><p>In total, the Yukon Resource Gateway Project will help upgrade over 650 kilometres of road and build or replace numerous bridges, culverts, and stream crossings. Better road access will help Canadians and local businesses take greater advantage of the economic potential of Yukon’s natural resources, and set the stage for the long-term development of the territory’s growing mining sector.</p><p>In the Dawson Range, four separate public road systems will be upgraded. Improvements to the Nahanni Range Road will include upgrades from its junction with the Campbell Highway to the border between Yukon and the Northwest Territories.</p><h2>Quotes</h2><blockquote><p>“Modern infrastructure is key to developing and properly managing the incredible natural resources we have at our fingertips. By providing easier access to important resources across Yukon, the Yukon Resource Gateway Project will help create good, middle class jobs, promote long-term economic prosperity, and support a strong, sustainable North.”<br>— <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Resource Gateway is one of the most significant projects ever undertaken in this territory and will have an incredibly positive impact on the Yukon economy. I’m pleased to see the Government of Canada’s commitment to the Resource Gateway project. With this commitment, we will continue working with First Nations to complete the project agreements. First Nation agreement is essential to the continuation of the project and we look forward to working in partnership with them on this milestone development.”<br>— <cite>Sandy Silver, Premier of Yukon</cite></p></blockquote><h2>Quick facts</h2><ul><li>In support of the Yukon Resource Gateway, the Government of Canada has committed to contributing up to $247,381,000 to this project. Following the development of project agreements with affected First Nations and environmental and socio-economic review, the Government of Yukon will contribute up to $112,802,000.</li><li>The Government of Canada funding is being made available through the New Building Canada Fund – National Infrastructure Component.</li><li>The Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li><li>More than $10.1 billion of this funding will support trade and transportation projects, including $5&nbsp;billion that will be available for investment through the Canada Infrastructure Bank. An additional $4 billion of this funding will support infrastructure improvements in Indigenous communities.</li><li>The Government of Canada recognizes its responsibility to consult with Canada’s Indigenous Peoples and make accommodations where appropriate. The Government will undertake consultation activities within the environmental assessment process under the <i>Yukon Environmental and Socio-Economic Assessment Act</i>.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-02-en.html\">Government of Canada’s $180-billion+ infrastructure plan in Budget 2017</a></li><li><a href=\"http://www.infrastructure.gc.ca/map-carte/yt-eng.html\">Federal infrastructure investments in Yukon</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/nic-vin-prog-eng.html\">National Infrastructure Component</a></li></ul></div>\n      "
}