{
  "path": "/en/news/news-releases/2016/04/01/prime-minister-canada-concludes-his-visit-washington-and-2016-nuclear",
  "pageTitle": "The Prime Minister of Canada concludes his visit to Washington and to the 2016 Nuclear Security Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Washington, D.C., where he spoke before the U.S. Chamber of Commerce and attended the 2016 Nuclear Security Summit (NSS).</p>\n<p>In his address to the U.S. Chamber of Commerce, the Prime Minister shared Canada’s plan to strengthen the middle class and those working hard to join it. He also highlighted the government’s recent tax cuts that put more money in the pockets of middle class families by raising taxes on the wealthiest one per cent of Canadians.</p>\n<p>At the NSS, the Prime Minister announced that Canada will invest an additional $42 million in the Global Partnership Program – over the next two years – to improve nuclear and radiological security world-wide.</p>\n<p>In support of the Global Coalition Against the so-called Islamic State of Iraq and the Levant (ISIL), Canada announced it would invest $51 million – over three years – to build the capacity of counter-terrorism programs in the Middle East and North Africa.</p>\n<p><strong>Quotes</strong></p>\n<p>“I am pleased to have participated in this fourth and final 2016 Nuclear Security Summit, and I look forward to building on these accomplishments to enhance nuclear security world-wide.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“In Budget 2016, our government committed to growing the middle-class. When middle-class Canadians have more money to save, invest and grow the economy, everyone benefits.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>On the margins of the NSS, the Prime Minister also met with many world leaders, including: the President of Argentina, Mauricio Macri; the Prime Minister of India, Narendra Modi; the Prime Minister of Japan, Shinzo Abe; and, the Prime Minister of the United Kingdom (UK), David Cameron.</li>\n</ul>\n<ul>\n<li>In addition to the Global Partnership Program commitment, Canada will continue to take a leadership role on the world stage in the fight against nuclear terrorism. Canada is pleased to co-lead, with Spain and the Republic of Korea, a Joint Statement on the full and universal implementation of UN Security Council Resolution (UNSCR) 1540. We are also leading with the UK in providing comprehensive certification training for nuclear security practitioners.</li>\n</ul>\n<ul>\n<li>The funds dedicated to the Global Coalition Against the so-called Islamic State of Iraq and the Levant (ISIL) will be drawn from the resources announced on February 8, 2016, when Canada articulated its refocused strategy for Iraq, Syria, Jordan and Lebanon. Programming will focus on helping to stem the flow of foreign terrorist fighters, and countering ISIL’s financing and messaging. The funds will also support border security activities in neighbouring countries in order to reduce their vulnerability to ISIL infiltration.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.budget.gc.ca/2016/docs/plan/toc-tdm-en.html\">Budget 2016</a></li>\n<li><a href=\"http://www.nss2016.org/\">Nuclear Security Summit</a></li>\n</ul>\n<p><strong>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/04/01/canada’s-commitments-2016-nuclear-security-summit-‘gift-baskets’\">Canada’s Commitments to the 2016 Nuclear Security Summit ‘Gift Baskets’</a></li>\n<li><a href=\"/en/news/backgrounders/2016/04/01/efforts-counter-terrorism-and-violent-extremism\">Efforts to Counter Terrorism and Violent Extremism</a></li>\n<li><a href=\"/en/news/backgrounders/2016/04/01/funding-secure-nuclear-and-radiological-materials-terrorists\">Funding to Secure Nuclear and Radiological Materials from Terrorists</a></li>\n</ul></div>\n      "
}