{
  "path": "/en/news/news-releases/2020/03/10/prime-minister-announces-special-envoy-humanitarian-and-refugee",
  "pageTitle": "The Prime Minister announces Special Envoy on humanitarian and refugee issues | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In recent years, millions of people have fled their homes to escape armed conflict, violence, and unrest, as well as frequent floods, fires, and tropical storms driven by the effects of climate change. These vulnerable people face challenges that we can only address by working together with our partners.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that he intends to appoint the Honourable Bob Rae as Canada’s Special Envoy on Humanitarian and Refugee Issues. In this role, Mr. Rae will continue the important work he started as Special Envoy to Myanmar, while also addressing other pressing humanitarian and refugee issues around the world.</p>\n\n<p>Mr. Rae will continue to lead Canada’s diplomatic efforts to resolve the Rohingya crisis, and work closely with the international community and the United Nations on a coordinated international response. He will also work domestically with Canadians, civil society, and academia to address issues related to the situation in Myanmar and other humanitarian and refugee crises.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We share a global responsibility to meet the needs of displaced and vulnerable people around the world. In the many years I’ve known Special Envoy Rae, he’s always served Canadians through his thoughtful insights and professionalism. I thank him for his important work on the humanitarian and security crisis in Myanmar’s Rakhine State, and I know he will continue to serve Canadians and the world greatly in his expanded role.”&nbsp;&nbsp;&nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In October 2017, Prime Minister Justin Trudeau appointed the Honourable Bob Rae as Canada’s Special Envoy to Myanmar to reinforce the urgent need to resolve the humanitarian and security crisis in the country, and address the situation affecting vulnerable populations.</li>\n\t<li>Special Envoy Rae released his final report in April 2018, which outlined the underlying causes of the Rohingya crisis and provided recommendations to the Government of Canada.</li>\n\t<li>Based on the report’s recommendations, the Prime Minister announced Canada’s strategy to respond to the Rohingya crisis in Myanmar and Bangladesh in May 2018.</li>\n</ul>\n\n<h2>Biographical note</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/03/10/honourable-bob-rae\">Bob Rae</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2017/10/23/prime-minister-appoints-honourable-bob-rae-special-envoy-myanmar\">Prime Minister appoints the Honourable Bob Rae as Special Envoy to Myanmar</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2018/04/03/prime-minister-welcomes-final-report-special-envoy-myanmar\">Prime Minister welcomes the final report from Special Envoy to Myanmar</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/strat-rohingya.aspx?lang=eng\">Canada’s Strategy to Respond to the Rohingya Crisis in Myanmar and Bangladesh</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/index.aspx?lang=eng&amp;_ga=2.53060584.1509125409.1583335753-716764379.1568330562\">Canada’s response to conflict, crises and disasters</a></li>\n</ul></div>\n      "
}