{
  "path": "/en/news/statements/2022/06/09/joint-statement-new-canada-california-climate-action-and-nature",
  "pageTitle": "Joint Statement on the new Canada-California Climate Action and Nature Protection Partnership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The world’s leading climate scientists have made it clear - our window to avoid the worst impacts of climate change is narrowing faster than expected, and success requires unprecedented collective effort and transformational change. In direct response to this crisis, California and Canada today launched a Climate Action and Nature Protection Partnership. Guided by shared values and priorities, the Partnership is our next step forward to deliver clean air and water, good jobs, and healthy communities for Canadians and Californians alike.&nbsp;</p>\n\n<p>In 2019, our governments agreed to work together on reducing vehicle emissions, advancing clean fuel standards, and incentivizing the adoption of zero-emissions vehicles. Since then, our jurisdictions have both committed to mandate that zero-emissions vehicles represent 100% of new light-duty vehicle sales by 2035 and are taking decisive steps to transition the medium and heavy-duty sectors to zero emissions as well. This new Partnership builds on these successes.</p>\n\n<p>Already, both Canada and California have proposed bans on harmful single-use plastics, advanced nature and oceans protection, committed to clean electricity grids, all while prioritizing healthy and resilient communities and natural systems. Our firefighters cross the border to help neighbours in need, while we secure supply chains so that our industries can keep creating good jobs across the continent.</p>\n\n<p>Canada and California have much to offer each other, in sharing information and best practices, collaborating on policy and regulation, and pursuing mutually beneficial joint initiatives. From clean technology and biodiversity conservation, to zero emission transportation and a circular economy, the Partnership will deliver for our citizens and deepen our economic partnership. Together, we can fight climate change and protect nature while building inclusive, thriving economies that work for everyone, especially disadvantaged communities that are most impacted by climate change.</p>\n\n<p>In addition to the <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/reduce-emissions/memorandum-cooperation-canada-california-climate-action-nature-protection.html\">Memorandum of Cooperation</a> signed today that outlines areas of shared work under our new Partnership, we committed to Canada and California co-hosting an Expert Roundtable on Wildfires and Forest Resilience at UN Climate Week. This event will bring together officials, academics, industry, and civil society to chart our next steps forward on this common goal.</p>\n\n<p>In all our work, we acknowledge the important role of partnership with Indigenous Peoples, recognizing that Indigenous knowledge, including traditional knowledge, customary practices and cultural values, is essential for climate action and nature protection.</p>\n\n<p>By working together, our governments will fight climate change, protect nature, advance equity and create jobs and thriving businesses. Our partnership is an example to the world of the collaboration that will build a bright future for people everywhere.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>\n\n<p>&nbsp;</p>\n\n<div class=\"table-responsive\">\n<table class=\"table\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Justin Trudeau<br>\n\t\t\tPrime Minister of Canada</td>\n\t\t\t<td>Gavin Newsom<br>\n\t\t\tGovernor of the State of California</td>\n\t\t</tr>\n\t</tbody>\n</table>\n</div></div>\n      "
}