{
  "path": "/en/news/news-releases/2017/03/02/prime-minister-trudeau-address-global-energy-leaders-houston",
  "pageTitle": "Prime Minister Trudeau to address global energy leaders in Houston | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will deliver the keynote address at an annual international gathering of energy industry leaders in Houston, Texas, on March 9.</p><p>During his address to the CERAWeek by IHS Markit gathering, the Prime Minister will discuss Canada’s strategy of strongly linking economic and resource development with environmental leadership and renewable energy innovation.</p><p>This year’s event – being held under the theme “Insight into the Energy Future” – will be attended by global experts, government officials, policymakers, as well as leaders from the technology, financial, and industrial sectors.</p><p>The Prime Minister will take part in a special plenary dialogue with Daniel Yergin, vice chairman of IHS Markit and conference chair, as well as in a roundtable discussion with a diverse group of energy executives and innovative clean-tech leaders who are working to accelerate the transition to low carbon energy sources.</p><p>Finally, the Prime Minister will receive the CERAWeek Global Energy and Environment Leadership Award in recognition of his commitment to sustainability in energy and the environment.</p><h2>Quote</h2><blockquote><p>“The world’s markets are becoming increasingly integrated, and global demand for clean technology and renewable energy is growing quickly. We need to work together to drive energy innovation that will meet the world’s future energy needs and create good, middle class jobs today. This is about making our economy more competitive and leaving our kids a cleaner environment.” &nbsp;<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada is currently the leading and most secure supplier of energy products to the U.S., including crude oil, refined petroleum, natural gas, electricity, and uranium.</li><li>$45 billion has been spent on renewable energy projects in Canada over the past five years.</li><li>In 2015, nearly one third of a trillion dollars was invested globally in renewable power, nearly 50 per cent more than was invested in power from fossil fuels.</li><li>In 2014, there were 435 publicly traded Canadian-based energy companies with energy assets totalling $544 billion.</li><li>Between 2005 and 2014, Canada’s greenhouse gas emissions in the energy sector decreased 2.1 per cent while real Gross Domestic Product grew by 9.6 per cent.</li><li>In 2014, the production and consumption of energy in Canada accounted for 81 per cent of Canada’s greenhouse gas emissions.</li></ul><h2>Associated Link</h2><ul><li><a href=\"https://ceraweek.com/\">CERAWeek</a></li></ul></div>\n      "
}