{
  "path": "/en/news/statements/2017/02/05/statement-prime-minister-canada-international-development-week",
  "pageTitle": "Statement by the Prime Minister of Canada on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark International Development Week, which runs from February 5 to 11, 2017:</p>\n\n<p>“Canada’s international development workers and volunteers are selfless, generous, and dedicated individuals who work tirelessly – here at home and around the world – to improve the lives of millions of people.</p>\n\n<p>“During International Development Week, I encourage all Canadians to celebrate – and to learn about – those who do so much to build a more just and compassionate world.</p>\n\n<p>“This year’s theme – <em>Leave no one behind: Canada contributes to global goals!</em> – highlights our collective efforts to achieve the goals laid out in the United Nations’ <a href=\"http://international.gc.ca/world-monde/aid-aide/agenda.aspx?lang=eng\">2030 Agenda for Sustainable Development</a>. Canada will continue to show global leadership in bringing people together to help achieve lasting progress.</p>\n\n<p>“Over the past year, we have consulted Canadians and our international partners in order to craft a new approach to international assistance. Our refocused efforts will help the world’s poorest and most vulnerable people, including by promoting human rights, women’s empowerment and gender equality, and respect for diversity and inclusion.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me in thanking our international development workers and partners for their commitment to building a better world.”</p>\n\n<p><strong>Associated link</strong></p>\n\n<p><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/idw-sdi/index.aspx?lang=eng&amp;wbdisable=true\">International Development Week</a></p></div>\n      "
}