{
  "path": "/en/news/readouts/2022/06/28/prime-minister-justin-trudeau-meets-prime-minister-italy-mario-draghi",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Italy Mario Draghi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Italy, Mario Draghi, on the margins of the G7 Summit.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Draghi exchanged notes on the advancement of G7 priorities, including climate action, energy, critical minerals, democracy, and governance of the digital space. Leaders&nbsp;discussed the global growth outlook for 2022 and the negative economic spillovers from Russia’s war against Ukraine, and agreed on the need to control inflation to foster sustainable growth and development.</p>\n\n<p>The prime ministers spoke about Russia’s illegal and unjustifiable invasion of Ukraine and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people. Both leaders expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, notably for the Global South, and agreed to maintain close coordination with partners and allies on addressing food insecurity. Discussing the need to reduce European dependence on Russian oil and gas, they agreed to further cooperate to facilitate a just transition toward green and sustainable economies.</p>\n\n<p>Leaders welcomed the 75th anniversary of bilateral relations between Canada and Italy, and committed to further deepening areas of mutual priority, including increasing bilateral trade and investment and facilitating the creation of good jobs in both countries.</p>\n\n<p>The leaders looked forward to further engagement at the NATO summit in Madrid, Spain, in the coming days.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/italy-italie/index.aspx?lang=eng\">Canada and Italy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a name=\"_Hlk107052046\" id=\"_Hlk107052046\"></a><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a name=\"_Hlk107052021\" id=\"_Hlk107052021\"></a><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}