{
  "path": "/en/news/news-releases/2017/07/08/prime-minister-concludes-successful-g20-summit-germany",
  "pageTitle": "Prime Minister concludes successful G20 Summit in Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful G20 Leaders’ Summit in Hamburg, Germany.</p><p>During the Summit, Prime Minister Trudeau promoted open, progressive trade that benefits the middle class and those working hard to join it. He also emphasized the importance of gender equality and women’s empowerment, and the need to take action now to address climate change and build clean growth economies that work for everyone.</p><p>G20 leaders discussed countering terrorism and issued a joint statement focused on enhancing cooperation, cutting off funding that supports terrorism and preventing the use of the internet for terrorist purposes. Prime Minister Trudeau reiterated Canada’s commitment to work with partners at home and abroad to develop a coordinated global response to counter radicalization that strengthens security and safeguards human rights.</p><p>Leaders also reaffirmed their commitment to achieving the sustainable development goals under the 2030 Agenda for Sustainable Development. In support of these goals, Prime Minister Trudeau highlighted Canada’s recently launched Feminist International Assistance Policy, which focuses assistance on the poorest and most vulnerable. This policy recognizes that gender equality and the empowerment of women and girls are the best ways to build a more peaceful, inclusive, and prosperous world.</p><h2>Quote</h2><blockquote><p>“People have asked us to work together to make our societies fairer and more secure. We renewed our commitment to do so during this G20 Summit. As our planet becomes increasingly interconnected, we need to promote strong, sustainable economic growth that works for everyone, and embrace the need to be socially and environmentally responsible. This is about creating jobs and opportunities for everyone, and building a healthier and more prosperous tomorrow for our children and grandchildren.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The G20 is the central forum for international cooperation on financial and macroeconomic issues.</li><li>In addition to the Women Entrepreneurs Finance Initiative for which Canada announced a contribution of $20 million, G20 leaders also agreed to establish a Business Women Leaders’ Taskforce. This taskforce will bring together prominent business women from G20 countries to examine ways to increase women’s participation in the economy and support women-owned and women-led enterprises in both the developed and developing world.</li><li>Canada is actively supporting Germany’s initiative #eskills4girls by investing $15.8 million for five projects that will:<ul><li>Improve prospects for digitally enabled livelihoods in marginalized communities in Egypt;</li><li>Prepare Haitian youth for digital jobs;</li><li>Prevent child, early and forced marriage by increasing access to education and training for girls and women in select Commonwealth countries;</li><li>Increase skills in the mathematical sciences to promote employability, through the African Institute For Mathematical Sciences Skills; and,</li><li>Build teaching capacity in Dadaab refugee camps in Kenya by increasing access to higher education.</li></ul></li><li>Canada will also join and contribute $4 million to the Coalition for Epidemic Preparedness Innovation to provide resources and technical expertise to support the development of new vaccines to prevent and contain infectious disease epidemics.</li><li>As part of efforts to enhance engagement with Africa on fair economic growth, G20 leaders discussed new investment compacts between G20 countries and seven interested African countries (Côte d’Ivoire, Ethiopia, Ghana, Morocco, Rwanda, Senegal, and Tunisia). In that respect, Canada will invest $7.5 million in Ghana for inclusive poverty alleviation through the Mobilizing Domestic Revenues project.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng&amp;_ga=2.57657577.292400921.1498584263-1509584865.1475765971\" title=\"Canada and the G20\">Canada and the G20</a></li><li><a href=\"https://www.g20.org/Webs/G20/EN/Home/home_node.html\" title=\"G20 Germany 2017\">G20 Germany 2017</a></li><li><a href=\"http://www.worldbank.org/en/programs/women-entrepreneurs\">Women Entrepreneurs Finance Initiative</a></li></ul></div>\n      "
}