{
  "path": "/en/news/news-releases/2016/02/05/prime-minister-host-meeting-united-nations-secretary-general-ban-ki",
  "pageTitle": "Prime Minister to host meeting with United Nations Secretary-General Ban Ki-Moon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the United Nations (UN) Secretary-General, His Excellency, Mr. Ban Ki-moon, will be in Ottawa and Montréal on a working visit, from February 11 to 13.</p>\n<p>Canada is an active and committed member of the United Nations – not only because the UN provides essential support to millions of people in need – but also because it serves Canada’s interests. A more peaceful world is a safer and more prosperous world for Canada, too.</p>\n<p>During the Secretary-General’s visit, Canada will reaffirm its commitment to the UN, to effective cooperation, and to renewed leadership on the world stage. The Prime Minister will highlight Canadian engagement on a number of key global issues, including: climate change and climate finance; the situation in Syria, Iraq, and surrounding countries; refugee resettlement; and the health of women and children around the world.</p>\n<p>The Prime Minister and the Secretary-General will also meet with Canadian youth and discuss the importance of building diverse and resilient societies that promote peace and broad-based economic growth.</p>\n<p><strong>Quotes</strong></p>\n<p>“Secretary-General Ban has made invaluable contributions to the UN, in particular in spearheading real action on climate change and sustainable development, and in bringing global attention to key humanitarian crises. We are honoured that Mr. Ban has accepted our invitation to visit Canada so early in the government’s mandate.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“If we are to build a more peaceful and prosperous world – a world where our diversity is seen as a strength– then a strong United Nations is essential. Canada is proud of the part it has played in the UN’s successes, from protecting human rights to peacekeeping. I want to restore Canada’s voice and leadership role at the UN.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Secretary-General Ban will also meet with Governor General David Johnston, prior to his visit to Montréal on February 12.</li>\n<li>In Montréal, the Secretary-General will meet with the Premier of Quebec, M. Philippe Couillard, and the Mayor of Montréal, M. Denis Coderre.</li>\n<li>He will deliver an address at McGill University, and meet with the Secretary-General and President of the Council of the International Civil Aviation Organization (ICAO), a UN specialized agency based in Montréal, and other UN staff based in the city.</li>\n<li>Mr. Ban will be accompanied by his wife, Mrs. Ban Soon-taek.</li>\n</ul>\n<p><strong>Associated Link</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/genev/mission/canada-UN_nu.aspx?lang=eng\">Canada and the United Nations</a></li>\n</ul></div>\n      "
}