{
  "path": "/en/news/news-releases/2019/06/19/prime-minister-attend-g20-leaders-summit-japan",
  "pageTitle": "Prime Minister to attend G20 Leaders’ Summit in Japan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Osaka, Japan, to attend the G20 Leaders’ Summit on June 28 and 29.</p>\n\n<p>The Summit is a key opportunity to take concerted action on some of the world’s most pressing challenges, including making sure more people benefit from the increasingly global and digital economy.</p>\n\n<p>Japan has put forward a G20 agenda with many themes similar to those of Canada’s 2018 G7 Presidency, including combatting climate change, promoting clean energy, and advancing gender equality and women’s empowerment.</p>\n\n<p>At the Summit, the Prime Minister will continue to champion these issues, and underscore how creating new opportunities for the middle class is the best way to restore people’s confidence in the future.</p>\n\n<p>In addition, he will promote open trade and investment, call for stronger and more decisive action to combat violent extremism in all its forms, including online, and underline how countries, as part of their efforts to fight climate change, must make a clean economy affordable for everyone.</p>\n\n<p>Finally, he will stress the urgent need for G20 countries to uphold the rules-based international order, and to recognize the threat of those who seek to undermine this order.&nbsp;</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We are seeing eroding support around the world for the very things that have helped deliver stability and prosperity for generations. As G20 leaders, we have a fundamental responsibility to reverse this trend and to build economies that benefit more people. The G20 Summit in Osaka is a chance to agree on goals and principles that drive growth and progress and, ultimately, restore people’s confidence in the future.”</p>\n\n<footer class=\"default\">&nbsp;The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2><strong>Quick Facts</strong></h2>\n\n<ul>\n\t<li>This is the fifth time Prime Minister Justin Trudeau will attend the G20 Leaders’ Summit.</li>\n\t<li>Minister of Foreign Affairs Chrystia Freeland and Minister of Finance Bill&nbsp;Morneau will accompany the Prime Minister to the Summit.</li>\n\t<li>The Summit brings together leaders of major advanced and emerging economies to address pressing global challenges.</li>\n\t<li>This is the first time Japan has assumed the G20 Presidency.</li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.g20.org/en/\">G20</a></li>\n\t<li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada’s participation at the 2019 G20 Leaders’ Summit</a></li>\n</ul></div>\n      "
}