{
  "path": "/en/news/news-releases/2020/09/08/prime-minister-announces-changes-senior-ranks-public-service",
  "pageTitle": "The Prime Minister announces changes in the senior ranks of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes in the senior ranks of the Public Service:</p>\n\n<p><strong>Christyne Tremblay</strong>, currently Deputy Minister of Natural Resources, becomes Deputy Clerk of the Privy Council, Associate Secretary to the Cabinet, and Deputy Minister of Intergovernmental Affairs, effective September&nbsp;9, 2020.</p>\n\n<p><strong>Jean-François Tremblay</strong>, currently Deputy Minister of Indigenous Services, becomes Deputy Minister of Natural Resources, effective September&nbsp;21, 2020.</p>\n\n<p><strong>Christiane Fox</strong>, currently Deputy Minister of Intergovernmental Affairs, becomes Deputy Minister of Indigenous Services, effective September&nbsp;21, 2020.</p>\n\n<p>The Prime Minister took the opportunity to wish <strong>Catherine Blewett</strong>, Deputy Clerk of the Privy Council, continued success in her new role. He also thanked her for her dedication and excellence in serving Canadians.</p>\n\n<p>The Prime Minister congratulated <strong>Jonathan Fried</strong>, Coordinator, International Economic Relations with Global Affairs Canada and Personal Representative to the Prime Minister on the G20; <strong>Janet King</strong>, Associate Deputy Minister of Public Services and Procurement; and <strong>Anne-Marie Smart</strong>, Senior Advisor to the Privy Council Office, on their recent retirement from the Public Service. He also thanked these dedicated individuals for their service to Canadians.</p>\n\n<h2>Biographical notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/09/08/christyne-tremblay\">Christyne Tremblay</a></li>\n\t<li><a href=\"/en/news/backgrounders/2020/09/08/jean-francois-tremblay\">Jean-François Tremblay</a></li>\n\t<li><a href=\"/en/news/backgrounders/2020/09/08/christiane-chris-fox\">Christiane Fox</a></li>\n</ul></div>\n      "
}