{
  "path": "/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents",
  "pageTitle": "Making life more affordable for Canadian parents | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The global COVID-19 pandemic has made life more difficult for Canadian families. That’s why the Government of Canada has taken action to support parents through this crisis and helped make life more affordable for all families, including through the Canada Child Benefit (CCB). Since its implementation in 2016, the CCB has given more money to about nine out of ten Canadian families, grown the middle class, and helped lift nearly 435,000 children out of poverty.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that families entitled to the CCB will receive additional support of up to $1,200 for each child under the age of six. This temporary measure will put money directly into the pockets of Canadian families to better help them cope with the pressures of the pandemic.</p>\n\n<p>Families with a net income of $120,000 or less will receive up to four tax-free payments of $300. Families with a net income above $120,000 will receive up to four tax-free payments of $150, for a total benefit of up to $600. To ensure that more money goes to the families that need it the most, families with net incomes that are too high to be entitled to the CCB will not receive these additional payments.</p>\n\n<p>The first and second payments will be issued today, with subsequent payments on July 30 and October 29, 2021. This measure will benefit approximately 1.6 million Canadian families and approximately 2.1 million children under the age of six.</p>\n\n<p>Many families with young children have been struggling with a wide range of expenses during the pandemic. These payments will make life easier for them to afford healthy food, short-term child care, and at-home learning activities. While we finish the fight against COVID-19 and build back better for everyone, the Government of Canada will continue to make life more affordable for Canadian families and grow the middle class.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“This immediate investment in our children will help hard-working parents provide for their families by putting more money directly in their pockets. We will continue to make life more affordable for Canadian families, grow the middle class, and build a better country for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Having raised my children as a working mother, I know the challenges that parents face when balancing the well-being of their children with economic necessity. The Government of Canada is committed to supporting families with young children as we work together towards recovery and a return to a new normal for all Canadians.”</p>\n\n<footer class=\"default\">The Hon. Diane Lebouthillier, Minister of National Revenue</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know it’s been a tough year for Canadians, and especially for parents with young children. We are continually looking for the best ways to tailor our programs like the Canada Child Benefit to address the real challenges they face every day, including keeping up with the high costs of raising kids. That’s why our government is kicking in additional support for parents this year as we weather the pandemic and continue to build back a stronger, more prosperous Canada.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The CCB is a simple, tax-free monthly payment based on income, and provides increased support for those who need it most, to help with the cost of raising children under 18 years of age.&nbsp;</li>\n\t<li>As an added measure in May 2020, the government delivered almost $2 billion in additional support through a special, one-time top-up of the CCB of up to $300 per child, benefitting approximately 3.7 million families.</li>\n\t<li>Today’s investment was included in the Fall Economic Statement 2020, and approved on May 6, 2021 through the adoption of Bill C-14, <em>An Act to implement certain provisions of the economic statement tabled in Parliament on November 30, 2020 and other measures</em>.</li>\n\t<li>Families that already receive the CCB will not need to take any action to receive the payments. However, families do need to file their 2019 and 2020 tax returns to access them.</li>\n\t<li>The payments that will be made today for each of the first two quarters – January and April – are based on the family net income for 2019.</li>\n\t<li>The July and October payments will be based on the family net income for 2020. This may mean that payment amounts differ for some families midway through the year.</li>\n\t<li>Families that have not yet filed for either year could still be entitled to receive the CCB and the CCB young child supplement by filing their income taxes as soon as possible.</li>\n\t<li>Agencies that receive children’s special allowances (CSA) payments will also receive up to four tax-free CCB young child supplement equivalent payments of $300 for each child under the age of six for whom the CSA is paid in January, April, July, or October 2021.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/news/2021/05/up-to-1200-more-per-child-for-16-million-families-across-canada.html\">Up to $1,200 more per child for 1.6 million families across Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/news/2021/05/ccb-young-child-supplement-2021.html\">CCB young child supplement, 2021</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/05/06/legislation-critical-pandemic-support-receives-royal-assent\">Legislation for Critical Pandemic Support Receives Royal Assent</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada child benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/childrens-special-allowances.html\">Children's special allowances (CSA)</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/fes-eea/2020/themes/building-back-better-rebatir-mieux-en.html\"><em>Fall Economic Statement 2020: Supporting Canadians and Fighting COVID-19</em></a></li>\n</ul></div>\n      "
}