{
  "path": "/en/news/news-releases/2016/05/09/canada-host-global-fund-replenishment-conference-fight-aids",
  "pageTitle": "Canada to host Global Fund Replenishment Conference to fight AIDS, Tuberculosis, and Malaria | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Canada will host the Fifth Replenishment Conference of the Global Fund to Fight AIDS, Tuberculosis, and Malaria in Montréal, Quebec on September 16, 2016.</p><p>The Global Fund initiative is a true expression of Canada’s core values – to care for each other, to support those in need, and to prioritize the health and wellness of our global community.</p><p>This conference will bring global health leaders together in an effort to end the epidemics of three of the world’s most devastating diseases – AIDS, tuberculosis, and malaria – by 2030.</p><p>The Prime Minister also announced that Canada will pledge $785 million, for 2017 to 2019, to help save an additional 8 million lives, and stop an additional 300 million new infections by 2019. This investment represents a 20 per cent increase from the previous pledge made for 2014-2016.</p><p>The Prime Minister also voiced his support for the Global Fund’s new youth driven social media campaign “End It. For Good” Those who get involved in the campaign will have the opportunity to join others who are dedicated to making the world a better place at a concert in Montréal in September.</p><h2>Quotes</h2><blockquote><p>”This is an historic opportunity for Canada and the world. By fast-tracking investments and building global solidarity, we can bring an end to three devastating epidemics – AIDS, tuberculosis and malaria – that have tragic and far-reaching impacts on the world’s most vulnerable people.”<br>- <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“We have made significant progress in recent years, but the fight is not over. Canada is committed to ending the HIV, tuberculosis and malaria epidemics for good by 2030. Canada is making the choice to lead on this critical issue for the poorest and most vulnerable people.”<br>- <cite>Marie-Claude Bibeau, Minister of International Development and La Francophonie</cite></p></blockquote><blockquote><p>“Canada is demonstrating outstanding leadership in global health and development. Prime Minister Trudeau’s insight and his government’s commitment to global partnerships and cooperation will help save millions of lives and create opportunity and prosperity for countless more.”<br>- <cite>Dr. Mark Dybul, Executive Director, The Global Fund to Fight AIDS, Tuberculosis and Malaria</cite></p></blockquote><blockquote><p>“The Global Fund was one of the first organizations to recognize that we can’t win the fight against AIDS, TB and malaria unless we fight for the rights of women and girls. It’s playing a key role in tackling gender disparities and ensuring that millions of women and girls have an opportunity to lead a healthy and productive life.”<br>- <cite>Melinda Gates, Co-chair of the Bill and Melinda Gates Foundation</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Prime Minister made the announcement with Mark Dybul, Executive Director of the Global Fund and Melinda Gates, Co-chair of the Bill &amp; Melinda Gates Foundation, after meeting with representatives from a number of Canadian organizations active in international development and youth engagement.</li><li>They were joined by: the Honourable Marie-Claude Bibeau, Minister of International Development and La Francophonie; the Honourable Alexander Percival Segbefia, Minister of Health for the Republic of Ghana; the Honourable Prof. Moustafa Mijiyawa, Minister of Health for the Republic of Togo; and the Honourable Christine St-Pierre, Minister of International Relations and Francophonie for the Government of Quebec.</li></ul><h2>Associated Links</h2><ul><li>Backgrounder – <a href=\"/en/news/backgrounders/2016/05/09/canada-and-global-fund\">Canada and the Global Fund</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/gfatm-fmstp.aspx?lang=eng\">Canada’s International Development Projects with the Global Fund to Fight AIDS, Tuberculosis and Malaria</a></li><li><a href=\"http://www.theglobalfund.org/en/\">The Global Fund</a></li></ul></div>\n      "
}