{
  "path": "/en/news/news-releases/2018/12/01/prime-minister-concludes-productive-g20-leaders-summit",
  "pageTitle": "Prime Minister concludes productive G20 Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G20 Leaders’ Summit in Buenos Aires, Argentina, and welcomed the outcomes outlined in the G20 Leaders Declaration.</p><p>The Summit was a key opportunity for countries to come together to strengthen the middle class and invest in economic growth that benefits everyone.</p><p>During the Summit, the Prime Minister emphasized how creating new opportunities for the middle class is critical to helping people deal with the uncertainty of a changing world and stemming the spread of polarization and division.</p><p>The Summit also provided an opportunity to build on priorities from the G7 Summit in Charlevoix, particularly equal access to quality education to promote equal opportunity and the empowerment of women and girls, implementation of the Ocean Plastics Charter to eradicate plastic pollution and protect our oceans, and the successful replenishment of the Global Fund to fight AIDS, tuberculosis, and malaria.</p><p>The Prime Minister continued to promote gender equality and women’s economic empowerment, another key G7 theme, at events hosted by the Business Women Leaders’ Taskforce and Her Majesty Queen Maxima of Netherlands. The Prime Minister also attended the G20 Investor Forum to discuss how partnerships between governments and the private sector for long-term investments can create good, middle class jobs and promote sustainable development.</p><p>In support of the G20 efforts on global health, the Prime Minister announced an additional $10 million contribution to the Coalition for Epidemic Preparedness, which will help develop new life saving vaccines to prevent and contain infectious disease outbreaks.</p><p>On climate, Canada has made significant progress and is working to meet its commitments to phase-out inefficient fossil fuel subsidies (IFFS) by 2025. In support of this, Canada is participating in a G20 voluntary peer review process with Argentina, which will compare and improve knowledge, and push forward the global momentum to identify and reduce IFFS.</p><p>While in Argentina, the Prime Minister also met with President of Argentina Mauricio Macri. They welcomed the concrete progress made since Prime Minister Trudeau’s 2016 visit to Argentina, including Canada’s trade talks with Mercosur and&nbsp;Canada's upcoming creative industries trade mission to Latin America, including Argentina, in February 2019.&nbsp;&nbsp;The leaders also welcomed the signing today of a memorandum of understanding to collaborate on sharing best practices on open government, which will support peer learning, empower citizens, and improve public services.</p><h2>Quotes</h2><blockquote><p>“Canada and Argentina have worked closely together to build complementary agendas and goals for this year’s G7 and G20 Summits to continue our strong progress to create new opportunities for the middle class, advance gender equality, strengthen financial governance, create a fairer global tax system, and combat corruption. The discussions among G20 leaders over the last two days show that we must work together to address the world’s most pressing challenges, strengthen the middle class, and offer real help to people working hard to join it.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Argentina and Canada share common values of diversity and inclusion, and a strong commitment to rules-based international trade and growth that benefits the middle class and people working hard to join it. Collaborating on open government between our countries will deepen our people-to-people bonds and drive growth that benefits everyone.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Prime Minister met with leaders from around the world in Buenos Aires, including Prime Minister of the United Kingdom Theresa May, President of France Emmanuel Macron, Prime Minister of Spain Pedro Sánchez, President of South Africa Cyril Ramaphosa, President of the Inter-American Development Bank Luis Alberto Moreno, Managing Director of the International Monetary Fund Christine Lagarde, and Governor of the Bank of England and Chair of the Financial Stability Board Mark Carney.</li><li>The Global Fund was founded in 2002 to accelerate the end of the AIDS, tuberculosis and malaria epidemics.Canada has supported the Global Fund since its creation, providing more than $2 billion in total to the organization over its lifetime. Canada hosted the last Global Fund replenishment conference in 2016, where close to $13 billion was raised, including $804 million for 2017 – 2019 from Canada.</li><li>In line with the G20 priority on infrastructure for economic growth, job creation and productivity, Canada highlighted its contribution of $20 million to the Global Infrastructure Hub (GI Hub) to establish Toronto as the centre of its North American operations. The GI Hub brings together public and private investors to develop critical infrastructure projects that benefit people, strengthen their communities, create good, middle class jobs, and connect global markets.</li><li>The GI Hub will use $5 million of the funding to establish the Global Centre for Infrastructure Excellence, underscoring Canada’s commitment to foster new partnerships for development.</li><li>The Open Government Partnership (OGP) was launched in 2011 to bring together government reformers and civil society leaders to create action plans that make governments more inclusive, responsive and accountable. Canada is the current lead government Chair and will host the Open Government Partnership Global Summit in Ottawa in May 2019. Argentina will replace Canada as lead government Chair in October 2019.</li><li>The arts and culture sector provides jobs to more than 650,000 Canadians, in addition to the numerous indirect jobs created by cultural products. It contributes 2.8&nbsp;percent to Canada’s GDP. Argentina is the second largest economy in South America and a high-potential market for Canadian companies.</li><li>Bilateral trade between Canada and Argentina totaled $2.2 billion in 2017. Canadian exports to Argentina totaled $445.7 million in 2017.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/assets/pdfs/G20/G20-dec-2018-buenos_aires_leaders_declaration.pdf\">G20 Leaders Declaration</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li><li><a href=\"https://g7.gc.ca/en/official-documents/charlevoix-g7-summit-communique/\">The Charlevoix G7 Summit Communiqué</a></li><li><a href=\"/en/news/news-releases/2018/09/24/canada-supports-global-infrastructure-new-hub-toronto\">Global Infrastructure Hub</a></li><li><a href=\"https://www.fin.gc.ca/n18/18-048-eng.asp\">Canada-Argentina Peer Reviews of Inefficient Fossil Fuel Subsidies</a></li><li><a href=\"https://www.canadainternational.gc.ca/argentina-argentine/bilateral_relations_bilaterales/canada_argentina-argentine.aspx?lang=eng\">Canada-Argentina Relations</a></li><li><a href=\"https://open.canada.ca/en/content/canadas-plans-open-government-partnership\">Canada’s Plans to the Open Government Partnership</a></li><li><a href=\"https://canadacouncil.ca/initiatives/summit-of-americas\">Americas Cultural Summit</a></li><li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/latin-america-trade-mission-2019.html\">2019 Canadian creative industries trade mission to Latin America</a></li></ul></div>\n      "
}