{
  "path": "/en/news/statements/2017/04/23/statement-prime-minister-canada-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister of Canada on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom HaShoah:</p><p>“At sundown tonight, Jewish communities and others in Canada and around the world will unite to commemorate the lives of the six million Jews who were systematically murdered by the Nazis during the Holocaust.</p><p>“Memorial candles will be lit to honour victims and survivors. The Mourner’s Kaddish will be repeated, reaffirming the commitment of the Jewish people to God in the face of tragedy.</p><p>“The atrocities carried out during the Holocaust have caused some people to ask whether it is possible to still have faith in humanity. Yom HaShoah teaches us that we <i>must</i> maintain that faith. To honour the victims of the Holocaust is to recognize their humanity, which no human act can erase.</p><p>“At Auschwitz this year, participants in the March of the Living will walk in silence as a testament to the resilience of the survivors of the Holocaust. In Israel, a whole nation will pause as air raid sirens sound in remembrance. Here in Canada, events across the country will be held to commemorate those who perished, and to honour the survivors, and those who risked their lives to save others.</p><p>“Today, I call on all Canadians to guard against a resurgence of anti-Semitism and racism, and to fight all forms of hatred and discrimination, whenever and wherever they occur. It is up to all of us to bring meaning to the solemn vow: ‘Never again.’</p><p>“On behalf of the Government of Canada, I extend our thoughts and prayers to all those observing Yom HaShoah.”</p><p><b>Associated Links</b></p><p><a href=\"http://www.pm.gc.ca/eng/news/2017/01/27/statement-prime-minister-canada-international-holocaust-remembrance-day\">Prime Minister’s Statement on International Holocaust Remembrance Day<br></a><i><span lang=\"EN\" xml:lang=\"EN\"><a href=\"http://laws-lois.justice.gc.ca/eng/acts/H-5.4/FullText.html\">Holocaust Memorial Day Act</a></span></i></p></div>\n      "
}