{
  "path": "/en/news/news-releases/2020/05/13/prime-minister-nominates-new-auditor-general",
  "pageTitle": "Prime Minister nominates new Auditor General | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Karen Hogan as Canada’s new Auditor General.&nbsp;</p>\n\n<p>Ms. Hogan has over 25 years of accounting and auditing experience. She has gained extensive management experience over the course of her career, and has worked at the executive level in the Office of the Auditor General of Canada since 2006.</p>\n\n<p>The Office of the Auditor General of Canada provides Parliament with impartial, fact-based information, and expert advice on government programs and activities, gathered through audits. The Auditor General’s responsibilities include auditing operations of the federal and territorial governments, and providing Parliament and the legislative assemblies of the territories with independent information, assurance, and advice regarding the stewardship of public funds.</p>\n\n<p>Ms. Hogan was chosen as the nominee for this position through the government’s open, transparent, and merit-based appointment process.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With her accounting and auditing expertise, and decades of experience as a leader and team builder in the public and private sectors, Karen Hogan will be an excellent Auditor General. I trust that her focus will continue to be on promoting open, transparent, and accountable governance, for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Auditor General is an independent Agent of Parliament, appointed under the <em>Auditor General Act</em> for a term of ten years.</li>\n\t<li>The appointment of the Auditor General is made by the Governor in Council after consultation with the leader of every recognized party in the House of Commons and group in the Senate, and after approval by resolution of both Houses of Parliament.</li>\n\t<li>The Office of the Auditor General of Canada was established in 1878 under the <em>Auditor General Act</em>. The Office audits federal government departments and agencies, most Crown corporations, and many other federal organizations, and reports publicly to Parliament on matters that the Auditor General believes should be brought to its attention.&nbsp;</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/05/13/karen-hogan\">Karen Hogan</a></li>\n</ul></div>\n      "
}