{
  "path": "/en/news/news-releases/2022/04/21/inuit-crown-partnership-committee-endorses-historic-inuit-nunangat",
  "pageTitle": "Inuit-Crown Partnership Committee endorses historic Inuit Nunangat Policy to better support Inuit self-determination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>To advance reconciliation, strengthen the Inuit-Crown partnership, and create a more prosperous Inuit Nunangat through meaningful collaboration, the Government of Canada and Inuit leaders have been working closely together through the Inuit-Crown Partnership Committee (ICPC) since the signing of the <a href=\"/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\"><em>Inuit Nunangat Declaration</em></a> in 2017.</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, and President Natan Obed of Inuit Tapiriit Kanatami, alongside federal Cabinet ministers and the elected Inuit leadership from the Inuvialuit Regional Corporation, Nunavut Tunngavik Incorporated, Makivik Corporation, and the Nunatsiavut Government, endorsed the new, historic <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1650556354784\">Inuit Nunangat Policy</a> at a meeting of the ICPC. This marks the first time the Government of Canada has co-developed an overarching, whole-of-government policy of this nature.</p>\n\n<p>The Inuit Nunangat Policy recognizes Inuit Nunangat – the Inuit homeland – as a distinct geographic, cultural, and political region, encompassing the Inuvialuit Settlement Region, Nunavut, Nunavik, and Nunatsiavut. The policy is inclusive of urban areas where Inuit reside. It will help guide the design, development, and delivery of all new or renewed federal policies, programs, services, and initiatives that apply in Inuit Nunangat or benefit Inuit.</p>\n\n<p>With the goal of promoting prosperity and supporting community and individual well-being throughout Inuit Nunangat, the Government of Canada is committing a total of $25 million over five years for the implementation of the Inuit Nunangat Policy. This includes $20 million for projects to accelerate policy implementation in line with Inuit priorities. The Government of Canada and Inuit will continue to work together to implement the policy through a strategic, coordinated, and whole-of-government approach.</p>\n\n<p>During the meeting, the Prime Minister, President Obed, and Committee members also discussed proposed Budget 2022 investments and linkages to ICPC priority areas, in particular a new investment of $845 million over seven years in housing support across Inuit Nunangat. Inuit leadership and ministers also endorsed several new priority areas of work, including international Inuit priorities, monitoring, evaluation, and learning as well as sovereignty, defence, and security.</p>\n\n<p>Today’s endorsement of the Inuit Nunangat Policy is an important step toward supporting Inuit self-determination and ensuring meaningful, Inuit-led solutions to the distinct issues faced by Inuit. The Government of Canada will continue to work with Inuit leadership through the ICPC to build a renewed Inuit-Crown relationship and advance reconciliation based on affirmation of rights, respect, and partnership.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Inuit have unique rights, interests, and experiences. Today’s endorsement of the Inuit Nunangat Policy is the culmination of years of collaboration and will help ensure Inuit priorities and self-determination are part of the government’s programs, policies, and initiatives going forward. This is an important step on the long journey toward reconciliation and we will continue to work together to deliver lasting and meaningful solutions to the issues facing communities across Inuit Nunangat.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Inuit Nunangat Policy has been the centrepiece of our work within the Inuit-Crown Partnership Committee and we are pleased to see it come to fruition. This policy puts in place the structural change needed for the federal government to effectively respond to the needs of Inuit. It serves as an important step towards Inuit self-determination.”</p>\n\n<footer class=\"default\">President Natan Obed, Inuit Tapiriit Kanatami</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Inuit Nunangat Policy outlines an approach for the design and renewal of all federal policies, programs, services, and initiatives that apply in Inuit Nunangat or benefit Inuit. This approach will improve coordination across Inuit Nunangat and ensure engagement with Inuit in these processes.</li>\n\t<li>A guiding principle of the Inuit Nunangat Policy is recognition that federal investments for Inuit and Inuit Nunangat are an important element of the right of Inuit to self-determination and self-government. The Policy directs federal government organizations to consider the unique rights, interests, and circumstances of Inuit in their approach to directly fund Inuit Land Claims Organizations.</li>\n\t<li>Co-developing and implementing an Inuit Nunangat policy has been a priority of the Inuit-Crown Partnership Committee since March 2020.</li>\n\t<li>The Committee’s current priorities include:\n\t<ul>\n\t\t<li>Inuit land claims implementation</li>\n\t\t<li>Inuktut revitalization, maintenance, protection, and promotion</li>\n\t\t<li>Inuit Nunangat Policy Space</li>\n\t\t<li>Reconciliation measures and efforts to end the issue of missing and murdered Indigenous women and girls</li>\n\t\t<li>Education, early learning, and skills development</li>\n\t\t<li>Health and wellness</li>\n\t\t<li>Environment and climate change</li>\n\t\t<li>Housing</li>\n\t\t<li>Infrastructure</li>\n\t\t<li>Economic development and procurement</li>\n\t\t<li>Legislative priorities</li>\n\t\t<li>International Inuit priorities</li>\n\t\t<li>Monitoring, evaluation, and learning</li>\n\t\t<li>Sovereignty, defence, and security</li>\n\t</ul>\n\t</li>\n\t<li>Today’s announcement delivers on the commitment set out in Minister of Crown-Indigenous Relations Marc Miller’s <a href=\"https://pm.gc.ca/en/mandate-letters/2021/12/16/minister-crown-indigenous-relations-mandate-letter\">mandate letter</a> from December 2021 to work with Inuit to finalize a co-developed Inuit Nunangat Policy and accelerate its implementation.</li>\n\t<li>The Inuit-Crown Partnership Committee was founded on the principle that an equal partnership between Inuit and the Crown is essential to the reconciliation process. The Committee meets three times a year. Once a year, it is co-chaired by the Prime Minister and the&nbsp;President of Inuit Tapiriit Kanatami.</li>\n\t<li>The Committee also includes as permanent participants the presidents of Inuit Circumpolar Council Canada, the National Inuit Youth Council, and Pauktuutit Inuit Women of Canada.</li>\n\t<li>Inuit Nunangat is the Inuit homeland in Canada. It encompasses the land, water, and ice of the Inuit land claim regions of the Inuvialuit Settlement Region of the Northwest Territories and Yukon, Nunavut, Nunavik in Northern Quebec, and Nunatsiavut in Northern Labrador.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/08/inuit-crown-partnership-committee-continues-progress-shared\">Inuit-Crown Partnership Committee continues progress on shared priorities to support Inuit self-determination and address socio-economic inequity in Inuit Nunangat</a><a name=\"_Hlt101380076\" id=\"_Hlt101380076\"></a><a name=\"_Hlt101380077\" id=\"_Hlt101380077\"></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee</a><a name=\"_Hlt101380082\" id=\"_Hlt101380082\"></a><a name=\"_Hlt101380083\" id=\"_Hlt101380083\"></a></li>\n\t<li><a href=\"https://www.itk.ca/inuit-nunangat-map/\">Map of Inuit Nunangat</a><a name=\"_Hlt101380087\" id=\"_Hlt101380087\"></a><a name=\"_Hlt101380088\" id=\"_Hlt101380088\"></a></li>\n</ul></div>\n      "
}