{
  "path": "/en/news/statements/2018/09/23/statement-prime-minister-gender-equality-week",
  "pageTitle": "Statement by the Prime Minister on Gender Equality Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Gender Equality Week:</p><p>“This week, we mark the first ever <a href=\"https://www.swc-cfc.gc.ca/commemoration/gew-ses/index-en.html\">Gender Equality Week</a> in Canada. This is a historic step, and a chance to celebrate gender equality as a key to Canada’s success. We honour the people behind the progress we’ve made, and turn toward the work left to do to make sure everyone has the opportunities they need to thrive.</p><p>“The theme of this year’s celebration – <i>Gender equality benefits everyone</i> – highlights the ways gender equality makes life better for all of us. It’s key to tackling the challenges we face as a world – whether building peace, fighting climate change, or growing economies that work for everyone. More people participating fully across our society means a bigger workforce, a stronger economy, and better communities. That’s good for all of us – and it’s on all of us to make it a reality.</p><p>“Standing up for gender equality is a top priority for the Government of Canada. We appointed the first ever gender-balanced federal Cabinet and, in 2018, we put gender equality at the centre of both the federal budget and Canada’s G7 presidency. We have taken action to protect gender-diverse Canadians from discrimination, reduce the gender wage gap, support women entrepreneurs, and prevent and address gender-based violence.</p><p>“Canada will continue to champion gender equality at home and abroad. This year, Gender Equality Week falls during the United Nations General Assembly – where advancing gender equality will be one of our top priorities. At the G7 summit this past summer, we saw the progress we can make when we come together. In Charlevoix, thanks to the leadership of the <a href=\"https://g7.gc.ca/en/g7-presidency/gender-equality-advisory-council/\">Gender Equality Advisory Council for Canada’s G7 Presidency</a>, Canada and partners announced a historic investment of close to $3.8 billion in education for women and girls in crisis and conflict situations – the largest of its kind ever made. This investment will help make sure the most vulnerable women and girls get the chance to learn and succeed, and we will continue to build on that momentum this week by welcoming further support.</p><p>“Canada is also proud to stand with Chile as co-chairs of the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/coalition-equal-rights-droits-egaux.aspx?lang=eng\">Equal Rights Coalition</a>, the first intergovernmental network formed to promote and protect the rights of lesbian, gay, bisexual, transgender and intersex (LGBTI) people around the world. As Canadians, we know our diversity is our strength – and we are all better off when everyone’s rights are protected, and everyone’s voice is heard.</p><p>“Gender equality benefits all of us. This week, let’s celebrate everyone who has worked to build a more just and equal Canada. Let’s do our part, build on their progress, and shape a country where everyone has a real and fair chance to succeed.”</p></div>\n      "
}