{
  "path": "/en/news/readouts/2020/02/12/prime-minister-justin-trudeau-meets-president-senegal-macky-sall",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Senegal Macky Sall | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the President of Senegal, Macky Sall.&nbsp;</p>\n\n<p>The Prime Minister and the President spoke about the longstanding friendship between Canada and Senegal, based upon shared values and language, and extensive people-to-people ties.&nbsp;</p>\n\n<p>They talked about how partnerships in education have brought together people and institutions in both countries, and discussed support for education in Senegal&nbsp;as well as for Senegalese students in Canada.&nbsp;</p>\n\n<p>The two leaders exchanged views on shared priorities including economic growth, governance and democracy, climate change, and gender equality and women’s empowerment. &nbsp;</p>\n\n<p>Prime&nbsp;Minister Trudeau affirmed Canada’s continued support for the objectives of Plan Sénégal Émergent. They discussed ways to further strengthen trade and investment between Canada and Senegal, and agreed to continue working together to create economic opportunities for all, including Senegal’s dynamic and entrepreneurial youth. &nbsp;</p>\n\n<p>The Prime Minister and the President spoke about the importance of action to address climate change and the degradation of ocean resources which are important to livelihoods in Canada and Senegal.&nbsp;</p>\n\n<p>The two leaders exchanged views on peace and security developments in West Africa, further to Canada’s role as 2020 Chair of the United Nations Peacebuilding Commission. The Prime Minister acknowledged Senegal’s leadership and support for peacekeeping in the region They agreed to continue working together to advance the Women, Peace and Security agenda, which is transforming peace operations around the world. &nbsp;</p>\n\n<p>The leaders spoke about the need for further efforts to combat gender-based violence, building upon collaboration to date and strong support from Canada. &nbsp;</p>\n\n<p>They discussed ways to further advance shared values including governance and democracy, including through fora such as La Francophonie.&nbsp;</p>\n\n<p>The Prime Minister was accompanied by the Minister of Foreign Affairs,&nbsp;François-Philippe Champagne,&nbsp;and the Minister of Families, Children and Social Development, Ahmed Hussen.</p></div>\n      "
}