{
  "path": "/en/news/statements/2022/05/17/statement-prime-minister-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p>\n\n<p>“Today, on the <a href=\"https://may17.org/\">International Day Against Homophobia, Transphobia, and Biphobia</a>, we join members of Lesbian, Gay, Bisexual, Transgender, Queer, and Two-Spirit (LGBTQ2) communities in Canada and around the world to reaffirm our commitment to ensuring everyone can feel safe and be themselves, regardless of their sexual orientation, gender identity, and gender expression.</p>\n\n<p>“Diversity and inclusion are among Canada’s greatest strengths, and the Government of Canada will always stand up for LGBTQ2 people and their rights.</p>\n\n<p>“Recently, Health Canada approved Canadian Blood Services’ submission to stop the blood donor deferral period for men who have sex with men and put an end to the discriminatory blood donation ban. Earlier this year, <em>An Act to amend the Criminal Code (conversion therapy)</em> banned so-called conversion therapy, a cruel, harmful, and degrading practice that had no scientific basis and has caused lasting pain and trauma for the LGBTQ2 community here in Canada. Canada also recently became the first country in the world to provide <a href=\"https://www150.statcan.gc.ca/n1/daily-quotidien/220427/dq220427b-eng.htm\">census data</a> on transgender and non-binary people to address important information gaps on gender diversity to better meet the needs of everyone in Canada.</p>\n\n<p>“Since 2015, the government has taken historic action to build a more inclusive future for everyone. I delivered an apology to LGBTQ2 Canadians on behalf of the government, we invested in LGBTQ2 organizations fighting discrimination across the country, and we passed legislation that provides Canadians with explicit protection from discrimination, hate speech, and hate crimes based on their gender identity or expression.</p>\n\n<p>“LGBTQ2 rights are human rights and the Government of Canada recognizes we have more to do to ensure that everyone is free to be their authentic self. That’s why we are developing a&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/free-to-be-me/lgbtq2-action-plan.html\">LGBTQ2 Action Plan</a> by working with LGBTQ2 people in Canada. In partnership with the LGBT Purge Fund, we are building a bold and dynamic LGBTQ2 National Monument in downtown Ottawa. The <a href=\"https://www.canada.ca/en/canadian-heritage/news/2022/03/design-for-the-lgbtq2-national-monument-revealed.html\">‘Thunderhead’ monument</a> will embody the strength, activism, and hope of LGBTQ2 communities, and be a lasting testimony to the courage and humanity of those who were harmed by the LGBT Purge, and homophobic and transphobic laws.</p>\n\n<p>“On this day, we also recognize the brave and tireless work of advocates and ally organizations who support LGBTQ2 individuals in Canada. This includes&nbsp;<a href=\"https://www.fondationemergence.org/?lang=en\">Fondation Émergence</a>, which created the first day against homophobia&nbsp;in Canada in 2003 and continues to bring Canadians together to advance LGBTQ2 rights. The International Day Against Homophobia, Transphobia, and Biphobia is now marked by 130 countries worldwide.</p>\n\n<p>“Today and every day, I encourage all Canadians to work together and help build better, more inclusive communities across the country. Together, we are building a world where we can all be who we are and love who we love.”</p></div>\n      "
}