{
  "path": "/en/news/statements/2019/05/01/statement-prime-minister-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom HaShoah, or Holocaust Memorial Day:</p>\n\n<p>“Tonight at sundown, we will join Jewish communities and others in Canada and around the world to observe Yom HaShoah.</p>\n\n<p>“On Yom HaShoah, we remember the six million innocent Jews who were systematically murdered by the Nazis during the Holocaust – one of the darkest periods in human history.</p>\n\n<p>“We also pay tribute to those who survived these unspeakable atrocities, and recognize the bravery of all who stood against the Nazi regime, risking their lives to save others.</p>\n\n<p>“Families and loved ones will gather to light a memorial candle and recite prayers in memory of the victims. In Israel, sirens will sound as the entire country pauses to pray. Communities will recite the Mourner’s Kaddish in one voice, in synagogues around the world.</p>\n\n<p>“These moments remind us why remembrance matters – both to honour those who lived these horrors, and to make sure such atrocities are never repeated. By telling the stories of the Holocaust, we make sure these experiences of loss and survival, of unspeakable suffering and profound resilience, are never forgotten.</p>\n\n<p>“This year has been a difficult one for many in the Jewish community, in Canada and beyond. Recent brutal, senseless attacks are fresh in our minds, from Pittsburgh to San Diego. Reports of a rise in anti-Semitism are alarming to all of us. But we will not be silent in the face of oppression, or indifferent in the face of hate. We will always speak out against anti-Semitism, discrimination, and hatred in all its forms, and together, we will counter them.</p>\n\n<p>“To all those observing Yom HaShoah, you are in our minds and hearts. I invite all Canadians to remember the victims of the Holocaust, and reflect on what we can do to honour them. Only by working together can we bring meaning to the solemn vow, ‘Never Again.’”</p></div>\n      "
}