{
  "path": "/en/news/readouts/2020/04/16/prime-minister-justin-trudeau-participates-productive-g7-leaders-meeting",
  "pageTitle": "Prime Minister Justin Trudeau participates in productive G7 Leaders’ meeting on COVID‑19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated in a special G7 Leaders’ meeting on COVID-19 held by videoconference.</p>\n\n<p>Prime Minister Trudeau stressed the need for G7 leaders to continue to work together on a coordinated international approach to address the health and economic impacts of the COVID-19 pandemic. He underlined the essential role of international institutions in the sharing of scientific research, the development of testing protocols, and the flow of essential medical supplies to all who need them, particularly vulnerable countries without advanced healthcare systems. He also highlighted the need to cooperate on urgent efforts to develop effective COVID-19 therapies and a vaccine through institutions like the Coalition for Epidemic Preparedness Innovations and Gavi, the Vaccine Alliance.</p>\n\n<p>The Prime Minister also spoke about the need for government action that protects workers and businesses, helps them through the pandemic, and positions them to be ready for the recovery that will come.&nbsp;He said that restarting global economic growth will require sustained support for people and businesses. It will also depend on a continued commitment to free and open trade, including through strengthened international supply chains. He noted the need to carefully coordinate and manage the reopening of the global economy in order to prevent a second wave of infections.</p>\n\n<p>Finally, the Prime Minister emphasized the need for the G7 to work together to support the most vulnerable populations around the world, particularly in Africa and small island developing states in the Caribbean and elsewhere. He stressed that fighting the pandemic and mitigating its economic impacts in developing countries will be an essential part of the global recovery process.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n</ul></div>\n      "
}