{
  "path": "/en/news/news-releases/2019/05/23/prime-minister-delivers-statement-exoneration-chief-poundmaker",
  "pageTitle": "Prime Minister delivers a statement of exoneration for Chief Poundmaker | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Confronting our past and acknowledging our mistakes are at the heart of our journey of reconciliation. We have to share and understand Canada’s history before we can take meaningful steps to build a new relationship with Indigenous peoples for the benefit of all Canadians.</p>\n\n<p>On behalf of the Government of Canada, the Prime Minister, Justin Trudeau, today delivered a statement to posthumously exonerate Chief Poundmaker (Pihtokahanapiwiyin), who was wrongfully convicted and imprisoned in 1885. Prime Minister Trudeau also apologized to members of the Poundmaker Cree Nation for these past wrongs.</p>\n\n<p>During the North-West Resistance of 1885, Chief Poundmaker sought rations for his starving community. He was wrongly accused of looting and then pursued by government troops. Chief Poundmaker did not take part in the ensuing battle, but saved many lives by convincing the community’s warriors not to attack the retreating government troops. The apology and posthumous exoneration of Chief Poundmaker were presented today at a special ceremony held at Poundmaker Cree Nation, on the site of that same battle.</p>\n\n<p>The Government of Canada will continue to work with Poundmaker Cree Nation to address historical wrongs and build a renewed relationship based on mutual respect, cooperation, and partnership. <strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We recognize that during his lifetime Chief Poundmaker was not treated justly nor showed the respect he deserved as a leader of his people. If we are to move forward together on the path of reconciliation, the Government of Canada must acknowledge the wrongs of the past. It is my sincere hope that—by coming together today and taking this important step together as equal partners—we can continue the important work of reconciling the past and renewing our relationship.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We honour our legendary leader Poundmaker today, and all affiliated leaders and warriors, for taking a brave stance defending themselves on May 2, 1885, and for holding back and not counter-attacking the retreating Colonel Otter and his men. He saved a lot of lives, and was living up to his promise not to take up arms against the Queen as promised under Treaty Number Six. Poundmaker was a diplomat, a peace maker, and was practicing reconciliation already in the 19th century. The truth is now known, and he will be remembered in history as a national hero.”</p>\n\n<footer class=\"default\">Chief Duane Antoine, Poundmaker Cree Nation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On May 26, 1885, Chief Poundmaker travelled to Battleford to try to negotiate a peace agreement with the government. He and his followers were arrested. On August 17, 1885, Chief Poundmaker faced trial in Regina, Saskatchewan. The jury found him guilty of treason-felony, and sentenced him to three years in Stony Mountain Penitentiary in Manitoba. After serving one year, Chief Poundmaker was released due to deteriorating health, and he died four months later.</li>\n\t<li>The Poundmaker Cree Nation has long sought justice for past wrongs related to the unjust conviction and imprisonment of Chief Poundmaker.</li>\n\t<li>Reconciliation discussions between the Government of Canada and Poundmaker Cree Nation began in February 2018, and the First Nation identified the exoneration as its first priority.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/23/statement-exoneration-chief-poundmaker\">Statement of Exoneration for Chief Poundmaker</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://www.poundmakercn.ca/\">Poundmaker Cree Nation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2019/05/canada-and-the-poundmaker-cree-nation-to-mark-exoneration-of-chief-poundmaker-at-special-community-ceremony.html\">Canada and the Poundmaker Cree Nation to mark exoneration of Chief Poundmaker at special community ceremony</a></li>\n</ul></div>\n      "
}