{
  "path": "/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec",
  "pageTitle": "New agreement to strengthen the early learning and child care system in Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The governments of Quebec and Canada recognize Quebec’s leadership in early learning and child care and together, they have announced an asymmetric agreement for the federal transfer of nearly $6&nbsp;billion over five years. This includes a significant portion that will go toward strengthening the early learning and child care system in Quebec and improving working conditions for educators.</p>\n\n<p>The Prime Minister of Canada, Justin Trudeau, the Premier of Quebec, François Legault, the Minister of Families, Children and Social Development, Ahmed Hussen, and the Quebec Minister of Families and the Minister Responsible for the Outaouais region, Mathieu Lacombe, made this announcement today.</p>\n\n<p>The agreement follows the Government of Canada’s plan announced in the last federal budget to provide parents across Canada with early learning and child care spaces for an average of $10 a day for children under the age of six. Through this agreement, the Government of Canada is supporting Quebec families, while recognizing that Quebec will maintain its role in setting priorities in early learning and child care, an area exclusive to Quebec and in which it already has a proven track record.</p>\n\n<p>Almost 25&nbsp;years ago, Quebec indeed understood the importance of implementing an early learning and child care system that provides quality, affordable child care for all children,&nbsp;all the while facilitating the participation of parents, especially mothers, in the workforce. Now is the time for the rest of Canada to follow Quebec's lead and learn from its pioneering practices.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to quality, affordable child care. That is why, from coast to coast to coast, we are laying the foundation for Canada’s first-ever Canada-wide early learning and child care system. Today’s agreement with Quebec will further improve the system that Quebecers are so rightly proud of. This agreement will provide Quebecois families and communities with additional support as we build back better from the pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We have reason to be proud of our daycare model in Quebec. First, because it helps us take care of our little ones. They are our most precious asset – our future. It is our duty to offer the best to our children. As a society, it has to be our top priority. This agreement is a wonderful win for Quebec families. A large part of these funds will be used to complement the system. Young parents and their children will benefit from it directly.”</p>\n\n<footer class=\"default\">François Legault, Premier of Quebec</footer>\n</blockquote>\n\n<blockquote>\n<p>“I would like to thank Quebec feminists who have shown the way for the rest of Canada in early learning and child care. Ensuring that parents – especially mothers – have access to quality, affordable child care is a smart policy, both economically and socially. This will encourage women’s participation in the workforce, create jobs, and give children the best possible start in life. It will also provide thousands more Quebec families with regulated child care spaces and help Quebec strengthen a system that is already an inspiration for the rest of the country.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Daycare is not a luxury, but a necessity. It is time for the rest of the world to learn from Quebec’s example. Today’s historic agreement will help ensure Quebec has the support it needs to continue being a leader in child care services, with a system where all children have a place that meets their needs.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am very proud of our early childhood learning and daycare system and all the people who, every day, contribute to making it a flagship of Quebec society and an inspiration for Canada. I am thrilled with today’s announcement because it will allow us to accelerate our goal of delivering a strong system and better meet the child care needs of Quebec families.”</p>\n\n<footer class=\"default\">Mathieu Lacombe, Quebec’s Minister of Families and the Minister Responsible for the Outaouais region</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am very pleased with the agreement reached with the federal government, which respects Quebec's jurisdiction. It will allow us to continue to offer quality child care services to Quebec families.”</p>\n\n<footer class=\"default\">Eric Girard, Quebec’s Minister of Finance and Minister of the Economy and Innovation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Quebec’s early learning and child care system was launched in 1997. The goal was to provide quality, affordable places for children aged 0&nbsp;to&nbsp;5, to foster their overall development. In 2021, Quebec parents with a subsidized, reduced contribution space pay a single fee of $8.50 per day.</li>\n\t<li>For a number of years now, Quebec has been sharing its best practices and expertise in early learning and child care with all provinces and territories.<a name=\"_Hlk78971052\" id=\"_Hlk78971052\"></a></li>\n\t<li>In 2021-22, Quebec will invest more than $2.7 billion in early learning and child care services.</li>\n\t<li>The 2021 federal Budget includes new investments to build a high-quality, affordable, flexible, and inclusive early learning and child care system across Canada. These investments total up to $30&nbsp;billion over the next five years and, combined with previous investments announced in 2015, $9.2&nbsp;billion per year thereafter.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped create more than 40,000 more affordable child care spaces across the country before the pandemic.</li>\n\t<li>Investments in child care will benefit all families in Canada. Studies have shown that for every dollar invested in early childhood education, there is a return of between $1.50 and $2.80 to the overall economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making Life More Affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.mfa.gouv.qc.ca/fr/publication/Documents/napperon-explicatif-SGEE.pdf\">Early Childhood Care Services in Quebec</a> (French only)</li>\n\t<li><a href=\"https://www.rqap.gouv.qc.ca/en\">Quebec Parental Insurance Plan</a></li>\n\t<li><a href=\"https://www.tresor.gouv.qc.ca/en/expenditure-budget/2021-2022-expenditure-budget/\">Quebec’s 2021-22 Expenditure Budget</a></li>\n</ul></div>\n      "
}