{
  "path": "/en/news/news-releases/2019/03/29/prime-minister-appoints-interim-auditor-general-canada",
  "pageTitle": "Prime Minister appoints interim Auditor General of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Sylvain&nbsp;Ricard, currently the Deputy Auditor General, as the interim Auditor General of Canada.&nbsp;</p>\n\n<p>Mr. Ricard brings with him an extensive background in audit management and the expertise needed to promote an open, transparent government that is accountable to Canadians. Mr. Ricard served as Assistant Auditor General from May 2007 to November 2018, when he was appointed Deputy Auditor General.</p>\n\n<p>The Office of the Auditor General of Canada serves Parliament by providing it with impartial, fact-based information and expert advice on government programs and activities, gathered through audits.</p>\n\n<p>The Government of Canada has posted a notice of opportunity for the position of Auditor General of Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With his experience in finance and auditing, Sylvain Ricard will be an excellent interim Auditor General of Canada. Mr. Ricard has a deep appreciation of the need for an open and transparent government, and I trust he will do an outstanding job delivering on the mandate of the Office of the Auditor General of Canada.”&nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As per Section 3(4) of the <em>Auditor General Act</em>, the interim Auditor General has been appointed for a 6-month term<em>. </em></li>\n\t<li>The Auditor General is an independent Agent of Parliament, appointed under the <em>Auditor General Act</em> for a term of ten years.</li>\n\t<li>The appointment of the Auditor General is made by the Governor in Council after consultation with the leader of every recognized party in the House of Commons and group in the Senate, and after approval by resolution of both Houses of Parliament.</li>\n\t<li>The Office of the Auditor General of Canada was established in 1878 under the <em>Auditor General Act</em>. The Office audits federal government departments and agencies, most Crown corporations, and many other federal organizations, and reports publicly to Parliament on matters that the Auditor General believes should be brought to its attention.</li>\n\t<li>The Auditor General is also the auditor for the territorial governments and reports directly to their legislative assemblies.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/03/29/sylvain-ricard\">Sylvain Ricard</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pcogic.njoyn.com/CL3/xweb/Xweb.asp?tbtoken=YF9cRFUSRRl1Y3EFQVBJEFVLc3ldcVVZbydZIFsRCWNaWjEYXTFtLiUuQC4kXmd9PApQVhRSTz5l&amp;chk=dFlbQBJf&amp;Page=JobDetails&amp;Jobid=J0319-0892&amp;BRID=14679&amp;SBDID=1&amp;clid=52106&amp;lang=1\">Notice of opportunity</a></li>\n</ul></div>\n      "
}