{
  "path": "/en/news/news-releases/2016/11/08/prime-minister-justin-trudeau-travel-cuba-argentina-and-peru",
  "pageTitle": "Prime Minister Justin Trudeau to travel to Cuba, Argentina, and Peru | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will pay official visits to Cuba and Argentina from November 15 to 18, and will travel to Peru from November 19 to 20 to participate in the 2016 Asia Pacific Economic Cooperation (APEC) Leaders’ meeting.</p><p>Canada enjoys strong, long-standing relations with Cuba and Argentina. During the official visits, the Prime Minister will meet with Cuban President Raúl Castro, Argentinian President Mauricio Macri, and a number of local business and cultural leaders.</p><p>The trip will provide Canada with an opportunity to renew and strengthen its relationships with Cuba and Argentina, and collaborate more closely on sustainable economic growth, inclusive governance, security, climate change, and gender equality.</p><p>At the APEC Leaders’ meeting in Peru, the Prime Minister will join other APEC leaders to focus on strengthening the middle class, creating economic growth, and facilitating freer trade and investment in the region.</p><p>Canada is committed to deepening bilateral relations and engagement with important partners both in the hemisphere and in the Asia-Pacific region in order to benefit Canadians, and grow the middle class.</p><h2>Quotes</h2><blockquote><p>“Cuba and Argentina are two of our closest partners in the hemisphere. I look forward to working with President Castro and President Macri to stimulate more trade and investment with Canada, grow the middle class, and foster closer people-to-people ties for the benefit of all our citizens.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Asia Pacific region is critical to our country’s economic future and to growing our middle class. I look forward to promoting Canada as a partner of choice for trade and investment in the region while embracing the theme of quality and inclusive economic growth that Peru has put forward this year. Peru is a valued partner for Canada in both the hemisphere and the Asia-Pacific region, and I look forward to meeting host President Kuczynski.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Cuba enjoy a diverse relationship based on 71 years of uninterrupted diplomatic engagement and constructive cooperation in areas including trade and investment, development assistance, security, and tourism. Cuba is an important market in the Caribbean/Central American sub-region with bilateral merchandise trade valued at over one billion dollars annually.</li><li>Canada and Argentina enjoy excellent commercial relations and share similar perspectives on many global issues, the promotion of democracy and human rights, international peace and security, nuclear non-proliferation and the sustainable stewardship of the environment. Canadian companies are important actors in the extractives and&nbsp;agro-industrial sectors in Argentina.</li><li>The APEC forum was established in 1989 and has become the most important economic forum in the Asia Pacific region. Its primary purpose is to facilitate economic growth and prosperity in the region, with the vision of creating a seamless regional economy.</li><li>APEC’s 21 members are home to 2.8 billion people who generate more than half of the world’s gross domestic product, including more than 84 per cent of Canada’s total merchandise trade.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li></ul></div>\n      "
}