{
  "path": "/en/news/news-releases/2019/05/14/prime-minister-announces-advisory-board-select-next-supreme-court",
  "pageTitle": "Prime Minister announces advisory board to select the next Supreme Court justice | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to appointing Supreme Court of Canada Justices in a way that is transparent, inclusive, and accountable to Canadians.</p>\n\n<p>That is why, in 2016, the Government of Canada launched a new process that tasked an independent and non-partisan Advisory Board with identifying suitable candidates who are jurists of the highest caliber, functionally bilingual, and representative of the diversity of Canada.</p>\n\n<p>Under Canada’s Constitution, at least three of the Supreme Court judges are to be appointed from among the judges of the Quebec Court of Appeal or Superior Court, or among advocates of the province. As such, the Government of Canada indicated at the time of launching the new process in 2016 that the composition of the Advisory Board would be adapted in filling these three seats to take into account the province’s civil law tradition.</p>\n\n<p>The Government of Canada and the Government of Quebec have now agreed on a Memorandum of Understanding that creates an Advisory Board for Quebec that reflects its unique legal tradition and ensures greater participation by its government in the selection process of judges from the province.</p>\n\n<p>The Prime Minister, Justin Trudeau, also announced the members of the Advisory Board for Quebec, who will recommend candidates to fill the vacancy created by the upcoming retirement of Justice Clément Gascon.</p>\n\n<p>The Advisory Board for Quebec will review applications and submit a shortlist of highly qualified candidates for consideration by the Prime Minister.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Supreme Court of Canada is recognized internationally as a strong, independent judicial institution. I am confident that the Advisory Board will recommend only the most exceptional individuals – who reflect Quebec’s historic representation on the court and its civil law tradition – to hold the honour of being named to Canada’s top court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The following members have been named to the independent Advisory Board for Supreme Court of Canada Judicial Appointments for the Quebec seat:\n\t<ul>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Kim_Campbell\">The Right Honourable Kim Campbell</a>&nbsp;– Chairperson – former Prime Minister of Canada, Canadian Consul General, and the Founding Principal of the Peter Lougheed Leadership College at the University of Alberta from 2014 to 2018.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Louis_LeBel\">The Honourable Louis LeBel</a>&nbsp;– Member – retired justice of the Supreme Court of Canada and resident judge at the Faculty of Law at Laval University.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Eugenie_Brouillet\">Eugénie Brouillet</a>&nbsp;– Member – law professor and Vice Rector of Research, Creation and Innovation at Laval University and a former member of the Board of Directors of the Barreau de Québec.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Steeves_Bujold\">Steeves Bujold</a>&nbsp;– Member – partner at McCarthy Tétrault in Montréal and a member of the Executive Committee of SOGIC (Sexual Orientation and Gender Identity Community) of the Canadian Bar Association – Quebec Branch.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Celine_Levesque\">Céline Lévesque</a>&nbsp;– Member – Dean of the Faculty of Law, Civil Law Section at the University of Ottawa.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Lili_Anna_Peresa\">Lili-Anna Pereša</a>&nbsp;– Member – President and Executive Director of Centraide of Greater Montréal.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Joseph_Yvon_Theriault\">Joseph Yvon Thériault</a>&nbsp;– Member – Professor of Sociology at the Université du Québec à Montréal and former Canada Research Chair in Globalization, Citizenship and Democracy.</li>\n\t\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes#Han_Ru_Zhou\">Han-Ru Zhou</a>&nbsp;– Member – Associate Professor of Public Law at the Université de Montréal Faculty of Law.</li>\n\t</ul>\n\t</li>\n\t<li>Under the Memorandum of Understanding between the governments of Canada and Quebec, the independent and non-partisan Advisory Board for this process is composed of eight members, all of whom must be functionally bilingual. These are:\n\t<ul>\n\t\t<li>two members, including the Chair of the Advisory Board, nominated by the federal Minister of Justice;</li>\n\t\t<li>two members, including at least one who is not a practising lawyer, nominated by Quebec’s Minister of Justice;</li>\n\t\t<li>a judge from Quebec who is retired from a superior court of Quebec or from the Supreme Court of Canada, nominated by the Canadian Judicial Council;</li>\n\t\t<li>a lawyer who is a member of the Barreau du Québec, nominated by the Barreau du Québec;</li>\n\t\t<li>a lawyer who is a member of the Barreau du Québec, nominated by the Canadian Bar Association – Québec Division;</li>\n\t\t<li>a legal scholar nominated by the Deans of the Quebec Law Faculties and of the Civil Law Section of the University of Ottawa’s Faculty of Law.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/05/15/biographical-notes\">Biographical notes</a></li>\n\t<li><a href=\"/en/news/backgrounders/2019/05/15/arrangement-concerning-appointment-process-fill-seat-will-be-left\">Memorandum of Understanding</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-justice/news/2019/04/statement-from-the-minister-of-justice-and-attorney-general-of-canada-on-the-retirement-of-supreme-court-justice-clement-gascon.html\">Statement from the Minister of Justice and Attorney General of Canada on the retirement of Supreme Court Justice Clément Gascon</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/04/18/prime-minister-opens-process-select-next-justice-supreme-court-canada\">Prime Minister opens process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"http://fja-cmf.gc.ca/scc-csc/2019/index-eng.html\">Supreme Court of Canada appointments process</a></li>\n\t<li><a href=\"http://fja-cmf.gc.ca/scc-csc/2019/qualifications-eng.html\">Qualifications and assessment criteria</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">New process for judicial appointments to the Supreme Court of Canada</a></li>\n</ul></div>\n      "
}