{
  "path": "/en/news/news-releases/2022/10/28/prime-minister-announces-new-measures-support-ukraine",
  "pageTitle": "Prime Minister announces new measures to support Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Ukrainians bravely defend their country and our shared values of peace, democracy, and human rights, Canada remains steadfast in our support. We will continue to use every tool at our disposal to support the government and people of Ukraine, and hold Russia accountable for its brutal, unjustifiable invasion.</p>\n\n<p>The Prime Minister, Justin Trudeau, today attended the XXVII Triennial Congress of Ukrainian Canadians in Winnipeg, Manitoba, where he announced new measures to continue supporting the people of Ukraine.</p>\n\n<p>The Prime Minister announced that the Government of Canada will issue Ukraine Sovereignty Bonds, which will help the government continue operations, including providing essential services to Ukrainians, like pensions, and purchasing fuel before winter. The equivalent proceeds from this five-year bond will be channelled directly to Ukraine through the International Monetary Fund’s (IMF) Administered Account. This builds on the Government of Canada’s $2&nbsp;billion in financial assistance to Ukraine this year.</p>\n\n<p>To increase pressure on Putin’s regime, the Prime Minister also announced that Canada is imposing new sanctions on individuals and entities complicit in Russia’s invasion of Ukraine. These new measures will target 35 senior officials of energy entities, including those of Gazprom and its subsidiaries, and six energy sector entities involved in Russia’s ongoing violations of Ukraine’s sovereignty and territorial integrity. He also announced that Canada intends to impose new sanctions on members of the Russian justice and security sectors, including police officers and investigators, prosecutors, judges, and prison officials, involved in gross and systematic human rights violations against Russian opposition leaders. These new measures build on the sanctions we have already implemented against over 1,400 individuals and entities.</p>\n\n<p>The 39 armoured combat support vehicles (ACSVs) we announced for Ukraine in June have started to arrive in Europe, where training for the Ukrainian forces is underway, with the last expected to be delivered end of November. Since February 2022, Canada has committed over $600&nbsp;million in military assistance to Ukraine. We will continue to help Ukraine meet its urgent requirements for military and defence equipment.</p>\n\n<p>As winter approaches, Canada will continue to be there to support the people of Ukraine. Over 17&nbsp;million Ukrainians are currently in need of humanitarian assistance, and many are ill prepared for the colder months. That is why the Prime Minister announced that Canada is allocating $55&nbsp;million in previously announced funding to the International Federation of Red Cross and Red Crescent Societies, the International Organization for Migration, and the United Nations High Commissioner for Refugees and other humanitarian partners to support winterization initiatives. This includes providing shelter and distributing essential items such as blankets, clothing, heating appliances, and fuel.</p>\n\n<p>Canada is also moving forward with previously budgeted $15 million in funding for demining support to Ukraine, including the procurement of urgently needed demining equipment for the State Emergency Service of Ukraine through Global Affairs Canada’s Weapons Threat Reduction Program and the Peace and Stabilization Operations Program.</p>\n\n<p>To address the devastating impacts of Russia’s invasion on Ukrainian expertise, innovation, and talent, the Prime Minister announced the launch of the Canada-Ukraine Science Partnership, which will invite up to 20 Ukraine-based scientists to come work and live in Canada. This initiative will help Ukraine preserve and rebuild its science and research capacity.</p>\n\n<p>Canada will continue our unwavering support for Ukraine as it defends its sovereignty, territorial integrity, and independence. We will continue to work with our international partners to hold Putin accountable for his illegal invasion and the war crimes and human rights violations that have been committed by his regime.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada and Ukraine are united – not just by the strong ties between our peoples, but also by our fundamental belief in freedom, in democracy, in justice, and in the triumph of light over darkness. As Russia continues its illegal and unjustifiable aggression against Ukraine, Canada will continue to support the Ukrainian government and people. In standing up for themselves, Ukrainians are standing up for democracy everywhere.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada remains unwavering in our commitment to support the people of Ukraine in their fight against Putin’s illegal and barbaric invasion, and we will continue to do everything we can to ensure Ukraine has the resources it needs to win. Now, through a bond designated for Ukraine, Canadians can contribute to this critical effort through a new federally backed investment.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Russia’s disregard for human rights will not stand. President Putin’s history of gross human rights abuses is well documented, and Canada is doing everything it can to support Ukrainians who have suffered at the hands of his regime. As Ukrainians continue to fight valiantly to reclaim the land that is rightfully theirs, we reaffirm our commitment to stand with Ukraine for as long as it takes.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Putin continues his unwarranted and illegal invasion of Ukraine by targeting civilian infrastructure, such as power stations and water facilities, which is a blatant attempt to further force the people of Ukraine to unjustly suffer during the coming winter months. Canada is committed to helping equip the crises-affected people with essential winterization tools and we are working with our humanitarian partners to assess the needs so that they can continue to scale up their operations and mitigate the impact on vulnerable populations.”</p>\n\n<footer class=\"default\">The Hon. Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada is resolutely committed to helping Ukraine defend itself against Putin’s illegal and unjustifiable invasion. In recent weeks, the Armed Forces of Ukraine have made incredible progress reclaiming ground and Canada’s assistance has been integral in their counter offensive. The Canadian Armed Forces have helped donate equipment, train security forces and recruits, and transport aid. We will continue to meet Ukraine’s military momentum with the military aid they need to fight and win.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“In response to unjustifiable Russian aggression, Canada is helping Ukraine preserve its scientific capacity. By welcoming Ukrainian scientists to Canada, we can provide meaningful and important research opportunities for individuals forced to leave behind their careers and their homes by this ongoing conflict.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s invasion of Ukraine on February 24, 2022, Canada has imposed sanctions on more than 1,400 individuals and entities complicit in Putin’s invasion of Ukraine. Many of these sanctions have been undertaken in coordination with Canada’s allies and international partners.</li>\n\t<li>Between 2015 and 2022, Canada trained more than 33,000 members of Ukraine's security forces as part of Operation UNIFIER.</li>\n\t<li>The new Ukraine Sovereignty Bonds will be offered by participating financial institutions in denominations and rates of return which will be announced soon. Those who choose to invest in this bond will, in effect, be purchasing a regular Government of Canada&nbsp;five-year bond backed by Canada’s triple-A credit rating. Canada is the first country in the world outside of Ukraine to offer a bond for purchase in support of Ukraine.</li>\n\t<li>Canada has committed $2&nbsp;billion in financial assistance to Ukraine this year, all of which has already been disbursed. This is in addition to nearly $1.5 billion in assistance committed, including through military aid, $320 million in humanitarian response efforts, and immigration measures.</li>\n\t<li>Canada is also providing support through key international financial institutions, including the International Monetary Fund, the World Bank, and the European Bank for Reconstruction and Development. Since the onset of Russia’s illegal invasion, these three institutions have together committed more than $28.5&nbsp;billion to support Ukrainians.</li>\n\t<li>The Canada-Ukraine Science Partnership is open to scientists and postgraduate students who have fled or are fleeing Ukraine following Russia’s invasion. This includes highly qualified individuals with experience in the natural resource sectors and students who are seeking placements at Canadian academic institutions to continue their research. They are encouraged to apply through the newly created <a href=\"https://www.nrcan.gc.ca/careers/support-for-ukraine-based-scientists/24615\">Canada-Ukraine Science Partnership</a><strong> </strong>website.</li>\n\t<li>Canada is also helping Ukrainian families find a safe, temporary home in Canada, and has put in place supports to help them after they arrive. This includes temporary financial assistance and access to federally funded settlement services, such as language training and employment-related services.</li>\n\t<li>Streamlining current visa and travel requirements, the Canada-Ukraine Authorization for Emergency Travel is the fastest, safest, and most efficient way for Ukrainians to come to Canada. As of October 18, 2022, close to 315,000 applications have been approved.&nbsp;</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ucc.ca/\">Ukrainian Canadian Congress</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/careers/support-for-ukraine-based-scientists/24615\">Canada-Ukraine Science Partnership</a></li>\n</ul></div>\n      "
}