{
  "path": "/en/news/readouts/2021/01/21/prime-minister-justin-trudeau-holds-25th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 25th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau held the twenty-fifth call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>Canada’s Ambassador to the United States, Kirsten Hillman, provided an update to First Ministers on Canada-U.S. relations following the inauguration of Joe Biden as President of the United States. The Prime Minister reiterated his disappointment with the decision on Keystone XL, and emphasized that the federal government has engaged with the new administration in support of the project. He noted that workers in Alberta, Saskatchewan, and across Canada will always have the federal government’s support. First Ministers discussed their priorities for engaging the new administration and the Prime Minister noted the importance for all First Ministers to work together to defend Canadian interests, protect and create jobs, and support our industries and businesses. The Team Canada approach will continue to be instrumental to advance our priorities toward economic growth, climate change, and clean jobs. The Prime Minister highlighted that he will work to deepen the relationship with our most important trading partner and ally, and will continue to advocate for Canada’s interests with the new administration. The Prime Minister thanked premiers for their close collaboration on Canada-U.S. relations.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 situation. The Prime Minister emphasized the importance of maintaining public health measures to avoid a third wave of the pandemic. The Prime Minister reiterated the government’s commitment to support provinces and territories as they manage the outbreak and continue to closely monitor the border to keep Canadians safe.</p>\n\n<p>The Prime Minister provided an update on the vaccine rollout. First Ministers discussed the recent announcement by Pfizer that they were temporarily delaying their shipments of the vaccine to Canada and to other countries. The Prime Minister noted that he was assured during a call with the CEO of Pfizer that the company would honour its contract to provide Canada with four million doses of the vaccine by the end of March. He emphasized that, despite this delay, we are on track to ensure every Canadian who wants a vaccine by the end of September can get one. The Prime Minister highlighted that Health Canada continues to work diligently on the review of new vaccines. As we approach the spring, all jurisdictions need to work together to ensure a continued smooth rollout.</p>\n\n<p>First Ministers also discussed the importance of avoiding all non-essential travel, domestic or international, and enhancing border screening measures for returning travellers. While the measures enacted since March have reduced the number of travellers, the Prime Minister raised his ongoing concern with people choosing to travel for non-essential reasons. He assured premiers that the federal government will not hesitate to implement new measures to enhance screening and reduce the numbers of travellers. He noted that the government continues to monitor the potential importation of the newly identified variants of the virus. First Ministers discussed a range of measures that could be considered to reduce the importation of COVID-19 in Canada. The Prime Minister noted that, following Canada’s lead, the U.S. will soon be requiring all travellers to quarantine upon entering the country. He reiterated his commitment to work closely with provinces and territories to do whatever is necessary to keep Canadians safe.</p>\n\n<p>All First Ministers firmly reiterated their commitment to a collaborative approach to fighting COVID-19. As the vaccine rollout continues, they emphasized the need to continue closely coordinating efforts to protect Canadians and limit the increase in cases across the country.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/07/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address\">Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-inauguration-joe-biden-president-united\">Statement by the Prime Minister of Canada on the inauguration of Joe Biden as President of the United States of America</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-united-states-decision-keystone-xl\">Statement by the Prime Minister of Canada on the United States’ decision on the Keystone XL project</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/01/new-pre-departure-covid-19-testing-requirements-come-into-effect-for-all-air-travellers-flying-into-canada.html\">New pre-departure COVID-19 testing requirements come into effect for all air travellers flying into Canada</a></li>\n</ul></div>\n      "
}