{
  "path": "/en/news/statements/2017/04/10/statement-prime-minister-canada-passover",
  "pageTitle": "Statement by the Prime Minister of Canada on Passover | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the occasion of Passover:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Tonight at sundown, Jewish communities across Canada and around the world will observe the beginning of Passover.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The eight-day festival celebrates the liberation of the Israelites from slavery in ancient Egypt. It is a time to reaffirm our commitment to face fear with hope, to choose unity over division, and to have faith in the better days that lie ahead.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Passover story of redemption – of a people’s triumph over even the deepest bondage and oppression – reminds us to look to each other for strength and hope.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we celebrate the strength and perseverance of the Jewish people, who have survived and triumphed over unspeakable persecution. We reaffirm our commitment to stand against anti-Semitism and other forms of hatred and discrimination, and to work together to make our world a better place for all.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, as we celebrate the 150th anniversary of Confederation, let us take the opportunity to honour the many cultures, traditions, and beliefs that make Canada such a wonderful place to live. Jewish Canadians have made enormous contributions to Canada and have helped make it the strong and diverse country it is today.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of our family, Sophie and I offer our best wishes to all those observing Passover in Canada and around the world.&nbsp; </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Chag Pesach Sameach!”</span></p></div>\n      "
}