{
  "path": "/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-president-mexico-andres-manuel-lopez",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Mexico Andrés Manuel López Obrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Mexico, Andrés Manuel López Obrador, on the margins of the North American Leaders’ Summit in Washington, D.C., United States.</p>\n\n<p>The Prime Minister and the President exchanged views on Canada and Mexico’s national priorities. The Prime Minister highlighted the importance of finishing the fight against COVID-19, getting the job done on vaccines, and building an economic recovery that works for everyone. They emphasized the need to raise ambition in the fight against climate change, ensure greater inclusion of all people – particularly Indigenous peoples – and create good middle class jobs for Canadians and Mexicans alike. They also discussed the important contributions that Canadian investments make to the Mexican economy, including in the transportation, energy, and mining sectors, and committed to continue working together on shared priorities.</p>\n\n<p>Prime Minister Trudeau and President López Obrador underscored the importance of economic relations between their two countries, anchored in the Canada-United States-Mexico Agreement (CUSMA). The leaders agreed to maintain close cooperation on resilient supply chains to foster national security and strengthen capacity to respond to emergencies between Canada, Mexico, and the United States. They underscored the value and importance of an integrated North American economy, and discussed furthering cooperation on hydro-electric power. They discussed the importance of promoting a predictable trade and investment environment that supports economic prosperity and provides good jobs in both countries.</p>\n\n<p>The two leaders reaffirmed the deep and broad relationship between Canada and Mexico, which is built on common interests and deep people-to-people ties. They discussed their shared commitment to advancing on the path of reconciliation with Indigenous peoples in Canada and in Mexico, and looked forward to continuing the dialogue. They acknowledged the need to address inequality and racial discrimination, and combat all forms of discrimination and hatred.</p>\n\n<p>The Prime Minister and the President discussed their feminist foreign policies, and ways to promote feminist policies in Latin America and the Caribbean.&nbsp;Prime Minister Trudeau recognized Mexico’s leadership on addressing the impacts of COVID-19 on women and girls, and looked forward to future collaboration to overcome inequalities in the care economy.</p>\n\n<p>Prime Minister Trudeau and President López Obrador discussed their expectations and shared priorities in advance of the North American Leaders’ Summit.&nbsp;They agreed to work together to encourage greater leadership and ambition on global health security, economic competitiveness, and migration in the hemisphere, and agreed to have their ministers and officials work together to further expand bilateral cooperation.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement (CUSMA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/30/prime-minister-announces-measures-advance-gender-equality-worldwide\">Prime Minister announces measures to advance gender equality worldwide</a></li>\n</ul></div>\n      "
}