{
  "path": "/en/news/news-releases/2016/01/22/prime-minister-trudeau-underlines-canadas-commitment-gender-parity",
  "pageTitle": "Prime Minister Trudeau underlines Canada’s commitment to gender parity at World Economic Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, today took part in a panel on gender parity where participants discussed how the world can work together to achieve progress towards equality.</p>\n<p>During the session, the Prime Minister shared Canada’s vision for the advancement of women’s rights with other leading decision-makers, including: Melinda Gates, Co-Chair of the Bill &amp; Melinda Gates Foundation; Sheryl Sandberg, Chief Operating Officer and Member of the Board, Facebook; Jonas Prising, Chairman and Chief Executive Officer of ManpowerGroup; and Zhang Xin, Chief Executive Officer and Co-Founder, SOHO China.</p>\n<p>The discussion also focused on how public policies affect men and women differently, and looked for opportunities to further advance gender equality in the rapidly shifting global economy.</p>\n<p><strong>Quote</strong></p>\n<p>“The strength of any society depends on the full participation of all its citizens, including women. Ensuring gender parity and the advancement of women’s rights should be a given in 2016. I have made clear Canada’s commitment to gender parity—it remains a priority for our government domestically, as well as internationally.”<br>- Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;</p>\n<p><strong>Quick Facts:</strong></p>\n<ul>\n<li>Canada is a world leader in the promotion and protection of women’s rights and gender equality. These issues are central to Canada’s foreign and domestic policies.</li>\n<li>Canada is committed to the view that gender equality is not only a human rights issue, but is also an essential component of sustainable development, social justice, peace, and security.</li>\n<li>Canada has been a world leader in integrating gender equality analysis into its international development programs.</li>\n</ul></div>\n      "
}