{
  "path": "/en/news/readouts/2020/06/01/prime-minister-justin-trudeau-speaks-sultan-oman-haitham-bin-tariq-al-said",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Sultan of Oman Haitham bin Tariq Al-Said | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Sultan of Oman, Haitham bin Tariq Al-Said.</p>\n\n<p>The two leaders discussed the global trajectory of COVID-19, as well as its health, social and economic impacts. They spoke about the latest developments in Canada and Oman, and agreed on the need to work together toward a coordinated global approach to ensure the health and safety of all citizens.&nbsp;They also agreed on the importance of cooperation when it comes to vaccines and treatments for COVID-19, and discussed measures to build economic resilience and ensure a sustainable recovery.</p>\n\n<p>The two leaders spoke about political developments in the Gulf region and the importance of promoting peace and security in the region, including in Yemen.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/saudi_arabia-arabie_saoudite/bilateral_relations_bilaterales/canada-oman.aspx?lang=eng\">Canada-Oman Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}