{
  "path": "/en/news/statements/2018/10/14/statement-prime-minister-small-business-week",
  "pageTitle": "Statement by the Prime Minister on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Small Business Week, which runs from October 14 to 20, 2018:</p><p>“This week, we celebrate the backbone of Canada’s economy and the cornerstone of our communities – small businesses.</p><p>“Small businesses provide the goods and services we all depend on and create millions of jobs across the country. At the heart of every small business is an entrepreneur who has worked tirelessly to transform imagination into reality.</p><p>“Few people work harder than small business owners, and they deserve a government that also works for them. The Government of Canada has taken several steps to create the right conditions for small and medium-sized businesses to succeed. We recently lowered the small business tax rate to 10 per cent, and we will lower it again next year to 9 per cent. Come 2019, small businesses in Canada will benefit from a combined federal-provincial-territorial average income tax rate of 12.2 per cent – the lowest in the G7.</p><p>“Recent changes to Cabinet also place an even greater focus on supporting and growing small businesses, diversifying international trade, and eliminating trade barriers between provinces and territories. We know countless Canadian businesses depend on their ability to move goods quickly and efficiently, within our borders and beyond.</p><p>“With women starting close to half of all new businesses in Canada, we also know women’s success is vital to growing our economy and creating new jobs. In <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget&nbsp;2018</a>,we introduced the <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a> to help more women start their own businesses, and provide women entrepreneurs with greater access to financing, talent, networks, export services and opportunities.</p><p>“On behalf of the Government of Canada, I invite all Canadians to celebrate our small business owners and entrepreneurs, and to recognize their hard work, determination, and ambition – and the invaluable role they play in Canada’s prosperity and success.”</p></div>\n      "
}