{
  "path": "/en/news/news-releases/2018/05/11/new-rail-bypass-support-recovery-and-reconstruction-lac-megantic",
  "pageTitle": "New rail bypass to support recovery and reconstruction in Lac-Mégantic | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>No community should ever have to experience what Lac-Mégantic went through on July&nbsp;6, 2013. We remember the 47 people who died and stand with all those whose lives were irreparably changed.</p><p>Many people in the community face ongoing effects of trauma and loss. Because of the unique nature of this tragedy, and to help more people in the Lac-Mégantic community heal and rebuild their lives, the Prime Minister, Justin Trudeau, today announced that the Government of Canada and the Government of Quebec have signed an agreement-in-principle to jointly fund the rail bypass project.</p><p>The 12.8 kilometre route was selected based on a feasibility study managed by the municipality of Lac-Mégantic. The federal government has also reached an agreement with the Central Maine &amp; Quebec Railway, the project proponent, which will also own and operate the new rail infrastructure.</p><p>The Government of Canada will continue to work closely with Lac-Mégantic, the neighbouring municipalities of Frontenac and Nantes, the Government of Quebec, and other stakeholders to complete this important project, and support the community as it rebuilds itself once again into a beautiful, vibrant place to live, work, and visit.</p><h2>Quote</h2><blockquote><p>“Hope and resilience have come to define the people of Lac-Mégantic. For nearly five years, they have worked incredibly hard to recover and rebuild, and create a better future for their community. Today, we take another step forward. And while we know there are some wounds that can never heal, we sincerely hope this new rail bypass marks a new beginning for the people of Lac-Mégantic.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada will fund 60 per cent of the total cost of the rail bypass project.</li><li>The Transportation Safety Board of Canada completed an exhaustive investigation following the derailment in Lac-Mégantic and published its findings and recommendations to help ensure an accident like this does not happen again.</li><li>The Government of Canada is working to address the Transportation Safety Board’s recommendations and has made significant progress. We also continue to carefully monitor the safety of railway activities and the transportation of all dangerous goods in Canada.</li><li>The Government of Canada provided financial support for the rail bypass feasibility study, which was managed by the municipality of Lac-Mégantic and conducted by the engineering firm AECOM.</li><li>The study recommended a 12.8 kilometre rail bypass at an estimated cost of $133 million. The study assessed technical characteristics, social impacts, territorial planning, environmental considerations, and grade crossings and culverts. The next phase of the study will clarify the cost for the rail bypass.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.tc.gc.ca/eng/mediaroom/infosheets-menu-7564.html\">Measures to enhance railway safety and the safe transportation of dangerous goods</a></li><li><a href=\"https://www.canada.ca/en/transport-canada/news/2018/01/railway_bypass_thegovernmentofcanadaisdoingitspart.html\">Railway bypass: the Government of Canada will do its part</a></li></ul></div>\n      "
}