{
  "path": "/en/news/news-releases/2023/03/21/prime-minister-announces-mandate-of-independent-special-rapporteur",
  "pageTitle": "Prime Minister announces mandate of Independent Special Rapporteur | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking action to keep our democracy strong and stable, ensure our electoral system is safe from outside threats, and uphold Canadians’ trust in our democratic institutions.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the mandate of the Independent Special Rapporteur, the Right Honourable David Johnston, whose appointment was announced on March 15, 2023, as part of a suite of measures to help protect the integrity of Canada’s democracy. This follows work with Mr. Johnston to finalize his mandate for the role.</p>\n\n<p>As Independent Special Rapporteur, Mr.&nbsp;Johnston is being tasked with assessing the extent and impact of foreign interference in Canada’s electoral processes, including by examining information related to the 2019 and 2021 federal elections to determine what the government did to defend Canada against electoral interference. Building on the work of the National Security and Intelligence Committee of Parliamentarians (NSICOP) and the National Security and Intelligence Review Agency (NSIRA), he will identify any outstanding issues requiring attention, with a view to uphold Canadians’ confidence in our democratic institutions and electoral processes. Mr.&nbsp;Johnston is to recommend any additional mechanisms or transparent processes, such as a formal public inquiry, he deems necessary to reinforce Canadians’ confidence in the integrity of our democratic institutions by May 23, 2023. Additionally, he will identify innovative approaches and improvements in the way public agencies work together to combat foreign interference in our electoral processes.</p>\n\n<p>Mr.&nbsp;Johnston will submit regular reports to the Prime Minister, which will also be shared with Leaders of the Opposition and made available to Canadians. To fulfill this mandate, he will be given complete access to any relevant records and documents, classified or unclassified. He will consult and work with institutions, agencies, and officials across the federal government – including the Communications Security Establishment, the Canadian Security Intelligence Service, the Privy Council Office, and Elections Canada – as well as political parties represented in the House of Commons. He is expected to complete his review by October 31, 2023.</p>\n\n<p>The Government of Canada will continue to work to safeguard our electoral processes, protect them from foreign interference, and enhance Canadians’ faith in our democracy, now and for future generations. Canada is and will remain one of the strongest and most stable democracies in the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians should have confidence in the democratic systems that serve them. As Independent Special Rapporteur, Mr.&nbsp;Johnston will play a crucial role in reinforcing the integrity of and upholding Canadians’ confidence in our democratic processes, and I look forward to receiving his recommendations on how we can keep taking steps to ensure Canada is protected against any attempts at undermining our democracy.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The Right Honourable David Johnston is an accomplished Canadian public servant and law professor. He served as the 28th Governor General of Canada from 2010 to 2017, an important role in Canada’s democracy.</li>\n\t<li>The announcement of an Independent Special Rapporteur was part of a series of measures announced on March 6, 2023 to take further action on foreign interference and strengthen Canadians’ confidence in our democracy. These also included:\n\t<ul class=\"bulletOutline\"><li>Asking the National Security and Intelligence Committee of Parliamentarians (NSICOP) to complete a review of the state of foreign interference in federal electoral processes;</li>\n\t\t<li>Asking the National Security and Intelligence Review Agency (NSIRA) to complete a review of how Canada’s national security agencies handled the threat of foreign interference during the 43rd and 44th federal general elections;</li>\n\t\t<li>Launching public consultations to guide the creation of a Foreign Influence Transparency Registry in Canada to ensure transparency and accountability from people who advocate on behalf of a foreign government and ensure communities who are often targeted by attempts at foreign interference are protected;</li>\n\t\t<li>Establishing a new National Counter Foreign Interference Coordinator in Public Safety Canada to coordinate efforts to combat foreign interference;</li>\n\t\t<li>Developing a plan to address outstanding recommendations from the NSICOP, the independent assessment of the Critical Election Incident Public Protocol (Rosenberg Report), and other reviews on these matters, within 30 days; and</li>\n\t\t<li>Investing $5.5&nbsp;million in the Canadian Digital Media Research Network to strengthen the capacity of civil society partners to counter disinformation.</li>\n\t</ul></li>\n\t<li>Since 2015, the Government of Canada has taken significant action to protect our democracy and our institutions from foreign interference. These actions include:\n\t<ul class=\"bulletOutline\"><li>Creating the National Security and Intelligence Committee of Parliamentarians (NSICOP), made up of Members of Parliament from each party and Senators with top-secret security clearance to review national security and intelligence activities across the Government of Canada;</li>\n\t\t<li>Creating the National Security and Intelligence Review Agency (NSIRA), made up of top independent experts, to strengthen independent scrutiny and accountability of national security agencies in Canada;</li>\n\t\t<li>Establishing the Critical Election Incident Public Protocol (the Protocol), which is administered by a panel of the most senior federal public servants who, working with national security agencies, are responsible for communicating with Canadians in the event of an incident or series of incidents that threaten the integrity of a federal election;</li>\n\t\t<li>Creating the Security and Intelligence Threats to Election (SITE) Task Force, composed of officials from the Communications Security Establishment, the Canadian Security Intelligence Service, the Royal Canadian Mounted Police, and Global Affairs Canada. The SITE Task Force works to identify and prevent covert, clandestine, or criminal activities from influencing or interfering with the electoral process in Canada; and</li>\n\t\t<li>Establishing the Rapid Response Mechanism (RRM) at the G7 Summit in Charlevoix to help G7 countries identify and respond to diverse and evolving foreign threats to democracy.</li>\n\t</ul></li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/democratic-institutions/services/independent-special-rapporteur.html\">Independent Special Rapporteur</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/15/prime-minister-announces-independent-special-rapporteur-to-help-protect\">Prime Minister announces Independent Special Rapporteur to help protect the integrity of Canada’s democracy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/06/taking-further-action-foreign-interference-and-strengthening\">Taking further action on foreign interference and strengthening confidence in our democracy</a></li>\n\t<li><a href=\"https://www.nsicop-cpsnr.ca/index-en.html\">National Security and Intelligence Committee of Parliamentarians</a></li>\n\t<li><a href=\"https://nsira-ossnr.gc.ca/\">National Security and Intelligence Review Agency</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Protecting democracy</a></li>\n</ul></div>\n      "
}