{
  "path": "/en/news/news-releases/2018/03/21/prime-minister-welcomes-upss-expansion-canada",
  "pageTitle": "Prime Minister welcomes UPS’s expansion in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In today’s economy, delivery services are essential to connect people and make businesses competitive. Canada welcomes investments from the private sector to create good, well-paying middle class jobs, and generate new opportunities for more people to succeed.</p><p>The Prime Minister, Justin Trudeau, today welcomed UPS’s announcement of a $500&nbsp;million investment that will create more than 1,000 new, middle class jobs in Canada. UPS will also expand its facilities across the country and upgrade its technology so that Canadian consumers can receive products faster and in an environmentally responsible way.</p><p>The construction of a $125-million, 180,000 square-foot automated sorting facility – UPS’s first in Canada – has already started at the company’s Montréal hub. This facility, along with investments in new automated sorting technology and compressed natural gas vehicles, will help UPS reach its sustainability goal of running half of its Canadian fleet on alternative fuel by the end of 2018.</p><h2>Quote</h2><blockquote><p>“UPS is the kind of company we want to see flourish in Canada, one that creates better opportunities for hard working Canadians – today and well into the future. I had the opportunity to meet UPS Chief Executive Officer, Mr. David Abney, in Davos during the World Economic Forum annual meeting earlier this year, and I am thrilled they are investing in our country, our economy, and our people.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>UPS's first international expansion was in Canada over 42 years ago, and our country was chosen this year as the location for the company’s first international management conference, which is being held in Toronto, from March 19-21.</li><li>UPS employs more than 12,000 employees at 63 facilities across Canada. UPS has centres in Vancouver, Calgary, Winnipeg, Toronto, Hamilton, Ottawa, and Montréal.</li><li>Prime Minister Trudeau met with David Abney, Chairman and Chief Executive Officer of UPS, on January 23, 2018, where they discussed UPS’s history in Canada, the company’s goals moving forward, as well as investment opportunities.</li><li>This announcement is the second example of global companies choosing Canada to expand their business and create jobs this week. On Monday, Minister of Innovation, Science, and Economic Development, Navdeep Bains, announced a nearly $400-million investment in Canada by way of the ENCQOR project that will secure 4,000 new jobs in Quebec and Ontario, and create thousands more.</li><li>The Government of Canada is committed to deepening Canada’s trade relationships with modern, progressive free trade agreements, including a firm commitment to advancing a new and modernized North American Free Trade Agreement.</li><li>The Government of Canada recently launched Invest in Canada, a new federal organization dedicated to attracting job-creating investment and simplifying the process for global businesses looking to make Canada their new home.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.budget.gc.ca/2018/docs/themes/growth-croissance-en.html\">Budget 2018: Strengthening trade</a></li><li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2018/03/new-canadian-partnership-in-next-generation-wireless-technology.html\">New Canadian partnership in next-generation wireless technology</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2018/03/government-of-canada-launches-invest-in-canada-to-attract-global-investment-and-create-jobs.html\">Government of Canada launches Invest in Canada to attract global investment and create jobs</a></li><li><a href=\"https://www.pressroom.ups.com/pressroom/ContentDetailsViewer.page?ConceptType=PressReleases&amp;id=1521646219135-594\">UPS To Invest $500 Million In Canada And Create More Than 1,000 New Jobs</a></li></ul></div>\n      "
}