{
  "path": "/en/news/readouts/2022/02/18/prime-minister-justin-trudeau-speaks-prime-minister-pedro-sanchez-spain",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Pedro Sánchez of Spain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Spain, Pedro Sánchez.</p>\n\n<p>Prime Minister Trudeau shared his deepest condolences for the tragic loss of life that occurred when the Spanish fishing vessel Villa de Pitanxo sank off the coast of Newfoundland and Labrador earlier this week.</p>\n\n<p>The two leaders discussed the situation in Ukraine, and shared their concerns over Russia’s aggressive and destabilizing actions in and around the country. They stressed the importance of a diplomatic resolution to the current tensions, and noted their shared commitment to the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>Prime Minister Trudeau underlined the strength and unity of the Alliance, and the importance of continued coordination and dialogue between allies and partners. The two leaders emphasized that any further military incursion into Ukraine would have severe costs and consequences, including through coordinated sanctions.</p>\n\n<p>The two leaders stressed the importance of the upcoming North Atlantic Treaty Organization’s (NATO) leaders’ summit, to be hosted by Spain in June 2022. They also discussed the need for progressive leaders to work together in defence of democratic values.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez agreed to stay in touch and continue working together on shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada-Spain Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n</ul></div>\n      "
}