{
  "path": "/en/news/statements/2022/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p>\n\n<p>“Defending human rights and democracy has always been, and will continue to be, a priority for Canada – both here at home and around the world. Today, on <a href=\"https://www.un.org/en/observances/human-rights-day\">Human Rights Day</a>, we reaffirm our commitment to building a world where everyone is treated with dignity and respect, regardless of who they are or where they live.</p>\n\n<p>“Human Rights Day marks the anniversary of the United Nations (UN) General Assembly’s adoption of the <a href=\"https://www.un.org/en/about-us/universal-declaration-of-human-rights\">Universal Declaration of Human Rights</a>, which enshrines our common belief that all human beings are born free and equal in dignity and rights. This year’s theme, ‘Dignity, Freedom, and Justice for All’ invites us to continue working together to ensure no one is left behind.</p>\n\n<p>“Canada continues to play an active role in global human rights efforts, and will always denounce abuses no matter where they occur. Just yesterday, we took further action against the Russian, Iranian, and Myanmar regimes for trampling on people’s fundamental rights. These measures impose restrictions against a total of 67 individuals and 9 entities that are complicit in human rights violations around the world, and they build on the work Canada has already done with our international partners to promote justice and maintain pressure on perpetrators of violence, oppression, and brutality.</p>\n\n<p>“Here at home, this year marks the 40th anniversary of the <em>Canadian Charter of Rights and Freedoms,</em> which protects the rights and freedoms that define who we are as Canadians. For 40 years, the Charter has allowed us to express our individuality and celebrate our differences.</p>\n\n<p>“We recognize though, that there is still more work to do to build a country where everyone has equal opportunity to succeed. This year, we banned so-called conversion therapy, a cruel, harmful, and degrading practice with no scientific basis that has caused lasting pain and trauma for 2SLGBTQI+ communities. We also launched <a href=\"https://women-gender-equality.canada.ca/en/free-to-be-me/federal-2slgbtqi-plus-action-plan/federal-2slgbtqi-plus-action-plan-2022.html\">Canada’s first Federal 2SLGBTQI+ Action Plan</a><em>,</em>&nbsp;a whole-of-government approach to achieving a future where everyone in Canada is truly free to be who they are and to love who they love.</p>\n\n<p>“We are also working with Indigenous partners to deliver lasting solutions to the issues facing First Nations, Inuit, and Métis, and to ensure the recognition, protection, and fulfilment of their inherent human rights. The ongoing work to implement in close collaboration with Indigenous partners the <em>United Nations Declaration on the Rights of Indigenous Peoples Act </em>directly advances this commitment. This also includes working in partnership with Indigenous Peoples to reform child and family services and ensure Indigenous children can remain with their families in their communities, to provide access to affordable housing, and to create safe spaces for Indigenous women, girls, 2SLGBTQI+ peoples, and their families. The government and Inuit leaders also endorsed the historic <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1650556354784/1650556491509\">Inuit Nunangat Policy</a> to guarantee Inuit self-determination. The policy is intended to guide the design, development and delivery of all new or renewed federal policies, programs, services and initiatives that apply in Inuit Nunangat or benefit Inuit. We remain fully committed to implementing the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1524494530110/1557511412801\">Truth and Reconciliation Commission’s Calls to Action</a> and <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1622233286270/1622233321912\">Federal Pathway to Address Missing and Murdered Indigenous Women, Girls, and 2SLGBTQQIA+ People</a> to build a renewed relationship with Indigenous Peoples and advance reconciliation based on the affirmation of rights, respect, and partnership.</p>\n\n<p>“The discussion around human rights, dignity, and freedom must include gender equality and the empowerment of women, girls, and 2SLGBTQI+ peoples in all their diversity. Women everywhere should have autonomy over their bodies. In Canada, we all have the right to make choices for our own bodies, and we are working to strengthen access to safe and inclusive sexual and reproductive health services for everyone across the country. Yet, even in 2022, gender-based violence (GBV) continues to be a human rights concern in our country. That is why we worked with provincial and territorial governments to endorse the <a href=\"https://femmes-egalite-genres.canada.ca/en/ministers-responsible-status-women/national-action-plan-end-gender-based-violence.html\">National Action Plan to End Gender-Based Violence</a> this past fall. This Action Plan will provide concrete solutions to make progress toward ending GBV in Canada once and for all.</p>\n\n<p>“On this Human Rights Day, we reflect on the progress we have made and the work still to be done, here in Canada and around the world, to ensure everyone’s inherent and inalienable human rights are protected. Together, we will build a better, safer future for everyone.”</p></div>\n      "
}