{
  "path": "/en/news/statements/2021/03/20/statement-prime-minister-international-day-la-francophonie",
  "pageTitle": "Statement by the Prime Minister on the International Day of La Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of La Francophonie:</p>\n\n<p>“Today, on the <a href=\"https://www.francophonie.org/\">International Day of La Francophonie</a>, we join Francophones and Francophiles in Canada and around the world to celebrate the French language and the diversity of our Francophone culture and heritage. This day is also an opportunity to celebrate our Francophone communities which, throughout our history, have played an important role in making Canada a dynamic, more inclusive and prosperous country.</p>\n\n<p>“French is one of the two official languages of Canada. It is not only an essential part of our identity and our culture, but also an important advantage that allows us to forge links with Francophone communities around the world.</p>\n\n<p>“A little over 50 years ago, we adopted the <em>Official Languages Act</em>, recognizing the equal status of English and French in the country. Since then, many things have changed and more concrete measures must be taken to protect our beautiful French language.</p>\n\n<p>“To ensure the long-term vitality of the French language and further enhance its prominence in Canada, we are proposing targeted actions and will be tabling a bill to modernize the <em>Official Languages Act </em>by the end of the year. These actions include improving access to French immersion classes across the country. We will also protect French as a language in the workplace under federal jurisdiction in Quebec, and in regions with a strong Francophone presence. We will require that all judges appointed to the Supreme Court be bilingual, and will also protect the rights and support the institutions of our official language minority communities.</p>\n\n<p>“Canada’s engagement within the International Francophonie, starting with the Organisation internationale de la Francophonie, allows us to proudly showcase our Francophone heritage and our attachment to the French language. We look forward to continuing to work with our Francophone partners to protect and promote French around the world, and to advance our common values, such as peace, democracy, and respect for human rights, and gender equality.</p>\n\n<p>“On behalf of the Government of Canada, I wish all those celebrating, here at home and around the world, a wonderful International Day of La Francophonie.”</p></div>\n      "
}