{
  "path": "/en/news/news-releases/2021/05/28/prime-minister-announces-assistance-palestinians-affected-recent",
  "pageTitle": "Prime Minister announces assistance for Palestinians affected by the recent violence in Gaza and the West Bank | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada firmly believes that the Palestinian and Israeli peoples have a right to live in peace, security, and dignity – without fear and with their human rights respected. The Government of Canada is supporting efforts to ensure that emergency relief quickly reaches Palestinian civilians facing urgent humanitarian needs in Gaza, as well as those affected by violence in the West Bank.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $25 million in funding to support Palestinian civilians in the region. These funds will be provided to United Nations (UN) agencies and other organizations with proven track records of delivering assistance effectively and in accordance with Canadian requirements.</p>\n\n<p>Canada’s aid will include an immediate $10&nbsp;million for urgent food assistance, shelter, water, sanitation and hygiene, as well as for psychosocial support for the most vulnerable, including children. The funding includes an additional $10&nbsp;million to support humanitarian and rebuilding efforts to lay the foundation for sustainable recovery, such as vital medical infrastructure and measures to help families earn a living. The Government of Canada will also dedicate up to $5&nbsp;million for peacebuilding initiatives that advance the goal of a comprehensive, just, and lasting peace in the Middle East.</p>\n\n<p>This support builds on Canada’s previous commitments in the region. Ongoing support includes humanitarian assistance to help meet basic needs, as well as development assistance to improve socio-economic conditions for Palestinians. Canada also contributes to initiatives to promote peace and stability and to support dialogue and cooperation between Israelis and Palestinians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The recent violence in the region is alarming – we have all seen the disturbing images of displaced civilians, loss of life, and pain inflicted on families. Today’s funding will go directly to experienced organizations which will help the most vulnerable Palestinian civilians cope with the impacts of the recent conflict. Canada will continue to support peacebuilding efforts that contribute to achieving a comprehensive, just, and lasting peace in the Middle East.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement will provide timely humanitarian assistance through experienced partners, as well as support for Gazans to recover from the damage caused by the recent conflict. We are also providing support for peacebuilding initiatives, recognizing that in order to move toward peace in the region, we must also build bridges between communities to address this conflict.”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of International Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“For&nbsp;too long, this conflict has impacted communities across the region and inflicted hardship on innocent people. With youth and future generations top of mind, we are committed to work alongside Israelis, Palestinians, and other partners to build the foundation for a lasting peace.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Marc Garneau,&nbsp;Minister of Foreign Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Before the recent conflict, the UN estimated that approximately 1.57 million people in Gaza, out of a total population of 2&nbsp;million, were in need of humanitarian assistance.</li>\n\t<li>Last year, to address the global COVID-19 pandemic, Canada committed exceptional additional funding for UN humanitarian appeals in support of Palestinians, in addition to a two-year commitment of humanitarian assistance to help particularly vulnerable Palestinians.</li>\n\t<li>In December 2020, Canada committed funding of $90&nbsp;million over three years to respond to the rising needs of vulnerable Palestinian refugees.</li>\n\t<li>Canada’s international assistance in the West Bank and Gaza reinforces the goal of a two-state solution and is aligned with Palestinian needs. Canada exercises enhanced due diligence for all humanitarian and development assistance funding for Palestinians. This work includes ongoing oversight, regular site visits, a systematic screening process, and strong anti-terrorism provisions in funding agreements.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/where-ou/west_bank_gaza-cisjordanie_gaza.aspx?lang=eng\">Canadian international assistance in the West Bank and Gaza</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/statement-by-canada-following-un-security-council-session-on-the-devastating-violence-in-israel-the-west-bank-and-gaza.html\">Statement by Canada following UN Security Council session on the devastating violence in Israel, the West Bank, and Gaza</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-continues-its-support-of-palestinian-refugees.html\">Canada continues its support of Palestinian refugees</a></li>\n</ul></div>\n      "
}