{
  "path": "/en/news/statements/2020/05/01/statement-prime-minister-loss-six-canadian-armed-forces-members",
  "pageTitle": "Statement by the Prime Minister on the loss of six Canadian Armed Forces members | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the loss of six Canadian Armed Forces members, near Greece:</p>\n\n<p>“Today, with the call to end the search and rescue mission, I join all Canadians in mourning the loss of six Canadian Armed Forces members in the CH-148 Cyclone helicopter accident near Greece earlier this week.</p>\n\n<p>“Sub-Lieutenant Abbigail Cowbrough, Captain Brenden Ian MacDonald, Captain Kevin Hagen, Captain Maxime Miron-Morin, Sub-Lieutenant Matthew Pyke, and Master Corporal Matthew Cousins were lost in this tragic accident. Our thoughts are with all of the families and loved ones of these Canadian heroes, and with the entire Canadian Armed Forces, as they grieve this tragedy.</p>\n\n<p>“Every day these brave Canadians in uniform put themselves in harm’s way to keep our country and our citizens safe, and together we will honour their service to Canada and our closest allies. I express my deepest gratitude to all members of the Canadian Armed Forces, at home and overseas, for their dedicated service and sacrifice – our entire country is thankful. I also thank our NATO Allies who worked side-by-side with members of our Armed Forces to search for the fallen.</p>\n\n<p>“In challenging times, Canadians lean on one another. Together we will get through this tragedy, and never forget those who were lost.</p>\n\n<p>“We will continue to keep Canadians updated as the investigation progresses.</p>\n\n<p>“On behalf of the Government of Canada, I offer my heartfelt condolences to the families of these Canadian Armed Forces members. All Canadians share your grief, and we are here to support you in this difficult time.”</p></div>\n      "
}