{
  "path": "/en/news/statements/2020/06/03/statement-prime-minister-one-year-anniversary-final-report-national",
  "pageTitle": "Statement by the Prime Minister on the one-year anniversary of the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on the one-year anniversary of the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls:</p>\n\n<p>“One year ago today, the National Inquiry into Missing and Murdered Indigenous Women and Girls presented its final report – and shared with all Canadians the dark and painful experiences of violence against Indigenous women, girls, and LGBTQ and two-spirit people.</p>\n\n<p>“Today, we remember and honour those who were tragically taken from us, and the experiences of those whose lives have been forever changed by violence. We thank all who courageously spoke up during the National Inquiry’s work, reliving incredible pain to unearth important truths. As Canadians, we had to face the heartbreaking reality that we failed the Indigenous women, girls, and LGBTQ and two-spirit people who disappeared, suffered violence, or were killed – and that many of the same realities that led to these tragedies still exist today.</p>\n\n<p>“Ending this national tragedy through the co-development and implementation of a distinctions-based National Action Plan is an urgent priority for our government, and requires ongoing work with all partners. In the spirit of reconciliation, we are taking steps together to address the important issues identified in the National Inquiry’s report and the Calls for Justice. We passed legislation developed in collaboration with Indigenous partners to help protect their languages and cultures, and co-developed Indigenous child and family services legislation to ensure that Indigenous children remain with their family and community. We are providing financial support to communities so they can offer shelters and mental health services for women and children experiencing and escaping violence. We extended support to community-based and specialized services that provide assistance to the families of missing and murdered women, girls, and LGBTQ and two-spirit people. We are also working closely with Indigenous peoples and communities to support their efforts to respond to COVID-19 and its health, social, and economic impacts.</p>\n\n<p>“The National Inquiry has shown us the way forward. We know that there is still much more to do to end the systemic gender and racial discrimination that continues today. As we continue to walk the path of reconciliation, we will listen to the voices of families and survivors, as well as grassroots organizations and Indigenous leaders who work every day to advocate for their communities and keep them safe.</p>\n\n<p>“Everyone has a role to play to end violence and ensure the safety of Indigenous women, girls, and LGBTQ and two-spirit people. Together with families and survivors, First Nations, Inuit, and Métis people, Indigenous organizations, and provincial, territorial, and municipal partners, we will continue work and redouble our efforts to develop a truly National Action Plan to honour those we have lost, help their families heal, and protect current and future generations.”</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2020/06/statement-from-minister-bennett-minister-monsef-minister-lametti-minister-miller-minister-guilbeault-and-minister-blair-marking-the-one-year-annive.html\">Statement from ministers Bennett, Monsef, Lametti, Miller, Guilbeault and Blair marking the one-year anniversary of the Final Report from the National Inquiry into Missing and Murdered Indigenous Women and Girls</a></li>\n</ul></div>\n      "
}