{
  "path": "/en/news/readouts/2023/04/21/prime-minister-justin-trudeau-meets-mayor-london-josh-morgan",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of London Josh Morgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of London, Josh Morgan, to discuss shared priorities, including issues related to housing and homelessness, as well as mental health and addictions.</p>\n\n<p>The Prime Minister and the Mayor agreed that collaboration between all orders of government is needed to build more affordable housing. They discussed federal investments under the Housing Accelerator Fund that will provide funding for local governments to fast track the creation of 100,000 new homes across Canada.</p>\n\n<p>The two leaders also spoke of the links between health care and homelessness prevention, and discussed London’s approach in developing a whole-of-community response by working with frontline agencies, community support agencies, and the business and development community to create low-barrier hubs of primary care services, mental health services, and supportive housing.</p>\n\n<p>Prime Minister Trudeau and Mayor Morgan agreed to continue working together on these shared priority issues, including growing the economy, creating good middle-class jobs, and making life more affordable for people.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"/en/news/news-releases/2023/04/12/building-clean-economy-with-good-middle-class-jobs\">Building a clean economy with good middle-class jobs</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/03/17/building-more-homes-faster\">Building more homes, faster</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/housing-accelerator-fund\">Housing Accelerator Fund</a></li>\n</ul></div>\n      "
}