{
  "path": "/en/news/news-releases/2016/05/18/prime-minister-delivers-formal-komagata-maru-apology-house-commons",
  "pageTitle": "Prime Minister delivers formal Komagata Maru apology in House of Commons | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today delivered a formal statement of apology in the House of Commons for the Komagata Maru incident.</p>\n<p>On May 23, 1914, a steamship arrived in Vancouver carrying 376 passengers who had hopes for a new life in Canada. After a long journey from India, the majority of the passengers – who were of Sikh, Muslim, and Hindu origin – were denied entry into Canada due to the laws in existence at the time.</p>\n<p>Today, the Prime Minister delivered a formal apology in front of descendants of those directly affected by the incident. He emphasized that Canada’s rich diversity is a source of strength for our country and reaffirmed the government’s commitment to upholding the values – including multiculturalism – enshrined in the <em>Canadian Charter of Rights and Freedoms</em>.</p>\n<p><strong>Quotes</strong></p>\n<p>“Today – while knowing that no words can fully erase the pain and suffering experienced by the passengers – I offer a sincere apology on behalf of the government for the laws in force at the time that allowed Canada to be indifferent to the plight of the passengers of the Komagata Maru.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“The Komagata Maru incident is a stain on Canada’s past. But the history of our country is one in which we constantly challenge ourselves, and each other, to extend our personal definitions of who is a Canadian. We have learned, and will continue to learn, from the mistakes of our past. We must make sure to never repeat them.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}