{
  "path": "/en/news/statements/2021/07/26/gaa-ikidod-gaanada-ogimaa-ji-biindiganaad-gaanada-aki-mary-simon-30",
  "pageTitle": "Gaa-ikidod Gaanada Ogimaa ji-biindiganaad Gaanada Aki Mary Simon 30 aazha Gichi-ogimaakwen Gaa-giigidootamawaad | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gaanada Ogimaa Justin Trudeau noongom owe ikido ebiindiganaad Gaanada Aki oshki-Governor General, Gichi-ogimaakwen Gaa-giigidootamawaad Mary Simon:</p>\n\n<p>“Gaanada Aki gaa-ayaawaad nin-giigidootamawaag, ebiindiganag awe Mary Simon ji-inwaazod Gichi-ogimaakwen Ji-giigidootamawaad, aazha 30 edashiwaad.</p>\n\n<p>“Noonobot Eshkiimewakiing gii-dazhi-nitaawigi, giiwedinong Quebec, apane dash gaa-bimaadizid o-gii-anokiitawaa’ ini gaa-ayaanid imaa. Eshkiime’ obi-anokiitawaa’ apane go, eshkiime miinigoowiziwin gaye izhitwaawin, oshkaadiziig gaye aki, bi-gichi-inenimaa’ gaye gii-nitamiwi e-eshkiimewid ji-giigidootang Gaanada Aki agaamakiing.</p>\n\n<p>“Apane go odanokiiwining, bizhishig o-bi-gichi-inendaan babenak ji-izhi-bimaadizing, ji-bimaaji’idizong gaye ji-debinamang mino-bimaadiziwin. Gii-niigaanii e-anokaadang ji-mino-wiijiiwidiwaad eshkiimeg waasa giiwedinong bebakaan giiwedino-akiing gaa-onjiiwaad, agaamakiing gaye. Gaanada Aki Gichi-ogimaakwen E-giigidootamawaadgaye e-naagajitood Gaanada Aki Inaakonigewin gaye gaa-izhi-dibendaakokin izhichigewinan, ningikendaan weweni gi-ga-giigidootamaagonaan gakina gii-bebakaan ayaaying omaa akiing gaye agaamakiing, agye Gaanada Aki gaa-aabajichigaadegin&nbsp;izhigiizhwewinan. Gaye nin-gechinaawendam Gaanada Aki eniigaanishkang, ji-anokiid ji-ziidoshkawaad ini Gaanada Aki Zhimaaganisha’ gaa-gichi-anokiiwaad ji-mino-bimaadiziying omaa gidakiiminaang gaye giinawind.</p>\n\n<p>“Ningichi-inendaan owe gaa-izhiseg aaniish bi-zanagisemagan niibiwa gegoon omaa gidakiiminaang, gaa-bi-doodawindwaa nitam gaa-gii-ayaawaad omaa. Ningikendaan Gaanada Aki enitamiwid omaa e-ondakiid awe Gichi-ogimaakwen Gaa-giigidootamawaad gii-ga-wiiji’igonaan megwaa e-nagishkamang ini gaa-gii-izhi-zanagi’indwaa nitam gaa-gii-ayaawaad omaa, ji-gagwe-miinosijigaadeg gaye ji-mino-wiijiiwidiwaad gakina gaa-daawaad omaa.</p>\n\n<p>“Noongom dash gaa-giizhigak, giboozhoo’aanaan Gichi-ogimaakwe Anizibat II, Gaanada Aki gaa-giigidootang aazha 69 daso-biboon gaa-inwaazod e-giigidootawangid e-minwaadizid gaye gwayakwaadizid. Mii aazha 13 dasing e-nisidawinawaad Gichi-ogimaakwe owe Gaanada Akiing ji—giigidootamaagod apane 1952 gii-izhisenig gii-ogimaakwewid.</p>\n\n<p>“Ni-miigwechiwi’aa awe Mary Simon eya e-ikidod owe ji-inanokiid gaye dash niwiindamawaa e-minwendamaan e-doodang. Ninandomaag gakina Gaanada Aki gaa-ayaawaad ji-bagosendamowaad gaye ji-onji-jiikendamowaad owe e-izhisemagak gaye ji-wiiji’iwaad ji-inang awe ikwe weweni ji-doodang owe e-inanokiid Gaanada Aki ji-anokiitang aazha aaniish maawach ginwesh owe ayaamagan inwaazowin.”</p>\n\n<h2>Ge-izhi-maagonigeng Godak</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Gaanada Aki Gichi-ogimaa dibaajimo Gichi-ogimaakwe eya e-inendang ji-giigidootamaagod awiyan</a></li>\n</ul></div>\n      "
}