{
  "path": "/en/news/news-releases/2020/04/18/prime-minister-announces-support-indigenous-businesses",
  "pageTitle": "Prime Minister announces support for Indigenous businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Indigenous businesses provide jobs, goods, and services to communities, and are an important part of the Canadian economy. Right now, they are facing challenges and economic hardships due to COVID-19. That is why the Government of Canada is taking action to make sure that Indigenous business owners have access to the support they need to get through this crisis.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $306.8 million in funding to help small and medium-sized Indigenous businesses, and to support Aboriginal Financial Institutions that offer financing to these businesses.</p>\n\n<p>The funding will allow for short-term, interest-free loans and non-repayable contributions through Aboriginal Financial Institutions, which offer financing and business support services to First Nations, Inuit, and Métis businesses. These measures will help 6,000 Indigenous-owned businesses get through these difficult times.</p>\n\n<p>Today’s announcement is part of the Government of Canada’s COVID-19 Economic Response Plan. We will continue to monitor and respond to the wide-ranging impacts of COVID-19, and take additional actions as needed to protect the health and safety of Canadians and stabilize our economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We will always be there for Canadian businesses, and we are working hard to make sure that Indigenous business owners have the support they need during this period of uncertainty. Entrepreneurs are at the heart of communities right across the country, and we’re going to help them bridge to better times.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Businesses across Canada are being impacted by COVID-19 and the government is taking action. This targeted support will help First Nations, Inuit and Métis businesses have greater access to financing that will help them stay strong, so they can continue to grow and thrive when this crisis passes.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“We continue to work in close coordination with communities, Indigenous partners, and provinces and territories to ensure necessary support to everyone in Canada. Some Indigenous businesses who are already facing unique challenges, including being in rural or remote locations and having less access to capital, are disproportionately affected by this unprecedented situation. The support provided will allow for maximum flexibility in supporting local businesses, whether they be entrepreneurships, cooperative businesses, or any of the many industries across Canada to continue contributing to their communities.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Financial support for Indigenous businesses will be provided through Aboriginal Financial Institutions, and administered by the National Aboriginal Capital Corporations Association and the Métis capital corporations in partnership with Indigenous Services Canada.</li>\n\t<li>The funding will allow for interest-free loans, as well as non-repayable contributions, to help Indigenous businesses unable to access the government’s existing COVID-19 support measures. Additional funding will help Aboriginal Financial Institutions cover operational expenses, and help the National Aboriginal Capital Corporations Association increase its operational capacity.</li>\n\t<li>The National Aboriginal Capital Corporations Association is a network of 59 Aboriginal Financial Institutions providing a full range of financial services, loans, and grants to Indigenous entrepreneurs to start new and expand existing businesses.</li>\n\t<li>On March 18, 2020, the Government of Canada announced that it would provide $305 million for a new distinctions-based Indigenous Community Support Fund, to address immediate needs in First Nations, Inuit, and Métis communities.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1581964230816/1581964277298?fbclid=IwAR1Ws9I32Ljc_3C1H8KCuXIdnchni_7pvQ9UK1mxTb7turtHoq8vNxIJzec#chap4\">Coronavirus (COVID-19) and Indigenous communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}