{
  "path": "/en/news/statements/2021/07/16/apec-economic-leaders-statement-overcoming-covid-19-and-accelerating",
  "pageTitle": "APEC Economic Leaders’ Statement Overcoming COVID-19 and Accelerating Economic Recovery | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ol>\n\t<li>We, the APEC Economic Leaders met on 16 July 2021 to discuss the COVID-19 health and economic crisis and response. The pandemic continues to have a devastating impact on our region’s people and economies. Our efforts to diagnose and treat COVID-19 continue to be essential. But we will only overcome this health emergency by accelerating equitable access to safe, effective, quality-assured, and affordable COVID-19 vaccines. We recognise the role of extensive immunisation against COVID-19 as a global public good. To that end, we will redouble our efforts to expand vaccine manufacture and supply, support global vaccine sharing efforts, and encourage the voluntary transfer of vaccine production technologies on mutually agreed terms. We must ensure our health systems cover all people and have the resilience to cope with current and future shocks. We welcome the varied and continuous efforts as well as the contribution of additional resources across APEC to combat the pandemic. We are committed to realising our Putrajaya Vision of an open, dynamic, resilient and peaceful Asia-Pacific community by 2040, for the prosperity of all our people and future generations.</li>\n</ol>\n\n<h2>Strong, Balanced, Secure, Sustainable and Inclusive Growth</h2>\n\n<ol start=\"2\">\n\t<li>As we move beyond the immediate crisis, we will work to ensure all our people have the opportunities and resources they need to adapt to change – no one should be left behind. Noting the historic significance of the fiscal stimulus already provided, we have and will continue to support our economies for as long as necessary. Our Ministers are exchanging views on macroeconomic and structural policies to accelerate economic recovery in the region. We will target measures where they are needed to facilitate job creation and inclusive economic recovery, including actions that enable women to participate fully in the recovery. We will continue to promote seamless connectivity and resilient supply chains for all our businesses and people. In designing a sustainable recovery and aligned with global efforts, we reiterate the importance of economic policies, cooperation and growth that contribute to tackling climate change and other serious environmental challenges. We will continue to promote sustainable financing and quality infrastructure development and investment based on relevant APEC work.</li>\n</ol>\n\n<h2>Innovation and Digitalisation</h2>\n\n<ol start=\"3\">\n\t<li>Given the significant and diverse impact of COVID-19 on our people and businesses, now is a crucial time to pursue sound economic policies to sustain jobs, increase economic productivity, and advance innovation. Recognising some people and businesses will need to move into new sectors, we will work together on a growth-focused structural reform agenda that delivers inclusive, resilient, sustainable, and innovation-friendly outcomes. We will support our people to adapt to the future of work. We will harness innovation that enables our people and businesses, particularly MSMEs, to emerge stronger through decent work and increased opportunities. We will move forward together towards a digital future, strengthening digital infrastructure and technologies. We acknowledge the importance of cooperation on facilitating the flow of data and strengthening consumer and business trust in digital transactions. We will support measures designed to foster digital transformation and contribute to bridging the digital divide, including digital literacy and skills.</li>\n</ol>\n\n<h2>Trade and Investment</h2>\n\n<ol start=\"4\">\n\t<li>We underscore the essential role of trade and investment and an interconnected regional economy in tackling the impact of the COVID-19 pandemic and in enabling a strong economic recovery for all our people. Our Ministers are working to ensure the region’s supply chains support the safe and efficient distribution of COVID-19 vaccines and related goods. We are committed to working together to facilitate the flow of goods and services, especially those that most support our health and economic response at this critical time. We must pave the way for the safe resumption of cross-border travel, without undermining efforts to prevent the spread of COVID-19. We acknowledge the importance of a free, open, fair, non-discriminatory, transparent and predictable trade and investment environment, which can help combat the far-reaching impacts of the COVID-19 pandemic. We will advance economic integration in the region to facilitate recovery. At this critical juncture, the World Trade Organization should continue to demonstrate that global trade rules can support the recovery from the health and economic crisis, and we will work constructively to that end.</li>\n\t<li>We thank New Zealand for chairing and look forward to meeting again at the APEC Economic Leaders’ Meeting in November.</li>\n</ol>\n\n<p>Haumi ē, Hui ē, Tāiki ē.<br>\nJoin, Work, Grow. Together.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2021/07/16/prime-minister-meets-apec-economic-leaders\">Prime Minister meets with APEC Economic Leaders</a></li>\n</ul></div>\n      "
}