{
  "path": "/en/news/statements/2022/02/23/joint-statement-prime-minister-justin-trudeau-and-president-joseph-r",
  "pageTitle": "Joint Statement by Prime Minister Justin Trudeau and President Joseph R. Biden Jr. on One-Year Anniversary of the Roadmap for a Renewed U.S.-Canada Partnership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the Roadmap for a Renewed U.S.-Canada Partnership:</p>\n\n<p>“One year ago, Canada and the United States reaffirmed the special nature of our relationship, and our commitment to working closely together in the interests of the collective security and prosperity of our citizens based on the principles of democracy, diversity, and equity.&nbsp;</p>\n\n<p>“The Roadmap for a Renewed U.S.-Canada Partnership guides our work, and lays out an ambitious framework to build a greener, more prosperous future; grow our economies and strengthen the middle class; combat the global COVID-19 pandemic; create safer, more equitable communities; and stand together in the face of threats to democracy. &nbsp;Defending democracy is at the heart of our commitment to stand with Ukraine in the face of Russia’s unprovoked invasion. &nbsp;</p>\n\n<p>“We have made progress over the past year and laid the foundation to deepen our cooperation on climate change, on supporting the global pandemic response efforts, on enhancing cooperation on the Arctic, and on building the economies of the future, including through work to strengthen bilateral supply chains and cooperation on critical minerals.</p>\n\n<p>“Much work remains to be done. Our countries are both stronger when we work together towards our shared objectives.&nbsp;We look forward to building on our enduring partnership between our two great countries in the years ahead.”</p></div>\n      "
}