{
  "path": "/en/news/readouts/2022/03/08/prime-minister-justin-trudeau-meets-prime-minister-spain-pedro-sanchez",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Spain Pedro Sánchez | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Spain, Pedro Sánchez, in Riga, Latvia.</p>\n\n<p>The two leaders condemned Russia’s invasion of Ukraine, calling it a flagrant violation of international law, and stressed that this violation of Ukraine’s independence, national sovereignty, and territorial integrity must end immediately. Prime Minister Trudeau welcomed Spain’s decision to send weapons directly to Ukraine as an important step in helping Ukrainians resist further Russian aggression.</p>\n\n<p>The two prime ministers agreed that their presence, as well as that of their country’s soldiers, on Latvian soil at this time is a concrete indication of the North Atlantic Treaty Organization’s (NATO) unwavering support for Latvia.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez committed to work to expand coordination among the ever-growing international coalition of countries that oppose Russia’s invasion of Ukraine – as seen in the recent vote denouncing Russia at the United Nations General Assembly.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez looked forward to the upcoming NATO summit to be hosted by Spain, and agreed to stay in touch and continue working together on shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada-Spain relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n</ul></div>\n      "
}