{
  "path": "/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-united-states-vice-president-kamala",
  "pageTitle": "Prime Minister Justin Trudeau meets with United States Vice President Kamala Harris | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with United States Vice President Kamala Harris during his visit to Poland. He was joined by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland and the Minister of International Development, Harjit S. Sajjan.</p>\n\n<p>The Prime Minister and Vice President condemned Russia’s unprovoked, illegal invasion of Ukraine in the strongest terms, and repeated their calls for Russia to immediately withdraw its forces from Ukraine without conditions. They agreed that the invasion represents a flagrant violation of Ukraine’s territorial integrity, sovereignty, and independence. In particular, the Prime Minister and Vice President condemned the recent bombing of a maternity hospital in Mariupol, Ukraine.</p>\n\n<p>The Prime Minister thanked the Vice President for the United States’ leadership in their ongoing efforts to oppose Russia’s invasion, including by contributing to the unprecedented unity and resolve of the G7 and the North Atlantic Treaty Organization (NATO).</p>\n\n<p>The Prime Minister and Vice President stressed their resolve to continue to work together to respond to Russian President Vladimir Putin’s brazen disregard for freedom, democracy, international law, and human life. The Prime Minister conveyed his commitment to continue to hold President Putin to account and to support Ukraine, working in lockstep with the United States, with G7 and NATO partners, and with all countries prepared to defend the rules-based international order we have built over the last several decades.</p>\n\n<p>The Prime Minister and Vice President discussed measures taken in both Canada and the United States to ban Russian oil, and explored how they could further strengthen bilateral cooperation on energy. Prime Minister Trudeau also underscored the importance of integrated supply chains, including critical minerals.</p>\n\n<p>The Prime Minister and Vice President expressed their grave concerns at the growing humanitarian and refugee crisis resulting from the war, and agreed to continue to work together along with partners and allies to address humanitarian needs. They applauded the inspirational leadership of Ukrainian President Volodymyr Zelenskyy and the courage of all Ukrainians in the face of Russia’s unprovoked invasion.</p>\n\n<p>Prime Minister Trudeau and Vice President Harris expressed concern over the crisis in Ethiopia, underscoring the importance of a political solution and an inclusive national dialogue to end the conflict. They were also provided with an update from Minister Sajjan on the unfolding refugee situation in Moldova, following his visit there earlier this week.</p>\n\n<p>The Prime Minister and Vice President recognized the close ties that bind our countries, and peoples, together. They looked forward to continuing to deepen bilateral cooperation for the collective benefit of both countries, with regards to democracy, diversity and inclusion, gender equality, strengthening supply chains, and natural resources, among many others.</p>\n\n<p>Prime Minister Trudeau and Vice President Harris discussed the upcoming Summit of the Americas, which will be hosted by the Organization of American States in Los Angeles in June. They looked forward to remaining in touch, and the Prime Minister invited the Vice President to visit Canada soon.</p>\n\n<h2>&nbsp;Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/11/prime-minister-justin-trudeau-speaks-president-united-states-america-joe-0\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/26/joint-statement-further-restrictive-economic-measures\">Joint Statement on further restrictive economic measures</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}