{
  "path": "/en/news/readouts/2022/06/18/prime-minister-justin-trudeau-speaks-prime-minister-netherlands-mark-rutte",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of the Netherlands Mark Rutte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the Netherlands, Mark Rutte.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte discussed Russia’s illegal and unjustifiable invasion of Ukraine and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people. They spoke of the recent recommendation from the European Commission in favour of Ukraine becoming a candidate for European Union (EU) membership, and of the pathway for Ukraine’s integration into the European community. Prime Minister Trudeau underlined Canada’s strong and enduring commitment to work together with EU partners to support Ukraine recovery and reform toward closer EU integration.</p>\n\n<p>The prime ministers expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, notably for the global south, through food, fuel, and fertilizer shortages and rising prices. They committed to working together with like-minded partners to find practical ways to mitigate these impacts, particularly for the most vulnerable. They also confirmed their intent to continue working closely together to expand trade and investment, create good middle-class jobs in Canada and the Netherlands, and advance shared security and defence priorities in the context of the North Atlantic Treaty Organization (NATO).</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte looked forward to meeting in person at the upcoming NATO Summit in Madrid, Spain.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/netherlands-pays_bas/index.aspx?lang=eng\">Canada and the Netherlands</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/07/prime-minister-justin-trudeau-meets-prime-minister-netherlands-mark-rutte\">Prime Minister Justin Trudeau meets with Prime Minister of the Netherlands Mark Rutte</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}