{
  "path": "/en/news/readouts/2020/05/28/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their eleventh call with premiers to discuss the evolving COVID-19 situation. The leaders discussed the collaborative efforts by federal, provincial, and territorial partners to combat the pandemic and protect the health, safety, and economic well-being of all Canadians. They also discussed the recent reports by the Canadian Armed Forces on long-term care facilities in Ontario and Quebec, and agreed to take action to improve care for seniors.</p>\n\n<p>First Ministers were briefed on the work being done by the COVID-19 Immunity Task Force, which will coordinate country-wide blood test surveys to tell us how widely the virus has spread in Canada and provide reliable estimates of potential immunity and vulnerabilities in Canadian populations. In a short time, the task force has developed partnerships to support national coordination and to promote rapid progress toward these goals. First Ministers recognized the importance of its work in understanding and combatting the virus.</p>\n\n<p>The Prime Minister updated premiers on the federal government’s ongoing work to procure critical personal protective equipment, and successful efforts to ramp-up the made-in-Canada supply. He also discussed how the federal government is working with each jurisdiction, including on border measures and a collaborative national approach to testing and contact tracing.&nbsp;</p>\n\n<p>The Prime Minister spoke to premiers about his commitment to ensure every worker has access to ten days of paid sick leave a year, and asked premiers about how the federal government could further assist them to reopen their economies.&nbsp;First Ministers agreed that reopening the economy is a complex and difficult process, and that having the appropriate supports in place to protect the health and safety of all Canadians is critical.&nbsp;</p>\n\n<p>All First Ministers reiterated the importance of a Team Canada effort in addressing the challenges of COVID-19. The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/05/27/prime-ministers-remarks-supports-announced-help-canadians-during-covid-19\">Prime Minister’s remarks on supports announced to help Canadians during COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/05/26/prime-ministers-remarks-keeping-canadians-safe-and-working-other-countries\">Prime Minister’s remarks on keeping Canadians safe and working with other countries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/05/22/prime-ministers-remarks-testing-contact-tracing-and-sharing-data-fight\">Prime Minister’s remarks on testing, contact tracing, and the sharing of data to fight COVID-19</a></li>\n</ul></div>\n      "
}