{
  "path": "/en/news/statements/2018/09/08/statement-prime-minister-international-literacy-day",
  "pageTitle": "Statement by the Prime Minister on International Literacy Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Literacy Day:</p><p>“Today, on <a href=\"http://www.un.org/en/events/literacyday/\">International Literacy Day</a>, we join people around the world to raise awareness of the importance of literacy. We celebrate the progress we have made to promote literacy, here at home and abroad – and reflect on the work we have left to do to make sure everyone has access to literacy and opportunity.</p><p>“Literacy is the foundation of success. It means more opportunities for people to take part in our economies and societies – and more tools to care for their loved ones, contribute to their communities, and build a better future.</p><p>“Literacy helps workers adapt and thrive in our rapidly changing global economy, and empowers people around the world, especially the most vulnerable. Being able to read and write helps people make their voices heard and gives them greater tools to advocate for their community. Yet around the world,750 million adults –two-thirds of whom are women – lack basic reading and writing skills. It’s up to all of us to build a world where everyone, no matter their background or their gender, has a fair and equal shot at success – and literacy is a vital part of that.</p><p>“The Government of Canada is working hard to support quality education that is fair and inclusive, and to promote lifelong learning opportunities for all. In 2017, we launched the <a href=\"https://www.budget.gc.ca/2017/docs/themes/Innovation_en.pdf\">Innovation and Skills Plan</a> to help Canadians get the skills and training they need to succeed in today’s workforce and prepare for the jobs of tomorrow. This year, we introduced a new <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a> to help women access training and networking opportunities to grow their business. Through programs such as the <a href=\"https://www.canada.ca/en/employment-social-development/services/indigenous/asets.html\">Aboriginal Skills and Employment Training Strategy</a> and the <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment Strategy</a>, we are helping historically vulnerable communities get the tools and opportunities they need to contribute to and benefit from our economy.</p><p>“Beyond our borders, we are working with partners to make the <a href=\"https://www.un.org/sustainabledevelopment/\">Sustainable Development Goals</a> a reality, including inclusive, equitable quality education for all. At the <a href=\"https://g7.gc.ca/en/\">G7 Summit</a> in Charlevoix earlier this year, Canada and partner countries announced a historic investment in education for women and girls in crisis and conflict situations – the largest of its kind ever made. When women and girls have the chance to learn and succeed, they help build economies that work for everyone. This investment will make a real difference in the lives of the world’s most vulnerable women and girls, and help lay the foundations for lasting peace and prosperity.</p><p>“On behalf of the Government of Canada, I thank all those who work every day to support and improve literacy initiatives, here in Canada and around the world. Together, we can close the gaps in access to education, and build a more prosperous, equal future for all.”</p></div>\n      "
}