{
  "path": "/en/news/readouts/2022/03/29/prime-minister-justin-trudeau-meets-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau meets with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with British Columbia Premier and Chair of the Council of the Federation John Horgan.</p>\n\n<p>The two leaders discussed the <em>2030 Emissions Reduction Plan: Clean Air, Strong Economy</em>, which was announced earlier today by the Prime Minister at the GLOBE Forum in Vancouver, British Columbia. Premier Horgan noted British Columbia’s strong interest in collaborating with the Government of Canada on the plan and on shared climate change objectives, including creating green growth and good jobs.&nbsp;Prime Minister Trudeau and Premier Horgan also discussed Canada’s efforts to support those affected by Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>The leaders highlighted recent talks between governments on health care, and agreed to continue discussions to ensure Canadians are supported by effective health care systems.&nbsp;They also agreed to continue to collaborate on child care and housing to make life more affordable for Canadians, and to work together on other shared priorities, including climate change and infrastructure.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/29/delivering-clean-air-and-strong-economy-canadians\">Delivering clean air and a strong economy for Canadians</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><em><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\">2030 Emissions Reduction Plan: Clean Air, Strong Economy</a></em></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}