{
  "path": "/en/news/statements/2022/01/22/weestamakaywin-ouschi-kischee-li-ministr-ishpee-sizyem-ashpin-ouschi",
  "pageTitle": "Weestamakaywin ouschi Kischee Li Ministr ishpee sizyem ashpin ouschi nipahtakaywin didawn La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kischee Li Ministr, Justin Trudeau, anoush pakitinam ooma ikouhk weestamakaywin chi en mark ooma sizyem ashpin ouschi kaw ki nipahtakayk didawn La Loche, Saskatchewan:</p>\n\n<p>“Sis naw ashpin anoush, ooma La Loche alawntour, Saskatchewan, kikakwawtakistowak ooma mawyipayiwin akouta kaet li moond ki nipahowak akwa meena set kootakak mitouni aen siirieu kimayitoutawkwuk.</p>\n\n<p>“Anoush ooma kashkayhtawkounawkwun ka ki ishpayik, nikatakoun avek li moond ouschi Saskatchewan akwa kahkiyaw Aen zhawnd Kenadaw chikishkishihk akwa gischeetayimihchik pat blawm pimatishiwin ka ki wanistawchik. Va oofayr kiyanawn mitouni kitimakaymiwaywin ishi pashpeewuk akwa meena kitimahakun see famee akwa see zamee aykwawniki ka ahkamay awnjeur li pwaen ouschi weeshakitayhaywin akwakakwatakaymowin akouz ouschi ooma mawyipayiwin.</p>\n\n<p>“Ka naakatwayihtamahk ooma kakwawyakipayiwin, ki nishtawinaynaw aykwawnima pawhpayyek pimatishiwin ka wanistahk ishi pawshkishikan la shikaan oushawm mishtahi. Ooma pat dawnzhee akwa nakatouhkaywin ouschi kahkiyaw Aen zhawnd Kenadaw aykwawnima ooma li gouvarnimaw soon neekawn kischee, akwa chi ahkamayihtam chitoutahk kahkiyaw kaykwawy chipishishkayistahk meena chi oushistahk pat dawnzhee daan li alawntour. Kimashinahamwananik kahkiyaw kitimahakunak akwa pashpeewuk ouschi pawshkishikan la shikaan didawn Kenadaw akwa see famee – ouschi Saskatchewan ishi Quebec En Grous Vil, ouschi Toronto ishi Nova Scotia.</p>\n\n<p>“Ishpee ooma I’lspree chiweechihiwaywiyahk alawntour tapishkoot La Loche, ishpee 2020, Li Gouvarnimaw di Kenadaw weestamakayw <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">kitahakawkayw ouschi ayiwawk en mil akwa saen sawn ka kochiwahpatahiwayhk ouschi assault-itouwahk pawshkishikana akwa see mawhmayshkout itouwahk</a>. Ishpee 2021, nikee weestamakaynawn manawchischikaywin ouschi kaykawt sis sawn aen milyoonn pleuski trwaw naw poor maenrit-oushistawin nakishkaminowin ishi la sarvel miywayawin poor Li Promyee Nawsyoon, aen Niskimoo, akwa aen Michif Nawsyoon. Ooma ka tootichawtayk chi ahkamay ahkikin kawschitinamawin ishi akwa mashkuwsheeshtaw la sarvel miywayawin ishi Indigene alawntour – akwa meena lout bor li tayraen. Chikee zaenproovmawn alawntour-ouschipayiwin weechihiwaywin, ouschi chikishinahamawkayhk maykwawt akwa neu miywayawin atoushkaywak, chioushchikawtayk ayiwawk alawntour li service. Li gouvarnimaw chi ahkamay atoushkayw en partineuz weechayhtoowin avek Indigene, en grous vil, en provayns, akwa li tayritori gouvarnimaw chi kayschinahouw si boon li taan ki vyayn poor kahkiyaw Indigene yet zhenn.</p>\n\n<p>“Li Gouvarnimaw di Kenadaw meena ahkaamaymouw chi weechihiwayt ishi ooma si boon la sawntee paaminikaywin poor aykwawniki ka kakwawtakistow ouschi La Loche kakwawyakipayiwin, avek kawmiyokistayw weechihiwaywin poor Indigene-neekwanaywin, ka isi pimaatishaahk nahiyokohk, akwa shaykayistamowin-kishkayistamowin la sarvel miywayawin li service poor Indigene Li moond. Kwatakihtawin nakinkaywin weechihiwaywin akwa li service ihtakoun poor Li Promyee Nawsyoon, aen Niskimoo, akwa aen Michif shawpou ooma Si baen na swetee poor Miywayawin Aen foonn itay 1‑855‑242‑3310 keema daan li computer awchimouwin peekishkwaywin itay <a href=\"https://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>. Keemoochi la sarvel la sawntee weechihiwaywin ihtakoun meena poor tou la zhournee, akwa meena mouschi akwawnima poor kahkiyaw Aen zhawnd Kenadaw shawpou ooma Miywayawin Together Kenadaw portal itay 1‑866‑585‑0445 keema daan li computer awchimouwin itay <a href=\"https://wellnesstogether.ca/en-CA\">www.wellnesstogether.ca</a>. Niahkamay paminaynawn la sarvel la sawntee li service akwa weechihiwaywin aykwawnima chikee kwayshkoochinaakoohtaw ishi pimatishiwin ouschi Indigene Li moond – akwa kahkiyaw Aen zhawnd Kenadaw.</p>\n\n<p>“Poor ooki Li Gouvarnimaw di Kenadaw, ni awnkourazhee kahkiyaw awiyak chikishkishichik ooki kitimahakunak akwa pashpeewuk ouschi kakwawyakipayiwin didawn La Loche, aykwawniki opimatishiwiniwaw tuhkinay mayshkoopichikawtayow ishpee Zhawnvyee 22, 2016. Kiweechitinawn, akwa meen kiayawnawow ahkamay weechihiwaywin.”</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"bb8b2655-90a7-4955-b781-ad4667676918\" href=\"/en/news/statements/2022/01/22/statement-prime-minister-sixth-anniversary-shootings-la-loche\">Statement by the Prime Minister on the sixth anniversary of the shootings in La Loche, Saskatchewan</a></li>\n</ul></div>\n      "
}