{
  "path": "/en/news/statements/2022/08/15/statement-prime-minister-national-acadian-day",
  "pageTitle": "Statement by the Prime Minister on National Acadian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Acadian Day:</p>\n\n<p>“On National Acadian Day, we celebrate the rich heritage and unique culture of the Acadian people, which have enriched and shaped our country since its foundation.</p>\n\n<p>“Acadians have always shown courage, resilience, and perseverance. For more than 400&nbsp;years in North America, they have built a strong and dynamic identity, which they have safeguarded in the face of adversity and hardship. This Acadian identity, deeply rooted in our history, inspires people far beyond the borders of Acadie.</p>\n\n<p>“Since the first Acadian National Convention, which was held in 1881 in Memramcook, New&nbsp;Brunswick, August&nbsp;15 has been a day of celebration for Acadians. From Petit-de-Grat, Nova Scotia, to Port au Port, Newfoundland, to Caraquet, New Brunswick, and Abram-Village, Prince Edward Island, many activities will be held this year to celebrate the spirit and pride of the Acadian people, such as traditional meals, concerts featuring Acadian artists, fireworks, and <em>tintamarres</em>.</p>\n\n<p>“These celebrations also highlight our country’s diversity and the strength of the French identity in Canada. The Government of Canada continues to support Francophone minority communities and to promote their development and vitality, including through the modernization of the <em>Official Languages Act</em>. The <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/canadians-official-languages-act/introduction-bill.html\">enhanced bill</a>, introduced in March, aims to achieve substantive equality between French and English from coast to coast to coast while contributing to the vitality of official-language minority communities.</p>\n\n<p>“This year, I encourage all Canadians to learn more about the history, culture, and contributions of Acadians, and to <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada/acadian-day.html\">take part in an activity</a>, wherever you are in the country. On behalf of the Government of Canada, Sophie and I wish all those celebrating today, across Canada and around the world, a wonderful National Acadian Day.”</p></div>\n      "
}