{
  "path": "/en/news/readouts/2022/02/17/prime-minister-justin-trudeau-convenes-fifth-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the fifth Incident Response Group meeting on the illegal blockades and occupations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the fifth meeting of the Incident Response Group to discuss the public order emergency the government declared under the <em>Emergencies Act.</em> Joined by ministers and senior officials, he reiterated that the government’s priority is to end these illegal blockades and occupations across the country and to restore peace, order, and good government.</p>\n\n<p>The group was provided with an update on the progress in implementing the emergency orders made under the <em>Emergencies Act</em>, including finance-related measures under the&nbsp;<em>Emergency Economic Measures Order</em>. Personal and corporate accounts suspected to be involved in criminal activity have been frozen and authority is being provided for all orders of government to share relevant information with financial institutions. This includes increased oversight of monies being raised in Canada and abroad via online fundraising platforms.</p>\n\n<p>The group was briefed on the situation in Ottawa, where the Ottawa Police Service, Royal Canadian Mounted Police, Ontario Provincial Police, and other collaborating police forces now have the additional tools and resources they need to bring a safe end to the occupation.</p>\n\n<p>The group discussed the importance of ensuring the measures continue to be targeted, temporary, proportional to the threats posed to Canadians, and compliant with the&nbsp;<em>Canadian Charter of Rights and Freedoms</em>. The <em>Emergencies Act</em> was invoked to end these almost three weeks of illegal blockades&nbsp;and to protect families, small businesses, and the economy.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/02/federal-government-declares-a-public-order-emergency-under-the-emergencies-act-to-end-disruptions-blockades-and-the-occupation-of-the-city-of-ottawa.html\">Federal government declares a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades, and the occupation of the city of Ottawa</a><a name=\"_Hlt96011193\" id=\"_Hlt96011193\"></a><a name=\"_Hlt96011194\" id=\"_Hlt96011194\"></a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/02/15/canada-invokes-emergencies-act-limit-funding-illegal-blockades-and\">Canada invokes the <em>Emergencies Act</em> to limit funding of illegal blockades and restore public order</a><a name=\"_Hlt96011198\" id=\"_Hlt96011198\"></a><a name=\"_Hlt96011199\" id=\"_Hlt96011199\"></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/10/prime-minister-justin-trudeau-convenes-incident-response-group\">Prime Minister Justin Trudeau convenes the Incident Response Group</a><a name=\"_Hlt96011202\" id=\"_Hlt96011202\"></a><a name=\"_Hlt96011203\" id=\"_Hlt96011203\"></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-convenes-incident-response-group-ongoing\">Prime Minister Justin Trudeau convenes the Incident Response Group on the ongoing illegal blockades</a><a name=\"_Hlt96011206\" id=\"_Hlt96011206\"></a><a name=\"_Hlt96011207\" id=\"_Hlt96011207\"></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/16/prime-minister-justin-trudeau-convenes-incident-response-group-ongoing\">Prime Minister Justin Trudeau convenes the Incident Response Group on the ongoing illegal blockades</a><a name=\"_Hlt96011209\" id=\"_Hlt96011209\"></a><a name=\"_Hlt96011210\" id=\"_Hlt96011210\"></a></li>\n</ul></div>\n      "
}