{
  "path": "/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii",
  "pageTitle": "Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth II | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the passing of Her Majesty Queen Elizabeth&nbsp;II:</p>\n\n<p>“It is with the heaviest of hearts that we learned of the passing of Canada’s longest-reigning Sovereign, Her Majesty Queen Elizabeth&nbsp;II.</p>\n\n<p>“For most Canadians, we have known no other Sovereign. Queen Elizabeth&nbsp;II was a constant presence in our lives. Time and again, Her Majesty marked Canada’s modern history. Over the course of 70 years and twenty-three Royal Tours, Queen Elizabeth&nbsp;II saw this country from coast to coast to coast and was there for our major, historical milestones.</p>\n\n<p>“She would proclaim ‘it was good to be home’ when returning to her beloved Canada. She was indeed at home here, and Canadians never ceased to return her affection.</p>\n\n<p>“Her Majesty vowed to devote her life to the service of the Commonwealth and its people.&nbsp;On behalf of all Canadians, I thank Queen Elizabeth&nbsp;II for honouring this vow and for a lifetime of service.</p>\n\n<p>“Her Majesty’s reign spanned so many decades – a period when we came into our own as a confident, diverse, and forward-looking country. It is her wisdom, compassion, and warmth that we will always remember and cherish.</p>\n\n<p>“Today, a page has not only been turned, but a chapter in our shared history has drawn to a close. I know Her Majesty’s service to Canada and Canadians will forever remain an important part of our country’s history. The coming days will be a period of mourning for Canadians, as it will be for all Commonwealth citizens, ending with a national day of mourning when a commemorative service will be held to mark the passing of our Sovereign.</p>\n\n<p>“On behalf of the Government of Canada, I express our heartfelt condolences to members of the Royal Family during this most difficult time.”</p></div>\n      "
}