{
  "path": "/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food",
  "pageTitle": "Prime Minister Trudeau announces Canadian support to address global food security crisis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Global food insecurity has been increasing dramatically over the past several years, and it is now being further and directly exacerbated by Russia’s illegal invasion of Ukraine. &nbsp;Countries around the globe, including many Commonwealth member states, are experiencing the impacts on global and local food systems, and these are felt more strongly by the most vulnerable and those already facing humanitarian crises.</p>\n\n<p>While participating at the Commonwealth Heads of Government Meeting in Kigali, Rwanda, Prime Minister Trudeau today announced $250 million to help address the global food security crisis. This funding will address the increasing global food and nutrition needs – especially for the most vulnerable and with a focus in Sub-Saharan Africa.</p>\n\n<p>This funding will help key humanitarian food and nutrition partners, both Canadian and international, reach more people in more places with life-saving services. This includes food assistance, emergency cash and vouchers, and ready-to-use therapeutic food, often used for emergency feeding of malnourished children. This assistance is especially important for children living in crisis situations and facing acute hunger and malnutrition, or parents who have hardly enough food to feed their children, but will go hungry themselves.</p>\n\n<p>Today’s announcement builds on previous commitments to address global food and nutrition needs. In 2022, Canada has already allocated $514.5 million for urgent humanitarian food and nutrition assistance.</p>\n\n<p>Since 2020, Canada has allocated over $3 billion dollars for gender-responsive humanitarian assistance around the world. This includes support for emergency food and nutrition, safe drinking water, sanitation services, emergency health care, and temporary shelters to help meet the most pressing needs of people affected by crisis. This is also in addition to other international development investments in climate-smart and nature-based agricultural solutions, which help smallholder farmers adapt to the impacts of climate change so they can continue to produce nutritious and healthy foods.&nbsp;&nbsp;&nbsp;</p>\n\n<p>Global food insecurity not only leads to hunger, famine, and death, it can also create increased instability and lead to conflict. Global grain stocks are very low, supply chains are fragile and under pressure, and rising costs threaten agricultural productivity. As a result, food prices are rising rapidly and at an all-time high, and food price inflation is the principal immediate concern, which is also impacting Canadians directly. Canada will continue to take action to address the causes and consequences of the global food crisis in coordination with others, to help build resilience, address the underlying vulnerabilities, and tackle the root causes leading to food insecurity. Investing in food security is important for the global economy and for Canadians, and Canada will continue to do so.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Russia’s invasion of Ukraine has only further jeopardized global food supply chains, with many already under threat of famine due to drought and other shocks to the food system. Canada is unwavering in our commitment to make sure nutritious food continues to be available and accessible to the most vulnerable at all times.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Global food prices in March 2022 reached a new all-time high, exceeding all major food crises on record (1974/75, 2008/09, 2011/12).</li>\n\t<li>Since the start of the year, Canada has already allocated $514.5 million in humanitarian food and nutrition assistance.</li>\n\t<li>The Global Alliance for Food Security was officially launched at the G7 Development Ministers meeting in Germany in May, 2022.</li>\n\t<li>On May 6, 2022, Canada co-sponsored a statement signed by 26 countries at the World Trade Organization on Open and Predictable Trade in Agricultural and Agri-Food Products in response to the food crisis caused by Russia’s invasion of Ukraine.</li>\n\t<li>Canada has taken steps to increase its food production to meet global demand. Total acreage for Canadian wheat is expected to increase by 7 per cent this crop year. In May 2022, Canada’s Minister of Agriculture and Agri-Food announced new investments so Canadian farmers can bring more cereals, grains, and oats to international markets.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/09/stand-ukraine-91-billion-euros-124-billion-pledged-support-internally\">Stand Up For Ukraine: 9.1 billion euros ($12.4 billion) pledged in support of internally displaced and refugees</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/wto-omc/news-nouvelles/2022-05-06-agriculture-statement-declaration.aspx?lang=eng\">Joint statement on open and predictable trade in agricultural and food products</a></li>\n\t<li><a href=\"https://www.canada.ca/en/agriculture-agri-food/news/2022/05/government-of-canada-invests-44-million-to-increase-access-to-canadas-high-quality-grain-products-globally.html\">Government of Canada invests $4.4 million to increase access to Canada’s high-quality grain products globally</a></li>\n</ul></div>\n      "
}