{
  "path": "/en/news/news-releases/2017/03/31/prime-minister-announces-support-public-transit-greater-golden",
  "pageTitle": "Prime Minister announces support for public transit in the Greater Golden Horseshoe Area | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The benefits of public transit – shorter commute times, less air pollution, more time with family and friends, and stronger economic growth – are well understood. So too is the cost of inaction. The gridlock that results from traffic congestion costs Canada’s economy billions of dollars in lost productivity every year.</p><p>To address these concerns, the Prime Minister, Justin Trudeau, today announced that the Government of Canada will invest more than $1.8 billion in the GO Transit Regional Express rail project in the Greater Golden Horseshoe Area.</p><p>This investment – provided through the New Building Canada Fund – will create good, well-paying middle class jobs, and support a modern, efficient transit system, which will result in a faster commute, less time in traffic, and more money in Ontarians’ pockets as they trade their cars for public transit.</p><p>Along with the province’s contribution to the GO Transit Regional Express rail project, this investment will be the single largest transit project in which the federal government has ever invested‎.</p><p>Prime Minister Trudeau also announced today that more than 300 additional projects have been approved in Ontario under the Public Transit Infrastructure Fund. These projects will provide efficient and affordable transit services across the province, and transform the way Ontarians move, work, and live.</p><h2>Quotes</h2><blockquote><p>“More families are choosing to settle in communities like Etobicoke – communities that allow parents to work in the big city, and allow kids to ride their bikes on the street. These communities are growing at a rapid rate, and investment in public transit needs to keep pace. That is why we’re investing in the GO rail network and over 300 additional projects in Ontario to reduce commute times, decrease air pollution, and improve the lives of millions of Ontarians.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“People in Ontario need to be able to get where they are going quickly and efficiently. Improved transit means more jobs and economic growth and a better quality of life. This is why Ontario is transforming the commuter rail network with GO Regional Express Rail. GO RER will deliver fast, electric trains as frequently as 15 minutes in both directions, serving communities in the GTHA and beyond, including the Waterloo Region and Barrie. It will add new stops and cut down travel times. It will mean that people can spend less time commuting and more time doing what they love. Over the last few years the province has made significant progress towards modernizing the entire GO network, allocating $13.5 billion towards GO RER and another $7.8 billion to upgrade and extend the GO network to include regular service to Niagara and Bowmanville. At $21.3 billion, the GO capital program is the largest commuter rail program in Canada. It is great that the federal government is now investing in this transformation. We welcome the Government of Canada’s partnership as we build modern and seamless transit options for the people of Ontario.”<br><cite>— The Honourable Kathleen Wynne, Premier of Ontario</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada will contribute more than $1.8 billion to GO Transit Regional Express rail project&nbsp;through the New Building Canada Fund – Provincial-Territorial Infrastructure Component.</li><li>Under the Public Transit Infrastructure Fund, the Government of Canada will contribute more than $200 million for the 312 projects approved in Ontario, representing 50 per cent of the total eligible costs.</li><li>Budget 2017 will support the next phase of ambitious transit projects by investing $20.1 billion over 11 years through bilateral agreements with provinces and territories and an additional $5 billion through the Canada Infrastructure Bank. This funding will make it possible for Canadian communities to build the new urban transit networks and service extensions that will transform the way that Canadians move, work, and live.</li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"https://www.canada.ca/en/office-infrastructure/news/2017/03/backgrounder_canadaandontarioannouncefundingfor312publictransitp.html\">List of Public Transit Infrastructure Fund projects in Ontario</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/home-accueil-en.html\">Budget 2017</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/nbcf-nfcc-eng.html\">New Building Canada Fund</a></li><li>News Release: <a href=\"/en/news/news-releases/2016/08/23/prime-minister-canada-and-premier-ontario-announce-agreement-under\">The Prime Minister of Canada and the Premier of Ontario announce agreement under new federal infrastructure funding program</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">Public Transit Infrastructure Fund</a></li></ul></div>\n      "
}