{
  "path": "/en/news/news-releases/2020/09/29/world-leaders-focus-key-actions-assist-countries-battered-financial",
  "pageTitle": "World leaders to focus on key actions to assist countries battered by the financial crisis caused by COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Leaders from governments and international organizations will consider specific actions to help countries and people address the devastating financial and socioeconomic impacts caused by COVID-19 at a virtual high-level meeting on 29 September.</p>\n\n<p>Convened by United Nations Secretary-General António Guterres, together with the Prime Minister of Canada, Justin Trudeau, and the Prime Minister of Jamaica, Andrew Holness, the High-Level Meeting of Heads of State and Government will reflect the work done over the last five months by finance ministries, the UN and other international organisations and some of the world’s leading economists to find the policy options and solutions that can advance comprehensive multilateral response to the devastating social and economic impacts of COVID-19.</p>\n\n<p>Of the US$11 trillion that has been spent globally to respond to the financial impacts of the pandemic so far, 88% has been disbursed by high-income countries, compared to only 2.5% by emerging and developing economies.</p>\n\n<p>The COVID-19 pandemic, which has claimed almost one million lives and resulted in more than 32 million confirmed cases, has gone beyond a health and humanitarian crisis to also become an unprecedented global development emergency. The pandemic is expected to drive close to 100 million to extreme poverty, the first such increase since 1998. An estimated additional 265 million people could face acute food shortages by the end of 2020. By the end of this year, 12 000 people could die from COVID-19 related hunger. The International Labour Organization estimates the equivalent of 500 million jobs have been lost so far this year.&nbsp;This has widened economic inequalities, disproportionately impacting developing countries and vulnerable groups.</p>\n\n<p>Even for developing countries that have not been directly affected by the virus, the COVID-19 pandemic has exacerbated the financial distress as export, tourism and remittance receipts have all dried up, threatening their ability to service existing debt payments.</p>\n\n<p>The Secretary-General said the Meeting on Financing for Development in the Era of COVID-19 and Beyond will bring world leaders together to find solutions to the financial crisis. Developed countries have provided enormous relief for their own societies, the Secretary-General told countries at the opening of the UN General Assembly. “They can afford it. But we need to ensure that the developing world does not fall into financial ruin, escalating poverty and debt crises. We need a collective commitment to avoid a downward spiral.”</p>\n\n<p>“We have come together, the largest gathering of world leaders in the context of COVID-19, to inspire a global response to the pandemic and maintain momentum towards the 2030 Agenda for Sustainable Development and the SDGs,” said Prime Minister Justin Trudeau. “At this moment, we have the opportunity to reimagine our economic systems, reaffirm our common understanding of a more sustainable and inclusive recovery and re-establish momentum toward achieving the SDGs to build back better. Only together can we lay the foundations of a better world.”</p>\n\n<p>Meanwhile, Prime Minister of Jamaica, the Most Honourable Andrew Holness, said societies of the world must come together in a deliberate way to drive the rebuilding efforts so that collectively we will rebound stronger from the far-reaching impacts of the global COVID-19 pandemic. He said, “We are at a critical point where now, more than ever, global cooperation and collaboration are essential to recovery. Our approach must therefore be purposeful and strategic. Excellent work has been done so far. We must be prepared to build on this foundation by taking bold, well-reasoned actions that will ensure the broadest positive impact at global and national levels, with people always at the center. Clear achievable objectives, timelines and systems must be defined if we are to achieve truly resilient, inclusive and sustainable recovery.”</p>\n\n<h2>Meeting the challenges</h2>\n\n<p>Following the High-Level Meeting on 28 May, six Discussion Groups were created to produce a menu of policy recommendations&nbsp;and solutions to help countries survive the crisis in the short-term and recover better in the long-term by laying the groundwork for a resilient, inclusive, and sustainable future. Discussion Groups focused on producing actionable policies related to external finance, jobs, remittances, and inclusive growth; recovering better for sustainability; global liquidity and financial stability; debt vulnerability; private sector creditors engagement; and illicit financial flows. During the meeting, highlights from these options selected by the Discussion Groups will be presented to Heads of State and Government.</p>\n\n<p>This process has highlighted a number of possible avenues for high-impact actions that leaders can take. These include:</p>\n\n<ul>\n\t<li>Ensuring equitable access to the COVID-19 vaccine—mobilize the resources to fund the COVAX Initiative to accelerate the development and manufacture of COVID-19 vaccines and guarantee fair and equitable access for all countries around the world.</li>\n\t<li>Ensuring that countries have access to sufficient liquidity—support a new US$650 billion general allocation of Special Drawing Rights and a US$100 billion voluntary redistribution of Special Drawing Rights to developing and vulnerable countries, including Middle-Income Countries.</li>\n\t<li>Providing more time for distressed countries to make bilateral debt payments—by extending and expanding the Debt Service Suspension Initiative (DSSI). In addition, address the debt overhang, especially in Middle-Income Countries and Small Island Developing States, directly by having all bilateral creditors, as well as private creditors, agree to a common framework for resolving debt solvency issues as quickly as possible. It is only through such a commonly agreed framework that countries facing debt solvency issues will be helped through this crisis, and through which every creditor will be asked to play their respective part in solving the looming debt crisis.</li>\n\t<li>Strengthening support from international financial institutions—encourage multilateral development banks to proactively support developing economies by ensuring net new financing flows compared to 2019, in a timely manner and where possible on concessional terms consistent with their countercyclical role.</li>\n\t<li>Enhancing focused funding to alleviate COVID-19 either by supporting existing funds and facilities and/or by creating new funds to provide sustainable concessional finance and investments to developing countries.</li>\n\t<li>Investing in jobs for all—immediately in gender-sensitive, equitable and sustainable jobs by supporting the ILO’s 100% decent work initiative and strengthening social protection systems and mechanisms.</li>\n\t<li>Lowering costs of remittances—continue to support the reduction of transaction costs of remittances.</li>\n\t<li>Clamping down on illicit financial flows—take immediate action to support domestic resource mobilisation by tackling enablers and vested interests that benefit from them, preventing profit-shifting by multinationals, and bolstering the availability, transparency and exchange of data on beneficial ownership.</li>\n\t<li>Including climate risk disclosures—continue to support the Task Force on Climate-related Financial Disclosures’ (TCFD) climate disclosure standards and encourage their adoption.</li>\n\t<li>Aligning national and local budgets with the SDGs and the Paris Agreement to bridge short-term emergency response measures with longer-term objectives of recovering better for sustainability.</li>\n</ul>\n\n<p>Following opening remarks by the United Nations Secretary-General and the Prime Ministers of Canada and Jamaica, we will hear from remaining speakers in the opening segment, including the Deputy Secretary-General who will highlight the work of the six Discussion Groups and outcomes of the Ministerial meeting. Heads of State and Government and High-Level speakers from international financial institutions and partners will intervene. The meeting will conclude with closing remarks from the co-conveners.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li>Webcast<strong>:&nbsp;</strong><a href=\"http://webtv.un.org/\">http://webtv.un.org/</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li>Event website: <a href=\"https://www.un.org/en/coronavirus/financing-development\">https://www.un.org/en/coronavirus/financing-development</a></li>\n</ul></div>\n      "
}