{
  "path": "/en/news/statements/2017/09/03/statement-prime-minister-canada-response-north-koreas-latest-testing",
  "pageTitle": "Statement by the Prime Minister of Canada in response to North Korea’s latest testing of a nuclear weapon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, issued the following statement in response to North Korea’s latest testing of a nuclear weapon:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Canada unequivocally condemns North Korea’s‎ nuclear test of September 3 which, combined with its aggressive program of ballistic missile testing, represents a clear and present threat to the safety and security of its neighbours and the international community.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This most recent test, which appears to have been of a much greater magnitude than its five previous nuclear explosions, is in direct contravention of multiple UN Security Council resolutions, and‎ demonstrates once again North Korea’s flagrant disregard of international law.</span></p><p>“These continued provocations by North Korea’s leadership, along with their profoundly dangerous push to develop nuclear weapons and test ballistic missiles near neighbouring countries, only serve to further isolate them.</p><p>“Canada has been steadfast in insisting that North Korea abandon its current course, including its aggressive rhetoric, and asks that it resumes constructive dialogue toward a comprehensive and verifiable solution.</p><p>“We urge the UN Security Council to take further decisive action to effectively constrain North Korea’s proliferation efforts, and call on all states to fully implement relevant UN sanctions.</p><p>“We will continue to work with key regional partners – including the United States, South Korea and Japan – as well as the broader international community, to counter the North Korean threat.”</p></div>\n      "
}