{
  "path": "/en/news/news-releases/2019/04/29/toyotas-new-commitment-strengthen-canadas-automotive-sector",
  "pageTitle": "Toyota’s new commitment to strengthen Canada’s automotive sector | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For over 100 years, Canada’s auto sector has been an engine of economic growth, driving innovation and creating good, well-paying jobs for the middle class.</p>\n\n<p>The Prime Minister, Justin Trudeau, today welcomed Toyota Motor Corporation’s decision to bring production of its Lexus NX and state-of-the-art NX hybrid to its Cambridge plant.</p>\n\n<p>This new mandate reaffirms the company’s long-term commitment to Canada with a significant investment worth hundreds of millions of dollars. In addition to $1.4 billion invested in May 2018, it will make the plant Toyota’s North American production hub for these sport utility vehicles (SUVs) starting in 2022.</p>\n\n<p>Toyota’s investments will support more than 8,000 jobs and 1,000 co-op placements in Southwestern Ontario. The company is committed to its earlier investment of $200 million over ten years to support research and development in Canada.</p>\n\n<p>The Government of Canada is taking action so that Canada can continue to succeed in the global marketplace. By promoting Canadian industry and talent on the world stage, we are growing the economy and creating better opportunities for Canadian workers and businesses.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today is a great day for Toyota, for Cambridge, and for Canada. Canadian auto workers are among the world’s best, and they have the skills and knowhow to design and build cars that meet the needs of people today and tomorrow. Toyota’s new commitment to its Cambridge facility is a vote of confidence in our auto sector, and will help Canada lead in the new high-tech economy of the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the first time that the Lexus NX and NX hybrid sport utility vehicles will be produced outside of Japan.</li>\n\t<li>In May 2018, Prime Minister Trudeau announced a $110 million investment to support Toyota Motor Manufacturing Canada’s $1.4 billion investment in its Cambridge and Woodstock plants.</li>\n\t<li>Toyota Motor Manufacturing Canada is among the top five global Toyota manufacturing plants. Its assembly facilities in Cambridge and Woodstock can build over 500,000 vehicles annually – making Toyota Motor Manufacturing Canada the largest automotive manufacturer in Canada.</li>\n\t<li>Canadian auto plants build more than two million vehicles each year. The automotive sector is Canada’s largest export industry, supporting over 525,000 jobs and contributing $18 billion annually to our economy.</li>\n\t<li>On average, the Canadian auto sector manufactures one car every 14 seconds.</li>\n\t<li>Canada is a global leader in emerging automotive technologies such as lightweight materials, advanced safety systems, software and cybersecurity, connected and autonomous vehicles, artificial intelligence, alternative powertrains (electric vehicles and fuel cells), vehicle safety and testing.</li>\n\t<li>This is the latest in a series of investments in the Canadian auto sector. In addition to Toyota’s commitments, other investments include:\n\t<ul>\n\t\t<li>In February 2019, with support from the federal government, BlackBerry QNX announced $310.5 million in investments to develop safe and secure software systems for the next generation of connected and autonomous vehicles. This will help create more than 800 new middle class jobs in Canada over the next ten years and maintain nearly 300 more.</li>\n\t\t<li>In August 2018, with support from the federal government, the University of Ontario Institute of Technology announced a $12.5 million project to enhance the Automotive Centre of Excellence in Oshawa, doubling the number of full-time jobs at the facility.</li>\n\t\t<li>In January 2018, with support from the federal and provincial governments, Linamar announced $750 million in investments to support the research and development of advanced transmission and drivetrain systems, high-efficiency engine components, and electrified vehicle technologies as well as the creation of an Innovation Centre. These investments will create 1,500 jobs and secure 8,000 jobs.</li>\n\t\t<li>In&nbsp;March 2017, with support from the federal and provincial governments, Ford Motor Company of&nbsp;Canada announced more than&nbsp;$1 billion&nbsp;in investments to establish a new connected vehicle research centre, and create and maintain almost 800 jobs.</li>\n\t\t<li>In&nbsp;January 2017, with support from the federal and provincial governments, Honda of Canada Manufacturing launched a project worth&nbsp;$492 million&nbsp;that will maintain Canadian jobs and support advanced and clean technologies.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.tmmc.ca/en/\" tabindex=\"108\">Toyota Motor Manufacturing Canada</a></li>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\" tabindex=\"109\">Strategic Innovation Fund</a></li>\n</ul></div>\n      "
}