{
  "path": "/en/news/statements/2017/05/03/statement-prime-minister-canada-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement for World Press Freedom Day: </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Every year, on May 3rd, we celebrate the fundamental principle of freedom of the press, and the important role journalists play in promoting democracy around the world. On this day, we take a hard look at the current state of press freedom, and pay tribute to journalists who have lost their lives in the pursuit of truth.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The theme of this year’s <a href=\"http://en.unesco.org/wpfd\">World Press Freedom Day</a> is ‘Critical Minds for Critical Times: Media’s role in advancing peaceful, just and inclusive societies.’ It reminds us that peace, justice and inclusiveness are foundational values for any society that empowers individual citizens and promotes government transparency and accountability.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The <i><a href=\"http://laws-lois.justice.gc.ca/eng/Const/page-15.html\">Canadian Charter of Rights and Freedoms</a></i> – now in its <a href=\"http://www.justice.gc.ca/eng/csj-sjc/charter-charte/index.html\">35<sup>th</sup> year</a> – established the freedom of the press as a fundamental freedom. Journalists start conversations, shine light on stories that would otherwise not be told, and give Canadians the facts they need to engage in public debate and shape events around them. A free and open press is crucial to an informed and engaged citizenry, which is at the heart of a healthy democracy.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“While journalistic freedom is widely recognized and respected in Canada, we cannot ignore the censorship, intimidation, false arrests and violence that many journalists face in other parts of the world. These acts give rise to fear and self-censorship, stifle societies, and undermine the right to freedom of expression. Canada will continue working to promote a vibrant and free press here and abroad.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we recognize the many journalists who seek out the truth, challenge assumptions and expose injustices, often at great personal risk. They are the cornerstones of any strong and healthy democracy, informing and challenging us all to think more critically about the world around us.”</span></p></div>\n      "
}