{
  "path": "/en/news/statements/2018/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to highlight <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada-days/multiculturalism-day.html\">Canadian Multiculturalism Day</a>:</p><p>“As the first country in the world to adopt a policy of multiculturalism, Canada has shown time and time again that diversity and inclusion are sources of strength, and at the heart of our success.</p><p>“One-fifth of Canadians were born elsewhere and chose to immigrate to Canada. Vibrant, progressive, and diverse, our towns and cities have become windows to the world because of the people who have made them home.</p><p>“While we have much to celebrate, we need to recognize that the Canadian reality has not been – and is not today – welcoming, fair, and equal for everybody.</p><p>“As Canadians, we must work even harder to create a level playing field that expands opportunity and gives a voice to all. Canada is successful and prosperous because generation after generation of Canadians have embraced this task, and challenged themselves, and each other, to broaden our understanding of what it means to be an open, compassionate, and accepting country.</p><p>“As we mark the 30<sup>th</sup> anniversary of the <a href=\"http://laws-lois.justice.gc.ca/eng/acts/C-18.7/page-1.html\">Canadian Multiculturalism Act</a>, I call on all Canadians to put our values into practice, and embrace the differences that make us strong. We are all custodians of Canada’s character.</p><p>“May we never forget, or take for granted, that Canada is an accepting, compassionate, and respectful country – and an example to the world – because we are accepting, compassionate, and respectful to each other.</p><p>“On behalf of the Government of Canada, I invite all Canadians to take part in the many activities being held across the country, and to take a moment to recognize and appreciate the valuable contributions that people of all backgrounds have made, and continue to make, to Canadian society.”</p></div>\n      "
}