{
  "path": "/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador",
  "pageTitle": "$10 a day child care for families in Newfoundland and Labrador  | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every child deserves the best possible start in life, and all parents should have the ability to build both a family and career. Yet, too many families across Canada lack access to affordable, inclusive, and high-quality child care. The global COVID-19 pandemic has also made it clear that without access to child care, too many parents – especially women – cannot fully participate in the workforce.</p>\n\n<p>That is why the Government of Canada has laid out a plan to provide parents in Canada with, on average, $10 a day regulated child care spaces for children under age six by 2025-26. This plan to build a Canada-wide, community-based early learning and child care system will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Newfoundland and Labrador, Andrew Furey, today announced an agreement that will support an average parent fee of $10 a day for regulated child care spaces in the province in 2023, significantly reducing the price of child care for families. The agreement will also support critical services, including new infant, toddler, and preschool spaces and a new full day, year-round pre-kindergarten ELCC program for four-year-old children in 2023, with the goal that every one of these children in the province has access to pre-kindergarten by 2025-26, no matter where they live. The pre-kindergarten program will be regulated and operated as a not-for-profit service. In addition, the agreement will grow a strong and skilled workforce of early childhood educators, including through the creation of a wage grid and greater opportunities for professional development.</p>\n\n<p>Through the agreement, the governments of Canada and Newfoundland and Labrador will work together to improve access to quality, affordable, flexible, and inclusive early learning and child care programs and services. This includes creating 5,895&nbsp;new regulated early learning and child care spaces within five years to ensure all families of children under age six can access child care. The federal funding of over $347&nbsp;million over the next five years also includes a one time investment of nearly $6.5&nbsp;million in 2021‑22 to support the early childhood workforce as well as over $34&nbsp;million for the 2021‑22 to 2024‑25 Canada–Newfoundland ELCC Extension Agreement.</p>\n\n<p>With this funding, Newfoundland and Labrador will see a reduction in average parent fees for children under the age of six in regulated child care from $25 a day to $15 a day in 2022, with further reduction to an average of $10 a day in 2023. It will expand not-for-profit and public delivery of early learning and child care. The agreement will also support a child care system that is inclusive of children with disabilities and children needing enhanced or individual supports.</p>\n\n<p>Since 2015, the government has been helping make life more affordable for families. This includes programs like the Canada Child Benefit, which was annually increased again last week to help families keep up with the costs of living and raising their children. The time for a Canada-wide early learning and child care system is now. The Government of Canada will continue to work with provinces, territories, and Indigenous partners across the country to make life easier and more affordable for families, grow the middle class, create jobs, help parents – especially mothers – return to the workforce, and give children across the country an equal chance to succeed.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to quality, affordable child care. That is why, from coast to coast to coast, we are laying the foundation for Canada’s first-ever Canada-wide early learning and child care system. Today’s agreement with Newfoundland and Labrador is an important step forward to making $10 a day child care a reality, and delivering much-needed support to families and communities as we build back better from the pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since the introduction of $25 per day child care this year, we have been at the forefront of affordable child care in this country, and we are thrilled to maintain our leadership position as one of the first provinces to announce plans for this important federal funding. Investments in early learning and child care are investments in our economy, and this plan will support affordability and access for all Newfoundland and Labrador families.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Andrew Furey, Premier of Newfoundland and Labrador</footer>\n</blockquote>\n\n<blockquote>\n<p>“Ensuring all Canadians have access to high-quality and affordable early learning and child care is feminist economic policy and smart economic policy. It is critical social infrastructure, over 50 years in the making, which will drive jobs and growth. By working with the Government of Newfoundland and Labrador on implementing the beginning of this historic investment, we will be giving every child in the province the best possible start in life, increasing women’s participation in the workforce, creating jobs, and making life more affordable for young families across Newfoundland and Labrador.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every child deserves the best possible start in life. Our vision for early learning and child care is big and ambitious, but I have confidence in us to get it done. Today’s historic agreement with Newfoundland and Labrador is another important step on the path to ensuring all families have access to high-quality, affordable, and inclusive child care.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In January 2021, the Government of Newfoundland and Labrador implemented its $25 a day child care system to help ease the financial pressures on families. To support the goal of ensuring access to quality, affordable, flexible, and inclusive early learning and child care, the Government of Canada will contribute more than $347&nbsp;million for child care in Newfoundland and Labrador over the next five years.</li>\n\t<li>In addition to the federal contribution, Newfoundland and Labrador currently invests approximately $60&nbsp;million in early learning and child care annually.</li>\n\t<li>The governments of Canada and Newfoundland and Labrador will create an Implementation Committee that will monitor progress on child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>Budget&nbsp;2021 provides new investments to build a high-quality, affordable, flexible, and inclusive early learning and child care system across Canada. These investments total up to $30&nbsp;billion over the next five years, and combined with previous investments announced since 2015, $9.2&nbsp;billion every year thereafter, permanently.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including nearly 1,200 in Newfoundland and Labrador.</li>\n\t<li>In addition to these investments, the Government of Canada is directly supporting parents, no matter how they choose to care for their children, through the Canada Child Benefit (CCB).\n\t<ul>\n\t\t<li>For over five years, the CCB has provided about $25&nbsp;billion in tax-free support per year to about 3.5&nbsp;million families, and is now providing families with over $350 more per child than when the program began.</li>\n\t\t<li>In 2021, the government is providing additional temporary support for families with children under the age of six through the CCB young child supplement. This helps Canadian families who are struggling with a range of unpredictable expenses during the pandemic, including temporary child care arrangements.</li>\n\t</ul>\n\t</li>\n\t<li>Investments in child care will benefit all Canadians. Studies show that for every dollar invested&nbsp;in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n\t<li>To promote greater gender equality at home and in the workplace, the Government of Canada has also introduced the Parental Sharing Benefit. This new measure provides an additional five weeks of Employment Insurance parental benefits when parents – including adoptive and same-sex parents – agree to share parental benefits.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada child benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/news/2021/05/ccb-young-child-supplement-2021.html\">CCB young child supplement, 2021</a></li>\n</ul></div>\n      "
}