{
  "path": "/en/news/statements/2022/01/10/statement-prime-minister-canada-formation-new-government-netherlands",
  "pageTitle": "Statement by the Prime Minister of Canada on the formation of a new government in the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in the Netherlands:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Prime Minister Mark Rutte on the formation of a new government in the Netherlands.</p>\n\n<p>“Canada and the Netherlands enjoy a rich and historic friendship built on common values and strong people-to-people ties. We are partners in several international organizations, including the United Nations, NATO, and the World Trade Organization. We collaborate closely on a number of shared priorities, from supporting the International Criminal Court, to improving aviation safety through the Safer Skies Initiative, and working to address the situation in Afghanistan. We are taking bold climate action through our commitments to put a price on pollution, invest in renewable energy, and advance climate adaptation. Our two countries are also proud to be co‑chairing the Media Freedom Coalition this year.</p>\n\n<p>“In October, I visited the Netherlands to discuss our shared priorities, and I look forward to continuing to work with Prime Minister Rutte, and collaborating with his new Cabinet, to reinforce the strong relationship between Canada and the Netherlands. Together, we will build back better from the COVID-19 pandemic as well as create jobs and economic growth for workers and businesses, including through the Canada‑European Union Comprehensive Economic and Trade Agreement. We will also continue to strengthen our partnership by working to fight climate change, protect human rights, and promote our shared values of democracy, justice, equality, peace, and security around the world.”</p></div>\n      "
}