{
  "path": "/en/news/news-releases/2018/05/28/prime-minister-announces-closer-digital-cooperation-estonia",
  "pageTitle": "Prime Minister announces closer digital cooperation with Estonia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the Prime Minister of Estonia, Jüri Ratas, to discuss how they will work together on some of the most pressing global issues and to create good, middle class jobs for Canadians and Estonians alike.</p><p>During their meeting, Prime Minister Trudeau and Prime Minister Ratas committed to broader cooperation on digital government and the digital economy. The memorandum of understanding on digital cooperation concluded today will allow our two countries to work on joint projects and share best practices to empower citizens, promote transparency, improve government services, and boost economic growth.</p><p>The two leaders also discussed the benefits of progressive trade and how the Comprehensive Economic and Trade Agreement (CETA)&nbsp;is helping to grow our economies and create new opportunities for Canadian and Estonian businesses.</p><p>In a joint statement released after their meeting, Prime Minister Trudeau and Prime Minister Ratas underlined their shared commitment to NATO and to maintaining security and stability in Central and Eastern Europe. They also highlighted the importance of working together to promote gender equality, protect the rules-based international order, and build economies that work for everyone.</p><h2>Quote</h2><blockquote><p>“Canada’s relationship with Estonia is flourishing, and we congratulate Estonia on the centenary of its independence. Estonia has long been a global leader in digital governance, harnessing the latest technologies to better serve its citizens. We look forward to working more closely with Estonia on digital projects that will create good, middle class jobs and improve the lives of people in both our countries.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Estonia enjoy a strong relationship, rooted in decades of cooperation and strong people-to-people bonds.</li><li>More than 24,000 Canadians are of Estonian descent, representing one of the largest Estonian diasporas in the world.</li><li>This is the first official meeting between Prime Minister Trudeau and Prime Minister Ratas.</li><li>As part of the celebrations to mark the 100th anniversary of Estonia’s independence, Prime Minister Ratas met with members of the Estonian‑Canadian community in Toronto.</li><li>Canada and Estonia collaborate closely within the United Nations, the Organization for Security and Co-operation in Europe, the Organisation for Economic Co-operation and Development, the North Atlantic Treaty Organization, the Digital7, and the Open Government Partnership.</li><li>Canada was the first country to ratify Estonia's accession to NATO in 2004. Since 2016, Canadian officers have been stationed in Tallinn, Estonia, as part of the NATO Forces Integration Unit in the country.</li><li>On September 21, 2017, the provisional application of CETA took effect. Estonia ratified CETA on October 4, 2017.</li><li>CETA will provide Canadian businesses with greater access to the world's largest integrated market, with over 510 million consumers and a GDP of $22&nbsp;trillion, and will help eliminate barriers in virtually all sectors and aspects of Canada-EU bilateral trade.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/backgrounders/2018/05/28/canada-estonia-joint-statement\">Canada-Estonia statement</a></li><li><a href=\"/en/news/news-releases/2018/05/22/estonian-prime-minister-jüri-ratas-visit-canada\">Estonian Prime Minister Jüri Ratas to visit Canada</a></li><li><a href=\"http://www.international.gc.ca/world-monde/estonia-estonie/relations.aspx?lang=eng\">Canada and Estonia relations</a></li></ul></div>\n      "
}