{
  "path": "/en/news/readouts/2021/12/01/prime-minister-justin-trudeau-speaks-secretary-general-united-nations",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Secretary-General of the United Nations António Guterres | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Secretary-General of the United Nations, António Guterres.</p>\n\n<p>The two leaders spoke about&nbsp;the situation in Ethiopia.</p>\n\n<p>Prime Minister Trudeau expressed appreciation for the Secretary-General’s efforts toward a peaceful resolution of the ongoing conflict in&nbsp;the northern part of the country, including through his calls for an immediate cessation of hostilities, inclusive dialogue among all parties, and unrestricted humanitarian access to those affected by the conflict.</p>\n\n<p>The&nbsp;Prime Minister reaffirmed Canada’s strong and ongoing commitment to supporting efforts to end&nbsp;the conflict peacefully, and&nbsp;emphasized the need to respect human rights and protect civilians.&nbsp;He expressed concerns about the disruption to livelihoods and food security for some of the most vulnerable people in Ethiopia.</p>\n\n<p>The&nbsp;two leaders&nbsp;also took the opportunity to exchange views on other shared priorities.&nbsp;They spoke about the importance of continuing to ensure a robust global response to COVID-19, noting&nbsp;the emergence of the new Omicron variant.&nbsp;They also discussed how they could&nbsp;continue to&nbsp;work together&nbsp;to&nbsp;promote the United Nations Sustainable Development Goals&nbsp;and&nbsp;to accelerate&nbsp;action on climate,&nbsp;with&nbsp;Canada playing a leadership role&nbsp;on&nbsp;advancing&nbsp;putting a price on pollution with international partners.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/22/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed\">Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/minister-of-foreign-affairs-urges-canadians-to-leave-ethiopia.html\">Minister of Foreign Affairs urges Canadians to leave Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/government-of-canada-introduces-additional-measures-to-address-covid-19-omicron-variant-of-concern.html\">Government of Canada introduces additional measures to address COVID-19 Omicron variant of concern</a></li>\n\t<li><a href=\"https://sdgs.un.org/goals\">United Nations Sustainable Development Goals</a></li>\n</ul></div>\n      "
}