{
  "path": "/en/news/statements/2015/11/16/g20-statement-fight-against-terrorism",
  "pageTitle": "G20 Statement on the Fight Against Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><img src=\"/sites/pm/files/media/logos/G20_Turkey_logo.jpg\" alt=\"G20 logo\"></p>\n<p></p>\n<ol>\n<li>We condemn, in the strongest possible terms, the heinous terrorist attacks in Paris on 13 November and in Ankara on 10 October. They are an unacceptable affront to all humanity. We extend our deepest condolences to the victims of terrorist attacks and their families. We reaffirm our solidarity and resolve in the fight against terrorism in all its forms and wherever it occurs.</li>\n<li>We remain united in combatting terrorism. The spread of terrorist organizations and significant rise globally in acts of terrorism directly undermine the maintenance of international peace and security and endangers our ongoing efforts to strengthen the global economy and ensure sustainable growth and development.</li>\n<li>We unequivocally condemn all acts, methods and practices of terrorism, which cannot be justified under any circumstances, regardless of their motivation, in all their forms and manifestations, wherever and by whomsoever committed.</li>\n<li>We reaffirm that terrorism cannot and should not be associated with any religion, nationality, civilization or ethnic group.</li>\n<li>The fight against terrorism is a major priority for all of our countries and we reiterate our resolve to work together to prevent and suppress terrorist acts through increased international solidarity and cooperation, in full recognition of the UN’s central role, and in accordance with UN Charter and obligations under international law, including international human rights law, international refugee law and international humanitarian law, as well as through the full implementation of the relevant international conventions, UN Security Council Resolutions and the UN Global Counter Terrorism Strategy.</li>\n<li>We also remain committed to tackling the financing channels of terrorism, particularly by enhanced cooperation on exchange of information and freezing of terrorist assets, criminalization of terrorist financing and robust targeted financial sanctions regimes related to terrorism and terrorist financing, including through swift implementation of Financial Action Task Force (FATF) standards in all jurisdictions. We will continue to implement relevant FATF recommendations and instruments. We call on FATF to identify measures, including pertaining to legal framework, to strengthen combatting of terrorism financing and targeted financial sanctions and implementation thereof.</li>\n<li>Our counter terrorism actions must continue to be part of a comprehensive approach based on addressing the conditions conducive to terrorism as stipulated in UN Security Council Resolution 2178, countering violent extremism, combatting radicalization and recruitment, hampering terrorist movements, countering terrorist propaganda and to prevent terrorists from exploiting technology, communications and resources to incite terrorist acts, including through the internet. The direct or indirect encouragement of terrorism, the incitement of terrorist acts and glorification of violence must be prevented. We recognize the need at all levels to work proactively to prevent violent extremism and support civil society in engaging youth and promoting inclusion of all members of society.</li>\n<li>We are concerned over the acute and growing flow of foreign terrorist fighters and the threat it poses for all States, including countries of origin, transit and destination. We are resolved to address this threat by enhancing our cooperation and developing relevant measures to prevent and tackle this phenomenon, including operational information-sharing, border management to detect travel, preventive measures and appropriate criminal justice response. We will work together to strengthen global aviation security.</li>\n<li>The continued and recent terrorist attacks all across the world have shown once again the need for increased international cooperation and solidarity in the fight against terrorism. We will always remember the victims of these attacks.</li>\n</ol></div>\n      "
}