{
  "path": "/en/news/statements/2022/07/05/statement-prime-minister-canada-ratifying-finland-and-swedens-accession",
  "pageTitle": "Statement by the Prime Minister on Canada ratifying Finland and Sweden’s Accession Protocols to join NATO | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada ratifying Finland and Sweden’s Accession Protocols to join NATO.</p>\n\n<p>“Today, Canada, became the first country to ratify the Accession Protocols of Finland and Sweden to join NATO. This brings the two countries a step closer to full membership.</p>\n\n<p>“As a close friend and security partner, Canada strongly supports Finland and Sweden joining NATO. At the NATO Summit last week, I met with the President of Finland, Sauli Niinistö, and the Prime Minister of Sweden, Magdalena Andersson, to directly reiterate Canada’s strong support.</p>\n\n<p>“Canada has full confidence in Finland and Sweden’s ability to integrate quickly and effectively into NATO and contribute to the Alliance’s collective defence. We have always welcomed their close partnership with the Alliance and their valuable contributions to transatlantic security. Their membership will make NATO stronger and we call on all NATO members to move swiftly to complete their ratification processes to limit opportunities for interference by adversaries.</p>\n\n<p>“At home, Canada took steps to be able to ratify the Protocols as quickly as possible. In addition, the House of Commons voted unanimously in favour of Finland and Sweden joining the Alliance.</p>\n\n<p>“As a founding member of NATO, Canada remains a champion of NATO’s Open Door Policy for any European country in a position to advance the commitments and obligations of membership, such as protecting democracy, and contributing to the collective defence of the Alliance.”</p>\n\n<p>“NATO will continue to promote stability and cooperation in the region, united in peace, democracy and shared values.”</p></div>\n      "
}