{
  "path": "/en/news/statements/2017/09/28/statement-prime-minister-thank-outgoing-governor-general-canada-his",
  "pageTitle": "Statement by the Prime Minister to thank the outgoing Governor General of Canada, His Excellency the Right Honourable David Johnston | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">T</span><span lang=\"EN\" xml:lang=\"EN\">he Prime Minister, Justin Trudeau, today issued the following statement to thank the outgoing Governor General of Canada, His Excellency the Right Honourable David Johnston:</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“On October 2nd, 2017, His Excellency the Right Honourable David Johnston will return to private life after holding this country’s highest and oldest office. His Excellency served with the utmost dedication and dignity, remarkable intelligence, and exceptional character. He did so not for the customary term of five years, but for an extraordinary seven.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“As Canada’s 28th Governor General, His Excellency brought tenacity, drive, and deep compassion to the accomplishment of his duties as the representative of our Monarch, Her Majesty Queen Elizabeth II. He proudly served as the 11th Governor General of Canada under her reign. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Together with Her Excellency Sharon Johnston, the Governor General focused his mandate on supporting learning, innovation, and civic engagement. He advocated staunchly for education and for the needs of families and young people, worked to promote diversity and inclusion, and exemplified his belief in Canadians’ ability to create a more caring country and a more just world.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Throughout his term, His Excellency prioritized connecting with the people he served. He visited all corners of our country to do so, and represented Canadians and their values in his travels around the world. His service has left an indelible imprint on the Office of the Governor General, and shaped Canada for the better.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“In recognition of his contributions and as is customary in these instances, I am proud to announce a gift to the Governor General from the Government of Canada. In his honour, the <a href=\"http://www.rhf-frh.ca/\">Rideau Hall Foundation</a></span><span lang=\"EN-US\" xml:lang=\"EN-US\"> – which His Excellency helped found in 2012 – </span><span lang=\"EN\" xml:lang=\"EN\">will receive a $3 million grant and up to $7 million in matching funds over a 10-year period. This funding will help the Rideau Hall Foundation continue its important work to connect people, ideas, and resources. It will support initiatives that strengthen our identity</span><span lang=\"EN-US\" xml:lang=\"EN-US\">,</span><span lang=\"EN\" xml:lang=\"EN\"> amplify the reach of the Office of the Governor General, and help build a stronger Canada.</span></p><p>“Your Excellencies, Sophie and I thank you for all you have done in service to Canada and Canadians. Your dedication is an example for all of us. Our country is stronger because of you.”</p></div>\n      "
}