{
  "path": "/en/news/readouts/2022/04/26/prime-minister-justin-trudeau-speaks-president-moldova-maia-sandu",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Moldova Maia Sandu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Moldova, Maia Sandu.</p>\n\n<p>Prime Minister Trudeau and President Sandu discussed recent incidents of concern for peace and security in Moldova and the devastating impacts of Russia’s illegal and unjustifiable invasion of Ukraine, particularly for refugees fleeing their homes to seek safety in Moldova. Prime Minister Trudeau expressed thanks and admiration for President Sandu’s strong personal leadership and for the resilience and support of the Moldovan people through this ongoing crisis in welcoming so many Ukrainians in need of safety, shelter, and humanitarian assistance. President Sandu underscored that Moldova would keep doing everything in its power to help all Ukrainians, especially during these distressing times.</p>\n\n<p>Prime Minister Trudeau reiterated that Ukrainian and Moldovan security are European security, and the security of all democratic states seeking to uphold fundamental principles of international law and state sovereignty.</p>\n\n<p>The two leaders agreed to stay in close contact and assess how Canada can best support Moldova, including through initiatives like the Moldova Support Conference that Canada attended in Berlin, Germany, on April 5, and which helped raise over 135 million euros to support humanitarian efforts in the country.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/romania-roumanie/bilateral_relations_bilaterales/canada_moldova.aspx?lang=eng\">Canada-Republic of Moldova Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/26/prime-minister-justin-trudeau-speaks-president-moldova-maia-sandu\">Prime Minister Justin Trudeau speaks with President of Moldova Maia Sandu</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/04/minister-joly-meets-with-moldovan-counterpart.html\">Minister Joly meets with Moldovan counterpart</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}