{
  "path": "/en/news/statements/2021/10/11/statement-prime-minister-thanksgiving",
  "pageTitle": "Statement by the Prime Minister on Thanksgiving | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Thanksgiving:</p>\n\n<p>“Today, whether virtually or in person, Canadians across the country will celebrate Thanksgiving with their loved ones and reflect on their blessings from the past year.</p>\n\n<p>“Harvest season is a time for us to appreciate our communities. As many of us gather today to enjoy a good meal with family and friends, we acknowledge our farmers, food businesses, and food suppliers who work tirelessly to ensure that Canadians can safely and reliably put food on the table.&nbsp;Our food banks and local food organizations have also done an extraordinary job at helping Canadians across the country – particularly our most vulnerable people and communities – have access to good, high-quality, and nutritious food, despite the challenges of the past year and a half.</p>\n\n<p>“Since the start of the COVID-19 pandemic, Canadians of all backgrounds have shown countless acts of kindness. They have helped one another by donating to food banks, volunteering to assist the most vulnerable, and demonstrating what it means to love their neighbours. This year, I encourage everyone to show compassion to those in need and give back – that is the meaning of Thanksgiving. It is this spirit that makes Canada a stronger, more inclusive, and prosperous country.</p>\n\n<p>“As we continue the fight against COVID-19, Thanksgiving provides us with an opportunity to give thanks to the front-line health care workers who have gone above and beyond to provide care and support to Canadians throughout this pandemic. We also salute the Canadian Armed Forces and the Canadian Red Cross for sending resources and help those in the areas hardest hit by this crisis.</p>\n\n<p>“While Thanksgiving may look different again this year, we need to continue to follow local public health advice, including on gathering size limits, and practice public health measures like staying home when we’re sick, washing our hands, wearing our masks, and improving indoor ventilation. For those who have not already done so, I encourage you to get fully vaccinated as soon as possible to protect yourself and others, including those that are not yet eligible for the COVID-19 vaccine.<em> </em></p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish everyone a happy Thanksgiving. This year, let’s show our thanks to every Canadian for their contribution to our country’s peace, prosperity, and strength.”</p></div>\n      "
}