{
  "path": "/en/news/readouts/2021/06/29/prime-minister-justin-trudeau-speaks-palestinian-authority-president",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Palestinian Authority President Mahmoud Abbas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Palestinian Authority President Mahmoud Abbas.</p>\n\n<p>Prime Minister Trudeau discussed political and security developments in the region with President Abbas. The President thanked the Prime Minister for Canada’s recently announced assistance to the Palestinian people and efforts to ensure equitable and efficient access to vaccines through the COVAX Facility.</p>\n\n<p>Prime Minister Trudeau underscored his firm belief in the right of Palestinians and Israelis to live with dignity, without fear, and with their human rights respected. The Prime Minister reaffirmed Canada’s commitment to the goal of a comprehensive, just, and lasting peace in the Middle East, including the creation of a Palestinian state living side-by-side in peace and security with Israel. He noted Canada’s opposition to unilateral actions that prejudge the outcome of direct negotiations or jeopardize the prospects for peace. Prime Minister Trudeau and President Abbas agreed that peace will only be reached through direct negotiations with international support.</p>\n\n<p>Prime Minister Trudeau highlighted Canada’s dedication to democratic principles and processes, and the importance of upholding freedom of expression for political figures and members of civil society.&nbsp;In this context, the two leaders discussed the importance of holding fair and open Palestinian elections in a timely manner.</p>\n\n<p>Prime Minister Trudeau noted Minister Garneau’s upcoming trip to the region. The Prime Minister and President looked forward to working together to further the peace process and address humanitarian challenges.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/west_bank_gaza-cisjordanie_bande_de_gaza/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-West Bank and Gaza Strip Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/prime-minister-announces-assistance-palestinians-affected-recent\">Prime Minister announces assistance for Palestinians affected by the recent violence in Gaza and the West Bank</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/statement-by-the-minister-of-foreign-affairs-on-the-situation-in-israel-the-west-bank-and-gaza.html\">Statement by the Minister of Foreign Affairs on the situation in Israel, the West Bank, and Gaza</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/minister-of-foreign-affairs-to-travel-to-italy-middle-east-and-lithuania.html\">Minister of Foreign Affairs to travel to Italy, Middle East, and Lithuania</a></li>\n</ul></div>\n      "
}