{
  "path": "/en/news/statements/2018/11/18/statement-prime-minister-latvias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Latvia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Latvia’s Independence Day:</p><p>“Today, we join Latvian communities in Canada and around the world to celebrate the 100th anniversary of Latvia’s independence.</p><p>“Canada and Latvia enjoy a special relationship, rooted in our shared values of freedom, democracy, and the rule of law, as well as our enduring people-to-people ties made strong by the more than 28,000 Canadians of Latvian heritage.</p><p>“Canada was the first G7 country to recognize the restoration of Latvia's independence in 1991, and one of the first countries to ratify Latvia's accession to the North Atlantic Treaty Organization (NATO) in 2004. Canada leads the multinational NATO enhanced Forward Presence Battle Group Latvia, and contributes approximately 540 troops to this effort, as part of Operation REASSURANCE.</p><p>“Canada and Latvia also share close commercial ties. In February 2017, Latvia became the first member state of the European Union to ratify the Canadian-European Union Comprehensive Economic and Trade Agreement and the Strategic Partnership Agreement. We will continue to work together to strengthen our commercial relationship and grow our economies for the benefit of people in both our countries.</p><p>“During my visit to Latvia this past July, I had the chance to meet with Prime Minister Māris Kučinskis and President Raimonds Vējonis to further strengthen the close friendship our two countries share. I also reaffirmed Canada’s commitment to supporting NATO assurance and deterrence measures in Eastern and Central Europe. I&nbsp;look forward to building on our strong partnership to create new opportunities for Canadians and Latvians alike.</p><p>“On behalf of the Government of Canada, I invite all Canadians to recognize the many ways the Latvian-Canadian community continues to contribute to our country’s success. I offer my best wishes to everyone celebrating Latvia's centenary.”</p></div>\n      "
}