{
  "path": "/en/news/news-releases/2016/11/20/prime-minister-justin-trudeau-concludes-productive-visit-peru-and",
  "pageTitle": "Prime Minister Justin Trudeau concludes productive visit to Peru and to the APEC Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the Asia Pacific Economic Cooperation (APEC) Leaders’ Meeting hosted by Peru.</p><p>During the meeting, the Prime Minister worked closely with his counterparts to promote a progressive trade agenda that builds a stronger middle class, and ensures the benefits of an open global trading environment are fairly distributed and felt by everyone.</p><p>The Prime Minister also discussed the importance of well targeted public investments that create opportunities for all segments of the population. He discussed how Canada is engaging constructively on key international challenges, including economic governance and climate change.</p><p>On the margins of the Leaders’ Meeting, Prime Minister Trudeau held fruitful discussions with Peruvian President, Pedro Pablo Kuczynski. The two leaders discussed ways to achieve closer cooperation on shared foreign policy objectives and regional security priorities. They also agreed to enhance commercial exchanges, particularly in the areas of defence, infrastructure, energy, education, and health.</p><p>Finally, the Prime Minister met with his counterparts from other APEC member economies including Australia, Mexico, the US, and Vietnam to discuss issues of mutual interest. He also met with Mitsubishi Heavy Industries to discuss the expansion of its Canadian operations.</p><h2>Quotes</h2><blockquote><p>“I would like to thank President Kuczynski for his hospitality and for his leadership as host of APEC this year. We are pleased to work with APEC economies to promote growth and create more opportunities for our citizens to succeed and prosper. Canada feels strongly that trade and investment with other APEC economies, and support for our small and medium sized enterprises, are critical to our country’s economic future and middle class growth.”<br>–&nbsp;<cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Peru remains&nbsp;a key partner for Canada in the Americas. Our two countries enjoy a rich and multifaceted relationship, with strong commercial, political, development, and defence cooperation. We also share similar values with respect to democracy, good governance, multilateralism, and open markets.”<br>–&nbsp;<cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Canada was a founding member of the APEC forum in 1989 and has been active in helping APEC achieve its current status.</li><li>Canada and Peru enjoy a strong and dynamic commercial relationship. In August 2009, the Canada-Peru Free Trade Agreement and parallel agreements on labour cooperation and the environment entered into force, enhancing a trade relationship that has grown substantially over the years. Since then, Peru has continued to grow as a key partner for Canada in the Americas.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li><li><a href=\"http://www.canadainternational.gc.ca/peru-perou/bilateral_relations_bilaterales/canada_peru-perou.aspx?lang=eng\">Canada-Peru Relations</a></li><li><a href=\"http://www.international.gc.ca/apec/declarations.aspx?lang=eng\">APEC Declarations and Statements</a></li></ul></div>\n      "
}