{
  "path": "/en/news/statements/2021/06/13/statement-prime-minister-formation-new-government-israel",
  "pageTitle": "Statement by the Prime Minister on the formation of a new government in Israel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in Israel:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Prime Minister Bennett and Alternate Prime Minister Lapid on the formation of a new Israeli government.</p>\n\n<p>“Canada and Israel are close friends bound together by shared democratic values, a long history of cooperation, and vibrant people-to-people ties. Throughout the years, we have joined efforts on a number of common priorities, including through advancing education, science, and innovation, combatting antisemitism in all its forms, and promoting peace and stability in the Middle East.</p>\n\n<p>“I look forward to working with Prime Minister Bennett and Alternate Prime Minister Lapid to keep our people safe and supported as we recover from the global COVID-19 pandemic, and help both of our countries build back better. Together, we will explore ways to further strengthen the relationship between Canada and Israel, expand bilateral trade and investment, and create new opportunities and jobs for our people, including through the modernized Canada-Israel Free Trade Agreement.</p>\n\n<p>“Canada remains steadfast in its commitment to a two-state solution, with Israelis and Palestinians living in peace, security, and dignity – without fear and with their human rights respected.&nbsp;Canada will continue to promote lasting peace and security in the region.</p>\n\n<p>“I thank former Prime Minister Benjamin Netanyahu for his valuable partnership over the years, at a time when Canada and Israel achieved a great deal together.”</p></div>\n      "
}