{
  "path": "/en/news/statements/2022/12/12/statement-prime-minister-death-honourable-jim-carr",
  "pageTitle": "Statement by the Prime Minister on the death of the Honourable Jim Carr | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of the Honourable Jim Carr:</p>\n\n<p>“It is with profound sadness and a heavy heart that I learned today of the passing of Jim Carr, Member of Parliament for Winnipeg South Centre, former cabinet minister, and a close friend of mine. His passion, tenacity, integrity, humour, and commitment to the Prairies were second to none.</p>\n\n<p>“A dedicated Parliamentarian, Jim started his career in politics in 1988, when he became the elected representative for Fort Rouge in the Legislative Assembly of Manitoba. He was elected to the House of Commons in 2015 and served in various roles while in federal public office, including as Minister of Natural Resources, Minister of International Trade Diversification, and most recently as Special Representative for the Prairies. Jim previously worked as a musician and a journalist. He was a respected business and community leader, an active volunteer, and the recipient of many awards and accolades, including the Queen Elizabeth&nbsp;II Diamond Jubilee Medal and the Order of Manitoba.</p>\n\n<p>“Jim’s love for public service shone through until the very end of his life: just last week, his private member’s bill 'Building a Green Prairie Economy' passed through the House of Commons. While he fought multiple myeloma and kidney failure, he was also fighting for a bill that would help build a better, healthier future. He knew it was not about his future. It was about ours, about his kids’ and his grandkids’ futures. It was about preserving the Prairie way of life for them: where there are good, secure jobs and thriving local economies. The bill recognizes the power of our resources, both natural and human, that will drive the transition to a clean future with Canada’s Prairies at the helm.</p>\n\n<p>“When the bill passed, Jim was in the House of Commons, where he stood and spoke to the power of partnership: ‘[Democracy] is always rooted in strengthening the national fabric, woven as it is from those many threads that make Canada the envy of the world,’ he said. Jim was a bridge-builder. He sought to unite people – from all sides of the House of Commons, from all regions of our country, and from all backgrounds and experiences. The bill has partnership at the very heart of it – a core value of his that he brought to his work in Parliament every day.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our most sincere condolences to Jim’s family and friends, as we mourn his passing. His contributions to our country, and his commitment to fighting for Winnipeggers, Manitobans, and all Canadians, will never be forgotten. May his memory be a blessing.”</p></div>\n      "
}