{
  "path": "/en/news/news-releases/2022/03/30/supporting-healing-those-impacted-st-josephs-mission-residential",
  "pageTitle": "Supporting healing for those impacted by St. Joseph’s Mission Residential School | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The finding of unmarked graves near former residential schools across the country is a tragic reminder of the painful and lasting impacts of colonialism, and the important work that remains to be done to advance reconciliation in Canada. The Government of Canada is supporting Survivors, their families, and their communities to address historical wrongs, as well as the physical, emotional, mental, and spiritual harms inflicted from residential schools.</p>\n\n<p>The Prime Minister, Justin Trudeau, and Chief Willie Sellars of Williams Lake First Nation today announced $2.9&nbsp;million in additional funding to continue supporting healing for First Nations communities in British Columbia whose children were taken from their families and sent to St. Joseph’s Mission Residential School. This funding builds on the $1.4&nbsp;million that Canada provided earlier this year to help uncover potential burial sites at the former residential school.</p>\n\n<p>This new funding will help the community continue conducting research, including Survivor interviews, to further uncover the truth about what happened at the school and begin the process of healing.</p>\n\n<p>Earlier this year, Williams Lake First Nation released preliminary findings believed to be unmarked graves at the former St. Joseph’s Mission Residential School. Today’s announcement will also support plans for a temporary commemorative structure in the area which will provide a safe place for people to gather and pay their respects. This community-led initiative will help impacted communities continue on their healing journey.</p>\n\n<p>The Government of Canada supports all communities in their efforts to work together to develop an engagement strategy with the more than 50 surrounding First Nations affected by the former residential school. The community-based initiative will incorporate appropriate cultural protocols that reflect the diversity of communities impacted, including cultural healing work and ceremonies for Survivors, families, and communities.</p>\n\n<p>Addressing the harms suffered by residential school Survivors, their families, and their communities is essential to renewing and building Canada’s relationship with Indigenous Peoples. We will continue to support this painful but necessary work across the country to locate unmarked graves, continue to tell the stories of what happened at residential schools, and ensure the appropriate supports are available for communities to heal and commemorate those who never made it home.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“For Survivors, their families, and their communities, the pain inflicted at St. Joseph’s Mission Residential School is deep and lasting. We will continue to support Williams Lake First Nation and surrounding communities in uncovering the difficult truth of what happened to the children that were taken from their families, so they can begin the process of healing.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The first phase of our investigation has revealed more of the painful truth about St.&nbsp;Joseph’s and Canada’s residential school experience. There is a huge amount of work still to be done, and we’re thankful that Canada continues to support our efforts. Williams Lake First Nation is committed to uncovering the truth with respect to St.&nbsp;Joseph’s and to finding a path forward so that our members, and all of Canada, can heal.”</p>\n\n<footer class=\"default\">Chief Willie Sellars, Williams Lake First Nation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Williams Lake First Nation has already begun the difficult work of gathering information to uncover the truth of what happened to their children and those who were taken from surrounding communities to attend the former St.&nbsp;Joseph’s Mission Residential School. The Government of Canada will continue to support the community’s efforts as they address the needs of Survivors, their families, and the community at their own pace.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Crown-Indigenous Relations</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Williams Lake First Nation includes a growing population of over 800 registered members who live on reserve in Sugar Cane, in nearby Williams Lake, British Columbia, and across the globe.</li>\n\t<li>On January 7, 2022, the Government of Canada announced funding of $1,437,460 for Williams Lake First Nation to undertake work related to burial sites associated with the former St. Joseph’s Mission Residential School, including completing a preliminary investigation that includes interviews with former students and their families, an initial geophysical survey, and the compilation of archival and photographic records related to the disappearances and deaths of First Nations students at this institution.</li>\n\t<li>On January 25, 2022, the community of Williams Lake First Nation released preliminary geophysical findings of anomalies believed to be unmarked burial sites at the location of the former St. Joseph’s Mission Residential School. The results revealed 93 ground reflections that require further analysis. Fifty of those reflections are outside the known local cemetery.</li>\n\t<li>In August 2021, the Government of Canada announced approximately $321&nbsp;million in additional support for Indigenous-led, Survivor-centric, and culturally informed initiatives and investments to help Indigenous communities respond and heal from the ongoing impacts of residential schools.</li>\n\t<li>In total, the Government of Canada has invested $354.8&nbsp;million in responding to the Truth and Reconciliation Commission Calls to Action 72 to 76 to support communities in finding unmarked burial sites at former residential schools and beginning the process of healing.</li>\n\t<li>So far, the Government of Canada has supported 70 communities, including 17 in British Columbia for a total of $22.4&nbsp;million.</li>\n\t<li>The <a href=\"https://www.sac-isc.gc.ca/eng/1581971225188/1581971250953\">Indian Residential Schools Resolution Health Support Program</a> provides mental health, emotional, and cultural support services to Survivors of residential schools and their families.</li>\n\t<li>A <a href=\"https://www.sac-isc.gc.ca/eng/1581971225188/1581971250953\">National Residential School Crisis Line</a> is available to access emotional and crisis referral services by calling the 24-Hour National Crisis Line at 1-866-925-4419.</li>\n\t<li>The <a href=\"https://www.hopeforwellness.ca/\">Hope for Wellness Help Line</a> is also available at 1-855-242-3310 or via the online chat function through their website.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.wlfn.ca/\">Williams Lake First Nation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2022/01/canada-and-province-of-british-columbia-support-williams-lake-first-nations-research-and-commemoration-activities-at-former-residential-school.html\">Canada and Province of British Columbia support Williams Lake First Nation’s research and commemoration activities at former residential school</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2021/08/government-of-canada-enhances-support-to-indigenous-communities-to-respond-to-and-heal-from-the-ongoing-impacts-of-residential-schools.html\">Government of Canada enhances support to Indigenous communities to respond to and heal from the ongoing impacts of residential schools</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1581971225188/1581971250953\">Indian Residential Schools Resolution Health Support Program</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1524504992259/1557512149981\">Missing children and burial information</a></li>\n</ul></div>\n      "
}