{
  "path": "/en/news/readouts/2020/01/11/prime-minister-justin-trudeau-speaks-hassan-rouhani-president-islamic",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Hassan Rouhani, President of the Islamic Republic of Iran | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with President Hassan Rouhani of Iran regarding the shooting down of the Ukraine International Airlines plane, for which Iran has admitted responsibility.</p>\n\n<p>President Rouhani conveyed his profound regret for the shooting down of the aircraft by the Iranian military. The Prime Minister said that this is an important first step for Iran. He noted that Canadians were angry, hurt and grieving, and said it was imperative that there be justice, accountability, and compensation for the families of the victims. The Prime Minister insisted on the need for a complete and thorough investigation. The President agreed and committed to ensure international participation including from Canada. The Prime Minister reaffirmed that Canada was ready to deploy air safety experts to facilitate black box examination and DNA specialists to assist with victim identification and the return of remains to Canada. The Prime Minister was encouraged by President Rouhani’s commitment to facilitate access to Iran of Canada’s consular and aviation experts in the efforts to support the families affected by this tragedy and the related investigation.</p>\n\n<p>Prime Minister Trudeau condemned Iranian rocket attacks on January 8, 2020 that put the lives of Canadians at risk in Erbil, Iraq. In discussing the situation in the region, the Prime Minister and the President agreed on the importance of de-escalation and dialogue to reduce tensions and promote stability in the region. The Prime Minister noted how the shooting down of the aircraft was an example of how heightened tensions can have tragic consequences for innocent civilians.&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Rouhani agreed to continue dialogue between the two countries on this matter in the effort to alleviate the pain of people in Canada, Iran and other countries affected by this tragedy.&nbsp;The Prime Minister underscored the profound impact this tragedy has had on the large Iranian-Canadian community – and on all Canadians – across the country. The President acknowledged their deep loss and underscored the importance of foreign ministers and officials from the two countries working together, including through the International Coordination and Response Group for families and victims of flight 752.</p></div>\n      "
}