{
  "path": "/en/news/news-releases/2019/04/04/budget-2019-investments-help-canadian-students-and-workers-find-and",
  "pageTitle": "Budget 2019 investments to help Canadian students and workers find and keep good jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The nature of work is changing, and Canadians need the right skills to take on the jobs of tomorrow. The Government of Canada is working to help Canadian students and workers of all ages get ahead in today’s economy and build a better future for themselves and their families.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Alma, Quebec, to highlight how Budget 2019 will help Quebecers – and all Canadians – succeed in a rapidly changing job market and an increasingly competitive global economy.</p>\n\n<p>Introduced in Budget 2019, the new Canada Training Benefit will help workers gain the skills they need. The Benefit will provide a credit to help workers pay for training, as well as up to four weeks of income support through a new Employment Insurance Training Support Benefit, so they can take time off work to pursue training. The government will also consult with provinces and territories on changes to labour laws to protect jobs, so that workers can take the time they need to keep their skills up‑to‑date and in-demand.</p>\n\n<p>Through Budget 2019, the government is also helping more young Canadians pursue the careers of their choice, by enhancing support for apprenticeships and making post‑secondary education more affordable. New measures will also support post-secondary education for First Nations, Inuit, and Métis students, and help them gain the skills they need to succeed.</p>\n\n<p>With new investments in student work placements, Budget 2019 is a significant step toward providing a work placement for every student who wants one. Young Canadians will also benefit from support for service experiences through the Canada Service Corps, and opportunities to work or study abroad, giving them an advantage in our global economy.</p>\n\n<p>Canadians are among the most skilled and highly educated workers in the world. With this year’s budget, the Government of Canada is helping Canadians develop their skills throughout their working lives, so they can build good careers and benefit from Canada’s growing economy.</p>\n\n<h2><strong>Quotes</strong></h2>\n\n<blockquote>\n<p>“With the changing nature of work, people need to upgrade their skills more often – or learn new ones. But that’s easier said than done. That’s why our government decided to change things, and support workers who want to get their skills up to speed. Thanks to our plan, we’re helping Canadians across the country to succeed in the economy of today and tomorrow.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canada Training Benefit is about giving workers the two things they need most to upgrade their skills: time and money. These measures will help Canadians find and keep good, well-paying jobs and ensure everyone has a fair chance at success – not just for today but for the future of work in Canada.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Employment, Workforce Development and Labour</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Organisation for Economic Co-operation and Development estimates that one in ten Canadian jobs are at high risk of automation, with about one in three jobs likely to experience significant change as a result of automation.</li>\n\t<li>The Government of Canada makes significant investments in skills development – close to $7.5 billion annually. More than $3 billion of this programming is delivered in partnership with the provinces, territories and Indigenous groups, and targets students and Canadians who are unemployed.</li>\n\t<li>Introduced in Budget 2019, the Canada Training Benefit will provide a typical Canadian worker, after four years, with $1,000 Canada Training Credit balance, which can be claimed fully against training and tuition fees of $2,000 or more. In addition, the EI Training Support Benefit will provide up to four weeks of income support, paid at 55 per cent of average weekly earnings.</li>\n\t<li>Budget 2019 investments will also create up to 84,000 new student work placements per year by 2023-2024 for young people to learn new skills, build their resumes, and help them start their careers.</li>\n\t<li>With many municipalities across Canada facing serious infrastructure needs, Budget 2019 also proposes a one-time transfer of $2.2 billion through the federal Gas Tax Fund to address short-term priorities in municipalities and First Nations communities, including $504 million for Quebec. This top-up will double the amount of money that municipalities get through the gas tax transfer for 2018-19, and give much needed support for local priorities.</li>\n\t<li>In 2016, the Government of Canada launched the biggest infrastructure plan in Canadian history. Since then, we have approved thousands of infrastructure projects across Canada and invested over $56 million in the Saguenay–Lac-Saint-Jean region, including projects that result in improvements to transportation routes, public transit, sports centres, and access to drinking water.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2019/docs/plan/toc-tdm-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://budget.gc.ca/2019/docs/themes/good-jobs-de-bons-emplois-en.html\">The Canada Training Benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html\">Canada Service Corps</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/youth-jeunes/youth-jeunes-en.pdf\">Investing in Young Canadians</a></li>\n</ul></div>\n      "
}