{
  "path": "/en/news/news-releases/2019/11/14/governor-general-canada-visit-lithuania-and-estonia",
  "pageTitle": "Governor General of Canada to visit Lithuania and Estonia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Lithuania and Estonia, from November 24 to 28, 2019.</p>\n\n<p>In Lithuania, the Governor General will meet with President Gitanas Nausėda and Prime Minister Saulius Skvernelis as well as local experts to discuss opportunities for closer collaboration between our two countries. She will lay a wreath at the Antakalnis Cemetery in honour of fallen Lithuanian service members, and promote science and innovation during discussions at Vilnius Tech Park and at the Santaka Valley KTU Science, Technology and Business Centre in Kaunas.</p>\n\n<p>The Governor General will then travel to Estonia, where she will meet with President&nbsp;Kersti Kaljulaid and Prime Minister Jüri Ratas. She will also visit the NATO Cooperative Cyber Defence Centre of Excellence, and participate in several events to promote science and technology.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada shares strong relationships with both Lithuania and Estonia, based on common values and cooperation. This visit is a chance for the Governor General to deepen our people-to-people ties and look for ways we can work more closely together. We will continue to stand united with Lithuania and Estonia, and keep working with these partners and other NATO Allies to advance peace and stability around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Governor General Julie Payette’s first official visit to both Lithuania and Estonia.</li>\n\t<li>This is the second time Her Excellency travels to the region since becoming Governor General. In 2018, she travelled to Latvia to meet with and show her support to Canadian Armed Forces members serving on Operation REASSURANCE.</li>\n\t<li>Canada and Estonia enjoy a strong relationship, rooted in decades of cooperation and strong people-to-people ties. Today, Canada is home to one of the largest Estonian diasporas in the world.</li>\n\t<li>Canada and Lithuania work together internationally on issues of human rights and diversity, including addressing human trafficking, advancing gender equality and LGBTQ2 rights, and promoting social inclusion.</li>\n\t<li>Canada, Estonia, and Lithuania are active members of the United Nations, NATO, and the Organization for Security and Co-operation in Europe.</li>\n\t<li>On September 21, 2017, the provisional application of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) took effect.</li>\n\t<li>CETA provides opportunities to strengthen the bilateral economic relationship with both countries. Since CETA entered into force (between October 2017 up to September 2019), Canada’s two-way trade increased by 19 percent with Estonia and 35 percent with Lithuania.</li>\n\t<li>Canada was the first country to ratify Estonia and Lithuania’s accession to NATO in 2004. Since 2016, Canada has participated in the NATO Forces Integration Unit in Estonia and Lithuania.</li>\n\t<li>Canada supports NATO’s strengthened deterrence and defence posture in the Baltic region and NATO’s enhanced Forward Presence, which includes the deployment of multinational battlegroups in Latvia, Estonia, Lithuania, and Poland.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/estonia-estonie/relations.aspx?lang=eng\">Canada – Estonia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/lithuania-lituanie/relations.aspx?lang=eng\">Canada – Lithuania Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n</ul></div>\n      "
}