{
  "path": "/en/news/statements/2020/09/07/statement-prime-minister-labour-day",
  "pageTitle": "Statement by the Prime Minister on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p>\n\n<p>“Since 1894 on Labour Day, we have celebrated Canadian workers and the generations of labour activists who have made our workplaces safer, more equitable, and more just. It is because of Canada’s labour movement that we can depend on benefits and protections like universal health care, fair wages, and paid vacations.</p>\n\n<p>“Today, we continue to support workers, who are the backbone of our country and our economy. Thanks in part to the hard work and advocacy of unions and workers from across Canada, we have taken action to protect collective bargaining rights, strengthen the Canada Pension Plan, and make workplaces safer for all. We have also made groundbreaking investments in skills training, from helping young people gain their first work experience through the <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a>, to providing workers with financial support to improve their skills or learn new ones through the <a href=\"https://www.canada.ca/en/revenue-agency/programs/about-canada-revenue-agency-cra/federal-government-budgets/budget-2019-investing-middle-class/canada-training-credit.html\">Canada Training Credit</a>.</p>\n\n<p>“This year has been difficult for Canadian workers, as they feel the impacts of the COVID-19 pandemic. On the front lines, essential workers have risked their health to provide the services and care that Canadians count on every day. They have helped us throughout the crisis by caring for our loved ones in nursing homes, or ensuring we have access to the food and supplies our families need. Workers from every sector and industry have also stepped up and made personal sacrifices to help keep Canadians safe and healthy – whether by staying home and social distancing or helping provide services that we relied on during the pandemic – and the Government of Canada will continue to do everything it can to support them in this challenging time.</p>\n\n<p>“To better support our essential workers and ensure they are properly compensated for the work they do every day, we are working with provinces and territories to provide them with a temporary wage boost, which is giving them a helping hand. We have also worked tirelessly to support the purchasing of personal protective equipment that these workers need to keep themselves and their families safe. For those who found themselves unable to work or whose hours were reduced due to COVID-19, we provided financial support through the <a href=\"https://www.canada.ca/en/services/benefits/ei/cerb-application.html\">Canada Emergency Response Benefit</a> (CERB). Since April, the CERB helped more than 8.5 million Canadians pay their bills and put food on the table. And now, as many Canadians transition back to EI benefits at the end of September, we are making the EI program more flexible and generous and creating new benefits, so more people can get the help they need, when they need it most.</p>\n\n<p>“The Government of Canada has also been taking unprecedented steps to keep Canadians employed, including by creating the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a>, which has helped millions of Canadians stay on the payroll, allowing them to return to their jobs when it is safe to do so. Now, as we gradually restart our economy, we will continue to protect jobs and put Canadians first. Working with the provinces and territories through the Safe Restart Agreement, we announced our intention to provide workers with access to 10 days of paid sick leave. We also worked to ensure that more child care spaces are available, and secured more personal protective equipment for workers, which will help support Canadians who are returning to work.</p>\n\n<p>“Canadian workers have always been at the heart of our success and they will continue to be at the core of Canada’s economic recovery, as we work together to build an economy that is resilient, green, and equitable for everyone.</p>\n\n<p>“On this Labour Day, all Canadians owe a debt of gratitude to our workers – from those on the front lines to those who stayed home to keep others safe. To our truckers, rail, and port workers that kept our supply chains moving – we thank you. We thank the food processors and the warehouse and grocery store workers that kept the shelves stocked. We also say thank you to the nurses and health care workers for keeping us healthy, and to the transit employees that have ensured essential workers could still get to their jobs safely. And as we move into the fall and towards the most difficult school year in recent decades, we also thank Canada’s child care and education workers for their ongoing hard work.</p>\n\n<p>“Together, we will continue to support our workers, create well paying middle class jobs, and build a fairer and more resilient Canada. On behalf of the Government of Canada, I wish all Canadians a safe and happy Labour Day.”</p></div>\n      "
}