{
  "path": "/en/news/statements/2019/05/17/statement-prime-minister-welcoming-decision-united-states-remove-tariffs",
  "pageTitle": "Statement by the Prime Minister welcoming the decision by the United States to remove tariffs on Canadian steel and aluminum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the decision by the United States to remove tariffs on Canadian steel and aluminum:</p>\n\n<p>“Today’s&nbsp;<a href=\"https://www.canada.ca/en/global-affairs/news/2019/05/joint-statement-by-the-united-states-and-canada-on-section-232-duties-on-steel-and-aluminum.html\">decision by the United States to remove tariffs</a>&nbsp;on Canadian steel and aluminum is terrific news for Canadian steel and aluminum workers, their families, and many communities across the country.</p>\n\n<p>“Over the last several months, I have met with Canadian steel and aluminum workers, including in Regina, Hamilton, Sault Ste. Marie, and the Saguenay—Lac-St-Jean region of Québec. They are at the heart of Canada’s world-class steel and aluminum industry, which creates thousands of good, middle class jobs and supports tens of thousands of families.</p>\n\n<p>“When the U.S. imposed tariffs, we stood up for Canada’s economy and our steel and aluminum workers and their families. We immediately retaliated dollar-for-dollar – the strongest retaliation in the world. We stood firm and would not back down until we achieved today’s outcome. As a result of today’s decision by the United States, Canada will lift its retaliatory tariffs.</p>\n\n<p>“This decision reflects what is known to be true by friends on both sides of the border: Canada has been America’s most steadfast ally for more than a hundred years, and our long-standing partnership and closely linked economies make us more competitive around the world and improve our combined security.</p>\n\n<p>“The commercial and people-to-people ties we enjoy – combined with our shared values, geography, and common interests – are of vital importance, especially in an evolving global economy. With this decision, Canadian and American businesses can get back to what they do best – working constructively together to the benefit of our economies, our people, and our communities.</p>\n\n<p>“I thank Foreign Affairs Minister Chrystia Freeland and the entire Canadian negotiating team who have been working extremely hard over the last year to reach this desired result.</p>\n\n<p>“To the workers and businesses at the heart of Canada’s world-class steel and aluminum industries: We will always stand up for you and your families. Every day, you contribute to the well-being and prosperity of communities across the country. What matters most is that you are able to keep our economy growing, and create the good, middle class jobs we need now and in the future.”</p></div>\n      "
}