{
  "path": "/en/news/statements/2023/03/22/statement-prime-minister-world-water-day",
  "pageTitle": "Statement by the Prime Minister on World Water Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Water Day:</p>\n\n<p>“Today, as we join the international community to mark World Water Day, we are reminded of our shared responsibility to protect access to clean, safe water here at home and around the world. There is no resource more essential to Canadians and the Canadian economy than clean water.</p>\n\n<p>“Water ecosystems, when managed properly, help alleviate hunger, poverty, and illness, fight climate change, and support biodiversity. This year’s World Water Day theme, ‘Accelerating Change’, asks us to speed up our action to keep our water safe, clean, and sustainably managed.</p>\n\n<p>“From our abundance of lakes and rivers to our coastline – the longest in the world – Canadians understand the importance of protecting and preserving our country’s water resources. That’s why the Government of Canada is committed to implementing a strengthened Freshwater Action Plan and establishing a Canada Water Agency, to help keep our water clean now and for generations to come. It’s also why we are taking historic action to protect more of our nature, including our waters and coasts, and leverage the power of nature in the fight against climate change.&nbsp;</p>\n\n<p>“Everyone in Canada should have access to clean water. The Government of Canada continues to work in partnership with First Nations communities to help end all long-term drinking water advisories on public systems, and to prevent more advisories moving forward by co-developing and implementing new safe drinking water legislation. In recent years, with federal support, 138 long-term drinking water advisories and over 245 short-term drinking water advisories have been lifted in First Nations communities across the country, and there are initiatives underway to lift all those that remain.</p>\n\n<p>“On the world stage, Canada is working with its international partners to promote access to clean water, sanitation, and hygiene, and to support sustainable water management practices around the world to make life better for people. Since 2000, the Government of Canada has invested over $1.5&nbsp;billion in support of water and sanitation initiatives in developing countries.</p>\n\n<p>“Today, on World Water Day, I invite all Canadians to join me in our ongoing efforts to protect and conserve our water resources. Together we can ensure that clean, safe water is available to all, now and for generations to come.”</p></div>\n      "
}