{
  "path": "/en/news/news-releases/2022/12/01/delivering-dental-care-children-now",
  "pageTitle": "Delivering dental care for children now | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Nobody should have to choose between taking care of their kids’ teeth and putting food on the table. Amid economic uncertainty around the world, Canadians are feeling the rising cost of living. To help families pay the bills, the Government of Canada is putting more money back in the pockets of people who need it most, when they need it most.</p>\n\n<p>The Prime Minister, Justin Trudeau, today <a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/dental-benefit.html\">launched applications</a> for the interim Canada Dental Benefit for children under 12 who do not have access to private dental insurance. Eligible families can apply starting today.</p>\n\n<p>The Canada Dental Benefit will provide eligible parents and guardians with direct, tax-free payments of up to $650 per child, per year – to a maximum of $1,300 per child over the next two years – to help cover out-of-pocket dental care expenses for their children under 12. The Benefit is available to parents and guardians with an annual adjusted family net income under $90,000 who do not have access to private dental insurance. This Benefit is expected to help up to 500,000 Canadian children get the dental care they need and is the first step toward providing dental coverage for Canadian families who need it most.</p>\n\n<p>Delivering dental care for children under 12 is a key part of the government’s plan to continue making life more affordable this year and building an economy that works for all Canadians. We also doubled the Goods and Services Tax Credit for six months, putting up to an additional $467 in the pockets of couples with two children for example, and we are delivering a top-up to the Canada Housing Benefit – a $500 tax-free payment – to an estimated 1.8&nbsp;million Canadian renters who are struggling with the cost of housing.</p>\n\n<p>We will continue to be there for people, make life more affordable, and deliver results for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Starting today, many parents can get their kids the proper dental care they need, without worrying about the bill. We will always be there for families who need it most, when they need it most, and we will keep working to deliver much-needed relief now, as we build an economy that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As of today, nearly 500,000 children will be able to access the Canada Dental Benefit and start caring for their smiles. The Benefit empowers eligible families with the confidence of being able to afford their kid’s oral health care. As we continue our work on the long-term Canada-wide dental care program, we look forward to seeing brighter and healthier smiles across the country!”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are excited to open applications for the new interim Canada Dental Benefit and deliver on the Government of Canada’s commitment to make life more affordable by helping families access the dental care they need. Our simple and secure application process will help Canadians get their payments quickly and easily.”</p>\n\n<footer class=\"default\">The Hon. Diane Lebouthillier, Minister of National Revenue</footer>\n</blockquote>\n\n<blockquote>\n<p>“Oral health is an essential component of overall health. Visiting the dentist early and regularly is an important way to get started on their journey to a lifetime of good oral health. Thanks to the Canada Dental Benefit, more children across Canada will get access to the dental care they need to have healthy teeth, mouths, and smiles. The Canadian Dental Association applauds the federal government’s historic commitment to enhance access to dental care and looks forward to working closely with the government on helping all Canadians achieve and maintain good oral health.”</p>\n\n<footer class=\"default\">Dr. Lynn Tomkins, President, Canadian Dental Association</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>A third of Canadians currently do not have dental insurance, and in 2018, more than one in five Canadians reported avoiding dental care because of the cost.</li>\n\t<li>Eligible families can apply for the Canada Dental Benefit starting today through the Canada Revenue Agency (CRA) <a href=\"https://www.canada.ca/en/revenue-agency/services/e-services/e-services-individuals/account-individuals.html\">My Account portal</a> or, if they do not have internet access, by phone at 1-800-715-8836. To access the benefit, applicants must meet all of the following criteria:\n\t<ul>\n\t\t<li>They have a child or children under 12 as of December 1, 2022, and are currently receiving the Canada Child Benefit for that child;</li>\n\t\t<li>They have an adjusted family net income of less than $90,000;</li>\n\t\t<li>Their child does not have access to private dental insurance;</li>\n\t\t<li>They have filed their 2021 tax return; and</li>\n\t\t<li>They have had or will have out of pocket expenses for their child’s dental care services incurred between October 1, 2022, and June 30, 2023, for which the costs are not fully covered or reimbursed by another dental program provided by any order of government.</li>\n\t</ul>\n\t</li>\n\t<li>Parents and guardians will need to keep the receipts for the dental care services that their child received with the Benefit for six years in case the CRA contacts them to validate eligibility.</li>\n\t<li>A national dental program is under development, with the goal of expanding dental coverage to under 18-year-olds, seniors, and persons living with a disability in 2023, with full implementation for all families with incomes under $90,000 by 2025.</li>\n\t<li>Providing a Canada Dental Benefit to children under 12 is a key part of the Government of Canada’s&nbsp;<a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">plan</a>&nbsp;to make life more affordable for Canadians now.</li>\n\t<li>We are also providing a one-time top-up to the Canada Housing Benefit, delivering a $500 tax-free payment to an estimated 1.8&nbsp;million Canadian renters who are struggling with the cost of housing. This more than doubles the government’s Budget&nbsp;2022 commitment, reaching twice as many Canadians as initially promised. This new one-time federal benefit will be in addition to the Canada Housing Benefit currently co-funded and delivered by provinces and territories. The top-up will be available to applicants with an adjusted net income $35,000 or less for families, or $20,000 or less for individuals, who pay at least 30 per cent of their income on rent.</li>\n</ul>\n\n<ul>\n\t<li>In addition, we are already putting more money back in the pockets of Canadians this year by:\n\t<ul>\n\t\t<li>Doubling the Goods and Services Tax Credit for six months, delivering support to roughly 11&nbsp;million individuals and families. Canadians started receiving their payment last month. Couples with two children are receiving up to an extra $467 and seniors an extra $225 on average.</li>\n\t\t<li>Enhancing the Canada Workers Benefit to support workers this year, with a couple receiving up to $2,400 more this year, and single workers receiving up to $1,200 more. Most recipients first received this additional support through their 2021 tax refund.</li>\n\t\t<li>Cutting regulated child care fees in half on average for families in Canada by the end of this year.</li>\n\t\t<li>Increasing by 10 per cent the Old Age Security (OAS) pension for seniors 75 years and older, starting in July 2022, providing more than $800 in new support to full pensioners over the first year and increasing benefits for more than three million seniors.</li>\n\t\t<li>Providing more support for students by doubling the Canada Student Grant amount until July 2023 and by making Canada Student Loans and Canada Apprentice Loans permanently interest-free. An average student loan borrower will save $410 per year as a result of their loan being interest-free.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.canada.ca/fes-eea/2022/home-accueil-en.html\"><em>Fall Economic Statement&nbsp;2022</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/09/making-dental-care-more-affordable-the-canada-dental-benefit.html\">Making Dental Care More Affordable: The Canada Dental Benefit</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/dental-benefit.html\">Canada Dental Benefit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/13/making-life-more-affordable-canadians-year\">Making life more affordable for Canadians this year</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/04/putting-more-money-back-pockets-canadians-today\">Putting more money back in the pockets of Canadians today</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">Affordability Plan</a></li>\n</ul></div>\n      "
}