{
  "path": "/en/news/statements/2022/08/08/statement-prime-minister-marking-asean-day-and-45-years-partnership",
  "pageTitle": "Statement by the Prime Minister marking ASEAN Day and 45 years of partnership with the Association of Southeast Asian Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark ASEAN Day and 45 years of partnership between Canada and the Association of Southeast Asian Nations:</p>\n\n<p>“Today, we celebrate the Association of Southeast Asian Nations (ASEAN) Day and the 45th anniversary year of Canada becoming a Dialogue Partner of ASEAN – one of only 11 partners to enjoy this privileged designation.</p>\n\n<p>“The partnership between Canada and ASEAN is rooted in strong people-to-people, trade, and diplomatic ties. Canada is home to over one million people of Southeast Asian descent, who greatly contribute to our country’s economic, cultural, and social fabric. Together, ASEAN member state economies represent Canada’s fourth-largest trading partner, with over $31 billion in bilateral trade in 2021.</p>\n\n<p>“Canada is committed to further deepening our ties with ASEAN, including through the launch of Canada-ASEAN free trade agreement negotiations. Marking a historic milestone in our bilateral relationship, this agreement would help strengthen global supply chains, increase trade and investment in the region, and drive long-term job creation and economic growth that benefits everyone.</p>\n\n<p>“We will continue to work with our ASEAN partners to make further progress on shared priorities, including promoting security in the Indo-Pacific and addressing regional development needs. As the Government of Canada continues the work to develop a new, comprehensive Indo-Pacific strategy, our partnership with ASEAN and our commitment to ASEAN centrality will keep playing a critical role in advancing our shared diplomatic, economic, and defence objectives in the region.</p>\n\n<p>“Today, on the 55th ASEAN Day, which marks the founding of the organization in 1967, I invite all Canadians to celebrate and reflect on the prosperity these ties continue to create across Canada and throughout Southeast Asia, and on the invaluable contributions Southeast Asian Canadians make in our communities. Together, we will continue to create a peaceful and prosperous Indo-Pacific and build a better future for everyone.”</p></div>\n      "
}