{
  "path": "/en/news/news-releases/2015/11/15/prime-minister-announces-infrastructure-funding-indonesia",
  "pageTitle": "Prime Minister announces infrastructure funding for Indonesia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p><p>The Prime Minister, Justin Trudeau, today announced $14.25 million in funding to strengthen infrastructure development in Indonesia, in order to promote sustainable economic growth and reduce poverty in the country.</p><p>Canada is partnering with the World Bank, through the Accelerating Sustainable Public-Private Investments for Infrastructure Renewal (ASPIRE) project, to assist Indonesia in preparing the legal and regulatory groundwork required for critical public-private partnership (P3) infrastructure projects. This includes the establishment and operationalization of a P3 Centre in Indonesia.</p><p>The announcement was made on the margins of the G20 Leaders’ Summit, following the Prime Minister’s bilateral meeting with Indonesian President Joko Widodo.</p><p><strong>Quotes</strong></p><p>“Canada’s economic growth was made possible by building ambitiously. Our government believes that modern infrastructure is one of the key ingredients of a healthy economy—it creates jobs, makes economies more competitive, and strengthens our communities. With the project announced today, Canada will help Indonesia kick-start some critical infrastructure projects, promoting employment and growth, and reducing poverty.” <em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p><p><strong>Quick Facts</strong></p><ul><li>Infrastructure is critical to reduce poverty in developing countries. Despite strong economic growth, national governments in parts of Asia lack the technical expertise required to develop public-private infrastructure projects that would attract private investment and create good jobs.</li><li>Indonesia has emerged as Canada’s largest export market ($2.03 billion in 2014) in the Association of South-East Nations (ASEAN) region and is an important destination for Canadian foreign direct investment abroad (a stock of $4.32 billion in 2014). Canadian exports nearly doubled from 2010 to 2014.</li><li>Infrastructure investment is a key topic of discussion at this year’s G20 Leaders’ Summit in Antalya, Turkey.</li><li>Canada and Indonesia have maintained a strong bilateral relationship since the establishment of diplomatic relations in 1952. Canada continues to work with Indonesia on issues of mutual importance, including counterterrorism, good governance, human rights, religious freedom, pluralism, and poverty reduction. Canada’s bilateral development program has a dual focus: strengthening investments to build economic foundations, and addressing employment skills for sustainable economic growth. It also supports good governance and democracy.</li></ul><p><strong>Associated Links</strong></p><ul><li><a href=\"http://www.international.gc.ca/development-developpement/countries-pays/indonesia-indonesie.aspx?lang=eng\">Canada in Indonesia</a></li><li><a href=\"http://www.canadainternational.gc.ca/indonesia-indonesie/bilateral_relations_bilaterales/canada-indonesia-indonesie.aspx?lang=eng\">Canada-Indonesia Relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/indonesia-indonesie/bilateral_relations_bilaterales/fs_indonesia-fd_indonesie.aspx?lang=eng\">Indonesia Factsheet</a></li><li><a href=\"http://www.apec.org/Meeting-Papers/Leaders-Declarations/2015/2015_aelm.aspx\">APEC PPP Expert Advisory Panel</a></li><li><a href=\"/en/news/backgrounders/2015/11/14/investments-infrastructure-renewal-aspire-project\">Investments for Infrastructure Renewal (ASPIRE) project</a></li></ul></div>\n      "
}