{
  "path": "/en/news/statements/2021/05/03/statement-prime-minister-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Press Freedom Day:</p>\n\n<p>“Today, on World Press Freedom Day, we celebrate the invaluable role that journalists play in Canada and around the world, and honour all those who have lost their lives in pursuit of the truth. We also rededicate ourselves to a fairer and more inclusive future where everyone, everywhere, is free to make their voices heard.</p>\n\n<p>“The theme of this year’s World Press Freedom Day is ‘<a href=\"https://en.unesco.org/commemorations/worldpressfreedomday\">Information as a Public Good</a>’. It reminds us that quality, clear, and truthful information is essential for a democratic society based on the values of honesty and respect, fairness and justice, freedom and dignity.</p>\n\n<p>“As the global COVID-19 pandemic has shown, timely and reliable information can be the difference between life and death. For over a year, many journalists have been working around the clock, analyzing COVID-19 data, fighting disinformation, and telling vital stories about the pandemic to help keep us informed and safe. In a time when information is both easier to manipulate and more abundant than ever, the role journalists play in our lives and for the health of our communities has never been greater.</p>\n\n<p>“As co-chair of the Media Freedom Coalition, Canada will continue to lead efforts to protect freedom of expression and promote freedom of the press around the globe. In July 2020, alongside partners, Canada <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/freedom_expression_media-liberte_expression_medias.aspx?lang=eng\">led a new resolution</a> to put the issue of freedom of expression back on the agenda of the United Nations Human Rights Council. Later that year, Canada and Botswana co-hosted the <a href=\"https://www.canada.ca/en/global-affairs/news/2020/11/canada-concludes-second-global-conference-for-media-freedom-at-time-of-unprecedented-challenge.html\">second Global Conference for Media Freedom</a> to strengthen efforts to defend media freedom and push back against disinformation.</p>\n\n<p>“On behalf of all Canadians, I thank journalists everywhere who give us the facts to make better sense of the world, contribute to our communities, and lead freer, richer lives. They are democracies’ first line of defence, and the cornerstone of any fair, strong, and vibrant society.”</p></div>\n      "
}