{
  "path": "/en/news/statements/2017/12/04/canada-china-joint-statement-climate-change-and-clean-growth",
  "pageTitle": "Canada-China Joint Statement on Climate Change and Clean Growth | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ol><li>Canada and China affirm that action on climate change, including decisive steps towards low-carbon, climate-resilient and sustainable development is crucial. As a global challenge, climate change and the need to transition to a clean growth economy demand a decisive, collaborative and cooperative response by governments, businesses, and other actors to drive momentum, in the context of sustainable development and poverty eradication.</li><li>Prime Minister Justin Trudeau and Premier Li Keqiang agree that intensified cooperation between Canada and China is vital to mitigating climate change and adapting to its effects around the world. They further emphasize that protecting the environment and growing their economies go hand-in-hand. They are committed to take concrete actions and demonstrate determination to encourage the transition to a competitive, low-carbon, climate-resilient economy and society, and promote clean growth.</li></ol><h2>Collaboration in the Multilateral Processes</h2><ol start=\"3\"><li>Canada and China welcome the entry into force of the Paris Agreement, adopted under the United Nations Framework Convention on Climate Change (UNFCCC), which, in enhancing the implementation of the Convention, including its objective, aims to strengthen the global response to the threat of climate change. They reiterated that the Paris Agreement is irreversible and that it will not be renegotiated. They reaffirm their strong commitment to the Paris Agreement, moving swiftly towards its full and effective implementation reflecting equity and ‎in accordance with the principle of common but differentiated responsibilities and respective capabilities, in light of different national circumstances, and will move forward on policies and measures to implement their respective nationally determined contributions (NDCs). They call on all parties to uphold and advance the Paris Agreement, to implement their NDCs and to strengthen their efforts over time, in accordance with the relevant provisions of the Agreement.</li><li>Canada and China welcome the Fiji Momentum for Implementation adopted at the 23<sup>rd</sup> Conference of the Parties&nbsp;(COP23) held in November 2017. They will work together with other parties towards the completion of the work programme related to the implementation of the Paris Agreement by 2018. They also note that pre-2020 implementation and ambition are of utmost importance, and enhanced pre-2020 ambition can lay a solid foundation for enhanced post-2020 ambition.</li></ol><h2>Concrete Bilateral Cooperation</h2><ol start=\"5\"><li>Canada and China will strive to set the conditions whereby our bilateral collaboration and growing relationship&nbsp;accelerate our two countries’ efforts to mitigate climate change, build resilience, and support clean growth. This includes sharing information on relevant domestic policies, exchanging best practices, promoting cooperation on technology research and development. Recognizing the crucial role of industry and the private sector, Canada and China will facilitate business-to-business engagement to help capture economic opportunities arising from the transition to a greener, low-carbon economy.</li><li>Canada and China agree to establish appropriate ministerial dialogues on cooperation on climate change and clean growth. The <b>Ministerial Dialogue on Climate Change </b>will be chaired by Environment and Climate Change Canada and the National Development and Reform Commission of China. It will provide a forum for a comprehensive policy dialogue on climate change, including strengthening their cooperation on market-based solutions, such as Canada’s pan-Canadian approach to carbon pricing and China’s national emission trading system, reducing reliance on traditional fossil energy and transitioning to clean energy, carbon capture and utilization storage technology, and strengthening partnerships in multilateral fora including through the UNFCCC. The two countries will strengthen technical and commercial cooperation on energy-saving and highly efficient products, and work to improve the efficient use of energy in communities and across all industrial, transportation, and building sectors. Canada and China will explore potential cooperation to advance trade opportunities for climate friendly products and services. The two ministers will explore the mechanisms to establish the Dialogue at their next meeting.</li><li>The <b>Ministerial Dialogue on Clean Energy </b>will be chaired by Natural Resources Canada and the National Energy Administration of China. It will provide a forum to facilitate clean energy solutions, including the transition from fossil energy to cleaner fuels, such as nuclear, renewables and natural gas. Canada and China will seek ways to expand our energy trade (including liquefied natural gas), as well as accelerate commercial progress in our nuclear energy sector, including through the joint development of the Advanced Fuel CANDU Reactor in China and third country markets, and the expanded trade of uranium. The Memorandum of Understanding in the Field of Energy, which Natural Resources Canada and the National Energy Administration of China renewed in June 2017, as well as the Canada-China Track II Energy Dialogue will also be key platforms to advance trade and investment opportunities.</li><li>Canada and China also welcome the announcement of the renewal of the bilateral Memorandum of Understanding Concerning Environmental Cooperation and the first <b>Ministerial Dialogue on the Environment </b>between Environment and Climate Change Canada and the Ministry of Environmental Protection of China. This mechanism will allow for high-level engagement and cooperation on issues of mutual interest including clean air, water, and soil, chemicals management, biodiversity, and conservation areas. This work will be aimed at achieving sustainable development to protect the health and well-being of the people and the environment of both countries. Canada will continue its support for the work of the China Council for International Cooperation on Environment and Development.</li><li>Through existing platforms or new mechanisms, including additional high-level bilateral dialogues involving or led by relevant government agencies as appropriate, Canada and China will continue and enhance vital work to promote clean growth. The two countries will promote sustainable energy and resource development, including upstream oil and gas, as well as the minerals and materials sectors. Both sides will continue to explore the possibility of accelerating innovation and commercialization of clean energy and technology demonstrations projects. They will also encourage the use of wood and wood products that are the result of sustainable forestry practices and increase collaboration to develop more eco-friendly projects made from green building materials, including low carbon eco-district demonstration projects and multi-story and high-rise timber structure demonstration projects.</li></ol><h2>Related product</h2><ul><li><a href=\"/en/news/news-releases/2017/12/04/canada-announces-new-partnerships-china-grow-shared-prosperity\">Canada announces new partnerships with China to grow shared prosperity</a></li></ul><p>&nbsp;</p></div>\n      "
}