{
  "path": "/en/news/readouts/2021/07/01/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today spoke with British Columbia Premier John Horgan to discuss the wildfires in the province, and in particular, the catastrophic fire in Lytton.</p>\n\n<p>Prime Minister Trudeau assured Premier Horgan of the Government of Canada’s support for the people of Lytton and all those affected by the fires.&nbsp;He noted that Minister of National Defence Harjit Sajjan and Minister of Public Safety and Emergency Preparedness Bill Blair are working with provincial ministers to ensure that all federal resources necessary are available to British Columbia.&nbsp;Tomorrow, the Prime Minister will chair a meeting of the Incident Response Group to discuss the extreme weather-related conditions in British Columbia and the wildfire situation throughout Western Canada.&nbsp;</p>\n\n<p>The Prime Minister and the Premier also discussed the important ceremonies organized yesterday by the Daylu Dena Council, during which survivors shared their experiences at the former Lower Post Residential School, and the former residential school was demolished to make way for a new multi-purpose building.&nbsp;</p>\n\n<p>They also discussed the need for all orders of government to work together on fighting climate change in advance of this fall’s COP26 meeting in Glasgow, United Kingdom.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet-committee-mandate-and-membership#incident-response\">Cabinet Committee Mandate and Membership: Incident Response Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2021/06/statement-by-minister-bennett-and-minister-miller-on-todays-gathering-in-lower-post-british-columbia.html\">Statement by Minister Bennett and Minister Miller on today's gathering in Lower Post, British Columbia</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n</ul></div>\n      "
}