{
  "path": "/en/news/readouts/2020/05/06/prime-minister-justin-trudeau-speaks-prime-minister-tuvalu-kausea-natano",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Tuvalu Kausea Natano | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke with the Prime Minister of Tuvalu regarding&nbsp;the latest developments in&nbsp;the COVID-19 pandemic.</p>\n\n<p>The two leaders exchanged information on their respective national efforts to fight the pandemic and protect the health, safety, and economic well-being of their citizens. Prime Minister Trudeau expressed relief that Tuvalu had no confirmed COVID-19 cases.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Prime Minister Natano spoke about the importance of a strong and coordinated response to COVID-19 globally. They also discussed the&nbsp;need to support more vulnerable countries, and to reinforce&nbsp;health, financial, and economic systems in the Pacific region.&nbsp;</p>\n\n<p>They agreed that it was critical to keep supply chains open to combat food insecurity and to ensure access to vital medical supplies.&nbsp;</p>\n\n<p>The leaders also affirmed the importance of working together on shared priorities such as climate change and economic resilience.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_tuvalu.aspx?lang=eng\">Canada-Tuvalu Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}