{
  "path": "/en/news/news-releases/2017/02/13/prime-minister-trudeau-concludes-successful-visit-washington-meet",
  "pageTitle": "Prime Minister Trudeau concludes successful visit to Washington to meet with President Trump | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The relationship between Canada and the United States is unique and unparalleled. We have the longest, most peaceful, and mutually beneficial partnership of any two countries, forged by shared geography, common interests, and one of the largest and most comprehensive economic relationships in the world. Millions of good middle class jobs depend on that relationship.</p><p>The Prime Minister, Justin Trudeau, today concluded his first official visit with the President of the United States, Donald J. Trump.</p><p>During the bilateral meetings, the two leaders covered various areas of mutual interest, including trade and investment as well as national, continental, and international security. They discussed their shared focus on how to build stronger economies where the middle class, and those working hard to join it, have greater opportunities to succeed and prosper. They also discussed how the relationship has created jobs for our citizens and opportunities for our businesses.</p><p>The two leaders then took part in a Women in Business Executives roundtable, where they announced the creation of the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders. This initiative will help empower women-owned businesses, and further contribute to economic growth and competitiveness in both Canada and the U.S., as well as enhance the integration of our two economies.</p><p>Following the roundtable and a luncheon hosted by President Trump, the two leaders released a joint statement and held a media availability session.</p><h2>Quote</h2><blockquote><p>“The partnership enjoyed by Canada and the United States has been essential to our shared prosperity and security, and has long served as a model for the rest of the world. I had a productive meeting with President Trump and members of the U.S. administration, and I look forward to working together to create more opportunities for the middle class on both sides of the border.”<br> <cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau also held two additional meetings, one with the Speaker of the House of Representatives, Paul Ryan, and the other with Senate Majority Leader, Mitch McConnell.</li><li>Canada and the United States share the largest trading relationship in the world. Bilateral trade between the two countries was valued at over $885 billion in 2015, and Canada is the largest secure supplier of energy to the U.S.</li><li>Canada is the number one export destination for 35 American states, and bilateral trade and investment supports millions of jobs on both sides of the border.</li><li>The two countries share the longest, secure border in the world, over which 400,000 people and $2.4 billion worth of goods and services cross daily.</li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/statements/2017/02/13/joint-statement-president-donald-j-trump-and-prime-minister-justin\">Joint Statement</a></li><li><a href=\"http://www.can-am.gc.ca/can-am/index.aspx?lang=eng\">Canada and the United States</a></li></ul><p>&nbsp;</p><p>&nbsp;</p></div>\n      "
}