{
  "path": "/en/news/itineraries/2022/11/28/update-prime-ministers-itinerary-monday-november-28-2022",
  "pageTitle": "UPDATE – Prime Minister’s itinerary for Monday, November 28, 2022 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local<a name=\"_Hlk113634803\" id=\"_Hlk113634803\"></a></p>\n\n<h2>James Smith Cree Nation, Saskatchewan</h2>\n\n<p>Private meetings</p>\n\n<p><strong>10:05 a.m.&nbsp;</strong>The Prime Minister will pay his respects to the victims of the events of September 2022 in James Smith Cree Nation.&nbsp;Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario, Patty Hajdu, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>12:40 p.m.&nbsp;</strong>The Prime Minister will meet with James Smith Cree Nation Chief Wally Burns, Chakastaypasin First Nation Chief Calvin Sanderson, Peter Chapman First Nation Chief Robert Head, Federation of Sovereign Indigenous Nations Chief Bobby Cameron, Prince Albert Grand Council Grand Chief Brian Hardlotte, and James Smith Cree Nation Council members.&nbsp;Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario, Patty Hajdu, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity at the start of the meeting</li>\n</ul>\n\n<p><strong>1:45 p.m.&nbsp;</strong>The Prime Minister will participate in a grand entry ceremony with members of James Smith Cree Nation.&nbsp;Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario, Patty Hajdu, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 1:00 p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul>\n\n<p><strong>3:30 p.m.&nbsp;</strong>The Prime Minister will make an announcement and hold a media availability.&nbsp;Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario, Patty Hajdu, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 1:00 p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul></div>\n      "
}