{
  "path": "/en/news/news-releases/2019/11/28/prime-minister-travel-united-kingdom-nato-leaders-meeting",
  "pageTitle": "Prime Minister to travel to the United Kingdom for NATO Leaders Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will attend the North Atlantic Treaty Organization (NATO) Leaders Meeting in London, United Kingdom, from December 3 to 4, 2019.</p>\n\n<p>In London, Prime Minister Trudeau will meet with NATO allies to mark the 70<sup>th</sup> anniversary of the Alliance, and discuss shared trans-Atlantic priorities. NATO leaders will highlight Alliance achievements, specifically in the area of defence and deterrence. They will also discuss the importance of maintaining unity and resolve to successfully address emerging and future threats.</p>\n\n<p>During the meeting, Prime Minister Trudeau will reiterate Canada’s unwavering commitment to NATO and to trans-Atlantic security, as well as the importance of working together to modernize the Alliance. While in London, Prime Minister Trudeau will attend the NATO Engages panel discussion.</p>\n\n<p>NATO is built on the strength of standing together in service of citizens and in defence of common interests. Working with NATO allies, Canada protects fundamental Canadian values like democracy and the rule of law, while building a safer, more peaceful world for today and tomorrow.</p>\n\n<p>A founding member of the Alliance, Canada is a major contributor to NATO. Canada currently leads NATO’s enhanced Forward Presence battlegroup in Latvia, as well as the Standing NATO Maritime Group 2. In Iraq, Canada commands the NATO mission, to help the country transition to lasting peace and security.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For 70 years, NATO has been a cornerstone of Canadian defence and security policy. I look forward to meeting with NATO leaders, and to reaffirming Canada’s strong commitment to this Alliance and its values. Whether by leading efforts to prevent and end conflict, or contributing to NATO’s work on women, peace and security, Canada is there for our allies as we build a more peaceful and stable world. We will always stand up for the values that Canadians hold dear, and for everyone who dreams of a brighter tomorrow.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This year marks NATO’s 70th anniversary. Since 1949, NATO has defended international peace and security.</li>\n\t<li>On November 24, 2019, Major-General Jennie Carignan took command of the NATO Mission in Iraq, a non-combat, advisory, and training mission to build more effective and sustainable Iraqi defence and security institutions.</li>\n\t<li>Canada also contributes to trans-Atlantic security by providing support for Ukraine’s security and stability, primarily through Operation UNIFIER.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nato.int/\">North Atlantic Treaty Organization (NATO)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and NATO</a></li>\n\t<li><a href=\"https://jfcnaples.nato.int/nmi/news-room/news/2019/nato-mission-iraq-welcomes-a-new-commander\">NATO Mission Iraq welcomes a new Canadian Commander</a></li>\n</ul></div>\n      "
}