{
  "path": "/en/news/statements/2019/08/02/statement-prime-minister-death-lieutenant-governor-new-brunswick",
  "pageTitle": "Statement by the Prime Minister on the death of Lieutenant Governor of New Brunswick Jocelyne Roy Vienneau | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Lieutenant Governor of New Brunswick Jocelyne Roy Vienneau:</p>\n\n<p>“Today, we join New Brunswickers to mourn the passing of the province’s Lieutenant Governor, Her Honour the Honourable Jocelyne Roy Vienneau, after a battle with cancer.</p>\n\n<p>“A former engineer and educator, Ms. Roy Vienneau made many important contributions to her home province and the Acadian community.</p>\n\n<p>“Ms. Roy Vienneau was a trailblazer in New Brunswick’s post-secondary education system. She was the first woman to direct a francophone community college in New&nbsp;Brunswick, the first woman to occupy a secular position as vice-president of a campus at the Université de Moncton, and one of the first women to graduate from the university’s Faculty of Engineering. She was also the first Acadian woman to serve as Lieutenant Governor of New Brunswick.</p>\n\n<p>“Under her leadership, the New Brunswick Community College in Bathurst became one of the first two colleges in the country to be eligible for research grants from the Natural Sciences and Engineering Council of Canada.</p>\n\n<p>“In 2015, a scholarship was created in her honour to increase the number of women engineers. Each year, the scholarship recognizes two women undergraduate engineering students in New Brunswick who, like Ms. Vienneau, are active community leaders and role models.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our condolences to Ms.&nbsp;Roy Vienneau’s family and friends, and to the people of New Brunswick. Her work will continue to inspire future leaders for years to come.”</p></div>\n      "
}