{
  "path": "/en/news/statements/2020/08/19/statement-prime-minister-world-humanitarian-day",
  "pageTitle": "Statement by the Prime Minister on World Humanitarian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Humanitarian Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/humanitarian-day\">World Humanitarian Day</a>, we honour all humanitarian aid workers who work tirelessly to save lives, protect the dignity, and alleviate the human suffering of millions of people in need around the world. We thank aid and health workers for their service and the sacrifices they and their families make to keep communities safe.</p>\n\n<p>“This year, we pay special tribute to the real-life heroes who continue to offer life-saving support and protection to the most vulnerable – those affected by armed conflict, violence and unrest, as well as by the rise in extreme weather and natural disasters – all amid the COVID-19 pandemic. As the world continues to fight the pandemic, aid workers are facing unprecedented challenges to assist those in need – and working hard to overcome them.</p>\n\n<p>“Humanitarian aid workers are the backbone of life-saving responses to crises and their protection is critical. Each year, they apply their knowledge, expertise, and ingenuity to save lives. However, all too often, they face threats to their safety and security such as through targeted and indiscriminate attacks and acts of violence in violation of international humanitarian law.</p>\n\n<p>“The Government of Canada supports global efforts to protect those in need in humanitarian settings – particularly women and girls who are disproportionately affected by crises – and to promote the implementation of international humanitarian law. We will continue to work with our partners to provide humanitarian funding to relief organizations so that they can carry out their critical life-saving work. Recently, we did it by helping the Lebanese Red Cross and other trusted partners meet the urgent needs of people affected by the explosion in Beirut.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to join me in thanking all humanitarian workers who have committed to helping and serving others in the most extreme circumstances, with humility and dedication.”</p></div>\n      "
}