{
  "path": "/en/news/news-releases/2022/03/09/prime-minister-participates-successful-visit-germany",
  "pageTitle": "Prime Minister participates in successful visit to Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today had a successful bilateral visit to Germany. The visit reinforced the close relationship between our countries and our shared commitments to peace and security in Europe through our dedication to democracy and multilateralism, and to combatting climate change, growing the clean economy, and creating good middle-class jobs in both countries.</p>\n\n<p>While in Germany, the Prime Minister spoke on the phone with the President of Ukraine, Volodymyr Zelenskyy, to reiterate Canada’s solidarity with the Ukrainian people, applaud their outstanding bravery and courage, and extend further support to the people in Ukraine. The Prime Minister informed President Zelenskyy that Canada will be sending a new shipment of highly specialized military equipment in the coming days to help the Ukrainian people defend themselves against Russia’s unprovoked and unjustifiable invasion. He also extended an invitation to President Zelenskyy to address the Canadian parliament in the near future, which the President accepted.</p>\n\n<p>The Prime Minister today also announced that Canada would provide an additional $50 million in lethal and non-lethal military equipment to Ukraine. Canada and Germany are united in taking strong, decisive and coordinated action against the ongoing Russian aggression in Ukraine. They are supporting the government and people of Ukraine and neighbouring countries by providing lethal and non-lethal aid to Ukraine, addressing the emerging humanitarian crisis in the region, imposing significant punitive sanctions, and reinforcing our NATO allies in Eastern Europe.</p>\n\n<p>To further defend democracy and continue leading the fight against disinformation, the Prime Minister announced $13.4 million over five years to renew and expand the G7 Rapid Response Mechanism (RRM), which strengthens coordination between countries in responding to threats to G7 democracies. The RRM was initially established under Canada’s 2018 G7 Presidency to fight disinformation and misinformation. Canada will also provide $3 million to counter disinformation around Russia’s ongoing aggression against Ukraine.</p>\n\n<p>In Germany, the Prime Minister delivered a keynote address on international peace, security and transatlantic cooperation at the Allianz Forum, hosted by Atlantik-Brücke and Munich Security Conference. In his remarks, the Prime Minister emphasized that Canada will always stand up for democratic values and against authoritarianism. He highlighted Canada and Germany’s shared efforts to defend Ukraine, strengthen democracy, and build a better future with clean air, good jobs, strong economies and secure, reliable and low-carbon sources of energy.</p>\n\n<p>Prime Minister Trudeau met with Germany’s Chancellor, Olaf Scholz. Together, the leaders discussed and coordinated next steps to counter Russia’s ongoing and accelerating aggression against Ukraine. The leaders also committed to strengthening bilateral cooperation to enhance trade, fight climate change, and build clean economies with good jobs, including through the transition to clean energy.</p>\n\n<p>Germany has the biggest economy in Europe and the fourth largest economy in the world. While in Germany, Prime Minister Trudeau highlighted Canada as a natural partner for Germany with our abundant and secure source of both energy and minerals, and encouraged Canadian companies to take advantage of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which is creating new opportunities and good, middle-class jobs on both sides of the Atlantic.</p>\n\n<p>To combat climate change and accelerate the transition toward a clean energy future, Canada and Germany will deepen collaboration on carbon pollution pricing, energy and critical minerals through the High Level Steering Group on Bilateral Cooperation. The leaders mutually recognized each countries’ leadership on carbon pricing through the Global Carbon Pricing Challenge on Carbon and the Climate Club respectively, and agreed to collaborate for the broader adoption of pollution pricing in upcoming multilateral fora.</p>\n\n<p>Canada and Germany will also work to build more resilient economies by further securing energy supply chains through launching a clean hydrogen initiative to bring governments and industry in both countries together.</p>\n\n<p>Canada and Germany will also mark 50 years of bilateral science and technological cooperation by launching new initiatives in key areas, such as hydrogen and carbon capture, batteries, quantum technologies, Arctic research, digital health and biopharmaceuticals, and ocean technologies.</p>\n\n<p>Women’s empowerment is a key driver of economic growth that works for everyone. To improve women’s access to economic opportunities by removing barriers to their participation in trade as workers and entrepreneurs, the Gender Equality Advisory Council, launched by Canada at the 2018 Charlevoix G7 Summit, will pursue its important work under the 2022 German G7 Presidency.</p>\n\n<p>The Prime Minister will also meet with German President Frank-Walter Steinmeier, where they will announce the President’s upcoming visit to Canada and discuss ways to strengthen democracies against foreign interference, disinformation and other threats.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada and Germany have a close and longstanding partnership with shared priorities including defending democracy against authoritarianism, bolstering multilateral cooperation, and fighting climate change and building a clean economy. With Germany assuming the G7 Presidency for 2022, I look forward to continuing to work closely with Chancellor Scholz to advance our shared priorities and create good, middle class jobs on both sides of the Atlantic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since Russia began its illegal and unconscionable attack, Ukrainians have displayed immense courage and determination by fighting for their freedom. Canada stands with them. Our government will continue to provide Ukraine with a comprehensive military aid package, and we will work to ensure that this additional equipment is delivered safely and expeditiously. We will leave no stone unturned in our efforts to support Ukraine.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Germany and Canada are longstanding multilateral partners, cooperating closely in NATO on security and defence issues, and as members of the G7 and G20, the Organisation for Economic Co-operation and Development and the World Trade Organization.</li>\n\t<li>Germany is Canada’s largest export market in the EU, and our sixth-largest trading partner globally, with two-way merchandise trade totalling $25.8 billion in 2021. Merchandise trade with Germany has increased 13.5 percent since CETA came into force in 2016.</li>\n\t<li>In the fourth quarter of 2021, Statistics Canada reports that Germany inward FDI ranked third among source countries with $971 million, an increase of 483% over its historical quarterly average level of investment.</li>\n\t<li>The Prime Minister visited the Platform 17 memorial, located at the Grunewald train station in western Berlin to remember the thousands of Jews who were deported from Berlin during the Holocaust.</li>\n\t<li>Following his address, the Prime Minister participated in a panel discussion with Chairperson of the Atlantik Brücke, Sigmar Gabriel, and the Chairperson of the Munich Security Conference, Ambassador Christoph Heusgen.</li>\n\t<li>Germany holds the Presidency of the G7 in 2022. The 2022 G7 Summit is scheduled to take place in Schloss Elmau, Germany from June 26 to 28.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany Relations</a></li>\n\t<li><a href=\"https://www.g7germany.de/g7-en\">G7 Germany</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}