{
  "path": "/en/news/news-releases/2017/02/10/prime-minister-announces-special-advisor-canada-infrastructure-bank",
  "pageTitle": "Prime Minister announces Special Advisor on the Canada Infrastructure Bank | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Infrastructure investments are needed now to create long-term economic growth, grow the middle class, and support a sustainable, clean growth economy. Together, we need to find innovative ways to mobilize private capital to strengthen our communities, and provide Canadians from all walks of life with opportunities.</p><p>To support these objectives, the Prime Minister, Justin Trudeau, today announced that Jim Leech will be serving as Special Advisor on the Canada Infrastructure Bank.</p><p>Mr. Leech will work in collaboration with the Privy Council Office, the Minister of Infrastructure and Communities, and the Minister of Finance to expedite the swift and successful creation of the Canada Infrastructure Bank. He will guide an implementation team, engage with stakeholders, provide strategic advice on the way forward, and help oversee an open and transparent process to recruit board members for the Canada Infrastructure Bank.</p><p>Announced in the Fall Economic Statement, the Canada Infrastructure Bank – a key component of the government’s <em>Investing in Canada</em> plan – will provide innovative financing for infrastructure projects, and help more projects get built in Canada. It will lead to better projects that create the good, well-paying jobs needed to grow the middle class now, and strengthen Canada's economy over the long term.</p><h2>Quote</h2><blockquote><p>“Mr. Leech brings with him immense knowledge and experience, and I am confident that he will help ensure a smooth and successful launch of the Canada Infrastructure Bank. This is about making sure our public dollars go farther and are used smarter, as we make historic investments in infrastructure to create middle class jobs today and sustained economic growth for years to come.”<br> <cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The <a href=\"http://www.budget.gc.ca/fes-eea/2016/docs/statement-enonce/toc-tdm-en.html\">Fall Economic Statement</a> announced the government’s intention to create the Canada Infrastructure Bank that will work with provinces, territories, and municipalities to further the reach of government funding directed to infrastructure.</li><li>The Canada Infrastructure Bank will be responsible for investing at least $35 billion from the federal government into large infrastructure projects that contribute to economic growth through a broad range of financial instruments including loans and equity investments.</li><li>Part of this amount – $15 billion – will come from the funding announced for infrastructure in the Fall Economic Statement.</li><li>The objective of the Canada Infrastructure Bank will be to structure its financial support in order to attract private sector capital into infrastructure projects.</li><li>In <a href=\"http://www.budget.gc.ca/2016/docs/plan/toc-tdm-en.html\">Budget 2016</a>, the government made a down payment on future growth by making immediate investments of $11.9 billion in public transit, green infrastructure and social infrastructure.</li><li>The Fall Economic Statement proposes an additional $81 billion through to 2027–28 in public transit, green and social infrastructure, transportation infrastructure that supports trade, and rural and northern communities.</li><li>Taking into account existing programs, new investments made in Budget 2016 and the additional investments contained in the Fall Economic Statement, the Government of Canada will invest more than $180 billion in infrastructure over 12 years.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/02/10/jim-leech\">Biography: Mr. Leech</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.budget.gc.ca/2016/docs/plan/toc-tdm-en.html\">Budget 2016</a></li><li><a href=\"http://www.budget.gc.ca/fes-eea/2016/docs/statement-enonce/toc-tdm-en.html\">Fall Economic Statement</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\">Investing in Canada: The $186 Billion Long-Term Infrastructure Plan</a></li></ul></div>\n      "
}