{
  "path": "/en/news/statements/2021/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/human-rights-day\">Human Rights Day</a>, we celebrate the United Nations (UN) General Assembly’s adoption of the <a href=\"http://www.un.org/en/universal-declaration-human-rights/\">Universal Declaration of Human Rights</a> in 1948. We also reflect on the progress we have made to advance human rights around the world, and on the work that we have left to do – as a country and as individuals – to ensure that every single person is treated equally, with dignity and respect.</p>\n\n<p>“This year’s theme is ‘Equality – Reducing inequalities, advancing human rights.’ As we build back better from the COVID-19 pandemic, this theme urges us to work together to develop and implement strategies that protect and promote human rights and empower us to address the deep-rooted forms of racism and discrimination that have affected those most marginalized in our societies, and to achieve the UN’s approach set out in the <a href=\"https://unsceb.org/sites/default/files/imported_files/CEB%20equality%20framework-A4-web-rev3.pdf\">Shared Framework on Leaving No One Behind: Equality and Non-Discrimination at the Heart of Sustainable Development</a>.</p>\n\n<p>“The Government of Canada has taken important steps to advance and protect human rights. Here at home, we are confronting the dark chapters of our past and addressing the injustices of today by taking meaningful action. We remain deeply committed to protecting, promoting, and upholding the human rights of Indigenous peoples in Canada. The <a href=\"https://www.justice.gc.ca/eng/declaration/index.html\"><em>United Nations Declaration on the Rights of Indigenous Peoples Act</em></a>, adopted earlier this year by Parliament, will serve as a roadmap for the implementation of the UN Declaration and for advancing reconciliation in a tangible way. We are addressing issues of gender equality through the <a href=\"https://www.canada.ca/en/department-finance/task-force-women-economy.html\">Task Force on Women in the Economy</a>. This diverse group of Canadian women provides advice on the tangible ways the Government of Canada can better support women’s participation in the economy, including by investing up to $30 billion over the next five years to help families access affordable child care through the <a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Canada-wide Early Learning and Child Care Plan</a>. The ideas and expertise of the women on this Task Force are helping us to address systemic barriers and inequities faced by women in the job market.</p>\n\n<p>“Through <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a>, we are working with Indigenous peoples, racialized communities, and religious minorities to fight systemic racism and inequalities in our society. With Canada’s first-ever Black Entrepreneurship Program, we are helping Black Canadian business owners and entrepreneurs grow their businesses and succeed now and into the future. We are working on a <a href=\"https://www.canada.ca/en/employment-social-development/programs/accessible-canada/consultation-disability-inclusion-action-plan.html\">Disability Inclusion Action Plan</a> to help ensure the full inclusion and participation of persons with disabilities in Canada. To combat antisemitism and Islamophobia, we have adopted the International Holocaust Remembrance Alliance’s definition of antisemitism and convened <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat/national-summits.html\">National Anti-Racism Summits on antisemitism and Islamophobia</a> to identify areas for further government action. We will continue to take steps to prevent gender-based violence, and fight racism, discrimination, and prejudice against LGBTQ2 people to create a more inclusive, kinder, and just Canada for everyone.</p>\n\n<p>“The promotion and protection of human rights is also an integral part of Canadian efforts abroad. In the face of rising authoritarianism, Canada must reinforce international peace and security, the rule of law, democracy, and respect for human rights. We launched a dedicated refugee stream to provide a safe haven for human rights defenders who are fleeing persecution in their home country. Thanks to <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a>, we are advancing gender equality and the well-being and empowerment of women and girls in all their diversity around the world. We will continue to work with our international partners, including the Office of the United Nations High Commissioner for Human Rights, to address human rights violations, wherever and whenever they happen.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to celebrate Human Rights Day and take this opportunity to reflect on what we can all do to advance human rights in our everyday lives – in our homes, workplaces, schools, and communities. Together, we can build a more just, safer, and fairer country and world for all.”</p></div>\n      "
}