{
  "path": "/en/news/readouts/2020/07/10/prime-minister-justin-trudeau-speaks-prime-minister-greece-kyriakos",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Greece Kyriakos Mitsotakis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Greece, Kyriakos Mitsotakis.</p>\n\n<p>Prime Minister Mitsotakis expressed sincere condolences for the tragic CH-148 Cyclone helicopter accident near Greece in April. Prime Minister Trudeau thanked him for his country’s assistance in the search and rescue efforts.</p>\n\n<p>The Prime Ministers discussed the COVID-19 pandemic and the significant efforts in Canada and Greece to address its health, social, and economic impacts.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mitsotakis spoke about the strong economic and commercial ties between Canada and Greece, and the benefits of the Canada-European Union Comprehensive Economic and Trade Agreement for businesses and workers in both countries.</p>\n\n<p>The two leaders looked forward to continuing to deepen the Canada–Greece relationship, including through strong people-to-people connections, and to working together on shared priorities such as peace and security.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/greece-grece/relations.aspx?lang=eng\">Canada-Greece relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n</ul></div>\n      "
}