{
  "path": "/en/news/statements/2022/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p>\n\n<p>“Today, we join the international community to mark <a href=\"https://earthday.ca/\">Earth Day</a>, which reminds us of our shared responsibility to protect our planet – for now and for the generations to come.</p>\n\n<p>“As Canadians, we are fortunate to have breathtaking forests, majestic mountains, and scenic lakes and coasts right in our backyards. Just as these gifts inspire us, they come with a tremendous responsibility to protect them. From preserving nature to fighting climate change and delivering clean air, Canada will continue to lead the way to a better future for everyone.</p>\n\n<p>“Already, we have made real progress. Since 2015, the Government of Canada has protected historic amounts of our lands, waters, and oceans, as we work toward our goal of protecting a quarter of our lands and a quarter of our oceans by 2025, and 30 per cent of each by 2030. We have planted tens of millions of trees across the country, and spring planting season is currently underway once again. We are also banning harmful single-use plastics, creating more national parks and green spaces for Canadians to enjoy, and investing in our <a href=\"https://tc.canada.ca/en/initiatives/oceans-protection-plan\">Oceans Protection Plan</a>.</p>\n\n<p>“Our work to protect nature and fight climate change is shared. We have much to learn from Indigenous Peoples who have been responsible stewards of the land, water, air, and all living things since time immemorial. We are supporting more Indigenous-led conservation initiatives across the country through the Indigenous Guardians and Indigenous Protected and Conserved Area initiatives.</p>\n\n<p>“There is no doubt the climate crisis is fundamentally linked to the crisis of rapid biodiversity loss. Protecting more nature has important benefits for the fight against climate change: it helps capture and store carbon while making our communities more resilient to the impacts of a changing climate, like floods and droughts. Our recently released <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</a>, along with <em><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget 2022: A Plan to Grow Our Economy and Make Life More Affordable</a></em>, outlines our next steps to embrace the power of nature to fight climate change and create strong, healthy communities from coast to coast to coast. From preserving wetlands and protecting old growth forests, to partnering with farmers, to cutting emissions and growing more sustainable food, our plan is building a better future for everyone.</p>\n\n<p>“Today, on #EarthDay, let us all reflect on how fortunate we are to live in such a beautiful country. When we protect our planet, everyone benefits. We deliver clean air, we create good middle-class jobs, and we ensure our children and grandchildren can inherit the natural landscapes we are so proud of as Canadians.”</p></div>\n      "
}