{
  "path": "/en/news/news-releases/2018/05/08/prime-minister-announces-st-louis-apology",
  "pageTitle": "Prime Minister announces St. Louis apology | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will deliver a formal apology in the House of Commons over the fate of the MS<i> St. Louis</i> and its passengers.</p><p>On May 13, 1939, the MS <i>St. Louis </i>departed Germany with close to a thousand passengers, including 907 Jewish German citizens desperate for safety and refuge from persecution. The Jewish refugees on board were not allowed to disembark at the ship’s first destination, Cuba, and were subsequently denied entry into the United States and, finally, Canada, due to our discriminatory “none is too many” immigration policy of the time. The refugees were forced to return to Europe, where many were condemned to concentration camps. 254 of the passengers were murdered during the Holocaust.</p><p>The Prime Minister made the announcement while speaking at the March of the Living’s 30<sup>th</sup> anniversary gala. The March of the Living is an annual educational program for students to travel to the Auschwitz-Birkenau concentration and extermination camp as a tribute to the survivors and victims of the Holocaust and the strength and resilience of the Jewish community.</p><h2>Quote</h2><blockquote><p>“When Canada denied asylum to the 907 German Jews on board the MS <i>St. Louis</i>, we failed not only those passengers, but also their descendants and community. An apology in the House of Commons will not rewrite this shameful chapter of our history. It will not bring back those who perished or repair the lives shattered by tragedy. But it is our collective responsibility to acknowledge this difficult truth, learn from this story, and continue to fight against anti-Semitism every day, as we give meaning to the solemn vow: ‘Never again.’ I look forward to offering this apology on the floor of the House.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote></div>\n      "
}