{
  "path": "/en/news/news-releases/2022/06/10/prime-minister-strengthens-partnerships-climate-action-democracy",
  "pageTitle": "Prime Minister strengthens partnerships on climate action, democracy, gender equality, economic growth at Summit of the Americas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the Ninth Summit of the Americas in Los Angeles, California, where he joined hemispheric leaders to work on the key challenges of our time, including tackling climate change and advancing gender equality, while driving economic growth that benefits everyone.</p>\n\n<p>During the Summit, the Prime Minister met with his counterparts to explore concrete ways to address the challenges faced throughout the Americas. The world leaders agreed to work together to support strong democratic institutions, take ambitious climate action, drive trade and economic growth that benefits everyone, advance gender equality and LGBTQI rights, and support health care, particularly for women and girls and the most vulnerable.</p>\n\n<p>The leaders also condemned Russia’s illegal invasion of Ukraine and agreed to work closely with partners across the Americas, and around the world, to continue to hold Russia accountable and support Ukrainians, including those who have been displaced. Putin’s war of choice has driven up the price of fuel and food, which is increasing the cost of living and fear of scarcity of food for people around the world, including in Latin America and the Caribbean.</p>\n\n<p>The Prime Minister today also announced over $145 million for initiatives to provide support to Latin American and Caribbean countries to make life better for people, including by advancing gender equality; promoting and protecting democracy; fighting climate change; increasing digital access and countering disinformation; and improving health and pandemic response. For example, we are supporting good jobs for women and Indigenous Peoples in Peru, while reducing the deforestation of the Amazon, through the Amazon Business Alliance.</p>\n\n<p>These initiatives include $26.9 million in additional funding toward migration- and protection-related projects in the Americas, such as support for Venezuelan refugees and funding to combat human trafficking. In addition to this funding, the Prime Minister announced further measures Canada is taking to address the irregular migration crisis, including endorsing the Los Angeles Declaration on Migration and Protection; advancing promotion and recruitment efforts related to Canada’s Francophone Immigration Program; welcoming more than 50,000 agricultural workers from Mexico, Guatemala and the Caribbean in 2022; and increasing refugee resettlement from the Americas by striving to welcome up to 4,000 individuals by 2028.</p>\n\n<p>The Prime Minister met with United States President Joe Biden to discuss a wide range of shared priorities ranging from economic growth and climate action, to responding to threats to democracy posed by disinformation. They also highlighted the progress made under the Joint Action Plan on Critical Minerals and reiterated the importance of working together to strengthen Canada-U.S. energy security while continuing to promote and nurture trade and investment ties. The Prime Minister also expressed his support for President Biden’s Americas Partnership for Economic Prosperity: a proposed new framework for economic cooperation across the Americas aiming to deliver economic growth in the region, generate good middle class jobs, and reduce economic inequality.</p>\n\n<p>Canada, along with Argentina, Brazil, Mexico, and the United States, is taking action to build more resilient, safe, and healthy global food systems for the future, particularly in response to rising food prices and fear of scarcity of food due to Russia’s illegal invasion of Ukraine and increasing extreme weather events. Leaders committed to promote best practices to boost crop yields, improve food trade, manage sanctions to ensure the free flow of food, continue to provide humanitarian assistance to the most vulnerable, support systems that improve food self-sufficiency, and promote the optimal use of fertilizers.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada values its deep and longstanding partnerships with countries across the Americas, which are crucial to improving peoples’ lives by driving economic growth that benefits everyone, advancing gender equality, and fighting climate change. At this productive Summit of the Americas, we recommitted to continue working together to build a better future for people across the hemisphere.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Summit of the Americas brings together leaders from North, Central, and South America and the Caribbean to discuss major challenges and shared priorities, including advancing action on climate change, gender equality, and pandemic recovery.</li>\n\t<li>The Prime Minister held bilateral meetings with the leaders of Argentina, Dominican Republic, Jamaica, and Barbados.</li>\n\t<li>Following their meeting, Prime Minister Trudeau and Barbados Prime Minister Mia Mottley issued a joint statement committing to building a sustainable, resilient and equitable future through the <a href=\"https://sdgs.un.org/goals\">Sustainable Development Goals</a>.</li>\n\t<li>He also held pull-aside meetings with the Bahamas and Peru.</li>\n\t<li>The Prime Minister held a bilateral meeting with Nancy Pelosi, Speaker of the United States House Representatives, during which they discussed shared bilateral issues including electric vehicle tax credits, countervailing duties on Canadian softwood lumber, and securing supply chains on both sides of the border. The Speaker was joined by U.S. congressional members.</li>\n\t<li>On the margins of the Summit, the Prime Minister hosted a roundtable discussion with hemispheric partners who are committed to collaborating and advancing shared objectives on protecting democracy, combatting climate change, and promoting gender equality. Leaders from Barbados, Belize, Chile, Ecuador, and Jamaica strategized on how to better safeguard democracy and explored potential areas for future collaboration.</li>\n\t<li>Canada also co-sponsored the “Americas for the Protection of the Ocean Declaration”, a Chilean initiative to establish a work plan to collaborate on strengthening ocean conservation. Columbia, Costa Rica, Ecuador, Mexico, Panama, Peru, and the U.S. also joined the initiative.</li>\n\t<li>While in California, Canada signed a Memorandum of Cooperation concerning Climate Action and Nature Protection, demonstrating our strong commitment to addressing climate change and protecting nature. The Governor of California and the Prime Minister issued a joint statement outlining their partnership to deliver clean air and water, good jobs, and healthy communities for Canadians and Californians alike.</li>\n\t<li>The Prime Minister also held bilateral meetings with the President of General Motors International, Shilpan Amin, and with Chief Executive Officer of Alphabet and Google, Sundar Pichai.</li>\n\t<li>Prior to his participation at the Summit, the Prime Minister visited NORAD Headquarters in Colorado where he met with senior civilian and military leaders to advance collaboration with the United States for the strong defence of North America. He was accompanied by Minister of National Defence Anita Anand.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"/en/news/backgrounders/2022/06/10/canadas-new-investments-and-assistance-latin-america-and-caribbean\">Backgrounder: Canada’s new investments and assistance in Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-meets-president-united-states-america-joe\">Prime Minister Justin Trudeau meets with the President of the United States of America, Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/10/los-angeles-declaration-migration-and-protection\">Los Angeles Declaration on Migration and Protection</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/08/building-sustainable-resilient-and-equitable-future-through-sustainable\">Joint Statement: Building a Sustainable, Resilient, and Equitable Future through the Sustainable Development Goals</a></li>\n\t<li><a href=\"/en/news/readouts/2022/06/10/prime-minister-justin-trudeau-meets-speaker-united-states-house\">Prime Minister Justin Trudeau meets with the Speaker of the United States House of Representatives Nancy Pelosi and U.S. congressional members</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-hosts-leaders-roundtable-key-regional-issues\">Prime Minister Justin Trudeau hosts leaders roundtable on key regional issues at the Summit of the Americas</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/09/joint-statement-new-canada-california-climate-action-and-nature\">Joint Statement: New Canada-California Climate Action and Nature Protection Partnership</a></li>\n\t<li><a href=\"https://www.dfo-mpo.gc.ca/oceans/collaboration/declaration-eng.html\">Joint declaration on \"Americas for the Protection of the Ocean\" during the ninth Summit of the Americas</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/08/prime-minister-justin-trudeau-visits-north-american-aerospace-defense\">Prime Minister Justin Trudeau visits the North American Aerospace Defense Command with the United States Secretary of Defense Lloyd J. Austin III</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/oas-oea/index.aspx?lang=eng\">Canada and the Organization of American States</a></li>\n\t<li><a href=\"http://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada–Caribbean Community (CARICOM) Relations</a></li>\n</ul></div>\n      "
}