{
  "path": "/en/news/statements/2020/09/08/statement-prime-minister-international-literacy-day",
  "pageTitle": "Statement by the Prime Minister on International Literacy Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Literacy Day:</p>\n\n<p>“Literacy is the foundation that empowers people around the world to reach their full potential. Today, on <a href=\"https://www.un.org/en/observances/literacy-day\">International Literacy Day</a>, we raise awareness of its importance and recognize the people who work tirelessly to make sure everyone has access to the opportunities that come with the ability to read and write.</p>\n\n<p>“Without access to literacy or education, success is often out of reach. Sadly, around the world, over 773 million people lack basic literacy skills. The COVID-19 pandemic has magnified the challenges they were already facing. The theme of this year’s International Literacy Day focuses on ‘literacy teaching and learning in the COVID-19 crisis and beyond’. The pandemic has shown us the many obstacles already facing those without literacy skills and reminds us of the work left to do to make sure everyone has a chance to succeed.</p>\n\n<p>“In partnership with Indigenous communities in particular, we have implemented the <em>Indigenous Languages Act</em> to support the efforts of Indigenous peoples to reclaim, revitalize, maintain, and strengthen Indigenous languages. The protection of Indigenous languages is fundamental to their cultures and heritage, and helps advance the self-determination of the Indigenous peoples who speak them. We will continue to work with Indigenous partners to support and help protect all Indigenous languages in Canada.</p>\n\n<p>“During the COVID-19 pandemic, the Government of Canada is also supporting provinces and territories in their efforts to deliver education for our children while protecting their health, and enabling teachers and staff to continue to do their important work. Through the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school\">Safe Return to Class Fund</a>, and funding for measures in First Nations communities to support a safe return to school, we are helping Canadians learn amidst the challenges of the pandemic.</p>\n\n<p>“Abroad, the Government of Canada is working closely with partners to help achieve inclusive, equitable, and quality education for all as part of its commitment to the United Nations’ <a href=\"https://www.un.org/sustainabledevelopment/sustainable-development-goals/\">Sustainable Development Goals</a>. That is why we announced, together with our partners, a <a href=\"https://pm.gc.ca/en/news/news-releases/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and\">historic investment in education for women and girls</a> in crisis and conflict situations and <a href=\"https://pm.gc.ca/en/news/news-releases/2018/09/26/prime-minister-concludes-successful-week-united-nations-general\">welcomed contributions</a> to help developing countries give every child access to quality education and modern skills training. We remain determined to help the most vulnerable and marginalized children and youth get the education, skills, and experience they need so they can unlock opportunities that may otherwise be out of reach.</p>\n\n<p>“Today, we celebrate those who work tirelessly to improve literacy and access to education, and the progress we have made at home and around the world. Together, we can all take steps to promote literacy and education and build a better, more prosperous future.”</p></div>\n      "
}