{
  "path": "/en/news/statements/2022/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/youth-day\">International Youth Day</a>, we celebrate the critical role young people play in making the world a better place for everyone here in Canada and around the world.</p>\n\n<p>“Young people are a driving force of change in building a future with clean air and clean water, with affordable housing, and with economic opportunities that benefit everyone. That’s why listening to youth across the country with diverse backgrounds and lived experiences is a top priority for the Government of Canada. A year ago, thanks to input and contributions from 1,000 youth, we released the first-ever <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/state-youth.html\">State of Youth Report</a> to highlight the opportunities and challenges young Canadians face, in their own words. Since then, we have been delivering real results to address what we heard loud and clear – we are making post-secondary education more affordable, helping young people find good jobs in their field and get the skills they need to succeed, and making it easier for them to buy their first home. We know that when we invest in young people, we are investing in our country’s future.</p>\n\n<p>“I also listen to the innovative ideas of young Canadians by working with my <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Youth Council</a>. Earlier this year, members of its fifth cohort provided essential insights on the issues that matter most to youth in Canada and shared their advice on what they would like to see addressed in Budget&nbsp;2022. From youth mental health to affordable housing, their input continues to help the government target programs and services to those who need them most.</p>\n\n<p>“Young people are the leaders of today and tomorrow. I know youth have embraced our country’s strength, diversity, and inclusion – and Canada is better for it. They also understand the issues Canada faces and have the innovative solutions we need. Today, we celebrate the endless potential of young people and look forward to what we can achieve by working together.”</p></div>\n      "
}