{
  "path": "/en/news/news-releases/2022/06/25/communique-commonwealth-heads-government-meeting-chogm-delivering",
  "pageTitle": "Communique of the Commonwealth Heads of Government Meeting (CHOGM) “Delivering a common future: connecting, innovating, transforming” | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2>Introduction</h2>\n\n<ol>\n\t<li>Commonwealth Heads of Government, hereafter referred to as Heads, met in Rwanda from 24 to 25 June 2022 under the theme of ‘Delivering a Common Future: Connecting, Innovating, Transforming,’ at a time of uneven recovery from the COVID-19 pandemic, new threats to economic security and political stability in the international system, and when many across the Commonwealth are directly and increasingly affected by the impacts of climate change. Heads acknowledged the importance of multilateral cooperation in a rules-based international system and reaffirmed their shared commitment to continue working with the United Nations (UN), other international and regional organisations and International Financial Institutions (IFIs) in their responses to these challenges.</li>\n\t<li>Heads underscored the importance of connecting, innovating, and transforming in order to facilitate a full recovery from the COVID-19 pandemic, and to respond to conflicts and crises in ways that increases resilience and progress in delivering a common future, underpinned by sustainability, peace and prosperity, to improve the lives of all the people of the Commonwealth.</li>\n\t<li>Expressing sorrow for the enormous loss of life and livelihood resulting from the COVID-19 pandemic, Heads affirmed that the universal, timely, fair and equitable access to, and distribution of safe, efficacious, and affordable COVID-19 vaccines, therapeutics and diagnostics, and capacity to administer the same, are key to global recovery. Heads committed to working together, and in close collaboration with other partners in the international community, to ensure that no one is left behind, including by supporting the COVID-19 Vaccines Global Access Facility (COVAX) through adequate funding, supply of vaccines, research and development (R&amp;D) collaboration, local manufacturing, and other measures, and to effectively integrate these services into international health systems.</li>\n\t<li>Heads noted the 2030 Agenda for Sustainable Development (2030 Agenda), including the Addis Ababa Action Agenda, as a global blueprint for recovery from the COVID-19 pandemic, and as an opportunity to build a more resilient, peaceful, prosperous, and inclusive world for all and to accelerate progress through the Decade of Action. Moreover, they discussed how the modern Commonwealth might build on its achievements and could leverage its comparative advantage and its network of organisations to contribute to viable solutions. Heads reaffirmed their commitment to the aspirations of the Commonwealth Charter and the 2030 Agenda.</li>\n\t<li>Heads discussed ongoing global conflicts and the associated loss of lives and infrastructure, and the displacement of people. They also discussed Ukraine. In this regard, Heads emphasised the commitment in the Commonwealth Charter, to international peace and security, and to an effective multilateral system based on international law. They took note of the relevant UN resolutions and reaffirmed their support for the Charter of the United Nations and international efforts for peace. Heads underscored the need to respect the territorial integrity and sovereignty of all states. Heads also emphasised that all countries must seek peaceful resolution to all disputes in accordance with international law.</li>\n\t<li>Heads expressed their deep concern that nutrition, food and energy security for the most vulnerable in the Commonwealth is being further affected by supply chain disruptions and price increases resulting from global instability, the COVID-19 pandemic, conflicts and crises that are impeding export from one of the world’s most important agricultural suppliers, and the impacts of climate change.&nbsp; They observed that disruptions to food security and nutrition, and the smooth flow of trade and exports, are undermining member countries’ recovery from the pandemic and adversely affecting sustainable development and progress on the 2030 Agenda.</li>\n\t<li>Heads recognised that ongoing global conflicts, including in Ukraine, heightens the impact that conflict places on global energy and food security and exacerbates existing high food prices and supply chain issues due to the COVID-19 pandemic and climate change. Heads highlighted the need to sustainably transform current food systems to address weaknesses of the agri-food sector, improve productivity, and build resilience in agriculture and supply chains to economic, social and environmental shocks. They reaffirmed the importance of maintaining transparent, inclusive, fair and open agricultural markets and trade to ensure the continued flow of food, products and inputs essential for agricultural and food production.</li>\n\t<li>Heads acknowledged that conflicts and crises affect migration patterns. They also acknowledged that women and children comprise the vast majority of refugee populations, and face significant risks of gender-based violence and sexual exploitation and abuse, as well as lack access to life-saving sexual and reproductive health services. They also acknowledged that safe, orderly, and regular migration can deliver social and economic benefits, strengthen resilience and growth, and contribute to sustainable development; but that irregular migration, including when driven by conflict, creates significant challenges. Heads agreed that a capacity-centred approach to migration partnerships would best serve common goals. Heads noted further that Commonwealth countries are affected differently by demographic, economic, social, and environmental changes that may result from migration or have implications for migration.&nbsp; Heads emphasised the need for international cooperation to facilitate safe, orderly, and regular migration, including through the implementation of relevant international frameworks.</li>\n\t<li>Heads are deeply concerned about the ongoing climate crisis, and recognised that it affects, in particular, the most vulnerable, including developing countries, least developed countries and Small Island Developing States (SIDS). Heads welcomed the substantive progress of the 26<sup>th</sup> Conference of Parties to the UN Framework Convention on Climate Change (UNFCCC) (COP26) and the COP26 Glasgow Climate Pact, including their collective commitment to achieving the agreed ambition on finance, adaptation, and mitigation.</li>\n</ol>\n\n<h2>GOVERNANCE, HUMAN RIGHTS AND THE RULE OF LAW</h2>\n\n<ol start=\"10\">\n\t<li>Heads renewed their commitment to the Commonwealth’s fundamental political values of democracy, gender equality, and inclusive development, as outlined in the Commonwealth Charter. They further reiterated their commitment to human rights and fundamental freedoms as enshrined in the Universal Declaration of Human Rights and other relevant international instruments. Recognising that human rights are applicable in online and offline media, they underscored the vital role of a vibrant civil society, including human rights defenders, in delivering good governance and democracy. They underscored the importance of good cooperation between member countries and their respective National Human Rights Institutions or equivalent mechanisms.</li>\n\t<li>Heads stressed the importance of the right to freedom of expression through peaceful, open dialogue, and the free flow of information, including through a free, independent, responsible, and pluralistic media, and committed to enhancing democratic traditions and strengthening democratic processes. Heads noted the important ongoing work being carried out by the Expert Working Group of member countries on the Commonwealth Principles on Freedom of Expression and the Role of the Media in Good Governance, and looked forward to further updates. Furthermore, Heads noted that freedom of religion or belief are cornerstones of democratic societies.</li>\n\t<li>Heads reaffirmed their support for the Good Offices role of the Secretary-General as a mechanism to protect and promote the Commonwealth’s fundamental values and principles.</li>\n\t<li>Heads also commended the outgoing members of the Commonwealth Ministerial Action Group (CMAG) for engaging with member countries when these values and principles were under threat. They acknowledged CMAG’s report to Heads and noted the reconstituted CMAG should ensure regional balance, continuity and institutional memory.</li>\n\t<li>Heads reaffirmed their commitment to the Revised Commonwealth Guidelines on Election Observation, endorsed at the 2018 Commonwealth Heads of Government Meeting, and called for strengthened efforts throughout an election cycle to support member countries in improving their democratic processes and institutions, including through the establishment of domestic mechanisms to review and take forward observer recommendations.</li>\n</ol>\n\n<p><em>Rule of Law and Human Rights </em></p>\n\n<ol start=\"15\">\n\t<li>Heads noted the work of the Commonwealth Secretariat (the Secretariat) in facilitating the promotion and protection of human rights with member countries, particularly through the implementation of the Universal Periodic Review and treaty body outcomes. Heads acknowledged support for the establishment and strengthening of National Human Rights Institutions or equivalent mechanisms. They appreciated the human rights expertise and assistance provided through the Commonwealth Small States Office in Geneva. Heads encouraged efforts to reinforce respect for human rights and reiterated the continued importance of sharing human rights good practice and expertise across the Commonwealth.</li>\n\t<li>Heads emphasised the need for effective measures to eradicate forced labour, end modern slavery and human trafficking, and secure the prohibition and elimination of all forms of child labour, including the recruitment and use of child soldiers, by 2025.<em> </em>In this context, Heads endorsed the Kigali Declaration on Child Care and Protection Reform. They also encouraged member countries to ratify and implement relevant outstanding international human rights agreements and International Labour Organisation conventions.</li>\n\t<li>Heads underscored that measures taken to address the COVID-19 pandemic should be targeted, necessary, transparent, non-discriminatory, time-bound, and proportionate. They also stressed that these measures should be in accordance with member countries’ obligations under applicable international human rights law.</li>\n\t<li>Heads endorsed the Commonwealth Law Ministers Declaration on Equal Access to Justice issued in Colombo, in November 2019, and the subsequent Plan of Action endorsed by Senior Officials of Law Ministries, in February 2021. In particular, Heads renewed their commitment to respect the rule of law, equal access to justice and independent justice systems.</li>\n\t<li>In pursuit of SDGs 10 (reduced inequalities) and 16 (peace, justice and strong institutions), Heads committed to fully implement laws that promote and protect inclusion, to eliminate discriminatory laws, policies and practices, and to promote appropriate legislation, policies and action.<em> </em></li>\n\t<li>Heads emphasised the need to protect all individuals from all forms of violence and discrimination. They welcomed the Commonwealth Foreign Affairs Ministers Statement on Racism and committed to eliminate the scourge of racial discrimination and inequality.</li>\n\t<li>Heads renewed their commitment to fully implementing the Commonwealth (Latimer House) Principles on the Three Branches of Government and noted the updated Benchmarks for Democratic Legislatures prepared by the Commonwealth Parliamentary Association.</li>\n\t<li>Heads called for greater focus on the promotion and realisation of the right of everyone to the enjoyment of the highest attainable standard<em> </em>of mental health and well-being. They emphasised the urgent need to examine mental health and psycho-social support policies<strong> </strong>across the Commonwealth, and to promote community rights-based and people-centred services for people with mental health conditions and psycho-social conditions. Moreover, they encouraged member countries to tackle holistically the social stigma and discrimination that persons with mental health conditions in all forms may face.</li>\n\t<li>Heads noted that persons with disabilities are disproportionately vulnerable to the health, economic and social impacts of the COVID-19 pandemic and called on member countries to ensure that their COVID-19 response and recovery actions, including vaccine programmes, are inclusive. They also urged member countries to implement the UN Convention on the Rights of Persons with Disabilities,<strong> </strong>and promote alignment of any related policies.</li>\n\t<li>Heads reaffirmed that radicalisation leading to violence, violent extremism, and terrorism in all its forms are serious global threats, expressed concern for victims, and condemned perpetrators. They acknowledged that these threats require a multi-faceted and whole-of-society approach, including working with all relevant stakeholders to address the root causes and drivers, encouraging the meaningful participation of women and youth, and focusing on building resilient and inclusive societies.</li>\n\t<li>Heads took note of the outcomes of the 2022 Commonwealth Ministers of Education Meeting, including the role that education can play in preventing violent extremism. Heads called upon Ministers of Education to accelerate implementation of global citizenship education towards elimination of all forms of violence.</li>\n\t<li>Heads further reaffirmed the continued relevance and importance of viable solutions and encouraged member countries to actively share expertise and best practice with those members affected by violent extremism and terrorism. They encouraged member countries to support the efforts of the Secretariat in providing effective gender-responsive assistance in Preventing and Countering Violent Extremism, including in preventing the use of the internet for radicalisation leading to violence and recruitment of Commonwealth citizens by violent extremist groups. Heads also noted the vital role that international networks play in countering terrorist activities by preventing money laundering and countering terrorist financing.</li>\n</ol>\n\n<p><em>Gender Equality</em></p>\n\n<ol start=\"27\">\n\t<li>Heads adopted a Commonwealth Declaration on Gender Equality and Women’s Empowerment. They acknowledged the UN Women’s review of progress since the adoption of the Beijing Declaration and Platform for Action in 1995 and expressed concern at all forms of discrimination faced by women and girls. They recognised that women and girls are still underrepresented in decision-making processes, including in situations of conflict and crisis, environmental-related disasters, and humanitarian settings; are disproportionately affected by poverty and discrimination; carry the majority of unpaid care and domestic work; are exposed to sexual and gender-based violence, including being disproportionately affected by conflict-related sexual violence; and make up the majority of victims of human trafficking for sexual exploitation purposes, and harmful practices, both online and offline.</li>\n\t<li>Heads emphasised that women continue to face disproportionate barriers exacerbated by the COVID-19 pandemic, particularly of unpaid care and domestic work, that prevent them from fully engaging in and benefiting from trade and acknowledged that economic and trade instruments, policies, programmes and agreements could address these barriers. Heads committed to addressing these barriers, promoting women’s economic empowerment, and increasing opportunities for women-owned businesses to trade. Heads recognised the complimentary trade and domestic policies to ensure that women, as workers, business owners and consumers, can participate in and benefit from trade; and will further enhance their efforts to promote gender equality and equity in bilateral and multilateral settings.</li>\n</ol>\n\n<p><em>Delivering Good Governance</em></p>\n\n<ol start=\"29\">\n\t<li>Heads reflected on the link between good governance and transformational leadership that is accountable, transparent, inclusive, and non-discriminatory. They committed to the effective and equitable delivery of public goods and determined to continually evaluate their governance systems, and make improvements where necessary, including placing citizen participation (especially of young people, women and others facing inequality), at the heart of policy development.&nbsp; Heads called for increased technical assistance from the Secretariat, especially to Low-to-Middle-Income-Countries in policy formulation and development.</li>\n\t<li>Heads further noted the importance of UN Security Council Resolution 1325(2000) and subsequent resolutions addressing women, peace, and security; and the importance of ensuring women’s full, equal, and meaningful participation and protection in preventing, ending, and rebuilding after conflict, including in leadership and decision-making roles. Heads acknowledged the valuable work of women mediators and peacebuilders in building peace across the Commonwealth and beyond, including the Women Mediators across the Commonwealth network.</li>\n\t<li>Heads welcomed greater citizen engagement in Commonwealth institutions and programmes and noted, with appreciation, the strengthened collaboration between the Secretariat and Commonwealth Foundation.</li>\n\t<li>Heads commended the Principles of the Commonwealth Anti-Corruption Benchmarks, which are non-binding, and reaffirmed their commitment to substantially reduce corruption and bribery in all forms; develop effective, accountable, and transparent institutions at all levels; and ensure responsive, inclusive, participatory, and representative decision-making at all levels, in accordance with SDG 16.</li>\n</ol>\n\n<h2>SUSTAINABILITY</h2>\n\n<p><em>Economy</em></p>\n\n<ol start=\"33\">\n\t<li>Heads expressed deep concern about the continued impact of the COVID-19 pandemic on the global economy. They acknowledged that developing countries have been disproportionately affected by the pandemic in terms of impact on their economies, employment opportunities, livelihoods of people and food security. They acknowledged the measures member countries have taken to protect all citizens, particularly those from the most vulnerable groups, and to mitigate the pandemic’s effects; while noting that inclusive global economic recovery will require a commitment to a sustainable economic system that is centred around people and the environment. Accordingly, Heads welcomed the enhanced collaboration of Commonwealth Finance Ministers, who met on 7 October 2020, and on 12 October 2021.</li>\n\t<li>Heads recognised that the continued economic impact of the COVID-19 pandemic has been particularly acute on tourism, manufacturing, and fisheries, leading to significant job losses and the closure of many small and medium enterprises, including many owned by women. Heads recognised that tourism is the main source of revenue for many Commonwealth countries, particularly for SIDS. They noted the challenges of de-risking and loss of correspondent banking relationships for SIDS, which has the potential to exclude many countries from the global financial system and increase the costs and lower the level of remittances. Heads encouraged enhanced trade collaboration between members, as well as diversification of this sector to increase economic resilience.</li>\n\t<li>Noting that COVID-19 responses have put additional pressure on economies with limited fiscal space, resulting in increasing debt levels, particularly for small states and developing economies, Heads acknowledged the need for IFIs to develop appropriate mechanisms to meet their needs. They recognised a need for a long-term view on debt sustainability and for more innovative solutions to sovereign debt resolution challenges, such as natural disaster clauses in bond issues. Heads called on the G20 to work with the Paris Club of official creditors to make the process of the Common Framework for Debt Treatments (Common Framework) clearer and more coordinated among relevant stakeholders, and to support countries with debt vulnerabilities.</li>\n\t<li>Heads called on the G20 to work with the Paris Club to effectively implement the Common Framework for delivering debt relief for countries with debt vulnerabilities, including for private creditors to provide comparable treatment in any future Common Framework, and for existing debt reduction initiatives to be scaled up where necessary, including low interest perpetual bonds for sustainable development and climate action. Heads pledged to work together, and with others, to tackle the impact of natural disasters, as well the threat of pandemics which may be exacerbated by natural disasters and related climate impacts.</li>\n\t<li>Heads called for concerted and coordinated efforts to rebuild resilient economies and build future preparedness to tackle natural disasters, considering the specific needs of developing countries, least developed countries, and SIDS.</li>\n\t<li>Heads further encouraged member countries to accelerate the transition to sustainable markets, in the context of strengthening global efforts to reach the goals of the UNFCCC and the Paris Agreement, which include common but differentiated responsibilities and respective capabilities, in the light of different national circumstances, through laws and policies that incentivise sustainable and inclusive economic development, including women’s economic empowerment and the promotion of equal labour market outcomes for women. Further noting that transitioning to low carbon, climate-resilient economies must be just and will require adequate and predictable climate finance, technology development and transfer, and capacity building. They further urged member countries to improve resilience by diversifying national supply chains, creating green jobs, building resilient infrastructure, advancing sustainable ocean economies, encouraging domestic consumption, adopting digital solutions, and promoting food security through climate-resilient food systems.</li>\n\t<li>Heads recognised the crucial role of investment in transforming economies and creating inclusive economic growth and long-term prosperity. They acknowledged that high quality investment and infrastructure, both digital and physical, and notably clean, green infrastructure investment, is a cornerstone of sustainable economic growth. Heads noted the opportunities arising from investment partnerships across the Commonwealth membership to bring mutual benefits to all.</li>\n</ol>\n\n<p><em>Small States </em></p>\n\n<ol start=\"40\">\n\t<li>Heads recognised the particular vulnerabilities of small states, including SIDS, especially in relation to natural, environmental, economic and socio-political shocks. They also noted that these states also face vulnerabilities and are disproportionately affected by the climate crisis, for example, through increased land degradation, drought, flash floods, and rising sea levels. In this regard, Heads noted and acknowledged work undertaken in the Pacific region, as well as the adoption of the Pacific Islands Forum Declaration on Preserving Maritime Zones in the Face of Climate Change-Related Sea Level Rise to ensure that&nbsp;maritime&nbsp;zones&nbsp;are not&nbsp;reduced due to the effects of sea level rise. They noted the potential loss of&nbsp;land&nbsp;territory&nbsp;and the implications this may have for&nbsp;Statehood for&nbsp;some SIDS due to climate change and sea level rise.</li>\n\t<li>Heads noted the outcome statement of the 2022 Commonwealth Ministerial Meeting on Small States and noted the urgent need to address small states, including the vulnerabilities of SIDS. Heads recalled the COP26 Glasgow Climate Pact, which encourages relevant providers of financial support to consider how vulnerability to the adverse effects of climate change could be reflected in the provision and mobilisation of concessional financial resources and how they could simplify and enhance access to finance. To this end, they noted the development of the Commonwealth Universal Vulnerability Index, which could complement indices such as Multidimensional Vulnerability Index, and called for urgent global discussion on a definition of climate vulnerability to access concessional finance. They also welcomed the UN-Commonwealth Joint Advocacy Strategy Towards Achieving the SDGs and Addressing the Vulnerabilities of Small States, which calls for a UN-Commonwealth Decade of Action, focused specifically on addressing the issues affecting small states, including climatic and environmental vulnerability, remoteness, climate change, high debt burdens, tourism dependence, and access to concessional finance.</li>\n\t<li>Heads acknowledged the work of the Commonwealth Small States Offices, the Commonwealth Small States Centre of Excellence, and the Commonwealth Small States Trade Financing Facility, and encouraged collaboration with other UN mechanisms. Heads furthermore acknowledged the development of the Commonwealth Virtual Centre for Small States to provide a virtual hub to facilitate knowledge sharing, build capacity amongst small states, and enhance the work of existing institutional structures.</li>\n</ol>\n\n<p><em>Trade</em></p>\n\n<ol start=\"43\">\n\t<li>Heads welcomed the revitalised collaboration among Commonwealth Trade Ministers, who met in October 2019, and received their outcome statements. They agreed that Commonwealth Trade Ministers reconvene by June 2023 to discuss next steps following the World Trade Organization’s (WTO's) 12th Ministerial Conference. Noting the findings of the 2021 Commonwealth Trade Review, the need for more ambitious action to boost intra-Commonwealth trade to US$ 2 trillion by 2030, and the impact that trade can have on tackling poverty, Heads reiterated the importance of trade in goods and services and investment for inclusive and sustainable economic growth and prosperity. This includes considering development clauses in new trading agreements that reinforce the interconnected nature of trade and development objectives.</li>\n\t<li>Heads noted the operationalisation of the Commonwealth Connectivity Agenda for Trade and Investment and the progress that has been made in building mutual understanding and sharing of experiences. Heads recognised the progress made on the Commonwealth Connectivity Agenda since CHOGM 2018, the work carried out by the five connectivity clusters and the lead countries towards generating inclusive and participatory inter-Commonwealth trade and investment and called on Commonwealth Trade Ministers to take the requisite steps to ensure the optimal work of the clusters. They noted the Commonwealth Connectivity Agenda Action Plan and undertook to intensify efforts for impactful outcomes.</li>\n\t<li>Heads reaffirmed the need to employ the necessary tools and policies for developing countries to develop their economies in a sustainable manner.</li>\n\t<li>Heads underscored the need for a transformative agenda and noted the outcomes expressed in the Bridgetown Covenant, particularly those related to the most vulnerable, including SIDS, and noted the Ministerial Declaration of the group of small island developing states for the occasion of UNCTAD 15. Heads commended the Government of Barbados for being the first small island developing state to host this conference. Heads recognised the need for collaboration in the follow up on actions related to the implementation of the Bridgetown Covenant, particularly in the areas that are of importance to SIDS and asked the Secretariat to work with UNCTAD and the wider UN system to this end.</li>\n\t<li>Heads reflected on the challenges and opportunities in the multilateral trading system. They reaffirmed their commitment to free trade and they recognised the importance of targeted Special and Differential Treatment as a tool to support least developed and developing countries, where necessary, to fully implement WTO Agreements in a transparent, inclusive, fair and open, rules-based multilateral trading system, with the WTO at its core; taking into account the special circumstances of least developed countries and small and vulnerable economies, including SIDS and landlocked developing countries. They reiterated their support for reform of the WTO so it can continue to serve the needs of these nations. They highlighted the importance and urgency of launching the selection process of the Appellate Body members to restore the binding two-tier dispute settlement mechanism. Heads were particularly concerned about the risk of protectionist measures and unfair trading practices that threaten the rules-based trading system. They further recognised the importance of strengthening and reforming the WTO to improve its functioning as well as ensuring that all WTO members respect and uphold the rules-based international system. Heads further took note of the progress made in the implementation of the Trade Facilitation Agreement.&nbsp;</li>\n\t<li>Heads reaffirmed the importance of taking a holistic approach towards trade and sustainability within the Commonwealth, and recognising unique country circumstances and respective capabilities, in the light of different national circumstances, which focuses on sustainably sourced products, and takes into account the priorities and needs of developing countries and small and vulnerable states. Heads also noted the importance of supporting opportunities for women and young people in trade, and called for concrete, innovative partnerships, and solutions to address the root causes of limited women’s participation in the digital economy, including through initiatives aimed at building skills and improving access to digital economies.</li>\n</ol>\n\n<p><em>The Urgent Threat of Climate Change</em></p>\n\n<ol start=\"49\">\n\t<li>Heads underscored that the urgent threat of climate change, which particularly affects developing countries from across the Commonwealth, least developed countries and SIDS, further exacerbates existing vulnerabilities, and presents a significant threat to COVID-19 recovery efforts and sustainable development, and a risk of undermining and reversing development gains.</li>\n\t<li>Heads noted the 2022 Intergovernmental Panel on Climate Change Working Groups I, II and III, and their contributions to the 6<sup>th</sup> Assessment Report, which highlighted the urgency of their findings on the science, adaptation and mitigation aspects of climate change.</li>\n\t<li>Heads renewed their commitment under the Paris Agreement to keep the increase in global average temperature to well below 2 degrees Celsius above pre-industrial levels and to pursue efforts to limit the temperature increase to 1.5 degrees Celsius above pre-industrial levels. Heads also recognise that the impacts of climate change will be much lower at the temperature increase of 1.5 degrees Celsius compared with 2 degrees Celsius, and resolve to pursue efforts to limit temperature increase to 1.5 degrees Celsius, as provided for in the COP26 Glasgow Climate Pact.</li>\n\t<li>Heads stressed the urgency of enhancing ambition and action in relation to mitigation, adaptation, and finance in this critical decade to address the gaps in the implementation of the goals of the Paris Agreement and welcomed the substantive progress made at COP26, the Glasgow Climate Pact.</li>\n\t<li>Heads noted the request to Parties to revisit and strengthen the 2030 targets in their Nationally Determined Contributions as necessary to align with the Paris Agreement temperature goal by the end of 2022, taking into account different national circumstances.&nbsp;Heads also urged Parties that have not yet done so to communicate, by the fourth session of the Conference of Parties serving as the meeting of the Parties to the Paris Agreement long-term low greenhouse gas emissions Development Strategies towards just transitions to net-zero emissions by or around mid-century, taking into account different national circumstances. Heads recognise that limiting global warming to 1.5 degrees Celsius requires rapid, deep and sustained reductions in global greenhouse gas emissions, including reducing global carbon dioxide emissions by 45% by 2030 relative to the 2010 level and to net-zero around mid-century as well as deep reductions in other greenhouse gasses. Heads recognised that this requires accelerated action in this critical decade on the basis of the best available scientific knowledge and equity, reflecting the agreed principles of common but differentiated responsibilities and respective capabilities, in the light of different national circumstances, and in the context of sustainable development and efforts to eradicate poverty. Heads further recognised that enhanced support for developing country parties will allow for higher ambition in their actions. Heads call upon parties to accelerate the development, deployment and dissemination of technologies, and the adoption of policies, to transition towards low emission energy systems, including by rapidly scaling up the deployment of clean power generation and energy efficiency measures, including accelerating efforts towards the phasedown of unabated coal power and phase-out of inefficient fossil fuel subsidies,&nbsp; while providing targeted support to the poorest and most vulnerable in line with national circumstances and recognising the need for support towards a just transition. Heads reiterate the urgency of scaling up action and support, as appropriate, including finance, technology transfer and capacity-building, for implementing approaches to averting, minimizing and addressing loss and damage associated with the adverse effects of climate change in developing country Parties that are particularly vulnerable to these effects; and urges developed country Parties, the operating entities of the Financial Mechanism, United Nations entities and intergovernmental organizations and other bilateral and multilateral institutions, including non-governmental organizations and private sources, to provide enhanced and additional support for activities addressing loss and damage associated with the adverse effects of climate change.</li>\n\t<li>Heads noted with deep regret that the goal of developed country parties to mobilise jointly US$100 billion per year by 2020 in the context of meaningful mitigation actions and transparency on implementation has not yet been met and welcomes the increased pledges made by many developed country parties and the <em>Climate Finance Delivery Plan: Meeting the US$100 Billion Goal </em>and the collective actions contained therein. Heads urge developed country parties to fully deliver on the US$100 Billion Goal urgently and through to 2025, and emphasise the importance of transparency in the implementation of their pledges. Heads further called on developed countries to deliver on the goal to at least double the collective provision of climate finance for adaptation to developing country parties from 2019 levels by 2025 as agreed as part of the COP26 Glasgow Climate Pact.</li>\n\t<li>Heads noted the continuing efforts of the Commonwealth Climate Finance Access Hub in assisting developing country members with human and institutional capacity to mobilise climate finance for NDC implementation, including development of bankable projects and climate policy support.</li>\n\t<li>Heads affirmed the importance of fully implementing the Kigali Amendment to the Montreal Protocol on phasing down hydrofluorocarbons.</li>\n\t<li>Heads expressed their appreciation for the leading role women and young people play in galvanising support for climate action across the Commonwealth and committed to ensuring gender responsive implementation. Heads noted the Commonwealth Youth Statement on Climate Change with its call to support communities and safeguard the most vulnerable, including youth, women, the elderly, and persons with disabilities. This should be done by ensuring predictable finance to the local level to enable greater locally-led action.</li>\n\t<li>With regard to Indigenous peoples, Heads acknowledged their leadership in the fight against climate change despite being disproportionately affected by its impacts. They recognised that Indigenous peoples and their local and traditional knowledge and practices, developed through millennia of environmental stewardship, are critical to addressing climate change and committed to enabling Indigenous climate leadership, grounded in respect for their rights and traditional knowledge.</li>\n\t<li>Heads noted the Climate Vulnerable Forum member countries’ ambition to scale up their commitments for safeguarding the most vulnerable from the impact of climate change, while supporting prosperity and resilience through investments in low carbon and climate-resilient technologies and infrastructure.</li>\n\t<li>Heads adopted the Commonwealth Living Lands Charter, A Commonwealth Call to Action on Living Lands.</li>\n\t<li>Noting that food systems are both drivers and solutions to complex issues like hunger and malnutrition, climate change, and gender inequality, Heads recalled the importance of considering the implications of the combined effects of biodiversity loss, land degradation and climate change.</li>\n\t<li>Heads acknowledged that work remains to be done as member countries work towards COP27 in Sharm el-Sheikh. They looked forward to working together with the global community to ensure true progress is made on climate action urgently in this critical decade.</li>\n</ol>\n\n<p><em>Ocean Protection, Sustainable Blue Economies, Energy, and Natural Resources </em></p>\n\n<ol start=\"63\">\n\t<li>Heads acknowledged the critical role of the ocean in mitigating and adapting to climate change and supporting sustainable blue economies for resilient economic recovery, especially for small island states. They reaffirmed their commitment to the Commonwealth Blue Charter, welcoming the progress made by the ten Action Groups, led by sixteen champion countries. Heads noted, <em>inter alia</em>, actions taken by countries on tackling marine plastic pollution, expanded ocean observations, ocean-based climate action, marine environmental protection, ecosystem restoration, and sustainable use of the ocean and strategies for blue economy.</li>\n\t<li>Heads recognised the value of Blue Charter actions in advancing progress towards SDG 14 (life below water). They welcomed the following examples of country leadership in advancing ocean research and education: the establishment by Antigua and Barbuda of a Centre of Excellence in Oceanography and the Blue Economy at the University of the West Indies Five Islands campus; and the establishment by Cyprus of a Blue Charter Centre of Excellence that will focus on governance for a sustainable blue economy, sustainable aquaculture, marine research, development and innovation. Heads welcomed and committed to take an active role during the second UN Ocean Conference in Lisbon in 2022.</li>\n\t<li>Heads also recognised that despite developing countries needing global support now more than ever to halt and reverse biodiversity loss in the ocean and on land, financial support remains insufficient. They noted the need to mobilise additional funding for an integrated and inclusive approach to financing the ocean, climate, and nature, to maximise co-benefits and leverage cost-effective ecosystem-based approaches. They called for additional investments from the philanthropic and private sector communities and mandated the Secretariat to develop robust and sustainable resourcing options and solutions to support cooperative activities by member countries under the Blue Charter. Heads encouraged the Secretariat to continue consideration of the establishment of a Blue Charter Action Fund. Heads recognised the need for the conservation and sustainable use of the ocean, seas, and marine resources and agreed to work on a declaration consistent with SDG 14 and the COP26 Glasgow Climate Pact.</li>\n\t<li>Heads welcomed efforts to protect the planet and the emerging global commitments for the conservation of biodiversity, but recognised that more action is needed.&nbsp; Heads, in particular, recognised the agreement of an annual ocean and climate change dialogue in the COP26 Glasgow Climate Pact, the 2050 Vision of “Living in harmony with nature” under the UN Convention on Biological Diversity, and the need to adopt an ambitious post-2020 global biodiversity framework in 2022. Heads welcomed efforts to protect the land and the ocean, and to sustainably manage the ocean and seas under national jurisdiction.</li>\n\t<li>Noting the historic resolution agreed at UN Environment Assembly 5.2 titled “End Plastic Pollution: Towards an International Legally Binding Instrument”, Heads welcomed efforts to convene an intergovernmental negotiating committee to develop an internationally legally binding instrument on plastic pollution, with the ambition of completing its work by the end of 2024 and agreed to continue to take action against plastic pollution while negotiations are ongoing.</li>\n\t<li>Heads also urged an ambitious outcome in the negotiations towards an international legally binding instrument under the UN Convention on the Law of Sea on the conservation and sustainable use of marine biological diversity of areas beyond national jurisdiction.</li>\n\t<li>Heads noted that most greenhouse gas emissions stem from energy production and use and in this regard renewed their commitment to meet SDG 7 (affordable and clean energy). Heads welcomed the establishment of the Commonwealth Sustainable Energy Forum with its planned agenda for action and formation of action groups. They also reaffirmed their commitment to the sustainable development of energy and natural resources, finding them essential to an inclusive and resilient economic recovery.</li>\n\t<li>Heads welcomed the partnership between the Secretariat and the International Solar Alliance for the deployment of solar energy systems in Commonwealth member countries. They also welcomed the partnership between the Secretariat and Sustainable Energy for All to attract finance and investment in clean energy and low carbon development in small states, including SIDS. In this regard, Heads encouraged the development of further partnerships to support sustainable and clean energy transition and appropriate alternative energy infrastructure.</li>\n\t<li>Heads welcomed the completion of the Queen’s Commonwealth Canopy, launched in 2015, creating a pan-Commonwealth network of forest conservation initiatives.</li>\n</ol>\n\n<h2>HEALTH</h2>\n\n<p><em>Strengthening health systems and rapid response capacities </em></p>\n\n<ol start=\"72\">\n\t<li>Recalling their previous statement on the COVID-19 pandemic, Heads acknowledged that addressing the pandemic has refocused attention on the importance of having strong, resilient and inclusive health systems, with integrated public health functions so member countries are better prepared to prevent, detect, respond and recover from health emergencies, including pandemics, natural disasters and the health impacts of climate change. Heads called for coordinated global action, including through bolstering national public health systems to strengthen health emergency, prevention, preparedness, and response capacities in line with International Health Regulations 2005 through a One Health approach.</li>\n\t<li>Heads recognised the need to tackle antimicrobial resistance and called for coordinated global action through a One Health approach to address the serious threat of antimicrobial resistance to human, animal, plant and environmental health, food safety, and food security, with the potential to undermine livelihoods, and put millions of people at risk of poverty, particularly in Commonwealth countries.</li>\n\t<li>Heads welcomed the commitment made at the World Health Assembly Special Session in 2021 to give consideration to the benefits of developing a WHO convention, agreement, or other international instrument on pandemic prevention, preparedness and response with a view to adoption under Article 19, or under other provisions of the WHO Constitution.</li>\n\t<li>They resolved to continue to work in cooperation with national, regional, and international partners to overcome the COVID-19 pandemic and transition towards longer term COVID-19 control, by supporting universal, fair, timely, equitable and non-discriminatory access to and distribution of safe, efficacious, and affordable COVID-19 vaccines, therapeutics, and diagnostics. Heads noted the Secretariat’s partnership with the WHO to develop collaborative programmes to address global health issues, including COVID-19 response. Heads acknowledged the critical role played by front-line health workers, especially women, who saved thousands of lives under the most challenging circumstances, and pledge to motivate, protect and invest in them.</li>\n\t<li>Heads noted that countries with strong health systems, effectively integrated public health functions, and Universal Health Coverage (UHC), have been resilient during the COVID-19 pandemic. Heads resolved to allocate adequate resources to build sustainable, inclusive, and resilient health systems, with a focus on primary health care (PHC) and reaching those who are vulnerable or in vulnerable situations, that would accelerate progress towards the goal of UHC and strengthen preparedness for health emergencies, including for enabling an effective response to emergencies while maintaining access to essential health services.</li>\n\t<li>Heads committed to continue to implement the WHO Global Code of Practice on the International Recruitment of Health Personnel and the recommendations of the 2020 WHO expert advisory group on the relevance and effectiveness of the WHO Global Code of Practice on the International Recruitment of Health Personnel, to equitably strengthen health systems worldwide.</li>\n\t<li>Noting the significant scientific tools and technologies that have been developed during the COVID-19 pandemic, Heads underscored the need to enhance research and innovation in healthcare technology as critical enablers for building strong health systems, including PHC infrastructure. To this end, Heads committed to strengthen collaboration and cooperation to share expertise and tools and forge partnerships across the Commonwealth family.</li>\n\t<li>Noting that the immunisation drive for COVID-19 relies on the availability of vaccines, logistics to store and transport vaccines and the capacity to administer vaccines, which involves several organisations and stakeholders, Heads underscored the need within Commonwealth countries to continue to strengthen collaboration between R&amp;D institutes, improve the clinical trial ecosystem research and regulatory bodies, support health care worker training institutes, and explore avenues of regional and global cooperation in capacity building for local and regional vaccine production. They further encouraged clinical R&amp;D collaborations and support for local manufacturers to increase sustainability in the supply of safe, effective and affordable therapeutics and vaccines, to reduce inequity in access. To this end, Heads underscored the significance of building transparent and unconstrained global supply chains for vaccine and pharmaceuticals raw materials.</li>\n\t<li>Heads committed to increasing efforts to support affordable, timely, equitable access to quality health services,<strong> </strong>including sexual and reproductive health services, and safe, efficacious, and affordable<strong> </strong>medicines, diagnostics, therapeutics, and vaccines. This includes COVID-19 vaccines, therapeutics and diagnostics, and other COVID-19 medical countermeasures, healthcare technologies and products, particularly for high-risk or vulnerable populations, including persons with disabilities. Heads appreciated the efforts of member countries to support each other in supplying vaccines and other COVID-19 related supplies. They further welcomed voluntary efforts by member countries to equitably share and distribute COVID-19 related supplies based on country need and in line with existing global efforts.</li>\n\t<li>Noting the achievements of several member countries in vaccinating their population against COVID-19, Heads underlined the need to achieve high vaccination rates in all member countries in line with national goals and WHO guidance. To this end, Heads encouraged all stakeholders to support government efforts to improve vaccine confidence and address vaccine hesitancy through clear, consistent and transparent messaging, and to provide accurate, accessible and timely information on COVID-19 vaccines, therapeutics and diagnostics, including to marginalised and vulnerable groups.</li>\n</ol>\n\n<p><em>Reduction of Incidence of Non-Communicable and Communicable Diseases </em></p>\n\n<ol start=\"82\">\n\t<li>Heads renewed their commitment to promoting good nutrition and fighting malnutrition, and determined to take bold, multisectoral coordinated action to reduce the incidence of non-communicable diseases (NCDs).</li>\n\t<li>In keeping&nbsp;with the WHO’s Guidelines on Physical Activity and Sedentary&nbsp;Behaviour and its Global Action Plan on Physical Activity, as well as the WHO Global Action Plan for the Prevention and Control of NCDs, Heads underscored the need to have intersectional and multisectoral actions that address the main risk factors, which include tobacco use, harmful use of alcohol, unhealthy diets, physical inactivity and air pollution, including through enhancing the physical and mental health and well-being of citizens, while reducing population inequality in the prevalence of these risk factors.</li>\n\t<li>Heads noted the risks posed by climate change to health and health systems through its direct and indirect addition to the global burden of disease from communicable and non-communicable diseases, including malaria, neglected tropical diseases (NTDs) and other vector-borne diseases. They also noted the need to ensure health systems are climate-resilient in order to prevent and respond effectively to climate-related illness and emergencies.</li>\n\t<li>Heads welcomed efforts towards halving malaria in Commonwealth countries by 2023, and committed to work towards ending the epidemic of malaria by 2030, in line with global, regional and national commitments. Given significant strain on health systems in the Commonwealth, Heads applauded country efforts to maintain essential malaria programming in the face of the COVID-19 pandemic. They recognised that overall, the pandemic has contributed to increased malaria mortality in the Commonwealth, and therefore set back progress to the extent that the Commonwealth is currently not on track to halve either malaria cases or deaths by the end of 2023. Heads also committed to the delivery of the WHO’s ‘Ending the neglect to attain the Sustainable Development Goals: A road map for neglected tropical diseases (2021–2030)’, including through endorsing the Kigali Declaration on Neglected Tropical Diseases launched during CHOGM on 23 June 2022.</li>\n\t<li>Heads further resolved to continue the fight against other serious public health challenges such as HIV and AIDS, polio, and tuberculosis (TB). Heads looked forward to a successful Seventh Replenishment of the Global Fund in 2022, by US$ 18 billion, which will accelerate progress towards ending AIDS, TB and malaria by 2030, and strengthen health systems to respond to current and future pandemics.&nbsp;</li>\n\t<li>Heads noted with concern, that cervical cancer<strong> </strong>is still<strong> </strong>the<strong> </strong>most common cancer affecting women in many Commonwealth countries and, recalling the Ministerial Statement of the 33<sup>rd</sup> Commonwealth Health Ministers Meeting 2021, they resolved to accelerate the elimination of cervical cancer as a public health problem, in line with the WHO’s ‘Global strategy to accelerate the elimination of cervical cancer as a public health problem’. They also resolved to continue to take steps to ensure that by 2025, girls in the Commonwealth will have access to vaccination against human papilloma virus infection by age 13 in accordance with country contexts. Heads further underscored the importance of equitable access to quality sexual and reproductive health and rights services.</li>\n\t<li>Taking note of the progress made in increasing access to quality eye care, including eliminating blinding trachoma and early detection of glaucoma, Heads<strong> </strong>encouraged a multi-pronged approach for access<strong> </strong>to screenings and affordable vision treatments, especially for children.</li>\n</ol>\n\n<h2>YOUTH</h2>\n\n<p><em>Youth Participation</em></p>\n\n<ol start=\"89\">\n\t<li>Heads took note of the fact that young people across the Commonwealth are mobilising to gain a greater voice in all public affairs, to call for systemic change and increased accountability from governments. With three out of every five citizens of the Commonwealth under age 30, young people play a pivotal role in achieving the 2030 Agenda. In this regard, Heads committed to increasing meaningful representation of youth in decision-making processes and mechanisms, including in conflict resolution and peacebuilding.</li>\n\t<li>Heads welcomed the 12<sup>th</sup> Commonwealth Youth Forum Declaration and action plan and pledged their continued commitment to mainstreaming youth priorities into national development policies and plans especially in the post-COVID-19 recovery context.</li>\n\t<li>Heads acknowledged the significant contribution made by the Commonwealth Youth Programme (CYP) in promoting youth development and youth work globally. In honouring the commitment made by Heads to establish the CYP in 1973, Heads declared 2023 a year dedicated to youth-led action for sustainable and inclusive development and called on all stakeholders at all levels to renew and strengthen their commitment to youth engagement and empowerment. Heads encouraged young people in member countries to work towards a renewed vision for the Commonwealth, founded on the principles and values of the Commonwealth Charter, and to work with all partners and stakeholders to build a fairer, more sustainable, more secure, and prosperous future. Heads further welcomed the announcement by Pakistan to host the next Commonwealth Youth Ministerial Meeting in Islamabad in January 2023.</li>\n</ol>\n\n<p><em>Youth and Employment</em></p>\n\n<ol start=\"92\">\n\t<li>Heads recognised the role and important contribution of non-formal education and its role in the development of young people’s knowledge, skills, and competencies for the labour market. To this end, they noted the launch of the Commonwealth Alliance for Quality Youth Leadership, promoting non-formal education and learning, to support the training and capacity building of young people across the Commonwealth.</li>\n\t<li>In line with SDG 8 (decent work and economic growth), Heads urged better coordinated action in partnership with youth to address the unemployment of those who have been disproportionately affected by the COVID-19 pandemic. Resultantly, they noted the Commonwealth Commitment from Employers initiative to fully engage the private sector on this priority. Furthermore, recognising the importance of an enabling environment for youth development in the Commonwealth, Heads welcomed the 2020 Global Youth Development Index and Report.</li>\n</ol>\n\n<p><em>Education</em></p>\n\n<ol start=\"94\">\n\t<li>Heads stressed the right to education and they reaffirmed the role of governments in offering 12 years of quality and inclusive education and ensuring children can catch up on lost learning.&nbsp; They also noted the need to further strengthen education systems during the current health crisis, to eliminate inequalities in the education sector, ensure foundational learning for all and promote inclusion of marginalised communities who have been impacted the most by the COVID-19 pandemic. They also acknowledged the importance of an accessible, affordable, high quality early learning and childcare system. In order to contribute to the global knowledge economy and to make higher institutions of learning relevant and sustainable, Heads affirmed their support for higher education and research.</li>\n\t<li>Heads recognised the importance of human capital for sustainable development and welcomed the outcome of the recent 21<sup>st</sup> Commonwealth Conference of Education Ministers, which focussed on resilience and sustainability; learning technologies; leadership in education; transitions within and outside the education system; addressing disparities; and financing of education.&nbsp;Heads also expressed support for the Kenyatta Call to Action on Education Finance, adopted at the Global Partnership for Education Summit in London in 2021, and committed to efficient and innovative financing of education in accordance with country contexts.</li>\n\t<li>Heads expressed concern that young people and their futures were severely affected by the COVID-19 pandemic regarding their education, social interactions, and economic opportunities, impacting their mental health and well-being. Additionally, the pandemic has had a disproportionate effect on the poorest and the most vulnerable, children, persons with disabilities, and adolescent girls, some of whom are at an increased risk of sexual and gender-based violence and other harmful practices due to school closures.</li>\n\t<li>Heads acknowledged the transformative impact of technologies on education and committed to addressing the digital divide and the digital skills gap, with particular attention to supporting disadvantaged and vulnerable groups, through appropriate access to technology and enhanced teacher capacity. Heads also noted the value of digital skills, vocational and trade skills, non-formal education, and lifelong learning, emphasising the key role which education and skills play in the drive towards the implementation of the 2030 Agenda.&nbsp;</li>\n\t<li>They welcomed the renewed commitment of the Secretariat, the Association of Commonwealth Universities, and the Commonwealth of Learning to working together to help member countries achieve the 2030 Agenda through the Commonwealth Education Partnership. Heads also recognised the achievements of the Commonwealth Scholarship and Fellowship Plan which celebrated its 60<sup>th</sup> anniversary in 2019.</li>\n</ol>\n\n<p><em>Transport Safety</em></p>\n\n<ol start=\"99\">\n\t<li>Heads expressed concern about road traffic injuries, now considered to be the leading cause of death of children and young people worldwide. They supported action in line with the UN General Assembly Resolution 74/299 on improving global road safety and committed to attaining the SDG target 3.6 to reduce road traffic deaths by at least 50 percent by 2030 compared to 2020 levels.</li>\n\t<li>Heads expressed concern about the significant loss of life at sea and inland waterways and encouraged member countries to implement appropriate sea-safety regulations for seafarers and fishers at national levels, in line with relevant International Maritime Organization regulations. In addition, Heads called for member countries to assess and address any gaps in the training and competence of seafarers as it relates to the safe crewing and operation of vessels. Heads recognised the severe impact that the COVID-19 pandemic has had on seafarers and underscored the importance of seafarers as key workers to world trade.</li>\n</ol>\n\n<p><em>Sport for Development and Peace</em></p>\n\n<ol start=\"101\">\n\t<li>Heads reaffirmed their commitment to sport and physical activity as enablers of sustainable development. Heads welcomed the Commonwealth Consensus Statement on Promoting Human Rights in and through Sport and expressed condemnation of all forms of racism and discrimination in and through sport.&nbsp; Heads further reiterated that protecting the integrity of sport and human rights in sport, including gender equality, are necessary preconditions for maximising positive impact. They recognised the need to strengthen legal, policy and institutional frameworks to prevent and respond to different manifestations of corruption and crime in sport at all levels.&nbsp;&nbsp;Heads recognised sports as an avenue for advocacy for peaceful co-existence, income generation, and social development and called for the adoption of a common approach to measure the contribution of sport to the 2030 Agenda in Commonwealth countries.</li>\n</ol>\n\n<h2>TECHNOLOGY AND INNOVATION</h2>\n\n<p><em>Cyberspace</em></p>\n\n<ol start=\"102\">\n\t<li>Heads recognised that Commonwealth governments must work proactively to ensure that technological progress promotes social and economic equalities. To advance SDG 9 (industry, innovation, and infrastructure), they urged member countries to prioritise secure, inclusive, and affordable access to Information and Communications Technology (ICT) including the provision of universal and affordable broadband. Heads also underscored the need for governments to invest in critical infrastructure for digital access.</li>\n\t<li>Heads reaffirmed their commitment to equipping citizens, especially women, girls, young people, and others facing inequality, with the skills necessary to fully benefit from innovation and opportunities in cyberspace. They committed to ensuring inclusive access for all, eliminating discrimination in cyberspace, and adopting online safety policies for all users, especially children, whilst upholding human rights.</li>\n\t<li>Heads renewed their commitment under the 2018 Commonwealth Cyber Declaration, to a free, open, inclusive, and secure cyberspace. They urged member countries to fully respect human rights online, as well as offline, and to promote practices that build trust and confidence in digital systems with measures such as: information sharing efforts amongst national Computer Emergency Response Teams; cyber capacity building; having effective data protection and privacy laws; countering online disinformation, misinformation and abuse or advocacy of hate, constituting incitement to discrimination, hostility or violence; and stepping-up enforcement, alignment and development of cybercrime laws devoid of online/offline racial and hatred incitement, by enhancing international cooperation to tackle existing and emerging cybercrime. In this regard, Heads supported UN efforts to develop a comprehensive international convention on cybercrime.</li>\n</ol>\n\n<p><em>Sustainable urbanisation: smart and resilient sustainable cities and communities</em></p>\n\n<ol start=\"105\">\n\t<li>Heads noted that the Commonwealth is home to one third of the world's population and nearly 50 percent of the projected increase of the world's urban population by mid-century. They reiterated their commitment under SDG 11 (sustainable cities and communities) to make cities and human settlements inclusive, safe, and resilient. To this end, Heads adopted the Declaration on Sustainable Urbanisation<strong>.</strong></li>\n\t<li>Heads underscored the intrinsic value of sustainable urbanisation to harness structural transformation for the world's urban populations, particularly those in Commonwealth countries. Heads noted that while the COVID-19 pandemic reversed some gains made in urban development and exposed systemic inequalities creating new vulnerabilities, it also created new opportunities to address social inclusion, and brought to the fore the centrality and importance of the right to an adequate standard of living, including housing. As such, Heads committed to prioritising the provision of affordable and social housing to mitigate the proliferation of informal settlements, promote social inclusion and cushion the urban poor from social-cultural and economic shocks.</li>\n</ol>\n\n<p><em>Building a Commonwealth Innovation Ecosystem </em></p>\n\n<ol start=\"107\">\n\t<li>Heads noted the launch and development of the Commonwealth Innovation Hub as a knowledge sharing digital platform. Heads underscored the urgency and necessity of scaling up innovation, data science, and digital transformation initiatives. They urged member countries to bridge the digital divide within and among countries through transformational partnerships, and to adopt an open, citizen-centric, and evidence-based approach to developing a Commonwealth innovation ecosystem that is inclusive and equitable and delivers sustainable development for all.</li>\n</ol>\n\n<h2>Commonwealth Renewal</h2>\n\n<ol start=\"108\">\n\t<li>Heads endorsed the recommendations of the 26 September 2019 Commonwealth Foreign Affairs Ministers Meeting. They further endorsed the corresponding revisions of the 2005 Revised Agreed Memorandum as agreed by the Board of Governors on 4 December 2019, both of which now enter into effect. Heads committed to continue consideration of Commonwealth reforms and renewal.</li>\n</ol>\n\n<h2>Membership</h2>\n\n<ol start=\"109\">\n\t<li>Heads warmly welcomed the Maldives back into the Commonwealth.</li>\n</ol>\n\n<h2>Country Situations</h2>\n\n<ol start=\"110\">\n\t<li>Heads expressed their full and enduring support for the sovereignty, independence, territorial integrity and unity of the Republic of Cyprus. They reiterated their support for the resumption of negotiations, under the auspices of the United Nations Secretary General’s Good Offices Mission, for a comprehensive settlement of the Cyprus problem based on the United Nations Charter and United Nations Security Council Resolutions on Cyprus in accordance with the wishes of the Cypriot people and based on a bicommunal, bizonal federation with political equality as set out in relevant Security Council Resolutions. Heads called for the implementation of relevant United Nations Security Council resolutions (UNSCRs), especially UNSCRs 365(1974), 541(1983), 550(1984), and 1251(1999). Recalling also United Nations Security Council resolutions and its Presidential Statements on Varosha condemning the announcement by Turkish and Turkish Cypriot leaders on the further reopening of a part of the fenced-off area, Heads expressed their deep regret regarding unilateral actions that run contrary to those resolutions and statements and reiterated the calls made for their immediate reversal and for full respect and implementation of relevant UNSC resolutions. Heads reiterated their support for full respect of the human rights of all Cypriots including their right to property, and for the accounting for all missing persons. Heads underlined the importance of confidence building measures and urged the sides to work together for their timely implementation, as well as to reinvigorate the efforts to provide the necessary support to the work of the technical committees. Heads extended their solidarity in the exercise of the sovereign rights of the Republic of Cyprus in its Exclusive Economic Zone under international law, including the United Nations Convention on the Law of the Sea, and called for the avoidance of actions and statements that undermine these rights and threaten stability in the Eastern Mediterranean. Heads also noted the many important benefits, including economic benefits for all Cypriots that would flow from a comprehensive and durable solution, which would constitute a strong incentive for all parties.</li>\n\t<li>Heads reaffirmed their full solidarity with the Government and the people of Bangladesh, deeply affected by the influx of over 1 million forcibly displaced Rohingya from Rakhine State in Myanmar. Heads expressed grave concern at the gross human rights violations and atrocities perpetrated by the security and armed forces of Myanmar on the Rohingya, and other ethnic and religious minorities. Noting the UN General Assembly resolution 76/180 that authorised investigation of alleged crimes related to the situation in Myanmar, Heads welcomed the role of the International Court of Justice (ICJ), as applicable, in adjudicating violations of international law. Heads commended the humanitarian commitment and efforts of the Bangladesh Government, in cooperation with UN agencies and the international community, in providing sustained assistance and temporary shelter to the persecuted Rohingya. Heads acknowledged the extensive investments made by Bangladesh&nbsp;in its&nbsp;<em>Bhasan Char</em>&nbsp;project, including the facilities and infrastructure. &nbsp;Heads underscored the importance of early implementation of the general agreement and arrangements reached between the Governments of Bangladesh and Myanmar. Heads also called for action to address the root causes of the current crisis, including through the immediate implementation of the Rakhine Advisory (Kofi Annan) Commission recommendations. Welcoming the work and reports of the Special Rapporteur on the situation of human rights in Myanmar, the Special Envoy of the UN Secretary-General on Myanmar, and the ASEAN Chair’s Special Envoy on Myanmar, urging the Myanmar military<strong> </strong>authorities to grant them full access to Myanmar, Heads called for the creation of the necessary conducive conditions for the voluntary, safe, secure and sustainable return of all such displaced Rohingya sheltered in Bangladesh to their rightful homes in Myanmar.</li>\n\t<li>Heads noted the decision made by the ICJ on 18 December 2020, that it has jurisdiction to entertain the Application filed by Guyana on 29 March 2018, paving the way for the ICJ to consider the merits of the case concerning the Arbitral Award of 3 October 1899 (Guyana v. Venezuela). They also noted that Guyana had submitted its Memorial on 8 March 2022, in accordance with the schedule set by the ICJ to hear the case, concerning the validity of the Arbitral Award of 1899 and the related question of the definitive settlement of the land boundary between the two countries. Heads reiterated their full support for the ongoing judicial process that is intended to bring a peaceful and definitive end to the long-standing controversy between the two countries. Heads reaffirmed their firm and unwavering support for the maintenance and preservation of the sovereignty and territorial integrity of Guyana.</li>\n\t<li>Heads expressed their support for the ongoing process at the ICJ with respect to Guatemala’s territorial, insular and maritime claims against the territory of Belize. They condemned the continuing illegal encroachments and settlements in Belize’s territory and urged Guatemala to abide by and implement the Confidence Building Measures, which are valid and in force. They also reiterated their call for both countries and the Organization of American States (OAS) to finally fulfil their commitment to design a mechanism of co-operation for the Sarstoon River. They commended the OAS for work in maintaining peace and security along the border and supporting efforts towards a final and peaceful settlement of the dispute. Heads strongly reaffirmed the Commonwealth’s firm and longstanding support for the sovereignty and territorial integrity of Belize.&nbsp;</li>\n</ol>\n\n<h2>Commonwealth Collaboration</h2>\n\n<ol start=\"114\">\n\t<li>Heads expressed appreciation for the work and reports of the Secretariat, the Commonwealth of Learning (COL), the Commonwealth Foundation, Accredited Organisations, Commonwealth ministerial meetings, and the report of the CHOGM Forums. Heads also appreciated the good collaboration between the Commonwealth and the UN, as well as other partners and regional bodies.</li>\n\t<li>Heads commended the COL for providing expertise and resources in distance and online learning to ministries and institutions as they dealt with closures caused by the COVID-19 pandemic. It provided capacity building for teachers and recommended technology solutions to reach the unreached. COL is encouraged to scale up its activities to help member countries accelerate progress towards achieving SDG 4 (quality education) by promoting equitable and quality education and lifelong learning opportunities for all, especially women and girls. Heads appreciated COL’s workforce recovery support to thousands of youths across the Commonwealth, leading to skilling and reskilling for livelihoods.</li>\n\t<li>Acknowledging that the Commonwealth is as much an association of peoples as of governments, Heads commended the Commonwealth Foundation for its commitment to nurturing the growth of vibrant and free societies throughout the Commonwealth, and the work it has been doing to champion the active and constructive participation of people in all aspects of governance. Heads especially welcomed the Foundation’s new thematic approach, which is ‘prioritising health, climate, and freedom of expression’, with a special focus on small and vulnerable states. Heads agreed to continue, where appropriate, their support for and active engagement in the important work of the Foundation.&nbsp;</li>\n</ol>\n\n<h2>CHOGM</h2>\n\n<ol start=\"117\">\n\t<li>Heads expressed their profound gratitude to the Government and people of the Republic of Rwanda for the warm hospitality extended to them and congratulated President Paul Kagame for his leadership in chairing the meeting. They also expressed their warm appreciation to His Royal Highness The Prince of Wales for his attendance at their meeting, representing Her Majesty Queen Elizabeth II, Head of the Commonwealth, in the year of Her Platinum Jubilee. Heads welcomed and accepted the offer of Samoa to host the next CHOGM.</li>\n</ol>\n\n<p>The Republic of Rwanda</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/06/25/prime-minister-drives-action-food-security-climate-change-and-gender\">Prime Minister drives action on food security, climate change and gender equality at Commonwealth Heads of Government Meeting</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}