{
  "path": "/en/news/news-releases/2018/12/22/prime-minister-visits-members-canadian-armed-forces-mali",
  "pageTitle": "Prime Minister visits members of the Canadian Armed Forces in Mali | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today returned from a Christmas visit to the Canadian Armed Forces (CAF) base in Mali. The Prime Minister’s visit was an opportunity to meet with our Canadians in uniform deployed on this United Nations peace operation (Operation PRESENCE) and to thank them for their commitment, dedication, and sacrifice during the holiday season.</p><p>The Minister of Defence, Harjit Sajjan, and the Chief of the Defence Staff, General Jonathan Vance, accompanied the Prime Minister as he met with CAF members working in Mali as part of a 12-month mission to support the United Nations Multidimensional Integrated Stabilization Mission in Mali (MINUSMA).</p><p>While at the Canadian camp, the Prime Minister saw firsthand Canada’s contribution to the mission — the CH-147F Chinook and CH-146 Griffon helicopter operations — that provide medical evacuation to safeguard UN forces, as well as much-needed transportation and logistical support.</p><p>The Prime Minister noted that our Canadian Armed Forces have earned tremendous respect for their contributions to promoting international peace and security – a tradition carried forward today in Mali.</p><p>Prime Minister Trudeau also met with the Prime Minister of Mali, Soumeylou Boubèye Maïga, and highlighted Canada’s longstanding bilateral relationship. The two leaders also discussed Mali’s efforts to reinforce security, human rights, and governance.</p><p>Along with the current peace operation, Canada has other contributions to assist with the UN mission in Mali, including military staff officers, civilian police officers, and financial support.</p><h3>Quote</h3><blockquote><p>“It was an honour to meet with Canadian Armed Forces members deployed on this vital UN peace operation. I saw firsthand the contributions they are making in Mali. All Canadians can be proud of how they are representing our country and working with our partners to maintain security and stability in the region. We thank them and all deployed CAF members for their service and sacrifice as they serve Canada far from their families during the holiday season.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h3>Quick Facts</h3><ul><li>This is the first bilateral visit to Mali by a Canadian Prime Minister.</li><li>The Air Task Force includes three Chinook helicopters (two operational and one spare), that provide medical evacuation and transport capabilities, as well as five Griffon helicopters (four operational and one spare) for armed escort and defensive tasks.</li><li>The Air Task Force provides transport and logistics capabilities and includes a Forward Aeromedical Evacuation capability, which supports medical evacuations for United Nations forces on the ground.</li><li>The CAF is part of an integrated, whole of government approach to deliver on Canada's commitment to increase its support for United Nations peace support operations and to help the United Nations respond to the challenges it faces in its missions around the world.</li></ul><h3>Associated Links</h3><ul><li><a href=\"https://peacekeeping.un.org/en/mission/minusma\">United Nations Multidimensional Integrated Stabilization Mission in Mali (MINUSMA)</a></li><li><a href=\"https://www.international.gc.ca/prmny-mponu/index.aspx?lang=eng\">Canada at the UN</a></li><li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/op-presence.html\">Operation PRESENCE - Mali</a></li></ul></div>\n      "
}