{
  "path": "/en/news/news-releases/2023/03/02/working-partnership-deliver-high-quality-health-care-indigenous",
  "pageTitle": "Working in partnership to deliver high-quality health care for Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Indigenous Peoples face unique challenges when it comes to receiving the health care they deserve including, for example, a lack of family doctors and nurse practitioners in rural and remote communities. The Government of Canada is working with First Nations, Inuit, and Métis partners across the country to address gaps and systemic inequities in health care services, as well as to deliver high-quality and culturally appropriate health care.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted the recently announced federal investment of an additional $2&nbsp;billion over 10 years to help ensure access to quality and culturally safe health care services, in line with the priorities of Indigenous partners.</p>\n\n<p>This new Indigenous Health Equity Fund will be distributed to ensure support to First Nations, Inuit, and Métis communities. Over the coming months, the Government of Canada will work with First Nations, Inuit, and Métis partners across the country, as well as provinces and territories, on the design and implementation of the Fund, ensuring alignment with Indigenous-led regional and community health priorities.</p>\n\n<p>The new Fund is part of the government’s plan to increase health investments by $198.6&nbsp;billion over 10 years to improve health care across the country. This additional funding will help clear backlogs and support the front-line workers who power our health care system; give all Canadians access to a primary health team as well as quality mental health and substance use services to support their well-being; and ensure patients can access their own health information and benefit from it being shared between health professionals, across jurisdictions.</p>\n\n<p>As the Government of Canada continues to work with provinces and territories to reach tailored bilateral health care funding agreements, we are committed to supporting meaningful engagement between provinces and territories and Indigenous organizations to address gaps, support Indigenous health priorities, and work toward eliminating health inequities for all.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The promise of our universal health care system in Canada is that no matter where you live or what you earn, you will always be able to get the medical care you need, when you need it. Right now, our health care system is not living up to that promise. That’s why we’re making major investments to improve our system – and that includes an additional major investment to deliver better health care for Indigenous Peoples, in line with their priorities. We will work in partnership with Indigenous communities to deliver results where they’re needed most.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I have heard many devastating personal stories from First Nations, Inuit, and Métis leaders and community members about racism and discrimination in Canada’s health systems. Accessing health care free of racism is a basic human right. The Indigenous Health Equity Fund will support Indigenous health leaders to design health services and work with health partners on Indigenous priorities.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Indigenous Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“Everyone deserves access to culturally safe and quality health care. The Indigenous Health Equity Fund is an important step to ensuring that Indigenous Peoples can access the culturally safe health care services that they need and deserve, without racism or discrimination. We remain committed to working together with Indigenous Peoples, provincial and territorial governments, and all partners to combat racism and discrimination in all of its forms, including in health care.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new Indigenous Health Equity Fund will be developed and implemented on a distinctions basis, in alignment with the United Nations Declaration on the Rights of Indigenous Peoples&nbsp;(UNDRIP), the Missing and Murdered Indigenous Women and Girls (MMIWG) Calls for Justice, and the Truth and Reconciliation Commission’s Calls to Action, and following the leadership of First Nations, Inuit, and Métis partners.</li>\n\t<li>The Government of Canada also remains committed to co-developing distinctions-based Indigenous health legislation to foster health systems that will respect and ensure the safety and well-being of Indigenous Peoples.</li>\n\t<li>The Canada Health Transfer (CHT) is the largest major federal transfer to provinces and territories. In 2023-24, the federal government will provide a total of $49.4&nbsp;billion to provinces and territories under the CHT, an increase of 9.3&nbsp;per&nbsp;cent, or $4.2&nbsp;billion, from 2022-23.</li>\n\t<li>In addition to the new Indigenous Health Equity Fund, the federal government invests approximately $5&nbsp;billion in Indigenous health each year. This includes important new investments announced since 2021 to support further progress, including:\n\t<ul class=\"bulletOutline\">\n\t\t<li>$354&nbsp;million over five years to increase the number of nurses and other medical professionals in remote and isolated First Nations communities;</li>\n\t\t<li>$250&nbsp;million over five years to further support recruitment and retention of health professionals on reserve;</li>\n\t\t<li>$825&nbsp;million over three years for distinctions-based mental health and wellness strategies;</li>\n\t\t<li>$127&nbsp;million over three years to foster health systems free from racism and discrimination; and</li>\n\t\t<li>$107&nbsp;million over three years to continue efforts to transform how health services are designed and delivered by First Nations communities.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1626810177053/1626810219482\">Indigenous health care in Canada</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/canada-health-transfer.html\">Canada Health Transfer</a></li>\n</ul></div>\n      "
}