{
  "path": "/en/news/statements/2018/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement on World AIDS Day:</p><p>“Today, on the 30th anniversary of <a href=\"http://www.unaids.org/en/resources/presscentre/featurestories/2018/september/20180917_WAD_theme\">World AIDS Day</a>, we stand in solidarity with people living with HIV and AIDS in Canada and around the world. We mourn those we have lost to this devastating epidemic, and unite to end HIV and AIDS for good. We also honour the advocates who have worked to fight stigma and improve treatment, care, and support for people living with HIV.</p><p>“This year’s theme, ‘Know Your Status,’ encourages people everywhere to get tested for HIV. Early testing is crucial to preventing the spread of infection and reducing the number of people exposed to the virus. By breaking down stigma and improving access to testing, we can make sure everyone, especially the most vulnerable people, can get life-saving treatment.</p><p>“Canada is committed to do our part to support people living with HIV and AIDS and bring an end to this epidemic. In 2016, we hosted world leaders in Montréal for the <a href=\"/en/news/news-releases/2016/09/17/prime-minister-hosts-successful-global-fund-replenishment-conference\">Fifth Replenishment Conference of the Global Fund to Fight AIDS, Tuberculosis, and Malaria</a>, where we raised over $12.9 billion in pledges, including $804 million from Canada over three years.</p><p>“Earlier this year, we launched the <a href=\"https://www.canada.ca/en/public-health/services/infectious-diseases/sexual-health-sexually-transmitted-infections/reports-publications/sexually-transmitted-blood-borne-infections-action-framework.html\">Pan-Canadian Framework for Action</a> to reduce the health impact of sexually transmitted and blood-borne infections in Canada by 2030. This framework supports the global fight to end AIDS, viral hepatitis, and sexually transmitted infections as major health concerns. Here at home, we are also supporting community-based efforts to prevent HIV and other related infections among vulnerable groups, and <a href=\"http://www.cihr-irsc.gc.ca/e/50933.html\">investing in research</a> to help find a safe and effective cure for HIV and develop prevention strategies and tools.</p><p>“As this week also marks the 20th anniversary of Aboriginal AIDS Awareness Week, we remain determined to work with Indigenous communities and leadership to develop effective, culturally safe support networks and approaches to meet the unique needs of Indigenous people living with and affected by HIV and AIDS.</p><p>“Together, we can make a difference and bring this global epidemic to an end. Today, I invite all Canadians to raise awareness and help end the stigma associated with HIV and AIDS. Everyone deserves to have access to the treatment, care, and support they need to live their lives to the fullest.”</p></div>\n      "
}