{
  "path": "/en/news/readouts/2022/04/04/prime-minister-justin-trudeau-speaks-prime-minister-australia-scott",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Australia Scott Morrison | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Australia, Scott Morrison.</p>\n\n<p>The Prime Ministers discussed Russia’s unjustifiable attack against the territorial integrity, sovereignty, and independence of Ukraine. They praised the courage and resilience of the Ukrainian people in the face of increasingly brutal aggression. They strongly condemned the murder of civilians in Ukraine, and pledged to hold Russia accountable for these egregious and appalling actions.</p>\n\n<p>The leaders noted with concern that over 10 million people – almost a quarter of Ukraine’s population – have been displaced either within Ukraine or abroad, as refugees, and that up to 13 million people are in urgent need of humanitarian assistance across the country. Prime Minister Trudeau invited Prime Minister Morrison to participate in the “Stand Up For Ukraine” campaign pledging event on April 9, which he is co-convening with the President of the European Commission, Ursula von der Leyen, to raise funds for Ukrainian refugees and internally displaced people.</p>\n\n<p>The Prime Ministers also discussed the impact of Russia’s invasion of Ukraine on global security. They agreed on the importance of like-minded democracies working closely together to deter authoritarian regimes from challenging the rules-based international system that has underwritten global security and prosperity for decades.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Morrison underlined the importance of the Five Eyes cooperation in addressing security challenges. They agreed to continue deepening the Canada-Australia partnership to advance common objectives in the Indo-Pacific region, including in providing support to Pacific island partners for climate resilience.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/australia-australie/relations.aspx?lang=eng\">Canada-Australia relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement to Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/26/stand-ukraine-european-commission-and-government-canada-team-global\">Stand Up For Ukraine: European Commission and Government of Canada team up with Global Citizen to mobilize support for refugees</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.publicsafety.gc.ca/cnt/ntnl-scrt/fv-cntry-mnstrl-en.aspx\">The Five Eyes</a></li>\n</ul></div>\n      "
}