{
  "path": "/en/news/statements/2018/10/18/statement-prime-minister-persons-day",
  "pageTitle": "Statement by the Prime Minister on Persons Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for Persons Day:</p><p>“On <a href=\"https://swc-cfc.gc.ca/commemoration/pd-jp/index-en.html\">Persons Day</a>, we mark the anniversary of the historic ruling that recognized Canadian women as ‘persons’ under the law and granted them the right to serve as senators.</p><p>“Today, we pay tribute to Emily&nbsp;Murphy, Nellie&nbsp;McClung, Irene&nbsp;Parlby, Louise&nbsp;McKinney, and Henrietta&nbsp;Muir&nbsp;Edwards – the Famous Five – whose fight for equality set Canada on a course toward real democracy. These trailblazers joined forces to challenge the status quo and fight for the recognition of women’s rights. Their victory on October&nbsp;18, 1929, was a major step forward for equality and opened the door for women to participate in our democracy and our parliamentary institutions.</p><p>“We have made great progress since the Famous Five won their landmark case, but work still remains to ensure that all people, no matter their gender identity, can participate freely and fully in our society.</p><p>“The Government of Canada is taking a leadership role to advance gender equality, both at home and abroad. We formed Canada’s first gender-balanced federal cabinet, launched the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, made gender equality and the empowerment of women and girls a top priority during our <a href=\"https://g7.gc.ca/en/g7-presidency/themes/advancing-gender-equality-women-empowerment/\">G7 Presidency</a>, and strengthened our use of gender-based analysis plus in our policy and decision-making. We know that gender equality benefits everyone, and we are taking concrete action to promote women’s rights as human rights.</p><p>“As we celebrate <a href=\"https://www.swc-cfc.gc.ca/commemoration/whm-mhf/theme-en.html\">Women’s History Month</a>, I invite Canadians to learn more about the Famous Five and the many activists who came before and after them. By speaking up and demanding their rights be respected, they helped shape a more equal Canada for all of us. Every day, we have the chance to carry their legacy forward, and build a democracy where everyone’s voice is heard.”</p></div>\n      "
}