{
  "path": "/en/news/statements/2021/06/08/statement-prime-minister-world-oceans-day",
  "pageTitle": "Statement by the Prime Minister on World Oceans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Oceans Day:</p>\n\n<p>“With the longest coastline in the world, Canada is blessed with an incredible diversity of marine ecosystems. From providing the oxygen we breathe to putting food on our tables to sustaining our economy, Canada’s Pacific, Arctic, and Atlantic Oceans are a vital resource, an integral part of our identity, and a source of countless enjoyments for all Canadians.</p>\n\n<p>“Today, we join people all over the world in celebrating World Oceans Day. Proposed by the Government of Canada in 1992 and adopted by the United Nations in 2008, this special day invites us to reflect on the role we all play in preserving our marine environment. It is a day to come together and recommit ourselves to protecting the world’s oceans for our children and grandchildren.</p>\n\n<p>“This year’s theme, ‘<a href=\"https://unworldoceansday.org/\">The Ocean: Life &amp; Livelihoods</a>’, reminds us how important the oceans are to life on the planet and to many people’s livelihoods. In Canada, they are the source of nearly 300,000 jobs, and we rely on healthy marine ecosystems to sustain our food supply and the vibrancy of our coastal communities. Economies around the world depend on the health and resilience of our oceans. We know that we have to protect them to ensure a better future for all of us.</p>\n\n<p>“In our oceans, climate change, unsustainable fishing practices, and pollution are having wide-ranging impacts and threatening marine biodiversity and our way of being. In 2016, we launched the <a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan\">Oceans Protection Plan</a>, the largest-ever investment to safeguard Canada’s coasts and waterways, while supporting trade and growing our economy. In partnership with Indigenous and coastal communities, the marine industry, and academia, we have worked to improve waterway management practices, remove abandoned vessels, and increase surveillance in the Arctic to combat marine pollution. In less than five years, we have progressed from protecting less than one per cent to almost 14 per cent of Canada’s marine and coastal areas. These are significant advances in safeguarding Canada’s waters, but we still have a long way to go. In Budget 2021, we have proposed over $1&nbsp;billion to help us meet our marine conservation target of 25 per cent by 2025, further reduce the amount of plastic waste entering our oceans, and address the challenges of biodiversity loss and climate change. We are also working on a new, government-wide <a href=\"https://www.dfo-mpo.gc.ca/campaign-campagne/bes-seb/index-eng.html\">Blue Economy Strategy</a> that will guide our future efforts to foster healthy and safe oceans while securing a prosperous blue economy for all Canadians, in particular those in our coastal communities.</p>\n\n<p>“We are all connected to the oceans, no matter where we live. That is why marine conservation requires a global effort. Last year, as a member of the High Level Panel for a Sustainable Ocean Economy, Canada joined thirteen other countries in endorsing the <a href=\"https://oceanpanel.org/news/14-world-leaders-commit-100-percent-sustainable-ocean-management-solve-global-challenges\">Transformations for a Sustainable Ocean Economy: a Vision for Protection, Production and Prosperity</a>. Paired with ambitious commitments to sustainably manage our marine resources, this new oceans action agenda charts a collective course towards a global blue economy. Earlier this year, we also joined the international community in celebrating the United Nations’ <a href=\"https://www.oceandecade.org/\">Decade of Ocean Science for Sustainable Development 2021-2030</a> and became a member of the <a href=\"https://www.oceandecade.org/resource/155/OCEAN-DECADE-ALLIANCE\">Ocean Decade Alliance</a>. Through scientific research and innovative technology, this initiative is transforming how we work with our partners to better understand and predict the changes affecting our dynamic ocean systems, and support resilient coasts and coastal communities. These are meaningful steps toward the sustainable management and development of our planet’s waters, for the benefit of all people.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to mark World Oceans Day by participating in virtual events and thinking about what we can do to better safeguard our marine ecosystems for generations to come. We are all stewards of the oceans, so together let’s celebrate their beauty by keeping them safe, clean, and healthy.”</p></div>\n      "
}