{
  "path": "/en/news/statements/2021/01/08/statement-prime-minister-national-day-remembrance-victims-air-disasters",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Air Disasters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Air Disasters:</p>\n\n<p>“Air disasters have taken the lives of too many Canadians, and left too many families across our country without loved ones. Today, on the first National Day of Remembrance for Victims of Air Disasters, I join Canadians across the country to remember and honour the people who were lost in these tragedies, and mourn alongside those they left behind.</p>\n\n<p>“As a country, we have experienced a number of national tragedies related to aviation travel. One year ago, Ukraine International Airlines Flight 752 was shot down by the Iranian regime near Tehran, killing all 176 people on board, including 55 Canadian citizens, 30 permanent residents, and many others with ties to Canada. Nearly two years ago, Ethiopian Airlines Flight 302 crashed on its way to Nairobi, Kenya, claiming the lives of 18 Canadians and many others with ties to Canada. In 1985, we lost 280 Canadians when a bomb exploded on Air India Flight 182 from Toronto to London, England. And in 1989, 24 people died in the crashing of Air Ontario Flight 1363 from Dryden to Winnipeg.</p>\n\n<p>“Every aviation tragedy and each loss of life is one too many. This is why we continue to ensure better and safer air travel for all Canadians, both at home and abroad. Following the downing of the Ukraine International Airlines Flight 752 last year, we appointed Ralph Goodale as my Special Advisor for the tragedy, and recently welcomed his report to help establish best practices to respond to future air disasters. We also developed the Safer Skies Initiative, working with our international partners to help keep civilian aircraft away from dangerous conflict zones. We are also ensuring that the current flight restrictions for the Boeing 737 MAX aircraft in Canadian airspace remain in effect until we are fully satisfied that all safety concerns have been addressed, and that enhanced flight crew procedures and training are in place.</p>\n\n<p>“Behind every one of these tragic events, and each loss of life, there is a mourning spouse, parent, sibling, child, or friend. Together, we offer our deepest sympathies to those who have lost loved ones as a result of all air disasters, and we will continue to support them in their greatest moments of need and sadness. Today and every day, we will always remember these tragedies and those who were lost.”</p></div>\n      "
}