{
  "path": "/en/news/statements/2019/12/05/statement-prime-minister-speech-throne",
  "pageTitle": "Statement by the Prime Minister on the Speech from the Throne | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on <a href=\"https://www.canada.ca/en/privy-council/campaigns/speech-throne/speech-from-the-throne.html\">the Speech from the Throne</a>:</p>\n\n<p>“This fall, Canadians sent a clear message: they want their Parliamentarians to work together on the issues that matter most to them. We have a mandate from Canadians to fight climate change, strengthen the middle class, walk the road of reconciliation, keep people safe and healthy, and position our country for success in an uncertain world. Canadians have chosen to keep moving forward, and this is our plan to do just that.</p>\n\n<p>“Our children and grandchildren will judge us by how we confront the defining challenge of our time – climate change. We must act now to protect the environment, while growing the economy and making life more affordable. This Government will continue to lead with a price on pollution, and set an ambitious target to achieve net-zero emissions by 2050. We will also support cleaner, more efficient communities and homes, and protect more of our land and oceans. At the same time, we will work to get Canadian resources to new markets, and provide unwavering support to the hardworking Canadians in our natural resources sectors.</p>\n\n<p>“All Canadians should benefit from our country’s economic success. This Government’s first act will be to cut taxes for all but the wealthiest, giving more money to middle class families and those who need it most. We will also make it easier for people to get an education, buy their first home, and find care for their kids. In the last mandate, we reduced poverty across the country, and we will continue crucial investments in areas like affordable housing. For workers, we will help people enter the workforce, grow their skills, and transition between jobs. This is part of our responsible plan to build a strong and growing modern economy.</p>\n\n<p>“In 2015, we promised a new relationship with Indigenous peoples – one that would help deliver a better quality of life for their families and communities. While we have made important progress, there is still much to do. We will continue to move forward in partnership to deliver on the distinct priorities of Indigenous peoples. This will include, among other things, action in the next year to implement the United Nations Declaration on the Rights of Indigenous Peoples.</p>\n\n<p>“All Canadians want to live in a country where, when people are sick, they can get the help they need. We will work with the provinces and territories to ensure that people can access quality health care, including drug coverage.</p>\n\n<p>“A better quality of life also means feeling safe. We will take action to prevent the devastating effects of gun violence by banning military-style assault rifles, and allowing municipalities to ban handguns. In addition, we will take further steps to address gender-based violence in Canada.</p>\n\n<p>“Importantly, we will also continue to recognize our solemn duty to those who serve in the Canadian Armed Forces, and invest to improve mental health care supports and housing for veterans.</p>\n\n<p>“Finally, in an uncertain world, we will stand up for the values and interests that are core to our prosperity and security – democracy, human rights, and respect for international law. We will continue to build partnerships that make our country, and world, more safe, just, prosperous, and sustainable. We will also renew our commitment to peacekeeping, and continue to help the world’s most vulnerable people reach their full potential.</p>\n\n<p>“Canadians are counting on us, and this plan is a path forward for everyone. We have common ground and shared purpose. Together, we can and we will overcome the challenges of today to build a brighter tomorrow.”</p></div>\n      "
}