{
  "path": "/en/news/news-releases/2021/06/15/prime-minister-announces-new-members-national-security-and",
  "pageTitle": "Prime Minister announces new members of the National Security and Intelligence Committee of Parliamentarians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada continues to do everything it can to keep communities safe. Canadians can count on our country’s national security and intelligence agencies to respond to threats while ensuring that their work protects the rights and freedoms of all citizens.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced five new members of the National Security and Intelligence Committee of Parliamentarians. With these new appointments, all seats on the Committee are now full.</p>\n\n<p>Chaired by the Honourable David J. McGuinty since its launch in 2017, this multi-party Committee includes representatives from both the House of Commons and the Senate. It provides a non-partisan approach to the review of national security and intelligence activities carried out across the Government of Canada. This includes activities undertaken by the Canada Border Services Agency, the Communications Security Establishment, Canadian Security Intelligence Service, and the Royal Canadian Mounted Police, among many others.</p>\n\n<p>The Committee provides the Prime Minister with an annual report, and special reports when needed. The reports, which include findings and recommendations, are tabled in both the House of Commons and the Senate.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Security and intelligence must be synonymous with transparency and accountability. Together, parliamentarians on the Committee will continue to play an essential role in ensuring that our national security and intelligence community is held accountable for its practices, and that it has the tools needed to keep Canadians safe.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new appointees of the National Security and Intelligence Committee of Parliamentarians are:\n\t<ul>\n\t\t<li>Leona Alleslev, Conservative</li>\n\t\t<li>Stéphane Bergeron, Bloc Québécois</li>\n\t\t<li>Peter Fragiskatos, Liberal</li>\n\t\t<li>Iqra Khalid, Liberal</li>\n\t\t<li>Rob Morrison, Conservative</li>\n\t</ul>\n\t</li>\n\t<li>The new appointees will join the existing members of the Committee:\n\t<ul>\n\t\t<li>Don Davies, NDP</li>\n\t\t<li>Dennis Dawson, Senate</li>\n\t\t<li>The Honourable Frances Lankin, P.C., C.M., Senate</li>\n\t\t<li>The Honourable David J. McGuinty, P.C., Liberal (Chair)</li>\n\t\t<li>Brenda Shanahan, Liberal</li>\n\t\t<li>Vernon White, Senate</li>\n\t</ul>\n\t</li>\n\t<li>The Committee was first created under the <em>National Security and Intelligence Committee of Parliamentarians Act</em>, which received Royal Assent on June 22, 2017. It is dissolved at the end of each session of Parliament, and new members are appointed after the new session of Parliament opens.</li>\n\t<li>The Secretariat of the National Security and Intelligence Committee of Parliamentarians assists the Committee in fulfilling its review mandate.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"http://www.nsicop-cpsnr.ca/index-en.html\">National Security and Intelligence Committee of Parliamentarians</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}