{
  "path": "/en/news/news-releases/2020/09/18/canadas-covid-19-exposure-notification-app-now-available-saskatchewan",
  "pageTitle": "Canada’s COVID-19 exposure notification app now available in Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Over the past months, Canadians have been following public health advice and doing their part to help prevent the spread of COVID-19. As we safely restart our economy and build a more resilient Canada, we need to continue to work together to contain the virus, help prevent potential future waves, and keep Canadians safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Saskatchewan, Scott Moe, today announced that people in Saskatchewan can now receive one-time keys from their health authorities to use with COVID Alert, Canada’s COVID-19 exposure notification app. The app helps notify users if they may have been exposed to someone who has tested positive for COVID-19.</p>\n\n<p>The COVID Alert app is free and voluntary, and is another tool to help limit the spread of COVID-19. Users who test positive for COVID-19 will receive a one-time key from their health authority that they can enter into the app. When the key is entered, COVID Alert will notify other users who may have come in close contact with that person for at least 15 minutes, and direct them on next steps based on their provincial public health advice.</p>\n\n<p>To safeguard the confidentiality and privacy of all Canadians, the app uses strong measures to protect any data it collects, and does not track a user's location or collect personally identifiable information. The Privacy Commissioner of Canada was consulted on the development of COVID Alert, and supports its use by Canadians.</p>\n\n<p>COVID Alert is available for download to all Canadians, and one-time keys provided by health authorities are now available to the people of Saskatchewan, New Brunswick, Ontario, and Newfoundland and Labrador. The Government of Canada continues to work with the other provinces and territories to bring their health authorities on board in the coming weeks and months.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The COVID Alert app is a tool that Saskatchewanians can use to help protect themselves, their loved ones, and their communities from COVID-19. As more people use it, we can slow the spread of the virus and help prevent future waves. We will continue to work with other provinces and territories to bring their health authorities on board so as many Canadians as possible can benefit from the app.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Congratulations to the people of Saskatchewan who now have access to the full functionality of COVID Alert. This secure digital tool is an important part of our public health efforts to limit the spread of COVID-19, and I encourage all Canadians to download it today.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Digital Government</footer>\n</blockquote>\n\n<blockquote>\n<p>“Already downloaded by more than 2.5 million Canadians, this app is an additional tool we can use to protect ourselves and our loved ones. I encourage you to download it and input the one-time key to notify others should you get COVID-19.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“People in Saskatchewan expect us to work together and do everything we can to continue keeping them healthy and safe. This is exactly what we’ve done and keep doing, and today, we are making the COVID-19 Alert app available in Saskatchewan. This app will help keep each other safe and I encourage everyone to download it today.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since launching, there have been more than 2.5 million downloads of the app.</li>\n\t<li>COVID Alert is available for Canadians as a free download from the App Store or the Google Play Store. When a user downloads the app, their phone sends out randomly generated codes via Bluetooth to other smartphone users who have the app and are within approximately two metres. If they test positive for the virus, users can choose to upload their random codes to a central server located in Canada. Once uploaded, the random codes are stored on the server for 15 days, after which they are automatically deleted.</li>\n\t<li>Since the app first launched, more than 260 people have voluntarily input their one-time key to notify others around them after testing positive for COVID-19.</li>\n\t<li>Canadians who want to know more about COVID Alert can call 1-833-784-4397.</li>\n\t<li>The Government of Canada established the COVID-19 Exposure Notification App Advisory Council to ensure the app meets the highest standards in public health outcomes, privacy, and technology. The members of the Council reflect Canada’s regional and cultural diversity, and cover a wide range of expertise, including health, privacy, data governance, science, and innovation. Their advice informs the implementation and rollout of the app.</li>\n\t<li>BlackBerry and the Canadian Centre for Cyber Security completed a security assessment of the app before it was launched. All data provided to the app is securely stored and protected.</li>\n\t<li>COVID Alert is a collaboration between Health Canada, Innovation, Science and Economic Development Canada, the Canadian Digital Service, and the Ontario Digital Service. It builds upon an exposure notification solution developed by Shopify volunteers in coordination with the non-profit<em> </em><a href=\"https://www.lfph.io/\">Linux Foundation Public Health</a>. It is also the work of a team of developers from across the country.</li>\n\t<li>As part of our commitment to open and transparent government, the Canadian Digital Service is making its work on the app’s development and testing available on <a href=\"https://github.com/cds-snc/covid-shield-mobile\">Github</a>.</li>\n\t<li>The <a href=\"https://ca.thrive.health/\">Canada COVID App</a> is another digital tool that supports Canadians. It allows users to track their symptoms while receiving the latest updates and accessing trusted resources.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert.html\">Download COVID Alert</a></li>\n\t<li><a href=\"https://ic.gc.ca/eic/site/icgc.nsf/eng/h_07687.html\">COVID-19 Exposure Notification App Advisory Council</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/18/prime-minister-announces-new-mobile-app-help-notify-canadians-covid\">Prime Minister announces new mobile app to help notify Canadians of COVID-19 exposure</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/digital-tools-staying-healthy.html\">COVID-19: Digital tools and apps for staying healthy</a></li>\n</ul></div>\n      "
}