{
  "path": "/en/news/statements/2018/06/21/statement-prime-minister-national-indigenous-peoples-day",
  "pageTitle": "Statement by the Prime Minister on National Indigenous Peoples Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous Peoples Day:</p><p>“Today, on <a href=\"https://www.aadnc-aandc.gc.ca/eng/1100100013248/1100100013249\">National Indigenous Peoples Day</a>, we celebrate the unique heritage and diverse cultures of First Nations, Inuit, and Métis peoples, and the tremendous contributions they make to this country.</p><p>“As we celebrate Indigenous cultures and communities, we also acknowledge the oppression and discrimination Indigenous peoples have experienced for centuries. Canada cannot move forward if Indigenous peoples continue to be held back. Our government is working in partnership with First Nations, Inuit, and Métis peoples to advance meaningful reconciliation and build a future where Indigenous peoples succeed and prosper.</p><p>“That is why, earlier this year, our government announced that we will develop, in full partnership with First Nations, Inuit, and Métis peoples, a Recognition and Implementation of Rights Framework. For too long, Indigenous peoples have had to prove their rights exist and fight to have them fully recognized and implemented. This framework will ensure that the recognition and implementation of rights is the basis for all relations between Indigenous peoples and the federal government going forward.</p><p>“This year, our government made significant new investments to improve the quality of life, increase access to services, and enhance the well-being of Indigenous communities. Budget 2018 includes new additional funding to accelerate the elimination of all long-term drinking water advisories on public systems on reserve by March 2021, support the Métis Nation’s housing strategy and the elimination of tuberculosis in Inuit communities, and advance the safety and well-being of Indigenous children and families.</p><p>“This spring, I delivered a <a href=\"/en/news/news-releases/2018/03/26/prime-minister-delivers-statement-exoneration-six-tsilhqot’-chiefs\">statement of exoneration</a> on behalf of the Government of Canada to the Tsilhqot’in Nation and the descendants of six Tsilhqot’in Chiefs. Last year, we also offered a long overdue <a href=\"/en/news/speeches/2017/11/24/remarks-prime-minister-justin-trudeau-apologize-behalf-government-canada\">apology</a> to students of the five residential schools in Newfoundland and Labrador for the painful and tragic legacy of these schools that will be felt for generations to come.</p><p>“We are making real progress together with First Nations, Inuit, and Métis partners to advance reconciliation. Working together in a spirit of respect, recognition of rights, collaboration, and partnership, we will continue to advance Indigenous self-determination – including the inherent right of self-government – and move towards a Canada where Indigenous peoples thrive and have full control over their lives and their future. Together, we can shape a more just, more equal, and more inclusive Canada – for Indigenous peoples and for all of us.”</p></div>\n      "
}