{
  "path": "/en/news/news-releases/2018/07/06/new-investments-improve-calgarys-transportation-infrastructure",
  "pageTitle": "New investments to improve Calgary’s transportation infrastructure | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Good infrastructure connects our communities, helps create good jobs, and gets us to work on time and back home again – so Canadians have more time to do what they love. That is why the Government of Canada is committed to making significant investments in infrastructure – investments that improve commute times, strengthen our communities, and create good, well-paying middle class jobs today while delivering economic growth for years to come.</p><p>The Prime Minister, Justin Trudeau, today announced a major investment of $50 million to improve Calgary’s Airport Trail, a trade corridor that provides access to and from the Calgary International Airport and connects communities and businesses in northeast Calgary.</p><p>The investment will reduce travel times for Alberta families, and mean better and faster access to markets in North America and around the world for local businesses. It will also create good quality, middle class jobs during construction.</p><p>The project will include:</p><ul><li>a new segment of Airport Trail between 36 Street NE and 60 Street NE, with an intersection at Métis Trail</li><li>construction of the first stage of interchanges along Airport Trail at 19 Street NE and Barlow Trail</li><li>construction of a new southbound-to-westbound ramp at the interchange of Stoney Trail and Airport Trail</li></ul><p>The project will create an additional route to the airport, making it easier for people and goods to travel to and from their destinations. The project will also extend Calgary's fibre optic network, and lay the foundation for a future rapid transit connection within the corridor.</p><h2>Quotes</h2><blockquote><p>“Countless Canadian businesses depend on their ability to move goods quickly and efficiently, within our borders and beyond. Today’s investment is about making sure Albertans have the infrastructure they need to grow their businesses, stay competitive, and make the world their marketplace. We will continue to improve transportation along Canada’s major trade corridors, and create good, well-paying middle class jobs for Canadians across the country.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Transportation and distribution of goods are vital for our local, regional, and national economies. The investment announced here today makes our transportation system stronger by addressing urgent capacity constraints along the Airport Trail and supports long-term prosperity for our community.”&nbsp;<br><cite>—The Hon. Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><blockquote><p>“Our government is investing in Canada’s economy by making improvements to our trade and transportation corridors. We are supporting projects that will efficiently move commercial goods to market and people to their destinations, stimulate economic growth, create quality middle-class jobs, and ensure that Canada’s transportation networks remain competitive and efficient.”&nbsp;<br><cite>—The Hon. Marc Garneau, Minister of Transport</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This funding is provided through the <a href=\"http://www.tc.gc.ca/en/programs-policies/programs/national-trade-corridors-fund.html\">National Trade Corridors Fund</a>, which supports projects that:<ul><li>help the transportation system withstand the effects of climate change and adapt to new technologies and innovation</li><li>address transportation bottlenecks and congestion along Canada’s trade corridors</li><li>support economic activity and the physical movement of goods and people in Canada</li><li>improve the movement of Canadian goods to markets around the world through our ports, airports, roads, railways, intermodal facilities, bridges, and border crossings</li></ul></li><li>As announced in November 2016 and detailed in Budget 2017, the Government of Canada is investing $10.1 billion over the next 11 years in trade and transportation projects.</li><li>Transportation is an important element of Canada’s trade with other countries. In 2017, total international merchandise trade amounted to $1.1 trillion. The United States continued to be Canada’s top trade partner, with $703 billion in trade ($415 billion exported, $288 billion imported), accounting for 63.5 per cent of total Canadian trade in 2017.</li><li>Provincial, territorial, and municipal governments, Indigenous groups, not-for-profit and for-profit private-sector organizations, federal Crown Corporations, Canadian Port Authorities, and National Airport System Airport Authorities are all eligible for funding under the National Trade Corridors Fund.</li><li>In May 2018, the Government of Canada announced a major investment of up to $1.53&nbsp;billion for Calgary’s Green Line Light Rail Transit project. This project will provide hundreds of thousands of transit riders in the city’s north and south-east communities with a direct route to the downtown core.</li><li>The same month, the Government also announced more than $39 million for improvements to a railway crossing in Edmonton that will reduce congestion and travel times in the city.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/tt-ct-eng.html\">Investing in Canada Plan</a></li><li><a href=\"https://www.canada.ca/en/transport-canada/news/2018/05/national-trade-corridors-fund.html\">National Trade Corridors Fund</a></li><li><a href=\"https://www.tc.gc.ca/eng/trade-transportation-corridors-initiative.html\">Trade and Transportation Corridor Initiative</a></li><li><a href=\"https://www.tc.gc.ca/eng/future-transportation-canada.html\">Transportation 2030</a></li></ul></div>\n      "
}