{
  "path": "/en/news/news-releases/2017/03/28/prime-minister-trudeau-address-women-world-summit-new-york-city",
  "pageTitle": "Prime Minister Trudeau to address Women in the World Summit in New York City | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in the Women in the World Summit in New York City on April 6. The Prime Minister will take part in this event to continue to champion women’s rights, and to emphasize the important role we all have to play to advance gender equality.</p><p>He will join CEOs, artists, and other activists to discuss how women’s economic empowerment accelerates economic growth and the progress still needed to achieve gender equality.</p><p>While in New York City, the Prime Minister will also meet with United Nations (UN) Secretary-General António Guterres to reaffirm Canada’s strong commitment to the UN and its mission around the world.</p><h2>Quotes</h2><blockquote><p>“We have achieved real progress in advancing women’s equality, especially in the past decades, but there is still a lot of work to be done. We need the full and equal participation of women around the world. Our government is determined to continue being a leader on gender equality, preventing gender-based violence, and empowering women in the workplace, so we can all realize our full potential, and create a stronger, more prosperous economy.”<br>—<cite> Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“At the United Nations, we will continue working with the international community to stand up for human rights, protect the most vulnerable, and champion core Canadian values like diversity and inclusion, gender equality, and respect for peace worldwide.”<br>—<cite> Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Budget 2017’s Gender Statement is a first for Canada. It aims to provide a frank and honest analysis of how all measures in the budget affect women.</li><li>The Women in the World Summit will have meaningful and transparent discussions around gender and other identities, which will help the Government of Canada better understand the challenges faced and will help it make informed decisions to advance the goals of gender equality, fairness, and stronger workforce participation.</li><li>Canada was a founding member of the UN in 1945, and since then, has worked closely with the UN and its agencies to advance key international objectives, including those related to human rights, democracy and governance, development, humanitarian assistance, and international peace and security.</li><li>Last year, Canada was elected to hold a seat on the UN Commission on the Status of Women for the 2017-21 term. This leadership role will provide Canada with a valuable opportunity to shape the Commission’s future work on issues that affect women and girls globally.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-05-en.html\">Budget 2017’s Gender Statement</a></li><li><a href=\"http://www.unwomen.org/en/csw\">UN Commission on the Status of Women</a></li><li><a href=\"https://nytlive.nytimes.com/womenintheworld/events/women-in-the-world-new-york-2017/\">Women in the World Summit</a></li></ul></div>\n      "
}