{
  "path": "/en/news/news-releases/2019/03/20/new-program-help-100000-canadian-families-buy-their-first-home",
  "pageTitle": "New program to help 100,000 Canadian families buy their first home | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Many young Canadians dream of owning their first home. With rising house prices, and not enough homes to meet demand, it is getting harder and harder to make that dream a reality. That is why the Government of Canada is taking important steps to make housing more accessible and affordable in Canada, especially for first-time homebuyers.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Orléans, Ontario, to highlight the First-Time Home Buyer Incentive, a new program announced in Budget 2019 that will make it easier for more Canadians to buy their first home.</p>\n\n<p>Under the new program, eligible first-time home buyers could share a part of the cost of buying a home with the Canada Mortgage and Housing Corporation (CMHC). For eligible buyers, the program would reduce the size of their insured mortgage and lower monthly mortgage payments.</p>\n\n<p>Lower monthly payments mean more money for Canadians to put toward the things that matter to them – furthering their education, putting their kids in sports, or saving for retirement. It is part of the Government of Canada’s plan to help all Canadians build a better future for themselves and their families.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Over these past few years we heard from Canadians who talked about their concerns about being able to own their own home. We believe in investing in people and communities, which is why we are taking real, concrete steps to make sure homeownership remains an achievable dream, not a privilege afforded to only the richest few.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The First-Time Home Buyer Incentive, administered by the CMHC, would help eligible Canadians with a household income under $120,000 per year afford to buy their first home.</li>\n\t<li>Through the new Incentive, the CMHC would provide 5 per cent of the value of a home for a first-time homebuyer through a shared investment.</li>\n\t<li>To encourage the construction of new housing supply, the Incentive would increase to 10 per cent for a newly-built home.</li>\n\t<li>Additional information about the First-Time Home Buyer Incentive will be released by CMHC later this year.</li>\n\t<li>Budget 2019 also proposes to increase the Home Buyers’ Plan withdrawal limit from $25,000 to $35,000, providing first-time home buyers with greater access to their Registered Retirement Savings Plan savings to buy a home.</li>\n\t<li>In 2017, the Government of Canada announced a 10-year, $40 billion National Housing Strategy that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. The Strategy sets clear goals to remove 530,000 Canadians from housing need and reduce chronic homelessness.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2019/docs/themes/housing-logement-en.html#improving-affordability-today-support-for-first-time-home-buyers\" tabindex=\"108\">Improving Affordability Today: Support for First-Time Home Buyers</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\" tabindex=\"109\">Canada’s National Housing Strategy</a></li>\n</ul></div>\n      "
}