{
  "path": "/en/news/statements/2019/04/07/statement-prime-minister-25th-commemoration-genocide-against-tutsi",
  "pageTitle": "Statement by the Prime Minister on the 25th commemoration of the Genocide against the Tutsi in Rwanda | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 25th commemoration of the Genocide against the Tutsi in Rwanda:</p>\n\n<p>“Today, we remember one of the darkest chapters in recent history – the 1994 genocide against the Tutsi in Rwanda, which began twenty-five years ago to the day. In the months that followed, more than 800,000 innocent people –Tutsis, moderate Hutus, and others – were senselessly and brutally murdered in an organized campaign of genocide.</p>\n\n<p>“On this solemn day, we join the Rwandan people and the international community to remember and pay tribute to all those who lost their lives in the genocide. We offer our deepest sympathies to their families and loved ones, and to everyone living with the pain and trauma caused by these atrocities.</p>\n\n<p>“Today, we also honour the bravery of all those who risked their lives to save others in this dark time. We recognize the members of the United Nations peace support mission in Rwanda, including Canadian peacekeepers and General Roméo&nbsp;Dallaire, who, in spite of their small number and limited mandate, did everything in their power to protect those seeking refuge.</p>\n\n<p>“Canada is working with its partners to defend human rights around the world and make sure atrocities like this never happen again. With the <a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative</a> and the <a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles</a> – now endorsed by 81 countries – Canada has taken a lead role to support peacekeeping and protect those most vulnerable in conflict situations. We also commend the progress Rwanda has made to advance reconciliation and development – and we will continue to promote pluralism, inclusion, and human rights everywhere as the basis for peace and justice.</p>\n\n<p>“This genocide – like all others – showed the world the unconscionable cost of division and hatred. I ask all Canadians to take time today to remember those who lost their lives twenty-five years ago. We can honour them by fighting hate, protecting the most vulnerable, and working to make our world a better one.”</p></div>\n      "
}