{
  "path": "/en/news/news-releases/2018/04/24/prime-minister-portugal-visit-canada",
  "pageTitle": "Prime Minister of Portugal to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Prime&nbsp;Minister of Portugal, António Costa, will visit Canada from May&nbsp;2&nbsp;to&nbsp;5,&nbsp;2018.</p><p>During the visit, Prime Minister Trudeau and Prime Minister Costa will discuss the benefits of progressive trade and how the Canada-European Union Comprehensive Economic and Trade Agreement (CETA)&nbsp;will create good, middle class jobs and new opportunities for people on both sides of the Atlantic.</p><p>The two leaders will explore how our countries can work together to promote gender equality, protect our world’s oceans, address climate change, advance security and peace, and build economies that work for everyone.</p><h2>Quote</h2><blockquote><p>“Canada and Portugal enjoy a strong and historic bond, with nearly a half-million people of Portuguese origin calling Canada home. I&nbsp;look forward to meeting with Prime&nbsp;Minister Costa to deepen our relationship and create economic opportunities that will benefit Canadians and Portuguese people alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the first formal meeting between Prime Minister Trudeau and Prime Minister Costa.</li><li>Canada is home to a vibrant Portuguese-Canadian community with over 480,000&nbsp;Canadians of Portuguese origin.</li><li>Canada and Portugal enjoy a strong relationship, founded on common values, deep and significant people-to-people bonds, and mutually beneficial commercial relations. Two-way merchandise trade between Canada and Portugal totalled nearly $848&nbsp;million in 2017, with Canadian exports valued at $270&nbsp;million.</li><li>On September 21, 2017, the provisional application of CETA took effect. CETA provides new opportunities for Canadian and Portuguese businesses, and will enhance trade and investment in both our countries.</li><li>Portugal was the eighth European country to ratify CETA.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/portugal/bilateral_relations_bilaterales/canada_portugal.aspx?lang=eng\">Canada and Portugal</a></li></ul></div>\n      "
}