{
  "path": "/en/news/statements/2017/06/05/statement-prime-minister-world-environment-day",
  "pageTitle": "Statement by the Prime Minister on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p><p>“Today, we join the global community to celebrate World Environment Day – an opportunity to connect with nature and to recommit ourselves to build a cleaner, more sustainable world for generations to come. This year, Canada will host the official global celebrations for the first time. We are proud to celebrate our shared environment, and to work with our partners around the world to leave a cleaner, healthier planet for all our children.</p><p>“The theme for this year’s World Environment Day, ‘<i>Connecting People to Nature</i>,’ encourages us to get outdoors, appreciate the healthy ecosystems that contribute to our well-being, and do our part to protect the planet we share.</p><p>“World Environment Day reminds us that we have a global responsibility to safeguard our environment – and that each of us has a role to play to preserve and protect it. More than ever, Canada is committed to provide international leadership to fight climate change and support clean economic growth. We will continue to work with our domestic and international partners to drive progress on the environmental challenges we face as a global community.</p><p>“Canada has taken strong steps to protect the environment and promote clean economic growth. We adopted the Pan-Canadian Framework on Clean Growth and Climate Change, launched the Oceans Protection Plan, and continue to support developing countries in mitigating and adapting to climate change. Despite this progress, we have much more work to do. Our Government is committed to work with people around the world and at home, including young people and Indigenous Peoples, to find concrete, effective solutions to environmental issues.</p><p>“Today, I ask all Canadians and everyone around the world to remember we share one planet. Climate change does not recognize borders, and few challenges have ever been so global in scale. Our children's future depends on our immediate and collective response.”</p><p><b>Associated Links</b></p><ul><li><a href=\"https://www.tc.gc.ca/eng/oceans-protection-plan.html\">Oceans Protection Plan</a></li><li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/paris-agreement.html\">Paris Agreement</a></li></ul></div>\n      "
}