{
  "path": "/en/news/readouts/2022/11/14/prime-minister-justin-trudeau-meets-president-and-ceo-mitsubishi-heavy",
  "pageTitle": "Prime Minister Justin Trudeau meets with President and CEO of Mitsubishi Heavy Industries Limited Seiji Izumisawa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President and CEO of Mitsubishi Heavy Industries Limited (MHI), Seiji Izumisawa. They met on the margins of the B20 Summit, the gathering of senior business leaders that is held in conjunction with the G20 Summit.</p>\n\n<p>Prime Minister Trudeau welcomed MHI’s strong presence in Canada and its interest in making further investments in Canada’s economy, particularly in infrastructure and sustainable energy. They discussed MHI’s ongoing work in innovative sectors such as aerospace, sustainable aviation fuel, and carbon capture and storage.</p>\n\n<p>Prime Minister Trudeau highlighted the important role of the private sector in advancing the transition to a low carbon economy. He noted that investments to green the economy will help combat climate change while creating new middle class jobs across all sectors and building a better future for everyone.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.g20.org/events/b20-summit/\">B20 Summit – G20 Presidency of Indonesia</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/our-natural-resources/energy-sources-distribution/carbon-capture-utilization-and-storage/4275\">Carbon capture, utilization, and storage</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/actions-healthy-environment-economy.html\">Canada’s Climate Actions for a Healthy Environment and a Healthy Economy</a></li>\n</ul></div>\n      "
}