{
  "path": "/en/news/readouts/2020/03/25/prime-minister-justin-trudeau-speaks-president-rwanda-paul-kagame",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Rwanda Paul Kagame | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Rwanda, Paul Kagame, to discuss COVID-19.</p>\n\n<p>Prime Minister Trudeau passed on his best wishes to President Kagame and all Rwandans as they confront the challenge of COVID‑19, and work to minimize&nbsp;its health, social, and economic impacts.</p>\n\n<p>The Prime Minister thanked President Kagame for his kind wishes for Sophie Grégoire Trudeau’s recovery.</p>\n\n<p>The two leaders shared best practices on the strong steps being taken by Canada and Rwanda to protect their citizens, and to address economic challenges in their respective countries.</p>\n\n<p>They spoke about the need for the international community to work together to change the trajectory of the disease. They also agreed on the importance of reinforcing health, financial, and economic systems in Africa.&nbsp;</p>\n\n<p>The Prime Minister offered Canada’s support through advice and international assistance to help vulnerable countries respond to COVID-19’s devastating impacts.&nbsp;</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.<strong>&nbsp;</strong></p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/21/prime-minister-announces-efforts-bring-canadians-home-abroad\">Prime Minister announces efforts to bring Canadians home from abroad</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}