{
  "path": "/en/news/itineraries/2018/11/21/itinerary-thursday-november-22-2018",
  "pageTitle": "Itinerary for Thursday, November 22, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>Calgary, Alberta</h2><p><b>11:45 a.m.</b> The Prime Minister and Minister of Natural Resources Amarjeet Sohi will tour the Lumino Condominium, and will make an announcement. A media availability will follow.</p><p>Lumino Condominium, Building B<br>5656 Third Street South West</p><p><b> Notes for media: </b></p><ul><ul><li>Pooled coverage for tour</li><li>Open coverage for announcement and media availability</li><li>Media should present themselves to the South East Entrance of Lumino Condominium, Building B, directly across from Thornhill Childcare, no later than 11:00 a.m.&nbsp;&nbsp;&nbsp;</li><li>Parking for media is available in the south parking lot.</li></ul></ul><p><b>1:15 p.m.</b> The Prime Minister will deliver a keynote address to the Calgary Chamber of Commerce, followed by a Q&amp;A. Minister of Natural Resources Amarjeet Sohi will introduce the Prime Minister.</p><p>Imperial Ballroom, Hyatt Regency Calgary<br>700 Centre Street South East</p><p><b> Notes for media:</b></p><ul><ul><li>Open coverage</li><li>Media should present themselves to the Stephen Room, outside of the Imperial Ballroom entrance, no later than 12:45 p.m.</li></ul></ul><p><b>2:15 p.m.</b> The Prime Minister and Minister of Natural Resources Amarjeet Sohi will meet with energy industry leaders.</p><p>Herald Room, Hyatt Regency Calgary<br>700 Centre Street South East</p><p><b> Notes for media:</b></p><ul><ul><li>Photo opportunity at the beginning of the meeting</li><li>Media should present themselves to the Stephen Room, outside of the Imperial Ballroom entrance, no later than 1:45 p.m.</li></ul></ul><p><b>3:15 p.m.</b> The Prime Minister will meet with Mayor of Calgary Naheed Nenshi.</p><p>Herald Room, Hyatt Regency Calgary<br>700 Centre Street South East</p><p><b> Notes for media:</b></p><ul><ul><li>Photo opportunity at the beginning of the meeting</li><li>Media should present themselves to the Stephen Room, outside of the Imperial Ballroom entrance, no later than 1:45 p.m.</li></ul></ul><p><b>7:00 p.m. </b>The Prime Minister, Minister of Science and Sport Kirsty Duncan, and Minister of Natural Resources Amarjeet Sohi will attend the Canadian Tire Wickenheiser World Female Hockey Festival. The Prime Minister will deliver remarks.</p><p>Markin MacPhail Centre<br>151 Canada Olympic Road South West</p><p><b> Notes for media:</b></p><ul><ul><li>Open coverage</li><li>Media should present themselves to the main entrance no later than 6:30 p.m.</li></ul></ul></div>\n      "
}