{
  "path": "/en/news/statements/2021/09/30/kihci-okimaw-o-wihtamakewin-ohci-tapwewin-mina-wahkowicihiwewin-kisikaw",
  "pageTitle": "Kihci Okimaw Ô-Wîhtamâkêwin ohci Tâpwêwin mîna Wâhkôwîcihiwêwin Kîsikâw Misiwêskamik Kânatahk | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kihci Okimaw, Justin Trudeau, anohc pakitinam êkwânima ôma wîhtamâkêwin ochi Tâpwêwin mîna Wâhkôwîcihiwêwin Kîsikâw Misiwêskamik Kânatahk:</p>\n\n<p>“Anohc, niwîhkomaw kahkiyaw awiyak akâmi askiy ta-nisitawinahk mîna ta-kanawâpahta ôma nistam <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">Tâpwêwin mîna Wâhkôwîcihiwêwin Kîsikâw Misiwêskamik Kânatahk</a>. Êwako kîsikâw ta-mâmitonêyihtamahk kwâtakihtawin mîna âhkamî âyimihowin ohci ayamihâwi-kiskinwahamâtowikamikohk pîhci Kânata, êkwa ta-kistêyihtîmihcik paspîwiyiniwak, ô-wîtotîmâkana, êkwa ô-mâmawâyâwinihk. Êwako kîsikâw mîna ta-kiskisîyahk itahto awâsisak êka ka-pê-kîwicik, mîna nahipayiwin kiki kahkiyaw kiyânaw ta-kiskêyihtamahk ayiwâk, mîna ta-pasikôstamahk kwêtamâwin kiki wâhkôwîcihiwêwin mîna ta-âhkamêyihtamahk isi ôma atoskêwin ati nîkân.</p>\n\n<p>“Tâpwêwin mîna Wâhkôwîcihiwêwin Kîsikâw Misiwêskamik Kânatahk nisitawinam êkwânima nânitaw mitâtahtomitanaw niyânanomitanaw, kihci mitâtahtomitanaw Nêhiyaw awâsisak akâmi askiy kî-sipwîhtahâwak ô-wîtotîmâkana ohci êkwa ô-mâmawâyâwinihk. Awâsisak kî-pêsiwâwak ayamihâwi-kiskinwahamâtowikamikohk êkota mihcêt kî-kitimahâwak mîna kî-wanihtâwak otisîhcikîwiniwâwa, opîkiskwîwiniwâwa, mîna isîhcikêwiniwâwa. Ôma okimânâhk kîsikâw ayiwâk osîhcikatêw îyiyihêwêwin ohci Osâwî-Mihkwâw Papakiwayân Kîsikâw, êwako ka-kî- sôhkîhtâtoskâcikâtêw âcimowinis ohci Phyllis Webstad mîna nawasonikâtêw ohci Nêhiyawak ta-kiskisihk âsônamâtowin ohci ayamihâwi-kiskinwahamâtowikamikohk mîna ta-nîkânîstahk pimohcêskanas isi wâhkôwîcihiwêwin. Tâpwêwin mîna Wâhkôwîcihiwêwin Kîsikâw Misiwêskamik Kânatahk kî-osîhtcikâtêw sâpô kihci-wiyasiwêwin ka-sâpohtêmakahk âstamispêh ôma ka-sîkwahk, mîna êwako kêhciwâk naskwêhamâkêwin isi ôma Tâpwêwin mîna Wâhkôwîcihiwêwin Pimohtêstamakêwin Têpwacikâtêwin kiki Kwayaskwâtisiwin akihtâson ayinânêwomitanaw. Pîhci kiskisiwin kiki ôma ka-kî-itahkamikahk kîsikâw, niki miyikosiwin ta-nîsohkamâkêyan pîhci pahkisimowin isistawin ta-kiskisihk paspîwiyiniwak mîna êkwâniki êka ka-kî-takosinicik isi ô-wîtotîmâkana, êkwa ô-mâmawâyâwinihk, tâpiskôc ôma Peace Tower êkwa kotaka kamikwa cîki Kihci-Okimâwikamik kî-osâwî-mihkwâw wâsaskotêwa, mîna oskayi nawasônikêwin Paspîwiyiniwak Akotâson ohci Kihci Onîkânîwinihk kiki Tâpwêwin mîna Wâhkôwîcihiwêwin kî-ohpipicikâtêw.</p>\n\n<p>“Ôma askiy, ka-kwataki miskahkik êka itasinahikâtêkihk kihkwahâskan papâmi-ita kayakhtê ayamihâwi-kiskinwahamâtowikamikohk akâmi askiy kî-kiskisominanak namôya piko âyimihiwêwin ohci awahkanihkêwin mîna macitêhêwin kayas ka-kî-itahkamikahk, mâka mîna atoskêwin êwako mitoni nîkânêyihtâkwan ta-yahkohtêmaka wâhkôwîcihiwêwin pîhci Kânata. Anohc, ninisitawinênân mîna kakwâtakihtâwina, wanitôtamakêwin, êkwa aniskaciwin kakwâtakêyimowin êkwânima Nêhiyawak ka-kî- otiskawiskahk – mîna âhkami otiskawiskam – ayis ohci ayamihâwi-kiskinwahamâtowikamikohk pamihcikêwin, âyâtastêw pakwâtitowin, mîna âtawêymowin êwako ka-âhkamêyihtakwahk pîhci ôma askiy. Piko mîna ta-kiskêyihtamahk kayâsêskamik mîna âsônamâtowin ohci ayamihâwi-kiskinwahamâtowikamikohk. Êwako piko ta-otiskawiskamahk ôhi macitêhêwin tâpwêwina, mîna ta-mînohtâyahk ôhiwanitôtamakêwina, ka-kî-yahkohtênaw mâh-mâmawi itêhkê ayiwâk takahki, kwayaskwatisiwin, mîna nawaci-kwayask nîkânihk.</p>\n\n<p>“Aspin 2015, Kihci-Okimânâhk ohci Kânata kî-wiciwâkani-atoskêw asici Nêhiyawak ta- kipahahkik tawawina kêyâpic anohc ka-ihtakohkihk osâmpoko mistahi – mîna mâmawi niki yahkohtênân. Pâsci ayinânêwomitanaw per cent ohci Tâpwêwin mîna Wâhkôwîcihiwêwin Pimohtêstamakêwin Têpwacikâtêwin kiki Kwayaskwâtisiwin êkwânihi sâpô pêyakôwin ahpô mâmawi nâkatêyihtamowina Kihci-Okimânâhk ohci kî-pônihcikâtêwa ahpô mâcihtâniwan. Niki kîsihtânân mitâtahtomitanaw têpakohposâp inwês-iskoyikohk nipiy minihkwêwin kakêskimiwêwina, asici mitoni ka-kêhcinâhohk oyêyihcikêwin ta-pipihtinikâtêkihk kaykiyaw ati-nîkân. Niki kaskihonân ôma <em>Tahtoskânêsiwak Wîhtamakêwin isi yahkohtêwin ohci Nêhiyawak ô-Miyikowisiniwaw</em>, manâcihtawin Nêhiyawêwin, mîna ê-pamihinamahk isi kiskinwahamâkêwin êkois isi so kihci mitâtahtomitanaw Nêhiyaw awâsisak ayâwak oskayi ahpô katawa kiskinwahamâkêwikamikwa. Niki mîna otinênân ahkohtêwina mâmawi ta- pîkiskwacikâtêk âsônê âyimihiwêwina ka-nisitawêyihtâkwahk pîhci ôma Misiwêskamik Nâkatohkâtêwin isi Wanihiwêwin êkwa Nipahtâkêwin Nêhiyaw iskwêwak êkwa Iskwêsisak Kîsihcikâtêw Wîhtamâkêwin êkwa Têpwacikâtêwin kiki Kwayaskwâtisiwin, mîna niki nîsôhkamâtonân Nêhiyaw awâsis mîna wîtotîmâkanak pimipayihtâwin kihci-wiyasiwêwin ta-kêhcinahow Nêhiyaw awâsisak ayâwak asici ô-wîtotîmâkana, êkwa ô-mâmawâyâwinihk. Mîna ta-âhkami pamihinamahk kêhciwâk pîhci Nêhiyaw mâmawâyâwinihk, ka-itasinahikâtêk pîhci Mêstinikêwin 2021, ta-osihcikâtêk nawaci-kwayask nîkânihk kiki kahkiyaw awiyak.</p>\n\n<p>“Opîkiskwêstamâkêwin kiki Kihci-Okimânâhk ohci Kânata, Nisîhkimâwak kahkiyaw Canadians ta-otinahkik ôma ta-kiskêyihtahkik ayiwâk ohci âsônamâtowin ohci ayamihâwi-kiskinwahamâtowikamikohk pîhci Kânata, natohta âcimowinisa ohci paspîwiyiniwak êkwa ô-wîtotîmâkana mîna mâmitonêyihta tanisi isi itahto kîyânaw ta-kî-wîcihiwêwêyahk ôma itohtêwin isi wâhkôwîcihiwêwin. Nisîhkimâwak mîna kahkiyaw awiyak ta-postiska osâwî-mihkwâw papakiwayân anohc ta-wîcihiwêhk ka-misiwêhtêmakahk nistawêyêcikêwin, ayis itahto awâsis asitakimâw.”</p></div>\n      "
}