{
  "path": "/en/news/news-releases/2018/04/14/prime-minister-concludes-his-participation-viii-summit-americas",
  "pageTitle": "Prime Minister concludes his participation at the VIII Summit of the Americas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the VIII Summit of the Americas in Lima, Peru. There, he met with other world leaders to discuss the importance of democratic governance and promote deeper economic cooperation that builds a stronger middle class and creates more opportunities for people in the Americas.</p><p>While at the Summit, the Prime Minister reaffirmed our country’s commitment to progressive trade that creates good, middle class jobs, and discussed the benefits of investing in Canada and Canadian talent.</p><p>During his address at the III CEO Summit, Prime Minister Trudeau promoted Canada as a partner of choice for investment, and highlighted the many actions our country has taken – including the Global Skills Strategy and Canada Infrastructure Bank – to spur innovation, attract highly-skilled global talent, and make our communities even better places to live, work, and do business.</p><p>The Prime Minister also met with leaders of the Pacific Alliance – a trade integration initiative between Chile, Colombia, Mexico, and Peru – to discuss the ongoing negotiations of a potential Canada-Pacific Alliance Free Trade Agreement, which would create jobs, strengthen the middle class, and benefit millions of people.</p><p>Under the Summit’s theme of democratic governance against corruption, Canada endorsed the <i>Lima Commitment on</i> <i>Democratic Governance Against Corruption. </i>This declaration is a testament to our countries' shared commitment to increased transparency and accountability. Leaders also discussed regional issues, including reiterating their commitment to address the ongoing crisis in Venezuela. Along with other Lima Group leaders, plus those of the United States and the Bahamas, Canada committed to continue to work diligently towards the restoration of Venezuelan democracy.</p><p>During his meeting with Caribbean leaders, the Prime Minister further strengthened Canada’s support for the region by announcing that Canada would provide more than $30&nbsp;million – $25 million of which is in addition to its previous pledge of $100&nbsp;million – toward Caribbean reconstruction and climate resilience efforts for 2017-2022.</p><p>At the Summit, Prime Minister Trudeau also announced that Canada would begin the process to join the Inter-American Convention on the Prevention, Punishment, and Eradication of Violence Against Women (also known as the Convention of Belém do Pará).</p><h2>Quote</h2><blockquote><p>“I would like to thank Peru and President Vizcarra for hosting a productive Summit of the Americas. Canada will continue to strengthen our relationships with partners across the Americas, and work toward trade that benefits everyone, builds a stronger middle class, and delivers real, tangible benefits to our communities.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Prime Minister held bilateral meetings with the presidents of Peru, Mexico, Chile, and Argentina and with the Vice President of the United States.</li><li>The CEO Summit brings together heads of state and leading business executives from the hemisphere. Approximately 70 Canadian executives from various sectors were among the more than 700 delegates in attendance.</li><li>The Pacific Alliance was created in 2011 by Chile, Colombia, Mexico, and Peru. In 2017, they invited Canada, along with Australia, New Zealand, and Singapore, to become Associated States, a process which involves the negotiation of a comprehensive free trade agreement with the Alliance. With a combined GDP of $2.4 trillion and an increasingly skilled workforce, the Pacific Alliance represents an aggregation of more than 221 million consumers and constitutes an important market for Canada.</li><li>Canada will host the fourth round of negotiations on a potential free trade agreement between Canada and the Pacific Alliance next month.</li><li>In 2017, Canada’s total merchandise trade with the Pacific Alliance countries reached over $50.5&nbsp;billion, representing more than three-quarters of Canada’s two-way merchandise trade with the Latin America and Caribbean region.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2018/04/14/declaration-venezuela\">Leaders Declaration on Venezuela</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2018/04/14/canada-further-strengthens-its-support-caribbean-region\">Canada further strengthens its support for the Caribbean Region</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/04/04/prime-minister-travel-peru-france-and-united-kingdom\">Prime Minister to Travel to Peru, France, and the U.K.</a></li><li><a href=\"http://www.international.gc.ca/oas-oea/index.aspx?lang=eng\">Permanent Mission of Canada to the Organization of American States</a></li><li><a href=\"http://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada–Caribbean Community Relations</a></li><li><a href=\"http://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/venezuela.aspx?lang=eng\">Canada and the Venezuela Crisis</a></li><li><a href=\"http://www.canadainternational.gc.ca/peru-perou/bilateral_relations_bilaterales/canada_peru-perou.aspx?lang=eng\">Canada–Peru Relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/mexico-mexique/cmp-pcm.aspx?lang=eng\">The Canada–Mexico Partnership</a></li><li><a href=\"http://www.canadainternational.gc.ca/chile-chili/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada–Chile Relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/argentina-argentine/bilateral_relations_bilaterales/canada_argentina-argentine.aspx?lang=eng\">Canada–Argentina Relations</a></li><li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li></ul></div>\n      "
}