{
  "path": "/en/news/readouts/2020/08/25/prime-minister-justin-trudeau-speaks-prime-minister-new-zealand-jacinda",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of New Zealand Jacinda Ardern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of New Zealand, Jacinda Ardern.</p>\n\n<p>The two leaders discussed recent developments in the COVID-19 pandemic in Canada, New Zealand, and around the world. They exchanged views on their respective efforts to respond effectively to the pandemic’s health, social, and economic impacts. They also discussed the importance of&nbsp;vaccine development and production at a scale and cost accessible to all countries.</p>\n\n<p>The Prime Ministers spoke about their shared desire to work towards a sustainable economic recovery that includes everyone. Canada and New Zealand are co-signatories of the recently concluded Global Trade and Gender Arrangement.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Ardern also exchanged views on international issues and underscored the importance of continued cooperation to tackle shared challenges.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_new_zealand-nouvelle_zelande.aspx?lang=eng\">Canada - New Zealand Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/inclusive_trade-commerce_inclusif/itag-gaci/2020-08-04-joint-communique-commun.aspx?lang=eng\">Global Trade and Gender Arrangement – Joint Communiqué</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}