{
  "path": "/en/news/statements/2023/01/27/canada-and-jordan-advancing-cooperationaddressing-global-challenges",
  "pageTitle": "Canada and Jordan: Advancing Cooperation and Addressing Global Challenges Together | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In the spirit of enduring partnership and commitment to advancing ties of friendship and addressing key global issues, Prime Minister Justin Trudeau and His Majesty King Abdullah II of Jordan met in Ottawa today.</p>\n\n<p>The two leaders held extensive talks on ways to advance bilateral cooperation and expressed their commitment to work together to further develop the Canada-Jordan bilateral trade and investment relationship. Canada has been an important trade and investment partner for Jordan since the implementation of the Canada-Jordan Free Trade Agreement, and today, Prime Minister Trudeau and King Abdullah II discussed opportunities to further enhance trade and investment between our two countries.</p>\n\n<p>The two leaders reaffirmed their commitment to bolstering international security and stability and to continuing to work together to overcome regional and global challenges and crises.</p>\n\n<p>His Majesty and the Prime Minister expressed deep concern about the deteriorating situation in the West Bank and Gaza. They stressed the importance of increasing efforts to achieve a just, lasting, and comprehensive Middle East peace on the basis of the two-state solution. They emphasized the need to stop all unilateral and provocative measures that undermine the two-state solution, increase tension, and lead to violence. They also encouraged efforts to relaunch peace negotiations to achieve the two-state solution that will ensure an independent, viable, and sovereign Palestinian state living side by side with Israel in peace and security in accordance with international law, relevant United Nations resolutions, and agreed upon terms of reference.</p>\n\n<p>In that regard, the Prime Minister and His Majesty stressed the importance of preserving the historical status quo in Jerusalem and its holy sites. The Prime Minister reiterated Canada’s support for the Hashemite Custodianship of the Holy Sites.</p>\n\n<p>King Abdullah II and Prime Minister Trudeau also stressed the importance of finding a political solution to the crisis in Syria in accordance with United Nations Security Council Resolution 2254. Prime Minister Trudeau expressed Canada’s appreciation for Jordan’s generosity in hosting Syrian refugees. He reaffirmed that Canada’s engagement in the Middle East will continue to respond to the region’s existing security and humanitarian challenges, including the Syrian refugee crisis and the economic crisis in Lebanon. The two leaders affirmed their support for Iraq and its stability.</p>\n\n<p>The Prime Minister and His Majesty also discussed the war in Ukraine and its implications for global security. His Majesty and the Prime Minister jointly called for an immediate end to the war and for respecting international law, the UN charter, and the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The Prime Minister and His Majesty affirmed that Jordan and Canada will continue their bilateral cooperation, alongside other partners, to combat violent extremism and terrorism. Both countries will continue to participate in the Global Coalition Against Daesh to ensure its enduring defeat. The two countries will also continue cooperation through the Aqaba Process.</p>\n\n<p>King Abdullah II and Prime Minister Trudeau reiterated their shared commitment to building upon the bilateral relations between Jordan and Canada in various areas. Canada and Jordan signed a Sovereign Loan agreement valued at up to $120 million over 10 years. This loan will be funded through Global Affairs Canada’s Sovereign Loans Program, an innovative finance tool that supports government-led development efforts in middle-income partner countries. His Majesty expressed gratitude for Canada’s continued support for Jordan. The Prime Minister stressed the importance of Jordan’s economic reforms and its modernization vision. He valued Jordan’s role as a force for peace and stability in the region.</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2023/01/minister-sajjan-signs-120-million-sovereign-loan-agreement-and-announces-funding-for-projects-in-jordan.html\">Minister Sajjan signs&nbsp;$120-million sovereign loan agreement&nbsp;and announces funding for projects in Jordan</a></li>\n</ul></div>\n      "
}