{
  "path": "/en/news/news-releases/2018/09/21/prime-minister-travel-armenia-attend-xvii-francophonie-summit",
  "pageTitle": "Prime Minister to travel to Armenia to attend the XVII Francophonie Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Yerevan, Armenia, from October 11 to 13, to attend the XVII&nbsp;Francophonie Summit and take part in a bilateral visit.</p><p>The theme of this year’s Summit is “Living together in solidarity, shared humanistic values, and respect for diversity: a source of peace and prosperity in La Francophonie.” During the Summit, the Prime Minister will highlight the importance of working together to address shared challenges, grow economies that work for everyone, and promote diversity and inclusion.</p><p>Prime Minister Trudeau will also underline how important the&nbsp; <a href=\"https://www.francophonie.org/Welcome-to-the-International.html\">International Organization of La Francophonie</a> is to Canada, and emphasize the vital role that Francophone communities have played throughout Canada’s history.</p><p>Following the Summit, Prime Minister Trudeau will also take part in a bilateral visit to the country. The visit will be a chance to discuss the important relationship between Canada and Armenia and explore ways to work together more closely to further strengthen our commercial and economic ties.</p><h2>Quotes</h2><blockquote><p>“The Summit in Yerevan will be a chance to deepen the strong friendship the international Francophone community shares. La Francophonie plays a major role to promote important values like peace, diversity, and inclusion, and I am pleased that La Francophonie and Armenian organizers have chosen to highlight these common values. By building on our diversity, we can innovate, collaborate, and create a better world for everyone.”<br><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada enjoys an excellent relationship with Armenia, and I look forward to further deepening that friendship. Together, we will discuss ways to create more economic opportunities for businesses and people in both our countries.”<br><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is Prime Minister Trudeau’s first official visit to Armenia.</li><li>Diplomatic relations between Canada and Armenia were formally established in 1992. Since then, Canada and Armenia have regularly worked together in multilateral forums, including the United Nations and La Francophonie.</li><li>Armenia joined the International Organization of La Francophonie in 2004 as an observer and obtained full member status in 2012.</li><li>In 2017, Canada’s exports to Armenia totalled $9.3&nbsp;million and imports from Armenia reached $26 million.</li><li>Canada is host to an Armenian community of more than 60,000&nbsp;people.</li><li>As a member of the &nbsp;<a href=\"https://www.francophonie.org/Welcome-to-the-International.html\">International Organization of La Francophonie</a>,<em>&nbsp;</em>Canada is committed to protecting and promoting the French language and our cultural and linguistic diversity.</li><li>For several months, Canada has been working with other members of La Francophonie to prepare documents for the Summit in Yerevan.</li><li>The Summit is hosted every two years. It is an important opportunity for leaders of La Francophonie member states to meet and work together to advance shared priorities.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.francophonie.org/Le-Sommet.html\">XVII&nbsp;Francophonie Summit</a> (French only)</li><li><a href=\"http://www.canadainternational.gc.ca/russia-russie/bilateral_relations_bilaterales/armenia-armenie.aspx?lang=eng\">Canada – Armenia Relations</a></li></ul></div>\n      "
}