{
  "path": "/en/news/statements/2022/10/16/statement-prime-minister-small-business-week",
  "pageTitle": "Statement by the Prime Minister on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Small Business Week, which runs from October 16 to 22, 2022:</p>\n\n<p>“Today marks the beginning of <a href=\"https://www.bdc.ca/en/small-business-week/about\">Small Business Week</a>, an opportunity for us to celebrate the creativity, dedication, and innovation of Canadian entrepreneurs, and small and medium-sized business owners.</p>\n\n<p>“From your local grocery store you visit every weekend, the coffee shops you pass on your way into work, and the corner store or dépanneur that always seems to be open, small businesses are the heart of our communities and the backbone of our economy. They provide the goods and services we need, and employ over 10&nbsp;million people across the country.</p>\n\n<p>“Over the past two years, while small business owners have faced many challenges, we have been there to support them&nbsp;–&nbsp;and we will continue working with them to make sure they have what they need to grow and succeed. When small businesses succeed, our economy grows, jobs are created, and communities thrive. That’s why Budget&nbsp;2022 proposed to cut taxes for growing small businesses. The <a href=\"https://ised-isde.canada.ca/site/canada-digital-adoption-program/en\">Digital Adoption Program</a> is helping businesses move their services online and adopt new technologies. And this past July, we also enhanced the <a href=\"https://ised-isde.canada.ca/site/canada-small-business-financing-program/en\">Small Business Financing Program</a> so that entrepreneurs can access the funds they need to recover, innovate, and grow as we build a better future for Canadians.</p>\n\n<p>“We are also helping small businesses weather a new wave of challenges: increased inflation, rising labour costs, and a shortage of workers. We proposed new measures to ensure that doing business in Canada is as easy as possible, including building more resilient supply chains and increasing immigration levels to help fill the worker shortage. We will continue to ensure small businesses have money to grow, and access to the materials and workforce they need to do it.</p>\n\n<p>“To Canada’s small and medium-sized business owners and entrepreneurs: thank you for your hard work. This week, and every week, I encourage all Canadians to shop local, and together, we will build a stronger future for everyone.”</p></div>\n      "
}