{
  "path": "/en/news/news-releases/2018/03/09/prime-minister-announces-new-commissioner-and-administrator-yukon",
  "pageTitle": "Prime Minister announces new Commissioner and Administrator of Yukon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointments of Angélique&nbsp;Bernard as the next Commissioner of Yukon and Adeline Webber as the next Administrator of the territory.</p>\n\n<p>Since moving to Yukon in 1995, Angélique&nbsp;Bernard has worked hard to advance Francophone rights and women’s rights, making sure they have access to the services they need to thrive. A devoted member of the territory’s francophone community, she served as president of the Association franco-yukonnaise for seven years and is currently the organization’s vice-president.</p>\n\n<p>Adeline Webber is a proud member of the Teslin Tlingit First Nation. She was born and raised in Whitehorse, where she spent most of her career working in the federal public service. Ms. Webber has worked diligently to advance the recognition of Indigenous women’s rights, and played an important role in the implementation of land claims and First Nation self-government agreements in the territory.</p>\n\n<p>The Prime Minister took the opportunity to recognize Douglas Phillips, whose term as Commissioner ended January 31, 2018, for his long career in service to Yukoners. He also thanked the outgoing Administrator, Gerald Isaac, for his service, including his work fulfilling the legislative function of Commissioner since the position became vacant in January.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With her leadership experience and advocacy work, I know that Angélique Bernard will be an excellent Commissioner of Yukon. She has a deep understanding and appreciation of the diverse people who call Yukon home, and her unique perspective will be invaluable as she works to represent their best interests.”<br>\n<cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“Adeline Webber has dedicated much of her career to public service and has proven herself to be a champion of Indigenous Peoples. I know that the territory will benefit greatly from the experience and knowledge she will bring to the table as the Administrator of Yukon.”<br>\n<cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<h2>Quick facts</h2>\n\n<ul>\n\t<li>Territorial Commissioners and Administrators are Governor in Council appointments.</li>\n\t<li>Territorial Commissioners fulfill many of the same duties as the Lieutenant Governor of a province. Their responsibilities include swearing in Members of the Legislative Assembly and Members of the Executive Council, opening the Legislative Assembly, and providing assent for legislation passed by the Assembly.</li>\n\t<li>Territorial Administrators act in the place of the Commissioner if the Commissioner is unable to fulfill his or her duties during an absence or illness or other situation, or when the office is vacant.</li>\n</ul>\n\n<h2>Biographical notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2018/03/09/angélique-bernard\">Angélique Bernard</a></li>\n\t<li><a href=\"/en/news/backgrounders/2018/03/09/adeline-webber\">Adeline Webber</a></li>\n</ul></div>\n      "
}