{
  "path": "/en/news/readouts/2022/03/08/prime-minister-justin-trudeau-meets-president-latvia-egils-levits",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Latvia Egils Levits | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Latvia, Egils Levits, to discuss regional security issues and bilateral cooperation.</p>\n\n<p>Prime Minister Trudeau and President Levits denounced Russia’s brutal military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and called on Russia to withdraw its forces immediately.</p>\n\n<p>Both leaders discussed their work to counter Russian disinformation and propaganda going forward.</p>\n\n<p>Prime Minister Trudeau reaffirmed Canada’s continued commitment to regional defence and security as Framework Nation for NATO’s enhanced Forward Presence (eFP) in Latvia, and thanked Latvia’s ongoing collaboration in hosting Canadian Armed Forces members.</p>\n\n<p>President Levits thanked Canada for increasing the number of troops and equipment in Latvia and for Canada’s decision to renew its commitment to Operation REASSURANCE, as a part of Canada’s commitment to NATO and long-term regional security.</p>\n\n<p>Prime Minister Trudeau and President Levits agreed that strong trade ties among like-minded countries are more important than ever. Both leaders reaffirmed their shared commitment to building partnerships through innovation, entrepreneurship, cultural exchanges, and scientific cooperation to create jobs and growth in both our countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n</ul></div>\n      "
}