{
  "path": "/en/news/news-releases/2022/08/28/prime-minister-launches-canadas-first-federal-2slgbtqi-action-plan",
  "pageTitle": "Prime Minister launches Canada’s first Federal 2SLGBTQI+ Action Plan to continue building a more inclusive future, with pride | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>No matter who you are or who you love, you should have every opportunity to succeed in Canada. The Government of Canada has taken historic action in recent years to build a better, more inclusive future for Two-Spirit, lesbian, gay, bisexual, transgender, queer, intersex, and additional sexually and gender diverse people (2SLGBTQI+), and we know there is more to be done.</p>\n\n<p>The Prime Minister, Justin Trudeau, joined by the Minister for Women and Gender Equality and Youth, Marci Ien, today launched <em>Canada’s first Federal 2SLGBTQI+ Action Plan… Building our future, with pride,</em> a whole-of-government approach to achieve a future where everyone in Canada is truly free to be who they are and love who they love.</p>\n\n<p>The Action Plan will:</p>\n\n<ul>\n\t<li><strong>Prioritize and sustain 2SLGBTQI+ community action </strong>by supporting 2SLGBTQI+ community organizations in advocating for and serving the communities they represent;</li>\n\t<li><strong>Continue to advance and strengthen 2SLGBTQI+ rights at home and abroad </strong>including<strong> </strong>by building on the criminalization of conversion therapy and launching consultations on additional criminal law reforms, as well as continuing to invest in projects abroad through Canada’s Feminist International Assistance Policy;</li>\n\t<li><strong>Support Indigenous 2SLGBTQI+ resilience and resurgence</strong> including by continuing to fund Indigenous 2SLGBTQI+ community organizations, placing the “2S” to represent Two-Spirit people at the front of the 2SLGBTQI+ acronym, and creating a dedicated Two-Spirit Senior Advisor position within the 2SLGBTQI+ Secretariat;</li>\n\t<li><strong>Engage everyone in Canada in fostering a more inclusive future </strong>by investing in awareness campaigns to improve understanding of 2SLGBTQI+ communities and issues;</li>\n\t<li><strong>Strengthen 2SLGBTQI+ data and evidence-based policy making </strong>by<strong> </strong>improving data collection, analysis, research, and knowledge on 2SLGBTQI+ communities and the barriers they face in Canada; and</li>\n\t<li><strong>Embed 2SLGBTQI+ issues in the work of the Government of Canada </strong>by ensuring coordinated action to advance 2SLGBTQI+ priorities across federal government organizations.</li>\n</ul>\n\n<p>Budget&nbsp;2022 committed $100&nbsp;million over five years to develop and implement the Action Plan to benefit 2SLGBTQI+ people. The Prime Minister today also announced that this includes:</p>\n\n<ul>\n\t<li>Up to $75&nbsp;million for 2SLGBTQI+ community organizations that advocate for and serve their communities:\n\t<ul>\n\t\t<li>$40&nbsp;million in new capacity-building support, prioritizing funding for 2SLGBTQI+ communities experiencing additional marginalization, such as Black, racialized, and Indigenous 2SLGBTQI+ communities, 2SLGBTQI+ persons with disabilities, seniors, youth, official language minority communities, and those living in rural communities; and</li>\n\t\t<li>$35&nbsp;million in new project-focused support aimed at addressing specific barriers to 2SLGBTQI+ equality.</li>\n\t</ul>\n\t</li>\n\t<li>$11.7&nbsp;million for the 2SLGBTQI+ Secretariat to oversee and implement the Action Plan;</li>\n\t<li>$7.7&nbsp;million for data collection and community-led policy research to support federal action on 2SLGBTQI+ issues; and</li>\n\t<li>$5.6&nbsp;million to develop and implement awareness campaigns that focus on breaking down stigma and ending discrimination for 2SLGBTQI+ Canadians.</li>\n</ul>\n\n<p>The Action Plan was developed with community leaders, researchers, and organizations. It speaks to the concerns of diverse members of 2SLGBTQI+ communities across the country and uses an intersectional, holistic, and long-term approach to breaking down barriers and fighting the discrimination and oppression of 2SLGBTQI+ Canadians.</p>\n\n<p>Building on the historic action already taken, the Action Plan is an evergreen document that continues to celebrate Canadians for who they are. While it is a historical first, the work does not end here – this Action Plan will continue to guide our work into the future. The Government of Canada will continue to work with provinces and territories, cities and towns, community organizations, and 2SLGBTQI+ people from all walks of life to build a better future we can all be proud of.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada gets a little bit stronger every day that we choose to embrace and to celebrate who we are, in all our uniqueness. We are a diverse nation enriched by the lives, experiences, and contributions of 2SLGBTQI+ people. Let us celebrate all the communities that make Canada such a diverse country, and work together to build a better future, with pride.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s 2SLGBTQI+ Action Plan is a historic collaborative effort that will help build a more inclusive country. Founded on the hard work of community members, organizations, and allies, this Action Plan will set an example for generations to follow. I can assure you that the work does not end here – we will continue to partner with 2SLGBTQI+ communities and leaders to make sure we’re building a Canada that serves everyone.”</p>\n\n<footer class=\"default\">The Hon. Marci Ien, Minister for Women and Gender Equality and Youth</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Terminology and acronyms are continuously evolving. Based on extensive consultation with 2SLGBTQI+ communities across the country, the Government of Canada will adopt and encourage the use of the 2SLGBTQI+ acronym (2ELGBTQI+ in French), which is more inclusive and places the experiences of Indigenous 2SLGBTQI+ communities at the foreground as the first 2SLGBTQI+ peoples in North America. It stands for Two-Spirit, lesbian, gay, bisexual, transgender, queer, intersex, and additional sexually and gender diverse people.</li>\n\t<li>Between fall&nbsp;2020 and summer&nbsp;2021, the Government of Canada undertook a community engagement process to inform the development of the 2SLGBTQI+ Action Plan, including 25,636 survey responses, 102 written submissions, and roundtable discussions with over 100 participants.</li>\n\t<li>The Government of Canada has taken historic action in recent years to advance equality and create better opportunities for 2SLGBTQI+ Canadians, including:\n\t<ul>\n\t\t<li>In 2016, the Prime Minister appointed a Special Advisor on LGBTQ2 issues, and shortly thereafter, created what is now called the 2SLGBTQI+ Secretariat with the mandate to provide the federal government with pathways to address historical and ongoing injustices experienced by 2SLGBTQI+ people in Canada;</li>\n\t\t<li>In 2017, the<strong> </strong><em>Canadian Human Rights Act </em>and the<em> Criminal Code </em>were updated to<em> </em>protect gender identity and gender expression;</li>\n\t\t<li>In 2017, the Prime Minister apologized in the House of Commons for the systemic oppression, rejection, and criminalization of Canadians identifying as lesbian, gay, bisexual, transgender, queer, and Two-Spirit;</li>\n\t\t<li>In 2018, the Federal Court approved the LGBT Purge Class Action Final Settlement Agreement;</li>\n\t\t<li>In 2018, the <em>Expungement of Historically Unjust Convictions Act </em>for eligible offences involving consensual same-sex sexual activity became law;</li>\n\t\t<li>In 2019, the government repealed anal intercourse, vagrancy, and bawdy house offences from the <em>Criminal Code</em>;</li>\n\t\t<li>In 2019, the government announced targeted programming for 2SLGBTQI+ communities, including the Community Capacity Fund and advancing 2SLGBTQI+ rights globally through Canada’s Feminist International Assistance Policy;</li>\n\t\t<li>In 2022, an <em>Act to Amend the Criminal Code (Conversion Therapy) </em>became law, criminalizing this cruel, harmful, and degrading practice; and</li>\n\t\t<li>In 2022, the Prime Minister launched Canada’s first Federal 2SLGBTQI+ Action Plan.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://women-gender-equality.canada.ca/en/free-to-be-me/federal-2slgbtqi-plus-action-plan/federal-2slgbtqi-plus-action-plan-2022.html\">Canada’s 2SLGBTQI+ Action Plan</a></li>\n\t<li><a href=\"http://women-gender-equality.canada.ca/en/free-to-be-me/federal-2slgbtqi-plus-action-plan.html\">Action Plan Overview</a></li>\n\t<li><a href=\"https://women-gender-equality.canada.ca/en/free-to-be-me.html\">2SLGBTQI+ Secretariat</a></li>\n\t<li><a href=\"https://women-gender-equality.canada.ca/en/free-to-be-me/federal-2slgbtqi-plus-action-plan/survey-findings.html\">LGBTQ2 Action Plan Survey findings</a></li>\n\t<li><a href=\"https://women-gender-equality.canada.ca/en/free-to-be-me/apology-discrimination-individuals-families-communities.html\">Apology to LGBTQ2 communities</a></li>\n</ul></div>\n      "
}