{
  "path": "/en/news/statements/2020/08/14/statement-prime-minister-loss-canadian-citizens-explosion-lebanon",
  "pageTitle": "Statement by the Prime Minister on the loss of Canadian citizens in the explosion in Lebanon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the loss of Canadian citizens in the explosion in Lebanon:</p>\n\n<p>“Today, I join Canadians across the country to mourn the loss of two Canadian citizens in the tragic explosion in Beirut, Lebanon.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our deepest condolences to their families and friends as they grieve this tragedy. Our thoughts remain with those Canadians injured or missing in Lebanon, and with Lebanese-Canadian communities worried about their loved ones, as the search continues.</p>\n\n<p>“As the situation in Lebanon continues to evolve, our first priority is to ensure that Canadians and their families who have been affected by the blast have the consular assistance needed, to deal with this challenging time. To support the delivery of these services and answer immigration questions, Canada is setting up a task force on Lebanon. Additionally, Lebanese citizens in Canada, on a temporary basis, are able to extend their stay in Canada if they are unable to return home because of the explosion.</p>\n\n<p>“Canada will continue to stand with the people of Lebanon and to support them as they begin the difficult task of rebuilding their lives and their city. The Government of Canada has provided <a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/10/prime-minister-announces-more-assistance-lebanon\">$30 million in assistance</a> following the explosion to help trusted partners address immediate humanitarian needs and support recovery efforts. As part of this, we are matching donations generously made by Canadians through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/lebanon-liban.aspx?lang=eng#a2\">Lebanon Matching Fund</a>, up to a maximum of $5 million. We will keep working with the international community to identify how we can best support urgent needs on the ground.</p>\n\n<p>“Canadians in Lebanon who need emergency consular assistance should contact the Embassy of Canada in Beirut at 961 (4) 726-700 or <a href=\"mailto:berut-cs@international.gc.ca\">berut-cs@international.gc.ca</a> or contact Global Affairs Canada’s Emergency Watch and Response Centre at +1 613-996-8885 or <a href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a>.\"</p></div>\n      "
}