{
  "path": "/en/news/news-releases/2018/11/06/prime-minister-travel-singapore-and-papua-new-guinea",
  "pageTitle": "Prime Minister to travel to Singapore and Papua New Guinea | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Singapore and Papua New Guinea from November 13 to 18, 2018.</p><p>Canada is at its most prosperous when Canadian businesses can operate with the whole world as their marketplace. Over the last three years, the Government of Canada has opened the door to new markets – securing free trade agreements with the European Union and the growing markets of Asia – and kept the door open to our largest market through a modernized North American trade agreement.</p><p>Later this month, Prime Minister Trudeau will meet with partners in the Asia-Pacific region to continue to expand and diversify Canada’s trade, attract global investment, and create new economic opportunities and good, middle class jobs at home.</p><p>In Singapore, Prime Minister Trudeau will attend events on the margins of the 33<sup>rd</sup> Summit of the Association of Southeast Asian Nations (ASEAN) and meet with other world leaders, including Prime Minister Lee Hsien Loong and President Halimah Yacob of Singapore. The Prime Minister will also meet with business leaders and participate in a seminar as part of the Singapore FinTech Festival to support Canadian small and medium sized businesses in Asia.</p><p>The Prime Minister will then travel to Papua New Guinea for the Asia Pacific Economic Cooperation (APEC) Leaders’ Meeting. During the meeting, Prime Minister Trudeau will promote Canada as a partner of choice for trade and investment in the region, and work to deepen economic cooperation with APEC economies.</p><h2>Quotes</h2><blockquote><p>“Singapore has been one of Canada’s most important partners in Southeast Asia for over fifty years. We share common priorities, from promoting open trade to create new opportunities for businesses and the middle class, to fighting climate change, to strengthening the rules-based international order. I look forward to meeting with Singapore’s leaders to deepen our collaboration in a range of areas, for the benefit of Canadians and Singaporeans alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our government has taken great strides to open new markets for Canadians and attract global investment to Canada. I look forward to working with fellow APEC leaders to build on our success, and create even more opportunities for Canadians and all people in the Asia-Pacific region.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Minister of International Trade Diversification, Jim Carr, will accompany the Prime Minister for the duration of the trip.</li><li>Canada and Singapore are signatories to the Comprehensive and Progressive Agreement on Trans-Pacific Partnership (CPTPP).</li><li>On October 29, 2018, Canada ratified the CPTPP.</li><li>In 2017, two-way merchandise trade between Canada and Singapore totaled $2.36 billion.</li><li>Canada has been a Dialogue Partner of ASEAN for over 40 years, and supports the organization’s efforts to enhance peace, stability, and prosperity in Southeast Asia and the wider Asia-Pacific region.</li><li>As a group, ASEAN ranks as Canada’s sixth-largest trading partner.</li><li>Canada is a founding member of APEC. Since its establishment in 1989, APEC has become the pre-eminent economic forum in the Asia-Pacific region.</li><li>In 2017, APEC partners accounted for nearly 84 per cent of Canada's total merchandise trade.</li><li>In 2017, foreign direct investment from APEC economies in Canada was $481 billion. Four of Canada’s top five trading partners are APEC members (United States, China, Mexico, and Japan).</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li></ul></div>\n      "
}