{
  "path": "/en/news/readouts/2020/05/05/prime-minister-justin-trudeau-speaks-prime-minister-sudan-abdalla-hamdok",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Sudan Abdalla Hamdok | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Sudan, Abdalla Hamdok, to continue strengthening bilateral relations between Canada and Sudan, and to discuss the latest developments regarding the political transition in Sudan and the COVID-19 pandemic.</p>\n\n<p>Prime Minister Trudeau spoke about Canada’s support for the Sudanese people as their country undergoes a critical time in its history in transitioning to democracy, and is taking steps to protect women’s rights and human rights. Prime Minister Trudeau commended Prime Minister Hamdok for his commitment to reforms to support the political transition and the strengthening of democracy and security in Sudan.</p>\n\n<p>The two leaders discussed their respective efforts to fight the pandemic and protect the health, safety, and economic well-being of their citizens. Prime Minister Trudeau thanked Prime Minister Hamdok for Sudan’s ongoing help to repatriate Canadians seeking to return home during this crisis.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Hamdok discussed international coordination to fight the disease, and measures needed to support health, financial, and economic systems in Africa, including debt relief and other assistance.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/sudan-soudan/bilateral_relations_bilaterales/sudan-soudan.aspx?lang=eng\">Canada – Sudan Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/05/canada-welcomes-sudanese-government-decision-to-ban-female-genital-mutilation.html\">Canada welcomes Sudanese government decision to ban female genital mutilation</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}