{
  "path": "/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states",
  "pageTitle": "Prime Minister announces temporary border agreement with the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 continues to evolve rapidly, and the Government of Canada is working around the clock to limit its spread and do everything necessary to protect the health and safety of Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, announced on March 18 that Canada and the United States have agreed to temporarily restrict all non-essential travel across the Canada-U.S. border, which will take effect at midnight tonight.</p>\n\n<p>This collaborative and reciprocal measure between Canada and the United States will restrict non-essential travel across the border, including for tourism and recreation. Canadian and American citizens and permanent residents who are currently visiting each other’s country can still return home.</p>\n\n<p>All essential and business travel will continue unimpeded. Both governments recognize the importance of preserving vital supply chains between our two countries. These supply chains ensure that food, fuel, and life-saving medicines continue to reach people on both sides of the border.</p>\n\n<p>This announcement is another step in the government’s strong response to the COVID-19 virus. We will continue to take important measures based on science, to prioritize the health and safety of Canadians, ensure the capacity of our health care system, support international and domestic efforts, and mitigate the economic impacts on Canadians and Canadian business.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With COVID-19 continuing to spread, the health and safety of Canadians is our top priority. Canada and the United States have agreed to work together for the protection of our people and our economies. Together we will continue to work collaboratively and make the necessary sacrifices to fight this pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The United States is an important friend, ally, and economic partner. These temporary measures will enable us to protect the health and safety of Canadians, while ensuring the continued flow of critical supplies, people, and infrastructure between our two countries.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, Minister of Public Safety and Emergency Preparedness</footer>\n</blockquote>\n\n<blockquote>\n<p>“This agreement will help support our public health response to limit the spread of COVID-19 in Canada. We continue to work closely with our American allies to ensure the safety of citizens on both sides of the border.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Workers in the trade and transportation sector, such as truck drivers and crew on any aircraft, train or marine vessel, are key to ensuring the continued movement of goods and delivery of essential services throughout the integrated supply chains that are critical to Canada and the United States.”</p>\n\n<footer class=\"default\">The Hon. Marc Garneau, Minister of Transport</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today, Canada and the United States are also announcing collaborative and reciprocal measures where we will now be returning irregular migrants who attempt to cross anywhere at the Canada-U.S. border.</li>\n\t<li>The new measures will take effect at 12:01 a.m. EDT on Saturday, March 21, 2020, and end at 12:00 p.m. EDT on Tuesday, April 21, 2020. At that time, Canada and the United States will review the measures.</li>\n\t<li>All travel of an optional or discretionary nature, including but not limited to tourism and recreation, is covered by these measures. Travel by healthy people who have to cross the border to go to work or for essential services, such as medical care, will continue.</li>\n\t<li>Canada and the United States are encouraging people to stay home. This prudent approach is in line with these new collaborative measures.</li>\n\t<li>American travellers arriving in Canada in transit to a third country, diplomats, and travellers with family care, educational or compassionate reasons will continue to be allowed to cross. Supply chains, including trucking, will not be impacted by these new measures.</li>\n\t<li>The Government of Canada is asking all travellers entering Canada to self-isolate for 14 days upon entry. For those travelling by air, the request to self-isolate will be clearly communicated at multiple points, for example when purchasing a plane ticket, before boarding the plane, and again upon arrival in Canada.</li>\n\t<li>Exemptions to self-isolation for 14 days will be provided to healthy workers who provide essential services. This includes workers in the trade and transportation sector who are important for the movement of goods and people across the border, such as truck drivers and crew on any aircraft, train or marine vessel crossing the border. It also includes healthy people who have to cross the border to go to work, including health care providers and critical infrastructure workers.</li>\n\t<li>Regardless of how they seek to enter Canada, all travellers arriving in the country, including healthy workers who provide essential services, are subject to new, more broad-based questioning about their health. Canada Border Services Agency officers will query travellers on the state of their health, observe visible signs of illness, and refer any traveller suspected of being ill for a further medical assessment, regardless of how the traveller responded to the health screening question.</li>\n\t<li>Additionally, under the <em>Aeronautics Act</em>, the Minister of Transport will require airlines to deny boarding of a traveller who is symptomatic, regardless of citizenship status. This applies to international and trans-border flights, including those from the United States. The pre-boarding health assessment will include the operator asking simple health questions, looking for visible signs of illness before boarding.</li>\n\t<li>In the event the traveller presents COVID-19 symptoms, the airline will be required to refuse to board the passenger for travel for a period of 14 days, or until a medical certificate is presented that confirms the patient does not carry the virus.</li>\n\t<li>For crossings by air, marine and rail modes, the transportation operator will be asked to clearly advise their customers of the restrictions when they buy a ticket and again before they commence the journey. If the operator carries a passenger to the port of entry despite the legal restriction, the passenger would be refused entry by the Canada Border Services Agency or United States Customs and Border Protection officers at the port of entry, and the operator would have to return the passenger, with the cost of the return trip borne by the operator.&nbsp;</li>\n\t<li>Measures implemented by governments throughout the world in their efforts to contain the spread of COVID-19 have had significant impacts on Canadians abroad. Cross-border transit and movement within countries is being restricted, and Canadian travellers are recommended to return to Canada via commercial means while they remain available.</li>\n\t<li>Global Affairs Canada is providing 24/7 consular support to Canadians abroad affected by COVID-19 through the Emergency Watch and Response Centre and through consular staff at its network of missions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/03/20/us-canada-joint-initiative-temporary-restriction-travelers-crossing-us\">U.S.-Canada Joint Initiative: Temporary Restriction of Travelers Crossing the U.S.-Canada Border for Non-Essential Purposes</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">The Government of Canada Takes Action on COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2020/03/new-measures-for-covid-19-response.html\">New measures for COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://travel.gc.ca/assistance/embassies-consulates\">Embassies and consulates by destination</a></li>\n</ul></div>\n      "
}