{
  "path": "/en/news/statements/2022/05/04/statement-prime-minister-israel-independence-day",
  "pageTitle": "Statement by the Prime Minister on Israel Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom Ha’atzmaut, Israel Independence Day:</p>\n\n<p>“Tonight, we join Israelis, Jewish communities, and many others in Canada and around the world to celebrate the 74th anniversary of the establishment of the State of Israel.</p>\n\n<p>“Canada is proud to have been one of the first countries to formally recognize Israel in 1948. Since establishing diplomatic ties in 1949, our two countries have shared more than 70 years as friends, allies, and close partners, including in several international organizations. We will continue to oppose efforts to isolate Israel in international fora, and we will continue to stand against any attacks on the values we share.</p>\n\n<p>“On this day, we celebrate the deep people-to-people ties and shared values that unite our two countries. We also recognize the significant contributions that Israeli Canadians have made – and continue to make – to Canada.</p>\n\n<p>“Canada continues to combat antisemitism and hatred in all of its forms, whenever and wherever it arises, including through the essential work of the Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism, the Honourable Irwin Cotler. We will also continue to support and promote the International Holocaust Remembrance Alliance’s definition of antisemitism, which we adopted in 2019 as part of Canada’s <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a>.</p>\n\n<p>“We condemn the recent spate of terror attacks targeting Israeli civilians these past weeks. There is no place for hate or terror of any kind. Today, we reiterate our commitment to a continued, prosperous, and valuable relationship between the people of Israel and Canada, as well as lasting peace in the Middle East.</p>\n\n<p>“On behalf of the Government of Canada, I wish everyone celebrating Israel Independence Day a Yom Ha’atzmaut Sameach.”</p></div>\n      "
}