{
  "path": "/en/news/news-releases/2022/05/31/president-chile-gabriel-boric-visit-canada",
  "pageTitle": "President of Chile Gabriel Boric to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of Chile, Gabriel Boric, will visit Canada on June 6, 2022.</p>\n\n<p>Prime Minister Trudeau and President Boric will meet to advance shared priorities and address global issues. The leaders will discuss taking ambitious climate action including oceans protection and pollution pricing, promoting democracy, advancing human rights and gender equality, furthering meaningful engagement with Indigenous peoples, and growing our economies and the middle class. The two leaders will also discuss Russia’s illegal invasion of Ukraine and the importance of working closely with partners throughout the Americas and around the world to continue to hold Russia accountable and support Ukrainians who have been displaced.</p>\n\n<p>In addition, Prime Minister Trudeau and President Boric will meet with high school students for a discussion on youth leadership. &nbsp;&nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Chile have a deep relationship, rooted in shared values. We are committed to democracy, human rights and gender equality, combatting climate change, and promoting inclusive trade and international cooperation to address peace and security challenges. I look forward to my meeting with President Boric, where we will aim to strengthen our collaboration, both within the Americas and globally.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau has spoken with President Boric twice since his election in December 2021.</li>\n\t<li>Canada and Chile have enjoyed vibrant diplomatic relations since 1941, spanning over 80 years.</li>\n\t<li>This year marks the 25th anniversary of the Canada-Chile Free Trade Agreement (CCFTA) and Environmental and Labour Cooperation Agreements. Bilateral merchandise trade has nearly quadrupled since the CCFTA came into force in 1997. In 2021, Canada exported more than $1.2 billion in merchandise to Chile in 2021, while imports from Chile totalled more than $1.8 billion. Canada is the second most important foreign investor in Chile.</li>\n\t<li>In addition to the Summit of the Americas, Canada and Chile are close partners in several regional and multilateral fora, including the United Nations, the Asia-Pacific Economic Cooperation forum, the World Trade Organization, and the Organization of American States.</li>\n\t<li>The two countries also work together in the context of the Pacific Alliance, in which Canada is an observer and Candidate Associated State, and in the context of the Inclusive Trade Action Group and Global Trade and Gender Arrangement, alongside New Zealand and Mexico.</li>\n\t<li>Canada is among the top foreign study destinations for Chilean post-secondary students. Each year, over 725 Chileans travel to Canada with an International Experience Canada permit, which allows them to work for one year and study for up to six months in Canada.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/chile-chili/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Chile relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng&amp;_ga=2.67006890.589644227.1640126716-2017077305.1613070365\">Canada-Chile Free Trade Agreement</a></li>\n</ul>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/corporate/international-affairs/partnerships-countries-regions/latin-america-caribbean/canada-chile-environmental-agreement.html\">Canada-Chile Agreement on Environmental Cooperation</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n</ul></div>\n      "
}