{
  "path": "/en/news/readouts/2020/02/20/prime-minister-justin-trudeau-speaks-premiers-about-infrastructure",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers about infrastructure disruptions caused by blockades | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since the very outset of this situation, the federal government has been engaging directly with premiers and Indigenous leaders to work together on a peaceful and lasting resolution. As part of this effort, today Prime Minister Justin Trudeau spoke with premiers in a call with the Council of the Federation to discuss the disruptions to infrastructure across the country caused by blockades, and their very real impacts on Canadian farmers, businesses, families, and workers. The Prime Minister highlighted that we need our railroad system to be fully functional and that we are looking at our options to resolve the current interruptions given the impact on our economy.&nbsp;</p>\n\n<p>The Prime Minister spoke with the Premiers about the importance of ending the blockades as quickly as possible and reaching a peaceful and lasting resolution, in a way that builds trust and respect&nbsp;among all parties involved. To that effect, the Prime Minister highlighted the close collaboration between his government and the BC government on this complex issue. The Prime Minister committed to continue working closely with all the premiers to resolve the situation. Prime Minister Trudeau noted the RCMP’s offer to withdraw its operations from Wet’suwet’en territory, and the ongoing offer made by Minister of Crown-Indigenous Relations Carolyn Bennett to meet with Wet’suwet’en hereditary chiefs to address both urgent and longer term issues, following the Prime Minister’s letter to them.&nbsp;</p>\n\n<p>Today’s call continues efforts by the Prime Minister and ministers to work with premiers and Indigenous leaders across the country to resolve this situation as soon as possible. The Government of Canada’s priority remains to resolve this peacefully and to protect the rule of law in our country.</p></div>\n      "
}