{
  "path": "/en/news/news-releases/2018/06/27/helping-40000-young-people-canada-gain-skills-and-find-jobs",
  "pageTitle": "Helping 40,000 young people in Canada gain skills and find jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In Canada, more than 840,000 young people are unemployed, or not receiving the education and training they need to build a future for themselves.</p><p>By working closely with Canadian businesses, the Government of Canada is making sure that more young Canadians – of all backgrounds and abilities – have the skills and work experience they need to find and maintain good jobs.</p><p>The Prime Minister, Justin Trudeau, today met with young people at the first hiring event organized by <a href=\"https://opportunityforallyouth.ca/\">Opportunity For All Youth</a>, a coalition of major Canadian businesses. The coalition is supported by MaRS Discovery District and empowers young people to find good jobs and training opportunities.</p><p>The Government of Canada is supporting Opportunity For All Youth’s project, which aims to provide meaningful employment for 40,000 vulnerable NEET (Not in Education, Employment, or Training) young Canadians.</p><p>The coalition of Canadian businesses will work closely together, along with governments, community organizations, and employment services agencies, to develop youth-focused hiring and retention strategies, and connect more young people with good jobs, and education and training opportunities.</p><h2>Quote</h2><blockquote><p>“Too many young Canadians are ready to work but have a hard time getting their foot in the door. We are working with major Canadian businesses and key partners to break down the barriers facing many young people, so they can jumpstart their careers, and find jobs that make the best use of their skills and talents.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Opportunity For All Youth coalition includes Starbucks, Walmart, HMSHost, Tridel Corporation, The Source, Coast Capital Savings, TELUS and Teleperformance, and is supported by MaRS Discovery District. The Government of Canada contributed $100,000 toward the coalition’s project.</li><li>Organizers of the project will also host hiring events in Vancouver, Calgary, Ottawa, and Montréal later this year. Hiring events in other cities will follow.</li><li>Each year, the Government of Canada invests on average $330 million in the Youth Employment Strategy to help young people gain the skills and work experience they need to find and maintain good employment.</li><li>Budget 2018 invested an additional $448.5 million over five years to support the continued doubling of the number of job placements under the Canada Summer Jobs program and to modernize the Youth Employment Strategy. Last summer, nearly 70,000 students received hands-on work experience through summer employment, generating income for their post-secondary education.</li><li>This builds on significant investments through Budgets 2017 and 2016 in the Youth Employment Strategy to help more than 33,000 vulnerable youth develop the skills they need to find work or go back to school, create 15,000 new green jobs for young Canadians, and provide over 1,600 new employment opportunities for youth in the heritage sector.</li><li>In addition, Budget 2017 introduced the CanCode program, which provides coding and digital skills education to young Canadians – from kindergarten to grade 12 – and gives them the head start they need to find and keep good, well-paying, in-demand jobs.</li><li>The Government of Canada has also created more opportunities for co-op and work-integrated learning experiences for students in science, technology, engineering, and mathematics and business programs.</li><li>In January 2018, the Government of Canada launched the design phase of Canada Service Corps, Canada’s new national youth service initiative. Canada Service Corps will encourage young Canadians to get involved in meaningful service opportunities in communities across Canada and gain valuable skills and experience that will benefit them in every aspect of life. It will also provide young Canadians with service opportunities that currently do not exist.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment Strategy</a></li><li><a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html\">Canada Service Corps</a></li><li><a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a></li><li><a href=\"https://www.marsdd.com/\">MaRS Discovery District</a></li></ul></div>\n      "
}