{
  "path": "/en/news/news-releases/2020/05/20/prime-minister-announces-opening-program-protect-jobs-and-help",
  "pageTitle": "Prime Minister announces opening of program to protect jobs and help businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are focused on keeping their jobs and paying their bills, as they continue to deal with the impacts of COVID-19. That’s why the Government of Canada has put jobs and workers first, in our approach to support businesses during this challenging time.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that application documents and updated criteria for Canada Emergency Commercial Rent Assistance (CECRA) for small businesses are now available, and that the program will be opened for applications beginning on May 25.</p>\n\n<p>The Government of Canada is focused on safeguarding workers’ jobs as we continue to deal with this pandemic. That’s why we reached an agreement in principle last month with all provinces and territories to implement CECRA. This program will provide forgivable loans to eligible commercial property owners, who in turn will give a rent reduction of at least 75 per cent for April and May (retroactive), and June, to their small business tenants.</p>\n\n<p>This program provides property owners the opportunity to do their part in helping small businesses and their employees succeed in these challenging times. We’re all in this together, and that’s why the government is stepping up to provide rent relief to businesses, while helping property owners maintain rental income through this crisis.</p>\n\n<p>CECRA will provide important relief for small businesses experiencing financial hardship, and is another measure that helps businesses keep Canadians on the payroll. Applications will be accepted through the Canada Mortgage and Housing Corporation <a href=\"https://www.cmhc-schl.gc.ca/en/finance-and-investing/covid19-cecra-small-business\">website</a> beginning on May 25, and application documents can be accessed now.</p>\n\n<p>The Government of Canada’s COVID-19 Economic Response Plan is protecting middle class jobs and helping Canadian businesses through this crisis. Together, we will continue to ensure Canadians have what they need to pay their bills and keep their families safe and healthy during these challenging times. &nbsp;</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians want to know that their jobs are protected and their families are safe and healthy. That’s why we’re stepping up to provide support that will keep workers on the payroll, protect middle class jobs, and help Canadians recover quickly once we make it through these difficult times.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic&nbsp;continues to have&nbsp;a profound impact on Canadians.&nbsp;We thank and commend the many property owners who have already taken action to help their tenants during this crisis.&nbsp;With CECRA,&nbsp;the Government of Canada is stepping up to support Canada’s&nbsp;small businesses. The forgivable&nbsp;loans&nbsp;will&nbsp;significantly&nbsp;lower the rent&nbsp;for&nbsp;small business&nbsp;tenants&nbsp;and&nbsp;keep them prepared to bounce back when this crisis subsides.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>CECRA will provide forgivable loans to qualifying commercial property owners, whether they have a mortgage on their property or not. The loans will cover 50 per cent of three monthly rent payments that are payable by eligible small business tenants who are experiencing financial hardship during April, May, and June.</li>\n\t<li>The loans will be forgiven if the qualifying property owner agrees to reduce the small business tenants’ rent by at least 75 per cent under a rent reduction agreement, which will include a term not to evict the tenant while the agreement is in place. The small business tenant would cover the remainder, up to 25 per cent of the rent.</li>\n\t<li>Impacted small business tenants are businesses that are paying less than $50,000 per month in gross rent in a given location, with annual revenues of less than $20 million (at the ultimate parent level), and who have experienced at least a 70 per cent drop in pre-COVID-19 revenues.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/finance-and-investing/covid19-cecra-small-business\">COVID–19: CECRA for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories\">Prime Minister announces partnerships with provinces and territories to deliver the Canada Emergency Commercial Rent Assistance for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n</ul></div>\n      "
}