{
  "path": "/en/news/statements/2020/10/05/statement-prime-minister-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p>\n\n<p>“Teachers help build the foundation of our society. They are the smiling faces that greet our kids each day, the ones who challenge us to be thoughtful and kind, and the people that inspire us to be our very best. They are educators, coaches, caretakers, mentors, and number-one fans and, every day, they strengthen communities across our country.</p>\n\n<p>“Today, on <a href=\"https://en.unesco.org/commemorations/worldteachersday\">World Teachers’ Day</a>, we celebrate those teachers and educators in Canada and around the world for the invaluable role they play in shaping our kids’ futures. Whether staying late to coach sports teams, helping coordinate the yearly science fair, supervising the morning breakfast club, or giving up their weekends to direct the school play, these community leaders go beyond their job descriptions to ensure their students have the best possible environment to learn and grow. &nbsp;&nbsp;</p>\n\n<p>“And this year, as the world faces the worst health and economic crisis of our generation, we thank our teachers and educators who are continuing to be there to provide the quality education and support our kids need in these confusing and challenging times. They embody this year’s theme – Teachers: Leading in crisis, reimagining the future – which highlights how they are hard at work to adapt their teaching styles, find new solutions, and ensure that no student is left behind during this crisis.</p>\n\n<p>“The Government of Canada is doing everything possible to give our teachers and educators the support they need to keep themselves and their students safe and healthy. In August, we announced an investment of up to $2 billion for provinces and territories through the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school\">Safe Return to Class Fund</a>. This funding is helping adapt learning spaces, improving air ventilation, increasing hand sanitation and hygiene, and supporting purchases of personal protective equipment and cleaning supplies. We also announced an additional $112 million for First Nations to support community measures to ensure a safe return to school on reserves. Together, we will continue to work with provincial, territorial, and First Nation partners to provide a healthy environment for our educators and students.</p>\n\n<p>“As a former teacher myself, I understand the dedication of teachers to their work, and the investments and sacrifices they make for their students, each and every day. The 2020 <a href=\"https://www.ic.gc.ca/eic/site/pmate-ppmee.nsf/eng/home\">Prime Minister’s Awards for Teaching Excellence, Teaching Excellence in STEM</a>, and <a href=\"https://www.ic.gc.ca/eic/site/pmaece-ppmepe.nsf/eng/home\">Excellence in Early Childhood Education</a> celebrates just some of the many educators that are making a difference across our communities. I am also happy to launch the call for nominations for the 2021 edition today.</p>\n\n<p>“On behalf of the Government of Canada, I thank all teachers and educators in Canada and around the world for caring about the greater good, and for pushing us all forward. Their work changes lives and communities, and helps bring us closer to realizing a fairer and more inclusive world for everyone.”</p></div>\n      "
}