{
  "path": "/en/news/statements/2017/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:<br> </p><p>“Today, we remember the brave members of the army, navy and air forces who fought so valiantly, and sacrificed so greatly, during the Korean War.</p><p>“Sixty-four years ago today, a ceasefire put an end to active fighting in the Korean War. After the Communist North’s invasion of South Korea in 1950, the brutal war lasted more than three years and cost hundreds of thousands of military and civilian lives. More than 26,000 Canadians – some only teenagers, others veterans of the Second World War – crossed the Pacific Ocean to fight under the flag of the United Nations. Over 500 Canadian soldiers, sailors, and air personnel made the ultimate sacrifice, and the lives of countless others were forever changed.</p><p>“The soldiers fought in conditions reminiscent of the First World War – cold, wet trench duty punctuated by terrifying night patrols into no man’s land. They bravely battled both the harsh weather and enemy forces at places like Kapyong, the site of one of Canada’s most important victories.</p><p>“We take pride in Canada’s contributions, along with those of our United Nations allies, to defending the sovereignty of South Korea. The courage and sacrifice of our Korean War veterans helped South Korea to become the peaceful and prosperous country we know today.</p><p>“Today, I urge all Canadians to <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/korean-war\">learn more about the Korean War</a>, and to participate in activities being held to honour the veterans. As we celebrate the 150th anniversary of Confederation, let us recognize all those in our military, and their families who support them. They help defend our most cherished values – openness, democracy, compassion, and respect for human rights – in Canada and around the world.”</p></div>\n      "
}