{
  "path": "/en/news/statements/2021/11/05/statement-prime-minister-veterans-week",
  "pageTitle": "Statement by the Prime Minister on Veterans’ Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Veterans’ Week, which runs from November 5 to 11, 2021:</p>\n\n<p>“Today, as we mark the beginning of <a href=\"https://www.veterans.gc.ca/eng/remembrance/commemorative-events/veterans-week\">Veterans’ Week</a>, we commemorate members of our military and police through this year’s theme, ‘Service, Courage and Sacrifice – At home, around the world and across generations.’ Throughout the week, we honour all of the brave Canadians who have served, and continue to serve, our country in times of war, military conflict, and peace.</p>\n\n<p>“This year marks the 30th anniversary of the end of the Gulf War, the first conflict where women in the Canadian Armed Forces served in combat roles. It is also the 10th anniversary of the end of Canada’s combat mission in Afghanistan, one of our country’s largest military efforts, where more than 40,000 Canadians in uniform – as well as a large number of civilians and government officials – were deployed.</p>\n\n<p>“Our country will always owe a debt of gratitude for the tremendous commitment of all Canadian veterans, and the government will continue to ensure all veterans are supported. That is why in Budget 2021, the Government of Canada committed $45&nbsp;million over two years to pilot a program aimed at reducing veteran homelessness and $140 million over five years, with $6 million ongoing, to ensure veterans receive timely access to high-quality mental health care. It is also why last year, we invested $20 million to create the one-time <a href=\"https://www.veterans.gc.ca/eng/financial-support/emergency-funds/emergency-support-organizations\">Veterans Organizations Emergency Support Fund.</a> Through this initiative, 42 organizations across Canada have been able to support the well-being of veterans and their families during the COVID-19 pandemic. This work has built on the ongoing support we are providing through the <a href=\"https://www.veterans.gc.ca/eng/about-vac/research/well-being-fund\">Veteran and Family Well-Being Fund</a>.&nbsp;</p>\n\n<p>“As we continue to follow public health guidelines to keep each other and our communities safe, we may be observing Veterans’ Week, Indigenous Veterans Day, and Remembrance Day differently again this year. I invite all Canadians to view the <a href=\"https://www.facebook.com/CanadaRemembers\">online commemorations</a>, share their stories, and wear a poppy in honour of our brave service members.</p>\n\n<p>“Throughout this week of remembrance, I also encourage everyone to reflect on the strength, bravery, and dedication of our veterans and those who sacrificed their lives in service of our country. To the heroes who have risked so much to protect our country, our values, and our way of life: We are forever thankful for all you have done for Canadians and people around the world.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}