{
  "path": "/en/news/statements/2023/04/09/statement-prime-minister-vimy-ridge-day",
  "pageTitle": "Statement by the Prime Minister on Vimy Ridge Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Vimy Ridge Day:</p>\n\n<p>“Today, we remember the bravery and sacrifice of the Canadian soldiers who served their country and risked their lives for peace, freedom, and justice during the Battle of Vimy Ridge.</p>\n\n<p>“In 1917, on the Vimy Ridge battlefield in northern France, some of the fiercest fighting of the First World War claimed the lives of almost 3,600 brave Canadians and wounded more than 7,000 others. There, facing an equipped enemy and difficult conditions, Canadian soldiers showed remarkable determination and courage, fighting side by side – Francophones, Anglophones, new Canadians, Black Canadians, and Indigenous Peoples – and using innovative tactics to secure victory.</p>\n\n<p>“Four years after the end of the war, in 1922, France granted the use of a parcel of land on Vimy Ridge to the people of Canada for all time, in recognition of the valour and courage of our soldiers. Erected on the highest point of this former battlefield, the Canadian National Vimy Memorial serves as a towering and striking reminder of Canada’s sacrifice. It has also become a symbol of Canada’s commitment to upholding peace around the world, standing as a tribute to every Canadian who served their country in battle and risked or sacrificed their lives in the First World War. Carved on the walls of the monument are the names of the 11,285 Canadian soldiers who died in France and whose final resting place was then unknown.</p>\n\n<p>“On Vimy Ridge Day, we honour the memory of those whose bravery led to one of the First World War’s most memorable victories and a defining moment in Canadian history. We also express our gratitude to the ongoing efforts of all Canadians in uniform who work to protect and defend our shared values of peace, freedom, and democracy.&nbsp;May their sacrifice inspire us all to work toward lasting peace, today and every day.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}