{
  "path": "/en/news/readouts/2022/02/26/prime-minister-justin-trudeau-speaks-president-moldova-maia-sandu",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Moldova Maia Sandu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Moldova, Maia Sandu.</p>\n\n<p>Prime Minister Trudeau and President Sandu strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. President Sandu insisted that Moldova would keep doing everything in its power to provide shelter and safety to Ukrainians in need, in these distressing times. Prime Minister Trudeau praised Moldova’s generous efforts in that regard, and&nbsp;reiterated that Ukraine’s security is also Europe’s security and that of all democratic states seeking to uphold fundamental principles of international law and state sovereignty.</p>\n\n<p>Prime Minister Trudeau expressed Canada’s support to Moldova and commended President Sandu on her continued efforts to reform and promote a free and democratic Moldova.</p>\n\n<p>The two leaders recognized 30 years of the bilateral relationship between our countries and looked forward to an in-person visit, when conditions permit. They committed to continue their efforts in close coordination with allies and partners in support of Ukraine.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/romania-roumanie/bilateral_relations_bilaterales/canada_moldova.aspx?lang=eng\">Canada-Republic of Moldova Relations</a></li>\n</ul></div>\n      "
}