{
  "path": "/en/news/news-releases/2023/02/10/prime-minister-announces-changes-senior-ranks-public-service",
  "pageTitle": "The Prime Minister announces changes in the senior ranks of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes in the senior ranks of the Public Service:</p>\n\n<p><strong>Shalene Curtis-Micallef</strong>, currently Associate Deputy Minister of Justice, becomes Deputy Minister of Justice, effective February 13, 2023.</p>\n\n<p><strong>Chris Forbes</strong>, currently Deputy Minister of Agriculture and Agri-Food, becomes Deputy Minister of Environment and Climate Change, effective February 20, 2023.</p>\n\n<p><strong>Arun Thangaraj</strong>, currently Associate Deputy Minister of Immigration, Refugees and Citizenship, becomes Deputy Minister of Transport, effective February 20, 2023.</p>\n\n<p><strong>Stefanie Beck</strong>, currently Associate Deputy Minister of National Defence, becomes Deputy Minister of Agriculture and Agri-Food, effective February 20, 2023.</p>\n\n<p><strong>Jacqueline Bogden</strong>, currently Deputy Secretary to the Cabinet (Emergency Preparedness and COVID Recovery), Privy Council Office, becomes Chief Human Resources Officer, Treasury Board of Canada Secretariat, effective February 27, 2023.</p>\n\n<p><strong>Dr. Harpreet S. Kochhar</strong>, currently President of the Public Health Agency of Canada, becomes President of the Canadian Food Inspection Agency, effective February 27, 2023.</p>\n\n<p><strong>Heather Jeffrey</strong>, currently Associate Deputy Minister of Health, becomes President of the Public Health Agency of Canada, effective February 27, 2023.</p>\n\n<p><strong>Nancy Hamzawi</strong>, currently Assistant Deputy Minister, Health Products and Food Branch, Health Canada, becomes Executive Vice-President of the Public Health Agency of Canada, effective February 27, 2023.</p>\n\n<p><strong>Andrew Brown</strong>, currently Senior Assistant Deputy Minister, Skills and Employment Branch, Employment and Social Development Canada, becomes Associate Deputy Minister of Employment and Social Development, effective February 13, 2023.</p>\n\n<p><strong>Daniel Rogers</strong>, currently Associate Chief of the Communications Security Establishment, becomes Deputy Secretary to the Cabinet (Emergency Preparedness and COVID Recovery), Privy Council Office, effective February 27, 2023.</p>\n\n<p><strong>Christine Donoghue</strong>, currently Chief Human Resources Officer, Treasury Board of Canada Secretariat, becomes Senior Official at the Privy Council Office, effective February 27, 2023.</p>\n\n<p>The Prime Minister took this opportunity to congratulate Christine Donoghue as she transitions to retirement. He also extended his gratitude to the following individuals on the occasion of their recent retirements from the Public Service, following distinguished careers marked by unwavering dedication and tireless efforts in serving Canadians:</p>\n\n<ul>\n\t<li>Christine Hogan, Deputy Minister of Environment and Climate Change</li>\n\t<li>Michael Keenan, Deputy Minister of Transport</li>\n\t<li>Siddika Mithani, President of the Canadian Food Inspection Agency</li>\n\t<li>François Daigle, Deputy Minister of Justice and Deputy Attorney General of Canada</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/shalene-curtis-micallef\">Shalene Curtis-Micallef</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/chris-forbes\">Chris Forbes</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/arun-thangaraj\">Arun Thangaraj</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/stefanie-beck\">Stefanie Beck</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/jacqueline-bogden\">Jacqueline Bogden</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/dr-harpreet-s-kochhar\">Dr. Harpreet S. Kochhar</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/heather-jeffrey\">Heather Jeffrey</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/nancy-hamzawi\">Nancy Hamzawi</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/andrew-brown\">Andrew Brown</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/daniel-rogers\">Daniel Rogers</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/02/10/christine-donoghue\">Christine Donoghue</a></li>\n</ul></div>\n      "
}