{
  "path": "/en/news/statements/2018/03/26/prime-minister-welcomes-third-report-canada-united-states-council",
  "pageTitle": "Prime Minister welcomes third report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the third report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders:</p><p>“I am pleased to welcome today the <a href=\"https://advancingwomeninbusiness.com/\">Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders</a>’ third report, which explores how we can encourage more women to start their own businesses and to pursue high growth enterprises.</p><p>“As highlighted in the report, if we want to better support women entrepreneurs, we need to address the challenges they face, including difficulty accessing capital, finding meaningful mentorship opportunities, and a lack of contacts with large buyers.</p><p>“I thank the Council for their recommendations, including campaigns to promote and inspire women entrepreneurs, provide better access to data, implement more tools and programs to support women pursuing high growth firms, and reduce gender biases faced by women entrepreneurs.</p><p>“With women starting close to half of all new businesses in Canada, it’s clear that supporting women entrepreneurs is essential to growing Canada’s economy. <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a> puts gender equality at the centre – including through a new Women Entrepreneurship Strategy – because we know that women’s success is vital to growing our economy and strengthening the middle class.</p><p>“Women-led businesses are key to boosting our economic growth and creating more good, well-paying jobs. Working with our partners like the United States, Canada will ensure women entrepreneurs succeed.”</p></div>\n      "
}