{
  "path": "/en/news/news-releases/2020/12/21/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of the Superior Court of Justice of Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Faye E. McWatt, a judge of the Superior Court of Justice of Ontario, as the new Associate Chief Justice of the Superior Court of Justice of Ontario.</p>\n\n<p>Associate Chief Justice McWatt replaces the Honourable Frank N. Marrocco, who retired on November 10, 2020, after 15 years of distinguished service as a judge.<strong>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Faye E. McWatt every success in her new role as Associate Chief Justice of the Superior Court of Justice of Ontario. She brings a wealth of experience to the position, with 14 years practising law and 20 years as a judge in Ontario. I am confident Associate Chief Justice McWatt will continue to serve Ontarians well. I also thank the Honourable Frank N. Marrocco for his dedication to Ontarians during his time on the court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n\t<li>The Superior Court of Justice of Ontario has jurisdiction over criminal, civil, and family law cases, and is the largest superior trial court in Canada.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/12/21/honourable-faye-e-mcwatt\">The Honourable Faye E. McWatt</a></li>\n</ul></div>\n      "
}