{
  "path": "/en/news/readouts/2021/02/02/prime-minister-justin-trudeau-speaks-prime-minister-japan-suga-yoshihide",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Japan Suga Yoshihide | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Japan, Suga Yoshihide.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Suga discussed ongoing efforts to combat the global COVID-19 pandemic and support health measures and economic well-being. They emphasized that international cooperation is critical to addressing the impacts of the pandemic and ensuring that critical health and medical supply chains remain open. The leaders also noted the important leadership of the World Health Organization and the need to work collectively towards its reform to ensure the world is better prepared to face the next pandemic.</p>\n\n<p>The prime ministers recommitted to the strategic partnership between Canada and Japan, including a shared vision for a free and open Indo-Pacific. They discussed ongoing cooperation to promote peace and security in the region, including the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON.</p>\n\n<p>The prime ministers discussed the strong and growing economic ties between Canada and Japan and welcomed the United Kingdom’s formal interest in acceding to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP).</p>\n\n<p>The two leaders noted Canada and Japan’s respective commitments to reach carbon neutrality by 2050. They agreed to work together to accelerate international action to fight climate change and rebuild a more sustainable and resilient global economy. They looked forward to further cooperation between their two countries on low carbon technologies, including hydrogen, carbon capture and storage, and electric vehicles.</p>\n\n<p>The prime ministers discussed relations with China, including the arbitrary detention of two Canadian citizens. Prime Minister Trudeau expressed support for Prime Minister Suga’s efforts to secure the return of Japanese citizens abducted by North Korea and called for their immediate release. The two leaders agreed to work closely within the G7 and other international forums to uphold the rules-based international order and defend human rights.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-neon.html\">Operation NEON</a></li>\n</ul></div>\n      "
}