{
  "path": "/en/news/news-releases/2017/12/14/prime-minister-unveils-themes-canadas-2018-g7-presidency",
  "pageTitle": "Prime Minister unveils themes for Canada’s 2018 G7 Presidency | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced during a Facebook Live event the themes that will guide Canada’s 2018 G7 Presidency.</p><p>Canada’s 2018 G7 Presidency is an important opportunity for Canada to speak with a strong voice on the international stage, engage G7 counterparts on pressing global challenges, and make real progress on goals we all share.</p><p>This coming year, Canada will advance domestic and international priorities framed by the following five key themes:</p><ul><li>Investing in growth that works for everyone;</li><li>Preparing for jobs of the future;</li><li>Advancing gender equality and women’s empowerment;</li><li>Working together on climate change, oceans and clean energy; and</li><li>Building a more peaceful and secure world.</li></ul><p>In the months leading up to the Leaders’ Summit, Canada will host a series of G7 ministerial meetings that address these themes. Each of these meetings will also integrate a gender-based analysis and will include a focus on gender equality and women’s empowerment.</p><p>During today’s event, the Prime Minister also unveiled the 2018 G7 logo, which evokes Charlevoix's rich natural landscape.</p><h2>Quote</h2><blockquote><p>“Canada is proud to put forward a progressive agenda for the 2018 G7. The themes we have chosen for the year will help focus our discussions on finding real, concrete solutions to promote gender equality, women’s empowerment, clean energy, and economic growth that works for everyone. As G7 partners, we share a responsibility to ensure that all citizens benefit from our global economy, and that we leave a healthier, more peaceful, and more secure world for our children and grandchildren.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada will assume the Presidency of the G7 on January 1, 2018, and will host the G7 Leaders' Summit in the Charlevoix region of Quebec from June 8-9, 2018.</li><li>The country that holds the G7 Presidency sets the agenda for the year, and is responsible for hosting and organizing the Leaders' Summit, ministerial meetings, and other associated events.</li><li>This will be the sixth Leaders’ Summit hosted by Canada, and the first in Quebec since 1981.</li><li>To coincide with the official start of Canada’s G7 Presidency, a social media campaign and website will be launched in early 2018 to engage Canadians. This will help us better understand people’s views on various aspects of the G7 themes and encourage youth participation on important issues that affect us all.</li><li>The previous Canadian-hosted Leaders’ Summits were held in Muskoka, Ontario (2010); Kananaskis, Alberta (2002); Halifax, Nova Scotia (1995); Toronto, Ontario (1988); and Ottawa-Montebello, Ontario and Quebec (1981).</li><li>The G7 is an informal grouping of seven of the world’s advanced economies consisting of Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States. The European Union was first invited to attend the G7 in 1977, but is not part of the hosting rotation.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/g7/index.aspx?lang=eng\">Road to the 2018 G7 Summit in Charlevoix</a></li><li><a href=\"/en/news/news-releases/2017/05/27/canada-host-2018-g7-summit-charlevoix-quebec\">Canada to host 2018 G7 Summit in Charlevoix, Quebec</a></li></ul></div>\n      "
}