{
  "path": "/en/news/statements/2022/02/06/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 6 to 12, 2022:</p>\n\n<p>“Today marks the start of <a href=\"https://www.international.gc.ca/campaign-campagne/idw-sdi/index.aspx?lang=eng\">International Development Week</a> – a time to reflect on the progress we have made and opportunities to continue building a better, more resilient, and peaceful world.</p>\n\n<p>“Canadian international development workers, volunteers, and partners have a long and proud history of working to reduce poverty and improve the lives of people in many countries. They help tackle hunger and malnutrition, advance human rights, and equip people with the tools and skills they need to live a more equitable life with greater opportunities. No matter the challenge, they answer the call to improve the lives of the most vulnerable people around the world with compassion, hard work, and dedication.</p>\n\n<p>“As we work together to achieve a brighter future around the world, we know the importance of advancing gender equality, improving education and health outcomes, fighting climate change, and strengthening economic resilience. Through <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a>, we are working closely with our international partners to reduce poverty and inequality, and to address the unique challenges faced by women and girls.</p>\n\n<p>“While we have made progress in our efforts to build a world that is more peaceful, inclusive, and prosperous, the COVID-19 pandemic has put this progress at risk. As this health crisis evolves, we recognize that in many countries, the pandemic will have significant and lasting negative impacts. As a result, we have mobilized more than <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/global_health-sante_mondiale/response_covid-19_reponse.aspx?lang=eng\">$2.5&nbsp;billion in international assistance</a> to fight COVID-19 around the world, and taken actions to ensure that vaccines and treatments successfully reach the people that need them most. This includes a commitment to donate at least 200&nbsp;million vaccines to COVAX by the end of 2022. Thanks in part to Canada’s contribution, COVAX reached the milestone of 1&nbsp;billion COVID-19 vaccine doses delivered.</p>\n\n<p>“As Canada continues to work with global partners in response to COVID-19, we also remain focused on the urgent work needed to tackle the climate crisis. That is why we have <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance.html\">committed $5.3&nbsp;billion in climate finance</a> to support transformational climate action in developing countries over the coming five years. We remain committed to working with our partners to address humanitarian needs caused by the pandemic, climate change, and other crises, and to support recovery and resilience abroad.</p>\n\n<p>“I invite all Canadians to join me in thanking the many people who work hard every day to bring real change in the lives of the most vulnerable people around the world. As we ‘<a href=\"https://www.international.gc.ca/campaign-campagne/idw-sdi/index.aspx?lang=eng\">#GofortheGoals</a>’, let us continue our efforts to realize the <a href=\"https://sdgs.un.org/goals\">United Nations’ 2030 Agenda and Sustainable Development Goals</a> to ensure peace and prosperity for people and the planet.”</p></div>\n      "
}