{
  "path": "/en/news/news-releases/2021/05/27/prime-minister-delivers-apology-internment-italian-canadians-during",
  "pageTitle": "Prime Minister delivers apology for the internment of Italian Canadians during the Second World War | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today delivered a formal apology in the House of Commons for the internment of Italian Canadians during the Second World War.</p>\n\n<p>Following Italy’s declaration of war against Canada on June 10, 1940, the Government of Canada interned more than 600 people of Italian heritage. Around 31,000 Italian Canadians across the country were declared “enemy aliens”, and many experienced discrimination, lost their jobs, or saw their businesses boycotted or vandalized. The government’s actions violated the values that our country was fighting to secure during the Second World War, including freedom, equality, and justice, and had serious impacts on families and the Italian Canadian community.</p>\n\n<p>The Prime Minister apologized to those who were interned, their families, and the Italian Canadian community for the pain and hardship they endured because of this historical injustice. He recognized Italian Canadians’ many contributions, including in business, arts and culture, science and technology, politics, and skilled professions, that have helped build our country, from coast to coast to coast. He also reaffirmed the government’s commitment to a strong, diverse, and more inclusive Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians of Italian heritage have helped shape Canada, and they continue to be an invaluable part of the diversity that makes us strong. Today, as we acknowledge and address historical wrongs against the Italian Canadian community, we also show our respect for their great contributions to our country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 1940, after Italy joined the Second World War as an ally to Germany, over 600 Italians were interned in camps under the authority of the <em>War Measures Act</em> and the <em>Defence of Canada Regulations</em>. Approximately 31,000 Italian Canadians were declared “enemy aliens”, and had to report to local registrars once per month. Registrars were appointed by the Minister of Justice, and were provincial or municipal police officers, including Royal Canadian Mounted Police (RCMP) officers, or postal clerks.</li>\n\t<li>The <em>War Measures Act</em>, as well as the <em>Defence of Canada Regulations </em>that were<em> </em>brought into effect on September 3, 1939, gave the government the legal authority to detain without charge, seize property from, and limit activities of Canadian residents born in countries that were at war with Canada.</li>\n\t<li>In 1990, at a gathering of Italian Canadian organizations, the Right Honourable Brian Mulroney offered an apology for the treatment of the Italian Canadian community during the Second World War.</li>\n\t<li>In September 2018, RCMP Commissioner Brenda Lucki delivered an official expression of regret in a ceremony attended by family members of Italian internees, members of the Italian community, and RCMP employees.</li>\n\t<li>Through the Community Historical Recognition Program, the Government of Canada made $5 million available in grants and contributions from 2008 to 2013 for eligible projects to commemorate and recognize the experiences of the Italian Canadian community in relation to the Second World War internment in Canada.</li>\n\t<li>Today, Canada is home to approximately 1.6 million Italian Canadians – one of the largest Italian diasporas in the world.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/speeches/2021/05/27/prime-ministers-remarks-delivering-official-apology-internment-italian\">Prime Minister's remarks delivering an official apology for the internment of Italian Canadians during the Second World War</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2021/05/14/prime-minister-announces-apology-internment-italian-canadians-during\">Prime Minister announces apology for the internment of Italian Canadians during the Second World War</a></li>\n</ul></div>\n      "
}