{
  "path": "/en/news/news-releases/2021/07/28/securing-strong-future-newfoundland-and-labrador",
  "pageTitle": "Securing a strong future for Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we begin to build back better and recover from the COVID-19 pandemic, the Government of Canada is committed to working collaboratively with provinces and territories to build a healthier and more prosperous future.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Newfoundland and Labrador, Andrew Furey, today announced an agreement in principle for the financial restructuring of the Lower Churchill Projects – a set of hydroelectric generation and transmission projects that will provide a reliable and long-term source of clean power for people in the Atlantic region.</p>\n\n<p>This agreement in principle will contribute to a long-term, sustainable financial base for the Projects and reduce their cost of financing, providing more certainty for people and businesses. It provides $2 billion in federal financing, including a $1 billion investment in the province’s portion of the Projects’ Labrador–Island Link and a federal loan guarantee of $1&nbsp;billion for the Projects’ Muskrat Falls and Labrador Transmission Assets.</p>\n\n<p>The Prime Minister also announced the Government of Canada is prepared to make annual transfers to the province equivalent to Canada’s yearly net revenue from the Hibernia offshore oil project Net Profit Interest (NPI) and Incidental Net Profit Interest (INPI), which current estimates indicate will total $3.2 billion between now and the end of the Hibernia project’s life. The federal government believes that it is Newfoundlanders and Labradorians who should be the primary beneficiaries of these funds and that these new annual transfers will ensure that. With these funds, the province will be able to meet its objectives, and the transfers will also reinforce the two governments’ longstanding agreement that Newfoundland and Labrador be the principal beneficiary of offshore oil and gas development in the jointly managed offshore area.</p>\n\n<p>Initiatives like the Lower Churchill Projects are helping to promote economic competitiveness and prosperity in Newfoundland and Labrador, Atlantic Canada, and our entire country. The Projects also contribute effectively to regional electrification and decarbonization efforts, and to Canada’s plan to address climate change, from Newfoundland and Labrador to Nova Scotia and beyond. We will continue to work with provinces and territories and Indigenous peoples to build a healthier and cleaner future, and an economy that works for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we work collaboratively with Newfoundland and Labrador to support these crucial projects, we are investing in the future of people in the province. Today’s announcement is an important part of our joint efforts to build back a better, more prosperous future for Newfoundlanders and Labradorians and all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is an historic moment for Newfoundland and Labrador. It highlights the important work that can be achieved when federal and provincial governments collaborate on shared priorities. Today’s $5.2 billion announcement lets the people of our province breathe a sigh of relief, knowing their power bills will not double. I thank everyone involved in building this brighter future, as the federation is stronger when we are stronger.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Andrew Furey, Premier of Newfoundland and Labrador</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is committed to growing our economy through investments that create good middle class jobs and build a resilient, clean future. Today’s announcement on the Lower Churchill Projects will ensure Newfoundlanders and Labradorians benefit from these new annual transfers and that the province can move forward on its plans to provide clean power to communities across Atlantic Canada. These projects are good for the province, and good for Canada, as we build a greener, more innovative, and more prosperous economy.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement will support the development of clean power and prosperous growth for the people of Newfoundland and Labrador and Atlantic Canadians. As we move forward, the Government of Canada will continue to work with our provincial, territorial, and Indigenous partners towards a sustainable future for Canadians.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Dominic LeBlanc, President of the Queen’s Privy Council for Canada and the Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Newfoundland and Labrador’s hydroelectric resources can help power Atlantic Canada, electrify our regional economy, and lead the fight against climate change. This deal positions us to do just that, and puts the Lower Churchill Projects on sound financial footing for the benefit of all Newfoundlanders and Labradorians.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Seamus O’Regan Jr., Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Lower Churchill Projects are a set of hydroelectric generation and transmission projects that includes the Muskrat Falls Generating Station on the Churchill River in Labrador, the Labrador Transmission Assets, the Labrador–Island Link that connects to the island of Newfoundland, and the Maritime Link that connects to Nova Scotia.</li>\n\t<li>The Lower Churchill Projects remain under provincial jurisdiction and the province has the responsibility to ensure they are delivered economically.</li>\n\t<li>The agreement in principle related to the financial restructuring of the Lower Churchill Projects will provide for the refinancing of $1 billion in debt under a new federal loan guarantee. It will also provide a new $1 billion federal investment in the Labrador–Island Link portion of the Projects. Both governments will work to have the detailed agreements for the financial restructuring of the Lower Churchill Projects implemented before the Projects are commissioned.</li>\n\t<li>The Hibernia oil field was discovered in 1979 and is located 315 kilometres east of St.&nbsp;John’s, Newfoundland and Labrador. Construction of the Hibernia oil project began in 1990 after the federal government committed substantial financial support to secure the project’s development.</li>\n\t<li>The NPI and INPI are the result of a commercial agreement made in 1990 between Canada and the original Hibernia owners, Gulf, Mobil, Chevron, and Petro-Canada.</li>\n\t<li>The NPI and INPI were provided as compensation for Canada’s financial support of the Hibernia project, which included non-repayable contributions of $973 million and loan guarantees of nearly $2 billion. This support was critical to enabling the construction of the Hibernia project, which began in 1990 and was completed in 1997. As of 2020, Canada had received $3.35 billion in NPI&nbsp;and INPI&nbsp;from the project.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/17/clean-energy-strengthen-economy-and-communities-newfoundland-and\">Clean energy to strengthen the economy and communities in Newfoundland and Labrador</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/02/government-of-canada-announces-negotiationson-financial-restructuring-of-lower-churchill-projects.html\">Government of Canada Announces Negotiations on Financial Restructuring of Lower Churchill Projects</a></li>\n\t<li><a href=\"https://www.gov.nl.ca/lowerchurchillproject/\">Lower Churchill Project</a></li>\n</ul></div>\n      "
}