{
  "path": "/en/news/readouts/2020/06/09/prime-minister-justin-trudeau-speaks-prime-minister-lebanon-hassan-diab",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Lebanon Hassan Diab | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today,&nbsp;Prime Minister Justin Trudeau spoke with the Prime Minister of Lebanon, Hassan Diab, to discuss the latest developments in the COVID-19 pandemic and the relationship&nbsp;between Canada and Lebanon.</p>\n\n<p>The two leaders&nbsp;discussed the global trajectory of COVID-19, as well as its&nbsp;impact in their respective countries. They agreed on the need for continued international cooperation, with&nbsp;Prime Minister Trudeau underscoring the importance of strong multilateral institutions and responses as the world grapples with the pandemic.&nbsp;</p>\n\n<p>The Prime Ministers reaffirmed the longstanding friendship between Canada and Lebanon,&nbsp;which is rooted in&nbsp;close people-to-people ties. They&nbsp;agreed to continue working together to strengthen the relationship.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The&nbsp;Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and&nbsp;social impacts in Canada and around the world.<strong>&nbsp;</strong></p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/lebanon-liban/relations.aspx?lang=eng\">Canada-Lebanon relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}