{
  "path": "/en/news/readouts/2020/05/11/prime-minister-justin-trudeau-speaks-prime-minister-fiji-frank-bainimarama",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Fiji Frank Bainimarama | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today,&nbsp;Prime Minister Justin Trudeau spoke with the Prime Minister of Fiji, Frank Bainimarama, to discuss the latest developments on the COVID-19 pandemic. Prime Minister Trudeau offered his condolences to&nbsp;Prime Minister Bainimarama&nbsp;for the lives lost,&nbsp;and&nbsp;the&nbsp;damage sustained,&nbsp;during Cyclone Harold.</p>\n\n<p>The two leaders shared information on the&nbsp;spread&nbsp;of the virus in their countries,&nbsp;and measures taken to protect the health, safety, and economic well-being of their citizens. Both Prime Ministers&nbsp;emphasized that international coordination and information sharing was&nbsp;critical to respond&nbsp;effectively to the pandemic.</p>\n\n<p>The leaders discussed the impact of the virus&nbsp;in&nbsp;the Pacific region&nbsp;at large, and the unique challenges posed by its isolation. They&nbsp;discussed the need to support&nbsp;more vulnerable countries in fighting the pandemic.</p>\n\n<p>Both leaders reaffirmed their shared commitment to combatting climate change and economic security.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_fiji-fidji.aspx?lang=eng&amp;pedisable=true\">Canada-Fiji Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}