{
  "path": "/en/news/news-releases/2022/08/23/prime-minister-concludes-successful-visit-german-chancellor-olaf",
  "pageTitle": "Prime Minister concludes a successful visit by German Chancellor Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, welcomed the Chancellor of Germany, Olaf Scholz, to Canada from August 21 to 23 to further strengthen our close partnership. With stops in Montréal, Quebec, Toronto, Ontario, and Stephenville, Newfoundland and Labrador, the two leaders worked together to make progress on shared priorities, including support for Ukraine, addressing the broader global impacts of Russia’s illegal invasion such as food security, strengthening bilateral cooperation on energy and leadership on climate action, promoting trade and investment that benefits everyone, and advancing the transition to the clean economy.</p>\n\n<p>On August 22, in Montréal, the Prime Minister and the Chancellor met with Canadian and German business representatives to encourage investment and partnership opportunities, including in the critical minerals and automotive sectors. They visited Mila, one of the three National Artificial Intelligence Institutes funded by the <a href=\"https://ised-isde.canada.ca/site/ai-strategy/en\">Pan-Canadian Artificial Intelligence Strategy</a> and reaffirmed Canada and Germany’s shared commitment to the responsible development of artificial intelligence, including the possibility of working through the International Centre of Expertise in Montréal on Artificial Intelligence (CEIMIA) to leverage their expertise to support ongoing <a href=\"https://gpai.ai/\">Global Partnership on Artificial Intelligence</a> (GPAI) projects.</p>\n\n<p>The two leaders then headed to Toronto where, on August 23, they addressed Canadian and German business leaders at the Canada-Germany Business Forum, to promote greater cooperation between their two countries in response to current global challenges exacerbated by Russia’s unjustifiable invasion of Ukraine, particularly energy and food security.</p>\n\n<p>Both countries are committed to promoting electric vehicle uptake and advancing the transition to the clean economy. In Toronto, Canada signed two new Memoranda of Understanding (MOUs) with German automotive manufacturers Volkswagen AG and Mercedes-Benz AG to advance collaboration in Canada across the automotive, battery, and critical minerals sectors. Discussions with businesses and various stakeholders also took place with the goal to secure other key agreements to strengthen trade, science, and innovation and to create good jobs on both sides of the Atlantic.</p>\n\n<p>To further promote innovation, the Prime Minister and the Chancellor launched a call for proposals for innovative small and medium-sized enterprises (SMEs) to support collaborative research and development projects, including in the areas of clean transportation, electric batteries, and quantum technologies. The call for proposals will be led by the National Research Council of Canada in collaboration with Germany’s Central Innovation Programme for SMEs.</p>\n\n<p>The two leaders also welcomed the announcement that Canada has accepted Germany’s invitation to become a partner host country at Hannover Messe, one of the world’s largest industrial development and technology trade fairs, in 2025. This will be an opportunity for Canada to showcase its leadership in industrial and technology innovation and deepen collaboration with German and international partners.</p>\n\n<p>During the Chancellor’s three-day visit, the two leaders reiterated Canada and Germany’s unwavering support for Ukraine’s sovereignty, territorial integrity, and independence in the face of Russia’s illegal and unjustifiable aggression. While in Toronto, they jointly took part in the virtual Summit for Heads of State and Government of the International Crimea Platform, a Ukraine-led initiative aimed at enhancing international advocacy and responses to Russia’s illegal annexation of Crimea, which has deeper implications this year due to Russia’s unprovoked invasion of Ukraine.</p>\n\n<p>In support of the Ukrainian government and people, Prime Minister Trudeau announced:</p>\n\n<ul>\n\t<li>The allocation of $3.85&nbsp;million to two projects to provide increased support to Ukraine’s security sector institutions. This includes targeted support for the National Police of Ukraine and State Emergency Services as well as Ukraine’s Ministry of Internal Affairs and Ministry of Defence.</li>\n\t<li>New sanctions against 62 individuals and a defence sector entity complicit in Putin’s war of choice in Ukraine.</li>\n\t<li>The creation of a dedicated team to better monitor and detect Russian state-sponsored disinformation and enable deeper international collaboration with partners like Germany, including through the G7 Rapid Response Mechanism (RRM).</li>\n</ul>\n\n<p>Canada also welcomed Germany leading, under the G7 RRM, a working group focused on the threat of subnational foreign interference at the community, municipal, and regional levels.</p>\n\n<p>As the world continues to grapple with the far-reaching impacts of Russia’s invasion of Ukraine, Prime Minister Trudeau provided details on Canada’s $52&nbsp;million contribution to the United Nations’ Food and Agriculture Organization (FAO) Grain Storage Support Strategy, which was first announced at the G7 Summit in Germany last June. This funding will help address ongoing grain storage shortages and strengthen food security by expanding storage capacity. It will help protect the livelihoods of thousands of farmers and indirect beneficiaries, including employment for internally displaced persons.</p>\n\n<p>As Russia continues to weaponize energy, Canada is also working with its European and global partners, including Germany, to strengthen energy security and accelerate the clean energy transition. To encourage further progress in this area, the Chancellor concluded his visit to Canada on August 23 in Stephenville, where the countries signed a joint declaration of intent to establish a Canada-Germany Hydrogen Alliance. The proposed Alliance would help establish a transatlantic Canada-Germany supply corridor, with the target of beginning export by 2025. Prime Minister Trudeau reiterated Canada’s commitment to support Germany’s energy needs and looked forward to continuing to work hand-in-hand with Germany to take ambitious climate action.</p>\n\n<p>In Stephenville, Prime Minister Trudeau and Chancellor Scholz also met with Premier Andrew Furey of Newfoundland and Labrador, Premier Blaine Higgs of New Brunswick, Premier Tim Houston of Nova Scotia, and Premier Dennis King of Prince Edward Island. Together, they discussed energy exports and the development of renewable energy in Atlantic Canada, and the region’s transition toward net-zero. The Premiers also signed a statement in support of the proposed Canada-Germany Hydrogen Alliance.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Germany are close, like-minded allies and friends. We are united by our shared values, people-to-people ties, and commitment to building a clean future with good, middle-class jobs and a strong economy that benefits everyone. Chancellor Scholz’s first official visit to Canada was a successful one and we will continue to work closely together in many areas, including energy security and critical minerals, to build a better world for our children and grandchildren.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This was Chancellor Scholz’s first official visit to Canada since he became German Chancellor last year.</li>\n\t<li>Germany is one of Canada’s most important sources of innovative, research and engineering-intensive investment, with over 820 affiliates operating in Canada, employing nearly 70,000 Canadians. Germany is the 7th largest source of foreign direct investment in Canada.</li>\n\t<li>Beyond trade and investment, Canada and Germany enjoy a dynamic relationship in science, technology, and innovation. Since the 1971 signing of the bilateral Scientific and Technological Cooperation Agreement, there have been more than 1,000 joint research projects across the whole spectrum of research.</li>\n\t<li>The Government of Canada is investing an additional $443.8&nbsp;million over 10&nbsp;years, starting in 2021-22, in support of the <a href=\"https://ised-isde.canada.ca/site/ai-strategy/en\">Pan-Canadian Artificial Intelligence Strategy</a>.</li>\n\t<li>Through the <a href=\"https://gpai.ai/\">Global Partnership on Artificial Intelligence</a> (GPAI), Canada is working with like-minded partners around the world to explore how artificial intelligence can be used to address complex global challenges, advance more inclusive economic growth, and promote improvements to working conditions.</li>\n\t<li>Canada is accelerating the shift toward zero-emission vehicles and helping the transition to a greener economy, by investing in the battery supply chain and critical minerals so Canada can achieve net-zero greenhouse gas emissions by 2050, including through the $8&nbsp;billion Strategic Innovation Fund’s <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/00039.html\">Net Zero Accelerator initiative</a> and the $3.8&nbsp;billion <a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadas-critical-minerals-strategy.html\">Critical Minerals Strategy</a>.</li>\n\t<li>Volkswagen AG is the second-largest automaker in the world and has a focus on becoming a global leader in sustainable mobility.</li>\n\t<li>The new Memorandum of Understanding (MOU) with Volkswagen AG will further cooperation in areas such as battery manufacturing, critical minerals supply, and cathode material production, and will pave the way for the establishment of a Canadian office for PowerCo, Volkswagen’s newly founded global battery company.</li>\n\t<li>Mercedes-Benz AG is a leading automotive manufacturer with ambitious sustainability goals, including making its supply chain CO2-neutral by 2039.</li>\n\t<li>The new MOU with Mercedes-Benz AG includes exploring collaboration in areas such as critical minerals, research and development, strategic partnerships, and potential investments.</li>\n\t<li>In March 2021, the Government of Canada formalized the Canada-Germany bilateral energy relationship through the signing of an <a href=\"https://www.nrcan.gc.ca/energy/resources/international-energy-cooperation/memorandum-understanding-between-the-department-natural-resources-canada-and-the-fede/23423\">MOU</a> to advance cooperation toward accelerating the transition to a safe, secure, reliable, affordable, and sustainable energy system in both Canada and Germany.</li>\n\t<li>The joint declaration of intent on establishing a Canada-Germany Hydrogen Alliance builds on <a href=\"https://www.nrcan.gc.ca/climate-change-adapting-impacts-and-reducing-emissions/canadas-green-future/the-hydrogen-strategy/23080\">Canada’s Hydrogen Strategy</a> and marks an important step toward Canada’s objective of becoming a top global supplier of clean hydrogen. It underscores the importance of strategic partnerships between Canada and Germany, including to advance our common climate change objectives and our mutual interests in accelerating the global energy transition and safeguarding international energy security to meet net-zero emissions by 2050.</li>\n\t<li>In March 2022, and again in May 2022, Prime Minister Trudeau and Chancellor Scholz agreed to work together to advance the adoption and expansion of pollution pricing around the world through Canada’s Global Carbon Pricing Challenge and Germany’s Climate Club. In May 2022, both Germany and Canada signed onto the G7 Hydrogen Action Pact.</li>\n\t<li>Canada has a long-standing history of fostering international collaboration through global fora like the International Energy Agency, the International Partnership for Hydrogen and Fuel Cells in the Economy, and most recently the Clean Energy Ministerial Hydrogen Initiative, a cornerstone of global hydrogen deployment of which Canada led the development and is co-leading the implementation.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/13/chancellor-germany-olaf-scholz-visit-canada\">Chancellor of Germany Olaf Scholz to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/23/prime-minister-announces-additional-support-ukraine\">Prime Minister announces additional support for Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/08/canada-strikes-historic-partnerships-with-leading-german-automakers-volkswagen-and-mercedes-to-help-meet-growing-demand-for-clean-transportation-so.html\">Canada strikes historic partnerships with leading German automakers Volkswagen and Mercedes to help meet growing demand for clean transportation solutions</a></li>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2022/08/canada-and-germany-sign-agreement-to-enhance-german-energy-security-with-clean-canadian-hydrogen.html\">Canada and Germany sign agreement to enhance German energy security with clean Canadian hydrogen</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/08/22/prime-minister-justin-trudeau-meets-chancellor-germany-olaf-scholz\">Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reduction Plan: Clean Air, Strong Economy</a></li>\n</ul></div>\n      "
}