{
  "path": "/en/news/statements/2020/05/11/statement-prime-minister-national-nursing-week",
  "pageTitle": "Statement by the Prime Minister on National Nursing Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Nursing Week, which runs from May 11 to 17:</p>\n\n<p>“Nurses work hard day and night, serving Canadians and protecting our health and well-being. They support us through some of our best and worst moments, providing their skills, expertise, and care when we need them the most.</p>\n\n<p>“Today, as we mark the first day of <a href=\"https://www.cna-aiic.ca/en/news-room/events/national-nursing-week\">National Nursing Week</a>, we recognize the work and sacrifices of nurses, and their contributions to our health care system and our lives. This year’s theme, ‘Nurses: A Voice to Lead — Nursing the World to Health,’ reminds us of the invaluable work that these health care professionals are doing across our country, and around the world, as we face this pandemic. The World Health Organization has also designated this year as the Year of the Nurse and Midwife, in recognition of the 200th anniversary of the birth of Florence Nightingale, the founder of modern nursing.</p>\n\n<p>“Nurses are everyday heroes and, as our country’s largest health care workforce, they are serving Canadians on the front lines of the fight against COVID-19. During this difficult time, when we must stay apart to be safe, nurses are playing a dual role: delivering critical health care while providing a bridge to our loved ones. They’re showing up for us, and we need to do the same for them. That means listening to our public health experts, staying home as much as possible, and following guidelines put in place by health care facilities. We will also continue to have their backs, and make sure they have the supplies and personal protective equipment they need to stay safe and healthy.</p>\n\n<p>“In cities across Canada and around the world, people are showing their support and appreciation for nurses and other health care workers by clapping during shift changes, and leaving rainbows in windows and on driveways to spread hope. The unwavering dedication nurses show to patients and our communities is inspiring to all of us, and will help get us through this pandemic.</p>\n\n<p>“I hope all Canadians will join me today and throughout this week to express our deepest gratitude for their tireless work. Let’s all take the opportunity this week to thank a nurse in our lives for taking such good care of us.”</p></div>\n      "
}