{
  "path": "/en/news/news-releases/2022/11/20/prime-minister-strengthens-ties-french-speaking-world-sommet-de-la-francophonie",
  "pageTitle": "Prime Minister strengthens ties with the French-speaking world at the Sommet de la Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the 18th Sommet de la Francophonie, in Djerba, Tunisia, where he met with counterparts from Francophonie member countries and governments to make progress on shared priorities like protecting democracy and human rights and defending and promoting the French language. This brings the Prime Minister’s trip to four international meetings – the Association of Southeast Asian Nations (ASEAN) Summit, the G20 Summit, the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting, and the 18th Sommet de la Francophonie – to a close.</p>\n\n<p>At the Sommet de la Francophonie, Prime Minister Trudeau reaffirmed Canada’s commitment to remaining a strong partner for fellow Francophonie members and governments and continuing to support La Francophonie’s institutions. He announced:</p>\n\n<ul>\n\t<li>$20.8&nbsp;million for the Organisation internationale de la Francophonie (OIF) to continue implementing its mandate and programming in key areas, including inclusive governance and growth, the promotion of the French language, democracy and human rights, education, and economic cooperation for sustainable development;</li>\n\t<li>$2.4&nbsp;million for the Agence universitaire de la Francophonie to continue promoting cooperation between Francophone academic institutions, improve access to quality education for learners in the South, and support professional training and research; and</li>\n\t<li>$200,000 to enable TV5MONDEplus to continue supporting, promoting, and disseminating French-language programming, including content produced in the South.</li>\n</ul>\n\n<p>To promote sustainable development while continuing to advance peace, security, and democracy in the French-speaking world, the Prime Minister announced that Canada is providing:</p>\n\n<ul>\n\t<li>approximately $65&nbsp;million to support sustainable development projects in Sahel, particularly in Mali and Burkina Faso, with a focus on support to vulnerable populations, the empowerment of women and girls, good governance and democratic resilience, and socio-economic development;</li>\n\t<li>$49.5&nbsp;million to support the ACTION project, which aims to improve economic, food, and nutritional security for Mali’s poor rural populations practising proximity irrigation, especially women and youth; and</li>\n\t<li>$1.5&nbsp;million to support the ongoing mission and operations of the Académie internationale de lutte contre le terrorisme, which supports African countries, including francophone West Africa, in their counter-terrorism efforts.</li>\n</ul>\n\n<p>At the Summit, the Prime Minister reiterated Canada’s commitment to promote democracy and human rights in Francophonie countries and around the world. He announced that Canada is providing $10&nbsp;million for the new Democracy in La Francophonie initiative to provide fast and flexible support to countries, as well as the OIF, toward addressing emerging challenges and threats to democracy and human rights, including by improving government resilience against disinformation and empowering women to tackle threats to their democratic rights.</p>\n\n<p>On the margins of the Summit, the Prime Minister and the Minister of Foreign Affairs, Mélanie Joly, hosted a meeting with OIF member states and governments on the situation in Haiti and the need to support Haitian authorities’ efforts to restore order and respond to Haitians’ immediate humanitarian needs. At the meeting, he announced:</p>\n\n<ul>\n\t<li>$8&nbsp;million to meet the needs of crisis-affected populations, including those impacted by displacement, the recent violence, chronic food insecurity, and the cholera epidemic;</li>\n\t<li>$5&nbsp;million to strengthen Haitian authorities’ capacity to investigate, prosecute, and adjudicate cases of corruption and economic crime, money laundering, and other offences; and</li>\n\t<li>$3.5&nbsp;million to strengthen and improve access to legal aid support for victims of gender-based violence, while strengthening access to justice, countering impunity, and supporting efforts to combat corruption.</li>\n</ul>\n\n<p>He and Minister Joly also announced that Canada is imposing further sanctions in response to the egregious conduct of Haitian political elites who provide illicit financial and operational support to armed gangs. These latest sanctions target a former Haitian president and two former Haitian prime ministers suspected to protect and enable the illegal activities of armed criminal gangs in Haiti, including through money laundering and other acts of corruption, effectively freezing any assets they may hold in Canada. We will continue to pressure those responsible for the violence and insecurity in Haiti, and to uphold respect for human rights, democracy, and international peace. These sanctions build on three additional sanctions announced on November 19.</p>\n\n<p>While in Djerba, Prime Minister Trudeau spoke out against Russia’s illegal and unjustifiable invasion of Ukraine, Observer Member of the Francophonie, and reaffirmed Canada’s steadfast support for the Ukrainian government and people. He stressed the need for member countries and governments to reaffirm La Francophonie’s commitment to peace and democracy, and underlined the importance of working together in the face of Putin’s ongoing aggression and to counter Russian false narratives and disinformation.</p>\n\n<p>Before the Sommet de la Francophonie, Prime Minister Trudeau participated in the ASEAN Summit in Phnom Penh, Cambodia from November 12 to 13, the G20 Summit in Bali, Indonesia from November 15 to 16, and the APEC Economic Leaders’ Meeting in Bangkok, Thailand&nbsp;from November 17 to 18. During the meetings, he worked closely with Indo-Pacific and global partners to strengthen ties and make progress on shared priorities, including expanding trade and investment, growing the economy to benefit everyone, and creating opportunities for people and businesses in Canada and around the world. He announced significant, additional funding to support Ukraine and emphasized the importance of continuing to work together to advance democracy and human rights, protect the environment, and fight climate change, and called on allies and international partners to continue supporting Ukraine and holding Russia accountable.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada is working actively with the Organisation internationale de la Francophonie in its efforts to promote and protect the French language, cultural diversity, and important common values such as peace, democracy, and human rights. We will continue to work together to strengthen Canada’s already strong ties with other Francophone countries and create opportunities for our peoples.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the third Sommet de la Francophonie attended by Prime Minister Trudeau.</li>\n\t<li>La Francophonie is a group of 88 states and governments that share French as a common language and have values in common. It represents 1&nbsp;billion people, including 300&nbsp;million Francophones, on five continents.</li>\n\t<li>During the Summit, Prime Minister Trudeau also held bilateral meetings with the Premier of Quebec, François Legault, the Prime Minister of Armenia, Nikol Pashinyan, the President of the Swiss Confederation, Ignazio Cassis, and the President of Niger, Mohamed Bazoum.</li>\n\t<li>On November 19, Minister Joly <a href=\"https://www.canada.ca/en/global-affairs/news/2022/11/canada-imposes-additional-sanctions-against-haitian-political-elites.html\">announced</a> that Canada is sanctioning three Haitian political elites, imposing a dealings prohibition on them and effectively freezing any assets they may hold in Canada.</li>\n\t<li>In Djerba, OIF member States and governments adopted key documents, including the Déclaration de Djerba, the Déclaration sur la langue française dans la diversité linguistique de la Francophonie, the Résolution sur les situations de crise, de sortie de crises et de consolidation de la paix dans l’espace francophone, the Règlement relatif à la procédure d’adhésion ou de modification de statut d’un État ou gouvernement auprès de l’OIF, and the Cadre stratégique de la Francophonie&nbsp;2023-2030.</li>\n\t<li>At the Summit, Canada promoted the value of studying in Canada and the Canadian International Development Scholarship&nbsp;2030 program. Announced earlier this year, this $80&nbsp;million program combines access to quality graduate scholarships, tailored professional training, as well as technical and professional training opportunities both in Canada and in select developing countries. The program supports the empowerment of women in recipient countries so they can become drivers of change. At least 75 per cent of the funding will be allocated to member countries of La Francophonie, including Tunisia.</li>\n\t<li>This was the 18th Sommet de la Francophonie, and the first to be held in four years.</li>\n\t<li>Canada is one of the founding countries and an active member of the institutional Francophonie, in which it has continued its strong and sustained engagement for over 50 years.</li>\n\t<li>Canada is the second-largest donor to the Francophonie’s institutions, with contributions totalling nearly $43&nbsp;million in 2021-22.</li>\n\t<li>Canada and Tunisia established diplomatic relations in 1957. The two countries enjoy deep bilateral relations, and a dynamic and diversified trade relationship. In 2020, the Tunisian diaspora in Canada represented nearly 35,000 people. Canada attracts between 2,000 and 3,000 Tunisian students annually.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/20/prime-minister-announces-significant-supports-francophonie-summit\">Backgrounder: Prime Minister announces significant supports at the Francophonie Summit in Tunisia</a></li>\n\t<li><a href=\"/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-quebec-premier-francois-legault\">Prime Minister Justin Trudeau meets with Quebec Premier François Legault</a></li>\n\t<li><a href=\"/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-prime-minister-armenia-nikol-pashinyan\">Prime Minister Justin Trudeau meets with Prime Minister of Armenia Nikol Pashinyan</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/14/prime-minister-announces-additional-military-assistance-ukraine-and\">Prime Minister announces additional military assistance for Ukraine and additional sanctions against Russia</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/16/prime-minister-advances-indo-pacific-engagement-and-shared-priorities-g20\">Prime Minister advances Indo-Pacific engagement and shared priorities at G20 Summit</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/18/prime-minister-strengthens-relations-indo-pacific-region-apec\">Prime Minister strengthens relations with the Indo-Pacific region at the APEC Economic Leaders’ Meeting</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/haiti.aspx?lang=eng\">Canadian Sanctions Related to Haiti</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.francophonie.org/\">Organisation internationale de la Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/tunisia-tunisie/index.aspx?lang=eng\">Canada and Tunisia</a></li>\n</ul></div>\n      "
}