{
  "path": "/en/news/readouts/2022/10/10/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister condemned in the strongest terms Russia’s indiscriminate strikes earlier today on Ukrainian cities that have killed innocent Ukrainian civilians and destroyed civilian infrastructure, and underlined that such egregious Russian attacks only strengthen Canada’s resolve to support Ukraine for as long as necessary. The Prime Minister expressed his condolences to President Zelenskyy on behalf of Canadians to all Ukrainians regarding the tragic deaths caused by Russia’s actions. In the face of these blatant escalations, the Prime Minister reiterated Canada’s strong ongoing support for Ukraine, including the continued provision of military, economic, and humanitarian aid.</p>\n\n<p>The Prime Minister and the President discussed Canada’s continued assistance to Ukraine and work with like-minded partners, including within the G7, to address the impacts of Russia’s illegal and unjustifiable aggression. The leaders spoke of the importance of maintaining strong unity amongst allies and continuing to impose severe costs on Russia in the face of its invasion of Ukraine and further blatant escalations.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for Canada’s significant contributions to Ukraine, and the leaders agreed to stay in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/27/statement-prime-minister-results-russias-sham-referendums-occupied\">Statement by the Prime Minister on the results of Russia’s sham referendums in occupied regions of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/28/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}