{
  "path": "/en/news/statements/2016/10/05/statement-prime-minister-canada-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p>\n<p>“World Teachers’ Day is a special day to honour the teachers who have played an essential role in our lives.</p>\n<p>“The theme of this year’s World Teachers’ Day – <em>Valuing teachers, improving their status</em> – is an important one. Teachers have the awesome responsibility and the humbling opportunity of building the society of tomorrow through the students they teach every day in their classrooms.</p>\n<p>“Enriching and educating the next generation of Canadians is no small task. It requires a lot of generosity, compassion, and hard work. Day in and day out, teachers seek new ways of engaging with students and explaining tough concepts, taking the time to understand students’ needs while empowering them to satisfy their own curiosity.</p>\n<p>“The Government of Canada is committed to providing teachers with the tools necessary to help students succeed. That is why we are undertaking a broad range of initiatives in this area, including: helping teachers and early childhood educators recover some out-of-pocket expenses for classroom supplies through a new school supply tax credit; investing in schools on First Nations reserves and in infrastructure projects at Canadian universities and colleges; providing learning opportunities for displaced children in the Middle East; and promoting cooperation in education with countries such as Mexico through Canada’s International Education Strategy.</p>\n<p>“I am exceptionally proud of having been a teacher. Regardless of whatever other job titles I hold over the course of my life, I will first and foremost be a teacher. That is why I was particularly delighted to present this year’s Prime Minister's Awards for Teaching Excellence and Excellence in Early Childhood Education.</p>\n<p>“In fact, today is also the beginning of the nomination period for the Prime Minister’s Awards. Between now and January 9, 2017, I encourage all Canadians to recognize our tremendous educators and their contributions to the future of Canada by nominating them for the #PMAwards.</p>\n<p>“On behalf of all Canadians, Sophie and I thank teachers in Canada and around the globe. You are inspirational leaders who change lives, and build a better world, every day.”</p></div>\n      "
}