{
  "path": "/en/news/statements/2016/12/09/commitment-action-prime-minister-canada-justin-trudeau-and-president",
  "pageTitle": "Commitment to action by the Prime Minister of Canada, Justin Trudeau, and the President of Inuit Tapiriit Kanatami, Natan Obed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada and the President of Inuit Tapiriit Kanatami issued a joint commitment to action today on the Pan-Canadian Framework on Clean Growth and Climate Change:</p>\n<p>“Canada and Inuit Tapiriit Kanatami recognize that Inuit and Inuit Nunangat communities are among the most vulnerable to climate change. We recognize that Inuit Nunangat comprises 35 percent of Canada’s land mass and over 50 percent of its coastline, and therefore is of significant importance in our national response. A threefold increase in average temperatures in relation to the global average, melting permafrost, extreme weather, rapidly decreasing and changing sea ice patterns, and climate related risks to Arctic wildlife sustainability are threatening the Inuit way of life and their inherent rights.</p>\n<p>“By working collaboratively, we will take action to address the risk of runaway warming in the Canadian Arctic. We will build resilience to a changing world through the creation of innovations and economic opportunities for Inuit. The federal government will also engage Inuit to address their unique circumstances, including high costs of living, challenges with food security and emerging economies.</p>\n<p>“Today we agree to move forward to ensure Inuit are full and effective partners in addressing climate change and advancing clean growth. This will be done through robust, ongoing, meaningful engagement informed by Inuit knowledge and consistent with the rights affirmed by the United Nations Declaration on the Rights of Indigenous Peoples, including the right to free, prior and informed consent.</p>\n<p>“We remain committed to the renewal of the Inuit-to-Crown relationship. Building on last year’s historic Paris Agreement, the Pan-Canadian Framework on Clean Growth and Climate Change takes meaningful action to address climate change, while respecting the rights of Inuit and recognizing that Inuit communities face unique circumstances.</p>\n<p>“Respecting a distinctions-based approach, we will form a senior-level table to address the realities and considerations of Inuit and ensure inclusive and meaningful engagement to inform action on the implementation of the Framework and broader climate change priorities.</p>\n<p>“This senior-level table will begin meeting in early 2017 and will help inform and advance climate change actions, and carry forward the views and perspectives of regional Inuit land claim organizations to intergovernmental processes. It will support the meaningful engagement of Inuit and advise on and track progress on the implementation of relevant policies and programs. Together, we will translate scientific information and Inuit knowledge into action to support adaptation, and support the sharing of information, as well reporting in support of the Framework.</p>\n<p>“The Government of Canada thanks Inuit across Inuit Nunangat for their climate leadership. There is no relationship more important to the Government of Canada than the one with Indigenous peoples. Meaningful partnerships with Inuit to support the implementation of this historic Framework is another step toward reconciliation.”</p>\n<p><br><strong>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-president-métis-national\">Statement by the Prime Minister, Justin Trudeau, and the President of the Métis National Council, Clément Chartier</a></li>\n<li><a href=\"/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-national-chief-assembly\">Statement by the Prime Minister, Justin Trudeau, and the National Chief of the Assembly of First Nations, Perry Bellegarde</a></li>\n<li><a href=\"/en/news/backgrounders/2016/12/09/process-document-ongoing-engagement-pan-canadian-framework-clean\">Process Document for Ongoing Engagement on the Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}