{
  "path": "/en/news/statements/2018/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/peacekeeping\">National Peacekeepers’ Day</a>:</p><p>“Today, on the 10th National Peacekeepers’ Day, we come together to honour Canadian peacekeepers, past and present, who have put their lives on the line to advance stability and peace around the world.</p><p>“For over six decades, Canadian peacekeepers have helped protect human rights, advance democracy and the rule of law, and offer aid to those most in need. They have helped people and societies recover after the violence of war, and made sure the voices of the most vulnerable are represented and heard in peace processes.</p><p>“Over 125,000 Canadians have participated in UN and non-UN peacekeeping missions. While their roles have evolved, our peacekeepers remain as committed as ever to meet the challenges of modern conflict. Canada has taken a leadership role to address the realities faced by peacekeepers today, who are the first and sometimes the only line of protection for vulnerable people in the world’s most conflict-affected areas.</p><p>“Through the <a href=\"/en/news/backgrounders/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use\">Vancouver Principles</a>, the <a href=\"/en/news/backgrounders/2017/11/15/elsie-initiative-women-peace-operations\">Elsie Initiative for Women in Peace Operations</a>, and a range of <a href=\"/en/news/backgrounders/2017/11/15/canadian-contributions-united-nations-peace-support-operations\">Smart Pledges</a> such as the deployment of an Air Task Force to Mali, Canada is leading efforts to end the recruitment and use of child soldiers, empower women in all aspects of peace and security, and support peace operations across the globe. Canada will continue to work with the UN to modernize peacekeeping missions, support complex peace processes, and help people rebuild their lives when conflict ends.</p><p>“Today, I call on all Canadians to recognize our country’s peacekeepers – past and present, military, police, and civilian – who have helped build peace and bring hope to those most vulnerable. They represent the very best of what it means to be Canadian.”</p></div>\n      "
}