{
  "path": "/en/news/news-releases/2022/03/07/prime-minister-concludes-successful-visit-united-kingdom",
  "pageTitle": "Prime Minister concludes successful visit to the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a productive bilateral visit to the United Kingdom (UK). The visit reinforced the strong and longstanding relationship between our two countries and our shared commitments to holding Russia accountable for the unjustifiable invasion of Ukraine, promoting international peace and security, protecting democracy, and working collectively to address global challenges including climate change.</p>\n\n<p>During his visit, Prime Minister Trudeau met with Prime Minister Boris Johnson to discuss and continue to respond to the ongoing military aggression by Russia against Ukraine. Prime Minister Trudeau announced that Canada will impose new restrictions on 10 individuals complicit in Russia’s unjustifiable invasion of Ukraine, including former and current senior government officials, and supporters of Russian leadership. These measures put further pressure on Russia’s leadership, including President Putin’s inner circle, to cease its repeated violations of human rights and Ukraine’s sovereignty and territorial integrity.</p>\n\n<p>Both leaders agreed to pursue further joint support for Ukraine by providing critical humanitarian and military aid and ensuring that Russia is held accountable for its illegal, unprovoked and unjustifiable invasion, including by referring the attacks to the International Criminal Court.</p>\n\n<p>The Prime Minister emphasized that Canada was the first country to recently revoke Russia’s and Belarus’s Most-Favoured-Nation status as a trading partner, resulting in a 35 per cent tariff rate on virtually all goods imported from the two countries. He also highlighted that Canada stands ready to help the UK replace key supply chains disrupted by sanctions imposed on Russia and Belarus.</p>\n\n<p>The Prime Ministers issued a joint statement to further strengthen and deepen national security collaboration in the critical areas of countering state threats, emerging technology and cyber challenges, and combating disinformation and efforts to undermine democracy.</p>\n\n<p>The two leaders also agreed to work together to address other key global challenges, including climate change and a strong economic recovery from the COVID-19 pandemic for both countries. Canada and the UK will strengthen cooperation in the areas of science, technology and innovation, including fields such as artificial intelligence, quantum, bio-manufacturing, clean energy sources, telecommunications, Arctic and polar research and food production.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s support for the UK to join the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) and welcomed progress towards the launch of bilateral trade negotiations to continue our close economic partnership and create jobs in both countries.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson also participated in a trilateral meeting with the Prime Minister of the Netherlands, Mark Rutte, to discuss additional responses to Russia’s blatant violation of international law and the UN Charter.</p>\n\n<p>Prime Minister Trudeau was also received in audience by Her Majesty Queen Elizabeth II at Windsor Castle. He thanked her personally for being a stabilizing force throughout the pandemic and congratulated Her Majesty on her Platinum Jubilee. The Prime Minister highlighted that Canada will celebrate her Platinum Jubilee and seven decades of Canadian achievements by hosting a range of activities throughout 2022 and support community projects and initiatives across the country.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As Russia continues its unwarranted and unjustifiable attacks on Ukraine, Canada is standing united with our European allies in supporting Ukraine and the Ukrainian people, as well as democracy and human rights everywhere. Canada and the United Kingdom share a close and longstanding partnership and I thank Prime Minister Johnson for the productive visit. Together, we will continue to strengthen that partnership and defend our shared democratic values, while creating a cleaner and more prosperous future for all.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the UK have been steadfast in supporting the response in condemning Russia’s illegal invasion of Ukraine’s sovereign territory, and imposing severe sanctions on Russia. &nbsp;</li>\n\t<li>In 2021, the United Kingdom was Canada’s third largest individual country trading partner for combined goods and services trade, with total goods and services trade of $42.2 billion. Canada exported $24.1 billion in goods and services to the UK and imported $18.1 billion in goods and services from the UK in 2021.</li>\n\t<li>Canada and the UK are the only two countries that are members of the North Atlantic Treaty Organization (NATO), the G7, the G20, and the Commonwealth.</li>\n\t<li>The Canadian and UK defence ministries maintain close working relations at all levels, both bilaterally and multilaterally through NATO.</li>\n\t<li>The UK is one the top export destinations for Canadian defence products and services.</li>\n\t<li>The Canada-United Kingdom Trade Continuity Agreement, based on the Comprehensive Economic and Trade Agreement (CETA) between Canada and the European Union, entered into force on April 1, 2021 and preserves preferential market access for both Canadian and UK businesses.</li>\n\t<li>Canada and the UK have committed to enter into new bilateral free trade agreement negotiations by April 1, 2022. Both the bilateral negotiations and the United Kingdom’s possible accession to the CPTPP present opportunities for Canada to further enhance its relationship with one of its largest trading partners.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2022/03/07/canada-united-kingdom-joint-statement\">Canada-United Kingdom Joint Statement</a></li>\n\t<li><a href=\"/en/news/statements/2022/03/07/trilateral-statement-canada-united-kingdom-and-netherlands\">Trilateral Statement by Canada, the United Kingdom, and the Netherlands</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-United Kingdom relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cuktca-acccru/index.aspx?lang=eng\">Canada-United Kingdom Trade Continuity Agreement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n</ul></div>\n      "
}