{
  "path": "/en/news/news-releases/2018/01/19/prime-minister-travel-united-states",
  "pageTitle": "Prime Minister to travel to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to the United&nbsp;States from February 7 to 10, 2018.</p><p>This visit – which includes stops in Los Angeles, San Francisco, and Chicago – will provide an opportunity for the Prime Minister to further strengthen the deep bonds that unite Canada and the United States.</p><p>In the Los Angeles area, the Prime Minister will deliver remarks at the Ronald Reagan Presidential Foundation and Institute in Simi Valley. During the remarks, he will underscore the interconnectedness of the Canada-U.S. economies.</p><p>In San Francisco, the Prime Minister will meet with local business leaders and entrepreneurs to explore opportunities for increased collaboration between our countries.</p><p>Before heading to California, the Prime Minister will meet with key officials in Chicago and deliver a speech at the University of Chicago Institute of Politics to highlight the importance of public service, and how it can contribute to a prosperous middle class and stronger Canada-U.S. economic and political ties.</p><h2>Quote</h2><blockquote><p>“Canadians and Americans know we are all better off when we work together to grow the middle class, and create more opportunities for people on both sides of the border. I look forward to meeting with government and business leaders in the United States again to explore new opportunities for collaboration and growth, so we can build a more prosperous future for people in both countries.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau last visited the United States in October 2017.</li><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade between the two countries was valued at nearly $882&nbsp;billion in 2016, and Canada is the largest secure supplier of energy to the U.S.</li><li>The two countries share the longest, secure border in the world, over which some 400,000 people and $2.4 billion worth of goods and services cross daily.</li><li>Canada buys more goods from the United States than China, Japan, and the UK combined.</li><li>Canada is the number one export destination for most American states, and cross-border trade and investment supports nearly nine millions jobs in the United States.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States Relations</a></li></ul></div>\n      "
}