{
  "path": "/en/news/news-releases/2019/05/14/prime-minister-trudeau-meets-president-grabar-kitarovic-croatia",
  "pageTitle": "Prime Minister Trudeau meets President Grabar-Kitarović of Croatia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, met with the President of Croatia, Kolinda Grabar-Kitarović. This is the first state visit to Canada by a Croatian President since the country’s independence. On January 15, 1992, Canada was among the first countries to recognize the Republic of Croatia.</p>\n\n<p>During the visit, Prime Minister Trudeau and President Grabar-Kitarović discussed how the Comprehensive Economic and Trade Agreement (CETA) is creating good, middle class jobs and new opportunities for Canadians and Croatians alike.</p>\n\n<p>The two leaders also underlined our countries’ common commitment to advancing gender equality and promoting the rights, health, and well-being of women and girls around the world.</p>\n\n<p>Finally, they discussed the strong people-to-people bonds that unite Canada and Croatia. These connections are growing an even stronger relationship between our two countries.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<footer class=\"default\">“Canada and Croatia share a long-standing friendship built on strong people-to-people bonds, a growing trade partnership, and many shared priorities and goals. We look forward to working more closely together to make gender equality a reality around the world, while creating new jobs and opportunities for people in both our countries.”<br>\n—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and Croatia established diplomatic ties in 1993. This followed Croatia’s declaration of independence in 1991 from the former Yugoslavia.</li>\n\t<li>Croatia is a valued Ally that has served alongside the Canadian Armed Forces in Afghanistan, Kosovo, and other NATO missions and plays an important role in NATO’s Enhanced Forward Presence.</li>\n\t<li>In March 2009, Canada lifted the visa requirement for Croatian citizens travelling to Canada.</li>\n\t<li>In 2018, Canada’s merchandise exports to the EU were nearly $44.5 billion, an increase of $2.9 billion (7.0%) over the year prior. This is one of several new trade deals our government has secured&nbsp;with over fifty countries giving Canadian businesses access to 1.5 billion customers.</li>\n\t<li>From October 2017 to July 2018, two-way merchandise trade between Canada and Croatia totaled $139.0 million, a 110.7% increase over the equivalent pre-CETA period.</li>\n\t<li>President Grabar-Kitarović is the Chair of the Council of Women World Leaders, an organization of current and former women presidents and prime ministers. She is Croatia’s first woman president and youngest head of state.</li>\n\t<li>An increasing number of Canadians are choosing Croatia as a tourism destination. In 2018, approximately 180,000 Canadians visited Croatia.</li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en/media/news/2019/governor-general-announces-state-visit-canada-president-croatia\">Governor General announces state visit Canada-president of Croatia</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/croatia-croatie/bilateral_relations_bilaterales/canada_croatia-croatie.aspx?lang=eng\">Canada – Croatia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/year_one-premiere_annee.aspx?lang=eng\">CETA benefits already visible a year after its entry into force</a></li>\n</ul></div>\n      "
}