{
  "path": "/en/news/readouts/2022/10/26/prime-minister-justin-trudeau-meets-african-union-commission-chairperson",
  "pageTitle": "Prime Minister Justin Trudeau meets with African Union Commission Chairperson Moussa Faki Mahamat | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Chairperson of the African Union Commission, Moussa Faki Mahamat, who is visiting Canada for the first High Level Dialogue between Canada and the African Union Commission.</p>\n\n<p>The Prime Minister highlighted the historic nature of this event as an important step in the development of a structured partnership between Canada and the African Union Commission, and as a sign of the commitment of Canada and the African Union to engage further and work closely together to address the global challenges of our time.</p>\n\n<p>The two leaders discussed shared priorities on the agenda for the Dialogue, which is co‑organized by the Minister of Foreign Affairs, Mélanie Joly, and Chairperson Faki, and is being held in Ottawa on October 27 and 28. Among those priorities are democracy, gender equality, economic growth, trade and investment, the fight against climate change, and peace and security.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s support for the economic recovery efforts of African countries in the post-pandemic context, including for the economic empowerment of women, agricultural transformation, financial inclusion, and access to market value chains. He also reiterated Canada’s readiness to support the implementation of the African Continental Free Trade Area.</p>\n\n<p>Prime Minister Trudeau and Chairperson Faki discussed their commitment to protecting and strengthening democracy and the key role of the African Union Commission in that regard. The Prime Minister emphasized Canada’s commitment to strengthening its partnerships with African countries, institutions, and stakeholders to advance democracy and protect human rights.</p>\n\n<p>The two leaders noted the urgency to act in response to the climate change crisis, which disproportionately impacts African countries. They discussed Canada’s commitment to supporting African states in their climate change mitigation and adaptation strategies. A few days ahead of COP27, which will be held in Egypt, the Prime Minister emphasized that Canada recognizes the importance of the issues that will be discussed at the conference, and he reiterated Canada’s commitment to contribute to its success.</p>\n\n<p>Prime Minister Trudeau commended the Commission’s leadership role toward resolving peace and security issues on the African continent and expressed Canada’s determination to continue its partnership with the Commission in seeking and implementing solutions to these issues. Prime Minister Trudeau and Chairperson&nbsp;Faki discussed the situation in Ethiopia and the Horn of Africa, security and humanitarian challenges in the Sahel, and the threat of terrorism and food insecurity across the continent.</p>\n\n<p>The two leaders talked about the consequences of Russia’s illegal invasion of Ukraine, which are impacting the entire globe. Prime Minister Trudeau underscored the fact that the contributions made by African nations in multilateral forums such as the United Nations in condemning Russia’s violations of international law are important and very much appreciated. The Prime Minister noted that Canada recognizes the significant and lasting impact of the crisis on African countries and that he remains determined to work with Africans to meet those challenges.</p>\n\n<p>In closing, Prime Minister Trudeau and Chairperson Faki indicated they are very confident that the first High Level Dialogue being held in Ottawa this week will yield productive discussions to advance the common interests of Canada and the African Union and lay the foundation for a strong partnership that will benefit Canadians and Africans in the years to come.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/21/african-union-commission-chairperson-moussa-faki-mahamat-visit-canada\">African Union Commission Chairperson Moussa Faki Mahamat to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">Prime Minister Trudeau announces Canadian support to address global food security crisis</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/canada-announces-new-international-climate-finance-funding-for-nature-based-solutions.html\">Canada announces new international climate finance funding for nature-based solutions </a></li>\n\t<li><a href=\"https://au.int/en\">African Union</a></li>\n</ul></div>\n      "
}