{
  "path": "/en/news/news-releases/2018/04/27/prime-minister-welcomes-twenty-fifth-annual-report-public-service",
  "pageTitle": "Prime Minister welcomes the Twenty-Fifth Annual Report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Earlier this week, the Prime Minister, Justin Trudeau, welcomed the Twenty-Fifth Annual Report to the Prime Minister on the Public Service of Canada from Michael Wernick, Clerk of the Privy Council and Head of the Public Service.</p><p>The report highlights exciting work taking place across the federal government, in all regions of the country, and around the world. It outlines new, innovative approaches being used by departments, agencies, teams, and individual public servants to make services more accessible, deliver on the Government of Canada’s agenda, and achieve results that make a real difference to Canadians.</p><p>The report also recognizes the unacceptable hardships caused by the Phoenix pay system, as well as the tireless efforts of public servants to stabilize the system, and resolve pay issues as quickly as possible.</p><p>Additionally, the report underlines the Public Service’s ongoing efforts to attract and retain a diverse and inclusive workforce, improve mental health and work-place well-being, and encourage increased innovation and collaboration.</p><h2><b>Quote</b></h2><blockquote><p>“I welcome this report and encourage Canadians to read or view the stories it includes of public servants who are working hard on their behalf. Canada should be proud of its world-class public service. I look forward to working with the Clerk to ensure the public service continues to innovate and adapt to meet the needs of all Canadians.”<br> — <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Michael Wernick was appointed as the 23rd Clerk of the Privy Council on January 22, 2016, by the Prime Minister to help the government deliver its agenda and to renew the Public Service.</li><li>The Government of Canada first introduced the Annual Report to the Prime Minister on the Public Service of Canada – a requirement under section 127 of the Public Service Employment Act – in 1992.</li><li>The Public Service of Canada is the country’s largest employer, with approximately 262,000 employees.</li></ul><h2><b>Associated link</b></h2><ul><li><a href=\"https://www.canada.ca/en/privy-council/corporate/clerk/publications/twenty-fifth-annual-report-prime-minister-public-service.html\">Twenty-Fifth Annual Report on the Public Service of Canada</a></li></ul></div>\n      "
}