{
  "path": "/en/news/statements/2020/10/12/statement-prime-minister-thanksgiving",
  "pageTitle": "Statement by the Prime Minister on Thanksgiving | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Thanksgiving:</p>\n\n<p>“Today, across the country, Canadians will mark Thanksgiving. It is a time to celebrate the harvest season, provide thanks for our many blessings, and give back to our communities.</p>\n\n<p>“Despite the many recent hardships we've been through in the past year, as we deal with the impacts of the global COVID-19 pandemic, there are still many reasons for all of us to be grateful – especially for our family, friends, and loved ones. There are also countless others in our communities, and across the country, who we should be showing thanks for this year. &nbsp;</p>\n\n<p>“We thank our frontline workers who are working tirelessly every single day to keep us healthy and safe. They include the paramedics who race to be by our side in an emergency, the farmers who make sure that we have food on the table, the nurses and doctors who save lives, the frontline public health workers tirelessly managing cases and tracing a growing number of contacts, and the grocery clerks who keep the shelves stocked at our local stores. These are just some of our everyday heroes to which we owe a debt of gratitude, in these challenging times.</p>\n\n<p>“We also must give thanks to our brave members of the Canadian Armed Forces who make sacrifices around the world to protect us. This year, they provided unprecedented care here at home when they, along with members of the Canadian Red Cross, were there to support Canadian seniors, and saved countless lives in doing so.</p>\n\n<p>“And, let’s not forget to recognize all the volunteers across the country who have stepped up to help a neighbour or lend a hand to those less fortunate, since the beginning of the pandemic.</p>\n\n<p>“Thanksgiving is also a reminder to show compassion to those in need. It is an opportunity to appreciate our communities, and find new ways to give back and be there for one another.</p>\n\n<p>“This year, celebrations may look a bit different from previous years. The increase of COVID-19 cases across the country means we need to continue to keep our social circles small, wash our hands, stay two metres apart, and wear a mask. And another way you can help protect yourself and others in your community from the virus, is by downloading and using the <a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert.html\">COVID Alert app</a>. By doing all of these things, we can keep each other safe and healthy.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish everyone a very happy Thanksgiving. This year, let’s be thankful, grateful, and above all, united in our efforts to beat COVID-19. I hope your day is filled with good food and virtual celebrations with friends and family.”</p></div>\n      "
}