{
  "path": "/en/news/news-releases/2018/07/17/prime-minister-announces-major-investment-improve-safety-and-reduce",
  "pageTitle": "Prime Minister announces major investment to improve safety and reduce congestion on Trans-Canada Highway in Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Commuting to work, visiting loved ones, enjoying a vacation – highways help Canadians get to where they need to go. They connect our communities and help businesses move goods to markets across the country and around the world.</p><p>The Prime Minister, Justin Trudeau, today announced a major investment of $90 million to improve safety, reduce congestion, and increase traffic capacity on the Trans-Canada Highway in northeastern Nova Scotia.</p><p>The project, led by the Government of Nova Scotia, will improve a 38-kilometre stretch of Highway 104, from Sutherlands River to Antigonish, by twinning and upgrading 28 kilometres of the highway. It will also include a new 10-kilometre, four-lane highway, to be connected to the existing roadway once completed. The Government of Nova Scotia is contributing $195 million to the project.</p><p>The project will create good, middle class jobs during construction, and accommodate future increases in traffic. The project will also connect a vital trade and transportation corridor from the New Brunswick border to Newfoundland and Labrador via the Marine Atlantic Ferry Service at North Sydney, Nova Scotia.</p><h2>Quotes</h2><blockquote><p>“Twinning and upgrading Highway 104 is about improving road safety, creating good, middle class jobs, and making it easier for people – and products – to move across the province and the country. Our government will continue to listen to communities, and make historic investments in the infrastructure they need, today and for the future.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our government is investing in Canada’s economy by improving our trade and transportation corridors. We’re supporting projects to more efficiently move commercial goods to market and people to their destinations, stimulate economic growth, create quality middle-class jobs, and ensure that Canada’s transportation networks remain competitive and efficient.”<br><cite>—The Hon. Marc Garneau, Minister of Transport</cite></p></blockquote><blockquote><p>“Transportation and distribution of goods are a vital part of our local, regional and national economies. This crucial investment will do more than just improve the movement of goods and people; it will save lives by significantly increasing the safety of all motorists on this key section of Nova Scotia highway.”<br><cite>—</cite><cite>The Hon. Scott Brison, President of the Treasury Board and Member of Parliament for Kings—Hants</cite></p></blockquote><blockquote><p>“Nova Scotians want us to improve the safety of our roads and we are committed to doing just that. Highway 104 is an essential piece of infrastructure that connects communities in our province, and Nova Scotia to the rest of the country. I'm pleased our federal partners are working with us on this project that will make the highway safer and create jobs.”<br><cite> —The Hon. Stephen McNeil, Premier of Nova Scotia</cite></p></blockquote><blockquote><p>“Twinned highways save lives, create jobs and make our transportation system more efficient and safe for business and the travelling public. Having worked on this project from my first day in office, I am incredibly pleased to see the Highway 104 twinning receive this funding. I look forward to seeing this highway completed in the near future.”<br><cite>—Sean Fraser, Member of Parliament for Central Nova</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This funding is provided through the <a href=\"http://www.tc.gc.ca/en/programs-policies/programs/national-trade-corridors-fund.html\">National Trade Corridors Fund</a>, which supports projects that:<ul><li>help the transportation system withstand the effects of climate change and adapt to new technologies and innovation;</li><li>address transportation bottlenecks and congestion along Canada’s trade corridors;</li><li>support economic activity and the physical movement of goods and people in Canada; and</li><li>improve the movement of Canadian goods to markets around the world through our ports, airports, roads, railways, intermodal facilities, bridges, and border crossings.</li></ul></li><li>Provincial, territorial, and municipal governments, Indigenous groups, not-for-profit and for-profit private-sector organizations, federal Crown Corporations, Canadian Port Authorities, and National Airport System Airport Authorities are all eligible for funding under the National Trade Corridors Fund.</li><li>As announced in November 2016 and detailed in Budget 2017, the Government of Canada is investing $10.1 billion over the next 11 years in trade and transportation projects.</li><li>Transportation is an important element of Canada’s trade with other countries. In 2017, total international merchandise trade amounted to $1.1 trillion. The United States continued to be Canada’s top trade partner, with $703 billion in trade ($415 billion exported, $288 billion imported), accounting for 63.5 per cent of total Canadian trade in 2017.</li><li>In May 2018, the Government of Canada announced $350,000 for a study that will explore viable options to address climate change impacts on the Chignecto Isthmus Trade Corridor between New Brunswick and Nova Scotia. The Chignecto Isthmus is an economically important transportation corridor that carries an estimated $50 million per day in trade.</li><li>In April 2018, the Government of Canada reached an agreement with Nova Scotia worth $828 million for infrastructure funding over the next ten years. This long-term support will provide unprecedented investments across four priority areas: public transit; green infrastructure; community, culture and recreation infrastructure; and northern and rural community infrastructure.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/tt-ct-eng.html\">Investing in Canada Plan</a></li><li><a href=\"https://www.canada.ca/en/transport-canada/news/2018/05/national-trade-corridors-fund.html\">National Trade Corridors Fund</a></li><li><a href=\"https://www.tc.gc.ca/eng/trade-transportation-corridors-initiative.html\">Trade and Transportation Corridor Initiative</a></li><li><a href=\"https://www.tc.gc.ca/eng/future-transportation-canada.html\">Transportation 2030</a></li></ul></div>\n      "
}