{
  "path": "/en/news/statements/2021/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/observances/indigenous-day\">International Day of the World’s Indigenous Peoples</a>, we celebrate the vibrant and diverse cultures, languages, and traditions of Indigenous peoples here in Canada and around the world. We also reflect on the contributions they have made to societies everywhere, and continue to commit ourselves to ensure that Indigenous rights are recognized and respected.</p>\n\n<p>“Canada was built on the ancestral land of Indigenous peoples. First Nations, Inuit, and Métis have shaped our history and identity as a country, yet for centuries, they have endured systemic racism and discrimination. As Canadians, we must confront our mistakes, learn from them, and work to right past and current wrongs.</p>\n\n<p>“The theme of this year’s International Day of the World’s Indigenous Peoples is ‘Leaving no one behind: Indigenous peoples and the call for a new social contract’. It invites us to take a hard look at our existing systems, to engage and partner with Indigenous communities through a true nation-to-nation, Inuit-Crown, and government-to-government relationship, and to take meaningful steps to end the injustices and challenges these communities continue to face today. By working together, we can build a new social contract that recognizes Indigenous peoples’ inherent right to self-determination and self-government, advances social and economic equality, and protects Indigenous laws, lands, cultures, and languages.</p>\n\n<p>“As Canadians continue to learn about the impacts of colonialism and come to terms with the tragic findings of remains of children near former residential schools across the country, we acknowledge that we still have a lot of work to do to advance reconciliation. Last month, the Government of Canada signed a historic Coordination Agreement with Cowessess First Nation – Treaty 4 Territory – and the Province of Saskatchewan on child and family services. This agreement ensures the community can effectively exercise their jurisdiction and make their own decisions about what is best for their children and families. Earlier this year, we also announced new funding to fully implement the Truth and Reconciliation Commission’s Calls to Action, including to address the systemic racism and barriers faced by Indigenous peoples in Canada’s legal system. Seventy-six of the report’s 94 Calls to Action fall under the sole or shared responsibility of the federal government, and over 80 per cent of them have been completed or are well underway. We will continue to work in consultation and partnership with Indigenous peoples, provinces, territories and other partners to address the Calls to Action, bring about transformative change, and improve outcomes for Indigenous communities. We are also committed to continuing to provide Indigenous communities across the country with the resources they need to address the terrible legacy of residential schools, to honour the children who never returned home, and to support survivors, their families, and communities affected.</p>\n\n<p>“Last June, the Parliament passed the&nbsp;<em>United Nations Declaration on the Rights of Indigenous Peoples Act</em>. This legislation is a historic step forward in Canada’s relationship with Indigenous peoples. Developed with Indigenous partners and organizations, it creates a clear path toward fully recognizing, respecting, and protecting Indigenous rights and equality. Implementing the Declaration will help us remove institutional barriers, build stronger relationships, close socio-economic gaps, and promote greater prosperity for Indigenous peoples – and all Canadians. This work will complement other important initiatives already underway, including legislative commitments around health and community policing, and the development of an Indigenous Justice Strategy. It also builds on the recent launch of the Federal Pathway, the Government of Canada’s response to the National Inquiry into Missing and Murdered Indigenous Women and Girls. The Federal Pathway is providing the government with a comprehensive roadmap to address the root causes of gender-based violence against Indigenous peoples along four interconnected themes: culture, health and wellness, human safety and security, and justice. This important work will allow for the creation of fair, equitable, and inclusive systems that respect the rights of Indigenous peoples, and protect women, girls, and two-spirit and LGBTQ people now and in the future.</p>\n\n<p>“As we continue the fight to end COVID-19, we also acknowledge that many Indigenous communities have been disproportionately affected by the pandemic. We are committed to continuing to work closely with Indigenous health care professionals and communities, provinces, and territories to address the health, economic, and social impacts of the pandemic through distinctions-based, community-led solutions.</p>\n\n<p>“Canada cannot move forward as a country if First Nations, Inuit, and Métis continue to be held back by colonial structures, systemic racism, and discrimination. As we celebrate the contributions Indigenous communities have made in forming the nations we know today, we continue to work with them in full partnership to advance reconciliation in a tangible way and ensure Indigenous peoples can succeed and prosper.”</p></div>\n      "
}