{
  "path": "/en/news/news-releases/2016/03/29/prime-minister-attend-nuclear-security-summit-washington",
  "pageTitle": "Prime Minister to attend Nuclear Security Summit in Washington | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Washington, D.C. to attend the 2016 Nuclear Security Summit, from March 31 to April 1. &nbsp;</p>\n<p>Canada supports a strong multilateral framework for the global fight against nuclear terrorism – one of the gravest threats to international security.</p>\n<p>The 2016 Nuclear Security Summit aims to bring the international community together in order to combat the threat of nuclear terrorism around the globe. The Summit will provide a forum for world leaders to reinforce commitments, at the highest levels, to enhance the security of their nuclear and radiological materials and combat nuclear terrorism.</p>\n<p><strong>Quote</strong></p>\n<p>“We are committed to working with the international community to prevent nuclear terrorism – a very real social, political, economic, and environmental threat. We must take the necessary steps to enhance our collective security so that Canadians and others around the world can feel safe and free in their communities.”<br> <em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The 2016 Nuclear Security Summit will be the fourth and final summit. It has been characterized as a “transition Summit”.</li>\n<li>It will focus on ensuring that the achievements of the Summit process are sustained and that work continues in the years ahead to strengthen the international nuclear security architecture.</li>\n<li>The first Nuclear Security Summit was held in Washington, D.C. in 2010, and was followed by additional Summits in Seoul in 2012 and The Hague in 2014.</li>\n</ul>\n<p><strong>Associated Link</strong></p>\n<ul>\n<li><a href=\"http://www.nss2016.org/\">2016 Nuclear Security Summit</a></li>\n</ul></div>\n      "
}