{
  "path": "/en/news/statements/2022/06/12/statement-prime-minister-philippine-independence-day",
  "pageTitle": "Statement by the Prime Minister on Philippine Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Philippine Independence Day:</p>\n\n<p>“Today, we join Filipino communities across Canada and around the world to celebrate the 124th<sup> </sup>anniversary of Philippine independence.&nbsp; &nbsp;</p>\n\n<p>“Canada’s relationship with the Philippines is rooted in generations of close ties between our people. Since we established diplomatic relations in 1949, we have strengthened our bond through close collaboration bilaterally, in multilateral institutions, such as the United Nations and the World Trade Organization, and with partners within the Association of Southeast Asian Nations. Canada will continue to work with the Philippines on shared priorities such as deepening trade and driving economic growth, strengthening peace and security globally, and advancing human rights for the benefit of people on both sides of the Pacific.</p>\n\n<p>“From Toronto to Iqaluit, nearly one million people of Filipino descent call Canada home. As we mark Filipino Heritage Month throughout June, I encourage all Canadians to recognize the important contributions Filipino communities have made – and continue to make – to our country. As we continue to keep Canadians safe and protected from COVID-19, we recognize the many members of the Filipino community who play essential roles on the frontlines of the pandemic response and continue to work to keep our most vulnerable healthy. Your contributions will not be forgotten.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to all those celebrating Philippine Independence Day here in Canada, and around the world.</p>\n\n<p>“Maligayang Araw ng Kalayaan!”</p></div>\n      "
}