{
  "path": "/en/news/statements/2017/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p><p>“Seventy years ago, delegates from around the world came together to adopt the Universal Declaration of Human Rights, which declares everyone is ‘born free and equal in dignity and rights.’ We take this occasion to celebrate our very own John Humphrey, who helped draft this revolutionary document, and to recommit ourselves to a more just and equal world.</p><p>“The rights recognized in the Declaration are the values enshrined in the Canadian Charter of Rights and Freedoms – now in its <a href=\"http://www.justice.gc.ca/eng/csj-sjc/charter-charte/index.html\">35<sup>th&nbsp;</sup>year</a>. They are essential to our identity and success as a country. As Canadians, we share no greater task than to make sure our protection of human rights is ever-advancing.</p><p>“While we have made significant progress in recent years, we still have a lot of work to do. Far too many people continue to be denied their fundamental human rights, simply because of who they are. At home, our work is incomplete, especially for Indigenous Peoples, and others as well. The Government of Canada is working hard to address historical wrongs and correct past injustices. Every day, we strive toward a country that lives up to its ideals – for all individuals who call Canada home.</p><p>“We recently delivered an <a href=\"/en/news/backgrounders/2017/11/24/statement-apology-behalf-government-canada-former-students\">apology</a> to former students of Newfoundland and Labrador residential schools. We also <a href=\"/en/news/speeches/2017/11/28/remarks-prime-minister-justin-trudeau-apologize-lgbtq2-canadians\">apologized</a> for federal legislation, policies and practices that led to the systemic oppression and discrimination of LGBTQ2 Canadians, and introduced legislation to put into place a process to permanently destroy the records of unjust convictions related to consensual sexual activity between same-sex partners.</p><p>“In addition, we passed <a href=\"https://www.canada.ca/en/department-justice/news/2017/06/statement_by_ministerwilson-raybouldonpassageofbillc-16insenatea.html\">legislation</a> that will provide Canadians explicit protection from discrimination and hate crimes based on their gender identity or expression, and affirm their equal status in Canadian society. We also became co-chair of the Equal Rights Coalition, a network of 35 governments committed to promoting and protecting the rights of LGBTQ2 persons in collaboration with international organizations and civil society around the world. Next summer, Canada will host the next Global LGBTI Human Rights and Inclusive Development Conference – the largest-ever intergovernmental meeting on LGBTI rights – in Vancouver.</p><p>“Current and future generations still await the full promise of a just and equal Canada. Today, I call on all Canadians to join together in pursuit of a world where everyone – no matter their identity, beliefs, or circumstances – is born free and equal in dignity and rights.”</p></div>\n      "
}