{
  "path": "/en/news/statements/2021/05/29/statement-prime-minister-international-day-united-nations-peacekeepers",
  "pageTitle": "Statement by the Prime Minister on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of United Nations Peacekeepers:</p>\n\n<p>“Today, we honour United Nations (UN) peacekeepers, past and present, who have served at great personal risk and sacrifice to promote peace, restore stability, and protect those most in need. We also pay tribute to those who have lost their lives in the pursuit of peace.</p>\n\n<p>“For over 70 years, UN peacekeepers have worked tirelessly every day to provide essential help to those affected by conflicts, and to help people and communities rebuild after violence and war and navigate the road from conflict to peace. While carrying out their duties, they often find themselves in dangerous situations. Since the start of the global COVID-19 pandemic, UN peacekeepers have faced greater challenges and threats than ever before. Not only are they coping with the impacts of the pandemic, but they also have the continued responsibility to support and protect the people in the countries in which they serve.</p>\n\n<p>“This year’s theme, ‘The road to a lasting peace: Leveraging the power of youth for peace and security’, reminds us that tens of thousands of peacekeepers between the ages of 18 and 29 are currently deployed around the world in 12 different operations, playing a major role in protecting those most vulnerable and building sustainable peace.</p>\n\n<p>“As a strong supporter of UN peacekeeping operations, Canada has taken a leadership role to meet the changing nature of missions and prepare for the future of peacekeeping. With our international partners, we continue to develop new approaches to better protect children, increase the participation of women in peace operations, and help peacekeepers meet the new challenges.</p>\n\n<p>“That is why we launched and support the implementation of the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes-pledge-engageons.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>. To date, our efforts have led to 101 UN Member States joining Canada in endorsing the Vancouver Principles, and we continue to work with the UN and partners to ensure that the Principles are integrated into their policies and practices.</p>\n\n<p>“As part of our support to UN peacekeeping operations and of our work to implement the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/women_peace_security-femmes_paix_securite.aspx?lang=eng\">Women, peace and security agenda</a>, Canada also launched the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a> to increase the meaningful participation of uniformed women in UN peace operations, with a focus on police and military roles. Canada is working with partners across the UN system, member states, think tanks, and civil society to identify effective ways to eliminate barriers to women’s participation and support a more inclusive future for UN peace operations.</p>\n\n<p>“Canada is also continuing to support UN peace operations around the world through deployments of military, police and civilian personnel, specialized capabilities and substantial financial contributions, including the work that we have completed as part of the United Nations Multidimensional Integrated Stabilization Mission in Mali to promote peace, security, and gender equality in the Sahel region. We will continue to work with the UN and our partners to support, reform, and modernize UN peacekeeping to respond to our changing global environment.</p>\n\n<p>“On this important day, I invite all Canadians to join me in thanking UN peacekeepers who sacrifice so much to help make the world a better place. Today, we recognize their courage, their sacrifices, and their tireless work in the service of peace.”</p></div>\n      "
}