{
  "path": "/en/news/news-releases/2019/06/20/prime-minister-announces-enhanced-cooperation-united-states",
  "pageTitle": "Prime Minister announces enhanced cooperation with the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Washington, D.C., where he met with United States President Donald J. Trump and committed to closer collaboration on a number of priorities.</p>\n\n<p>The Prime Minister and President discussed recent progress toward the ratification of the new North American Free Trade Agreement, which will create good, middle class jobs and new opportunities for people in both countries. They also exchanged views on trade issues, including softwood lumber, and agreed that Canada and the U.S. should work together to safeguard and expand trade between our two countries.</p>\n\n<p>The two leaders discussed rising tensions between the U.S. and Iran, including reports of Iran shooting down a U.S. drone in international airspace.</p>\n\n<p>The Prime Minister raised the issue of China’s wrongful detention of two Canadian citizens, Michael Kovrig and Michael Spavor. The two leaders called for their immediate release.</p>\n\n<p>The leaders also discussed ways to improve mineral security and ensure future competitiveness of their minerals industries, and work more closely to ensure secure and reliable supply chains. To that end, they announced that Canada and the U.S. will develop a joint action plan on critical minerals collaboration.</p>\n\n<p>The Prime Minister highlighted the importance of Canadian uranium to North American energy security, and underscored how Canada has been a reliable supplier of uranium to the U.S. for over 75 years.</p>\n\n<p>The Prime Minister and President emphasized their shared concern for increasing opioid-related deaths on both sides of the border, and announced that Canada and the U.S. will work more closely together to find solutions to the opioid crisis, including through the North American drug dialogue and multilateral organizations. The two countries will also boost their collaboration to combat opioid trafficking, including through law enforcement cooperation and the sharing of information and best practices.</p>\n\n<p>Prime Minister Trudeau and President Trump announced their intention to implement the new preclearance agreement this summer, which will make it possible to extend preclearance for travelers at land, rail, and marine facilities in both countries, as well as at additional airports, and will enable the preclearance of cargo.</p>\n\n<p>They also reaffirmed their commitment to implement the Entry/Exit initiative at the land border this summer, which will provide a streamlined and more secure process when crossing our shared land border, while protecting individual privacy and rights.</p>\n\n<p>The leaders also highlighted our countries’ close collaboration in space. The Prime Minister underlined Canada’s partnership with the U.S. on the Lunar Gateway, which will push the bounds of human space exploration. The project represents the first step to future missions to Mars and beyond.</p>\n\n<p>They also discussed ongoing reform efforts in Ukraine, rising tensions in the Persian Gulf, and the crisis in Venezuela, including Cuba’s role to play in stabilizing the crisis. The two leaders reiterated their support for Interim President of Venezuela, Juan Guaidó, and their shared desire for a peaceful, Venezuelan-led transition through free and fair elections as soon as possible. The Prime Minister and President also discussed concerns around human rights violations in Nicaragua.</p>\n\n<p>The two leaders also discussed the upcoming G20 Leaders’ Summit in Osaka, Japan, and agreed to continue conversations from today’s meeting at the Summit.</p>\n\n<p>During the visit, Prime Minister Trudeau also met with members of the U.S. House of Representatives in a meeting hosted by Nancy Pelosi, Speaker of the United States House of Representatives. Together, they discussed the ratification of the new NAFTA, relations with China, climate change, and Canada-U.S. cooperation on security and defence.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today’s meeting with President Trump was productive and far-reaching. It was a chance to talk about how we can continue to work together to improve the lives of working people in both our countries, and to set a foundation for closer collaboration in several areas – from energy security to the opioid crisis to space exploration. I look forward to building on the progress we made today at next week’s G20 Summit in Osaka.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the United States share the longest, secure border in the world, over which some 384,000 people and $2.6 billion worth of goods and services cross daily.</li>\n\t<li>Bilateral merchandise trade between the two countries increased 5.7 per cent to $742.9&nbsp;billion in 2018.</li>\n\t<li>Canada buys more goods from the United States than China, Japan, and the United Kingdom combined.</li>\n\t<li>The U.S. is the single greatest investor in Canada. In 2018, U.S. stock investment in Canada was $406 billion, representing nearly half of all investment in Canada.</li>\n\t<li>Energy is the largest contributor to Canada-U.S. bilateral trade, equal to 20 per cent of trade in goods or $151 billion in 2018.</li>\n\t<li>Canada and the U.S.’ energy systems are highly integrated, with 74 oil and natural gas pipelines and 34 electrical transmission lines transporting energy in both directions.</li>\n\t<li>In June 2019, Canada announced its approval for the Manitoba-Minnesota Transmission Project, which will provide a vital link for the export of Manitoba hydroelectricity while supporting increased energy security in Minnesota.</li>\n\t<li>Trade between NAFTA members – Canada, the United States, and Mexico – was valued at nearly $1.5 trillion in 2018.</li>\n\t<li>Canada opposes the U.S.’s decision not to suspend Title III of the Cuban Liberty and Democratic Solidarity (LIBERTAD) Act of 1996, commonly known as the Helms-Burton Act.</li>\n\t<li>Canada works closely with the U.S. on Arctic security, and remains committed to exercising the full extent of its rights and sovereignty over its Arctic waters, including the Northwest Passage.</li>\n\t<li>Critical minerals – used for defence, manufacturing, and high tech industries – are essential to the economies and national security of Canada and the United States. Canada’s rich minerals sector is well-positioned to contribute significantly to North American requirements, and to benefit from strategic trade and investment opportunities.</li>\n\t<li>Time and again, Canada and the U.S. have come to each other’s assistance as neighbours and friends in times of need, including in response to natural disasters. In the last five years, with an increase in winter and hurricane storm impacts on the electric grid in the U.S., more than one thousand teams of Canadian line workers and equipment have been deployed to help restore power to Americans in more than a dozen states.</li>\n\t<li>In addition to Nancy Pelosi, the Prime Minister met with the following members of the U.S. House of Representatives: Steny Hoyer, Majority Leader; Kevin McCarthy, Republican Leader; Jim Clyburn, Majority Whip; Steve Scalise, Minority Whip; Hakeem Jeffries, Democratic Caucus Chairman; Liz Cheney, Republican Conference Chairwoman; Eliot Engel, Chairman, Committee on Foreign Affairs; Mike McCaul Ranking Member, Committee on Foreign Affairs; and Katherine Clark, Vice Chair, House Democratic Caucus.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/country-pays/united_states-etats_unis/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}