{
  "path": "/en/news/news-releases/2018/09/11/new-canada-goose-facility-creates-hundreds-jobs-winnipeg",
  "pageTitle": "New Canada Goose facility creates hundreds of jobs in Winnipeg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed Canada Goose’s announcement of a third clothing manufacturing facility in Winnipeg, which will create 700 new jobs over the next three years.</p><p>At 128,000 square-feet, the new facility is the largest of the company’s seven facilities. It will increase Canada Goose’s production capacity, respond to growing global demand for its apparel, and expand its sewing training school program. Since 2015, the program has provided training to more than 750 cut and sew workers, helping them develop the skills they need to have successful careers in the company.</p><p>Canada Goose manufactures all of its core products in Canada and exports them to more than 38 countries. The company has built a strong reputation around the world for its “Made in Canada” apparel, known for its style, quality, technical innovation, and functionality.</p><h2>Quotes</h2><blockquote><p>“Canada Goose is a global success story of entrepreneurship because it has never forgotten its roots. The company is committed to a product that is distinctly Canadian, and every year employs more and more people across the country. We are pleased that Canada Goose has decided to once again expand in Winnipeg, and create hundreds of new jobs for Canadians. I know Canada Goose will continue to be an example of how far Canada and Canadians can go, all around the world.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Made in Canada isn’t a slogan for Canada Goose – our commitment to growing production capacity in Canada is stronger than ever. We are proud of our role in creating manufacturing jobs in Canada, and to be doing it in Winnipeg – a city we are privileged to call home.”<br><cite>—Dani Reiss, President &amp; CEO, Canada Goose</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Established in 1957, Canada Goose currently has more than 1,000 employees at its two existing factories in Winnipeg and nearly 3,000 employees around the country.</li><li>With the opening of this new facility, Canada Goose will have seven manufacturing facilities in Canada: three in Manitoba, three in Ontario, and one in Quebec.</li><li>Canada Goose employs twenty percent of the cut and sew labour industry in Canada.</li><li>In its next phase of global retail expansion, Canada Goose will open five new stores this fall in Beijing, Hong Kong, Short Hills, Montréal, and Vancouver. The company currently operates stores in seven cities including London, Toronto, New York, Boston, Chicago, Calgary, and Tokyo.</li></ul></div>\n      "
}