{
  "path": "/en/news/news-releases/2019/03/27/secure-and-dignified-retirement-canadian-seniors",
  "pageTitle": "A secure and dignified retirement for Canadian seniors | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>All Canadian seniors deserve a secure and dignified retirement, free of financial worries. The Government of Canada is working to support seniors so they can enjoy their retirement years and stay active and involved in their communities.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Scarborough, Ontario, and highlighted Budget&nbsp;2019 measures to improve the quality of life for Canada’s seniors now, and for generations to come.</p>\n\n<p>Through Budget 2019, the government is proposing new measures so that Canadian seniors can enjoy a more financially secure retirement. These measures include:</p>\n\n<ul>\n\t<li>an increase to the Guaranteed Income Supplement (GIS) earnings exemption so that low-income seniors who choose to keep working can keep more of their hard-earned income</li>\n\t<li>pro-active enrollment in the Canada Pension Plan for contributors who are 70 years old or older to make sure they are receiving the pension payments they are entitled to</li>\n\t<li>increased protection of workplace pensions earned by seniors in the event of corporate insolvency</li>\n</ul>\n\n<p>To better support Canadians living with dementia and their families, Budget 2019 also proposes an investment of $50 million over five years to implement Canada’s first ever National Dementia Strategy. The strategy will seek to increase awareness and reduce stigma, develop treatment guidelines and best practices for early diagnosis, and help us better understand dementia and its effects on our communities.</p>\n\n<p>In addition, Budget 2019 proposes increased funding for the New Horizons for Seniors Program to help seniors thrive and stay connected to their communities. The new funding would support projects in communities across the country, from providing fitness equipment for seniors’ centres, to offering financial literacy classes, to creating volunteer opportunities.</p>\n\n<p>With measures like these, this year’s budget will help make sure that all Canadian seniors can spend less time worrying about making ends meet and more time enjoying the secure and dignified retirement they deserve.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada’s seniors have worked hard to support their families, build strong communities, and grow our economy. Their knowledge, skills, and experience are the cornerstones that have built our businesses and our country. Now, with this year’s budget, we’re making sure they have the support they need, and investing to provide Canadian seniors with the freedom and peace of mind they deserve in their retirement years.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2019, <em>Investing in the Middle Class</em>, is the government’s plan to create more good well-paying jobs, put homeownership within reach of more Canadians, help working people get the training they need to succeed, support seniors, and lay the foundation for national pharmacare.</li>\n\t<li>To allow low-income older Canadians to take home more money while they work, Budget 2019 proposes to introduce legislation that would enhance the GIS earnings exemption beginning in July 2020.</li>\n\t<li>It is estimated that with the proposed changes to CPP enrollment, approximately 40,000 individuals over the age of 70 who are currently missing out would begin to receive an average monthly retirement pension of $302 in 2020. In addition, approximately 1,500 Canadian seniors turning age 70 in 2020 will be proactively enrolled, receiving an estimated average monthly retirement pension of $645. By 2040, as many as 4,000 people could be proactively enrolled each year.&nbsp;&nbsp;</li>\n\t<li>Budget 2019 proposes new measures that will make insolvency proceedings fairer, more transparent and more accessible for pensioners and workers. This will be accomplished in part by requiring everyone involved to act in good faith, and by giving courts greater ability to review payments made to executives in the lead up to insolvency.</li>\n\t<li>Budget 2019 also proposes significant additional funding of $100 million over five years, with $20 million per year ongoing, for the New Horizons for Seniors Program.</li>\n\t<li>Since 2016, the Government of Canada has worked to provide seniors with a more secure and dignified retirement, including by:\n\t<ul>\n\t\t<li>appointing a Minister of Seniors to help better understand the needs of older Canadians and ensure programs and services are designed to respond to those needs</li>\n\t\t<li>boosting benefits for nearly 900,000 low-income seniors and lifting about 57,000 out of poverty by increasing GIS top-up payments for Canada’s most vulnerable seniors</li>\n\t\t<li>committing $6 billion over 10 years for home care, to allow provinces and territories to improve access to home, community, and palliative care services</li>\n\t\t<li>restoring the eligibility age for Old Age Security and GIS benefits to 65, putting thousands of dollars back in the pockets of Canadians as they become seniors&nbsp;&nbsp;</li>\n\t\t<li>increasing benefits for couples who receive GIS and Allowance benefits and have to live apart for reasons beyond their control</li>\n\t\t<li>enhancing the CPP, in collaboration with provincial and territorial partners, which will raise the maximum CPP retirement benefit by up to 50&nbsp;per cent over time</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/home-accueil-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/themes/seniors-aines-en.html\">Backgrounder: A Secure and Dignified Retirement for Canadians</a></li>\n</ul></div>\n      "
}