{
  "path": "/en/news/news-releases/2019/01/10/prime-minister-visits-thompson-rivers-universitys-new-industrial",
  "pageTitle": "Prime Minister visits Thompson Rivers University’s new Industrial Training and Technology Centre | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada's post-secondary institutions are at the forefront of excellence in science, research, and innovation. They play a fundamental role in our society and help Canadians develop the skills and expertise they need to prepare for the jobs of today and tomorrow.</p><p>The Prime Minister, Justin Trudeau, today visited the newly built $32-million Industrial Training and Technology Centre at Thompson Rivers University in Kamloops, British Columbia. The Government of Canada provided $13.25 million in funding for this centre through the Post-Secondary Institutions Strategic Investment Fund.</p><p>The new Centre—opened in September 2018—is training Canadians for in-demand trades and technology jobs, in fields such as power engineering and industrial mechanics. As a centre of excellence in instrumentation and engineering, it also serves as a hub for collaboration and research in applied sciences and engineering.</p><h2>Quote</h2><blockquote><p>“TRU’s new Industrial Training and Technology Centre means more opportunities for Canadians to pursue trade and technology careers, and prepare for jobs of the future. Our government will continue to invest in centres like this one to help Canadians get the skills and training they need, and to position Canada as a global leader in innovation.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>The new Centre is 5,344 square metres and adds up to 550 full-time equivalent student spaces in Thompson Rivers University’s trades and technology programs.</li><li>The project also created new dedicated teaching spaces for architectural and engineering technology programs in the university’s School of Trades and Technology.</li><li>Additional funding of $7.03&nbsp;million was provided by the Province of British Columbia and the remaining $11.72 million was provided by Thompson Rivers University and donors.</li><li>The Post-Secondary Institutions Strategic Investment Fund provides up to $2 billion for infrastructure projects at post-secondary institutions to enhance and modernize research and commercialization facilities, as well as industry-relevant training facilities at colleges and polytechnic institutions in Canada.</li><li>In total, British Columbia has received $256 million through the Post-Secondary Institutions Strategic Investment Fund to support 30 projects throughout the province at twenty public post-secondary institutions and one private First Nations institution.</li></ul><h2><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Associated Links</span></h2><ul><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"https://www.ic.gc.ca/eic/site/051.nsf/eng/h_00153.html\">Thompson Rivers University</a></span></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"https://news.gov.bc.ca/releases/2018AEST0125-001862\">Canada-B.C. investment builds opportunities for trades students in Kamloops</a></span></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"https://www.ic.gc.ca/eic/site/051.nsf/eng/home\">Post-Secondary Institutions Strategic Investment Fund</a></span></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"http://www.ic.gc.ca/eic/site/062.nsf/eng/home\">Innovation and Skills Plan</a></span></li></ul></div>\n      "
}