{
  "path": "/en/news/readouts/2022/06/10/prime-minister-justin-trudeau-meets-speaker-united-states-house",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Speaker of the United States House of Representatives Nancy Pelosi and U.S. congressional members | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Speaker of the United States House of Representatives, Nancy Pelosi, along with U.S. congressional members, on the margins of the Summit of the Americas in Los Angeles.</p>\n\n<p>The Prime Minister, the Speaker, and congressional members reaffirmed the special nature of the bilateral relationship between our two countries. They discussed the importance of shared efforts toward secure supply chains, including the development of critical minerals supply chains in North America. The Prime Minister and Speaker recognized that the collective well-being and prosperity of all of our citizens depends on a healthy, vibrant trade and investment partnership, and committed to taking steps to ensure it continues to be strengthened. They also exchanged views on a range of bilateral trade issues, including electric vehicle tax credits, dairy tariff-rate quotas, and the pressure that is placed on home prices and affordability by the duties on Canadian softwood lumber.</p>\n\n<p>Participants noted the unique nature of the Canada-U.S. security relationship, in particular the North American Aerospace Defence Command (NORAD), and its binational command. The Prime Minister noted Canada’s commitment to NORAD modernization and to the defence of the North American continent.</p>\n\n<p>Congressional members noted the Prime Minister’s leadership on controlling firearms, including the recent introduction of new legislation to further strengthen gun control in Canada and keep Canadians safe from gun violence.</p>\n\n<p>The Prime Minister, the Speaker, and congressional members discussed the importance of taking further action to combat climate change, including through putting a price on carbon pollution. The Prime Minister recognized the particular vulnerability of small island developing states to the devastating impacts of climate change, and the need to mitigate the crisis through a greener future, and one that transitions the world toward cleaner energy sources.</p>\n\n<p>The discussions touched on key foreign policy and global issues, including the protection and preservation of the sovereignty and territorial integrity of Ukraine. The Prime Minister, the Speaker, and congressional members welcomed the support offered by both countries to Ukraine and the strong unity amongst the North Atlantic Treaty Organization Allies and partners.</p>\n\n<p>The Prime Minister, the Speaker, and congressional members discussed the important role that immigration has played in the history of both of our countries, and the need to ensure that diversity continues to be recognized for the strength that it is. The Prime Minister noted the government’s priority of strengthening Canada’s immigration and refugee system.</p>\n\n<p>The Prime Minister and Speaker looked forward to continuing to work together for the well-being of citizens in both of their countries.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}