{
  "path": "/en/news/readouts/2022/06/17/prime-minister-justin-trudeau-speaks-northwest-territories-premier",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Northwest Territories Premier Caroline Cochrane | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Premier of the Northwest Territories, Caroline Cochrane, to discuss a number of issues of importance for the territory and all Canadians.</p>\n\n<p>The Premier updated the Prime Minister on the state of the floods and recovery in the territory. The Prime Minister expressed deep concern for everyone affected and committed to continuing to be a strong partner on disaster assistance.</p>\n\n<p>The two leaders discussed their shared priority to find ways to effectively advance infrastructure projects in order to improve life in the North. The Prime Minister and Premier agreed on the critical importance of housing and the significant support provided by the federal government through Budget&nbsp;2022. They committed to continue working collaboratively through the Arctic and Northern Policy Framework to provide prosperity in Canada’s North.</p>\n\n<p>The Prime Minister and Premier discussed the great potential for collaboration on critical minerals, noting the significance of mining to the Northwest Territory’s economy, and other economic development opportunities for the North.</p>\n\n<p>The Prime Minister and Premier committed to continuing to work together and looked forward to staying in touch.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/04/prime-minister-justin-trudeau-speaks-northwest-territories-premier\">Prime Minister Justin Trudeau speaks with Northwest Territories Premier Caroline Cochrane, Nunavut Premier P.J. Akeeagok, and Yukon Premier Sandy Silver</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/campaign/flood-ready.html\">Get Flood Ready</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022: A Plan to Grow Our Economy and Make Life More Affordable</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Canada’s Arctic and Northern Policy Framework</a></li>\n</ul></div>\n      "
}