{
  "path": "/en/news/news-releases/2022/11/28/prime-minister-announces-appointment-new-chief-justice-alberta",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Ritu Khullar, a judge of the Court of Appeal of Alberta, as the new Chief Justice of Alberta, Chief Justice of the Court of Appeal for the Northwest Territories, and Chief Justice of the Court of Appeal of Nunavut.</p>\n\n<p>Chief Justice Khullar replaces the Honourable Catherine A. Fraser, the first woman appointed Chief Justice of a province in Canada, who retired earlier this year.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Ritu Khullar every success as she takes on her new role. She is a respected member of the legal community and brings a wealth of experience in multiple areas of law to the bench. I am confident Chief Justice Khullar will be a great asset to the people of Alberta, the Northwest Territories, and Nunavut.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial services in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/28/honourable-ritu-khullar\">The Honourable Ritu Khullar</a></li>\n</ul></div>\n      "
}