{
  "path": "/en/news/readouts/2020/02/08/prime-minister-justin-trudeau-meets-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the Prime Minister of Ethiopia, Abiy Ahmed.</p>\n\n<p>Prime Minister Trudeau affirmed Canada’s steadfast support for Ethiopia’s ambitious reform agenda. The two leaders exchanged views on shared priorities including economic growth, governance and democracy, climate change, and gender equality and women’s empowerment.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Abiy discussed ways to strengthen trade and investment noting the participation of the Minister of Small Business, Export Promotion and International Trade, Mary Ng, and a trade delegation, which travelled to Ethiopia to further exchanges. The Prime Ministers’ agreed on the importance of creating economic opportunities for all, including through creative ways to support Ethiopia’s dynamic and entrepreneurial youth.</p>\n\n<p>The leaders’ spoke of the potential of the African Continental Free Trade Agreement in accelerating the economic transformation of the continent. They also discussed ways of furthering economic prosperity by promoting cross industry collaboration to create jobs advanced through Ethiopia’s industrial policy and Canada’s innovation superclusters.</p>\n\n<p>Prime Minister Trudeau acknowledged Prime Minister Abiy’s leadership and contribution to regional peace and security. They discussed the important role played by the African Union in promoting an integrated, prosperous, and peaceful Africa. The two leaders exchanged views on contemporary challenges to peace and security in Africa, further to Canada’s role as 2020 Chair of the United Nations Peacebuilding Commission. They agreed to continue working together to advance the Women, Peace and Security agenda, which is transforming peace operations around the world.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Abiy spoke of Canada’s long-standing development assistance supporting Ethiopia’s reform agenda. On environmental cooperation, the Leaders’ discussed their respective efforts to plant more trees as a means of addressing the adverse effects of climate change.</p>\n\n<p>The two leaders spoke of the deep friendship between Canada and Ethiopia, founded upon close people-to-people ties, and discussed ways to further improve the flow of people between the two countries.</p>\n\n<p>The Prime Minister was accompanied by Minister Ng and the Minister of Families, Children and Social Development, Ahmed Hussen.</p></div>\n      "
}