{
  "path": "/en/news/readouts/2022/10/27/prime-minister-justin-trudeau-meets-united-states-secretary-state-antony-j",
  "pageTitle": "Prime Minister Justin Trudeau meets with United States Secretary of State Antony J. Blinken | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the United States Secretary of State, Antony J. Blinken, during Secretary Blinken’s visit to Canada.</p>\n\n<p>The Prime Minister and the Secretary of State recognized the strength and unique character of the U.S.-Canada relationship, and emphasized the commitment of both of their governments to advancing bilateral cooperation under the Roadmap for a Renewed U.S.-Canada Partnership.</p>\n\n<p>The Prime Minister and the Secretary agreed to continue to collaborate to address a range of bilateral and cross-border issues, including the current NEXUS and FAST application backlog, and to strengthen our shared North American economy. They highlighted the importance of working together on energy security and supply chain resilience. They also reiterated their governments’ commitments to work together in the Arctic, and to defend the North American continent.</p>\n\n<p>The Prime Minister and the Secretary of State shared views on a range of current global issues, including in Haiti, Iran, and our mutual engagements in the Indo-Pacific. They also reiterated their mutual commitment to provide continued assistance to Ukraine and to work with a wide range of partners to address the impacts of Russia’s illegal and unjustifiable aggression. The Prime Minister spoke of the importance of maintaining strong unity amongst allies and continuing to impose severe costs on Russia in the face of its invasion of Ukraine and further blatant escalations.</p>\n\n<p>The Prime Minister thanked the Secretary of State for his visit to Ottawa, and he looked forward to welcoming the President of the United States of America, Joe Biden, to Canada in the near future.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/arctic-arctique/index.aspx?lang=eng\">Canada and the Circumpolar Regions</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}