{
  "path": "/en/news/statements/2021/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Peacekeepers’ Day:</p>\n\n<p>“Today, on <a href=\"https://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/peacekeeping\">National Peacekeepers’ Day</a>, we honour the brave Canadians who have served as peacekeepers. Their sacrifices, past and present, have helped protect human rights, strengthen the rule of law, and advance lasting peace around the world.</p>\n\n<p>“Over generations, these selfless members of the Canadian Armed Forces, police officers, and civilians have ventured far from home to lay the foundations for peace, protect thousands from danger, and help rebuild societies after war. They have represented the values our country holds dear: peace, freedom, and compassion.</p>\n\n<p>“Canada’s involvement with peacekeeping started in 1948, when we committed to send military observers to the region of Kashmir to ease tensions between India and Pakistan. Since then, Canadians have put themselves in harm’s way around the world to help build a better tomorrow. We have supported peace operations and initiatives from the Americas to Asia, Europe, Africa, and the Middle East.</p>\n\n<p>“The nature of conflicts and peacekeepers’ roles have changed over the years, and our country’s involvement has also evolved to meet those needs. In 2017, the Government of Canada launched the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles</a>, to help ensure that children remain children at all stages of a conflict, and are protected from the threat of becoming child soldiers. That same year, we also launched the <a href=\"https://pm.gc.ca/en/news/backgrounders/2017/11/15/elsie-initiative-women-peace-operations\">Elsie Initiative for Women in Peace Operations</a> to increase women’s meaningful participation in peace operations. By helping shape the evolution of peacekeeping, Canada is doing its part to build a safer, more just future for all.</p>\n\n<p>“Canadians and people from around the world have visited the <a href=\"https://www.veterans.gc.ca/eng/remembrance/memorials/national-inventory-canadian-memorials/details/9365\">Reconciliation Peacekeeping Monument</a> in the heart of our national capital. On it, they can read, ‘This monument, Reconciliation, is a tribute to Canada’s commitment to world peace, and to all Canadian men and women who have served as peacekeepers.’ Today, on National Peacekeepers’ Day, we all honour our country’s peacekeepers, who have sacrificed so much to build peace, protect those in need, and bring about a better, more peaceful world.”</p></div>\n      "
}