{
  "path": "/en/news/news-releases/2018/12/13/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of the Federal Court | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Jocelyne Gagné, a judge of the Federal Court, as Associate Chief Justice of the Federal Court.</p><p>Justice Gagné fills a new position for the Federal Court, created to assist in managing a growing and increasingly complex caseload.</p><h2>Quote</h2><blockquote><p>“I wish Jocelyne Gagné every success as the new Associate Chief Justice of the Federal Court. With six years of service as a judge, as well as extensive experience in commercial and civil litigation, I know she will serve Canadians well in this new role.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>Justice Gagné was appointed to the Federal Court on May 31, 2012.</li><li>The new Associate Chief Justice position within the Federal Court was authorized under Bill C-74, the <i>Budget Implementation Act, 2018, No.1</i>.</li><li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li><li>Chief Justices and Associate Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li><li>The Federal Court is Canada’s national trial court. The Court hears and decides legal disputes arising in the federal domain, including claims against the Government of Canada, civil suits in federally regulated areas, and challenges to the decisions of federal tribunals.</li></ul><h2>Biographical&nbsp;Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/12/13/honourable-jocelyne-gagné\">The Honourable Jocelyne Gagné</a></li></ul></div>\n      "
}