{
  "path": "/en/news/statements/2017/09/19/prime-minister-names-new-deputy-leader-government-house-commons",
  "pageTitle": "Prime Minister names new Deputy Leader of the Government in the House of Commons | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the appointment of Member of Parliament Chris Bittle as the new Deputy Leader of the Government in the House of Commons:</p><p>“I am very pleased that Member of Parliament for St. Catharines, Chris Bittle, has been appointed as the new Deputy Leader of the Government in the House of Commons.</p><p>“Working closely with the Honourable Bardish Chagger, the Leader of the Government in the House of Commons, Chris Bittle will encourage close collaboration and meaningful engagement with House of Commons colleagues, Parliamentary Committees, the Public Service, stakeholders, and Canadians. He will also play an instrumental role as we work to modernize the House of Commons and make it more accountable, predictable, efficient, and transparent.</p><p>“Mr. Bittle’s experience as a Member of the Standing Committee on Justice and Human Rights, its Subcommittee on Agenda and Procedure, and on two groups that promote cooperation between parties in Parliament – the Canadian NATO Parliamentary Association and the Canada-Italy Interparliamentary Group – will be invaluable in this new role. His legal background will also serve him well as we focus on effective and accountable governance that supports our long-term plan to create jobs, strengthen the middle class, and secure a more prosperous future for all Canadians.</p><p>“While we look forward to welcoming our new Deputy House Leader, we also continue to mourn the passing of our dear friend and colleague, Member of Parliament Arnold&nbsp;Chan, who served in the role for almost two years. His commitment to Canadians, devotion to public service, and zeal for democratic values will continue to motivate and inspire us for years to come.”</p></div>\n      "
}