{
  "path": "/en/news/readouts/2022/04/04/prime-minister-justin-trudeau-speaks-northwest-territories-premier",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Northwest Territories Premier Caroline Cochrane, Nunavut Premier P.J. Akeeagok, and Yukon Premier Sandy Silver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of National Defence Anita Anand spoke with Northwest Territories Premier Caroline Cochrane, Nunavut Premier P.J. Akeeagok, and Yukon Premier Sandy Silver to discuss Arctic security and sovereignty.</p>\n\n<p>The Prime Minister thanked the three premiers for their governments’ solidarity with, and support to Ukraine and its people in the face of Russia’s illegal and unjustifiable invasion.</p>\n\n<p>The premiers outlined their concerns about the ongoing Russian aggression in Ukraine and the risks it can pose to Arctic sovereignty. They outlined the importance of building healthy communities and strong infrastructure in asserting sovereignty in the North. Prime Minister Trudeau and Minister Anand underscored that the Government of Canada remains deeply committed to supporting the health, security, and prosperity of the Arctic while defending Canadian sovereignty and upholding regional security.</p>\n\n<p>The leaders discussed their shared commitment to ensuring Northern and Arctic communities remain thriving, strong, and safe, as guided by the Arctic and Northern Policy Framework. They also discussed other priorities of shared interest, including investments in infrastructure, health care and mental health, housing, and climate change.</p>\n\n<p>Prime Minister Trudeau committed to staying in close contact with Premier Cochrane, Premier Akeeagok, and Premier Silver, and reaffirmed his commitment to continuing to work in partnership with them.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement to Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Canada’s Arctic and Northern Policy Framework</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1562939617400/1562939658000\">Canada’s Arctic and Northern Policy Framework: Safety, security, and defence chapter</a></li>\n</ul></div>\n      "
}