{
  "path": "/en/news/news-releases/2015/11/15/prime-minister-announces-canadas-growth-and-investment-strategies",
  "pageTitle": "Prime Minister announces Canada’s Growth and Investment Strategies | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today unveiled Canada’s Adjusted Growth Strategy and Investment Strategy, both focused on strengthening the Canadian economy. These strategies are based on key commitments to invest in the economy to create jobs, strengthen the middle class, and help those working hard to join it. The announcement of the two strategies comes as the Prime Minister meets with other G20 leaders in Antalya, Turkey.</p>\n\n<p>Canada’s Adjusted Growth Strategy will strengthen the economy by making it more competitive, creating jobs, and enhancing skills training.</p>\n\n<p>Canada’s Investment Strategy supports a strong economy through high-quality, historic investments, particularly in transit, green, and social infrastructure.</p>\n\n<p>These strategies include transformative infrastructure investments, a reduction in the federal small business tax rate, and targeted investments in new jobs and skills training, including improved support for youth and Indigenous peoples. They also include the Government’s new innovation approach, a tax cut for the middle class, and investments in families with the creation of the Canada Child Benefit.</p>\n\n<p>The strategies also demonstrate Canada’s contribution to the G20’s overarching objective of strong, sustainable, and balanced growth.&nbsp;In its role as Co-chair of the G20 Framework for Strong, Sustainable and Balanced Growth Working Group, Canada is encouraging G20 members to remain committed to the implementation of their growth strategies which, if fully implemented, are expected to lift the G20’s collective gross domestic product by two per&nbsp;cent by 2018.&nbsp;</p>\n\n<p><strong>Quote</strong></p>\n\n<p>“Working with my fellow G20 leaders, we can strengthen the global economy and, in turn, ensure all Canadians have a real and fair chance to succeed. When the middle class has more money to save, invest, and grow the economy, we all benefit, and I am proud to share a new and positive Canadian vision for stronger growth and investment. We are committed to working with our G20 partners to make a real and valuable contribution to a more peaceful and prosperous world.”– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n\n<p><strong>Quick Facts</strong></p>\n\n<ul>\n\t<li>A key focus of the G20 has been to foster strong, sustainable, and balanced global growth through collective actions.</li>\n\t<li>Canada’s Adjusted Growth Strategy is published as part of the set of national adjusted growth strategies G20 members put forward at the Leaders’ Summit in Antalya, Turkey, on November 15 and 16, 2015.</li>\n\t<li>Canada’s Investment Strategy is published as part of country-specific investment strategies that G20 members put forward at the Antalya Summit.</li>\n\t<li>The G20 is the premier forum for international economic cooperation, with members accounting for 85 per&nbsp;cent of global output and two-thirds of the world’s population.</li>\n</ul>\n\n<p><strong>Associated Links</strong></p>\n\n<ul>\n\t<li><a href=\"http://www.international.gc.ca/g20/assets/pdfs/CanadaGrowthStrategyFINAL.PDF\">Canada’s Comprehensive Growth Strategy 2014</a></li>\n\t<li><a href=\"/en/news/backgrounders/2015/11/15/canada’s-adjusted-growth-strategy-and-investment-strategy-g20\">Canada’s Adjusted Growth Strategy and Investment Strategy for the G20</a></li>\n\t<li><a href=\"http://www.international.gc.ca/g20/assets/pdfs/AdjustedGrowthStrategyG20.pdf\">Adjusted Growth Strategy: Canada</a></li>\n\t<li><a href=\"http://www.international.gc.ca/g20/assets/pdfs/InvestmentStrategyG20.pdf\">Canada - Investment Strategy</a></li>\n</ul></div>\n      "
}