{
  "path": "/en/news/statements/2021/12/02/statement-prime-minister-united-arab-emirates-golden-jubilee",
  "pageTitle": "Statement by the Prime Minister on the United Arab Emirates’ Golden Jubilee | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the United Arab Emirates’ Golden Jubilee:</p>\n\n<p>“Today, we join Emiratis in Canada and around the world, and the residents of the United Arab Emirates (UAE), in celebrating the 50th<sup> </sup>anniversary of the country’s founding, also known as the UAE National Day.</p>\n\n<p>“Over the past 50 years, the world has witnessed the UAE’s economic, social, and cultural transformation. Today, the UAE is a thriving hub connecting the Middle East, North Africa, South Asia, and other parts of the world in culture, trade, finance, and tourism. More than 40,000 Canadians call the UAE home and contribute to the UAE’s success. Over 6,000 Emiratis live in Canada, and we benefit from their contributions to our country.</p>\n\n<p>“Since Canada and the UAE established diplomatic relations in 1974, the UAE has become Canada’s largest export market in the Middle East and North Africa. Our strong relationship is focused on building prosperity for the people of our countries, strengthening regional and global security, and contributing to economic and social development in other countries, including work on the empowerment of women and girls and human rights. We are also partners in several international organizations, including the United Nations, La Francophonie, and the World Trade Organization.</p>\n\n<p>“This year also marks significant milestones for the UAE. Over the past year, as we collaborated to overcome the challenges of the pandemic, we have witnessed the importance of our strategic partnership. The UAE continues to top global rankings for COVID-19 vaccination rates, helping in the global fight against the virus. In 2021, the country’s Mars Hope Probe also successfully reached the planet’s orbit, becoming the Arab world’s first interplanetary mission – Canada and the UAE continue to work to implement our shared goals for the peaceful use and exploration of space.</p>\n\n<p>“After a one-year postponement due to the pandemic, Canada is proud to participate in Expo 2020 Dubai, which runs until March&nbsp;31, 2022. The exposition represents a unique opportunity for our country, the UAE, and the world to come together to celebrate our global diversity, and all that unites us, and to work together on our planet’s most pressing challenges. Canada’s participation reflects our strong relationship with the UAE, and the economic and cultural ties between our two countries. It also sets the stage for greater collaboration in the years to come.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to celebrate our connections with the UAE and its citizens. I extend my best wishes to all those marking the UAE’s Golden Jubilee, here in Canada and around the world. We look forward to celebrating the next 50 years of our two countries’ strategic partnership and people-to-people ties.</p>\n\n<p>“.كلّ عام وشعب الإمارات العربية المتحدّة بألف خير وسلامة”</p></div>\n      "
}