{
  "path": "/en/news/statements/2019/01/27/statement-prime-minister-international-holocaust-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on International Holocaust Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Holocaust Remembrance Day:</p><p>“Today, we mourn the loss of more than six million Jews who were murdered during the Holocaust, and the countless other victims of Nazi atrocities. We also honour those who survived the Shoah, recognizing both the scars they carry, and their stories of hope, courage, and perseverance against unspeakable evil.</p><p>“The Holocaust is a stark reminder of the dangers of hatred and discrimination, and the irreversible consequences of inaction and indifference. On this day, we repeat the vow, ‘Never Again’ – not as a phrase, but as a promise to remain vigilant against the threat of genocide. We must preserve the memories of those who lived through the horrors of the Shoah, so that our generation – and those to come – will never forget their stories.</p><p>“We must also acknowledge Canada’s own history of anti-Semitism, and its devastating results. In November, the Government issued a long-overdue apology for Canada’s inaction and apathy toward Jews during the Nazi era. Our country’s disgraceful ‘none is too many’ immigration policy doomed many Jews to Nazi death camps, including hundreds of Jewish refugees <a href=\"/en/news/news-releases/2018/11/07/prime-minister-delivers-apology-regarding-fate-passengers-ms-st-louis\">aboard the <i>MS St. Louis</i></a>. No words will ever erase this tragedy – but it is our sincere hope that this apology will help ensure the lessons we have learned are never forgotten.</p><p>“We are not immune to the effects of ignorance and hate. The threats of violence, xenophobia, and anti-Semitism still exist today. The murder of eleven Jews at the Tree of Life synagogue in Pittsburgh – one of the deadliest attacks against Jews in North American history – is fresh in our minds. The Government will continue to stand with the Jewish community in Canada and around the world, and call out the anti-Semitism, hatred, and racism that incites such despicable acts.</p><p>“On this solemn day, we pay tribute to the resilience of the Jewish people, through our words – and our actions. We honour our pledge to stand guard and speak out against anti-Semitism in our communities, to embrace our differences, and find strength in our diversity.”</p></div>\n      "
}