{
  "path": "/en/news/news-releases/2017/06/28/prime-minister-travel-ireland-and-united-kingdom-attending-g20-summit",
  "pageTitle": "Prime Minister to travel to Ireland and the United Kingdom before attending the G20 Summit in Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will visit Dublin, Ireland, on July&nbsp;4 and Edinburgh, Scotland, on July&nbsp;5 before attending the G20&nbsp;Summit in Hamburg, Germany, on July&nbsp;7&nbsp;and&nbsp;8.</p><p>As Canada marks the 150<sup>th</sup> anniversary of Confederation, the Prime Minister’s visit to Ireland and the U.K. will serve to recognize the strong family ties, history, and common purpose our countries share. The Prime Minister will meet with Her Majesty Queen Elizabeth II to honour her importance to Canada’s history, and to thank her for her continued dedication to Canada.</p><p>In Dublin, the Prime Minister will meet with Irish Taoiseach (Prime Minister) Leo Varadkar for the first time. The two leaders will discuss issues of mutual interest, including how to best take advantage of opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA). After Dublin, the Prime Minister will travel to Edinburgh to be received in private audience by Her Majesty Queen Elizabeth II at the Palace of Holyroodhouse.</p><p>At the Hamburg Summit, G20&nbsp;leaders will consider measures to reach sustainable development goals, address climate change, respond to global health challenges, and advance gender equality, including the economic empowerment of women. The Prime Minister will stress the need to focus on economic growth that benefits everyone. He will also reiterate Canada’s commitment to working with partners to develop a coordinated global response to terrorism while safeguarding human rights.</p><h2>Quotes</h2><blockquote><p>“Ireland and Canada share a strong and vibrant relationship, based on shared cultural heritage and strong family ties. With CETA, we have the opportunity to collaborate further through a progressive trade agenda that will create good, middle class jobs on both sides of the Atlantic.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Her Majesty Queen Elizabeth II’s commitment to public service has long inspired me and many other Canadians. With this year marking the 150<sup>th</sup> anniversary of Confederation, I look forward to thanking her personally for her dedication to our country, and for carrying out her duties with such grace and strength.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Many of the most pressing issues we face as a country, we also face as a world – from climate change to economic anxieties caused by rapid technological change. International cooperation is more important than ever to find effective, meaningful solutions to these challenges. I welcome the agenda put forward by Germany as host of this year’s G20 Summit and its focus on what we can – and must – do to shape our interconnected world.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Ireland enjoy strong commercial relations with two-way bilateral merchandise trade worth over $2.4 billion in 2016, making it Canada’s tenth largest trading partner in the European Union. In that year, Canadian exports totaled over $496 million and imports were over $1.9 billion.&nbsp;</li><li>This will be the Prime Minister’s second time being received in audience by Her Majesty. His first audience was on November 25, 2015.</li><li>In 2011, over 11.3 million Canadians claimed British Isles ancestry, including over 4.7 million of Scottish ancestry and over 4.5 million of Irish ancestry. The United Kingdom was the 9th-largest source of new permanent residents in Canada in 2015.&nbsp;</li><li>Canada and the UK enjoy a positive commercial relationship. Two-way merchandise trade between Canada and the UK totalled over $25.3 billion in 2016, with Canadian exports being over $17 billion making the UK Canada’s fifth-largest merchandise trade partner.</li><li>The G20 Summit brings together the leaders of major advanced and emerging economies, and Germany will host this year’s summit under the theme “Shaping an Interconnected World.”</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.g20.org/Webs/G20/DE/Home/home_node.html\">G20</a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng&amp;_ga=2.248636751.990654506.1498153461-673960517.1475602112\">Canada and the G20</a></li><li><a href=\"http://canada.pch.gc.ca/eng/1444997714981\">Her Majesty Queen Elizabeth II</a></li></ul></div>\n      "
}