{
  "path": "/en/news/statements/2017/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/peacekeeping\">National Peacekeepers’ Day</a>:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we recognize the women and men in Canada’s military and police forces who work to create peace and stability around the world.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Canada’s strong tradition of peacekeeping owes much to Lester B. Pearson, who championed the first armed United Nations peacekeeping mission during the Suez Crisis in 1956. Our history of peacekeeping goes back even further, though, to our earliest missions to build peace and security across the globe.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In 1949, Canada sent dedicated peacekeepers abroad for the first time – to bring calm to a dispute between India and Pakistan over the region of Kashmir. A few years later, in the Middle East&nbsp;in 1954, Major-General E. L. M. Burns became the first of many Canadians to command a UN peacekeeping mission.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Over the years, Canadian peacekeepers have helped monitor ceasefires, protect the most vulnerable from the ravages of war, and build the foundations of peace. Peacekeepers often endanger their own lives to help those most affected by violent conflict, in particular women and girls. They work tirelessly to protect human rights, and to ensure the voices of the most vulnerable are represented in peace processes.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, I thank all of our country’s peacekeepers – past and present – for their courageous efforts to build lasting peace around the world. They represent the best of Canada. We will continue to work with the UN and other organizations to create a safer, more secure world for all.\"</span></p></div>\n      "
}