{
  "path": "/en/news/readouts/2020/04/30/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with premiers to discuss the evolving COVID-19 situation. The leaders began by expressing their sympathies to the loved ones of those involved in the tragic accident of a Canadian Armed Forces helicopter off the coast of Greece. They talked about coordinated actions being taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians, and to support workers and businesses.</p>\n\n<p>The Prime Minister updated premiers on the release of the most recent federal modelling data on the spread of COVID-19.&nbsp;He underscored how the collective measures being taken by Canadians are working, and leaders agreed that continued collaboration is needed to ensure all Canadians are safe and healthy, especially the most vulnerable.</p>\n\n<p>First Ministers reaffirmed their commitment to the joint statement on the shared public health approach to support restarting the economy, released earlier this week. They spoke about the plans they are putting forward in each of their respective jurisdictions to restart the economy. First Ministers acknowledged the importance of doing this through a gradual and phased approach, based on the advice of public health experts.</p>\n\n<p>All First Ministers reiterated the importance of a Team Canada effort in addressing the challenges of COVID-19. The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories\">Prime Minister announces partnerships with provinces and territories to deliver the Canada Emergency Commercial Rent Assistance for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}