{
  "path": "/en/news/news-releases/2018/02/20/prime-minister-announces-new-commercial-partnerships-india-and",
  "pageTitle": "Prime Minister announces new commercial partnerships with India and thousands of middle class jobs for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>India is one of the fastest growing economies in the world, and offers significant opportunities to strengthen Canada’s middle class and bolster our shared prosperity. Our deep cultural and people-to-people ties foster an economic relationship that creates high quality jobs in both our countries.</p><p>While meeting with business leaders in Mumbai today, the Prime Minister, Justin Trudeau, welcomed more than $1 billion in investments between Canadian and Indian companies, which will lead to the creation of more than 5,800 good, well-paying middle class jobs for Canadians.</p><p>These investments will grow Canada’s economy, encourage innovation and entrepreneurship, and see increased collaboration in several key sectors, including infrastructure, information technology, aerospace, clean technology, film production, and research and development.</p><p>Later in the day, the Prime Minister participated in a women’s leadership roundtable and met with a number of business executives to discuss how Canadians and Indians can benefit from new opportunities to cooperate in the global economy and promote women’s economic empowerment.</p><p>He then participated in an armchair discussion at the Canada-India Business Forum before attending an event with members of the Indian film industry and a reception with business and community leaders.</p><h2>Quote</h2><blockquote><p>“As one of the world’s fastest growing economies, India offers exciting opportunities for Canadian businesses of all sizes. The partnerships announced today will create thousands of good, middle class jobs for Canadians, and are further proof of the ever-growing ties between our two countries.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>During the visit to Mumbai, the Prime Minister met with the senior corporate leadership of the following companies: Tata Sons, Infosys, Mahindra Group of Companies, Jubilant Bhartia Group, Aditya Birla Group, and Shapoorji Pallonji Group.</li><li>Canada and India enjoy a strong and growing commercial relationship, in addition to important cultural and people-to-people ties.</li><li>Merchandise exports to India totalled $4.18 billion in 2017, making India Canada’s seventh-largest destination for merchandise exports, while merchandise imports totalled $4.16 billion that same year.</li><li>Bilateral trade in services between our two countries reached $2.1 billion for 2016, an increase of 1.9 per cent over 2015. India is also Canada’s 10th-largest source of tourists and international visitors, with 224,000 visits made from India to Canada in 2016.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2018/02/20/strengthening-canada-india-commercial-relationship\">Strengthening of Canada-India commercial relationship</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/01/22/prime-minister-trudeau-travel-india-state-visit\">Prime Minister Trudeau to travel to India for state visit</a></li><li><a href=\"/en/news/news-releases/2018/02/18/canada-and-india’s-relationship-strengthened-people-people-ties\">Canada and India’s relationship strengthened by people-to-people ties</a></li></ul></div>\n      "
}