{
  "path": "/en/news/statements/2022/04/17/statement-prime-minister-40th-anniversary-canadian-charter-rights-and",
  "pageTitle": "Statement by the Prime Minister on the 40th anniversary of the Canadian Charter of Rights and Freedoms | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 40th anniversary of the <em>Canadian Charter of Rights and Freedoms</em>:</p>\n\n<p>“Forty years ago today, the <a href=\"https://laws-lois.justice.gc.ca/eng/const/page-12.html\"><em>Canadian Charter of Rights and Freedoms</em></a> was adopted with the signing of the Proclamation of the <em>Constitution Act, 1982</em> by Her Majesty Queen Elizabeth&nbsp;II and my father, Prime Minister Pierre Elliott Trudeau.</p>\n\n<p>“The Charter protects the rights and freedoms that define who we are as Canadians, allowing us to express our individuality and celebrate our differences. Built around our shared values of equality, justice, and freedom, it brings us closer as a country and as a people – and it makes Canada a place of choice for people from across the globe to raise a family.</p>\n\n<p>“The spirit of the Charter should inspire us all as we build a more equal and fairer country for everyone. As we recover from the COVID-19 pandemic, we know there is still much work to do to help many Canadians overcome the barriers they face to social and economic participation. This includes confronting painful truths about our history and taking meaningful action to combat all forms of hatred and discrimination.</p>\n\n<p>“This year also marks the 40th anniversary of Section 35 of the <em>Constitution Act, 1982</em>, which recognizes and affirms Indigenous and Treaty rights of First Nations, Inuit, and Métis. As we build a better future, we will continue working with Indigenous Peoples to advance meaningful reconciliation toward a renewed nation-to-nation, Inuit-Crown and government-to-government relationship.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to continue upholding our collective responsibility to the words enshrined in the Charter that protect our fundamental rights and freedoms, as we work to build a better future for everyone.”</p></div>\n      "
}