{
  "path": "/en/news/statements/2022/03/20/statement-prime-minister-international-day-la-francophonie",
  "pageTitle": "Statement by the Prime Minister on the International Day of La Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of La&nbsp;Francophonie:</p>\n\n<p>“Today, on the 35th <a href=\"https://www.francophonie.org/journee-internationale-de-la-francophonie-2022\">International Day of La&nbsp;Francophonie</a>, we join Francophones and Francophiles in Canada and around the world in celebrating the richness of the French language – a cornerstone of our country’s history, identity, and heritage. This day also invites us to highlight the diversity of Francophone cultures and communities around the world.</p>\n\n<p>“French is one of Canada’s two official languages – and the first official language of nearly a quarter of Canadians. French-speaking communities across the country are at the heart of our history and, through their many contributions, they continue to make Canada a more inclusive, prosperous, and vibrant country.</p>\n\n<p>“Through the French language, our country maintains strong ties with Francophone communities around the world. As an active member of the <a href=\"https://www.francophonie.org/francophonie-brief-1763\">Organisation internationale de la&nbsp;Francophonie</a> (OIF), Canada works closely with its Francophone partners all over the world to promote the French language and the diversity of Francophone cultures, including in the digital sphere. Together, we also work to protect our shared values of democracy, peace, human rights, and solidarity.</p>\n\n<p>“The Government of Canada recognizes the importance of promoting French and strengthening the vitality of Francophone communities across the country. That is why, this month, we introduced an enhanced bill to ensure the substantive equality of status of English and French in Canada. This vision of our linguistic duality and our bilingualism, which includes setting targets for Francophone immigration outside Quebec, is part of our commitment to <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/canadians-official-languages-act.html\">modernize the <em>Official Languages Act</em></a>.</p>\n\n<p>“We will continue to work to modernize Canada’s linguistic regime, to adapt it to today’s realities and to establish a new linguistic balance in the country. Our proposal to strengthen the Act is an important step in our efforts to help protect the French language, promote our two official languages, and revitalize minority communities and bilingualism across the country.</p>\n\n<p>“This year’s International Day of La&nbsp;Francophonie is also an opportunity for us to express our support and solidarity with Ukraine, which has OIF observer status, as its people try to secure their future in the face of Russia’s unjustifiable invasion of their territory.</p>\n\n<p>“On behalf of the Government of Canada, I wish all Francophones and Francophiles in Canada and around the world a happy<em> </em>International Day of La&nbsp;Francophonie. I encourage you to learn more about <a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La&nbsp;Francophonie</a>, to share the hashtags #Francophoniedelavenir and #mon20mars on social media, and to take part in activities in your community to celebrate this important day.”</p></div>\n      "
}