{
  "path": "/en/news/statements/2016/06/29/leaders-statement-north-american-climate-clean-energy-and-environment",
  "pageTitle": "Leaders’ Statement on a North American Climate, Clean Energy, and Environment Partnership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau, President Barack Obama, and President Enrique Peña Nieto share a common commitment to a competitive, low-carbon and sustainable North American economy and society. The Paris Agreement was a turning point for our planet, representing unprecedented accord on the urgent need to take action to combat climate change through innovation and deployment of low-carbon solutions. North America has the capacity, resources and the moral imperative to show strong leadership building on the Paris Agreement and promoting its early entry into force. We recognize that our highly integrated economies and energy systems afford a tremendous opportunity to harness growth in our continuing transition to a clean energy economy. Our actions to align climate and energy policies will protect human health and help level the playing field for our businesses, households, and workers. In recognition of our close ties and shared vision, we commit today to an ambitious and enduring North American Climate, Clean Energy, and Environment Partnership that sets us firmly on the path to a more sustainable future.</p>\n<p><strong>Advancing Clean and Secure Power</strong></p>\n<p>We announce a historic goal for North America to strive to achieve 50 percent clean power generation by 2025. We will accomplish this goal through clean energy development and deployment, clean energy innovation and energy efficiency. Building from ongoing efforts by our respective energy ministers through the North American Energy Ministerial Memorandum Concerning Climate Change and Energy Collaboration, a range of initiatives will support this goal, including:&nbsp;</p>\n<ul>\n<li>Scaling up clean energy through aggressive domestic initiatives and policies, including Mexico’s Energy Transition Law and new Clean Energy Certificates, the U.S. Clean Power Plan and five-year extension of production and investment tax credits, and Canada’s actions to further scale up renewables, including hydro.&nbsp;</li>\n<li>Collaborating on cross-border transmission projects, including for renewable energy. At least six transmission lines currently proposed or in permitting review, such as the Great North Transmission Line, the New England Clean Power Link, and the Nogales Interconnection, would add approximately 5,000 megawatts (MW) of new cross-border transmission capacity. &nbsp;</li>\n<li>Conducting a joint study on the opportunities and impacts of adding more renewables to the power grid on a North American basis.</li>\n<li>Enhancing trilateral collaboration on greening of government initiatives including the purchase of more efficient products, cleaner power, and clean vehicles. &nbsp;Strengthening and aligning efficiency standards across all three countries, facilitating the seamless movement of products, reducing pollution, and cutting costs for consumers. We commit to promote industrial and commercial efficiency through the voluntary ISO 50001 energy performance standard and to align a total of ten energy efficiency standards or test procedures for equipment by end of 2019.</li>\n<li>Building on North American leadership in international fora such as Mission Innovation to accelerate clean energy innovation, our energy researchers are identifying joint research and demonstration initiatives to advance clean technologies in priority areas such as smart grids and energy storage; reducing methane emissions; carbon capture, use and storage; nuclear energy; and advanced heating and cooling, including energy efficiency in building.</li>\n</ul>\n<p>Together, we estimate that the development of current and future projects and policies to achieve this goal will create thousands of clean jobs and support of our vision for a clean growth economy.</p>\n<p>The three countries will continue to strengthen the North American Cooperation on Energy Information platform, by including additional geospatial information relating to cross-border infrastructure and renewable energy resources. We also commit to deepened electric reliability cooperation to strengthen the security and resilience of an increasingly integrated North American electricity grid.</p>\n<p><strong>Driving Down Short-Lived Climate Pollutants</strong></p>\n<p>Short-lived climate pollutants such as methane, black carbon, and hydrofluorocarbons are up to thousands of times more potent than carbon dioxide. Common sense actions to reduce these pollutants will deliver significant climate and health benefits in the near term and into the future, supporting our goal to limit global warming this century.</p>\n<p>Today, Mexico will join Canada and the United States in committing to reduce their methane emissions from the oil and gas sector – the world’s largest methane source – 40% to 45% by 2025 towards achieving the greenhouse gas targets in our nationally determined contributions. To achieve this goal, the three countries commit to develop and implement federal regulations to reduce emissions from existing and new sources in the oil and gas sector as soon as possible. &nbsp;We also commit to develop and implement national methane reduction strategies for key sectors such as oil and gas, agriculture, and waste management, including food waste.&nbsp;</p>\n<p>Finally, we pledge to continue collaborating with one another and with international partners as we commit to significant national actions to reduce black carbon emissions in North America, and promote alternatives to highly polluting hydrofluorocarbons.</p>\n<p><strong>Promoting Clean and Efficient Transportation</strong></p>\n<p>We recognize that fully realizing the promise of an integrated North American transportation network will require joint action that will create clean jobs while reducing energy consumption, greenhouse gases, and air pollution.&nbsp;</p>\n<p>Today, we commit to:&nbsp;</p>\n<ul>\n<li>accelerating deployment of clean vehicles in government fleets;</li>\n<li>working collaboratively with industry to encourage the adoption of clean vehicles by identifying initiatives to support consumer choice;</li>\n<li>encouraging public and private infrastructure investments to establish ‎North American refuelling corridors for clean vehicles;</li>\n<li>working to align applicable regulations, codes and standards where appropriate;</li>\n<li>fostering research, development, and demonstration activities for new clean technologies;</li>\n<li>convening industry leaders and other stakeholders by spring 2017 as part of a shared vision for a competitive and clean North American automotive sector.</li>\n</ul>\n<p>Canada, the U.S., and Mexico commit to reduce GHG emissions from light- and heavy-duty vehicles by aligning fuel efficiency and/or GHG emission standards by 2025 and 2027, respectively. We also commit to reduce air pollutant emissions by aligning air pollutant emission standards for light- and heavy-duty vehicles and corresponding low-sulphur fuel standards beginning in 2018. In addition, we will encourage greener freight transportation throughout North America by expanding the SmartWay program to Mexico.</p>\n<p>We recognize the significant contributions of our respective automotive industries and urge them to continue playing a leadership role in the development and deployment of clean and connected vehicles, innovating toward a shared vision of a green transportation future.</p>\n<p>We support the adoption by all countries in 2016 of the market-based measure proposed through the International Civil Aviation Organization to allow for carbon-neutral growth from international civil aviation from 2020 onwards and will join the first phase of the measure adopted.&nbsp;</p>\n<p>We are committed to reducing greenhouse gas emissions from maritime shipping and will continue to work together and through the International Maritime Organization (IMO) to support implementation of a North American Emission Control Area that includes Mexico.</p>\n<p><strong>Protecting Nature and Advancing Science</strong></p>\n<p>The mainstreaming of conservation and sustainable biodiversity is a key component of sustainable development. Canada and the U.S. congratulate Mexico on its commitment to host the 13<sup>th</sup> Conference of Parties to the Convention on Biodiversity under this theme. We will also work together to better integrate ocean observation systems, enhance early warning systems for natural disasters, and cooperate on marine protected areas.</p>\n<p>We reaffirm our commitment to work collaboratively to achieve our long term goal of conserving North America’s Monarch migratory phenomena and to ensure that sufficient habitat is available to support the 2020 target for the eastern Monarch population. &nbsp;Trilateral efforts to date have achieved significant successes across the range, including the restoration and enhancement of hundreds of thousands of acres of habitat.&nbsp; We look forward to continued progress and action in the future, building on the population increase for eastern Monarchs observed in 2015.</p>\n<p>We commit to collaborating with Indigenous communities and leaders to incorporate traditional knowledge in decision-making, including in natural resource management, where appropriate, and in advancing our understanding of climate change and climate resilience. We also recognize the importance of gender-responsive approach to &nbsp;climate action and sustainable development.</p>\n<p><strong>Showing Global Leadership in Addressing Climate Change</strong></p>\n<p>Canada, the U.S., and Mexico will work together to implement the historic Paris Agreement, supporting our goal to limit temperature rise this century to well below 2<sup>o</sup>C, and pursuing efforts to limit the temperature increase to 1.5<sup>o</sup>C. We reaffirm our commitment to join the Agreement this year, and call on all nations to support its entry into force in 2016. As we implement our respective Nationally-Determined Contributions, we will cooperate on climate mitigation and adaptation, focussing in particular on highly integrated sectors, shared ecosystems, human health and disaster risk-reduction efforts. We will work together and with international partners to support developing country partners in their mitigation and adaptation efforts. We will also support robust implementation of the Paris Agreement’s transparency and carbon markets-related provisions, and will develop mid-century, long-term low-greenhouse gas emissions development strategies this year.&nbsp;</p>\n<p>Canada, the U.S., and Mexico affirm our commitments to adopt an ambitious and comprehensive Montreal Protocol hydrofluorocarbons (HFCs) phase-down amendment in 2016, and to reduce use of HFCs, including through domestic actions. We call on all nations to support this goal.</p>\n<p>We commit to phase out inefficient fossil fuel subsidies by 2025 and call on the other members of the G-20 to do the same. We also urge the G-20 to make commitments to reduce methane emissions in the oil and gas sector and to improve the environmental performance of heavy-duty vehicles.</p>\n<p>Canada, the U.S., and Mexico will promote universal energy access and work together to address the challenges of energy security and integration, clean energy investment, and regional energy cooperation in the Caribbean and Central America.</p>\n<p>Canada, the U.S. and Mexico will align approaches to account for the social cost of carbon and other greenhouse gas emissions when assessing the benefits of emissions-reducing policy measures.</p>\n<p>The Action Plan that supports this Joint Statement further elaborates the various activities that the three countries are undertaking to meet its commitments.</p>\n<p><strong>North American Climate, Clean Energy, and<br></strong><strong>&nbsp;Environment Partnership Action Plan</strong></p>\n<p>The North American Climate, Clean Energy, and Environment Partnership was announced by Prime Minister Justin Trudeau, President Barack Obama, and President Enrique Peña Nieto on June 29, 2016, at the North American Leaders Summit in Ottawa, Canada. This Action Plan identifies the deliverables to be achieved and activities to be pursued by the three countries as part of this enduring Partnership.</p>\n<p><strong>Advancing Clean and Secure Energy</strong></p>\n<p><em>Advance clean energy and integration of energy resources, including renewables:</em></p>\n<ul>\n<li>Strive to achieve a goal for North America of 50% clean power generation by 2025, including renewable, nuclear, and carbon capture and storage technologies, as well as demand reduction through energy efficiency, with actions undertaken by each country individually to achieve this regional goal being in accordance with their own conditions, specific legal frameworks and clean energy national goals.</li>\n<li>Advance clean energy development and deployment (including renewable, nuclear, and carbon capture and storage technologies).&nbsp;</li>\n<li>Support the development of cross-border transmission projects, including for renewable electricity. The three countries recognize the important role that cross-border transmission lines can play in cleaning and increasing the reliability and flexibility of North America’s electricity grid. At least six transmission lines currently proposed or in permitting review, such as the Great Northern Transmission Line, the New England Clean Power Link, and the Nogales Interconnection, would add approximately 5,000 megawatts (MW) of new cross-border transmission capacity.</li>\n<li>Jointly study, identify, and implement options for broad energy system integration, including completion of the second installment of the Quadrennial Energy Review focused on a comprehensive review of the electricity system. In addition, develop the North American Renewable Integration Study (NARIS) to analyze coordinated planning and operations impacts under a high renewable energy scenario across North America.</li>\n<li>Greater trilateral collaboration on encouraging the greening of government initiatives and on the purchase of more efficient products, cleaner power, and clean vehicles as appropriate. The U.S. General Services Administration and Public Services and Procurement Canada announce their intention to increase the percentage of electricity they purchases from clean energy sources to 100 percent by 2025.</li>\n<li>Greater trilateral collaboration on encouraging the greening of government initiatives through establishing ongoing exchange and cooperation between countries to share and leverage existing methodologies, tools, analysis and lessons learned to further enhance the sustainability of our Federal operations.</li>\n</ul>\n<p><em>Improve energy efficiency:</em></p>\n<ul>\n<li>Better align and further improve appliance and equipment efficiency standards. We commit to align six energy efficiency standards or test procedures for equipment by the end of 2017, and a total of ten standards or test procedures by the end of 2019.</li>\n<li>Drive industrial and commercial efficiency to reduce energy use and increase competitiveness through the voluntary ISO 50001 energy performance standard, and commit to set a common target date for ISO 50001 uptake by 2017.</li>\n<li>Work collaboratively to identify at least one major industry partner to pilot ISO 50001 adoption throughout its supply chain, emphasizing technical resources to support the success of this strategy for small to medium-sized enterprises (SMEs) in the region.</li>\n</ul>\n<p><em>Accelerate clean energy innovation and advance cooperation on energy information:</em></p>\n<ul>\n<li>Leverage participation in Mission Innovation by identifying joint research and demonstration initiatives to advance clean technologies in priority areas such as: reducing methane emissions; carbon capture, utilization, and storage; electricity grids and energy storage; as well as conditioning of spaces and energy efficiency in buildings. <strong></strong></li>\n<li>Through the North American Competitiveness Workplan, advance a North American Clean Energy Partnership Initiative (NACEPI) to support the development of linkages among clean energy technology companies, with a focus on SMEs, and to promote the use and export of North American clean energy and environmental technology.</li>\n<li>Further advance collaboration on the North American Cooperation on Energy Information platform, by including additional geospatial information relating to cross-border infrastructure, static maps of solar resource, a renewable energy resource catalogue, as well as relevant updates to the terminology glossary.</li>\n</ul>\n<p><em>Strengthen the reliability, resilience and security of the North American Electricity Grid: </em></p>\n<ul>\n<li>Building on the U.S. – Canadian experience, Mexico and the United States have initiated discussions to explore a similar conceptual model for deepened bilateral electric reliability cooperation. This cooperation is a critical step towards establishing a shared trilateral vision for electricity reliability in North America.&nbsp;</li>\n<li>Our three countries are committed to deepened electric reliability cooperation to strengthen the security and resilience of an increasingly integrated North American electricity grid against the growing threats presented by cyber-attacks and severe weather events.</li>\n</ul>\n<p><strong>Driving Down Short-Lived Climate Pollutants</strong></p>\n<p><em>Reduce methane emissions in the oil and gas sector:</em></p>\n<ul>\n<li>Reduce methane emissions from the oil and gas sector, the world’s largest industrial methane source, 40-45 percent by 2025 towards achieving the greenhouse gas targets in our nationally determined contributions, and explore additional opportunities for methane reductions. The three countries commit to develop and implement federal regulations for both existing and new sources as soon as possible to achieve the target. We intend to invite other countries to join this ambitious target or develop their own methane reduction goal.</li>\n<li>Collaborate on the development of federal programs and policies, and exchange information, practices and experiences regarding reducing emissions in the oil and gas sector to improve outcomes.</li>\n<li>Encourage oil and gas firms to join international efforts such as the Climate and Clean Air Coalition’s Oil and Gas Methane Partnership and the Global Methane Initiative, and domestic ones.</li>\n<li>Share information and tools to support better methane data collection, improved source measurements, and transparency of emissions reporting across North America to enhance the effectiveness of emission inventories, and promote the adoption of cost-effective technologies and practices for field measurement, monitoring, and emissions mitigation.&nbsp;</li>\n</ul>\n<p><em>Develop national methane strategies with a focus on key sectors:</em></p>\n<ul>\n<li>Develop and implement national methane reduction strategies that could target key sectors such as oil and gas, agriculture, and waste management.&nbsp;</li>\n</ul>\n<p><em>Decrease methane emissions from landfills and the agriculture sector:</em></p>\n<ul>\n<li>Support the regional commitment and collaboration initiative under the Commission for Environmental Cooperation using voluntary measures to reduce and recover food waste in North America, in line with Target 12.3 of the UN Sustainable Development Goals, which envisions a 50% reduction in global food waste by 2030.</li>\n<li>Take actions to reduce emissions from landfills – the third largest source of methane globally.</li>\n</ul>\n<p><em>Reduce black carbon (soot):</em></p>\n<ul>\n<li>Commit to pursuing domestic actions to reduce black carbon, recognizing that black carbon is a climate pollutant with strong warming impacts that affects air quality and human health, and that action to reduce black carbon emissions is an important component of efforts to address climate change, as a complement to reducing greenhouse gases.</li>\n<li>Strengthen initiatives to reduce black carbon in sectors such as industry and agriculture, including through technical support and information-sharing on best practices, strategies, and methodologies.</li>\n<li>Drive down black carbon emissions from new heavy-duty diesel vehicles to near-zero levels continent-wide by implementing aligned, world-class, ultra low-sulphur diesel fuel and HDV exhaust air pollutant emission standards by 2018.</li>\n<li>Deploy renewable energy and efficiency alternatives to diesel, coal or firewood in remote communities, in collaboration with international partners and organizations.</li>\n<li>Collaborate on implementation of the World Bank’s Zero Routine Flaring by 2030 Initiative.</li>\n<li>Affirm existing efforts to quantify and reduce emission of black carbon in other venues. These include:\n<ul>\n<li>Establishing the North America black carbon inventory under the CEC, through which each country submits a national inventory;</li>\n<li>Supporting or carrying out, as appropriate, national action planning through the Climate &amp; Clean Air Coalition (CCAC), plus sector-specific initiatives such as those targeting municipal solid waste, diesel fuel, and industrial emissions through the CCAC;</li>\n<li>Developing black carbon inventories consistent with the Convention on Long-Range Transboundary Air Pollution.</li>\n</ul>\n</li>\n</ul>\n<p><em>Reduce hydrofluorocarbons:</em></p>\n<ul>\n<li>In 2016, the United States expects to finalize a rule to expand the list of low global warming potential alternatives and prohibit the use of certain high-global warming hydrofluorocarbons (HFCs) under the Significant New Alternatives Policy (SNAP) program. Canada plans to establish a domestic regulatory permitting and reporting regime for HFCs and develop new HFC regulatory measures, including a phase-down of HFCs and product-specific prohibitions. Mexico plans to initiate new actions to authorize the use of low global warming potential SNAP-approved HFC alternatives as well as promote their use as alternatives to high global warming potential HFCs and remove barriers to deployment.</li>\n</ul>\n<p><strong>Promoting Clean and Efficient Transportation </strong></p>\n<p><em>Reduce energy consumption, and greenhouse gas and air pollutant emissions from motor vehicles:</em>&nbsp;</p>\n<ul>\n<li>Work together to promote a common continental approach and reduce energy consumption and greenhouse gases, and achieve other important air-quality co-benefits of motor vehicles, including by:\n<ul>\n<li>Accelerating deployment of clean and efficient vehicles in government fleets; including through U.S. commitments to expand charging infrastructure at federal facilities, and leveraging innovative financing and economies of scale for U.S. agencies seeking to scale up clean and efficient vehicle fleets and infrastructure;</li>\n<li>Working collaboratively with industry to identify initiatives to support consumer choice and encourage the adoption of clean and efficient vehicles;</li>\n<li>Supporting development of and encouraging public and private investments in clean refueling infrastructure to establish ‎North American clean refueling corridors;</li>\n<li>Aligning applicable regulations, codes and standards where appropriate;</li>\n<li>Fostering research, development, and demonstration activities including for advanced vehicles;</li>\n<li>Convening a meeting to engage industry leaders and other stakeholders by spring 2017 as part of a shared vision for a competitive and clean North American automotive sector; and</li>\n<li>Promoting access to Zero Emission Vehicle (ZEV) refueling infrastructure in homes, the workplace and communities.</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Implement aligned, world-class, ultra low-sulphur diesel fuel and HDV exhaust air pollutant emission standards by 2018.</li>\n<li>Implement aligned light-duty vehicle (LDV) and heavy-duty vehicle (HDV) fuel efficiency and/or greenhouse gas standards out to 2025 and 2027, respectively. &nbsp;</li>\n<li>Align LDV exhaust and evaporative air pollutant emission standards with full U.S. Tier 2 standards by 2018 and fully phase in Tier 3 standards by 2025, while also implementing ultra low-sulphur gasoline standards.&nbsp;</li>\n</ul>\n<p><em>Support the implementation of green freight best practices: </em></p>\n<ul>\n<li>Align and harmonize green freight efforts for North America, by expanding the SmartWay Program to also include Mexico. The three countries intend to collaborate to drive down fuel use through best practices in fleet operations and management, improving energy efficiency while reducing emissions.</li>\n</ul>\n<p><em>Reduce maritime shipping emissions</em>:</p>\n<ul>\n<li>Continue to work together through the International Maritime Organization (IMO) to address greenhouse gas emissions from international shipping, including emissions from existing ships.</li>\n<li>Welcome the recent approval of a mandatory global data collection system within the IMO to collect data on ship-specific CO2 emissions and energy efficiency.</li>\n<li>Continue ongoing collaboration through the Commission for Environmental Cooperation in support of the finalization and submission to the IMO of a Mexican Emission Control Area (ECA) designation proposal.&nbsp;</li>\n</ul>\n<p><em>Reduce international aviation emissions through the ICAO:</em></p>\n<ul>\n<li>Work together and through the International Civil Aviation Organization (ICAO) to reduce emissions through a basket of measures, including the adoption at the 2016 ICAO Assembly of a robust market-based measure to help to enable carbon neutral growth from 2020 onward. This measure should strike an appropriate balance between the principle of non-discrimination and differentiation among countries with different national circumstances, and endorse the phasing-in of implementation and a dynamic approach to the distribution of offsetting requirements as the means to do so. The three countries plan to join the first phase of the measure adopted and work together toward reaching a successful outcome at the ICAO Assembly.</li>\n</ul>\n<p><strong>Protecting Nature and Advancing Science</strong></p>\n<p><em>Foster incorporation of traditional knowledge and gender responsiveness:</em></p>\n<ul>\n<li>Collaborate with Indigenous and local communities and leaders to more broadly and respectfully include traditional knowledge in decision making, including in natural resource management, where appropriate, and in advancing our understanding of climate change and climate resilience. We also recognize the importance of a gender-responsive approach to climate action and sustainable development.</li>\n</ul>\n<p><em>Mainstream conservation and sustainable use of biodiversity:</em></p>\n<ul>\n<li>Take national actions to mainstream conservation and sustainable use of biodiversity into and across diverse sectors, in support of the Multilateral Environmental Agreements (MEAs) to which each country is party.</li>\n</ul>\n<p><em>Conserve the Monarch butterfly and its habitat:</em></p>\n<ul>\n<li>Building on the significant progress made by the three countries since 2014 to address threats to the Monarch butterfly, continue to address habitat loss and degradation through the Trilateral Working Group for the conservation not only of the Monarch Butterfly, but also of other pollinators.</li>\n<li>Promote sufficient breeding, staging, migration, and overwintering habitat is made available domestically to support the 2020 Eastern Monarch population target represented by its occupation of six hectares of overwintering habitat in Mexico.</li>\n<li>Continue collaborating through the Tri-national Monarch Science Partnership to coordinate priority research, monitoring, information sharing, and tools development.</li>\n</ul>\n<p><em>Protect migratory birds and their habitat: </em></p>\n<ul>\n<li>Renew and recommit to regional, bilateral, and trilateral activities in support of migratory bird and habitat conservation.</li>\n<li>Develop a vision for the next 100 years of bird conservation.</li>\n<li>Exchange information on best practices, promote cooperative and coordinated monitoring and research programs, bring together stakeholders to develop strategies for conservation investment, and expand environmental education and outreach.</li>\n</ul>\n<p><em>Protect land and sea migratory species and their habitat:</em></p>\n<ul>\n<li>Implement programs to conserve and improve biological corridors for whales and other species and their habitats, including their food chains and ecosystem quality.</li>\n</ul>\n<p><em>Strengthen cooperation on invasive alien species:</em></p>\n<ul>\n<li>Further collaborate on addressing invasive alien species on a continental scale. Establish a trilateral working group to explore the development of a high level joint Strategy and Action Plan identifying key areas for collaboration, including under the Commission for Environmental Cooperation, and to initiate a survey of existing transboundary invasive alien species projects and initiatives.</li>\n</ul>\n<p><em>Strengthen conservation of key species and combat wildlife trafficking: </em></p>\n<ul>\n<li>Continue close collaboration in the implementation of the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES), including efforts to stop the illegal trade in wildlife. Develop specific action plans to deliver creative solutions to protect CITES-listed species, with the goals of ensuring a long-term balance between conservation and sustainable international trade involving all relevant stakeholders.</li>\n</ul>\n<p><em>Enhance cooperation on ocean management:</em></p>\n<ul>\n<li>Recognizing the importance of climate services, robust observations and modelling networks for mitigation and adaptation efforts, better integrate ocean observation systems and foster complementary research on oceans and climate change, including the impacts of climate change on oceans and marine ecosystems.</li>\n<li>Support collaborative efforts on early warning systems for natural disasters; in particular, improving ocean observing capabilities and sharing and standardizing data from ocean buoys that would support these systems.</li>\n<li>Enhance cooperation among respective Marine Protected Areas, with the goal of increasing economic and socio-ecological resilience in a context of climate change.</li>\n<li>Enhance the conservation and restoration of wetlands, which increase mitigation actions (blue carbon), preserve coastal ecosystems services, and reduce the potential impacts of more frequent or intense severe weather events under climate change projections.&nbsp;</li>\n</ul>\n<p><strong>Showing Global Leadership in Addressing Climate Change</strong></p>\n<p><em>Support implementation of the Paris Agreement:</em></p>\n<ul>\n<li>Reaffirm our commitment to join the Agreement this year, and call on all nations to support its early entry into force.</li>\n<li>Implement respective Nationally Determined Contributions, and share progress on these efforts, work to increase their ambition over time and cooperate where appropriate.</li>\n<li>Support international partners in their mitigation and adaptation efforts, including as articulated in their Nationally Determined Contributions, National Adaptation Plans, and other strategic frameworks, through such avenues as international fora, triangular cooperation in the Americas, and by providing development assistance and climate financing.</li>\n<li>Develop mid-century, long-term low greenhouse gas emission development strategies pursuant to the Paris Agreement this year. Engage in trilateral dialogue concerning the development of these strategies.</li>\n<li>Promote full implementation of the transparency framework established under the Paris Agreement, with common modalities, procedures, and guidelines for reporting and review. Help developing countries build institutional and technical capacity to meet these requirements.</li>\n<li>Share best practices and technical solutions to improve accounting effectiveness, including for the land sector and carbon market-related approaches.</li>\n<li>Recognizing the role that carbon markets can play in helping achieve climate targets while driving innovation, support robust domestic implementation of the Paris Agreement’s carbon markets-related provisions, as applicable.\n<ul>\n<li>Together and in close cooperation with states, provinces, and territories, explore options to ensure environmental integrity and transparency and apply robust accounting, in order to avoid the “double-counting” of emission reductions towards achieving NDCs.</li>\n<li>Encourage sub-national governments to share lessons learned about the design of effective carbon pricing systems and supportive policies and measures.&nbsp;</li>\n</ul>\n</li>\n</ul>\n<p><em>Enhance domestic adaptation efforts and resilience to climate change:</em></p>\n<ul>\n<li>Engage in and cooperate on domestic climate adaptation planning and action, building on ongoing targeted efforts at national and subnational levels, and focusing in particular on highly integrated sectors and shared ecosystems, and where possible, on actions with mitigation co-benefits, involving the most vulnerable communities, and employing an approach that is gender-responsive and respectful of human rights.&nbsp;</li>\n<li>Strengthen disaster risk reduction efforts, coordinated disaster preparation and response, and early warning systems.&nbsp;</li>\n<li>Continue to collaborate through the North American Climate Change and Human Health Working Group to foster cross-border relationships and increase climate change adaptive capacity in the area of human health.</li>\n<li>Continue to collaborate through the Commission for Environmental Cooperation to develop an operational, real-time syndromic surveillance system for extreme heat events in three at-risk communities in our three countries, and to highlight best practices and lessons learned on developing such a system.</li>\n</ul>\n<p><em>Encourage robust action by the G-20:</em></p>\n<ul>\n<li>Phase out inefficient fossil fuel subsidies by 2025 in keeping with the G-20’s 2009 commitment to phase out inefficient fossil fuel subsidies in the medium term as Canada, the United States, and Mexico affirm their commitment to phase out inefficient fossil fuel subsidies by 2025 and provide targeted support for the poorest communities.</li>\n<li>Develop low greenhouse gas emission development strategies pursuant to the Paris Agreement by 2020.</li>\n<li>Commit to improve the environmental performance of heavy-duty vehicles, including through the implementation of stringent domestic regulations on fuel efficiency and/or greenhouse gas emissions, air pollutant emissions, and low-sulfur fuels, and through green freight programs; and.</li>\n<li>Address methane emissions from the oil and gas sector by developing and implementing national and sub-national methane reduction policies and regulations, and participating in mechanisms such as the Climate and Clean Air Coalition Oil and Gas Methane Partnership. These actions could support future steps towards adopting national emission reductions targets, where appropriate.</li>\n</ul>\n<p><em>Adopt a Montreal Protocol hydrofluorocarbons (HFC) phase-down amendment:</em></p>\n<ul>\n<li>Adopt an ambitious and comprehensive Montreal Protocol HFC phase-down amendment in 2016, and work with other countries so that they are in a position to support adopting an amendment this year.</li>\n</ul>\n<p><em>Align analytical methods:</em></p>\n<ul>\n<li>Given the integrated nature of many aspects of the three economies, align analytical methods for assessing and communicating the impact of direct and indirect greenhouse gas emission of major projects. Building on existing efforts, align approaches, reflecting the best available science for accounting for the broad costs to society of greenhouse gas emissions, including using similar methodologies to estimate the social cost of carbon and other greenhouse gases for assessing the benefits of policy measures that reduce those emissions.</li>\n</ul>\n<p><em>Promote a more secure, affordable, accessible, and clean energy future regionally and globally:</em></p>\n<ul>\n<li>Support the recommendations made in the May 2016 report from the United States-Caribbean-Central American Task Force on Energy Security, and help lead the world in important multilateral efforts such as the UNFCCC negotiations, the Clean Energy Ministerial, Mission Innovation, the Caribbean Energy Security Initiatives, the Energy and Climate Partnership of the Americas, Connecting the Americas 2022, and the Carbon Sequestration Leadership Forum.</li>\n<li>Engage partner countries and multilateral development banks to promote universal energy access and integration in the Americas, and to mobilize finance for the development of sustainable energy projects, with a particular focus on indigenous communities, marginalized groups, and more vulnerable regions such as the Caribbean and Central America.</li>\n<li>Foster sustainable energy development and economic growth through transparent and competitive energy markets, and by reducing barriers to trade and investment in clean technologies and services.</li>\n</ul>\n<p><em>Promote a just transition to a clean energy economy:</em></p>\n<ul>\n<li>Invest strategically in communities to help them diversify economies, create and sustain quality jobs, and share in the benefits of a clean energy economy. This includes promoting decent work, sharing best practices, and collaborating with social partners such as workers’ and employers’ organizations and NGOs on just transition strategies that will benefit workers and their communities.</li>\n<li>Protect the fundamental principles and rights at work of workers who extract and refine fossil fuels, and who manufacture, install, and operate energy technologies.</li>\n</ul></div>\n      "
}