{
  "path": "/en/news/statements/2016/12/09/communique-canadas-first-ministers",
  "pageTitle": "Communiqué of Canada’s First Ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s First Ministers today issued a joint communiqué and released the Pan-Canadian Framework on Clean Growth and Climate Change following the First Ministers’ Meeting:</p>\n<p>“Climate change is indisputable, as are the significant impacts it is having in Canada and around the world. From increased heat waves, droughts, flooding, and thawing permafrost, changes to the Earth’s climate can be seen and felt by all Canadians. Nowhere is this more pronounced than in Canada’s North. We are already facing the social and economic costs of climate change which poses significant risk to our environment, as well as to our health, security, and future prosperity. This is why we have been working together in close collaboration on behalf of all Canadians to develop a plan to grow our economy, reduce greenhouse gas (GHG) emissions, and build resilience to the impacts of a changing climate.</p>\n<p>“We convened today to adopt the Pan-Canadian Framework on Clean Growth and Climate Change, following the commitments made in the Vancouver Declaration of March 2016. The Framework is rooted in the principles of a collaborative approach outlined in the Vancouver Declaration to reduce GHG emissions and enable sustainable economic growth, recognizing the need for fair and flexible approaches to support the diversity of provincial and territorial economies.</p>\n<p>“This Framework builds on actions of provincial and territorial governments to reduce GHG emissions and identifies actions that will seize the many economic opportunities afforded by clean growth. It presents an ambitious and achievable plan to address our common challenges, while also improving our quality of life and building a healthy environment for our children and grandchildren. The actions taken under the Framework will contribute to meeting or exceeding Canada’s 2030 climate change target of a 30 percent reduction below 2005 greenhouse gas levels.</p>\n<p>“This Framework represents not simply an agreement between First Ministers, but a pan-Canadian plan for action which has been developed with input from Canadians across the country. Indigenous Peoples have shown climate leadership long before the Paris Agreement and are active drivers of positive change. The development of the Framework was also informed by input from municipalities, businesses and civil society who made it clear that they want to be part of the solution to climate change.</p>\n<p>“Pricing carbon pollution is an efficient way to reduce GHG emissions, drive innovation, and encourage people and businesses to pollute less. It is a core element of the Framework and governments will work together on its implementation.</p>\n<p>“The Framework outlines critical actions that we will take to grow the economy while reducing GHG emissions. These actions include:</p>\n<ul>\n<li>developing new building codes to ensure that buildings use less energy, saving money for households and businesses;</li>\n<li>deploying more electric charging stations to support zero-emitting vehicles, which is an integral part of the future of transportation;</li>\n<li>expanding clean electricity systems, promoting inter-ties, and using smart-grid technologies to phase out the reliance on coal, make more efficient use of existing power supplies, and ensure a greater use of renewable energy;</li>\n<li>reducing methane emission from the oil and gas sector;</li>\n<li>protecting and enhancing carbon stored in forested lands, wetlands and agricultural lands; and</li>\n<li>setting an example and driving significant reductions in emissions from government operations.</li>\n</ul>\n<p>“We agreed to take action to adapt to the changing climate and to build climate resilience, recognizing that coastal, northern and Indigenous communities face unique circumstances. These communities are especially vulnerable to the threat of rising temperatures and feel the impacts of climate change first.</p>\n<p>“A focus on clean technology is a core element of the Framework and through the actions identified, we will foster innovation and create new jobs, new technologies and new export opportunities. We also agreed on the importance of having globally competitive Canadian businesses as we transition to a low-carbon economy. We will position Canada to contribute to global solutions that can be exported to the world.</p>\n<p>“In support of these efforts, the federal government, in collaboration with the provinces and territories, will be making historic investments in green infrastructure, public transit, and clean technology and innovation. This will include helping Indigenous Peoples and remote and northern communities reduce their reliance on diesel by connecting these communities to electricity grids and implementing renewable energy systems.</p>\n<p>“The Framework also builds on the ongoing work of federal, provincial and territorial ministers from a range of portfolios, including environment, innovation and finance. We also received today an update from energy ministers on specific actions under the Canadian Energy Strategy that provincial and territorial governments will implement with the collaboration of the federal government in support of the Framework, including initiatives on energy conservation and efficiency, clean energy innovations and delivering electricity connections to markets in Canada and abroad.</p>\n<p>“We reaffirmed the importance of ongoing collaboration as we work together to implement the Framework. We will continue to collaborate on efforts to track progress to reduce GHG emissions and to report on actions and performance. This process will include engagement with external experts to help ensure that our actions are transparent and open to independent review. We will also continue to engage Canadians and ensure meaningful involvement of Indigenous Peoples as we grow our economy and create good jobs and take ambitious action on climate change.</p>\n<p>“We have tasked our ministers and officials to implement the Framework and report back to us on progress within a year, and annually thereafter. Federal, provincial and territorial governments will work together to establish a review of carbon pricing, including expert assessment of stringency and effectiveness that compares carbon pricing systems across Canada, which will be completed by early 2022 to provide certainty on the path forward. An interim report will be completed in 2020, which will be reviewed and assessed by First Ministers. As an early deliverable, the review will assess approaches and best practices to address the competitiveness of emissions-intensive, trade-exposed sectors.</p>\n<p>“Canada works best when we all work together on shared goals and objectives. Today’s adoption of the Pan-Canadian Framework on Clean Growth and Climate Change is a major step towards building a prosperous, low-carbon future for our children and grandchildren.”</p>\n<p><em>Saskatchewan is not adopting the Pan-Canadian Framework.</em></p>\n<p><strong><br>Related Product</strong></p>\n<ul>\n<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}