{
  "path": "/en/news/statements/2022/03/07/trilateral-statement-canada-united-kingdom-and-netherlands",
  "pageTitle": "Trilateral Statement by Canada, the United Kingdom, and the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the leaders of Canada, the United Kingdom, and the Netherlands are appalled by Putin’s unprovoked and brutal invasion of Ukraine. This is a horrific attack on a democratic, sovereign European nation, as well as a clear violation of Russia’s obligations under international law, including the United Nations Charter.</p>\n\n<p>We call on Russia to uphold its obligation to fully respect international humanitarian law and human rights law, and to implement an immediate ceasefire that allows civilians safe passage, food and medical supplies.</p>\n\n<p>We have seen extensive and indiscriminate use of force against civilians. This is prohibited by international humanitarian law. We will not spare any effort to ensure that violations of international law in Ukraine are investigated, that evidence is gathered and that the perpetrators are held accountable.</p>\n\n<p>That is why Canada, the UK, and the Netherlands joined the largest referral to the International Criminal Court in history to expedite an investigation. That is also why we welcome the urgent establishment by the UN Human Rights Council of a Commission of Inquiry with a strong investigative mandate. We stand ready to provide the necessary cooperation and assistance to support the ICC Prosecutor in its work.</p>\n\n<p>We also condemn in the strongest possible terms Russia’s use of force in the direct vicinity of Ukraine’s nuclear power plants and other nuclear facilities and call on Russia to immediately cease these hostilities.</p>\n\n<p>We will continue to stand strong in supporting Ukraine and applaud the heroism and strength of Ukraine’s resistance led by President Zelenskyy. Together we have committed significant economic and humanitarian assistance.</p>\n\n<p>Canada, the UK, and the Netherlands are close defence partners, both bilaterally and within NATO. In past weeks, our three countries have played a crucial role in strengthening the global response to Russia’s invasion of Ukraine, and have each committed to deploy additional forces to bolster NATO’s deterrence and defence posture in Eastern Europe in response to Russian aggression.</p>\n\n<p>We have consistently underlined Ukraine’s right to defend itself against this unlawful aggression and have responded to requests by Ukraine for the provision of defensive military equipment. We call on the international community to stand by Ukraine’s right to self-defence and to respond to calls by Ukraine to strengthen its capabilities to defend itself. We will continue to do so and are bringing in further packages of defence support to Ukraine.</p>\n\n<p>We have also worked with partners to bring in an unprecedented package of purposeful and punitive sanctions to isolate Russia’s economy and will continue to impose severe costs on Russia given this unconscionable attack.</p>\n\n<p>While the humanitarian situation in Ukraine continues to deteriorate, we reiterate the call for Russia urgently to de-escalate and to prioritise the protection of civilians. Ukrainian, UN and other humanitarian agencies, medical personnel, and non-governmental assistance providers must be given safe, rapid and unimpeded access.</p>\n\n<p>We have already committed substantially to the common humanitarian efforts of the UN, Red Cross and coordinating humanitarian aid organisations. The breakdown in the Mariupol ceasefire is a major concern. The lesson from history is that for such ceasefires to work both sides need to be as concrete, actionable and specific as possible.</p>\n\n<p>In particular, we wish to highlight the plight of women, children, the elderly, and other vulnerable groups fleeing the violence in Ukraine. We underscore the importance of addressing their specific protection needs, from family separation to psychosocial stress and trauma, to exploitation and all forms of violence. Our collective efforts to address the crisis in Ukraine must continue to address the needs of the most vulnerable.</p>\n\n<p>The breadth of support across the international community for defending the principles of democracy and freedom has been unprecedented. This was demonstrated by the UN General Assembly when the international community unequivocally condemned Russian aggression, and committed to upholding the rules-based international order with 141 member states voting in favour of the resolution entitled ‘Aggression against Ukraine’.</p>\n\n<p>Today we invite Ukraine’s friends to unite in support of a shared commitment to sustain and coordinate the political, humanitarian, economic and defence support that is so vital for a free and independent Ukraine, and to continue to hold Russia to account for its invasion.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/03/07/prime-minister-concludes-successful-visit-united-kingdom\">Prime Minister concludes successful visit to the United Kingdom</a></li>\n</ul></div>\n      "
}