{
  "path": "/en/news/statements/2021/05/18/statement-prime-minister-12th-anniversary-end-armed-conflict-sri-lanka",
  "pageTitle": "Statement by the Prime Minister on the 12th anniversary of the end of the armed conflict in Sri Lanka | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the end of the armed conflict in Sri Lanka:</p>\n\n<p>“Today, on the 12th anniversary of the end of armed conflict in Sri Lanka, we remember all those who were killed, or injured, and all who were impacted by the many years of conflict, including during the last phase of the war in Mullivaikal. We also offer our deepest sympathies to the survivors and their families, and to everyone living with the pain and trauma caused by this conflict.</p>\n\n<p>“Twelve years later, the wounds and scars of this conflict linger as survivors and all those who faced adversity, suffered loss, and endured trauma still seek answers, including on the fate and whereabouts of missing family members and loved ones.</p>\n\n<p>“Canada was part of the core group at the United Nations Human Rights Council this past March where the High Commissioner for Human Rights was given the mandate to 'collect, consolidate, analyse and preserve information and evidence'&nbsp;relating to violations in Sri Lanka.&nbsp;</p>\n\n<p>“On this anniversary, Canada reiterates its call to the Government of Sri Lanka to find a solution to the underlying drivers of the conflict. We will continue to advocate for a meaningful accountability process and extend support to all those working toward justice, reconciliation, and inclusion, all of which underpin long-term peace and prosperity in the country.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to take time today to recognize the important contributions that Tamil-Canadians continue to make to our country and the adversity they have overcome.”</p></div>\n      "
}