{
  "path": "/en/news/readouts/2022/09/01/prime-minister-justin-trudeau-meets-manitoba-premier-heather-stefanson",
  "pageTitle": "Prime Minister Justin Trudeau meets with Manitoba Premier Heather Stefanson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Manitoba Premier Heather Stefanson to work on delivering results for Manitobans.</p>\n\n<p>The Prime Minister and the Premier spoke about the progress made in recent months that has led to a number of bilateral agreements between both governments in the areas of infrastructure and public transit, long-term care, and support for Churchill and the Hudson Bay Railway. The two leaders committed to build on these successes and to continue working together on future infrastructure investments.</p>\n\n<p>The Prime Minister looked forward to strengthening his collaborative relationship with the Premier in her new role as upcoming Chair of the Council of the Federation. The two leaders spoke about pressures on Canada’s health care system and the importance of working together on accountable solutions to deliver better care for Canadians. The Prime Minister emphasized that the Government of Canada is committed to continue working with provinces and territories to support public health systems that provide quality care for all Canadians.</p>\n\n<p>The Prime Minister and the Premier discussed their close collaboration to support Ukrainians fleeing violence and coming to Manitoba, and opportunities to continue working together on immigration and to address labour market challenges, notably in the area of foreign credential recognition. The Prime Minister reiterated his commitment to working with provincial and territorial partners to address labour mobility challenges, and expressed his support for the Premier’s goal of increasing the number of newcomers to the province in order to support economic recovery and growth. The leaders discussed how they’re working together to make life more affordable for people and address the increase in cost-of-living pressures experienced by Canadians across the country.</p>\n\n<p>Prime Minister Trudeau and Premier Stefanson agreed to stay in close touch and to continue working together on these and other issues of importance to both governments.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/23/prime-minister-justin-trudeau-meets-manitoba-premier-heather-stefanson\">Prime Minister Justin Trudeau meets with Manitoba Premier Heather Stefanson</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/prairies-economic-development/news/2022/08/arctic-gateway-groups-hudson-bay-railway-on-track-to-support-northern-connectivity-through-a-historic-partnership-between-canada-and-manitoba.html\">Arctic Gateway Group’s Hudson Bay Railway on track to support northern connectivity through a historic partnership between Canada and Manitoba</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadaspremiers.ca/\">Council of the Federation</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/department-finance/news/2022/07/government-of-canada-makes-significant-additional-transfers-to-provinces-and-territories-in-support-of-health-care-and-transit.html\">Government of Canada makes significant additional transfers to provinces and territories in support of health care and transit</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/ukraine-measures.html\">Immigration measures and support for Ukrainians and their families</a></li>\n</ul></div>\n      "
}