{
  "path": "/en/news/statements/2019/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Peacekeepers’ Day:</p>\n\n<p>“Over the past seven decades, many Canadians have served in international peace operations around the world. They put themselves in harm’s way to protect human rights, lay the foundations for peace, and help rebuild societies after war. &nbsp;</p>\n\n<p>“On <a href=\"https://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/peacekeeping\">National Peacekeepers’ Day</a>, we honour our peacekeepers – past and present – for their tireless work. We salute their sacrifices and those of their families in the service of peace.</p>\n\n<p>“Today, Canadians continue to serve in international peace operations, including in Haiti, Cyprus, Africa, and the Middle East. In Mali, over the past year, Canadian peacekeepers have conducted more than 100 transport missions in support of UN security operations.</p>\n\n<p>“Since our early peacekeeping missions, we have seen the nature of peacekeeping operations change. Through our peacekeeping efforts, we have learned that when women participate meaningfully in peacekeeping it has a significant impact on achieving lasting peace. While the number of women peacekeepers is higher than ever, uniformed personnel still do not fully reflect the people they serve.</p>\n\n<p>“This is not about increasing numbers. This is about more effective missions and more enduring stability – outcomes that can only be achieved when leaders recognize the need for gender equality in peace operations.</p>\n\n<p>“Together with our UN partners, and through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>, we are working to increase the participation of women in conflict prevention, stabilization, and peacebuilding efforts. Through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>, we are also working to protect children affected by conflicts around the globe.</p>\n\n<p>“Today, on behalf of all Canadians, I thank our country’s peacekeepers – military, police, and civilian – for their courageous and selfless service. Your dedication has helped build lasting peace and security for millions of people around the world.”</p></div>\n      "
}