{
  "path": "/en/news/statements/2020/01/22/statement-prime-minister-fourth-anniversary-shootings-la-loche",
  "pageTitle": "Statement by the Prime Minister on the fourth anniversary of the shootings in La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fourth anniversary of the deadly shootings in La Loche, Saskatchewan:</p>\n\n<p>“On this day, four years ago, the community of La Loche, Saskatchewan, was struck by a senseless attack that killed four Canadians and seriously injured seven more.</p>\n\n<p>“Today, we remember the victims, young people who were full of promise and potential. To the families, friends, and neighbours who carry with them immeasurable grief, we offer our deepest sympathies and support. We also pay tribute to the first responders, Indigenous leaders, and front-line service providers whose courage and professionalism saved lives at Dene High School, and prevented further tragedy that day.</p>\n\n<p>“This terrible loss will never be forgotten. But as the years pass, the people of La Loche will be defined by their determination to heal and rebuild, and their care for each other.</p>\n\n<p>“In 2019, based on recommendations from the community, the federal government provided funding to continue support for cultural and language programs, on-the-land outdoor learning activities, and mental health services for students at Dene High School. Across the country, we are committed to working with the provinces and territories on strengthening gun control to keep our communities – and our children - safe.</p>\n\n<p>“In La Loche, I have met remarkable young people who refuse to let their dreams and hopes be extinguished by this senseless tragedy. Their strength reminds us that even out of darkness, hope will find a way. Every day, they show us the way forward.”</p></div>\n      "
}