{
  "path": "/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas",
  "pageTitle": "Prime Minister to visit NORAD and attend the Summit of the Americas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Colorado Springs to visit the North American Aerospace Defense Command (NORAD) Headquarters and Los Angeles to take part in the Ninth Summit of the Americas, hosted by the President of the United States of America, Joe Biden from June 7 to 11, 2022.</p>\n\n<p>The Prime Minister will travel to Colorado Springs to visit NORAD Headquarters on June 7. He will be joined by Minister of National Defence, Anita Anand.</p>\n\n<p>Then he will travel to Los Angeles to attend the Summit of the Americas, which brings together leaders from North, Central, and South America and the Caribbean to discuss major challenges and shared priorities, including advancing action on climate change, gender equality, and Indigenous rights. Leaders will also discuss Russia’s illegal invasion of Ukraine and the importance of working closely with partners throughout the Americas and around the world to continue to hold Russia accountable and support Ukrainians who have been displaced.</p>\n\n<p>At the Summit, Prime Minister Trudeau will work with world leaders to promote trade, create jobs, and drive economic growth. He will underscore the importance of taking ambitious climate action, including by protecting our oceans and cutting pollution, while creating good jobs and growing the economy. He will also promote democracy and reinforce the continued importance of COVID‑19 testing and treatments, both to identify dangerous variants and to contain future outbreaks. He will be joined by Minister of Foreign Affairs, Mélanie Joly.</p>\n\n<p>While in Los Angeles, Prime Minister Trudeau will hold additional meetings to strengthen joint action on climate change and nature protection. He will be joined by Minister of the Environment and Climate Change, Steven Guilbeault.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada enjoys profound and longstanding relationships in the Americas. The Summit of the Americas is a unique opportunity to work with world leaders in the region to agree on a forward-looking agenda that tackles the challenges of our time, including advancing climate change and promoting democracy. By working together, we can build a better future for people in the Americas and beyond.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the United States share an important and valued bilateral relationship that includes a close defence partnership through the binational North American Aerospace Defense Command (NORAD). NORAD is responsible for providing aerospace warning, aerospace control, and maritime warning for the defence of North America.</li>\n\t<li>The most recent Summit of the Americas was hosted by Peru in Lima in 2018.</li>\n\t<li>Canada hosted the third Summit of the Americas in Quebec City in 2001.</li>\n\t<li>The Canada-United States partnership is forged by shared geography, values, and interests, deep personal connections, and strong economic ties. Canada and the United States enjoy the largest trade relationship in the world.</li>\n\t<li>Canada has longstanding ties and robust relationships with Caribbean countries, including our partnership on development challenges and regional security. We share values including democracy, human rights, and the rule of law with our Commonwealth, Francophonie, and other partners.</li>\n\t<li>Canada shares many connections with countries and peoples of Latin America, including people-to-people ties, shared values, trade and investment, student exchanges, and tourism.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.norad.mil/\">North American Aerospace Defense Command</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2021/08/joint-statement-on-norad-modernization.html\">Joint Statement on NORAD Modernization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada-Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/oas-oea/index.aspx?lang=eng\">Canada and the Organization of American States</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://foro.yabt.net/en/\">Young Americas Forum</a></li>\n</ul></div>\n      "
}