{
  "path": "/en/news/statements/2020/01/27/statement-prime-minister-international-holocaust-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on International Holocaust Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Holocaust Remembrance Day:</p>\n\n<p>“The Holocaust was one of the darkest chapters in human history. Today, we remember and pay tribute to the more than six million Jews who were senselessly murdered during the Holocaust, and the countless other victims of Nazi atrocities.</p>\n\n<p>“We also honour the survivors and share their stories of courage, hope, and perseverance against unspeakable evil, and recognize the heroes who risked their lives to save others.&nbsp;</p>\n\n<p>“Governor General, Her Excellency the Right Honourable Julie Payette, is in Poland today to attend &nbsp;the commemoration of the 75th anniversary of the liberation of Auschwitz-Birkenau and highlight Canada’s continued commitment to preserve the memories of the victims and survivors of the Holocaust. Today’s visit follows her trip to Jerusalem to attend the Fifth World Holocaust Forum, “Remembering the Holocaust: Fighting Antisemitism.”</p>\n\n<p>“Sadly, Jewish communities in Canada and around the world continue to face threats of violence, xenophobia, and rising antisemitism. As a country, through our words and actions, we need to address the resurgence of antisemitism at home and abroad. That is why we adopted the International Holocaust Remembrance Alliance’s definition of antisemitism in <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism strategy</a>. We have also recommitted to the principles of <a href=\"https://www.holocaustremembrance.com/sites/default/files/stockholm_4csilver.pdf\">the Declaration of the Stockholm International Forum on the Holocaust,</a> and supported the adoption of the 2020 International Holocaust Remembrance Alliance Ministerial Declaration.</p>\n\n<p>“Canada will always strongly condemn these acts, and is committed to standing against hatred and discrimination in all their forms. We reaffirm our commitment to Holocaust remembrance and education, so that we never forget its painful lessons. Working with our domestic and international partners, we will continue to promote and defend pluralism, inclusion, and human rights here at home and around the world.</p>\n\n<p>“I encourage Canadians to take time today to remember the victims and survivors of the Holocaust. We will honour them by continuing to fight hate, protect the most vulnerable, and make the world a more peaceful and prosperous place for everyone by vowing “Never Again”.”</p></div>\n      "
}