{
  "path": "/en/news/readouts/2022/03/02/prime-minister-justin-trudeau-speaks-president-senegal-macky-sall",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Senegal Macky Sall | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Senegal, Macky Sall.</p>\n\n<p>The Prime Minister strongly condemned Russia’s unjustifiable and unprovoked invasion of Ukraine, as well as its large-scale military aggression against the territorial integrity, sovereignty, and independence of Ukraine. The Prime Minister expressed his profound concern for Ukraine and its people.</p>\n\n<p>Both leaders discussed the horrific cost of war and the unfolding humanitarian crisis, and agreed on the importance of international humanitarian law and the Charter of the United Nations. They discussed challenges faced by democracies and the importance of stepping up to defend democratic values and open and inclusive societies.</p>\n\n<p>Prime Minister Trudeau congratulated President Sall on being elected Chairman of the African Union (AU) for 2022, and reiterated Canada’s steadfast commitment to the AU’s important role in promoting an integrated, prosperous, and peaceful Africa.&nbsp;The two leaders also exchanged views on peace and security in the region, including the ongoing conflict in Ethiopia.</p>\n\n<p>Prime Minister Trudeau and President Sall discussed the strong and longstanding relationship between Canada and Senegal, including in trade and investment. They reaffirmed their shared commitment in strengthening bilateral relations between the two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/senegal/bilateral_relations_bilaterales/canada_senegal.aspx?lang=eng\">Canada-Senegal Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/au.aspx?lang=eng\">Canada and the African Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/02/13/canada-working-partners-senegal-advance-shared-priorities\">Canada working with partners in Senegal to advance shared priorities</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}