{
  "path": "/en/news/readouts/2022/05/10/prime-minister-justin-trudeau-speaks-chancellor-germany-olaf-scholz",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor of Germany Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Chancellor of Germany, Olaf Scholz.</p>\n\n<p>The Prime Minister and Chancellor commended the Ukrainian people for their unwavering courage in the face of Russian aggression. They reiterated their strong support for Ukrainian President Volodymyr Zelenskyy and his government, and committed to ongoing economic, security, and humanitarian support for Ukraine.</p>\n\n<p>The leaders expressed concern for the broader global impacts of the war, including its effects on energy and food security, and agreed to further coordinate on international responses, especially in the lead-up to the G7 Summit to be hosted in Germany in June. Prime Minister Trudeau recognized the significant efforts and sacrifices made by European partners and allies, including Germany. The leaders agreed to maintain close alignment and coordination to continue supporting Ukraine and further isolate Russia economically.</p>\n\n<p>The leaders followed up on commitments made during the Prime Minister’s visit to Berlin in March to deepen bilateral collaboration on shared priorities. They discussed progress on our cooperation on critical mineral and energy supply chains, as well as the adoption of carbon pricing policies globally.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz agreed to continue working together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/09/prime-minister-participates-successful-visit-germany\">Prime Minister participates in successful visit to Germany</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/03/24/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n</ul></div>\n      "
}