{
  "path": "/en/news/statements/2017/02/01/statement-prime-minister-canada-black-history-month",
  "pageTitle": "Statement by the Prime Minister of Canada on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to celebrate Black History Month:</p>\n<p>“Throughout our history, Black Canadians have played a key role in building and shaping the diverse, compassionate, and prosperous country that we are all so proud to call home.&nbsp;</p>\n<p>“Every February, Canadians celebrate Black History Month by acknowledging the remarkable achievements and contributions that Canadians of African and Caribbean descent have made to Canada. &nbsp;</p>\n<p>“I urge all Canadians to reflect on the bravery and courage of individuals like Viola Desmond, a prominent Black Canadian businesswoman who changed the course of Canadian history by defiantly refusing to leave a whites-only area of a movie theatre in 1946.</p>\n<p>“In recognition of her impact on the civil rights and freedoms movement in Canada, the Government of Canada chose Viola Desmond as the face of Canada’s <a href=\"http://www.fin.gc.ca/n16/16-157-eng.asp\">ten dollar bank note</a>.</p>\n<p>“This year, as we celebrate the 150<sup>th</sup> anniversary of Confederation, let us never forget the stories of Black Canadians’ courage in the face of intolerance. Diversity is our greatest strength, and we must always continue to build a country that affords equality and opportunity for all.</p>\n<p>“On behalf of the Government of Canada, Sophie and I encourage all Canadians to participate in the many events that will take place across the country throughout February.</p>\n<p>“Together, let us celebrate the heritage of Black Canadians, and honour the integral role they have played in shaping our democratic and free society.”</p>\n<p><strong>Associated link</strong></p>\n<ul>\n<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a></li>\n</ul></div>\n      "
}