{
  "path": "/en/news/statements/2020/10/24/statement-prime-minister-united-nations-day",
  "pageTitle": "Statement by the Prime Minister on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/un-day\">United Nations Day</a>, we recognize what we can achieve when countries around the world work together toward shared goals.</p>\n\n<p>“In 1945, the United Nations (UN) was created to provide a forum where countries can join forces to build a world that is safe, peaceful, and prosperous for everyone. Since then, it has helped improve the lives of millions of people, including by fighting HIV and AIDS, ending wars, averting famines, and addressing the needs of the world’s poorest and most vulnerable. It has also brought to light once invisible issues, such as modern-day slavery and the use of child soldiers.</p>\n\n<p>“As we mark the UN’s 75th anniversary, Canada remains a proud founding member. From our leadership efforts to modernize peacekeeping, to our support for refugees, to our promotion of human rights and social progress, we are committed to working with other countries to shape a better future. That is why in 2015, we joined fellow UN Member States to design the blueprint for our collective future with the <a href=\"https://www.un.org/sustainabledevelopment/development-agenda/\">2030 Agenda</a> and its 17 interconnected Sustainable Development Goals. Our country remains as committed as ever to achieving this vision for a better world.</p>\n\n<p>“This year, we are facing some of the most critical challenges of our generation. We find ourselves in the midst of crises that know no borders, and our response will determine the future of our health, our environment, and our societies. Now, more than ever, we must act together as partners to address the serious issues before us – whether fighting the global COVID-19 pandemic, tackling climate change and protecting biodiversity, or ending poverty and inequality.</p>\n\n<p>“The pandemic has gone from a health crisis to an unprecedented global development emergency, pushing people into poverty and creating food insecurity. Global cooperation is and will be essential to protecting people’s health, saving lives, and defeating the pandemic, which is why we are taking action alongside our international partners. This includes co-leading the global <a href=\"https://www.un.org/en/coronavirus/financing-development\">Initiative on Financing for Development in the Era of COVID-19 and Beyond</a> with Jamaica and the UN Secretary-General.</p>\n\n<p>“Canada has answered the call from the UN, providing significant financial support to its agencies involved in the response to the pandemic. We have also given our support to the World Food Programme, which was recognized this year with the Nobel Peace Prize. In July, our Canadian Armed Forces delivered more than 82,500 kilogrammes of COVID-19 related supplies to countries in need on behalf of the Programme and the World Health Organization. And, in September, Canada announced <a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/prime-minister-co-chairs-high-level-meeting-address-economic\">an additional $400 million in international development funding</a> for our trusted partners on the ground fighting COVID-19 in developing countries, to address short-term humanitarian and development needs.</p>\n\n<p>“This year’s challenges may have encouraged isolation and stoked distrust, but Canada will continue to work with our partners to build a more peaceful and inclusive world. For instance, we are bringing innovative approaches to UN peacebuilding, and chairing the UN Peacebuilding Commission for 2020. We know that building lasting peace is only possible when we fully involve women in the process, which is why this is at the heart of Canada’s feminist foreign policy. We are dedicated to working with other UN Member States, including through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative</a>, to ensure a gender perspective in all our efforts to foster and maintain peace, address humanitarian crises, and deliver international assistance.</p>\n\n<p>“Looking beyond 75 years, we have an opportunity to work together to decide our future. If we anchor ourselves in the ideals that the UN was founded upon – peace and security, international cooperation, and respect for human rights – we can emerge from today’s crises stronger and more united than ever.”</p></div>\n      "
}