{
  "path": "/en/news/readouts/2023/01/12/prime-minister-justin-trudeau-meets-prime-minister-japan-kishida-fumio",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Japan, Kishida Fumio. The leaders reaffirmed the strength of Canada and Japan’s strategic partnership as well as their shared commitment to a free, open, and inclusive Indo-Pacific region. The leaders committed to continue working closely to grow our economies, create good jobs in both countries, strengthen the rules-based international system, and improve regional security, including through Canada’s recently announced Indo-Pacific Strategy and Japan’s National Security Strategy.</p>\n\n<p>The leaders discussed strengthening bilateral trade, investment, and innovation, and reinforcing supply chain resilience and economic security to create good middle-class jobs and new opportunities for our businesses. They talked about expanding cooperation in areas such as agriculture and agri-food, energy, critical minerals, and emerging technologies. They also discussed their shared commitment to maintain and build on the Comprehensive and Progressive Agreement for Trans-Pacific Partnership’s (CPTPP) high standards, which facilitate growth and job creation for both countries.</p>\n\n<p>They announced a planned incoming mission to Canada in early spring of 2023 welcoming Japanese companies seeking new partners and investment opportunities in Canada related to zero-emission vehicles and batteries. They also announced Canada’s plan to undertake a Team Canada trade mission to Japan in October as part of Canada’s Indo-Pacific Strategy.</p>\n\n<p>The prime ministers discussed Japan’s priorities for its upcoming G7 Presidency and the importance of continued G7 coordination to uphold the rules-based international system, in light of new and emerging global challenges. They will maintain close cooperation between G7 members to denounce Russia’s unjustifiable and illegal aggression against Ukraine, and to protect Ukraine’s sovereignty and territorial integrity. Prime Minister Trudeau raised the importance of maintaining work on the G7’s Gender Equality Advisory Council.</p>\n\n<p>The leaders shared concerns about the wider global impacts of Russia’s military aggression against Ukraine, notably for the Global South, with shortages and rising prices of food, fuel, and fertilizer. They committed to working together, including with G7 partners, to find practical ways to mitigate these impacts, particularly for the most vulnerable people, and to address their significant implications for the Indo-Pacific region. Prime Minister Trudeau also raised the importance of G7 members engaging on issues around the world, including anti-regime protests in Iran and the humanitarian and security crisis in Haiti.</p>\n\n<p>Prime Minister Kishida shared details of Japan’s new National Security Strategy. The two leaders discussed their concerns about China’s actions in the region and agreed on the importance of a coordinated approach to security in the Indo-Pacific. They talked about their deep concern with the threat of North Korea’s nuclear weapons and ballistic missile programs and reiterated their support for a complete, verified, and irreversible dismantlement of North Korea’s nuclear weapons. The prime ministers reaffirmed their commitment to the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON.</p>\n\n<p>The prime ministers also hosted Canadian and Japanese business leaders for a luncheon, to share their vision for a stronger trade, investment, and innovation partnership. They highlighted the growing and exciting business potential between the two countries.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Kishida agreed to remain in close contact as Japan prepares to host the G7 Summit in Hiroshima, in May 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/japan-japon/relations.aspx?lang=eng\">Canada-Japan relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/01/05/prime-minister-japan-kishida-fumio-visit-canada\">Prime Minister of Japan Kishida Fumio to visit Canada</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/indo-pacific-indo-pacifique/index.aspx?lang=eng\">Canada’s Indo-Pacific Strategy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-neon.html\">Operation NEON</a></li>\n</ul></div>\n      "
}