{
  "path": "/en/news/news-releases/2020/09/09/prime-minister-announces-support-black-entrepreneurs-and-business",
  "pageTitle": "Prime Minister announces support for Black entrepreneurs and business owners | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every day, Black business owners and entrepreneurs make invaluable contributions to communities across the country, and their success is essential to Canada’s economic recovery and future prosperity.</p>\n\n<p>The COVID-19 pandemic has highlighted and exacerbated existing systemic barriers faced by Black entrepreneurs and small and medium-sized business owners in Canada. While we have made progress in advancing equitable access to support and opportunities, much more needs to be done to better help Black business owners and entrepreneurs, and address anti-Black racism.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced investments of up to nearly $221 million in partnership with Canadian financial institutions – including up to nearly $93&nbsp;million from the Government of Canada over the next four years – to launch Canada’s first-ever Black Entrepreneurship Program. This program will help thousands of Black business owners and entrepreneurs across the country recover from this crisis and grow their businesses.</p>\n\n<p>The program will include:</p>\n\n<ul>\n\t<li>up to $53 million to develop and implement a new National Ecosystem Fund to support Black-led business organizations across the country. It will help Black business owners and entrepreneurs access funding and capital, mentorship, financial planning services, and business training.</li>\n\t<li>up to $33.3 million in support through the new Black Entrepreneurship Loan Fund that will provide loans of between $25,000 and $250,000 for Black business owners and entrepreneurs. The Government of Canada is also partnering with financial institutions, including RBC, BMO Financial Group, Scotiabank, CIBC, National Bank, TD, Vancity, and Alterna Savings, to make up to $128 million available in additional lending support.</li>\n\t<li>up to $6.5 million to create and sustain a new Black Entrepreneurship Knowledge Hub that will collect data on the state of Black entrepreneurship in Canada and help identify Black entrepreneurs’ barriers to success as well as opportunities for growth. The Hub will be run by Black-led community and business organizations, in partnership with educational institutions.</li>\n</ul>\n\n<p>The government is committed to working closely with Black business owners and Black-led organizations across Canada so that the new Black Entrepreneurship Program reflects the realities and needs of Black Canadians. The new program builds on the Government of Canada’s work to address systemic racism against Black Canadians. This includes taking steps to advance Canada’s Anti-Racism Strategy, justice reforms, modern policing structures and standards, and enhanced local community supports for young Black Canadians.</p>\n\n<p>The Government of Canada will continue to support Black entrepreneurs and create opportunities for Black-owned businesses so that they can recover from the economic impacts of COVID-19 and grow in the months and years to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The pandemic has shone a light on the inequalities that disproportionately hurt Black Canadians, and has underscored the need to restart our economy in a way that allows all Canadians an equal chance to succeed. That is why today – thanks in part to the leadership, advocacy, and expertise of Black business owners and Black-led organizations – we are announcing Canada’s first-ever Black Entrepreneurship Program. As we move forward, this program will help support Black entrepreneurs and create new opportunities for Black-owned businesses, so they are well-positioned for our economic recovery.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“For too long, Black entrepreneurs and business owners have faced systemic barriers to their success, and the COVID-19 pandemic has had a disproportionate effect on them. With Canada’s first-ever Black Entrepreneurship Program, our government is taking real action to support Black entrepreneurs recovering from COVID-19, and empower them to start up, innovate, grow, and succeed. We will continue to do whatever it takes to support all small business owners and entrepreneurs across the country.”</p>\n\n<footer class=\"default\">The Hon. Mary Ng, Minister of Small Business, Export Promotion and International Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our commitment to diversity and inclusion is unwavering, and the new Black Entrepreneurship Program reflects this. This program was created through collaboration with Black-led organizations, because Black Canadians know what their communities need best. This is another step towards removing the systemic barriers that exist within our society to create a truly inclusive Canada.”</p>\n\n<footer class=\"default\">The Hon. Bardish Chagger, Minister of Diversity and Inclusion and Youth</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada will launch a call for proposals for Black-led organizations to join and help deliver the National Ecosystem Fund for Black entrepreneurs. More details, including eligibility criteria and how to apply, will follow in the coming weeks.</li>\n\t<li>Canada’s Regional Development Agencies will deliver the National Ecosystem Fund, and work with selected partner organizations to assist them in implementing their services.</li>\n\t<li>The Black Entrepreneurship Loan Fund will be available through Black-led business organizations supported through the National Ecosystem Fund. Further details on eligibility requirements and how to apply for loans will follow from the Government of Canada. The initial commitments made by financial institutions are subject to final development of the Loan Fund.</li>\n\t<li>A total of up to $3.3 million out of the $33.3 million for the Black Entrepreneurship Loan Fund and of up to $1.5 million out of the $6.5 million for the Black Entrepreneurship Knowledge Hub will be in operating funding.</li>\n\t<li>As part of our work to better understand the barriers faced by and needs of Black entrepreneurs in Canada, Statistics Canada will work to improve disaggregated data collection on Black entrepreneurship.</li>\n\t<li>To support Canadians throughout COVID-19, the Government of Canada introduced the largest relief package in our country’s history, which includes the following major programs for business owners and their employees:\n\t<ul>\n\t\t<li>The <a href=\"https://ceba-cuec.ca/\">Canada Emergency Business Account</a> (CEBA) provides businesses and not-for-profits with a $40,000 interest-free, partially forgivable loan through participating Canadian financial institutions. On August 31, the government extended the application period for the program to October 31, 2020, and indicated it was working closely with financial institutions to make CEBA available to those with qualifying payroll or non-deferral expenses that have so far been unable to apply due to not operating from a business banking account.</li>\n\t\t<li>The <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a> (CEWS) helps businesses by covering a percentage of payroll, retroactive to March 15, with the intention to continue support into December.</li>\n\t\t<li>The <a href=\"https://www.cmhc-schl.gc.ca/en/Finance-and-Investing/covid19-cerca-small-business\">Canada Emergency Commercial Rent Assistance</a> (CECRA) for small businesses is helping businesses that were forced to close – through support to landlords – by covering 75 per cent of their April, May, June, July, and August commercial rent. On September 8, 2020, the government extended the assistance with additional support for September for those who previously qualified through the CECRA.</li>\n\t</ul>\n\t</li>\n\t<li>Launched in 2019, <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a> was designed to take immediate steps in combatting racism and discrimination, by demonstrating federal leadership, empowering communities, and building awareness and changing attitudes.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}