{
  "path": "/en/news/readouts/2020/04/14/prime-minister-justin-trudeau-speaks-his-royal-highness-prince-wales",
  "pageTitle": "Prime Minister Justin Trudeau speaks with His Royal Highness The Prince of Wales | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with His Royal Highness The Prince of Wales to discuss the impacts of COVID-19.</p>\n\n<p>Prime Minister Trudeau wished The Prince of Wales good health in his recovery from COVID-19.</p>\n\n<p>Prime Minister Trudeau spoke about the significant measures being taken to protect the health and safety of Canadians, and to support workers and businesses. The Prince of Wales passed on his best wishes to Canadians during this time.</p>\n\n<p>The Prime Minister and The Prince of Wales spoke about the effects COVID-19 is having around the world, including in Commonwealth countries. They agreed that global coordination, including on vaccine development, and support for more vulnerable countries is essential to address the wide-ranging impacts of the virus, which knows no borders.</p>\n\n<p>The Prime Minister expressed appreciation for the message from Her Majesty The Queen to the people of Canada. He noted the hope and encouragement it brought to Canadians, who are working hard to stop the spread of COVID-19 and protect those most at risk.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en/media/news/2020/message-her-majesty-queen-people-canada-covid-19-pandemic\">Message from Her Majesty The Queen to the people of Canada on the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/14/prime-minister-announces-health-and-social-support-northern\">Prime Minister announces health and social support for northern communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n</ul></div>\n      "
}