{
  "path": "/en/news/news-releases/2018/05/04/prime-minister-announces-appointment-new-chief-justice-new-brunswick",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of New Brunswick | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable J.C. Marc Richard, a judge of the Court of Appeal of New Brunswick, to the position of Chief Justice of New Brunswick.</p><p>He replaces the Honourable J. Ernest Drapeau, who elected to become a supernumerary judge effective April 27, 2018, after 20 years of distinguished service as a judge.</p><h2>Quote</h2><p>“I am pleased to announce the appointment of J.C. Marc Richard as Chief Justice of New Brunswick. He is truly one of Canada’s preeminent jurists, and has been widely recognized throughout his 15-year judicial career for his ability to apply the law in a way that is both principled and thoughtful. He leads by example, and I wish him well in this new role.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p><h2>Quick Facts</h2><ul><li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li><li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li><li>The Chief Justice of New Brunswick is a judge of the Court of Appeal and exercises the duties of that office as part of a team of five other regular judges and two supernumerary judges.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/05/04/honourable-jc-marc-richard\">The Honourable J.C. Marc Richard</a></li></ul></div>\n      "
}