{
  "path": "/en/news/statements/2017/09/21/statement-prime-minister-armenias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Armenia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement in recognition of Armenia’s Independence Day:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we join the people of Armenia and members of the Armenian community in Canada and around the world to celebrate the anniversary of Armenia’s independence. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Canada and the Republic of Armenia </span><span lang=\"EN\" xml:lang=\"EN\">enjoy a dynamic and friendly relationship, built upon shared values of justice, democracy and freedom, </span><span lang=\"EN-US\" xml:lang=\"EN-US\">people-to-people connections, and our collaboration in international organizations, including La Francophonie. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Canada looks forward to continuing to work with the Republic of Armenia to further strengthen the relationship between our two countries, and to deepen our collaboration on global and regional issues, including climate change, development cooperation, trade and investment, and peace and security.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Canada’s cultural diversity is one of our greatest strengths and sources of pride. I commend the Armenian Canadian community for their generosity and leadership in welcoming thousands of newcomers from Syria. When we come together to welcome newcomers, we strengthen our communities in long-lasting and significant ways. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“This year, as we mark the 150<sup>th</sup> anniversary of Confederation, </span><span lang=\"EN-US\" xml:lang=\"EN-US\">I invite Canadians to reflect on the important contributions Canadians of Armenian descent make to our national fabric. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, Sophie and I wish a happy Independence Day to all those celebrating.”</span></p></div>\n      "
}