{
  "path": "/en/news/news-releases/2017/09/18/prime-minister-canada-announces-closer-collaboration-united-kingdom",
  "pageTitle": "Prime Minister of Canada announces closer collaboration with the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, met today with Prime Minister Theresa May of the United Kingdom&nbsp;(UK).</p><p>The two leaders took the opportunity to set the foundation for an even stronger Canada-UK relationship, especially in the areas of trade and innovation, defence and security, domestic policy coordination, and promotion of common values such as gender equality.</p><p>They reiterated the importance of ensuring the early ratification of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) while the UK is still a member of the EU. They also emphasized their desire for a seamless transition on trade as the UK exits the EU.</p><h2>Quote</h2><blockquote><p>“From mutual values to a shared sovereign, few countries have as much in common as Canada and the UK. Prime Minister May and I met today to deepen our historic partnership on a number of issues, and to ensure the continued prosperity of people and businesses on both sides of the Atlantic.”<br><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>During Prime Minister May’s visit, the two leaders announced numerous initiatives aimed at expanding and enhancing Canada-UK relations, including:<ul><li><b>Launch of the Canada-UK ministerial strategic dialogue: </b>Canada’s Minister of Foreign Affairs and the UK’s Secretary of State for Foreign and Commonwealth Affairs, together with Ministers of Defence and International Development, will meet annually for a strategic dialogue.</li><li><b>Strategic partnership to champion gender equality:&nbsp;</b>The two Prime Ministers are committed to gender equality and women’s empowerment. They agreed to deepen collaboration at home and abroad to make concrete gains toward women’s economic empowerment and increased leadership in corporate governance and business, as well as their access to quality education and skills training. Canada and the UK will also collaborate to promote sexual and reproductive health and rights, prevent gender-based violence, and advance the women, peace and security agenda. Canada and the UK will move forward on joint diplomacy and advocacy, including by leveraging our respective program investments.</li><li><b>Partnership on clean growth and climate change: </b>A Canada-UK clean innovation partnership, comprising both government officials and representatives from the private sector, will be established to advance clean innovation and clean and renewable energy.</li><li><b>Partnership on innovation: </b>A Canada-UK memorandum of understanding (MOU) concerning science, technology, innovation and entrepreneurship will increase collaboration amongst respective government bodies, knowledge-based institutions and businesses to accelerate the commercialization of emerging technologies, growth of private enterprises, and the creation of jobs in both countries. This MOU will translate into concrete action between our respective innovation-focussed agencies to develop commercial opportunities.</li><li><b>Close cooperation on disaster response, reconstruction and resilience: </b>Canada and the UK are working closely to respond to the impact of Hurricane Irma on the Caribbean region. Through both civilian organizations and our militaries, we are helping our citizens evacuate to safety, coordinating the timely delivery of humanitarian assistance, and providing financial support to humanitarian relief organizations responding to immediate needs. The two countries will continue to work together to help the Caribbean countries build back better in keeping with our shared commitment to the region.</li><li><b>Development cooperation: </b>The Prime Ministers reaffirmed the strong partnership between Canada and the UK on development. They committed to work together to promote transformative actions to tackle global development challenges, implement the Sustainable Development Goals through innovative approaches and partnerships, and build an international system fit for purpose to deliver effective aid to the world’s most vulnerable people.&nbsp;</li><li><b>Partnership on digital government service: </b>A Canada-UK MOU on digital government services will be established to improve digital government services and make sure that they are simple, responsive, and easy to use.</li><li><b>Deeper cooperation on defence and security:</b> Canada and the UK will continue to partner in Ukraine to support defence reform and institutional capacity building.&nbsp;Both Canada and the UK see NATO as a cornerstone of our respective national security, and we will strengthen our work together at NATO in areas of common interest, such as cyber security. As Framework Nations, we remain steadfast in our commitment to NATO’s enhanced Forward Presence in the Baltic region.</li><li><b>Creation of a Canada-UK public policy forum: </b>A Deputy Minister/Permanent Secretary level public policy forum will be established and co-chaired by the respective Secretaries to the Cabinet. This structured dialogue will help to keep our respective Westminster-style democracies vibrant, inclusive and innovative. Four working groups will be created on:<ul><li>Gender equality and women’s empowerment;</li><li>Post-Brexit bilateral relations, including to ensure a seamless transition of agreements such as on trade, air services and nuclear cooperation as the UK exits the European Union;</li><li>Modern economies, to prepare for the future of work, skills, technical training and continuous learning; and</li><li>Public service transformation and effectiveness.</li></ul></li></ul></li><li>Prime Minister Trudeau last met with Prime Minister May at the G7 Summit in May 2017 in Italy.</li><li>In 2011, over 11.3 million Canadians claimed British ancestry. The UK was the ninth-largest source of new permanent residents in Canada in 2015.</li><li>Canada and the UK enjoy a productive commercial relationship. Two-way merchandise trade between Canada and the UK totaled over $25.3 billion in 2016 making the UK Canada’s fifth-largest merchandise trade partner.</li><li>The two countries share a sovereign, and have among the oldest continuous traditions of parliamentary democracy.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/index.aspx?lang=eng\">High Commission of Canada in the United Kingdom</a></li><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom</a></li></ul></div>\n      "
}