{
  "path": "/en/news/statements/2020/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement on World AIDS Day:</p>\n\n<p>“Today, on&nbsp;<a href=\"https://www.unaids.org/en/World_AIDS_Day\" target=\"_blank\">World AIDS Day</a>, we show our solidarity with people living with HIV and AIDS, here in Canada and around the world. We mourn the loved ones we have lost, and renew our commitment to&nbsp;supporting those who live with HIV and ending this epidemic and the stigma&nbsp;that surrounds it.</p>\n\n<p>“In 2020, the COVID-19 pandemic has reminded us all of the importance of community and has shown us that no one is safe until everyone is safe. This year’s World AIDS Day theme,&nbsp;<a href=\"https://spark.adobe.com/page/OdpIRTRApOghp/\">‘Global solidarity, shared responsibility’</a>, recognizes that, like COVID-19, fighting HIV and AIDS requires global cooperation and united commitment.</p>\n\n<p>“Canada recognizes the value of the international community working together, particularly when it comes to public health. That is why the Government of Canada continues to invest in the <a href=\"https://www.theglobalfund.org/en/\">Global Fund to Fight AIDS, Tuberculosis, and Malaria</a>. Canada’s pledge of $930.4 million to the&nbsp;fund will support the prevention and treatment of these diseases while helping to address gender and social inequalities, like poverty, that further their spread. In 2019 alone, the Global Fund provided antiretroviral therapy for 20.1 million people.</p>\n\n<p>“The government has also taken action to combat HIV and AIDS here at home. We have made&nbsp;important investments in HIV and AIDS research,&nbsp;and launched the&nbsp;<a href=\"https://www.canada.ca/en/public-health/services/reports-publications/accelerating-our-response-five-year-action-plan-sexually-transmitted-blood-borne-infections.html#a0-2\" target=\"_blank\">Five-Year Action Plan on Sexually Transmitted and Blood-Borne Infections</a>. This plan supports community-based action to improve access to HIV treatment and care, prevent new cases, and reduce transmission. We also provided funding support for clinical trials that helped introduce the first self-test kits for HIV in Canada this year. Our government was also the first to officially endorse the Undetectable = Untransmittable campaign to help recognize that people who maintain a suppressed viral load through HIV treatment have effectively no risk of sexually transmitting the virus to someone else. These investments and actions are part of Canada’s ongoing commitment to advance sexual and reproductive health and rights for all, and to reduce stigma.</p>\n\n<p>“For three decades, people living with HIV and their communities have shown the world what success looks like when it comes to community-based public health responses. Though there has been much progress, there remains a lot of work to be done – especially in light of the COVID-19 pandemic. We need to make sure that progress and lessons learned from the HIV and AIDS response are not lost in our response to COVID-19 – and that our lessons learned from the COVID-19 response are applied to our HIV and AIDS response.</p>\n\n<p>“Many vulnerable people hit hardest by COVID-19 around the world continue to lose their lives to the virus at rates higher than everyone else – some are also affected by HIV and AIDS, and COVID-19 has intensified the challenges they face. Yet, the crisis has also been an opportunity for Canadians to come together in new ways to support one another. From coast to coast to coast, Canadians have taken action to protect those most at-risk, including shopping for neighbours, picking up mail for friends, and dropping off medication for family members.</p>\n\n<p>“Everyone deserves access to adequate and equal health treatment, care, and support.&nbsp;The Government of Canada will continue to promote and defend comprehensive sexual and reproductive health rights, and support efforts to end the HIV and AIDS epidemic and the stigma that surrounds it. Together, we will meet this global health challenge.”&nbsp;</p></div>\n      "
}