{
  "path": "/en/news/news-releases/2018/07/12/prime-minister-announces-increased-support-nato",
  "pageTitle": "Prime Minister announces increased support for NATO | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at this year’s NATO Summit in Brussels, Belgium, where he announced increased support for NATO. These contributions underscore Canada’s commitment to play an active role in the Alliance and advance international peace, security, and stability.</p><p>While in Latvia earlier this week, the Prime Minister announced Canada will extend its contribution to NATO’s enhanced Forward Presence through Operation REASSURANCE for another four years and increase the number of personnel taking part in this mission from 455 to 540.</p><p>At the Summit, the Prime Minister outlined several other leadership roles Canada will undertake as an active and key partner within NATO. Our country will provide up to 25 personnel within the next five years to NATO’s Airborne Warning and Control System program. This contribution represents Canada’s return to the program since pulling out progressively during the 2012-14 period.</p><p>We will also contribute to the new NATO Command Structure and support the new United States Readiness Initiative. Canada is now a member of the European Centre of Excellence for Countering Hybrid Threats and will join the Cooperative Cyber Defence Centre of Excellence.</p><p>Prime Minister Trudeau also announced yesterday that Canada will assume command of a new NATO training and capacity building mission in Iraq for its first year. This is the next natural step for Canada, as we move forward from a successful fight against Daesh to helping Iraq transition into a country of long-lasting peace and security.</p><p>Canada, the largest contributor to NATO’s Women, Peace, and Security Office, will also provide $26.7 million to improve women and girls’ livelihoods in Iraq and Syria, as announced today by Canada’s Foreign Affairs Minister, Chrystia Freeland, at the Foreign Ministers’ Meeting of the Coalition Against Daesh in Brussels. Gender equality and the empowerment of women and girls are essential to building real and lasting peace in both countries. We will continue to support efforts to modernize the Alliance and advance its women, peace, and security agenda.</p><p>During the Summit, the Prime Minister also took part in the North Atlantic Council, the principal decision-making body within NATO that encourages collaboration on policy and operational issues related to matters of security that affect the whole Alliance.</p><p>On the margins of the Summit, the Prime Minister met with several NATO allies and partners.</p><h2>Quotes</h2><blockquote><p>“When it comes to NATO, Canada has always pulled its weight. Our engagement in NATO has only expanded over the years, and with good reason: it reflects Canadian values, and is essential in preserving the rules-based international order. We will continue to step up and work together with our Allies to build a safer, more peaceful world for our citizens and people around the world.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“We are pleased to make a new commitment to the Airborne Warning and Control System program after the previous government withdrew. This demonstrates Canada’s strong commitment to the Alliance and to peace and security around the world.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and 11 other countries founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. Over the past 69 years, NATO has proven itself as a major contributor to international peace and security.</li><li>Since 2014, Canada has actively worked alongside NATO allies to maintain security and stability in Central and Eastern Europe. Measures include training, exercises, and other operational tasks.</li><li>Last year, the Government of Canada unveiled Strong, Secure, Engaged – a comprehensive, ambitious, once-in-a-generation defence policy which includes historic new funding for Canada’s military.</li><li>The new defence policy represents an increase of more than 70% of Canada’s defence budget between 2016 and 2026, and will give Canada’s armed forces the capability to be even more active beyond its borders, and expand its active leadership in NATO.</li></ul><h2>Related product</h2><ul><li><a href=\"/en/news/backgrounders/2018/07/12/canada’s-commitments-nato\">Canada’s commitments to NATO</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/07/11/canada-assume-command-new-nato-training-mission-iraq\">Prime Minister announces new NATO mission in Iraq</a></li><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/nato-ee.page\">Operation REASSURANCE</a></li></ul></div>\n      "
}