{
  "path": "/en/news/readouts/2022/11/16/prime-minister-justin-trudeau-speaks-president-poland-andrzej-duda",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Poland Andrzej Duda | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Poland, Andrzej Duda.</p>\n\n<p>Prime Minister Trudeau expressed his condolences for the loss of life in the explosions that occurred in Eastern Poland on November 15, 2022.</p>\n\n<p>The Prime Minister and the President discussed the need for a thorough investigation to determine the cause of the explosions. The leaders agreed on the need to work in partnership with North Atlantic Treaty Organization (NATO) Allies and other partners, and that the ongoing violence is the full responsibility of Russian’s unjustifiable and unprovoked invasion. The Prime Minister saluted the strength and resolve of the Polish people in support of the Ukrainian people since the outset of the invasion.</p>\n\n<p>The two leaders agreed to stay in touch and to continue working alongside other members of the international community, including NATO, to promote security and stability in the region, while also holding Russia to account for its unjustifiable invasion of Ukraine.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/11/16/joint-statement-nato-and-g7-leaders-margins-g20-summit-bali\">Joint Statement of NATO and G7 Leaders on the margins of the G20 Summit in Bali</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-president-poland-andrzej-duda\">Prime Minister Justin Trudeau meets with President of Poland Andrzej Duda</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n</ul></div>\n      "
}