{
  "path": "/en/news/news-releases/2022/03/04/better-public-transit-mississauga",
  "pageTitle": "Better public transit for Mississauga | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Building better public transit systems shortens commute times, creates good middle-class jobs, and cleans our air. Since&nbsp;2015, the Government of Canada has made historic investments in public transit to build cleaner communities across the country, and we will continue to make these critical investments as we recover from the COVID‑19 pandemic.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by Ontario’s Associate Minister of Transportation (GTA), Stan Cho, and the Mayor of Mississauga, Bonnie Crombie, to announce a joint investment of more than $675&nbsp;million to support three new projects that will improve public transit in Mississauga.</p>\n\n<p>This investment will:</p>\n\n<ul>\n\t<li>purchase 358 new hybrid buses through the Mississauga Bus Replacement Program to replace existing diesel vehicles, cut pollution, and improve the quality and reliability of transit in Mississauga;</li>\n\t<li>design and deliver a new rapid transit bus corridor along Dundas Street, from Confederation Parkway to the Etobicoke Creek, to increase access to Mississauga’s public and active transportation infrastructure; and</li>\n\t<li>upgrade Mississauga’s existing bus corridors, including by constructing priority bus lanes at intersections to reduce traffic and commute times.</li>\n</ul>\n\n<p>These projects will help people in Mississauga get around in better and faster ways, while cutting air pollution and fighting climate change.</p>\n\n<p>Since 2015, the Government of Canada has supported more than 1,300 public transit projects across Canada, including more than 800 projects in Ontario alone. As we recover from the COVID-19 pandemic, Canada will continue to invest in modern, efficient, and clean public transit infrastructure to build healthier communities and create good middle-class jobs across the country.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s investments will make Mississauga an even better place to live and work by helping Canadians get where they need to be in cleaner, faster, and more affordable ways. Improving public transit across the country makes our communities healthier and fights climate change, while creating good middle-class jobs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since day one, we have been building better public transit for people throughout Ontario. By working across all levels of government, we’ve been able to deliver transformative and sustainable infrastructure projects that will improve people’s lives. These projects in Mississauga will make it easier for transit riders to get from Point A to Point B, ensuring they have more time to spend with their family, friends and loved ones.”</p>\n\n<footer class=\"default\">Stan Cho, Ontario’s Associate Minister of Transportation (GTA)</footer>\n</blockquote>\n\n<blockquote>\n<p>“Mississauga is a rapidly growing city that boasts several transportation options for residents to get to their destination. The investments in public transit and active transportation our government is making with its provincial and municipal partners will ensure that the local system can keep up with the pace of growth. Whether Canadians use transit once in a while or every day, our government will be there to ensure that they can get to where they need to go in greener, more accessible, and efficient ways.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Providing Canadians with a reliable transit system is key to building Canada’s economic prosperity. The investments announced today will transform our community in Mississauga. Together, we are building sustainable communities of the future.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is a big day for Mississauga and I want to sincerely thank the Government of Canada and the Government of Ontario for investing in Mississauga, our residents and our future. These investments will significantly strengthen our local transit system while helping us reach our climate targets. Funding to build rapid bus transit along Dundas Street, in particular, will make it easier for residents to travel to and from Mississauga and is critical for regional economic growth and recovery. The Dundas BRT will further strengthen our east to west connections, reducing travel times and connecting people to more job opportunities and businesses to more customers.”</p>\n\n<footer class=\"default\">Bonnie Crombie, Mayor of Mississauga</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The addition of the rapid transit bus corridor along Dundas Street will save commuters an estimated six to 17 minutes per trip.</li>\n\t<li>The Government of Canada is investing more than $271&nbsp;million to support these three projects through the Public Transit Infrastructure Stream of the Investing in Canada Infrastructure Program. The Government of Ontario is contributing over $225&nbsp;million, and the City of Mississauga is providing more than $180&nbsp;million.</li>\n\t<li>Through the Investing in Canada Plan, the Public Transit Infrastructure Stream of the Investing in Canada Infrastructure Program provides provinces, territories, and municipalities with funding to address the new construction, expansion, and improvement and rehabilitation of public transit infrastructure, and active transportation projects.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"http://www.canada.ca/en/office-infrastructure/news/2022/03/canada-ontario-and-mississauga-announce-funding-to-modernize-public-transit-in-mississauga.html\">Backgrounder : Canada, Ontario and Mississauga announce funding to modernize public transit in Mississauga</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/icp-pic-INFC-eng.html\">Investing in Canada Infrastructure Program</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n\t<li><a href=\"http://www.infrastructure.gc.ca/map\">Investing in Canada Plan Project Map</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/prog-proj-on-eng.html\">Federal infrastructure investments in Ontario</a></li>\n</ul></div>\n      "
}