{
  "path": "/en/news/statements/2021/04/06/statement-prime-minister-third-anniversary-tragic-bus-crash-involving",
  "pageTitle": "Statement by the Prime Minister on the third anniversary of the tragic bus crash involving the Humboldt Broncos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Prime Minister, Justin Trudeau, today issued the following statement on the third anniversary of the tragic bus crash involving the Humboldt Broncos:</span></span></span></p>\n\n<p><span><span><span>“Three years ago, 16 people were killed and 13 more injured when a bus carrying the Humboldt Broncos hockey team was involved in a tragic accident on a Saskatchewan highway.</span></span></span></p>\n\n<p><span><span><span><span>“On this solemn anniversary, we remember those taken from us far too soon. We also hold in our thoughts their loved ones and everyone whose lives were forever changed that tragic day. We mourn with them as they continue to work through their pain, anger, and grief.</span></span></span></span></p>\n\n<p><span><span><span><span><span>“We also honour the first responders – the RCMP, Saskatchewan’s Provincial Response Team, and medical personnel – who responded to the devastating scene with courage and professionalism.</span></span></span></span></span></p>\n\n<p><span><span><span><span><span>“What happened that day left scars that will never fully heal bu</span></span></span><span><span>t, through the pain, all Canadians came together</span>. Across the country, people left hockey sticks on their front porches to pay tribute to those who were lost. In the weeks and months after the tragedy, they also donated generously to Humboldt families, contributing to one of the most successful online fundraising campaigns in history. This remarkable show of support and compassion remains an inspiration, as we continue to&nbsp;come together to fight the global COVID-19 pandemic.</span></span></span></p>\n\n<p><span><span><span><span><span>“Today, I hope all Canadians will take a moment to remember those we lost, and think of everyone whose lives were forever changed</span></span></span><span><span><span>.</span></span></span> <span>Over the last three years, some survivors of the crash have relearned to speak, walk, and skate. Other survivors have graduated from high school, and gone off to university. <span><span>To them and all those who continue to recover and rebuild: you are an enduring example of resilience to us all – you are Humboldt strong.” </span></span></span></span></span></p></div>\n      "
}