{
  "path": "/en/news/news-releases/2019/06/13/canada-and-metis-nation-continue-progress-canada-metis-nation-accord",
  "pageTitle": "Canada and the Métis Nation continue progress on the Canada-Métis Nation Accord | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the President of the Métis National Council (MNC), Clément Chartier, and the Presidents of the MNC Governing Members, at the annual Crown-Métis Nation Summit.</p>\n\n<p>Together, the leaders reviewed progress made over the past year in social and economic policies and programs, governance, and reconciliation. Achievements include historic investments to support a Métis Nation-led post-secondary education strategy; investments to recognize the contributions of Métis veterans during the Second World War; and enhanced funding for the Métis Capital Corporation to support small and medium-sized businesses.</p>\n\n<p>The Prime Minister and&nbsp;Métis Nation leaders&nbsp;identified new and ongoing priorities for the coming year, including child and family services, education, health, justice and policing, youth and sports,&nbsp;and implementation of Section 35 rights. Participants also discussed the recently signed Post-Secondary Education Sub-Accord with the Métis Nation, which will help make sure Métis Nation students have the opportunities they need to pursue post-secondary education.</p>\n\n<p>The Summit is an important part of our ongoing work toward a renewed relationship between Canada and the Métis Nation based on recognition of rights, respect, cooperation, and partnership. We will continue to work with the Métis Nation to take further steps to support their vision of self-determination, and a shared and prosperous future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since the signing of the Canada-Métis Nation Accord, we have been working with the Métis Nation toward a renewed, strengthened relationship that supports the interests and aspirations of the Métis Nation and all Canadians. Each year, these meetings give us the opportunity to reflect on what we have achieved together, and to take new steps to advance our priorities on the path of reconciliation.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The annual Summit with the Prime Minister allows us to review and advance further the progress we are making at the Ministerial and senior officials’ levels in addressing and fulfilling the priorities of the Métis Nation. Through the Canada-Métis Nation Accord process in the past two years, we have achieved more with this federal government than with any of its predecessors. We truly look forward to working with Prime Minister Trudeau and his ministers to maintain this momentum going forward.”</p>\n\n<footer class=\"default\">Clément Chartier, President of the Métis National Council</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since the signing of the Canada-Métis Nation Accord on April 13, 2017, the relationship with Canada has strengthened. By Canada and the Métis Nation working so well together, Métis people will benefit in numerous areas including housing, early learning and child care, post-secondary education, employment and training, economic development and language. Our thanks to Prime Minister Trudeau and his government for making this happen.”</p>\n\n<footer class=\"default\">Clara Morin Dal Col, President of Métis Nation British Columbia</footer>\n</blockquote>\n\n<blockquote>\n<p>“Together with Canada, the Métis Nation has made great strides advancing our inherent right of self-determination and self-government and in addressing the needs of our nation. It is with a willing partner in the Government of Canada that we have been able to collaborate on advancing our shared priorities to benefit the Métis.”</p>\n\n<footer class=\"default\">Audrey Poitras, President of the Métis Nation of Alberta</footer>\n</blockquote>\n\n<blockquote>\n<p>“Creating a space for respectful yet challenging dialogue is a necessary step to establishing a meaningful and lasting relationship between the Métis Nation and Canada. On behalf of Métis Nation-Saskatchewan, I appreciate the efforts of the federal and Métis leaders willing to address the real issues that affect our people today and in the future. We look forward to having our voice heard and improving policies and systems that affect the lives of all Métis people.”</p>\n\n<footer class=\"default\">Glen McCallum, President of Métis Nation-Saskatchewan</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we continue to work tirelessly to have our voices heard, and our constitutionally enshrined rights respected, it is heartening to know this federal government understands its role in reconciliation with the Metis Nation. I commend Prime Minister Trudeau and Minister Bennett, for not only acknowledging that responsibility, but for also treating us with respect and dignity.”</p>\n\n<footer class=\"default\">David Chartrand, President of Manitoba Metis Federation</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Métis Nation of Ontario is pleased with the accomplishments to date and the ongoing commitment to build a renewed relationship based on recognition, rights, and respect. We look forward to continuing our collaborative work in the areas of education, justice and policing, youth and sports, and Métis Section 35 rights to bring benefits to our Metis families and communities.”</p>\n\n<footer class=\"default\">Margaret Froh, President of Métis Nation of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“Les Femmes Michif Otipemisiwak is pleased to participate in the Crown-Métis Nation Annual Summit and at senior officials’ tables throughout the year to work towards the application of an intersectional gendered lens to all Métis Nation priority areas.”</p>\n\n<footer class=\"default\">Melanie Omeniho, President of the Women of the Métis Nation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the Summit, the leaders formalized a Canada-Métis Nation Accord on Economic Development, with an investment of $50 million over five years, to support the start-up and expansion of Métis small and medium-sized enterprises.</li>\n\t<li>Today’s Summit marks the third meeting between the Prime Minister and the Métis National Council since the signing of the Canada-Métis Nation Accord in 2017.</li>\n\t<li>The Métis Nation is represented by the Métis National Council and its governing members: the Métis Nation of Ontario, Manitoba Métis Federation, Métis Nation-Saskatchewan, Métis Nation of Alberta, and Métis Nation British Columbia.</li>\n\t<li>As outlined in Budget 2019, the Government of Canada is investing $362 million over 10 years and $40 million per year in ongoing support for a Métis Nation-led post-secondary education strategy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/canada-metis-nation-accord\">Canada-Métis Nation Accord</a></li>\n\t<li><a href=\"http://www.metisnation.ca/index.php/who-are-the-metis/mnc\">Métis National Council</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/news/2019/02/government-of-canadaintroduces-historiclegislationonindigenous-languages.html\">Government of Canada introduces historic legislation on Indigenous languages</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2019/02/government-of-canada-assembly-of-first-nations-inuit-tapiriit-kanatami-metis-national-council-celebrate-the-introduction-of-bill-c-92.html\">Government of Canada, Assembly of First Nations, Inuit Tapiriit Kanatami, Métis National Council celebrate the introduction of Bill C-92</a></li>\n</ul></div>\n      "
}