{
  "path": "/en/news/news-releases/2022/12/05/securing-good-jobs-clean-air-and-strong-economy",
  "pageTitle": "Securing good jobs, clean air, and a strong economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Autoworkers have been a keystone of the Canadian economy for generations. By investing in the future of the auto industry, we are not only securing good middle-class jobs, we are fighting climate change, and building an economy that works for generations to come.&nbsp;</p>\n\n<p>Since January alone, Canada has secured several historic manufacturing deals for electric vehicles (EVs), hybrids, and batteries – deals that will create and secure thousands of good, middle-class jobs and provide the world with clean vehicles. Today, we are seeing the results of one of those deals start to roll off the line.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by Premier of Ontario, Doug Ford, to open Canada’s first full-scale EV manufacturing plant, General Motors of Canada Company’s (GM) CAMI assembly plant in Ingersoll, Ontario. Starting today and going forward, the plant will build fully electric delivery vans – the BrightDrop Zevo 600 – which will help cut pollution and keep our communities healthy for our children and grandchildren.</p>\n\n<p>Thanks in part to a $259 million investment from the Government of Canada, GM’s CAMI assembly plant was able to retool its operations to build these electric vans. By 2025, the plant plans to manufacture 50,000 EVs per year. This investment has helped secure thousands of well-paying, high-quality jobs across GM facilities, and is helping advance the electrification of Canada’s automotive sector.</p>\n\n<p>The Government of Canada will continue to work to attract investment from companies around the world as we build our EV supply chain – from mining critical minerals to manufacturing batteries, and vehicles. By taking action today, we are positioning Canada as a global leader in EVs, fighting climate change, securing good jobs, and building an economy that works for all Canadians – now and into the future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we invested in GM’s project to build Canada’s first full-scale electric vehicle manufacturing plant in Ingersoll, we knew it would deliver results. Today, as the first BrightDrop van rolls off the line, that’s exactly what we’re seeing. This plant has secured good jobs for workers, it is positioning Canada as a leader on EVs, and will help cut pollution. Good jobs, clean air, and a strong economy – together, that’s the future we can build.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is proof that our historic investments in EV manufacturing are paying off. With the first BrightDrop vans coming off the assembly line, we’re seeing the skill of Canadian workers making a huge difference as the world moves to EVs. Our government, in partnership with GM, is cementing Canada’s leadership in the EV supply chain.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“This milestone represents GM at our best – fast, flexible and first in the industry. The BrightDrop Zevo is a prime example of GM's flexible Ultium EV architecture, which is allowing us to quickly launch a full range of electric vehicles for our customers. And, as of today, I am proud to call the CAMI EV Assembly team the first full-scale all-electric manufacturing team in Canada.”</p>\n\n<footer class=\"default\">Mark Reuss, President, General Motors</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is a very exciting moment – a revolution in the way we transport people and goods. Today marks a huge day for BrightDrop, as we expand our footprint and begin producing the Zevo electric vans at scale, and a huge milestone for Canada on the road to a brighter future. Opening the CAMI plant is a major step in providing EVs at scale and delivering real results to the world’s biggest brands, like DHL Express, who will be our first Canadian customer.”</p>\n\n<footer class=\"default\">Travis Katz, President and CEO, BrightDrop</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada’s $259 million investment supports GM’s more than $2 billion project to reignite production at its Oshawa assembly plant, after operations stopped in 2019, and transform its CAMI assembly plant in Ingersoll.</li>\n\t<li>The investment is being made through both the <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a> and its <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/00039.html\">Net Zero Accelerator Initiative</a>.</li>\n\t<li>The Government of Ontario made a matching contribution of up to $259 million toward the project.</li>\n\t<li>Founded in 1918, General Motors of Canada Company (GM) is one of the largest automotive manufacturers worldwide. It is headquartered in Oshawa, Ontario, and is one of Canada’s largest automotive manufacturers.</li>\n\t<li>GM is planning to introduce 30 new electric vehicles by 2025, eliminate tailpipe emissions from new light-duty vehicles by 2035, and become carbon neutral in its global products and operations by 2040.</li>\n\t<li>The automotive sector contributes $16 billion to Canada’s gross domestic product and is one of the country’s largest export industries.</li>\n\t<li>The automotive sector supports the employment of nearly 500,000 Canadians.</li>\n\t<li>The <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reductions Plan</a>, released in March, puts Canada on track to achieving our goal of cutting emissions by 40 to 45 per cent below 2005 levels by 2030 while continuing to build a strong economy.</li>\n\t<li>To make zero-emission vehicles more affordable and accessible, the Government of Canada offers incentives of up to $5,000 off the purchase or lease of a light-duty zero-emission vehicle through the Incentives for Zero-Emission Vehicles (iZEV) Program. Since May 2019, close to 176,000 Canadians have taken advantage of this program.</li>\n\t<li>Since 2015, the Government of Canada has invested $400 million in building approximately 35,000 zero-emission vehicle charging stations across the country.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/11/helping-more-canadians-drive-electric-vehicles\">Helping more Canadians drive electric vehicles</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/04/government-of-canada-secures-thousands-of-jobs-and-helps-create-canadas-first-full-scale-commercial-electric-vehicle-manufacturing-facility.html\">Government of Canada secures thousands of jobs and helps create Canada’s first full-scale commercial electric vehicle manufacturing facility</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.gm.ca/en/home.html\">General Motors Canada</a></li>\n</ul></div>\n      "
}