{
  "path": "/en/news/readouts/2023/03/01/prime-minister-justin-trudeau-speaks-prime-minister-jamaica-andrew-holness",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Jamaica Andrew Holness | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Jamaica, Andrew Holness.</p>\n\n<p>The two leaders discussed the Caribbean Community’s (CARICOM) mission to Haiti on February 27, led by Prime Minister Holness. They talked about the meetings held with Haitian stakeholders and political actors, and the need for inclusive dialogue to bring parties to consensus. These meetings were also valuable in understanding the needs on the ground, and that a Haitian-led solution is required to achieve long-lasting stability and security in the country. The leaders agreed on the importance of working with the Haitian National Police (HNP), both in the short and long term, to combat the violence and insecurity experienced by Haitian people.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Holness discussed the importance of sanctions and the need to continue to work with the international community to disable the criminal gangs and those responsible for the ongoing violence in Haiti.</p>\n\n<p>The prime ministers also underscored the importance of CARICOM’s role in supporting inclusive political dialogue in Haiti, and reiterated that Canada, CARICOM, and the international community will continue to work together to provide assistance and support to help address the needs of the Haitian people.</p>\n\n<p>The leaders agreed to continue to work closely together and to remain in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/jamaica-jamaique/relations.aspx?lang=eng\">Canada-Jamaica relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n\t<li><a href=\"/en/news/readouts/2023/02/27/prime-minister-justin-trudeau-speaks-prime-minister-jamaica-andrew-holness\">Prime Minister Justin Trudeau speaks with Prime Minister of Jamaica Andrew Holness</a></li>\n</ul></div>\n      "
}