{
  "path": "/en/news/statements/2018/12/01/statement-prime-minister-death-former-us-president-george-h-w-bush",
  "pageTitle": "Statement by the Prime Minister on the death of former U.S. President George H. W. Bush | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today</span>&nbsp;issued the following statement on the death of former President George H. W. Bush:</p><p>“I am saddened to hear of the passing of President George H. W. Bush. On behalf of all Canadians, Sophie and I offer our deepest condolences to the Bush family and the many close friends who also continue to mourn the loss of his beloved wife, Barbara.</p><p>“George H. W. Bush’s lifetime of service began when he enlisted during the Second World War and became one of the youngest pilots in the U.S. Navy. His exemplary spirit of service and commitment to country would mark each of his roles – including in Congress, as ambassador to the United Nations, as head of the Central Intelligence Agency, and in the White House.</p><p>“President Bush was a dedicated and thoughtful leader who stuck by his convictions and values. He did much to strengthen relations between our two countries, championing the North American Free Trade Agreement and initiatives like the fight against acid rain.</p><p>“As president, he provided steady, principled leadership through a number of decisive international events.</p><p>“In his retirement from public life, President Bush remained unwavering in his service to others. He raised millions of dollars for charities related to cancer and child poverty, and made considerable contributions to disaster relief efforts in Southeast Asia and the U.S. Gulf Coast states.</p><p>“Today, all Canadians join our American friends and neighbours in mourning the loss of a great leader and friend. George H. W. Bush’s lifetime of public service has inspired a thousand points of light. His legacy will inspire many more.”</p></div>\n      "
}