{
  "path": "/en/news/readouts/2020/04/27/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier John Horgan to discuss the evolving COVID-19 situation.&nbsp; The Prime Minister and Premier Horgan discussed the actions being taken by the governments of British Columbia and Canada to protect the health and safety of British Columbians and all Canadians, and to support workers and businesses.&nbsp;</p>\n\n<p>The Prime Minister and Premier Horgan agreed that governments will need to continue working closely together to get through the current COVID-19 situation and for successful economic recovery efforts.&nbsp;They noted that both governments are working together to ensure that those returning to British Columbia from abroad have plans and means to self-isolate, and that they will continue to collaborate on public health issues. They also agreed to continue discussions on other issues, including infrastructure and supports for people and businesses.&nbsp;&nbsp;&nbsp;</p>\n\n<p>Prime Minister and Premier Horgan reaffirmed their commitment to addressing COVID-19 through a collective Team Canada approach, and agreed to stay in touch.&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories\">Prime Minister announces partnerships with provinces and territories to deliver the Canada Emergency Commercial Rent Assistance for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}