{
  "path": "/en/news/readouts/2020/05/29/prime-minister-justin-trudeau-speaks-permanent-representatives-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Permanent Representatives of the United Nations’ African Group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Permanent Representatives of the United Nations’ African Group to discuss Canada’s candidacy to serve on the United Nations Security Council (UNSC) for 2021-2022.</p>\n\n<p>The Prime Minister recalled with gratitude the warm reception he received during his visit to Ethiopia and Senegal in February, where he attended African Union Summit events and met with African leaders. He highlighted the strong relationships they have built upon shared values, and the close economic and trade ties between Canada and African countries, and potential for increased partnership and growth.</p>\n\n<p>The Prime Minister reiterated Canada’s commitment to be a productive and collaborative UNSC member, focused on working together with partners to address complex global issues. He pointed to the challenge posed by the COVID-19 pandemic, noting the importance of multilateral cooperation in addressing the health and economic impacts of the pandemic, and highlighting the central role of the United Nations and the African Union in the international response. He appreciated the important contributions made by African leaders at the High-Level Event on Financing for Development in the Era of COVID-19 and Beyond, which was convened by Canada, Jamaica, and the United Nations (UN) on May 28.</p>\n\n<p>Prime Minister Trudeau acknowledged the important role that African countries play in peacebuilding and peacekeeping worldwide. He also spoke of Canada’s contributions to global peace and security, including as 2020 Chair of the UN Peacebuilding Commission, supporter of the UN peacekeeping mission in Mali in 2019, and leader in the Elsie Initiative—along with Zambia, Ghana, and Senegal, among others—for the inclusion of women in peacekeeping. The Prime Minister committed to continue working closely with African countries to advance our shared peace and security objectives.</p>\n\n<p>The Prime Minister and the Permanent Representatives exchanged views on other key international issues, including climate change, gender equality, economic security, and strengthened multilateralism. They spoke of the role that Canada can play in bringing these priorities to the forefront of discussions at the United Nations Security Council.</p>\n\n<p>As Canada pursues its candidacy for election to the United Nations Security Council for 2021-2022, we will continue to advance shared interests to benefit people and businesses in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/campaign-campagne/unsc-csnu/index.aspx?lang=eng\">Canada: UN Security Council Candidate 2021-2022</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/au.aspx?lang=eng\">Canada and the African Union</a></li>\n</ul></div>\n      "
}