{
  "path": "/en/news/news-releases/2018/11/14/prime-minister-announces-strengthened-partnership-china",
  "pageTitle": "Prime Minister announces strengthened partnership with China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As part of the third Canada-China Annual Leaders’ Dialogue, the Prime Minister, Justin Trudeau, today met with Premier of the State Council of the People's Republic of China, Li Keqiang.</p><p>The two leaders welcomed the outcomes of recently concluded high-level engagements between Canada and China, including:</p><ul><li>$1.67 billion in commercial deals signed by Canadian companies at the China International Import Expo, which will create new opportunities and good, middle class jobs for Canadians;</li><li>Commitments at the recent Economic and Financial Strategic Dialogue to double agricultural trade by 2025 and to continue exploratory discussions towards a potential comprehensive trade agreement; and</li><li>11 signed agreements during last week’s Atlantic Growth Strategy mission in China, to support industries and create jobs for people in Atlantic Canada.</li></ul><p>Prime Minister Trudeau and Premier Lialso issued a Joint Statement on Marine Litter and Plastics, recognizing the importance of taking a lifecycle approach to manage plastics and protect our oceans. Canada is leading efforts to bring countries together to eradicate plastic pollution, most notably through the <i>Oceans Plastics Charter</i>, which five countries endorsed at the G7 Leaders’ Summit in Charlevoix.</p><p>The two leaders discussed deepening bilateral trade and investment by expanding cooperation in sectors like agriculture, energy, and clean technology. They also pledged to continue to promote multilateralism, free trade, and the rules-based international order. They agreed to deepen their collaboration through bilateral and multilateral forums, such as the World Trade Organization.</p><p>The two leaders had a frank and open discussion on human rights, freedom of expression, and freedom of religion. Prime Minister Trudeau expressed Canada’s concern about the situation facing Uyghurs and other minorities in Xinjiang.</p><p>Building on the success of the Canada-China Year of Tourism, the Prime Minister and the Premier discussed how our two countries will continue to work together to grow our tourism sectors, which could include cooperation on winter tourism. Prime Minister Trudeau also encouraged more Canadian and Chinese students to study in each other’s countries.</p><p>The Prime Minister expressed his appreciation of China’s ongoing cooperation with Canadian law enforcement to disrupt the international trafficking of illicit drugs, including by sharing information and through other joint initiatives that aim to reduce the manufacture and trafficking of opioids to Canada.</p><p>The two leaders discussed regional issues, including North Korea and Myanmar. They reaffirmed their commitment to support the denuclearization of North Korea and security and stability on the Korean Peninsula, including through the implementation of the United Nations Security Council mandated sanctions. The leaders also discussed efforts by Canada and China to address the ongoing crisis affecting the Rohingya.</p><h2>Quote</h2><blockquote><p>“During our meeting, Premier Li and I discussed how Canada and China can expand trade and commercial opportunities between our countries, work more closely together to fight plastic pollution, and create more jobs for all our citizens. We also had a frank and open discussion on human rights.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>This is the third time the two leaders have met as part of the ongoing Canada-China Annual Leaders’ Dialogue. They previously met in September 2016 in Ottawa and December 2017 in Beijing.</li><li>The Minister of Finance, Bill Morneau, and the Minister of International Trade Diversification, Jim Carr, recently co-chaired the first Economic and Financial Strategic Dialogue (EFSD) with China.</li><li>This meeting also follows the Atlantic Growth Strategy mission to China, led by President of the Treasury Board, Scott Brison, Minister of Agriculture and Agri-Food, Lawrence MacAulay, Premier of Nova Scotia, Stephen McNeil, Premier of Prince Edward Island, Wade MacLauchlan, Premier of Newfoundland and Labrador, Dwight Ball.</li><li>China is the world's second-largest economy, and Canada's second-largest single-country trading partner.</li><li>In 2017, two-way merchandise trade between the countries reached nearly $94.5 billion in value, accounting for 8.4% of Canada's total merchandise trade.</li><li>In 2017, two-way trade in services between Canada and China reached $6.2 billion in value.</li><li>Canada's two-way foreign direct investment relationship with China is deepening, with the value of investment increasing from $15.9 billion in 2010 to nearly $27.1 billion in 2017.</li><li>Canada and China designated 2018 the Canada-China Year of Tourism, which includes initiatives to increase tourism and promote cultural activities.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2018/11/13/joint-statement-between-government-canada-and-government-people’s\">Joint Statement between the Government of Canada and the Government of the People’s Republic of China on Marine Litter and Plastics</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.56003307.1168694504.1511191876-108037952.1511191871\">Canada-China relations</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2018/11/joint-outcomes-of-the-first-canada-china-economic-and-financial-strategic-dialogue.html\">Joint Outcomes of the First Canada-China Economic and Financial Strategic Dialogue</a></li><li><a href=\"https://www.ic.gc.ca/eic/site/100.nsf/eng/home\">Canada-China Year of Tourism 2018</a></li></ul></div>\n      "
}