{
  "path": "/en/news/news-releases/2022/12/20/prime-minister-trudeau-attend-north-american-leaders-summit",
  "pageTitle": "Prime Minister Trudeau to attend North American Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Mexico City, Mexico, to participate in the North American Leaders' Summit (NALS) taking place on January 10, 2023.</p>\n\n<p>The North American Leaders’ Summit brings together the Prime Minister of Canada, the President of Mexico, and the President of the United States of America, to advance North American solutions to the challenges of today and tomorrow. This year, the leaders will continue to work together to help grow our economies to benefit everyone and create good, middle-class jobs across the continent. They will focus on key areas, including advancing collaboration across the electric vehicle supply chain – from mining the required critical minerals to manufacturing vehicles. They will also continue to work together to improve health and build a future where no one is left behind.</p>\n\n<p>During the Summit, the Prime Minister will build on the important work accomplished at the NALS in 2021 to protect our environment, including transitioning to clean energy, expand and make supply chains more resilient, invest in critical minerals, help drive our economic competitiveness and prosperity, encourage labour mobility, and advance diversity and inclusion.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I look forward to meeting with my North American counterparts to discuss a common path forward to building a cleaner, more inclusive, and more competitive, integrated North American economy. Together, we can create a stronger North America and build a better future for people across the continent.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The priorities for this North American Leaders Summit are diversity and inclusion, climate change and the environment, competitiveness, migration and development, health, and security.</li>\n\t<li>This is the tenth edition of the North American Leaders Summit. The last Summit was held in November 2021 in Washington, D.C.</li>\n\t<li>The Canada-United States-Mexico Agreement (CUSMA) has been in force since July 1, 2020. It reinforces North American supply chains and enables Canada, the U.S., and Mexico to compete as a regional bloc against international competitors.</li>\n\t<li>Canadian trade with Mexico is steadily growing, with over $41.7 billion in two-way merchandise trade in 2021. Mexico is Canada's third largest single-country merchandise trading partner after the U.S. and China. Canada was Mexico's sixth-largest merchandise trading partner in 2021. Canadian direct investment in Mexico was $25 billion in 2021, which is Canada's ninth largest direct investment destination.</li>\n\t<li>Mexico has been identified as a priority market for Export Development Canada, which has operated a regional office in Mexico since 2000, providing extensive financial services related to Canadian exports and investments in the country.</li>\n\t<li>Over 300 Memoranda of Understanding (MOUs) between Canadian and Mexican higher education institutions facilitate academic exchanges. Canada hosted 14,435 Mexican students in 2021, an increase from over 10,000 students in 2020.</li>\n\t<li>Canada and the United States share one of the largest trading relationships in the world. The two countries also share the longest and most secure border in the world, over which $2.5 billion worth of goods and services cross daily.</li>\n\t<li>With over $1 trillion in bilateral trade in goods and services in 2021, Canada was the largest U.S. trading partner. Canada-U.S. trade is built on long-standing binational supply chains, whereby approximately a79 per cent of Canadian goods exported to the U.S. are incorporated into U.S. supply chains.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n</ul></div>\n      "
}