{
  "path": "/en/news/statements/2022/05/09/statement-prime-minister-national-nursing-week",
  "pageTitle": "Statement by the Prime Minister on National Nursing Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Nursing Week, which runs from May 9 to 15:</p>\n\n<p>“Today, as we mark the beginning of National Nursing Week, we recognize the courage, sacrifice, and commitment of nurses and the important role they play in supporting the health and well-being of people in Canada and around the world.</p>\n\n<p>“This year’s theme –<strong> </strong>#WeAnswerTheCall – recognizes the tireless efforts of thousands of nurses who show up every day in Canada’s hospitals, long-term care homes, and public health settings to keep us and our loved ones safe. Over the past two years, they have worked long hours, risked their health, and faced physical and mental exhaustion on the front lines of the pandemic. Many have also worked behind the scenes in everything from contact tracing to supporting the development of public health policies and programs to help keep Canadians healthy. Every day, they continue to take care of our most vulnerable, administer vaccines and booster shots, and work hard to protect us and our communities.</p>\n\n<p>“The Government of Canada continues to be there for nurses as they are there for us. Since the start of the pandemic, we have invested over $12.8&nbsp;billion for the procurement of supplies, such as personal protective equipment and biomedical equipment, providing more than 1.8&nbsp;billion units to protect health care workers and communities. In 2020, we provided provinces and territories with an additional $700&nbsp;million through the Safe Restart Agreement to strengthen our health care system and help give health care workers the resources they need. We have also provided provinces and territories with $4.5&nbsp;billion in Canada Health Transfer top-ups, and proposed another $2&nbsp;billion top-up in March 2022. In addition, Budget&nbsp;2022 proposes to increase Canada Student Loans forgiveness by 50 per cent for nurses working in underserved rural or remote areas.</p>\n\n<p>“This is important work, but we know there is more to be done to ensure all health care workers have the support and resources they need to keep us safe. That is why earlier this year, the government announced a process to appoint a Chief Nursing Officer for Canada who will make sure that the voices and perspectives of nurses are heard and have an impact on our country’s health care policies and the future of care in our communities.</p>\n\n<p>“As we mark the beginning of National Nursing Week, I invite all Canadians to join me in thanking our nurses. We are incredibly grateful for your hard work, sacrifices, and dedication, and as a country, we owe you so much.”</p></div>\n      "
}