{
  "path": "/en/news/statements/2016/12/20/united-states-canada-joint-arctic-leaders-statement",
  "pageTitle": "United States-Canada Joint Arctic Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>In March,</strong> President Obama and Prime Minister Trudeau announced a new partnership to embrace opportunities and confront challenges in the changing Arctic, with Indigenous and Northern partnerships, and responsible, science-based leadership. <strong>Over the past year,</strong> both countries have engaged a range of partners and stakeholders, including Indigenous peoples and Northern communities, state, provincial and territorial governments, nongovernmental organizations and businesses. Those consulted have expressed a strong desire for real and long-term opportunities to build strong families, communities, and robust economies. <strong>Today,</strong> President Obama and Prime Minister Trudeau are proud to launch actions ensuring a strong, sustainable and viable Arctic economy and ecosystem, with low-impact shipping, science based management of marine resources, and free from the risks of offshore oil and gas activity. <strong>Together, </strong>these actions set the stage for deeper partnerships with other Arctic nations, including through the Arctic Council.</p>\n<p><em><strong>Science-based approach to oil and gas</strong>:</em></p>\n<p><strong>In March,</strong> the United States (U.S.) and Canada committed that commercial activities will occur only if the highest safety and environmental standards are met, and if they are consistent with national and global climate and environmental goals. <strong>Today – </strong>due to the important, irreplaceable values of its Arctic waters for Indigenous, Alaska Native and local communities’ subsistence and cultures, wildlife and wildlife habitat, and scientific research; the vulnerability of these ecosystems to an oil spill; and the unique logistical, operational, safety, and scientific challenges and risks of oil extraction and spill response in Arctic waters – the U.S. is designating the vast majority of U.S. waters in the Chukchi and Beaufort Seas as indefinitely off limits to offshore oil and gas leasing, and Canada is designating all Arctic Canadian waters as indefinitely off limits to future offshore Arctic oil and gas licensing, to be reviewed every 5 years through a climate and marine science-based life-cycle assessment.<a href=\"#section1\">[1]</a></p>\n<p><em><strong>Supporting strong Arctic communities</strong>:</em></p>\n<p><strong>In March,</strong> both countries committed to defining new approaches and exchanging best practices to strengthen the resilience of Arctic communities and continuing to support the well-being of Arctic residents, in particular respecting the rights and territory of Indigenous peoples.</p>\n<p><strong>Recently, </strong>in direct response to requests from Alaska Native communities, President Obama created the Northern Bering Sea Climate Resilience Area protecting the cultural and subsistence resources of over 80 tribes as well as one of the largest seasonal migrations of marine mammals in the world of bowhead and beluga whales, walrus, ice seals, and sea birds. The U.S. also launched an interagency Economic Development Assessment Team in the Nome region of Alaska to identify future investment opportunities, with other regions to follow. In addition, the Arctic Funders Collaborative (AFC), a group of eleven U.S., Canadian, and international philanthropic foundations, announced the coordination and mobilization of an estimated $27 million in resources for programs across the Arctic over the next three years.</p>\n<p><strong>Today, </strong>for its part, Canada is committing to co-develop a new Arctic Policy Framework, with Northerners, Territorial and Provincial governments, and First Nations, Inuit, and Métis People that will replace Canada’s Northern Strategy. The Framework will focus on priority areas identified by the Minister of Indigenous and Northern Affairs’ Special Representative, including education, infrastructure, and economic development. The Framework will include an Inuit-specific component, created in partnership with Inuit, as Inuit Nunangat comprises over a third of Canada’s land mass and over half of Canada’s coast line, and as Inuit modern treaties govern the entirety of this jurisdictional space. In parallel, Canada is reducing the reliance of Northern communities on diesel, by deploying energy efficiency and renewable power. Canada will also, with Indigenous and Northern partners, explore how to support and protect the future of the Arctic Ocean’s “last ice area” where summer ice remains each year.</p>\n<p><em><strong>Low impact shipping corridors</strong>:</em></p>\n<p><strong>In March,</strong> the U.S. and Canada committed to working together to establish consistent policies for ships operating in the region. <strong>Today, </strong>both countries are launching the first processes ever to identify sustainable shipping lanes throughout their connected Arctic waters, in collaboration with Northern and Indigenous partners. The U.S. Coast Guard is launching a Port Access Route Study (PARS) in the Beaufort and Chukchi Seas.<a href=\"#section2\">[2]</a> Results from this analysis may be used to establish vessel routing measures including traffic separation schemes, recommended routes, Areas To Be Avoided, or other instruments such as fairways where no structures may be erected. Canada is implementing Northern Marine Transportation Corridors, determining what infrastructure and navigational and emergency response services are needed.&nbsp; Canada is also launching a new program to support training curriculum for Northerners, particularly Indigenous peoples, to join the marine field, as well as programming to support marine infrastructure and safety equipment for communities.</p>\n<p><strong>In addition,</strong> the U.S. Coast Guard, in consultation with industry, Indigenous communities, and the State of Alaska, has begun a strategy to phase down the use of Heavy Fuel Oil (HFO) in the Arctic. Transport Canada is conducting similar outreach and consultations to develop proposals in 2017 on phase down of use of HFO. The U.S. and Canada will each, or jointly, propose a plan for consideration at the International Maritime Organization’s summer 2017 meeting.</p>\n<p><em><strong>Science-based management of Arctic fisheries</strong>:</em></p>\n<p><strong>In March,</strong> the U.S. and Canada called for a binding international agreement to prevent the opening of unregulated fisheries in the Central Arctic Ocean and to build on a precautionary, science-based approach to commercial fishing that both countries have put in place in their Arctic waters. <strong>Today, </strong>the U.S. commits to supporting and strengthening existing commercial fishing closures in the Beaufort and Chukchi Seas, and to conducting scientific research to improve our understanding of the Arctic. Canada commits to working with Northern and Indigenous communities to build world-leading and abundant Arctic fisheries - based on science – that firstly benefit Northern communities.</p>\n<p><strong>Together, </strong>the U.S. and Canada’s actions will create the largest contiguous area of well-regulated fisheries in the world. Both countries reaffirm their commitment to a legally binding agreement to prevent unregulated commercial fisheries in the Arctic High Seas until an internationally recognized Regional Fishery Management Organization is in place to provide effective management. Both countries are working towards such an agreement in the coming months.</p>\n<p><strong>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/12/20/select-actions-being-taken-under-united-states-canada-joint-arctic\">Select actions being taken under the United States-Canada Joint Arctic Leaders’ Statement</a></li>\n<li><a class=\"ext\" href=\"http://www.aadnc-aandc.gc.ca/eng/1482262705012\">FAQs on Actions being taken under the Canada-US Joint Arctic Statement</a></li>\n</ul>\n<p></p>\n<p id=\"section1\">[1]</p>\n<p>Taking into account the respective obligations of the United States and Canada under international law to protect and preserve the marine environment, these steps also support the goals of various international frameworks and commitments concerning pollution, including those reflected in the 1990 International Convention on Oil Pollution Preparedness, Response, and Cooperation, the 2013 Agreement on Cooperation on Marine Oil Pollution Preparedness and Response in the Arctic, and the U.S.-Canada Joint Marine Pollution Contingency Plan.&nbsp; Furthermore, with respect to areas of the Beaufort Sea where the U.S.-Canada maritime boundary has not yet been agreed, these practical arrangements are without prejudice to either side’s position and demonstrate self-restraint, taking into account the principle of making every effort not to jeopardize or hamper reaching a final maritime boundary agreement.</p>\n<p id=\"section2\">[2]</p>\n<p>In conducting this study, and consistent with existing authorities, the Coast Guard will consider traditional knowledge from local communities, the effects of shipping and vessel pollution on the marine environment, marine mammal migratory pathways and other biologically important areas, subsistence whaling, hunting, and fishing, and the needs of maritime safety and commerce. &nbsp;</p></div>\n      "
}