{
  "path": "/en/news/statements/2021/10/17/statement-prime-minister-small-business-week",
  "pageTitle": "Statement by the Prime Minister on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Small Business Week, which runs from October&nbsp;17&nbsp;to 23, 2021:</p>\n\n<p>“Small businesses are at the heart of our communities across the country. They are the small neighbourhood café that makes the perfect cup of coffee, the entrepreneur who started a new online shop, and the family-run store that pivoted to making face masks in the early days of the COVID-19 pandemic. Small businesses drive our economy by creating the goods and services we need, while employing millions of Canadians.</p>\n\n<p>“Today, as we mark the start of <a href=\"https://www.bdc.ca/en/small-business-week\">Small Business Week</a> in Canada, we recognize that the past year and a half have been difficult for small businesses, their owners, and their employees. Small businesses across the country were asked to make countless sacrifices to protect the health and safety of people and communities. Through it all, they have shown incredible courage and resilience, and an unprecedented ability to adapt and innovate. And while some businesses have now reopened their doors, many still need support as they continue to grapple with the impacts of the pandemic.</p>\n\n<p>“Supporting Canadian businesses is key to ensuring a strong economic recovery. That is why the Government of Canada introduced a range of supports to help small businesses during the pandemic – from assistance with expenses through interest-free, partially forgivable loans with the <a href=\"https://ceba-cuec.ca/\">Canada Emergency Business Account</a> to rent relief with the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-rent-subsidy.html\">Canada Emergency Rent Subsidy</a>. We also helped businesses keep employees on the payroll through the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a> and <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/recovery-hiring-program.html\">Canada Recovery Hiring Program</a>, and created the <a href=\"https://www.edc.ca/en/solutions/working-capital/bcap-guarantee.html\">Highly Affected Sectors Credit Availability Program</a> (HASCAP) to help particularly hard-hit businesses in need of additional support to weather the pandemic. These measures have helped support hundreds of thousands of small businesses in Canada, and the workers and communities that rely on them.</p>\n\n<p>“Small businesses are counting on us to get vaccinated, so we can prevent avoidable lockdowns and help them get back up to speed. By being there for businesses and their workers every step of the way, the government is also continuing to create jobs, strengthen the middle class, and grow the economy. We are supporting our hardest-hit sectors, including tourism, hospitality, and cultural industries. The government is also working to improve the <a href=\"https://www.ic.gc.ca/eic/site/csbfp-pfpec.nsf/eng/home\">Canada Small Business Financing Program</a>, so that small businesses and entrepreneurs can access the funds they need to recover, innovate, and achieve long-term growth. We are also helping small and medium-sized businesses grow and thrive so that they can compete in Canada’s digital future. With initiatives such as the <a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/home\">Canada Digital Adoption Program</a>, we are assisting them in adopting new digital technologies and bringing their products and services online.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me in thanking small and medium-sized businesses for their dedication, perseverance, and innovation every day, and particularly over the past year and a half. Let us continue to support our local businesses so that, together, we can build a more resilient economy and a better future for everyone.”</p></div>\n      "
}