{
  "path": "/en/news/news-releases/2022/03/08/prime-minister-concludes-successful-bilateral-visit-latvia",
  "pageTitle": "Prime Minister concludes successful bilateral visit to Latvia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful bilateral visit to Latvia, which strengthened the relationship between the two nations and reinforced Canada’s commitment to NATO in solidarity with European allies and partners in the face of Russia’s unprovoked and unjustifiable invasion of Ukraine.</p>\n\n<p>Prime Minister Trudeau today announced Canada will renew its multi-year commitment to Operation REASSURANCE, the Canadian Armed Forces support to NATO’s assurance and deterrence measures in Central and Eastern Europe. This announcement is a year ahead of schedule and responds to the changing security situation in Eastern Europe.</p>\n\n<p>This mission renewal follows the Prime Minister’s recent announcements of the deployment of up to 460 additional Canadian Armed Forces personnel to reinforce Operation REASSURANCE, including in Latvia, and the approximately 3,400 Canadian Armed Forces personnel who have been placed at a higher state of readiness to deploy to the NATO Response Force should they be required.</p>\n\n<p>During his visit, Prime Minister Trudeau met with Latvian Prime Minister Krišjānis Kariņš to condemn Russia’s military aggression in Ukraine and coordinate further responses to hold Russia accountable. The prime ministers also discussed other regional security challenges, such as the Belarus-induced migration crisis and spoke of the importance of the continued strengthening of NATO’s assurance and deterrence measures, particularly along NATO’s eastern flank. They also discussed ways to deepen the bilateral relationship and committed to further strengthening trade ties to support their economies and create jobs in both countries. Prime Minister Trudeau also met with Latvia’s President, Egils Levits.</p>\n\n<p>Prime Ministers Trudeau and Kariņš were joined for a meeting by the Prime Minister of Estonia, Kaja Kallas, and the Prime Minister of Lithuania, Ingrida Šimonytė, to discuss increased support to Ukraine and strengthening the partnerships between the countries. To strengthen trade relationships, the leaders agreed on a yearly meeting of the Foreign Ministers of Canada, Estonia, Latvia and Lithuania. Canada’s Minister of Foreign Affairs, Mélanie Joly, will host the first gathering in Quebec this spring.</p>\n\n<p>The Prime Minister also held a bilateral meeting with NATO Secretary&nbsp;General Jens Stoltenberg, where they discussed NATO’s role in responding to Russia’s invasion of Ukraine as well as the future of NATO more broadly, as leaders prepare for this summer’s NATO Summit in Madrid.</p>\n\n<p>While in Latvia, the Prime Minister met with Prime Minister Pedro Sánchez of Spain to discuss further responses to Russia’s ongoing aggression in Ukraine, including expanding sanctions, and NATO and European Union unity. The Prime Minister thanked Prime Minister Sánchez for Spain’s contributions to the enhanced Forward Presence Battle Group Latvia.</p>\n\n<p>The Prime Minister, Prime Ministers of Latvia and Spain, and the Secretary General also visited with the troops of NATO’s enhanced Forward Presence Battle Group at Camp Ādaži, where Prime Minister Trudeau thanked them for their dedication and contribution to the security of the Alliance.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As Russia continues its unwarranted and unjustifiable attacks on Ukraine, Canada is standing united with our European allies in supporting Ukraine and the Ukrainian people, as well as democracy and human rights everywhere. I would like to thank Prime Minister Kariņš for hosting this visit which provided an opportunity for Canada and Latvia to continue to deepen the ties between our two nations, by emphasizing our shared values and mutual commitment to transatlantic security as NATO Allies. Canada continues to work in close collaboration with NATO Allies to support Ukraine as it defends its people, its sovereignty, territorial integrity and independence.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the second bilateral visit to Latvia by a Canadian prime minister. Prime Minister Trudeau last visited Latvia in 2018.</li>\n\t<li>The Prime Minister was joined in Latvia by the Minister of National Defence, Anita Anand, and the Chief of the Defence Staff, General Wayne Eyre.</li>\n\t<li>Canada and Latvia’s relationship is rooted in our shared values of freedom, democracy, and the rule of law. Our close ties are strong due in part to the 30,000 Canadians of Latvian heritage.</li>\n\t<li>Latvia was the first European Union Member State to ratify the&nbsp;Canada-European Union Comprehensive Economic and Trade Agreement (CETA)&nbsp;and the Strategic Partnership Agreement, on March 9, 2017.</li>\n\t<li>Canada was the first G7 country to recognize the restoration of Latvia’s independence in 1991, and one of the first countries to ratify Latvia’s accession to NATO in 2004.</li>\n\t<li>NATO is a cornerstone of Canada’s international security policy. It is the primary international forum in which to engage other nations on transatlantic defence and security.</li>\n\t<li>Operation REASSURANCE is the Canadian Armed Forces support to NATO assurance and deterrence measures in Central and Eastern Europe.</li>\n\t<li>Prior to Prime Minister Trudeau’s announcement on February 22, 2022, the contributions to Operation REASSURANCE included:\n\t<ul>\n\t\t<li>Up to 540 Canadian Armed Forces members as the Framework Nation to the Canadian-led multinational enhanced Forward Presence Battle Group in Latvia, since 2017;</li>\n\t\t<li>A Halifax-class Frigate (HMCS <em>Montreal</em>) deployed with Standing NATO Maritime Group 2 (SNMG 2); and</li>\n\t\t<li>Up to six CF-18s for episodic air surveillance, air policing, and training.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\" title=\"Canada and the North Atlantic Treaty Organization\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\" title=\"Operation REASSURANCE\">Operation REASSURANCE</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}