{
  "path": "/en/news/news-releases/2021/07/07/prime-minister-highlights-public-transit-investment-create-jobs-grow",
  "pageTitle": "Prime Minister highlights public transit investment to create jobs, grow the economy, and build back stronger communities in Calgary | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Improving public transit infrastructure helps create more inclusive communities, reduce commute times for Canadians, and fight climate change. That is why the Government of Canada is making smart investments in public transit that will create well-paying middle class jobs, and help us build back for a cleaner, better future.</p>\n\n<p>The Prime Minister, Justin Trudeau, today confirmed the Government of Canada’s commitment to invest up to $1.53 billion to build the new Green Line as part of Calgary’s Light Rail Transit (LRT) system. The Government of Alberta is contributing $1.53 billion toward the new Green Line LRT project. The City of Calgary is contributing $1.59 billion. As the largest infrastructure project in the city’s history, the Green Line will play a key role in shaping the future of Calgary by connecting people and places, reducing congestion, and creating up to 20,000 jobs.</p>\n\n<p>The project will deliver fast, accessible, and environmentally friendly transit access to downtown Calgary and other employment hubs such as Quarry Park and the southeast industrial areas. The new line will benefit daily commuters as well as those who rely on public transit the most, including women, immigrants, and young people. It will also ensure that communities in the southeastern part of the city have access to light rail, and that communities in the north-central part of the city will benefit from investments in rapid bus transit infrastructure for the future. Once fully built, 250,000 Calgarians will live within a 15-minute bus trip of the Green Line alignment.</p>\n\n<p><a name=\"_heading=h.gjdgxs\" id=\"_heading=h.gjdgxs\"></a>Reliable, modern public transit is the foundation of strong communities where Canadians live, work, and play. It creates jobs, cuts pollution, and supports a strong middle class. That is why, since 2015, the Government of Canada has invested over $5.18 billion in more than 440 infrastructure projects across Alberta under the Investing in Canada Plan, and will continue to invest in the future of our communities from coast to coast to coast.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“By investing in smart public transit projects, we’re reducing gridlock, helping more Calgarians get to and from work, creating good middle class jobs, growing the economy, and fighting climate change. As we set the course for an inclusive recovery from COVID‑19, we will keep focusing on laying the foundations for long-term, sustainable growth to create a Canada that is cleaner, more competitive, and more resilient for generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Public transit is at the heart of cities where people want to live, work, and play. The federal government’s investment of up to $1.53 billion for the Calgary Green Line will play a key role in shaping the future of the city by helping residents get around faster, cleaner, and cheaper. Investments in public transit create good jobs and grow the economy, tackle climate change, and build more inclusive communities.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Alberta's $1.53 billion commitment toward the Green Line is a massive investment in the future of Calgary, one we are happy to make, because we believe our best days are ahead of us. I'm grateful for the hard work done by the technical experts at the province and the city to make the Green Line a functional project that connects to the rest of the LRT network. I am confident that the Green Line is in a stronger, more certain position today, and is in the capable hands of an experienced project team who can take this important project forward.”</p>\n\n<footer class=\"default\">The Hon. Ric McIver, Alberta’s Minister of Transportation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Taxpayers are spending billions through the Investing in Canada Infrastructure Program to build important infrastructure in every corner of Alberta, including Calgary’s Green Line LRT. The Green Line will provide much-needed public transit options for Calgarians and create well-paying construction and engineering jobs in the near term. As a Calgarian, I look forward to seeing this project delivered on time and on budget.”</p>\n\n<footer class=\"default\">The Hon. Prasad Panda, Alberta’s Minister of Infrastructure</footer>\n</blockquote>\n\n<blockquote>\n<p>“Investments in transit are among the very best investments for a community. The Green Line is more than a train, it is a way for people to get to work and school and better participate in our community. Calgarians have been waiting for this for so long and it's great to take this important step.”</p>\n\n<footer class=\"default\">Naheed Nenshi, Mayor of Calgary</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In May 2018, the Government of Canada announced a major investment of up to $1.53 billion for Calgary’s Green Line Light Rail Transit project – the largest contribution ever made by the Government of Canada to an infrastructure project in Alberta.</li>\n\t<li>The new Green Line is expected to reduce greenhouse gas emissions by 30,000 tonnes per year, the equivalent of taking 6,100 cars off the road.</li>\n\t<li>The City of Calgary and the Province of Alberta are continuing due diligence on the project. The federal funding is subject to the necessary federal due diligence on the revised business case recently submitted to the Government of Canada. The government will continue to work with the Province of Alberta and the City of Calgary to ensure this review is undertaken quickly.</li>\n\t<li>Canada’s&nbsp;<a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/12/a-healthy-environment-and-a-healthy-economy.html\">strengthened climate plan</a> committed to provide public transit funding. The plan encourages cleaner modes of transportation, such as low and zero-emission vehicles, transit, and active transportation, to make communities healthier, less congested, and more vibrant.</li>\n\t<li>Through the Investing in Canada Plan, the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li>\n\t<li>Through the Investing in Canada Plan, the Government of Canada is already investing $28.7 billion to support public transit projects, including $5 billion available for investment through the Canada Infrastructure Bank.</li>\n\t<li>In February 2021, the Government of Canada also announced a plan for $14.9 billion in new public transit funding over eight years, including $2.5 billion over five years starting this year as well as a portion of the $3 billion in ongoing annual transit funding beginning in 2026-27, to expand transit systems in large urban centres by enabling major transit projects to advance. The plan will also accelerate job-creating projects across the country, support active transit, and electrify our transit systems.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2018/05/15/historic-federal-investment-expands-calgarys-public-transit-system\">Historic federal investment expands Calgary’s public transit system</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/10/new-public-transit-investments-build-strong-communities-fight-climate\">New public transit investments to build strong communities, fight climate change, and create new jobs across Canada</a></li>\n\t<li><a href=\"https://www.calgary.ca/transportation/green-line.html\">Green Line LRT</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}