{
  "path": "/en/news/readouts/2020/03/20/prime-minister-justin-trudeau-speaks-president-kenya-uhuru-kenyatta",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Kenya Uhuru Kenyatta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Kenya, Uhuru Kenyatta, to discuss COVID-19.</p>\n\n<p>Prime Minister Trudeau expressed solidarity with President Kenyatta and all Kenyans as they take the necessary measures to contain COVID‑19 and respond to its health, social, and economic impacts.</p>\n\n<p>The two leaders exchanged views on the strong measures being taken by Canada and Kenya to mitigate the effects of the virus, and to safeguard people in their respective countries. They agreed on the need for coordinated international action to change the trajectory of the disease, and the Prime Minister offered Canada’s support through international assistance to help vulnerable countries respond to its devastating impacts.&nbsp;</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>&nbsp;Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul></div>\n      "
}