{
  "path": "/en/news/news-releases/2016/02/09/prime-minister-deliver-keynote-speech-globe-2016-summit",
  "pageTitle": "Prime Minister to deliver keynote speech at GLOBE 2016 Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will deliver the keynote speech at GLOBE 2016, an international summit focused on innovation and sustainability that is being held in Vancouver from March 2 to 4, 2016.</p>\n<p>At the summit, Prime Minister Trudeau will talk about Canada’s plan to invest in clean growth that will help create jobs and get the country on the path to a low-carbon economy.</p>\n<p>There is enormous opportunity for Canada to become a leader in the clean growth market. The government is committed to working with the private sector, the provinces and territories, and other industry leaders to grow our economy, while also reducing our emissions.</p>\n<p>Under the theme “Business Innovation for the Planet”, GLOBE 2016 will bring together nearly two thousand business and government leaders from more than 50 countries to develop sustainable – and effective – business strategies.</p>\n<p>These discussions will build on the climate talks that took place last December in Paris, where Canada and 194 other countries reached a historic, ambitious, and balanced agreement to address climate change.</p>\n<p>Moving forward, Canada will continue to support clean growth and, in the process, deliver real benefits for our environment and our economy – including more good –paying, middle class jobs.</p>\n<p><strong>Quotes</strong></p>\n<p>“The future belongs to countries and businesses that become leaders of clean technologies, innovation, and sustainability. Canada is building the partnerships and making the investments necessary to take advantage of the growing opportunities in these markets.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://www.cop21paris.org/\">COP21</a></li>\n<li><a href=\"http://www.globeseries.com/\">GLOBE 2016</a></li>\n</ul></div>\n      "
}