{
  "path": "/en/news/statements/2021/07/26/wihtamakewin-ohci-kihci-okimaw-ta-atamiskawat-kanata-ohci-30th",
  "pageTitle": "Wîhtamâkêwin ohci Kihci Okimaw ta-âtamiskawât Kânata ohci 30th Opaminikêw General, Wiya Kihci Okimâwêyihtâkosiw Mary Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kihci Okimaw, Justin Trudeau, anohc pakitinam ôma wîhtamâkêwin ta-âtamiskawât Kânata ohci oskayi Opaminikêw General, Wiya Kihci Okimâwêyihtâkosiw<strong> </strong>Mary Simon:</p>\n\n<p>“Isi opîkiskwêstamâkêw kiki Kihci-Okimânâhk Kânata, nimiywêyihên mîna miyopayowin ta-âtamiskawâk Kânata’s 30th Opaminikêw General, Wiya Kihci Okimâwêyihtâkosiw<strong> </strong>Mary Simon.</p>\n\n<p>“Kî-nihtâwikiw Nunavik, kîwêtinohk isi Quebec, Wiya Okimâwêyihtâkosiw kî-kapê ayî atoskêw kiki êkwâniki wâsakâm wiya. Âhkamêyimow onîsohkamâkêw kiki Ayâsîmow ô-Miyikowisiniwaw êkwa isihcikêwin, oski iyiniwak, mîna wâsakâskamihtawin, kî-otihtikow mihcêt kistêyihcikâtêwina mîna wiya nistam Ayâsîmow ta-misiminahk atoskêwin isi Canadian opaminikêw.</p>\n\n<p>“Sâpô otatoskêwin, Wiya Okimâwêyihtâkosiw<strong> </strong>kî-wâpahtahiwêw mitoni nâkatêyihtamowin ta-nîkânipayihtahk ayisiyinîwiwin, manâcihcikêwin, mîna ayisiyiniw ô-miyikowisin âyimihiwêwina. Kî-nîkânîstam ta-maskawisihtahk miyo-wîcihitowin âyîtawâyihk ayisiyiniwak ohci Arctic itêhkêskamik, nânapo askiyinînâhk mîna misiwêskamik. Isi Kânata ohci Opaminikêw General mîna opaminikêw ohci kî-taskînaw Constitution êkwa institutions, Nikiskêyihtên ta-wîcihiwêt wiya ô-kihci kiskêyihtamowin mîna itâpisiniwin ta- pimohtêstamôwât Canadians isi kahkiyaw nisitawêyihtâkosiwin, nânapo ôta wîkiwahk mîna ôhpimê itê, asici mamihcâyâwin&nbsp;êkwa kistêyihtcikatewin, mîna nânapo ohci Kânata ô-kihci pîkiskwêwina. Niya mîna nikêhcinâhon êkwânima, isi Kânata ohci Kihci Okimâhkân, ta-atoskêw ta-sîtoskâkêt ôki ka-sôhkêyimocik nîsohkamakêwak ohci Canadian Simâkanisihkanak aykwaniki ê-ayiwâkêyihtakwahk nîkanîstamakêwin kiki mînopayiwin mîna pisiskêyihcikêwin ohci kitaskinaw mîna ayisiyiniawk.</p>\n\n<p>“Nicihkêyihtên ohci ôma kwayaskwêyihcikêwin anohc ka-ispayik, ayis kitaskînaw âhkami nîpawîstam ôhi âyimihowina kayas ohci ka-ki-itahkamikahk. Nikiskêyihtên êkwânima, isi Kânata nistam Nêhiyaw Opaminikêw General, Wiya Okimâwêyihtâkosiw<strong> </strong>ta-pakitiniso ta-wîcihiwêt ispîhk ka-mawinêhama ôhi âyimihiwêwina mâh-mâmawi, ta-pimohtêstamahk ôma mâmawi pimohcêskanas ohci nahêyihtowin reconciliation, mîna ta-osihtahk mâmawohkamâtowin âyîtawâyihk kahkiyaw êkwâniki ka-otasihkêcik ôta.</p>\n\n<p>“Êwako ôma kîsikâw, kî-mamihcimânaw Kihci-Okimâskwêw Elizabeth II, Kihci-Okimâskwêw ohci Kânata, êwako kiki 69 askiy kî-atoskâtam ôma Pimohtêstamâkêwin êkwa ayisiyiniwak asici kisiwêwâtisiwin, mamihcâyâwin, mîna iyinisowin. Êwako ôma 13th nawasônikêwin isi Opaminikêw General ohci Kânata kiki Kihci-Okimâskwêw aspin ohci ka-otinahk ôma kihci okimawîwin ispîhk 1952.</p>\n\n<p>“Ninanâskomaw Wiya Kihci Okimâwêyihtâkosiw<strong> </strong>Mary Simon kiki ka-otinahk ta- atoskâtahk mîna mêyâw nitêhihk ohci mamihcimowêwin. Ninatomâwak kahkiyaw Canadians ta-miskahkik pakosêyimowin êkwa sîhkiskâkêwin pîhci ôma kihci yahkohtêwin nîkânihk kiki kitaskînaw, mîna ta-wîcihicik ta-sîtoskawâyahk ka-isi pêtât ô-wâpahtamowin kiki kêyiwêhk, nawac nahiyikohk, êkwa ayiwâk Kânata piko isi kitaskînaw mitoni kihck mîna nistam mâwacêyas atoskêwîkamik.”</p>\n\n<h2>Kwayaskwêyihcikêwin Âniskômohcikan</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Kihci Okimaw wîhtamâkêw Kihci-Okimâskwêw ô-pakitêyihtamowin ohci Kânata kîhtwam Opaminikêw General</a></li>\n</ul></div>\n      "
}