{
  "path": "/en/news/readouts/2020/09/15/prime-minister-justin-trudeau-speaks-chancellor-angela-merkel-germany",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor Angela Merkel of Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the Chancellor of Germany, Angela Merkel, to discuss global issues as well as COVID-19 recovery efforts.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel spoke about ongoing efforts in Canada, Germany, and around the world, to address the impacts of the COVID-19 pandemic. They discussed the importance of building back better, supporting businesses and promoting a green recovery, and working with vulnerable countries to facilitate an inclusive recovery. The two leaders discussed global efforts to develop a vaccine and the need to ensure equitable vaccine access for all countries.</p>\n\n<p>The Prime Minister and Chancellor also discussed recent global developments. They exchanged views on China, with the Prime Minister noting with thanks that the arbitrary detention of two Canadian citizens was raised at the recently concluded EU-China virtual summit.&nbsp;They also discussed relations with Russia and reiterated their condemnation of the poisoning of Russian political opposition figure, Alexei Navalny.&nbsp;The two leaders also discussed the situation in Belarus and the importance of peaceful democratic change.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel looked forward to continued cooperation between Canada and Germany to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/09/minister-of-foreign-affairs-condemns-alexei-navalny-poisoning.html\">Minister of Foreign Affairs condemns Alexei Navalny poisoning</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/08/statement-by-minister-champagne-on-belarusian-presidential-elections.html\">Statement by Minister Champagne on Belarusian presidential elections</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}