{
  "path": "/en/news/statements/2022/11/14/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Global Entrepreneurship Week:</p>\n\n<p>“Today, we celebrate entrepreneurs from coast to coast to coast, and all around the world. Canadian entrepreneurs are taking risks, bringing new ideas to life, and making significant contributions to our country.</p>\n\n<p>“During the 15th <a href=\"https://www.genglobal.org/canada\">Global Entrepreneurship Week</a>, we recognize the people behind Canadian businesses for their dedication and innovative spirit, which drive economic growth and create good, middle-class jobs across the country. Entrepreneurs are always finding innovative ways to adapt to global challenges and to a rapidly evolving economy.</p>\n\n<p>“Investments in people, resources, and innovation are key for Canadian businesses to stay competitive. Earlier this year, the Government of Canada launched the $4 billion <a href=\"https://ised-isde.canada.ca/site/canada-digital-adoption-program/en\">Canada Digital Adoption Program</a> to help businesses grow their online presence and strengthen their e-commerce to reach new markets. In Budget 2022, the government committed $1 billion to launch a new Canadian innovation and investment agency, which will provide the tools and incentives for entrepreneurs to innovate.</p>\n\n<p>“At the same time, we are helping business owners who face systemic barriers. The <a href=\"https://ised-isde.canada.ca/site/women-entrepreneurship-strategy/en\">Women Entrepreneurship Strategy</a>, representing more than $6 billion in investments and commitments, aims to increase women’s access to the resources they need to start and scale their businesses. Additionally, investments of $265 million over four years in the <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a> are helping Black business owners and entrepreneurs to access resources that will help them grow their businesses and succeed now and into the future.</p>\n\n<p>“To Canadian entrepreneurs: thank you for your contributions to our country. The Government of Canada will continue to support and invest in growing businesses and work with our international partners to foster trade and investment and create good, middle-class jobs, as we build an economy that works for all Canadians.”</p></div>\n      "
}