{
  "path": "/en/news/news-releases/2018/08/31/prime-minister-announces-support-strengthen-canadas-automotive-sector",
  "pageTitle": "Prime Minister announces support to strengthen Canada’s automotive sector | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is making smart, ambitious investments to support Canadian autoworkers, create and protect jobs, and keep our auto sector competitive globally.</p><p>The Prime Minister, Justin Trudeau, today announced up to $9.46 million in funding to the University of Ontario Institute of Technology to enhance its Automotive Centre of Excellence in Oshawa, and to create new research and development jobs in the automotive industry.</p><p>The Automotive Centre of Excellence is a world-class facility that produces cutting-edge automotive technologies. Today’s investment will almost double the number of full-time jobs at the facility, generate new training opportunities, promote research and development, and encourage the advancement of cleaner and safer technologies.</p><p>The new funding will also support the integration of a Moving Ground Plane – a moving belt that acts like a road – and other state-of-the-art aerodynamic and aero-acoustic enhancements, which will help researchers create cleaner, safer, and more reliable vehicles.</p><h2>Quotes</h2><blockquote><p>“We’re taking action to support our Canadian workers throughout the auto sector. This project is great news for Oshawa and for Ontarians. It will create good, well-paying jobs in the region and help keep our industry competitive on the world stage. With a skilled workforce, world-renowned companies, and leading-edge research, Canada's auto sector is well positioned to create the vehicles of the future – ones that will be both safer and more efficient.”<br><i>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</i></p></blockquote><blockquote><p>“Canada is leading the way in developing transformative automotive technologies and promoting clean growth. Today’s announcement marks an important step forward for an innovative research centre that is helping Canadian industries access new resources, and embrace new methods to remain leaders in technological advancement.”<br><i>—The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development and Minister responsible for the Federal Economic Development Agency for Southern Ontario</i></p></blockquote><blockquote><p><em>“</em>The Government of Canada’s investment in this new advanced research infrastructure will drive commercialization of transformative vehicle technologies tied to energy efficiency and greenhouse gas reduction. It will further enhance the Automotive Centre of Excellence's capacity to support Canadian economic growth and competitiveness, decrease time-to-market for new automotive products, and keep industry partners and jobs right here in Canada<em>.”</em><br> —<i>Dr. Steven Murphy, President and Vice-Chancellor, University of Ontario Institute of Technology</i></p></blockquote><h2>Quick Facts</h2><ul><li>The University of Ontario Institute of Technology owns and operates the Automotive Centre of Excellence, which is recognized as a key contributor to Ontario’s 400-kilometre automotive innovation corridor.</li><li>The Centre is a 16,300 square-metre facility that houses one of the largest and most sophisticated wind tunnels in the world. The tunnel simulates weather conditions, such as severe wind, humidity, snow, ice, and desert heat, to measure the safety, durability, and efficiency of different vehicles.</li><li>In 2017, Canada produced 2.2 million vehicles. The auto sector is one of Canada’s largest manufacturing sectors with over 500,000 direct and indirect jobs, including aftermarket services and dealerships networks. It contributes $18 billion to Canada’s gross domestic product and is the country’s largest export industry.</li><li>The Government of Canada is contributing up to $9.46 million to this $12.5&nbsp;million project.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.feddevontario.gc.ca/eic/site/723.nsf/eng/home\">FedDev Ontario</a></li><li><a href=\"http://www.uoit.ca/\">University of Ontario Institute of Technology</a></li><li><a href=\"http://ace.uoit.ca/\">Automotive Centre of Excellence climate and wind tunnel</a></li></ul></div>\n      "
}