{
  "path": "/en/news/readouts/2021/01/13/prime-minister-justin-trudeau-speaks-prime-minister-norway-erna-solberg",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Norway Erna Solberg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Norway, Erna Solberg.</p>\n\n<p>Prime Minister Trudeau expressed his condolences for the loss of lives in the landslide in Gjerdrum, Norway.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Solberg discussed measures in place in Canada and in Norway to control the COVID-19 virus and to keep people safe. They agreed on the vital role of safe and effective vaccines to defeat the virus. They shared their commitment to equitable access to vaccines, diagnostics, and therapeutics, including by more vulnerable countries, as the virus does not end anywhere until it ends everywhere.</p>\n\n<p>The two leaders exchanged views on pressing global issues, such as fighting climate change, promoting democracy and human rights, and protecting international peace and security. They agreed to work on advancing these and other shared priorities, including peacebuilding, women, peace and security, and children in armed conflict. Prime Minister Trudeau expressed his support for Norway as it takes up its seat as a non-permanent member of the United Nations Security Council.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Solberg spoke about the important work of the High Level Panel for a Sustainable Ocean Economy, of which they are both members.</p>\n\n<p>The prime ministers also highlighted the close collaboration between Canada and Norway at the Arctic Council.</p>\n\n<p>The leaders agreed to continue working together to further strengthen the close relations between both countries.</p>\n\n<h2>&nbsp;Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/norway-norvege/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Norway Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/fisheries-oceans/news/2020/12/canada-commits-to-growing-the-blue-economy-at-home-and-around-the-globe.html\">Canada commits to growing the blue economy at home and around the globe</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/06/08/joint-statement-role-sustainable-ocean-economy-post-covid-19-world\">Joint Statement on the Role of a Sustainable Ocean Economy in a post-COVID-19 World</a></li>\n</ul></div>\n      "
}