{
  "path": "/en/news/itineraries/2016/11/08/itinerary-wednesday-november-9-2016",
  "pageTitle": "Itinerary for Wednesday, November 9, 2016 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Itinerary for the Prime Minister, Justin Trudeau, for Wednesday, November 9, 2016:</p>\n<p><strong>Ottawa, Ontario</strong></p>\n<p><strong>10:05 a.m.</strong> The Prime Minister will deliver remarks at the WE Day celebration.</p>\n<p>Canadian Tire Centre<br>1000 Palladium Drive<br>Ottawa, Ontario</p>\n<p><strong>Notes for media:</strong></p>\n<ul>\n<li>Open coverage</li>\n<li>Media registration opens at 8:30 a.m. All media hoping to capture the Prime Minister’s address should arrive by 9:00 a.m. at the latest. Note that access to media filming and photography locations are on a first come first served basis.</li>\n<li>Media should enter through Dodge Gate for registration (look for directional signage).</li>\n<li>As use of wireless equipment is not permitted in venue, audio boards will be provided for ENGs to plug in to.</li>\n<li>For media outlets looking to air live from WE Day, there are seven (7) Ethernet cables available to plug in to, available on a first come first served basis. Please contact Camila Ossa from the WE Day PR team immediately to reserve a line (contact details below)</li>\n<li><strong>Contact information for media inquiries:</strong>&nbsp; Camila Ossa, Associate Director, Public Relations, WE Day 1-416-885-5522 or <a href=\"mailto:camila.ossa@we.org\">camila.ossa@we.org</a></li>\n<li>The Prime Minister’s speech will be streamed through Facebook Live on <a href=\"https://www.facebook.com/WEMovement/\">WE’s Facebook page</a></li>\n</ul>\n<p><strong><br>11:00 a.m.</strong> The Prime Minister and Ms. Grégoire Trudeau will cast their ballots in the provincial by-election in the riding of Ottawa-Vanier.</p>\n<p>Returning Office<br>214 Montreal Road, Suite 500<br>Ottawa, Ontario</p>\n<p><strong>Note for media:</strong></p>\n<ul>\n<li>Photo opportunity only for arrival at Returning Office</li>\n</ul>\n<p><br>PMO Media Relations:<br>media@pmo-cpm.gc.ca<br>613-957-5555</p></div>\n      "
}