{
  "path": "/en/news/readouts/2020/06/02/prime-minister-justin-trudeau-speaks-president-namibia-dr-hage-g-geingob",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Namibia Dr. Hage G. Geingob | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Namibia, Dr. Hage G. Geingob.</p>\n\n<p>The two leaders discussed the latest developments in the COVID‑19 pandemic, as well as its health, social and economic impacts. They spoke about the situation in Canada and Namibia, and the importance of a coordinated global approach to ensure the health and safety of all people, especially the most vulnerable. They also discussed measures to build economic resilience and ensure a sustainable recovery for African countries, to diversify and strengthen supply chains for critical goods, and to ensure equitable access for all to vaccines once they are developed.</p>\n\n<p>The Prime Minister spoke about the joint initiative he recently launched with the United Nations Secretary-General and the Prime Minister of Jamaica to sharpen and accelerate the global response to the pandemic, and to mobilize access to critical development financing, including by low- and middle-income countries, to help them recover and build back into prosperous, resilient, and inclusive economies and societies.</p>\n\n<p>The two leaders also spoke about opportunities to strengthen the relationship between Canada and Namibia, including through increased trade and investment, building upon Canada’s longstanding support for Namibia since its independence thirty years ago.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<p><strong>Associated links</strong></p>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/southafrica-afriquedusud/bilateral_relations_bilaterales/canada_namibia-namibie.aspx?lang=eng\">Canada - Namibia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n</ul></div>\n      "
}