{
  "path": "/en/news/news-releases/2017/01/25/prime-minister-welcomes-new-members-prime-ministers-youth-council",
  "pageTitle": "Prime Minister welcomes new members of the Prime Minister’s Youth Council | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the next 11 members of the Prime Minister’s Youth Council. These young leaders bring new energy and ideas to inspire all Canadians. They will join the 15 existing members, bringing the Youth Council to a total of 26 members.</p><p>Chosen from over 16,000 applicants from across Canada, these young Canadians—aged 16 to 24 years—will advise the Prime Minister and the Government of Canada on policies and programs that are important to them and to all Canadians.</p><p>Yesterday, the full Youth Council met with Cabinet Ministers to discuss their experiences and their unique perspectives on Government of Canada priorities. During their meeting, the Youth Council tackled issues including youth employment, mental health, innovation, environment, climate change and clean growth, and diversity in the Canadian Armed Forces.</p><p>The Youth Council will continue to meet with the Prime Minister, Ministers, and other policy leaders to offer advice on the pressing challenges of our time. They will also meet with youth in their communities to discuss these challenges.</p><h2>Quote</h2><blockquote><p>“The voices of young Canadians are crucial as we work together to build a better Canada for today and for future generations. I am proud to work with the 26 members of the Youth Council, and look forward to continuing to hear from youth across Canada on the issues that matter most to them.”<br><cite>—&nbsp;The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Over 16,000 people applied to be considered for the Youth Council, and almost all of them expressed an interest in participating in other engagement activities in Canada and abroad. The Government of Canada is connecting those who signed up to a wide variety of opportunities to inform government decision-making.</li><li>Young Canadians can sign-up to receive news and get involved in engagement opportunities in areas of interest to them on <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">canada.ca/youth</a>.</li></ul><h2>Related Product</h2><ul><li>Backgrounder - <a href=\"/en/news/backgrounders/2017/01/25/new-members-prime-minister’s-youth-council\">New Members of the Prime Minister’s Youth Council</a></li></ul><h2>Associated Link</h2><ul><li>Website - <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li></ul></div>\n      "
}