{
  "path": "/en/news/news-releases/2016/05/27/prime-minister-attends-g7-summit-ise-shima",
  "pageTitle": "Prime Minister attends the G7 Summit in Ise-Shima | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to creating jobs, strengthening the middle class, and helping those working hard to join it. When the majority of middle class Canadians feel confident about their future – and their families’ future – the whole country benefits.</p>\n<p>Today, the Prime Minister, Justin Trudeau, concluded the G7 Leaders’ Summit in Ise-Shima, Japan. Following the Summit, the G7 leaders issued a joint-declaration where they committed to tackle major global challenges such as the need to promote sustainable economic growth that benefits all citizens, not just the wealthiest one per cent.</p>\n<p>While in Ise-Shima, Prime Minister Trudeau shared Canada’s proactive approach to bolster economic growth by making strategic investments in infrastructure and clean technologies – investments that will support good, well-paying jobs and strengthen the middle class. He underscored the need to improve growth around the world, but also stressed the need to question who the growth is going to benefit.</p>\n<p>The G7 leaders also discussed pressing foreign policy and security challenges, including Russian interference in Ukraine, the fight against the Islamic State of Iraq and the Levant (ISIL), and the global migration crisis. The Prime Minister highlighted the need for G7 solidarity to refrain from paying ransom to terrorist groups.</p>\n<p>During the Summit, the Prime Minister also supported Japan’s decision – as host country of the Summit – to place a particular focus on women’s empowerment and health. He shared Canada’s commitment to advancing gender equality and advancing women’s rights, and he encouraged his G7 counterparts to demonstrate leadership in the context of the Fifth Replenishment Conference of the Global Fund to Fight AIDS, Tuberculosis and Malaria, which will be held in Montreal in September 2016.</p>\n<p><strong>Quote</strong></p>\n<p>“For Canada, we know what made us successful in the past – a strong middle class. At the G7 this week, we had the opportunity to sit down with some of our closest international partners and discuss ways to not only improve global economic growth, but to also make sure that growth benefits all our citizens, not just a select few.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Leaders of the G7 – united by common values of freedom and democracy, and respect for human rights and the rule of law – come together each year to discuss issues of domestic and global concern. The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom and the United States. Representatives of the European Union also attend meetings.</li>\n<li>The G7 presidency rotates annually among country members. Japan holds the G7 presidency in 2016, and will be followed by Italy in 2017 and Canada in 2018.</li>\n<li>G7 Leaders also took part in discussions with the Leaders of Laos, Indonesia, Vietnam, Bangladesh, Sri Lanka, Papua New Guinea, and Chad, who had been invited by Japan to discuss shared challenges.</li>\n<li>G7 ministerial-level meetings are also held each year to build on the Leaders’ agenda. Japan has convened a total of 10 G7 ministerial meetings in 2016.</li>\n</ul>\n<p><strong>Associated links</strong></p>\n<ul>\n<li><a href=\"http://www.mofa.go.jp/files/000160266.pdf\">Declaration from the G7 Leaders’ Summit in Ise-Shima, Japan</a></li>\n<li>News Release: <a href=\"/en/news/news-releases/2016/05/09/canada-host-global-fund-replenishment-conference-fight-aids\">Canada to host Global Fund Replenishment Conference to fight AIDS, Tuberculosis, and Malaria</a></li>\n<li>News Release: <a href=\"/en/news/news-releases/2015/11/27/prime-minister-announces-investment-global-climate-change-action\">Prime Minister announces investment in Global Climate Change Action</a></li>\n<li>News Release: <a href=\"/en/news/news-releases/2016/02/08/prime-minister-sets-new-course-address-crises-iraq-and-syria-and\">Prime Minister sets new course to address crises in Iraq and Syria and impacts on the region</a></li>\n</ul></div>\n      "
}