{
  "path": "/en/news/readouts/2022/02/11/prime-minister-justin-trudeau-speaks-president-united-states-america-joe-0",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden, to discuss the ongoing illegal blockades taking place across Canada, which are threatening trade, jobs, the economy, and communities on both sides of the border.</p>\n\n<p>The two leaders discussed the critical importance of resolving access to the Ambassador Bridge and other ports of entry as quickly as possible, given their role as vital bilateral trade corridors and how essential they are to the extensive interconnections between our two countries – and our peoples.</p>\n\n<p>The Prime Minister underlined the coordination taking place between all orders of government in Canada in responding to these challenges, as well as between relevant authorities in Canada and the United States. The leaders agreed to continue closely coordinating bilateral efforts to ensure our respective authorities have all of the tools and information required to bring these illegal actions to an end as quickly as possible.</p>\n\n<p>The Prime Minister and President&nbsp;discussed the American and global influence on the protests, including financial support.&nbsp;The Prime Minister expressed concern that the flooding of Ottawa’s 911 phone lines yesterday originated in the United States.</p>\n\n<p>The two leaders agreed to stay in close touch.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/10/prime-minister-justin-trudeau-convenes-incident-response-group\">Prime Minister Justin Trudeau convenes the Incident Response Group</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n</ul></div>\n      "
}