{
  "path": "/en/news/news-releases/2019/02/28/historic-investments-canadas-space-program-create-jobs-and-new",
  "pageTitle": "Historic investments in Canada’s space program to create jobs and new industries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From pioneering satellite communications technologies to building the ‘Canadarm’ and space-based radar systems, Canada has made key contributions to space science and technology for close to six decades. Investing in science, innovation, and research unlocks new opportunities for economic growth, creates thousands of jobs for hard-working Canadians, and helps us understand the world we live in and our place in it.</p><p>Fifty years after the Moon landing, space exploration is entering a new chapter – and Canada will play a big role in it. The Prime Minister, Justin Trudeau, today announced Canada’s new partnership in the NASA-led Lunar Gateway – a project that will see humans return to the Moon and set the stage for further exploration to Mars.</p><p>The Gateway is a Moon outpost that will provide living space for astronauts, a docking station for visiting spacecraft, and laboratories for research. Canada will develop and contribute a smart robotic system – Canadarm3 – that will repair and maintain the Gateway.</p><p>Canada’s partnership in the Gateway ushers in a new era of Canadian excellence in space, and will be the cornerstone of Canada’s new, ambitious space strategy. The Government of Canada will invest $2.05 billion over 24 years for Canada’s space program. This investment will create hundreds of good, well-paying jobs over the next ten years – from scientists and engineers to technicians and computer programmers – and will contribute $100 million annually to Canada’s gross domestic product.</p><p>It will also help grow innovative Canadian companies of all sizes by supporting the development of new digital and artificial intelligence-based technologies, and by opening new markets for Canadian businesses.</p><p>This investment will also give Canadian astronauts the opportunity to participate in missions to space and our scientists a chance to conduct cutting-edge research that cannot be done on Earth.</p><p>The investment includes $150 million over five years in support for a new Lunar Exploration Accelerator Program. Drawing on Canada’s expertise as a world leader in innovation, this program will help small and medium-sized businesses in Canada develop new technologies to be used and tested in lunar orbit and on the Moon’s surface in fields that include artificial intelligence, robotics, and health.</p><p>Later today, in a town hall with Canadian students, the Prime Minister will also launch a junior astronaut recruitment initiative to begin this fall. The initiative will inspire the next generation of astronauts and get young Canadians excited about careers in science, technology, engineering, and mathematics. Top-performing participants will train with astronauts at the Canadian Space Agency headquarters.</p><p>Space exploration increases our knowledge of our planet and universe, and encourages research and discoveries that will create new business opportunities here in Canada and improve our daily lives. Through these investments, the Government of Canada is supporting future generations of innovators and explorers, and ensuring that Canadians are ready to take advantage of the jobs and industries of tomorrow.</p><h2>Quotes</h2><blockquote><p>“Canada’s historic investment will create good jobs for Canadians, keep our astronaut program running and our aerospace industry strong and growing, while opening up a new realm of possibilities for Canadian research and innovation. With the Lunar Gateway, Canada will play a major role in one of the most ambitious projects ever undertaken. Together, with our partners from around the world, we’ll continue to push the boundaries of human ambition, and inspire generations of kids&nbsp;–&nbsp;and adults&nbsp;–&nbsp;to always aim higher and aspire to something greater.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada recognizes that space is a national asset and a source of pride, and is committed to supporting economic opportunities that will unlock growth and jobs across this vibrant sector. The Government of Canada has a forward-looking vision for its space program and sector, making sure that our country remains a leading space-faring nation. Thanks to this investment, our Canadian astronauts will have access to new space missions, inspiring generations to come. The Canadian space community will maintain global leadership in robotics, and capitalize on our world-leading expertise in AI, and health.”<br>—<cite>The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada’s space sector employs 10,000 highly skilled workers and generated $2.3 billion for Canada’s economy in 2017, and over $2.1 billion in export sales.</li><li>The Government of Canada has invested more than $550 million since 2015 in Canada’s space sector, extending our participation in the International Space Station, providing funding to the Canadian Space Agency to test technologies in space, and helping Canadian companies scale up through the Strategic Innovation Fund.<ul><li>This funding includes an investment of $100 million over five years in Budget 2018 to leverage Canada’s expertise in satellite communications technologies for space and advance these promising technologies to create economic and social benefits for Canadians.</li></ul></li><li>In 2017, Canada launched a $125 million&nbsp;Pan-Canadian Artificial Intelligence Strategy&nbsp;to retain and attract top academic talent, and to increase the number of post-graduate trainees and researchers studying artificial intelligence and deep learning.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2019/02/28/canada-reaches-moon-and-beyond\">Backgrounder: Canada reaches for the Moon and beyond</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://asc-csa.gc.ca/eng/astronomy/moon-exploration/lunar-gateway.asp\">The Lunar Gateway</a></li><li><a href=\"http://asc-csa.gc.ca/JuniorAstronauts\">Junior Astronauts</a></li><li><a href=\"https://www.cifar.ca/ai/pan-canadian-artificial-intelligence-strategy\">Pan-Canadian Artificial Intelligence Strategy</a></li><li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li></ul></div>\n      "
}