{
  "path": "/en/news/news-releases/2023/04/11/prime-minister-trudeau-announces-more-support-ukraine",
  "pageTitle": "Prime Minister announces more support for Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, met with the Prime Minister of Ukraine, Denys Shmyhal, today, where he reiterated Canada’s solidarity with and support for Ukraine as it defends itself against Russia’s brutal, full-scale invasion.</p>\n\n<p>During the visit, Prime Minister Trudeau announced that Canada will provide additional military aid to Ukraine sourced from Colt Canada.</p>\n\n<p>Prime Minister Trudeau also announced Canada has disbursed a $2.4 billion loan to the Government of Ukraine to support essential services, such as pension payments, purchasing fuel, and restoring damaged energy infrastructure. This funding, announced in Budget 2023, brings Canada’s total commitment to Ukraine since the beginning of Russia’s illegal full-scale invasion to over $8 billion. &nbsp;</p>\n\n<p>During the visit, the leaders focused on efforts to rebuild Ukraine, including by hosting Canadian business leaders to discuss opportunities for Canadian trade and investment in Ukraine, particularly the essential role that private sector investment will play in Ukraine’s long-term reconstruction.</p>\n\n<p>To strengthen our trade ties and help support Ukraine’s economic recovery, Prime Minister Trudeau and Prime Minister Shmyhal signed a joint declaration on the conclusion of negotiations for the modernization of the Canada-Ukraine Free Trade Agreement (CUFTA), and underscored the need to complete the processes to implement it as quickly as possible. A modernized CUFTA supports long-term security, stability, and economic development in Ukraine, as well as the creation of good middle-class jobs here in Canada.</p>\n\n<p>Canada and Ukraine signed a bilateral Youth Mobility Agreement, which young people from both countries will benefit from when travel to Ukraine becomes safe. The Agreement further deepens the strong bonds between our peoples and our two countries. It will open up new opportunities for youth to work and travel, including opportunities for Canadian youth to help rebuild Ukraine once Russia withdraws its forces from the country.</p>\n\n<p>To maintain the pressure on the Russian regime, Prime Minister Trudeau announced new sanctions targeting 14 Russian individuals and 34 entities complicit in Russia’s war in Ukraine, including several security targets linked to the Wagner Group and Russia’s aviation sector. In addition, to further pressure Putin’s enablers in Belarus, the Prime Minister announced additional sanctions on nine entities related to the Belarusian financial sector.</p>\n\n<p>During Prime Minister Shmyhal’s time in Canada, Saskatoon-based Cameco and Ukraine’s state-owned Energoatom signed a major supply contract in which Cameco will provide the necessary uranium to meet Ukraine’s nuclear fuel needs until 2035. This supply contract, which builds on the partnership agreement signed earlier this year, will help Ukraine keep the lights on, while creating and supporting good, middle-class jobs here in Canada.</p>\n\n<p>Prime Minister Trudeau reiterated to Prime Minister Shmyhal that Canada will stand with Ukraine for as long as it takes.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada remains steadfast in our support for Ukraine and to helping Ukrainians defend their sovereignty, territorial integrity, and independence. I am incredibly happy to welcome Prime Minister Shmyhal to Canada and to work directly with him to keep doing everything we can to support Ukrainians, deepen our ties, promote our shared vision of a peaceful and secure future, and create economic opportunities for people in both our countries.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The Prime Minister was accompanied by Deputy Prime Minister and Minister of Finance Chrystia Freeland, Minister of Foreign Affairs Mélanie Joly, and Minister of National Defence, Anita Anand.</li>\n\t<li>Since Russia’s illegal occupation and attempted annexation of Crimea in 2014, Canada has imposed sanctions on more than 2,400 individuals and entities in Russia, Belarus and Ukraine. Many of these sanctions have been undertaken in coordination with Canada’s allies and partners.</li>\n\t<li>Since January 2022, Canada has committed more than $8 billion in funding for financial, military, humanitarian, development, and immigration assistance to Ukraine.</li>\n\t<li>This funding includes:\n\t<ul class=\"bulletOutline\"><li>Over $5 billion in financial assistance;</li>\n\t\t<li>Over $1 billion in military support;</li>\n\t\t<li>$352.5 million in humanitarian assistance;</li>\n\t\t<li>$127 million in development assistance; and</li>\n\t\t<li>Over $102 million in security and stabilization assistance.</li>\n\t</ul></li>\n\t<li>The new military assistance package includes 21,000 5.56mm assault rifles, 38 7.62mm machine guns, and over 2.4 million rounds of ammunition to support these weapons as well as small arms already in use by the Armed Forces of Ukraine. This donation comes from the remaining funds across the Government of Canada’s various funding envelopes for military assistance to Ukraine.</li>\n\t<li>Canadian Armed Forces members are supporting the Armed Forces of Ukraine in the United Kingdom and Poland under Operation UNIFIER, providing training on a range of military skills. Between 2015 and 2023, Canada trained more than 36,000 members of Ukraine’s security forces as part of Operation UNIFIER.</li>\n\t<li>The Canadian Armed Forces have been and will continue to assist with the delivery of military aid for Ukraine from Canada and on behalf of our allies and partners, having already transported over eight million pounds of donated military equipment since March 2022.</li>\n\t<li>Since February 2022, Canada has committed over $1 billion in military assistance to Ukraine. Commitments to date include eight Leopard 2 main battle tanks, one armoured recovery vehicle, a National Advanced Surface-to-Air Missile System (NASAMS) with associated munitions, 39 armoured combat support vehicles, anti-tank weapons, small arms, M777 howitzers and associated ammunition, high-resolution drone cameras, winter clothing, and more.</li>\n\t<li>Canada is helping Ukrainian families find a safe, temporary home in our country, and has put in place support services to help them after they arrive. This includes temporary financial assistance and access to federally funded settlement services, such as language training and employment-related services. Since Russia’s full-scale invasion, Canada has welcomed more than 139,000 Ukrainians.</li>\n\t<li>In 2022, total bilateral trade between Canada and Ukraine was valued at $421.6 million, a slight decrease from $447.3 million in 2021 largely due to the Russian invasion. In 2022, Canada’s merchandise exports to Ukraine totalled $150.2 million, and merchandise imports from Ukraine totalled $271.3 million.&nbsp;</li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/canadian-military-support-to-ukraine.html\">Canadian donations and military support to Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ukraine/index.aspx?lang=eng\">Canada-Ukraine Free Trade Agreement (CUFTA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2023/2023-01-11-joint-declaration-cufta-declaration-commune-alecu.aspx?lang=eng\">Joint Declaration on Conclusion of Negotiations for the Modernization of the Canada-Ukraine Free Trade Agreement</a></li>\n</ul></div>\n      "
}