{
  "path": "/en/news/news-releases/2018/07/11/canada-assume-command-new-nato-training-mission-iraq",
  "pageTitle": "Canada to assume command of new NATO training mission in Iraq | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As a founding member of NATO, Canada has demonstrated strong and active leadership in the organization. Our country has always answered the call to protect international peace and security.</p><p>The Prime Minister, Justin Trudeau, today announced that Canada will expand our leadership role by assuming command of a new NATO training and capacity building mission in Iraq for its first year.</p><p>The mission is the natural next step for Canada, as we move forward from the successful fight against Daesh to helping build institutional capacity in Iraq and create the foundations for longer-term peace and stability. Canada’s leadership of this new NATO training mission will complement our existing efforts in the Global Coalition Against Daesh, transitioning our support for Iraq to meet present needs and solidify gains.</p><p>Iraq faces significant challenges in rebuilding the capacity of its security forces. Canada’s contribution will help build security capacity and improve democratic governance. As part of this mission, up to 250 Canadian Armed Forces members will join partner countries in helping Iraq build a more effective national security structure and improve training for Iraqi security forces.</p><p>Canada’s leadership role will start in Fall 2018 and run to Fall 2019. Troops will be deployed to Baghdad and the vicinity. Canada’s contribution will also include the deployment of up to four Griffon helicopters to support NATO activities.</p><h2>Quote</h2><blockquote><p>“Since NATO’s creation in 1949, Canada has played a strong and active role in missions to advance peace and security for our citizens and people around the world. We are proud to take a leadership role in Iraq, and work with our Allies and the Government of Iraq, to help this region of the Middle East transition to long-lasting peace and stability.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau announced this new NATO mission during the “Our Shared Global Values” engagement event today just before the NATO Summit.</li><li>Under Operation IMPACT, the Canadian Armed Forces is already providing training and assistance to the Iraqi security forces and helping regional forces build their capacity.</li><li>Canada is also currently contributing mobile training teams to NATO’s counter-improvised explosive device capacity building efforts for Iraq. This initiative builds on that effort.</li><li>Last year, the Government of Canada unveiled <a href=\"http://dgpaapp.forces.gc.ca/en/canada-defence-policy/index.asp\"><i>Strong, Secure, Engaged</i></a> –a comprehensive, ambitious, once-in-a-generation defence policy which includes historic new funding for Canada’s military.</li><li>The new defence policy represents an increase of more than 70% of Canada’s defence budget between 2016 and 2026, and will give Canada’s armed forces the capability to be even more active beyond its borders, and expand its active leadership in NATO.</li><li>Canada, along with 11 other countries, founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. For more than six decades, NATO has proven itself as a major contributor to international peace, security, and stability.</li></ul><h2>Related Product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2018/07/11/canada’s-leadership-iraq\">Canada’s leadership in Iraq</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li><li><a href=\"/en/news/news-releases/2018/06/25/prime-minister-trudeau-attend-nato-summit\">Prime Minister Trudeau to attend NATO Summit</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad-current/op-impact.page\">Operation IMPACT</a></li></ul></div>\n      "
}