{
  "path": "/en/news/news-releases/2020/11/09/connecting-all-canadians-high-speed-internet",
  "pageTitle": "Connecting all Canadians to high-speed Internet | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we continue to deal with the global COVID-19 pandemic, Canadians have needed to rely on the Internet to help connect them to work, school, government resources, and loved ones. It’s how grandparents visit with their grandchildren, students communicate with their teachers and classmates, and businesses continue to sell their products. However, many communities across Canada still don’t have the infrastructure needed to connect us to one another. That’s why the Government of Canada is working to ensure all Canadians have access to fast and reliable Internet, no matter where they live.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of $1.75 billion to help connect Canadians to high-speed Internet across the country, grow businesses, and create jobs. This investment will connect 98 per cent of Canadians across the country to high-speed Internet by 2026, with the goal of connecting all Canadians by 2030.</p>\n\n<p>Announced originally in Budget 2019 as $1 billion, today’s additional funding of $750 million for the Universal Broadband Fund will help advance projects with partners, like the Canada Infrastructure Bank, to connect Canadian households and businesses in underserved communities over the next six years. This includes a $150 million Rapid Response Stream with an accelerated application process to allow shovel-ready projects to get started right away. With today’s announcement, our government has made $6.2 billion available for universal broadband since 2015.</p>\n\n<p>The Prime Minister also announced an agreement of $600 million with Canadian satellite company Telesat to improve connectivity and expand high-speed Internet coverage to the far north, rural, and remote regions across Canada, through low-earth-orbit satellite capacity.</p>\n\n<p>Today’s announcement is the largest one-time federal investment in broadband and will make a real difference in the lives of Canadians and businesses across the country. It will support Canadians living in rural, remote, and northern communities and move forward the Government’s commitment to create over one million jobs. As we work to rebuild from the pandemic, the Government of Canada will continue to make investments in infrastructure to build strong communities and a more competitive and resilient Canada for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Now more than ever, Canadians need reliable access to high-speed Internet as we work, learn, and communicate with our family and friends from home. With today’s announcement, we are continuing to bring faster Internet access to every part of our country, helping businesses grow, creating new jobs, and building a better Canada for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our connections have been our biggest strength in response to the pandemic and it’s our connections that will drive our economic recovery in the post-pandemic world. Our government introduced the first national plan to connect all Canadians to high-speed internet and we are delivering. Our investments will connect 1.7 million households to better internet and the Universal Broadband Fund will build on progress to date, placing Canada at the head of the pack globally for countries that are rapidly investing in their high-speed networks.”</p>\n\n<footer class=\"default\">The Hon. Maryam Monsef, Minister for Women and Gender Equality and Rural Economic Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know that access to high-speed Internet is a top priority for rural and remote Canadians and we are leveraging the latest technologies in order to ensure that all Canadians have access. High-speed Internet is more than just a convenience – it means opportunity. It enables physicians to see patients from a distance. It allows businesses to reach customers around the world and it allows students in one classroom to connect with their peers in other parts of the country. The agreement with Telesat will help unlock economic and social opportunities in Canada’s most rural and remote communities.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“The pandemic has made the Government's commitment to connect all Canadians to high-speed internet more important than ever. The Canada Infrastructure Bank’s $2 billion broadband initiative will help accelerate connectivity in Canada by developing and delivering large-scale, high-impact projects, including through a collaboration with the Universal Broadband Fund. The CIB’s investments in broadband will connect more than three quarters of a million households and businesses in underserved communities, improving lives and creating good jobs.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Whether you live in Quebec City, the Eastern Townships, or Abitibi-Témiscamingue, you need to be connected to high-speed Internet. We will not stop our efforts until we have connected all Quebecers. This is the message we are sending today by investing massively to connect Quebec households even faster.”</p>\n\n<footer class=\"default\">The Hon. Pablo Rodriguez, Leader of the Government in the House of Commons and Quebec Lieutenant</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Universal Broadband Fund was announced in Budget 2019. It is part of a series of federal investments made to improve access to high-speed Internet, which are expected to connect nearly 400,000 additional households by the end of 2023.</li>\n\t<li>The Universal Broadband Fund will also allocate $50 million of its total budget for mobile Internet projects that primarily benefit Indigenous peoples. This includes projects along highways and roads, and in Indigenous communities, where mobile connectivity is lacking.</li>\n\t<li>The Government of Canada has already made significant progress toward its goal of connecting all Canadians to high-speed Internet by 2030, by supporting projects and programs that will connect 1.2 million Canadian households over the next few years.</li>\n\t<li>The Government of Canada will work with partners to provide all Canadians with at least 50 megabits per second download speeds and 10 megabits per second upload speeds, no matter where they are in the country. These speeds will allow Canadians to telework, participate in e-learning, and access telehealth resources.</li>\n\t<li>The Canada Infrastructure Bank recently announced a $2 billion broadband initiative as part of the Growth Plan. This initiative will help connect approximately 750,000 homes and small businesses to broadband in underserved communities, so Canadians can better participate in the digital economy.</li>\n\t<li>Telesat Canada was established as a Crown Corporation in 1969, and is now a Canadian-controlled privately held corporation. It has employees in five provinces and one territory, and several countries around the world, and is the world’s fourth largest satellite operator.</li>\n\t<li>Satellites in low-earth-orbit operate 36 times closer to the earth than traditional communications satellites. This means they take less time to send and receive information, leading to better and faster broadband service, including in rural, remote, and northern areas.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2020/11/universal-broadband-fund-and-telesat-low-earth-orbit-capacity-agreement.html\">Backgrounder: Universal Broadband Fund and Telesat Low Earth Orbit satellite capacity agreement</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/01/prime-minister-announces-infrastructure-plan-create-jobs-and-grow\">Prime Minister announces infrastructure plan to create jobs and grow the economy</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/139.nsf/eng/h_00006.html\">Universal Broadband Fund</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/139.nsf/eng/h_00002.html\">High-Speed Access for All: Canada's Connectivity Strategy</a></li>\n\t<li><a href=\"https://cib-bic.ca/en/growth-plan/\">Canada Infrastructure Bank: Growth Plan</a></li>\n\t<li><a href=\"https://www.asc-csa.gc.ca/eng/publications/space-strategy-for-canada/13-delivering-the-vision-everyday-challenges.asp\">Space Strategy for Canada</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/app/sitt/bbmap/hm.html?lang=eng\">National Broadband Internet Service Availability Map</a></li>\n</ul></div>\n      "
}