{
  "path": "/en/news/readouts/2020/09/24/prime-minister-justin-trudeau-speaks-prime-minister-jamaica-andrew-holness",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Prime Minister of Jamaica Andrew Holness | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Jamaica, Andrew Holness, to offer congratulations on his electoral win earlier this month, and to discuss the challenges of the COVID-19 pandemic.</p>\n\n<p>Prime Minister Holness extended his condolences on the recent death of former Canadian Prime Minister John Turner.</p>\n\n<p>The leaders discussed ongoing efforts in Canada and Jamaica, and throughout the Caribbean to contain the coronavirus, keep people healthy, and build resilient communities. They reaffirmed their shared commitment to fostering coordinated regional action in responding to the health, social, and economic impacts of the pandemic.</p>\n\n<p>The Prime Ministers welcomed the collaboration between Canada and Jamaica in leading efforts at the United Nations to galvanize multilateral action in support of pandemic response and recovery, and looked forward to convening with the UN Secretary-General at next week’s High-Level event on Financing for Development in the Era of COVID-19 and Beyond.</p>\n\n<p>The Prime Ministers reaffirmed their commitment to the strong relationship between Canada and Jamaica, based on people-to-people ties and shared values of democracy and human rights.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/jamaica-jamaique/bilateral_relations_bilaterales/canada_jamaica-jamaique.aspx?lang=eng\">Canada - Jamaica Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}