{
  "path": "/en/news/news-releases/2022/03/21/prime-minister-travel-belgium-meet-allies-and-partners-continue",
  "pageTitle": "Prime Minister to travel to Belgium to meet with allies and partners to continue addressing Russia’s invasion of Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, will travel to Brussels, Belgium, from March 23 to 25, 2022, to engage with European Union, NATO and G7 leaders to build on our coordinated response to Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>On March 23, the Prime Minister will address the European Parliament where he will speak on peace and security, defending democracy, and transatlantic cooperation for the benefit of people in Canada and the European Union. This will be the Prime Minister’s second address to the European Parliament on the close Canada-European Union partnership.</p>\n\n<p>On March 24, the Prime Minister will meet with leaders from Allied countries at the NATO Summit to further coordinate support for Ukraine, and discuss further strengthening NATO’s deterrence and defence measures.</p>\n\n<p>The Prime Minister will then attend the G7 Heads of State and Government Meeting where leaders will discuss the current situation in Ukraine and its wider global impacts, including food security and energy supply.</p>\n\n<p>While in Belgium, Prime Minister Trudeau will meet with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau travelled to the United Kingdom, Latvia, Germany, and Poland earlier this month to continue building key partnerships to respond to Russia’s invasion of Ukraine. While in Europe, the Prime Minister announced more support for Ukraine including new sanctions against Russia, additional humanitarian aid, and the provision of more military equipment to Ukraine.</p>\n\n<p>The Prime Minister continues to engage with world leaders on a regular basis to support Ukraine as it defends its people, its sovereignty, and its territorial integrity from this illegal and unjustifiable invasion.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Russia’s illegal and unjustifiable invasion of Ukraine is an attack on democracy, international law, human rights, and freedom. Canada is working in close collaboration with our allies and partners in defending democracy against authoritarianism and standing with the Ukrainian people.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}