{
  "path": "/en/news/news-releases/2018/11/01/new-home-nuclear-medicine-university-british-columbia",
  "pageTitle": "New home for nuclear medicine at the University of British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians have played a leading role in many medical breakthroughs – such as the discovery of stem cells and insulin – that have saved countless lives and led to a better quality of life for people around the world. Today, Canada continues to pave the way for new medical discoveries, including in the groundbreaking medical isotope industry.</p><p>The Prime Minister, Justin Trudeau, today announced federal funding to build a new home for nuclear medicine at TRIUMF. The Institute for Advanced Medical Isotopes (IAMI) will provide a first-of-its-kind hub in Canada. With contributions from the Province of British Columbia, the University of British Columbia, and BC Cancer, industry partners, academic researchers, and clinicians will work together to advance medical isotope production, drug development, cancer therapy, clinical imaging, and radiopharmaceutical research – advancements that have the potential to help thousands of Canadians who suffer from illness.</p><p>Investing in science and innovation is a key driver of jobs and growth, and essential to building a modern, resilient economy for Canadians. That’s why the Government of Canada has made historic investments in fundamental science, including the largest in Canadian history in Budget 2018, and will continue making smart, strategic investments that support job creation and position Canada as a leader in science, technology, and innovation.</p><p>The new 2,500-square-metre building will house a particle accelerator, as well as research facilities, equipment, laboratories, and office space. By concentrating all aspects of creating, handling, and testing isotopes in one location – from the creation of raw materials to clinical trial work of potential therapies – the IAMI will help Canada stay a leader in the production and research of medical isotopes worldwide.</p><p>This project will provide students and local researchers with access to a modern educational facility with innovative spaces for instruction, research, and laboratory work. It also provides TRIUMF and its network with the opportunity to develop new educational programs, increase research capacity, and attract new students from across Canada and around the world.</p><h2>Quotes</h2><blockquote><p>“The Institute for Advanced Medical Isotopes will be a state-of-the-art facility where industry leaders and academics can work together to push the boundaries of research and discover new ways to protect and improve our health. We will continue to invest in cutting-edge research and facilities – like the Institute for Advanced Medical Isotopes – to ensure Canada remains a world leader in medical research and innovation.”<br><cite>—</cite><cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The new drugs and cancer treatments developed by TRIUMF and the Institute for Advanced Medical Isotopes will help people live longer, healthier lives. Investing in the front lines of the fight against cancer will give life and hope to people here in British Columbia and around the world.”<br><cite>—The Hon. John Horgan, Premier of British Columbia</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada is contributing $10,232,310 to this project through the Investing in Canada infrastructure plan. The Province of British Columbia has contributed $12,250,000, TRIUMF is contributing $5,352,638 and, through fundraising initiatives, BC Cancer and the University of British Columbia are each contributing $2 million.</li><li>The new building will house a new TR-24 medical cyclotron (a type of particle accelerator), a cyclotron control room, and six laboratories. The new facility will also have technical rooms, quality control laboratories, office space, and electrical control rooms.</li><li>Supported by a multi-million dollar philanthropic donation through the BC Cancer Foundation, BC Cancer will also use the facility to advance the research and development of highly targeted therapeutic isotopes to treat metastatic cancers.</li><li>Canada is a leader in the roughly $4 billion global medical isotope industry and contributes more than 50&nbsp;per&nbsp;cent of the world's raw material for medical isotope supply.</li><li>TRIUMF is Canada’s national particle accelerator centre owned and operated as a joint venture by a consortium of universities. The venture is supported in part by the Government of Canada through an annual contribution of more than $50&nbsp;million provided by the National Research Council for core operations.</li><li>Medical isotopes are safe radioactive substances used by health professionals to diagnose and treat health conditions of the heart, circulatory system, and organs. They allow us to see what is happening inside the body in a non-invasive way and in real-time at a molecular level.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada's Long-Term Infrastructure Plan</a></li><li><a href=\"http://www.infrastructure.gc.ca/map-carte/bc-eng.html\">Federal infrastructure investments in British Columbia</a></li></ul></div>\n      "
}