{
  "path": "/en/news/readouts/2021/10/31/prime-minister-justin-trudeau-meets-prime-minister-pedro-sanchez-spain",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Pedro Sánchez of Spain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with Prime Minister Pedro Sánchez of Spain on the margins of the G20 Leaders’ Summit in Rome, Italy.</p>\n\n<p>Prime Minister Sánchez congratulated Prime Minister Trudeau on his re-election.</p>\n\n<p>The two leaders exchanged views on a number of areas of close collaboration between Spain and Canada,&nbsp;and discussed key issues on the G20&nbsp;Leaders’&nbsp;Summit agenda.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez&nbsp;discussed the importance of progressive and open economic and trade relations as a source of prosperity for all.&nbsp;They exchanged views on the opportunities provided to workers and businesses in both countries by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), building upon the two countries’ extensive trade and investment relations, longstanding academic and youth exchanges, and close people-to-people ties.</p>\n\n<p>The prime ministers discussed how to work, in partnership with other international partners, to ensure a strong and inclusive economic recovery that leaves no one behind. Further to their collaboration&nbsp;over the past year on the Financing for Development in the Era of COVID-19 and Beyond initiative, they&nbsp;took note of the need to ensure access to comprehensive support for economic recovery and resilience in order to address the needs of vulnerable and low- and middle-income countries in Latin America and the Caribbean.</p>\n\n<p>Prime Minister Trudeau and Prime Minister&nbsp;Sánchez&nbsp;reaffirmed the close strategic relationship between Canada and Spain, and spoke at length about their work to advance international peace and security within the UN, NATO, and other international forums. They discussed ways to overcome the destructive interrelationship between climate change, instability, and&nbsp;conflict. In this regard,&nbsp;Prime Minister Trudeau expressed his appreciation for Spain’s support&nbsp;for a&nbsp;NATO Centre&nbsp;of Excellence on&nbsp;Climate&nbsp;and&nbsp;Security<em> </em>in Canada.</p>\n\n<p>The two leaders committed to continued security and defence cooperation, and discussed ways to work together to enhance engagement with the Indo-Pacific region.&nbsp;They also spoke about opportunities to strengthen resilience and security in the Sahel, working with other close international partners and allies.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez&nbsp;also exchanged views on the impacts of developments in Venezuela.<strong>&nbsp;</strong>They spoke about the importance of comprehensive approaches to migration and population displacement, and international collaboration to address these challenges in a positive and humane manner.</p>\n\n<p>The leaders looked forward to working together, along with like-minded international partners, in the Spanish-led&nbsp;Together for Stronger Multilateralism&nbsp;initiative, to advance common interests and key priorities, including protecting democratic values, addressing inequalities, and strengthening the rules-based international order. Prime Minister Trudeau expressed his gratitude for Spain’s endorsement of the Declaration Against Arbitrary Detention in State-to-State Relations.</p>\n\n<p>The two leaders discussed the ongoing impacts of the COVID-19 pandemic and emphasized the importance of a green, inclusive, and sustainable economic recovery. They agreed on the need for leadership and ambition going into the COP26 summit in Glasgow, United Kingdom.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada-Spain Relations</a></li>\n\t<li><a href=\"https://www.g20.org/\">G20 Italy 2021</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">CETA</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/arbitrary_detention-detention_arbitraire.aspx?lang=eng#a1\">Arbitrary detention in state-to-state relations</a></li>\n\t<li><a href=\"https://ukcop26.org/\">UK COP26 2021</a></li>\n</ul></div>\n      "
}