{
  "path": "/en/news/readouts/2023/02/01/prime-minister-justin-trudeau-meets-british-columbia-premier-david-eby",
  "pageTitle": "Prime Minister Justin Trudeau meets with British Columbia Premier David Eby | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with British Columbia Premier David Eby. The two leaders discussed a number of shared priorities, including building more housing, keeping our communities safe, growing a strong, clean economy, and ensuring better health outcomes for British Columbians.</p>\n\n<p>On health care, the Prime Minister and Premier Eby said they are looking forward to the working session on February 7, when First Ministers will discuss a plan to address the major pressures facing health care systems across the country. They agreed to ensure that British Columbians’ health care priorities are addressed.</p>\n\n<p>The Prime Minister and Premier Eby also discussed measures the provincial government has introduced to ensure more affordable housing options for British Columbians, and how the provincial and federal governments can best partner to achieve results.</p>\n\n<p>Premier Eby noted Canada’s Indo-Pacific Strategy, which was recently announced. The two leaders agreed to work together to promote British Columbia’s role as Canada’s gateway to Asia-Pacific economies.</p>\n\n<p>The two leaders also discussed the importance of attracting global talent and agreed to continue to work together to make it easier and more efficient for foreign-trained professionals to get the credentials they need to work in Canada.&nbsp;</p>\n\n<p>The Prime Minister and Premier Eby agreed to remain in close contact and to continue working together on these and other shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/10/21/statement-prime-minister-selection-next-premier-british-columbia\">Statement by the Prime Minister on the selection of the next premier of British Columbia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/12/03/prime-minister-justin-trudeau-meets-british-columbia-premier-david-eby\">Prime Minister Justin Trudeau meets with British Columbia Premier David Eby</a></li>\n</ul></div>\n      "
}