{
  "path": "/en/news/news-releases/2022/03/16/supporting-canadas-automotive-manufacturing-sector-and-its-workers",
  "pageTitle": "Supporting Canada’s automotive manufacturing sector and its workers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Across the country, Canadians are laying the groundwork for a strong economic recovery that will create good jobs, grow the middle class, cut pollution, and build a cleaner future for everyone. The Government of Canada is making smart investments to support automotive workers, help Canadians get around in cleaner and more affordable ways, and make Canada a global leader in building hybrid-electric vehicles.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Premier of Ontario, Doug Ford, to announce a new federal investment of $131.6&nbsp;million that will help <a href=\"https://www.hondacanada.ca/home\">Honda Canada</a> retool its manufacturing operations in Alliston, Ontario to launch the next generation of hybrid-electric vehicles. This investment will be matched by the Province of Ontario.</p>\n\n<p>Today’s announcement will help Honda Canada secure well-paying, high-quality jobs in Alliston and across the Canadian supply chain. The retooling project, totalling nearly $1.4&nbsp;billion over six years, will play an essential role in ensuring the long-term viability of our auto sector by building the cleaner vehicles that drivers across North America are increasingly looking for.</p>\n\n<p>The government is supporting Canada’s automotive manufacturing sector in making cleaner, more affordable transportation available to Canadians – a key pillar of our strengthened climate plan. Together, we are cutting pollution, making life more affordable for the middle class, strengthening our communities, and building an economy that is more competitive for the generations to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today, we’re investing in workers, in communities, and in our future. Building hybrid-electrics will support thousands of good jobs here in Alliston and grow the economy, all while cutting pollution and keeping our air clean. By helping Canadians build – and then drive – cleaner vehicles, we’re delivering on our plan to build a better future for all.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government has a plan to build the future of auto manufacturing right here in Ontario. We’re attracting more skilled workers to fill critical jobs and connecting resources and industries in northern Ontario to the future of manufacturing electric and hybrid vehicles so that every region can enjoy the economic benefits of these game-changing investments. We are so pleased that Honda has made this investment in Ontario and know that the cars of the future will be built here in Alliston and all across Ontario for decades to come.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“With today’s investment, our government is securing thousands of good, well-paying jobs in Ontario’s auto sector. This investment will help support Honda as they transition to producing the cars Canadians want: low and zero-emission vehicles. Investments like these show that our government is here to support Canada’s auto sector today and to ensure that the right skills, tools, and workforce are in place so we can keep producing the cars of the future here in Canada for decades to come.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Ontario is proud to support Honda Canada’s major investment to retool its Alliston plant to manufacture the company’s next-generation models, including hybrid versions. Through Phase&nbsp;2 of our Driving Prosperity plan, we are focusing on transitioning Ontario’s automotive supply chain. By reducing the cost of doing business in Ontario by nearly $7&nbsp;billion annually, our government has created the right economic conditions to attract yet another historic investment that further positions Ontario as a North American leader in developing and building the cars of the future.”</p>\n\n<footer class=\"default\">The Hon. Vic Fedeli, Ontario’s Minister of Economic Development, Job Creation and Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“This represents an important milestone for Honda as we move forward in our ambitious vision to make battery electric vehicles represent 100 per cent of our global vehicle sales by 2040. HCM is home to a team of remarkably talented associates who build some of Honda’s most popular and fuel-efficient products. This investment not only ensures our product and manufacturing competitiveness within Ontario, Canada, and abroad, but also significantly bolsters our ongoing efforts to reduce greenhouse gas emissions to help Canada attain its overall climate targets.”</p>\n\n<footer class=\"default\">Jean Marc Leclerc, President and CEO, Honda Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today’s federal investment of $131.6&nbsp;million is being delivered through the government’s <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a>.</li>\n\t<li>Honda Canada’s retooling project will cut pollution by producing hybrid-electric vehicles which emit 30 per cent less than traditional gas-powered vehicles. These vehicles are expected to help reduce emissions of Honda’s total Canadian sales by 2 megatonnes by 2026 compared to 2005 levels.</li>\n\t<li>Honda first came to Canada in 1986. It operates in Alliston, Ontario, and is Canada’s second-largest automotive manufacturer.</li>\n\t<li>Honda Canada can produce more than 400,000 vehicles and 190,000 engines annually, and manufactures two of Honda’s best-selling models around the world, the CR-V and the Civic.</li>\n\t<li>The automotive sector in Canada supports nearly 500,000 Canadian workers, contributes $16&nbsp;billion annually to Canada’s gross domestic product, and is one of the country’s largest export industries.</li>\n\t<li>Investing in cleaner transportation is key to achieving our economic and environmental goals, and delivering on the government’s strengthened climate plan, <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview.html\"><em>A Healthy Environment and a Healthy Economy</em></a>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.hondacanada.ca/home\">Honda Canada Inc</a>.</li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n</ul></div>\n      "
}