{
  "path": "/en/news/news-releases/2017/02/22/prime-minister-announces-working-group-ministers-review-laws-and",
  "pageTitle": "Prime Minister announces Working Group of Ministers on the Review of Laws and Policies Related to Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As part of the government’s commitment to a renewed nation-to-nation relationship with Indigenous Peoples, the Prime Minister, Justin Trudeau, today announced the review of laws and policies related to Indigenous Peoples.</p><p>The Working Group of Ministers responsible for the review will examine relevant federal laws, policies, and operational practices to help ensure the Crown is meeting its constitutional obligations with respect to Aboriginal and treaty rights; adhering to international human rights standards, including the United Nations Declaration on the Rights of Indigenous Peoples; and supporting the implementation of the Truth and Reconciliation Commission’s Calls to Action.</p><p>The Working Group will work with Indigenous leaders, youth, and experts on various legal and policy questions relating to Indigenous Peoples.</p><p>The Minister of Justice and Attorney General of Canada, the Honourable Jody Wilson-Raybould, will chair the Working Group, which will comprise six ministers who have significant responsibilities for the relevant statutes and policies to be reviewed.</p><p>As its first order of business, the Working Group will develop a rigorous work plan and principles, which will reflect a whole-of-government approach that addresses all Indigenous Peoples.</p><h2>Quote</h2><blockquote><p>“Today, we are meeting the commitment we made to First Nations, Inuit and Métis, and to all Canadians to review the laws and policies that relate to Indigenous Peoples. The Working Group of Ministers – in partnership with Indigenous leaders and a broad range of stakeholders, including youth – will assess and recommend what statutory changes and new policies are needed to best meet our constitutional obligations and international commitments to Indigenous Peoples. Through this initiative and the other steps we have recently taken, we are working on a complete renewal of Canada’s nation-to-nation relationship with Indigenous Peoples.”<br>- <cite>The Right Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Supported by the Privy Council Office, the working group will comprise:</li><ul><li>The Hon. Carolyn Bennett, Minister of Indigenous and Northern Affairs</li><li>The Hon. Dominic LeBlanc, Minister of Fisheries, Oceans and the Canadian Coast Guard</li><li>The Hon. Jody Wilson-Raybould, Minister of Justice and Attorney General of Canada (Chair)</li><li>The Hon. Jane Philpott, Minister of Health</li><li>The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development</li><li>The Hon. James Gordon Carr, Minister of Natural Resources</li></ul></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples</a></li><li><a href=\"/en/news/statements/2015/12/16/statement-prime-minister-canada-meeting-national-aboriginal\">Statement by the Prime Minister of Canada on meeting with National Aboriginal Organizations</a></li><li><a href=\"http://www.trc.ca/websites/trcinstitution/File/2015/Findings/Calls_to_Action_English2.pdf\">Truth and Reconciliation Commission of Canada: Calls to Action</a></li></ul></div>\n      "
}