{
  "path": "/en/news/statements/2019/05/18/statement-prime-minister-10th-anniversary-end-armed-conflict-sri-lanka",
  "pageTitle": "Statement by the Prime Minister on the 10th anniversary of the end of the armed conflict in Sri Lanka | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the end of the armed conflict in Sri Lanka:</p>\n\n<p>“Today marks the 10th anniversary of the end of the armed conflict in Sri Lanka. Over 26 years of war, including during the last phase of the war in Mullivaikal in 2009, tens of thousands of people were killed and hundreds of thousands more displaced and disappeared, leaving lasting wounds in communities across the country.</p>\n\n<p>“Over the past decade, I have met many Tamil-Canadians personally affected by the war. Their stories – of incalculable loss, tremendous adversity, and continued resilience – serve as a stark reminder of the long road ahead to peace and reconciliation.</p>\n\n<p>“I reiterate my call to the Government of Sri Lanka to fulfill its international and domestic commitments to establish a meaningful accountability process that has the trust and confidence of the survivors. Canada continues to offer its full support to the Government of Sri Lanka and all those working toward accountability, justice, peace, and reconciliation on the island.</p>\n\n<p>“On behalf of the Government of Canada, I extend my deepest sympathies to Tamil-Canadians, and to all those who suffered and lost loved ones during the war. We also pause to remember the many people in Sri Lanka and around the world affected by the devastating terrorist attacks on hotels and churches on Easter Sunday. We will always stand against such acts of hate, and work to make sure everyone can practice their faith in freedom.</p>\n\n<p>“Today, I invite all Canadians to recognize the many contributions that Tamil-Canadians have made to our country and the adversity they have overcome.”</p></div>\n      "
}