{
  "path": "/en/news/news-releases/2023/03/03/10-day-child-care-soon-reality-families-manitoba",
  "pageTitle": "$10-a-day child care soon a reality for families in Manitoba | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Families across Canada know that affordable child care is not a luxury ‒ it is a necessity. With global inflation driving up the cost of living and making it harder for families to make ends meet, the Government of Canada has been working with provinces and territories to deliver on our promise of $10-a-day child care – putting more money back in the pockets of Canadian families, driving economic growth that benefits everyone, and giving children the best possible start in life.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Manitoba, Heather Stefanson, today announced that Manitoba will achieve an average of $10-a-day regulated child care on April 2, 2023 – three years ahead of the national target. This milestone achievement could save families hundreds of dollars per child, per month on average.</p>\n\n<p>This announcement comes less than two years after the governments of Canada and Manitoba reached an agreement to support an average of $10-a-day regulated child care in the province. Already, families in nearly half of Canada’s provinces and territories are benefitting from regulated early learning and child care at an average of $10-a-day or less, and fees have been cut by at least 50 per cent in all other jurisdictions, with work on track to deliver $10-a-day child care on average by March&nbsp;2026.</p>\n\n<p>Delivering $10-a-day child care across the country is a key part of the federal government’s plan to make life more affordable for Canadians. It builds on a wide range of other support programs, including the Canada Child Benefit, which puts more money into the pockets of nine out of 10 Canadian families with children and has helped lift hundreds of thousands of children out of poverty. We will continue to put Canadian families at the heart of everything we do, as we make life more affordable, create good jobs, and grow the economy to benefit all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Reaching $10-a-day child care on average is a huge milestone achievement for families in Manitoba. It means hundreds of dollars per child back in the pockets of hard-working families every month, it means more jobs in early learning and child care, it means a stronger economy for Manitoba, and it means we’re giving every child the best possible start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“By working together, Canada and Manitoba have achieved our shared goal of affordable child care. We will continue to work together to achieve other important targets, such as space creation and support to early childhood educators, to ensure that every family has access to high-quality, affordable, flexible, and inclusive child care.”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government recognizes that in order for Manitobans to be able to participate in the workforce, upgrade their skills and training, support their families, and play an active role in the growth of our communities and economy, access to affordable and high-quality child care is essential. Our government is proud to work in partnership with Canada to strengthen and grow Manitoba’s early learning and child care system in all communities of our province. Today, we are proud to announce that with the significant initiatives we have implemented over the past few years to lower parent fees and build capacity in the system, Manitoba is going above and beyond our commitment by maxing all parent fees to $10 a day for children 12 and under for regular hours of care, and we are achieving this historic goal three years ahead of schedule.”</p>\n\n<footer class=\"default\">The Hon. Heather Stefanson, Premier of Manitoba</footer>\n</blockquote>\n\n<blockquote>\n<p>“Manitoba has been working diligently to strengthen the continuum of child care services available for Manitoba families to improve access to high-quality, affordable, inclusive child care. We expanded the child care subsidy to prioritize families most in need; we provided new, ongoing operating grants to support the creation of over 3,100 affordable child care spaces; and we implemented a wage grid to support the dedicated staff working in the early learning and child care sector. Our government is pleased to work collaboratively with our federal partners to deliver on this important initiative to provide accessible, affordable child care to Manitoba families.”</p>\n\n<footer class=\"default\">The Hon. Wayne Ewasko, Manitoba’s Minister of Education and Early Childhood Learning</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In August 2021, Canada and Manitoba announced an <a href=\"https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories/manitoba-canada-wide-2021.html\">agreement</a> to significantly improve early learning and child care for all children in the province, with the Government of Canada contributing approximately $1.2&nbsp;billion for the early learning and child care sector in Manitoba over five years.</li>\n\t<li>Additionally, nearly $98&nbsp;million was announced in February 2022 through the <a href=\"https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories/manitoba-2021.html\">Canada-Manitoba Early Learning and Child Care Agreement&nbsp;- 2021 to 2025</a>, including a one-time investment of nearly $19.2&nbsp;million to support the early childhood workforce.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada already helped create more than 730 affordable child care spaces in Manitoba – and over 40,000 across the country – prior to the pandemic.</li>\n\t<li>With support from federal funding, Manitoba aims to create 23,000 new child care spaces as part of the Canada-wide system by 2026, to improve access to affordable child care for families. More than 3,300 of these spaces have been announced to date.</li>\n\t<li>As part of Budget&nbsp;2021, the Government of Canada made a transformative investment of more than $27&nbsp;billion over five years to build a Canada-wide early learning and child care system with provinces and territories. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Delivering a high-quality, inclusive, and affordable Canada-wide early learning and child care system is good for families and the economy. TD Economics has pointed to a range of studies that have shown that for every dollar spent on early childhood education, the broader economy receives between $1.50 and $2.80 in return. And in Quebec, affordable child care alone has raised the province’s GDP by 1.7 per cent.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Budget&nbsp;2021: A Canada-wide Early Learning and Child Care Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/campaigns/child-care.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_Canada.ca/child-care\">Toward $10-a-Day: Early Learning and Child Care</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">$10 a day child care for families in Manitoba</a></li>\n</ul></div>\n      "
}