{
  "path": "/en/news/itineraries/2015/11/10/public-event-november-11-2015",
  "pageTitle": "Public event for November 11, 2015 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Public event for the Prime Minister, Justin Trudeau, for Wednesday, November 11, 2015:</p>\n<p><strong>Ottawa</strong></p>\n<p>11:00 a.m.</p>\n<p>The Prime Minister and Ms. Sophie Grégoire-Trudeau will participate in the National Remembrance Day Ceremony.</p>\n<p>They will be joined by: Their Excellencies the Right Honourable David Johnston, Governor General of Canada, and Mrs. Sharon Johnston; the Honourable Leo Housakos, Speaker of the Senate of Canada; the Honourable Stéphane Dion, Minister of Foreign Affairs; the Honourable Kent Hehr, Minister of Veterans Affairs and Associate Minister of National Defence; the Honourable Harjit Singh Sajjan, Minister of National Defence; General Jonathan Vance, Chief of the Defence Staff, Canadian Armed Forces; Mr. Tom Eagles, Dominion President, The Royal Canadian Legion; Mr. Brad White, Dominion Secretary, The Royal Canadian Legion; and Mrs. Sheila Anderson, 2015 National Memorial (Silver) Cross Mother.</p>\n<p>National War Memorial<br>Elgin Street<br>Ottawa, Ontario</p>\n<p><strong>Notes for media:</strong></p>\n<ul>\n<li>Photo opportunity only (cameras and photographers only)</li>\n<li>Media covering the Prime Minister are asked to arrive at 10:15 a.m.</li>\n<li>Media must be accredited through the Parliamentary Press Gallery</li>\n</ul>\n<p><strong>Ottawa</strong></p>\n<p>1:30 p.m.</p>\n<p>The Prime Minister will visit the Hindu Temple of Ottawa-Carleton.<br>4835 Bank Street</p>\n<p><strong>Notes for media:<br></strong>Photo opportunity only</p>\n<p><strong>Ottawa</strong></p>\n<p>2:45 p.m.</p>\n<p>The Prime Minister will visit the Gurdwara Sahib Ottawa Sikh Society.<br>26 Gurdwara Road</p>\n<p><strong>Notes for media:</strong></p>\n<p>Photo opportunity only<br>PMO Media Relations: 613-957-5555</p></div>\n      "
}