{
  "path": "/en/news/statements/2022/06/24/statement-prime-minister-saint-jean-baptiste-day",
  "pageTitle": "Statement by the Prime Minister on Saint-Jean-Baptiste Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Saint-Jean-Baptiste Day:</p>\n\n<p>“Today, on Saint-Jean-Baptiste Day, we join Francophone communities across Canada to celebrate our rich heritage, our unique cultures and identities, and our beautiful French language.</p>\n\n<p>“Each year, from coast to coast to coast, the Canadian Francophonie celebrates Saint-Jean-Baptiste Day with family and friends. Throughout the centuries, Francophones have stood together. This year, we can finally get together again to attend performances and community events, and celebrate our history, our pride, and our contributions to our country.</p>\n\n<p>“The French language is a source of pride for Canada. It continues to play a vital role in our country and to shape our identities, our cultures, and our future – and we will continue to protect it to achieve substantive equality between our two official languages. That is why, this past March, we introduced an improved <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/canadians-official-languages-act.html\">bill</a> to modernize the <em>Official Languages Act</em>, recognize the minority situation of French in Canada, and strengthen and promote institutions in official language minority communities. This year, to enhance the vitality of Francophone minority communities, we also provided funding to Hearst University and to Collège La Cité in Ottawa, to increase students’ access to education in French.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our best wishes to Francophones and to everyone celebrating Saint-Jean-Baptiste Day in Canada. This year, I encourage you to learn more about Saint-Jean-Baptiste Day, <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada/saint-jean-baptiste-day.html\">take part in an activity</a>, regardless of where you are in the country, and share your experiences on social media using the hashtag #SaintJeanBaptiste. Together, we will continue to build a stronger, more prosperous, and more inclusive country.”</p></div>\n      "
}