{
  "path": "/en/news/statements/2022/11/11/statement-prime-minister-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Remembrance Day:</p>\n\n<p>“Every year on November 11, we come together to honour the brave women and men in uniform who uphold our values here at home and around the world. The values that unite us as Canadians – values of peace, freedom, and democracy.</p>\n\n<p>“In hockey arenas, school gymnasiums, city centres, and retirement homes in every community across the country, we vow to never forget the sacrifices members of the Canadian Armed Forces and our Veterans have made for us. We wear red poppies over our hearts to remember those who have made the ultimate sacrifice – a tradition inspired by Canadian Lieutenant-Colonel and surgeon John&nbsp;McCrae’s poem ‘In Flanders Fields’ – and we pay tribute to their family members and loved ones.</p>\n\n<p>“‘The torch; be yours to hold it high,’ wrote Dr. McCrae during the First World War. From fighting alongside our allies in the First and Second World Wars, to today providing essential emergency response support to Canadians impacted by severe weather events and training the Ukrainian military as they defend their country, generation after generation, Canadians have answered the call to serve. Our service members have worn the maple leaf with honour as they represent the best of what it means to be Canadian.</p>\n\n<p>\"Today, we pay tribute to Canadian service members, past and present, for all they have done to keep us safe. At the eleventh hour of the eleventh day of the eleventh month, we observe two minutes of silence for the brave women and men who gave their lives in service of a better Canada – we are forever in their debt.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}