{
  "path": "/en/news/statements/2017/10/18/statement-prime-minister-canada-death-gord-downie",
  "pageTitle": "Statement by the Prime Minister of Canada on the death of Gord Downie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Gord Downie:</p><p>“For almost five decades, Gord Downie uncovered and told the stories of Canada. He was the frontman of one of Canada’s most iconic bands, a rock star, artist, and poet whose evocative lyrics came to define a country.</p><p>“The Tragically Hip’s music invited us to explore places we had never been – from Mistaken Point to Churchill – and helped us understand each other, while capturing the complexity and vastness of the place we call home.</p><p>“Gord’s command of language was profound. He painted landscapes with his words, elevating Canadian geography, historical figures, and myths. When he spoke, he gave us goosebumps and made us proud to be Canadian. Our identity and culture are richer because of his music, which was always raw and honest – like Gord himself.</p><p>“In the wake of his diagnosis, Gord only fought harder for what he believed in: social justice, environmentalism, and reconciliation with Indigenous Peoples. Before passing, he shined his light on the story of 12-year-old Chanie Wenjack who died from hunger and exposure after trying to find his way home from a residential school. For his work raising awareness of Indigenous issues, he was inducted as a member of the Order of Canada in 2017.</p><p>“Gord did not rest from working for the issues he cared about, and his commitment and passion will continue to motivate Canadians for years to come.</p><p>“On behalf of all Canadians, Sophie and I offer our deepest condolences to Gord’s family, friends, bandmates and crew members, and his many, many fans. He will be sorely missed.”</p></div>\n      "
}