{
  "path": "/en/news/news-releases/2021/07/09/new-public-transit-investment-create-jobs-grow-economy-and-build-back",
  "pageTitle": "New public transit investment to create jobs, grow the economy, and build back stronger communities in British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in public transit infrastructure strengthens communities, reduces commute times for Canadians, helps connect people to affordable housing, and helps fight climate change. That is why the Government of Canada is making smart investments in public transit that will create and support good middle class jobs, and help us build back for a cleaner, better future.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $1.3 billion in federal funding toward the Surrey Langley SkyTrain extension project. The Province of British Columbia and its partners will fund the remainder of the costs for the project.</p>\n\n<p>The Surrey Langley SkyTrain extension project will support an area with a fast-growing population representing 25 per cent of the population of Metro Vancouver, help improve public transit accessibility for residents and businesses south of the Fraser River, connect more people to housing, employment, and schools, and encourage greater development around SkyTrain stations. The project will also create approximately 3,000 full-time, well-paying middle class jobs.</p>\n\n<p>The Surrey Langley extension will connect growing Surrey neighbourhoods, the Township of Langley, and the City of Langley to Surrey Centre and the regional SkyTrain network. The project includes 16 kilometres on an elevated guideway from King George SkyTrain Station to Langley City Centre along Fraser Highway. It also includes eight stations, three bus exchanges, park and ride spaces, 30 SkyTrain cars, an operations and maintenance centre, and supporting system upgrades. This new transit route will provide residents with an average commute time of 22 minutes, which is more than 25&nbsp;minutes faster than the current bus route. The proposed extension is projected to serve 62,000 daily riders in 2035 and grow to 71,200 riders in 2050. Approximately 24,000 to 30,000 of these riders are expected to switch to transit from other modes of transportation.</p>\n\n<p>The Prime Minister also announced that the Government of Canada is committed to funding up to 40 per cent of eligible costs toward future planning and business case development for a proposed extension of the Millennium Line from Arbutus Station to the University of British Columbia (UBC). This project will better connect students, employees, and residents who travel between UBC and other parts of Metro Vancouver with a high speed and frequent SkyTrain service, reducing travel time between Commercial-Broadway and UBC for riders by more than 20 minutes per trip. As one of the largest employers in the region with world-class health services and an emerging innovation and research hub, UBC will require fast, frequent transit service to meet the needs of students, faculty, and staff who travel there each day from across the region. <a name=\"_heading=h.gjdgxs\" id=\"_heading=h.gjdgxs\"></a></p>\n\n<p>Reliable, modern public transit is the foundation of strong communities where Canadians live, work, and play. It creates jobs, cuts pollution, and builds a strong middle class. That is why, since 2015, the Government of Canada has invested over $4.3&nbsp;billion in more than 550 infrastructure projects across British Columbia under the Investing in Canada Plan, and will continue to invest in the future of our communities from coast to coast to coast.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“By continuing to invest in major public transit projects, we’re shortening commutes, creating well-paying, middle class jobs, growing the economy, fighting climate change, and helping make life easier and more affordable for people in British Columbia and across Canada. As we do what it takes to build a recovery from COVID‑19 that works for everyone, we will keep focusing on improving the quality of life of Canadians and building back a healthier, stronger, and more competitive Canada.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Investing in public transit is at the heart of a clean and inclusive recovery. That’s why the Government of Canada is funding up to $1.3 billion for the Surrey Langley SkyTrain extension to Langley City Centre, which will reduce commute times by 25 minutes while helping residents get around in cleaner and more affordable ways. We’re also providing up to 40 per cent of the eligible planning costs to extend the Millennium Line to the UBC campus from Arbutus Station, improving access for students, workers, and Indigenous-owned developments and communities. These important projects will help get more cars off the road, create good jobs and grow the economy, and build more inclusive communities.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Whether people are commuting to work, going to school, or safely coming back together with family and friends, it’s critical that we provide the better, faster transit options that British Columbians deserve. We’re pleased to be making record investments in infrastructure, creating thousands of jobs, and this partnership with the federal government will help keep people moving while we build a strong recovery that benefits everyone.”</p>\n\n<footer class=\"default\">The Hon. John Horgan, Premier of British Columbia</footer>\n</blockquote>\n\n<blockquote>\n<p>“Investment in our infrastructure has never been more important as we work together to recover from COVID-19. The populations of Surrey, Langley, and other Fraser Valley communities are growing quickly, and we must build infrastructure to meet the needs of those families. We thank the Government of Canada for joining the Province on our commitment to Surrey Langley SkyTrain and we are excited to move forward on this important transportation project which will serve people for years to come.”</p>\n\n<footer class=\"default\">The Hon. Rob Fleming, British Columbia’s Minister of Transportation and Infrastructure</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is a tremendous day for Surrey. As one of the fastest growing cities in Canada, the new Surrey Langley SkyTrain has a built-in ridership. Fast and reliable rapid transit translates into fewer cars on the road. The Metro Region will benefit as Surrey Langley SkyTrain expands and connects the SkyTrain network into more communities. This major public transit infrastructure project will immediately create a large number of solid, well-paying middle class jobs and that’s good for our economy. I would like to thank the Government of Canada and the Government of B.C. for their support for this much-needed project.&nbsp;Surrey’s turn for new rapid transit has arrived.”</p>\n\n<footer class=\"default\">Doug McCallum, Mayor of Surrey</footer>\n</blockquote>\n\n<blockquote>\n<p>\"It has been 30 years since the last fixed rapid transit investment in the south of the Fraser communities of Metro Vancouver. With the announcement of the Surrey Langley SkyTrain project, Langley City will not only be a designated Regional City Centre but a regional hub and a true transit-oriented downtown. The City of Langley is looking forward to working with the federal and provincial governments, as well as TransLink, to construct this critical regional priority project. On behalf of Langley City Council, we would like to acknowledge and thank them for their hard work and commitment.\"</p>\n\n<footer class=\"default\">Val van den Broek, Mayor of the City of Langley</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada is contributing 40 per cent of eligible costs toward the Surrey Langley SkyTrain extension project, up to $1.3 billion. The Government of British Columbia and other partners are funding the remaining project costs of up to $2.54&nbsp;billion.</li>\n\t<li>The Government of British Columbia has committed to taking over the ownership and delivery of Surrey Langley SkyTrain extension project and completing the project out to Langley. Once the new line is built, TransLink will operate the extension as part of the integrated SkyTrain network.</li>\n\t<li>Federal funding toward both projects is subject to the necessary federal due diligence and approvals process.</li>\n\t<li>Canada’s&nbsp;<a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/12/a-healthy-environment-and-a-healthy-economy.html\">strengthened climate plan</a>&nbsp;committed to provide public transit funding. The plan encourages cleaner modes of transportation, such as low and zero-emission vehicles, transit, and active transportation, to make communities healthier, less congested, and more vibrant.</li>\n\t<li>Through the Investing in Canada Plan, the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li>\n\t<li>Through the Investing in Canada Plan, the Government of Canada is already investing $28.7 billion to support public transit projects, including $5 billion available for investment through the Canada Infrastructure Bank.</li>\n\t<li>In February 2021, the Government of Canada also announced a plan for $14.9&nbsp;billion in new public transit funding over eight years, including $2.5 billion over five years starting this year as well as a portion of the $3 billion in ongoing annual transit funding beginning in 2026-27, to expand transit systems in large urban centres by enabling major transit projects to advance. The plan will also accelerate job-creating projects across the country, support active transit, and electrify our transit systems.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/10/new-public-transit-investments-build-strong-communities-fight-climate\">New public transit investments to build strong communities, fight climate change, and create new jobs across Canada</a></li>\n\t<li><a href=\"https://www.surreylangleyskytrain.ca/\">Surrey Langley SkyTrain</a></li>\n\t<li><a href=\"https://www.translink.ca/plans-and-projects/projects/rapid-transit-projects/millennium-line-ubc-extension\">Millenium Line UBC Extension</a></li>\n</ul></div>\n      "
}