{
  "path": "/en/news/news-releases/2017/07/01/prime-minister-marks-successful-royal-tour-canada",
  "pageTitle": "Prime Minister marks successful Royal Tour to Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today marked the end of the successful three-day Royal Tour to Canada by Their Royal Highnesses The Prince of Wales and The Duchess of Cornwall, and announced the Government of Canada’s official gift.</p><p>The Royal Tour began with a visit to Iqaluit, Nunavut, and then proceeded to Canadian Forces Base Trenton and the village of Wellington, Ontario. From there, Their Royal Highnesses visited Gatineau, Quebec, where they opened the Canadian History Hall at the Canadian Museum of History, and Ottawa, where they took part in celebrations of the 150<sup>th</sup> anniversary of Confederation on ParliamentHill<b><i>. </i></b></p><p>As part of a longstanding tradition, the Government of Canada marked the Royal Tour by offering a donation of $45,000 to three organizations visited by Their Royal Highnesses. The Iqaluit Food Centre, the Iqaluit Community Tukisigiarvik Society, and the Tumikuluit Saipaaqivik (Sweet Little Footprints Daycare) will each receive an official gift of $15,000, which will help them continue to make a difference in the lives of people throughout Canada’s North.</p><h2>Quote</h2><blockquote><p>“As we celebrate the 150<sup>th</sup> anniversary of Confederation, it has been a pleasure and a privilege to welcome Their Royal Highnesses The Prince of Wales and The Duchess of Cornwall. During the Royal Tour, Their Royal Highnesses met with many people, including members of Indigenous communities and of the Canadian Armed Forces, and those involved in charitable work in Canada’s North. They saw firsthand the beauty, warmth, and diversity that make Canada such a wonderful place to live and visit.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is the 18<sup>th</sup> visit to Canada for The Prince of Wales and the 4<sup>th</sup> for The Duchess of Cornwall. Their Royal Highnesses’ most recent trip to Canada was in May 2014, when they toured Nova Scotia, Prince Edward Island, and Manitoba.</li><li>The Prince of Wales is patron or president of more than 400 organizations around the world, including <a href=\"http://canada.pch.gc.ca/eng/1445001063717\">Canadian organizations</a> that reflect the Prince’s diverse interests, ranging from education to organic agriculture and architecture.</li><li>The Iqaluit Food Centre, an emergency meal service, provides over 100 healthy meals daily to community members who experience hunger, or lack access to food that is affordable, nutritious, and culturally relevant.</li><li>The Iqaluit Community Tukisigiarvik Society offers practical support and assistance to Iqalummiut individuals and families with personal and family issues, including health, education, and employment.</li><li>The Tumikuluit Saipaaqivik (Sweet Little Footprints Daycare) was created through a joint effort by a group of mothers who wanted a daycare that would operate solely using the Inuit language, culture, and worldview. It is the first Inuktitut-only daycare in Iqaluit.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1490105439791\">2017 Royal Tour of Canada by Their Royal Highnesses The Prince of Wales and The Duchess of Cornwall</a></li><li><a href=\"http://canada.pch.gc.ca/eng/1468262573081\">Canada 150</a></li><li><a href=\"http://canada.pch.gc.ca/eng/1445001961355\">Past Royal Tours</a></li></ul></div>\n      "
}