{
  "path": "/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement",
  "pageTitle": "More support for Canadians through the Safe Restart Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we gradually restart the economy and take the initial steps to recover from the impacts of COVID-19, the Government of Canada continues to work with the provinces and territories to ensure Canadians stay safe and healthy, and have the support they need in these challenging times.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a federal investment of more than $19 billion to help provinces and territories safely restart their economies and make our country more resilient to possible future waves of the virus.</p>\n\n<p>This investment, through the Safe Restart Agreement, will help address the key priorities, agreed upon by Canada’s First Ministers, for the safe restart of Canada’s economy over the next six to eight months. It will support measures to increase testing and contact tracing of the virus to protect Canadians from a future outbreak, and support the capacity of our health care systems, including services for people facing mental health challenges. It will also assist with the procurement of personal protective equipment to help our essential workers, and in protecting the most vulnerable, like our seniors.</p>\n\n<p>The agreement will also help get funding quickly to municipalities so they can deliver essential services that Canadians rely on every day, like public transit. In addition, it includes actions to help Canadian workers during this challenging time, such as ensuring the availability of safe child care to help parents returning to work, and providing income support for people who do not have paid sick leave so all Canadians can stay healthy.</p>\n\n<p>During this time of uncertainty, the Government of Canada is putting Canadians first by working together with our provincial and territorial partners to lay the groundwork to keep our communities strong and healthy, and ensure our economy is resilient.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With Canadians doing their part and following public health guidelines, we are able to gradually and safely restart our economy. As we continue to deal with the impacts of the virus, we are committed to working with the provinces and territories to provide the support they need to help Canadians make it through this crisis. Together, our priority is to keep Canadians safe and healthy, while building a stronger, more resilient Canada for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The investments announced today will help ensure a safe restart of our economy over the next six to eight months. Since the beginning of the pandemic, we have worked collaboratively with provinces and territories to keep Canadians safe and support the economy, and that is exactly what we will continue to do through a Team Canada approach.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>New federal funding will address seven priority areas:\n\t<ul>\n\t\t<li>enhanced capacity for testing, contact tracing, and data management and information sharing to mitigate future outbreaks.</li>\n\t\t<li>investments in health care to respond to the pandemic, including support for Canadians experiencing challenges with substance use, mental health, or homelessness.</li>\n\t\t<li>support for vulnerable Canadians – including those in long-term care, home care, and palliative care – who are at risk of more severe cases of COVID-19.</li>\n\t\t<li>funding to secure a reliable source of personal protective equipment, and to recover some of the costs from previous investments made by provincial and territorial governments.</li>\n\t\t<li>support to ensure that safe and sufficient child care spaces are available to support parents’ gradual return to work.</li>\n\t\t<li>joint funding with the provinces and territories to support municipalities on the front lines of restarting the economy, including by putting in place precautions for public spaces and essential services to reduce the spread of the virus, as well as a dedicated stream of funding for public transit.</li>\n\t\t<li>a temporary income support program that will provide workers who do not have paid sick leave with access to 10 days of paid sick leave related to COVID-19.</li>\n\t</ul>\n\t</li>\n\t<li>To access the funding, each province and territory will need to outline how they will invest these funds.</li>\n\t<li>New federal investments for the safe restart of our economy are in addition to previous funding provided to provinces and territories and Canadians, as we deal with the impacts of COVID-19. This includes:\n\t<ul>\n\t\t<li>The Canada Emergency Response Benefit, which has helped more than 8 million Canadians pay their bills and put food on the table during the pandemic.</li>\n\t\t<li>The Canada Emergency Wage Subsidy, which has kept about 3 million Canadians on the payroll.</li>\n\t\t<li>$500 million to the provinces and territories for <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">critical health care system needs and support for mitigation efforts</a>, including access to testing, acquisition of equipment, and enhanced surveillance and monitoring.</li>\n\t\t<li>Over $129 million to <a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/14/prime-minister-announces-health-and-social-support-northern\">address health, economic, and transportation needs in the North</a>.</li>\n\t\t<li>Support to implement the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories\">Canada Emergency Commercial Rent Assistance for small businesses</a>, which has helped over 29,000 small businesses lower rent by 75 per cent.</li>\n\t\t<li>Up to $3 billion to help provinces and territories <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/07/prime-minister-announces-agreements-boost-wages-essential-workers\">increase wages of low-income essential workers</a>.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/05/supporting-canadas-farmers-food-businesses-and-food-supply\">Investments in AgriRecovery and AgriStability programs</a> to support farmers and producers.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/07/16/priorities-safely-restart-canadas-economy\">Priorities to safely restart Canada’s economy</a></li>\n\t<li><a href=\"/en/news/statements/2020/07/16/joint-communique-safe-restart-agreement\">Joint Communiqué – Safe Restart Agreement</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/28/prime-minister-releases-joint-statement-first-ministers-restarting\">Prime Minister releases joint statement by First Ministers for restarting the economy</a></li>\n</ul></div>\n      "
}