{
  "path": "/en/news/readouts/2022/04/08/prime-minister-justin-trudeau-speaks-his-highness-prime-minister-sheikh",
  "pageTitle": "Prime Minister Justin Trudeau speaks with His Highness Prime Minister Sheikh Sabah Khalid Al-Hamad Al-Sabah of Kuwait | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with His Highness Prime Minister Sheikh Sabah Khalid Al-Hamad Al-Sabah of Kuwait.</p>\n\n<p>The Prime Ministers discussed the urgent humanitarian crisis in Ukraine and the importance of an immediate cease-fire. They agreed on the need to work together to provide humanitarian assistance to those impacted by Russia’s invasion of Ukraine. Prime Minister Trudeau invited Kuwait to participate in the “Stand Up For Ukraine” campaign pledging event on April 9, which he is convening with the President of the European Commission, Ursula von der Leyen, in order to raise funds for Ukrainian refugees and internally displaced people.</p>\n\n<p>The two leaders noted the close relationship between Canada and Kuwait, reflected in the recent visit by the Governor General of Canada to Kuwait on March 22 and 23. Prime Minister Trudeau reiterated Canada’s appreciation for Kuwait hosting the Canadian Armed Forces at Ali Al Salem Air Base, and thanked Prime Minister Al-Sabah for Kuwait’s support in helping Canada evacuate over 3,700 Canadians and Afghans from Afghanistan last August.</p>\n\n<p>The Prime Ministers agreed to continue cooperating in response to the humanitarian crisis in Ukraine and the war’s impact on global food security and energy supplies.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/kuwait-koweit/bilateral_relations_bilaterales/canada-kuwait.aspx?lang=eng\">Canada-Kuwait relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/14/governor-general-travel-middle-east\">Governor General to travel to the Middle East</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/26/stand-ukraine-european-commission-and-government-canada-team-global\">Stand Up For Ukraine: European Commission and Government of Canada team up with Global Citizen to mobilize support for refugees</a></li>\n</ul></div>\n      "
}