{
  "path": "/en/news/news-releases/2017/04/13/italian-prime-minister-paolo-gentiloni-visit-canada",
  "pageTitle": "Italian Prime Minister Paolo Gentiloni to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that Paolo Gentiloni, Prime Minister of the Italian Republic, will visit Canada on April 20 and 21, 2017.</p><p>During the visit, Prime Minister Gentiloni will meet with Prime Minister Trudeau to deepen the close bonds between our two countries, as well as to discuss the G7 Leaders’ Summit, commercial opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), and other international issues.</p><h2>Quote</h2><blockquote><p>“Canada and Italy are close allies and friends, and enjoy a strong trade and investment partnership. This relationship is reinforced by the dynamic Italian-Canadian community of about one and a half million people. I look forward to meeting with Prime Minister Gentiloni to discuss our respective priorities for this year’s G7 Summit, and how CETA will create good, well-paying middle class jobs on both sides of the Atlantic.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Italy have a strong commercial relationship.&nbsp;In 2016, Canadian exports to Italy were valued at about $2.3 billion and Italian imports to Canada amounted to $7.5 billion. In 2015, Italian foreign direct investment in Canada was valued at close to $1.6 billion and Canadian direct investment in Italy was valued at $539 million.</li><li>Canada and Italy enjoy particularly strong and historic people-to-people ties. Canada’s large and dynamic Italian-Canadian community, numbering close to 1.5 million, is particularly interested and engaged in all aspects –cultural, social, economic and political – of our bilateral relations.</li><li>Canada and Italy have a strong and longstanding academic relationship, reinforced by inter-university and private-public academic agreements that generate new ideas and research projects, build relationships, and encourage youth mobility.</li><li>Italy will host the 43<sup>rd</sup> G7 Leaders’ Summit on May 26–27, 2017, in Taormina.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;menu_id=8\">Canada-Italy Relations</a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li></ul></div>\n      "
}