{
  "path": "/en/news/readouts/2021/12/02/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy<strong>, </strong>to mark the 30th anniversary of the recognition of Ukraine’s independence by Canada and discuss current global issues.</p>\n\n<p>Prime Minister Trudeau congratulated President Zelenskyy on Ukraine’s 30th anniversary of independence, welcomed the progress made by Ukrainians over the past three decades, and celebrated the deep ties between the Ukrainian and Canadian peoples.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy discussed the current buildup of Russian military forces in and around Ukraine, as well as Russia’s ongoing aggression and destabilization activities. Prime Minister Trudeau expressed the imperative for Russia to de-escalate the situation, and reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine. He emphasized the coordination underway between Ukraine’s partners in order to stand united in the face of Russian provocation.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for the Canadian military training mission in Ukraine, Operation UNIFIER, and the two leaders discussed the future of Canadian support.</p>\n\n<p>The Prime Minister and President discussed the downing of Ukraine International Airlines Flight&nbsp;752 and their commitment to continuing to pursue justice from Iran for the victims of this tragedy.</p>\n\n<p>The two leaders also discussed the COVID-19 situation in Canada and Ukraine, and exchanged views on ways to increase vaccination rates and effectively counter vaccine disinformation.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy looked forward to continued cooperation between Canada and Ukraine, and to working together on shared priorities, including security, prosperity, and the rules-based international order.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/04/g7-foreign-ministers-statement-on-ukraine.html\">G7 foreign ministers’ statement on Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/flight-vol-ps752.aspx?lang=eng\">Canada’s response to Ukraine International Airlines Flight&nbsp;752 tragedy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/06/24/canadian-report-blames-iranian-recklessness-shoot-down-ukraine\">Canadian report blames Iranian recklessness for shoot-down of Ukraine International Airlines Flight&nbsp;752</a></li>\n</ul></div>\n      "
}