{
  "path": "/en/news/statements/2022/10/22/statement-prime-minister-eighth-anniversary-attack-national-war-memorial",
  "pageTitle": "Statement by the Prime Minister on the eighth anniversary of the attack at the National War Memorial and Parliament Hill | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the eighth anniversary of the attack at the National War Memorial and Parliament Hill:</p>\n\n<p>“Eight years ago today, Canadians were shocked by a tragic terrorist attack at the National War Memorial and Parliament Hill in Ottawa that took one life and injured several others.</p>\n\n<p>“On this solemn anniversary, I join Canadians across the country in paying tribute to Corporal Nathan Cirillo, a sentry guarding the Tomb of the Unknown Soldier, and to Warrant Officer Patrice Vincent, who was killed two days earlier in a separate attack in Saint-Jean-sur-Richelieu, Quebec. Our thoughts are with their families, friends, and former colleagues, as well as all those affected by these attacks.</p>\n\n<p>“Today, we remember the selflessness and compassion of bystanders and members of our parliamentary family who acted without hesitation to protect us, and we salute the first responders who put themselves in harm’s way to ensure their safety.</p>\n\n<p>“The National War Memorial was built to commemorate the response of Canadians in times of war. It has since become a symbol of the sacrifice of all our military personnel who have lost their lives in the line of duty. Parliament Hill symbolizes the values that define us as Canadians: freedom, peace, and inclusion. We will always stand up against violence and terrorism to ensure these values are protected.</p>\n\n<p>“As we pay tribute to these two fallen members of our Canadian Armed Forces today, I encourage everyone to show gratitude to all Canadians in uniform – past and present – for their selfless commitment to our country.”</p>\n\n<p>&nbsp;</p></div>\n      "
}