{
  "path": "/en/news/news-releases/2019/08/17/prime-minister-attend-g7-summit-france",
  "pageTitle": "Prime Minister to attend G7 Summit in France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Biarritz, France, to attend the G7 Leaders’ Summit from August&nbsp;24 to&nbsp;26.</p>\n\n<p>The Summit is an important opportunity to take concerted action on some of our world’s most pressing challenges, including making sure more people benefit from our rapidly changing economy.</p>\n\n<p>Under France’s leadership, this year’s Summit will focus on reducing inequality, and will build on key themes from Canada’s G7 presidency last year, including growing economies that work for everyone, advancing gender equality, combatting the climate crisis, and defending the rules-based international order. In particular, France has continued the G7 Gender Equality Advisory Council, launched under Canada’s presidency.</p>\n\n<p>At the Summit, the Prime Minister will continue to champion these issues, and underscore the need to create new opportunities for the middle class in order to restore people’s confidence in the future.</p>\n\n<p>In addition, he will promote open trade and investment, call for stronger and more decisive action to combat violent extremism in all its forms, including online, and underline the need to take decisive, collective action to combat the climate crisis and protect our world’s oceans.</p>\n\n<p>France has also invited leaders beyond the G7 to attend portions of the Summit. During these meetings, Prime Minister Trudeau will exchange with African leaders on ways to combat global inequality, encourage stability, and promote development across Africa, in particular in the Sahel region.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“France and Canada share a deep and lasting friendship. We are close partners, and under France’s leadership, the G7 Summit will be a chance to make further progress on the crucial issues championed by Canada during our G7 Presidency last year. Now more than ever, G7 leaders need to come together to make sure more people can share in a prosperous future. Together, we will take steps to address inequality, grow economies that work for everyone, advance gender equality, combat the climate crisis, and create opportunities for people around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the fourth time Prime Minister Justin Trudeau will attend a G7 Summit.</li>\n\t<li>The Leaders of the G7 have come together each year since the 1970s to discuss issues of domestic and global concern.</li>\n\t<li>The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom and the United States. Presidents of the European Union Commission and Council also attend meetings.</li>\n\t<li>France has invited other countries to join parts of the Summit, including Australia, Burkina Faso, Chile, Egypt, India, Rwanda, Senegal, and South Africa. Several international organizations will also attend.</li>\n\t<li>Canada held the presidency of the G7 last year. France holds the presidency in 2019, and the United States will hold it in 2020.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.elysee.fr/en/g7\">G7 France</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a>&nbsp;</li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li>\n</ul></div>\n      "
}