{
  "path": "/en/news/news-releases/2022/08/29/survivors-flag-raised-parliament-hill-honour-those-impacted",
  "pageTitle": "Survivors’ Flag raised on Parliament Hill to honour those impacted by the residential school system in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, a National Residential School Crisis Line offers emotional support and crisis referral services for residential school Survivors and their families. Call the toll-free Crisis Line at 1-866-925-4419. This service is available 24&nbsp;hours a day, 7&nbsp;days a week. The Hope for Wellness Help Line also offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at&nbsp;</em><a href=\"http://www.hopeforwellness.ca/\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>Residential schools are a shameful part of our history that continue to have a deep and lasting impact on Survivors, their families, and their communities across the country. We cannot forget this truth. As Canadians, we must all learn about the history and legacy of residential schools. Only when we face the hard truths of our past, can we truly move forward together toward a better future.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Executive Director of the National Centre for Truth and Reconciliation (NCTR), Stephanie Scott, the Minister of Crown-Indigenous Relations, Marc Miller, and Survivors from across the country to raise the Survivors’ Flag on Parliament Hill. This flag will fly in memory of the 150,000 Indigenous children who were forcibly separated from their families and communities to be sent to residential schools. It will honour the Survivors, their families, the communities whose lives were forever changed, and those who never came home.</p>\n\n<p>The residential school system in Canada robbed Indigenous children of their childhoods. It attempted to assimilate them, forcing them to abandon their languages, cultures, spiritualities, traditions, and identities. Many suffered physical, emotional, and sexual abuse, and many never returned home. The painful legacy of the residential school system lives on today for Indigenous Peoples from coast to coast to coast.</p>\n\n<p>The orange and white Survivors’ Flag was designed by the NCTR in consultation with Survivors from across Canada as an expression of remembrance and to be shared with all Canadians. It features nine distinct elements, each with a special meaning. For example, the seeds depicted underneath the family and children represent the spirits of the children who never returned home.</p>\n\n<p>We still have work to do. Reconciliation is not the responsibility of Indigenous Peoples – it is the responsibility of all Canadians. It is our responsibility to continue to listen, and to learn. The Government of Canada will continue to do just that and support First Nations, Inuit, and Métis in their healing journey. Together, we will build a better future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Residential schools are a shameful part of our history – that is the truth the Survivors’ Flag is going to remind us of, every day, here on Parliament Hill. By raising this flag here today, we’re saying: we will always remember. We will continue to listen to Survivors. We acknowledge the intergenerational trauma these so-called schools have caused. And we commit to continue working together as partners toward a future of healing and partnership.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Raising the Survivors’ Flag on Parliament Hill is a reflection and sign of deep grieving for the over 150,000 Indigenous children that were forcibly removed from their families and robbed of their culture and language to attend state- and church-run residential schools. Today we honour the survivors, as well as the resiliency of First Nations, Inuit, and Métis peoples. Together we are on a shared journey of reconciliation based on the principles of honesty, equity and self-determination. Raising this flag is a powerful symbol that every child matters and that the Government of Canada will do more to be an honourable partner in the work of reconciliation.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s flag raising represents Canada’s commitment to honouring the lives of those who did not return home from residential schools, and to Survivors, their families and communities, as they continue to search for the truth. The&nbsp;flag will also serve as a prominent focal point to highlight for all of Canada the ongoing search for truth.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Crown-Indigenous Relations</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Survivors created this flag as a symbol of the complicated journey we are on together toward healing. I know the Survivors’ Flag flying on Parliament Hill will serve as a reminder to all of us that we must continue to hear and understand the truth of residential schools. When Canadians witness the flag, they must reflect on actions that they can take as individuals in all capacities on our shared path of reconciliation.”</p>\n\n<footer class=\"default\">Stephanie Scott, Executive Director, National Centre for Truth and Reconciliation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Reconciliation must start with the truth – a truth that I and thousands of Survivors lived through and continue to feel; a truth that was thought to have perished along with the thousands of children who never returned home. Many still don’t know. It is the responsibility of our government, our churches, and our collective peoples to uncover the truth and honour the children.”</p>\n\n<footer class=\"default\">Jimmy Durocher, Métis residential school Survivor</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Survivors’ Flag was developed through consultation and collaboration with Inuit, Mi’kmaq, Atikamekw, Cree, Ojibway, Dakota, Mohawk, Dene, Nuu-chah-nulth, Secwepemc, and Métis Nation Survivors. Each <a href=\"https://nctr.ca/exhibits/survivors-flag/\">element</a> depicted on the flag was carefully selected by Survivors.</li>\n\t<li>The flag will fly near West Block and the Visitor Welcome Centre on Parliament Hill until 2024, when a decision will be made to find its permanent home.</li>\n\t<li>The Survivors’ Flag was first raised on Parliament Hill in 2021, at a special ceremony to mark the inaugural National Day for Truth and Reconciliation.</li>\n\t<li>The NCTR, hosted by the University of Manitoba, was created to preserve the memory of Canada’s residential school system and legacy, not just for a few years, but forever. It is the responsibility of the NCTR to steward and share the truths of Survivors’ experiences in a respectful way and to work with Indigenous and non-Indigenous educators, researchers, communities, decision-makers, and the general public to support the ongoing work of truth, reconciliation, and healing across Canada.</li>\n\t<li>The Government of Canada continues to work with First Nations, Inuit, and Métis to support the difficult and important work of locating and commemorating missing children who attended residential schools.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/07/25/statement-prime-minister-personal-apology-delivered-his-holiness-pope\">Statement by the Prime Minister on the personal apology delivered by His Holiness Pope Francis to Survivors of the residential school system in Canada</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://nctr.ca/exhibits/survivors-flag/\">The Survivors’ Flag</a></li>\n\t<li><a href=\"https://nctr.ca/\">National Centre for Truth and Reconciliation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">National Day for Truth and Reconciliation</a></li>\n\t<li><a href=\"https://rcaanc-cirnac.gc.ca/eng/1622742779529/1628608766235\">Residential schools missing children – community support funding</a></li>\n</ul></div>\n      "
}