{
  "path": "/en/news/readouts/2021/10/25/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier John Horgan to discuss the launch of the CleanBC Roadmap to 2030, a week before the Prime Minister heads to COP26 summit in Glasgow, United Kingdom.</p>\n\n<p>The Prime Minister congratulated Premier Horgan on the launch of British Columbia’s new climate plan, the CleanBC Roadmap to 2030. The Prime Minister noted that he was pleased to see similarities between Canada’s strengthened climate plan and British Columbia’s roadmap. This includes increasing the price on pollution, reducing methane emissions from the oil and gas sector by 75 per cent by 2030, and requiring 100 per cent of light-duty cars and trucks sold to be zero-emissions by 2035.</p>\n\n<p>The Prime Minister indicated that British Columbia continues to be an important ally in the fight against climate change, as Canada works to meet its ambitious target to reduce greenhouse gas emissions to 40-45 per cent below 2005 levels by 2030. The Prime Minister also reiterated that the Government of Canada will be an important partner with the Government of British Columbia to achieve shared goals to create a stronger, more resilient country and economy.</p>\n\n<p>Premier Horgan shared the work British Columbia is doing as one of the subnational bodies attending the COP26 summit, and looked forward to the province showing leadership on the global stage in Glasgow.</p>\n\n<p>The Prime Minister also raised the importance of continuing to work with British Columbia to prepare for future wildfire seasons and to rebuild the Village of Lytton.&nbsp;They also discussed other shared priorities, including health care, and reconciliation with Indigenous peoples.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/25/prime-minister-travel-netherlands-italy-and-united-kingdom\">Prime Minister to travel to the Netherlands, Italy, and the United Kingdom</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan.html\">Canada’s climate plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/un-climate-change-conference.html\">UN climate change conference</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th<sup> </sup>Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n</ul></div>\n      "
}