{
  "path": "/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-meets-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau meets with the President of the United States of America, Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of the United States of America, Joe Biden, to reiterate their commitment to deepening the Canada-U.S. partnership on a wide range of bilateral, regional, and global challenges.</p>\n\n<p>The leaders discussed Putin’s illegal and unjustifiable military aggression against Ukraine, the immense human grief and suffering, and stressed their unwavering commitment to continue supporting the government and people of Ukraine. The leaders agreed to continue their close cooperation on sanctions alignment, and on economic, humanitarian, military, and other forms of assistance, and to continue working with partners and allies to maintain unity in the face of Russia’s disregard for the sovereignty and territorial integrity of Ukraine, and the rules-based international order.</p>\n\n<p>The Prime Minister noted Canada’s commitment to the defence and security of NATO Allies, and of the North American continent. He outlined Canada’s recent defence spending commitments in Budget 2022, and discussed support of North American Aerospace Defense Command (NORAD) modernization.</p>\n\n<p>On the Summit of the Americas, the Prime Minister and the President shared their mutual commitment to the Summit theme of “Building a Sustainable, Resilient, and Equitable Future.” The Prime Minister noted his commitment to supporting inclusive economic growth, pandemic recovery, climate action, the green transition, and democratic resilience in the hemisphere. The Prime Minister expressed his support for President Biden’s Americas Partnership for Economic Prosperity, and looked forward to working together with the President and other hemispheric partners to advance the well-being of people across the hemisphere.</p>\n\n<p>The Prime Minister and President discussed irregular migration and forced displacement, and reiterated their commitment to working together to address the root causes of migration. The Prime Minister expressed his support for the Los Angeles Declaration on Migration and Protection, and his commitment to enhance cooperation with the U.S. and other partners to respond to the current humanitarian, protection, and irregular migration challenges in the region.</p>\n\n<p>The Prime Minister and President discussed the ongoing crisis in Haiti.</p>\n\n<p>The leaders noted the polarizing effects of disinformation, and the grave threat it poses to civil societies, especially in Russia.</p>\n\n<p>The Prime Minister and President discussed their mutual commitment to enhancing collaboration on regional security and good governance in the Indo-Pacific region, and with regards to their respective relationships with China. They recognized Canada’s recent announcement that it intends to implement a new telecommunications security framework, and to prohibit the inclusion of Huawei and ZTE’s products and services in Canada’s 5G networks.</p>\n\n<p>The Prime Minister and the President renewed their commitment to supply chain security and resilience and noted the release earlier today of the U.S.-Canada/Canada-U.S. Supply Chains Working Group Progress Report.<strong> </strong></p>\n\n<p>The leaders also noted progress made under the Joint Action Plan on Critical Minerals,<strong> </strong>and discussed the importance of taking further action bilaterally. They also stressed their commitment to working with like-minded partners to drive investment to mining, minerals processing and recycling projects, including for those critical minerals which are core inputs for electric vehicles, advanced batteries, and other clean energy technologies.</p>\n\n<p>The leaders noted the recent challenges with global energy markets and reiterated the importance of working together to strengthen Canada-U.S. energy security. They recognized the opportunity that enhanced Canada-U.S. energy collaboration offers for our collective energy security, that domestic energy security and climate action are increasingly and inextricably tied together, and that the clean energy transition will deliver energy security and a sustainable future for generations to come.</p>\n\n<p>The Prime Minister and the President therefore noted their shared commitment to combatting climate change and accelerating the green transition.</p>\n\n<p>The Prime Minister and the President noted the importance of continuing to promote and nurture trade and investment ties. The Prime Minister noted that the imposition of duties on Canadian softwood lumber are placing further pressure on home prices and affordability. &nbsp;</p>\n\n<p>The Prime Minister and the President noted the uniqueness of the Canada-U.S. partnership, and the broad and deep people-to-people ties that bind us together, and stressed their mutual commitment to continuing to deepen the relationship for the benefit of all of our citizens.</p>\n\n<p>The leaders agreed that the President will visit Canada in the coming months.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/05/07/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/supply_chains_progress_report-rapport_etape_chaine_approvisionnement.aspx?lang=eng\">U.S.-Canada/Canada-U.S. Supply Chains Progress Report</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}