{
  "path": "/en/news/news-releases/2018/05/15/historic-federal-investment-expands-calgarys-public-transit-system",
  "pageTitle": "Historic federal investment expands Calgary’s public transit system | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in public transit infrastructure shortens commute times, cuts air pollution, and creates good, well-paying middle class jobs, while connecting our communities and making more time for Canadians to do what they love.</p><p>The Prime Minister, Justin Trudeau, today announced a major investment of up to $1.53&nbsp;billion for Calgary’s Green Line Light Rail Transit project – the largest contribution ever made by the Government of Canada to an infrastructure project in Alberta.</p><p>The first stage of the Green Line involves the design and construction of 20 kilometres of track, 14 stations, a fleet of 70 low-floor light rail vehicles, a vehicle maintenance and storage facility, eight bridges, four tunnels, and three park-and-ride facilities.</p><p>Construction of this first stage is expected to begin in spring 2020 and be completed by late 2026. An estimated 20,000 jobs will be created to support the system’s design and construction, with a further 400 long-term jobs forecasted for the operation and maintenance of the Green Line when it opens to the public.</p><p>Once in service, Calgary’s Green Line will provide hundreds of thousands of transit riders in the city’s north and south-east communities with a direct route to the downtown core. It will also improve connections to public services, including hospitals, employment centres, and cultural and community facilities.</p><h2>Quote</h2><blockquote><p>“Across the country, we are investing in major infrastructure projects that will transform the way Canadians move, work and live, while creating good, well-paying middle class jobs today and for years to come. Today’s historic investment in Calgary’s public transit system will make it easier for people to get around and connect to the services they need, make our air cleaner, and create thousands of jobs for Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Through the Investing in Canada infrastructure plan, the Government of Canada will invest more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li><li>Of this amount, $28.7 billion will support public transit projects, including $5&nbsp;billion available for investment through the Canada Infrastructure Bank.</li><li>Part of the funding for the Green Line project comes from the more than $3.3 billion in federal funding allocated to Alberta in a bilateral agreement signed on April 3, 2018, to support projects over the next decade in the areas of public transit, green infrastructure, recreational, cultural and community infrastructure, and rural and northern communities.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/office-infrastructure/news/2018/04/backgrounder--canada-and-alberta-to-make-significant-investments-that-will-improve-the-lives-of-canadians.html\">Canada and Alberta to make significant investments that will improve the lives of Canadians</a></li><li><a href=\"http://www.infrastructure.gc.ca/map-carte/ab-eng.html\">Federal infrastructure investments in Alberta</a></li><li><a href=\"http://www.infrastructure.gc.ca/site/alt-format/pdf/plan/icp-pic/IC-InvestingInCanadaPlan-ENG.pdf\">Investing in Canada: Canada's Long-Term Infrastructure Plan</a></li><li><a href=\"http://www.infrastructure.gc.ca/cities-villes/index-eng.html\">Smart Cities Challenge</a></li></ul></div>\n      "
}