{
  "path": "/en/news/news-releases/2017/09/27/prime-minister-inaugurates-national-holocaust-monument",
  "pageTitle": "Prime Minister inaugurates National Holocaust Monument | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today inaugurated the National Holocaust Monument in Ottawa. The monument serves to honour the victims and survivors of the Holocaust, and the important lessons it so painfully taught us.</p><p>The Holocaust was the mass extermination of over six million Jews and millions of other victims, and one of the darkest chapters in human history. The National Holocaust Monument commemorates the millions of people who suffered such atrocities at the hands of the Nazi regime, and pays tribute to those whose stories must never be forgotten.</p><p>The monument also stands as a testament to the resilience and courage of Holocaust survivors. Many found a home in Canada, and profoundly shaped our country and society.</p><p>In honouring the victims of the Holocaust, we recognize their humanity, which no human act can erase. The National Holocaust Monument reminds us that it is our collective and vital responsibility to stand against anti-Semitism, racism, and hatred, and to bring meaning to the solemn vow, “never again.”</p><h2>Quotes</h2><blockquote><p>“This monument, so close to our Parliament and Supreme Court, is a reminder of the devastating cost of allowing hatred and tyranny to overcome openness, inclusion, and freedom. Today we reaffirm our unshakeable commitment to fight anti-Semitism, racism, xenophobia, and discrimination in all its forms, and we pay tribute to those who experienced the worst of humanity. We can honour them by fighting hatred with love, and seeking always to see ourselves in each other.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada<br></cite></p></blockquote><blockquote><p>“This monument is a powerful tribute to the millions of Jewish men, women and children and other victims whose lives were extinguished during one of the darkest chapters in human history. As we reflect and honour their memory, we also pay tribute to the courage and strength of the survivors who came to Canada following the Holocaust. Their stories are a powerful reminder of our responsibility to stand against anti-Semitism and prejudice in all its forms and to never allow intolerance and hate to take root in our communities. We will never forget.”&nbsp;<br>—<cite>The Honourable Mélanie Joly, Minister of Canadian Heritage</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The National Holocaust Monument is located at the corner of Wellington and Booth streets in Ottawa, near the Canadian War Museum.</li><li>The design of the monument, entitled “Landscape of Loss, Memory and Survival,” was developed by Team Lord of Toronto and depicts a stylized star, created by the confluence of six triangular shapes, or “volumes,” that are organized around a large gathering space for ceremonies.</li><li>The fully integrated design uses architecture, landscaping, art, and interpretation to communicate the hardship and suffering of victims, while conveying a powerful message of humanity’s enduring strength and survival.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1443025436163/1443025436165%20-%20a2\">The National Holocaust Monument</a></li><li><a href=\"http://holocaustmonument.ca/index.php?lang=en\">The National Holocaust Monument Development Council</a></li></ul></div>\n      "
}