{
  "path": "/en/news/statements/2019/03/20/statement-prime-minister-international-day-la-francophonie",
  "pageTitle": "Statement by the Prime Minister on the International Day of La Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of La Francophonie:</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Today, on the <a href=\"http://20mars.francophonie.org/\">International Day of La Francophonie</a>, we join Francophones in Canada and around the world to celebrate the French language and the diversity and richness of Francophone culture.</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Francophone communities are at the heart of our history, our heritage, and our identity as a country. They have played a fundamental role in building our country for centuries. The Canada we know today is vibrant, open, and inclusive – and that’s thanks in large part to the vision and hard work of Francophones.</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“The French language also connects us to communities around the globe. As a proud member of the <a href=\"https://www.francophonie.org/Welcome-to-the-International.html\">Organisation internationale de la Francophonie</a>, Canada is working with Francophone partners around the world to promote our common values, including peace, democracy, diversity, and respect for human rights.</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“This year also marks the <a href=\"https://www.canada.ca/en/canadian-heritage/news/2019/03/ministerjoly-announces-a-review-of-the-official-languages-act-to-support-the-vitality-of-official-languages-across-canada-and-the-full-recognition-.html\">50th anniversary of the <em>Official Languages Act</em></a>. By establishing the equal status of our two official languages, this law has helped Canada become not only a more just country, but also stronger and more prosperous.</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“The Government of Canada is working hard to support Francophone communities and protect their rights, particularly for those in minority language situations – and with our <a href=\"https://www.canada.ca/en/canadian-heritage/services/official-languages-bilingualism/official-languages-action-plan/2018-2023.html\">Action Plan for Official Languages</a>, we are making the largest investment in this area in Canadian history. Francophone communities help make us who we are. Keeping Canada strong means keeping the French language thriving – and helping those who speak it across the country to make their voices heard.</span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On behalf of the Government of Canada, I encourage all Canadians to participate in activities being held in their communities to mark this important day. I wish all those celebrating, here at home and around the world, a wonderful International Day of La Francophonie.”</span></p></div>\n      "
}