{
  "path": "/en/news/statements/2016/06/21/statement-prime-minister-canada-national-aboriginal-day",
  "pageTitle": "Statement by the Prime Minister of Canada on National Aboriginal Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister Justin Trudeau today issued the following statement on National Aboriginal Day:</p><p>“Today, on National Aboriginal Day, let us take the time to celebrate and honour the unique heritage and outstanding achievements of the Indigenous peoples in Canada.</p><p>“National Aboriginal Day is first and foremost an occasion to celebrate the fundamental role First Nations, Métis, and Inuit have played – and continue to play – in shaping the identity of all Canadians. Coast to coast to coast, their remarkable&nbsp;art&nbsp;and cultures, significant contributions and history, are essential to our sense of nationhood.</p><p>“Events over the past few months – including the loss of life to suicide and the feelings of despair felt in some communities – remind us that we must work in genuine partnership with Indigenous peoples, the provinces, and the territories to better support the well-being of children and families, improve the quality of education for Indigenous students, and ensure health services meet the needs of Indigenous communities.</p><p>“No relationship is more important to our government and to Canada than the one with Indigenous peoples. Today, we reaffirm our government’s commitment to a renewed nation-to-nation relationship between Canada and Indigenous peoples, one based on the recognition of rights, respect, trust, co-operation, and partnership.</p><p>“We understand the importance of reconciliation and the process of truth-telling and healing in this renewal. With this is mind, we will continue the vital work of reconciliation as outlined in the Truth and Reconciliation Commission Calls to Action, in partnership with First Nations, the Métis Nation, the Inuit, the provinces, and the territories. This work will build on our commitment last month to fully adopt and implement the United Nations Declaration on the Rights of Indigenous Peoples.</p><p>“Together, we will think seven generations out – as the Iroquois have taught – as we listen to Indigenous voices on environmental matters, build necessary roads, bridges, and water and wastewater infrastructure, and ensure a better and brighter future for Indigenous peoples in Canada.</p><p>“I invite you to join the #IndigenousReads campaign to help raise awareness and understanding through shared culture and stories and encourage steps toward reconciliation with Indigenous peoples.”</p></div>\n      "
}