{
  "path": "/en/news/news-releases/2020/05/21/prime-minister-announces-additional-support-indigenous-peoples-living",
  "pageTitle": "Prime Minister announces additional support for Indigenous peoples living in urban centres and off reserve | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As COVID-19 continues to affect Canadians across the country, First Nations, Inuit, and Métis are also facing health, social, and economic challenges. The Government of Canada recognizes that Indigenous peoples have unique needs, especially those who are separated from their families and communities.</p>\n\n<p>On March 18, the Government of Canada announced $305 million for a new, distinctions-based Indigenous Community Support Fund to address immediate needs in Indigenous communities, and help them respond to COVID-19. The Fund included $15 million in support for Indigenous organizations that provide services to Indigenous peoples living in urban centres and off reserve.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $75 million in new funding for Indigenous organizations providing services to Indigenous peoples in urban centres and off reserve.</p>\n\n<p>This additional funding will support more community-based projects that address the critical needs of Indigenous populations during this crisis, including food security, mental health support services, and sanitation and protective equipment. It could also help with other needs, such as support for Elders, transportation, and educational materials for Indigenous children and youth. Funding for projects will start rolling out in the coming weeks.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“COVID-19 is having unique impacts on First Nations, Inuit, and Métis across our country. For Indigenous peoples living off reserve, in urban centres, or separated from their communities, it can be even more challenging to access the help they need. We are listening to Indigenous peoples and organizations, and providing them with support to respond to this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Indigenous peoples living in urban centres are experiencing the impacts of COVID-19 in a unique way. That is why we are supporting organizations that play an essential role in their lives and give a helping hand in providing crucial services to First Nations, Inuit, and Métis during this difficult time.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As part of the $305 million distinctions-based Indigenous Community Support Fund announced on March 18, the Government of Canada provided:\n\t<ul>\n\t\t<li>$215 million for First Nations, allocated to each First Nation based on population, remoteness and community well-being</li>\n\t\t<li>$45 million for Inuit, which flowed to each of the four land claims organizations through an allocation determined by the Inuit Tapiriit Kanatami and regional Inuit land claims organizations</li>\n\t\t<li>$30 million for Métis Nation communities, which flowed through each of the Governing Members</li>\n\t\t<li>$15 million for Indigenous organizations and communities providing services to Indigenous peoples in urban centres and off reserve.</li>\n\t</ul>\n\t</li>\n\t<li>The new $75 million will provide additional funding for the many organizations meeting the critical needs of First Nations, Inuit, and Métis in urban centres and off reserve.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1585189335380/1585189357198\">Indigenous Community Support Fund</a></li>\n</ul></div>\n      "
}