{
  "path": "/en/news/statements/2016/07/01/statement-prime-minister-canada-memorial-day-newfoundland-and-labrador",
  "pageTitle": "Statement by the Prime Minister of Canada on Memorial Day in Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Memorial Day in Newfoundland and Labrador:</p>\n<p>“Beaumont Hamel is a name that is seared into the hearts of all Newfoundlanders and Labradorians. It is a name that represents courage, sacrifice, and sorrow.</p>\n<p>“One hundred years ago to this very day – in what would become the bloodiest battle of the First World War – 810 young men from the Newfoundland Regiment were ordered out of their trench. They calmly advanced, under withering machine gun and artillery fire, across no man’s land and into the teeth of the enemy.</p>\n<p>“As one major wrote: ‘The only visible sign the men knew they were under such terrifying shell fire was that they tucked their chins into an advanced shoulder as they had so often done when fighting their way home against a Newfoundland blizzard.’</p>\n<p>“Of the 810 men who went ‘over the top’, only 68 would stand for roll call the following morning. It was a loss that has echoed down through the generations, and it is this loss – this sacrifice – that we remember today. It is their sacrifice that has allowed us to build this strong, free, and diverse country that we hold so dear.</p>\n<p>“On this day, as our fellow Canadians gather to celebrate the maple leaf and everything it stands for, let us also remember the caribou, the brave men of the Newfoundland Regiment, and the ideals for which they fought.</p>\n<p>“While we can never repay this debt, we can honour and remember all those who have served and continue to serve and protect our great nation.”</p></div>\n      "
}