{
  "path": "/en/news/statements/2021/06/24/statement-prime-minister-findings-around-former-marieval-cowessess",
  "pageTitle": "Statement by the Prime Minister on the findings around the former Marieval (Cowessess) Residential School in Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement:</p>\n\n<p>“I am terribly saddened to learn that the remains of children had been found in unmarked graves near the former Marieval (Cowessess) Residential School in Saskatchewan. My heart breaks for the Cowessess First Nation, and for all Indigenous communities across Canada.</p>\n\n<p>“No child should have ever been taken away from their families and communities, and robbed of their language, culture, and identity. No child should have spent their precious youth subjected to terrible loneliness and abuse. No child should have spent their last moments in a place where they lived in fear, never to see their loved ones again. And no families should have been robbed of the laughter and joy of their children playing, and the pride of watching them grow in their community.</p>\n\n<p>“I recognize these findings only deepen the pain that families, survivors, and all Indigenous peoples and communities are already feeling, and that they reaffirm a truth that they have long known. The hurt and the trauma that you feel is Canada’s responsibility to bear, and the government will continue to provide Indigenous communities across the country with the funding and resources they need to bring these terrible wrongs to light. While we cannot bring back those who were lost, we can – and we will – tell the truth of these injustices, and we will forever honour their memory.</p>\n\n<p>“The findings in Marieval and Kamloops are part of a larger tragedy. They are a shameful reminder of the systemic racism, discrimination, and injustice that Indigenous peoples have faced – and continue to face – in this country. And together, we must acknowledge this truth, learn from our past, and walk the shared path of reconciliation, so we can build a better future.”</p>\n\n<p><em>If you need someone to talk to, please reach out to the National Indian Residential School Crisis Line, which is available 24 hours a day at 1-866-925-4419.</em></p></div>\n      "
}