{
  "path": "/en/news/readouts/2023/04/27/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Barbados, Mia Mottley.</p>\n\n<p>The prime ministers convened a meeting of the Sustainable Development Goals (SDGs) Advocates group on the margins of the Global Citizen NOW Summit. The two leaders reaffirmed their commitment to advancing the United Nations (UN) SDGs, as co-chairs of the Secretary-General’s SDG Advocates group.</p>\n\n<p>They recognized that developing countries, and particularly those most vulnerable to the impacts of climate change, have limited access to the financing they need as they confront unprecedented overlapping crises. To this end, the two prime ministers reiterated their commitment to working together to improve access to affordable and flexible financing for low- and medium-income countries, to address today’s global challenges.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley expressed concern over the deteriorating security situation in Haiti and the importance of helping to address the urgent needs of the Haitian people. They emphasized the critical role of the Caribbean Community (CARICOM) in supporting an inclusive political dialogue and recommitted to working together to alleviate the pressing political, security, and humanitarian crises.</p>\n\n<p>The two leaders looked forward to continuing their close collaboration on advancing the SDGs, climate action, access to financing, and other issues of shared interests in the lead up to the 2023 SDG Summit in September 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"/en/news/readouts/2023/02/16/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley\">Prime Minister Justin Trudeau meets with Prime Minister of Barbados Mia Mottley</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n\t<li><a href=\"https://migrationnetwork.un.org/events/2023-sdg-summit\">2023 SDG Summit</a></li>\n</ul></div>\n      "
}