{
  "path": "/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new",
  "pageTitle": "Prime Minister announces additional support for equitable access to new COVID-19 medical solutions | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The global COVID‑19 pandemic is a threat that we can only beat by working together. With the rapid spread of COVID-19 variants, it’s more important than ever for all countries to do their part to finish the fight against this virus, so we can build back better for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced additional funding for the Access to COVID-19 Tools (ACT) Accelerator. This $375 million contribution will help develop, produce, and distribute diagnostics, therapeutics, and vaccines to low-and-middle-income countries.</p>\n\n<p>Today’s announcement builds on the work that Canada has been doing to support vulnerable countries through this crisis, including by providing access to vaccines, tests, and treatments. Since the start of this crisis, we have committed more than $2.5 billion to support the global COVID-19 response.</p>\n\n<p>We cannot beat the COVID-19 virus here at home unless we beat it everywhere around the world. Canada will continue to work with our partners through the G7, the G20, and other international organizations to beat the pandemic, support vulnerable countries, and build a stronger and more resilient world. Only together will we tackle the challenges of today and tomorrow. &nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Since the start of the pandemic, Canada has been committed to facilitating equitable global access to COVID-19 tests, treatments, and vaccines – because we can’t beat the virus at home unless we beat it everywhere.&nbsp;Today’s announcement will further support vulnerable countries in their pandemic response, and help us build a stronger and more resilient world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the start of the pandemic, Canada has been one of the leading contributors to the global response efforts. Including today's announcement of $375 million, Canada has mobilized more than $2.5 billion in international assistance in response to COVID-19. This includes:\n\t<ul>\n\t\t<li>$1.3 billion for the ACT-Accelerator, a critical international partnership to ensure equitable access to COVID-19 tests, treatments and vaccines which the Prime Minister has championed alongside other world leaders since May 2020;</li>\n\t\t<li>Over $740 million in humanitarian and development assistance to respond to the immediate needs created by COVID-19.</li>\n\t\t<li>Canada worked with organizations to adapt their existing funding arrangements with Global Affairs Canada to ensure their activities could address the immediate needs created by the pandemic in developing countries for a total of $541 million.</li>\n\t</ul>\n\t</li>\n\t<li>Canada joined the ACT-Accelerator as a co-lead on May 4, 2020. At the core of the ACT-Accelerator framework are three partnerships (vaccines, therapeutics, and diagnostics) with a crosscutting work stream on health systems.</li>\n\t<li>This funding is also in addition to the $1 billion increase to Canada’s loan commitment to the International Monetary Fund's Poverty Reduction and Growth Trust, which provides interest-free loans to low-income countries.</li>\n\t<li>Since May 2020, Canada has provided more than $70 million in temporary debt service relief for the poorest countries through the G20 and Paris Club-agreed Debt Service Suspension Initiative.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li>Backgrounder: <a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/canadas-increased-contributions-to-the-act-accelerator.html\">Canadian contributions to the ACT-Accelerator</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.who.int/initiatives/act-accelerator/about\">Access to COVID-19 Tools (ACT) Accelerator</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/19/prime-minister-concludes-productive-g7-leaders-meeting\">Prime Minister concludes productive G7 Leaders’ meeting</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canada-announces-support-for-equitable-access-to-new-covid-19-medical-solutions.html\">Canada announces support for equitable access to new COVID-19 medical solutions</a></li>\n</ul></div>\n      "
}