{
  "path": "/en/news/news-releases/2022/08/30/creating-nearly-17000-homes-canadians-across-country",
  "pageTitle": "Creating nearly 17,000 homes for Canadians across the country | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Making life more affordable for Canadian families starts with making housing more affordable. Everyone deserves a safe and affordable place to live and raise their families, but Canadians are finding it challenging to find one. That’s why we are making historic investments to put Canada on the path to double housing construction and meet our housing needs over the next decade.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a major investment of over $2&nbsp;billion to support three key initiatives that, together, will help create nearly 17,000 homes for families across the country, including thousands of affordable housing units.</p>\n\n<p>This investment, which includes funding from Budget&nbsp;2021 and Budget&nbsp;2022, will go toward:</p>\n\n<ul>\n\t<li>Creating 4,500 additional affordable housing units by extending the Rapid Housing Initiative for a third round. This will include women-focused housing projects and projects supporting those experiencing or at risk of homelessness;</li>\n\t<li>Creating at least 10,800 housing units, including 6,000 affordable units, through the Affordable Housing Innovation Fund, which encourages new funding models and innovative building techniques in the affordable housing sector; and</li>\n\t<li>Creating a new, five-year rent-to-own stream under the Affordable Housing Innovation Fund to help housing providers develop and test rent-to-own models and projects, with the goal to help Canadian families across the country transition from renting to owning a home.</li>\n</ul>\n\n<p>Applications are being accepted as of today for both the Affordable Housing Innovation Fund and its new rent-to-own stream. As part of their application, candidates will be required to demonstrate their commitment to innovation, affordability, and financial sustainability.</p>\n\n<p>More information on the extended Rapid Housing Initiative will be available soon, followed by the opening of the application and proposal process.</p>\n\n<p>These initiatives build on the significant progress the Government of Canada has already made to increase housing supply and build more affordable housing for people from coast to coast to coast. To date, the government has helped more than 1.2&nbsp;million Canadians find a place to call home, including through the Rapid Housing Initiative. These investments are also growing our economy and creating good middle-class jobs in the housing and construction sectors.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When people have a home of their own, whether they rent or they own, they are better able to invest in themselves, and invest in their communities. Our government understands that it is only by investing in people, that we can grow our economy. Tackling housing affordability is a complex problem and there is no one silver bullet, but announcements like today’s give more people a place to call home, and a real and fair chance at success.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Housing affordability is key to strengthening the middle class and those working hard to join it. Our government is investing in proven and innovative programs to alleviate housing gaps today and into the future. This will help promote inclusive growth and lift more Canadians out of poverty.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Housing and Diversity and Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada’s National Housing Strategy (NHS) is an ambitious, 10-year plan to invest over $72&nbsp;billion to give more Canadians a place to call home. Since its launch in 2017, the government has committed over $26.5&nbsp;billion to support the creation of over 106,100 units and the repair of over 254,600 units.</li>\n\t<li>Launched in 2020, the Rapid Housing Initiative (RHI)&nbsp;is delivered by the Canada Mortgage and Housing Corporation (CMHC), under the NHS. It provides&nbsp;funding to&nbsp;facilitate&nbsp;the rapid construction of&nbsp;new&nbsp;housing&nbsp;and the acquisition&nbsp;of existing buildings&nbsp;for&nbsp;the purpose of&nbsp;rehabilitation or&nbsp;conversion&nbsp;to permanent affordable housing units. The first two rounds of the RHI exceeded expectations, and are expected to create 10,000 units instead of the 7,500 initially planned. This includes over 3,300 units to support women and over 4,200 units to support Indigenous Peoples.</li>\n\t<li>The RHI takes a human rights-based approach to housing, serving people experiencing or at risk of homelessness and other vulnerable people under the NHS, including women and children fleeing domestic violence, seniors, young adults, Indigenous Peoples, people with disabilities, people experiencing mental health and addiction issues, veterans, 2SLGBTQI+ individuals, racialized groups, and recent immigrants or refugees.</li>\n\t<li>The Affordable Housing Innovation Fund was launched in 2016. Delivered by the CMHC under the NHS, it is designed to help generate innovation and growth in the affordable housing sector by encouraging the development of new funding models and building techniques. It supports innovative solutions by providing opportunities where conventional financing is not easily available.</li>\n\t<li>Budget&nbsp;2022 proposed targeted investments to build more homes and make housing more affordable across the country. This included:\n\t<ul>\n\t\t<li>$1.5&nbsp;billion to extend the RHI, with $500&nbsp;million allocated through the Cities Stream and $1&nbsp;billion through the Projects Stream. City-by-city allocations and exact timelines for applications will be announced soon.</li>\n\t\t<li>$200&nbsp;million to create the new Affordable Housing Innovation Fund’s rent-to-own stream.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget&nbsp;2022 Backgrounder: Making Housing More Affordable</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rapid-housing\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/affordable-housing-innovation-fund\">Affordable Housing Innovation Fund</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n</ul></div>\n      "
}