{
  "path": "/en/news/statements/2017/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p><p>“Twenty-eight years ago, at l'École Polytechnique de Montréal, 14 young women were viciously murdered in a senseless and hateful act of violence. On the <a href=\"http://www.swc-cfc.gc.ca/commemoration/vaw-vff/remembrance-commemoration-en.html\">National Day of Remembrance and Action on Violence Against Women</a>, we mourn with their families and friends, and pay tribute to the women whose future was robbed from them.</p><p>“The tragedy at l’École Polytechnique was a devastating reminder of what can happen when hatred and misogyny prevail. Yet almost thirty years on, gender-based violence continues to affect the daily lives of women and girls everywhere – in Canada and around the world.</p><p>“This is unacceptable. We must find the courage to stand up and speak out against gender-based violence in all its forms. That means valuing the voices of women and girls, fighting the injustices and inequalities that put the most vulnerable women at the greatest risk of violence, and breaking down a culture that dismisses women’s worth – from Hollywood studios to the halls of Parliament. Every single one of us, no matter our gender identity, can and must be part of the solution to stop violence before it starts.</p><p>“The Government of Canada is taking action through our <a href=\"http://cfc-swc.gc.ca/violence/strategy-strategie/index-en.html\">Strategy to Prevent and Address Gender-Based Violence</a>. This strategy – which includes nearly $100 million in funding over five years and $20 million per year on an ongoing basis – focuses on prevention, support for survivors and their families, and responsive legal and justice systems. We are also investing in the construction and renovation of shelters and transition houses for victims of family violence. Our work to promote women’s leadership in government and business, and to prioritize gender equality in our decision-making at home and abroad, is part of a cultural shift towards valuing women’s voices.</p><p>“As we mourn with the loved ones of the women so senselessly lost, I invite all Canadians to reflect on how each of us can help eliminate all forms of violence against women and girls. Our actions matter. Each of us has the power to make our world more just and more gender-equal. Today, let us move forward together to build a future where everyone’s rights are protected, and everyone’s voices are heard.”</p></div>\n      "
}