{
  "path": "/en/news/news-releases/2020/03/13/prime-minister-speaks-national-indigenous-leaders-efforts-address",
  "pageTitle": "Prime Minister speaks with National Indigenous Leaders on efforts to address the impact of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with National Chief of the Assembly of First Nations Perry Bellegarde, President of Inuit Tapiriit Kanatami Natan Obed, and Vice-President and National Spokesperson for the Métis National Council David Chartrand, to discuss the COVID-19 outbreak and the measures taken by the Government of Canada to limit the spread of the virus in Canada.</p>\n\n<p>Minister of Indigenous Services Marc Miller provided an update on the work being done by Indigenous Services Canada with Indigenous partners to support preparedness, and acknowledged the unique challenges faced by Indigenous people due to socio-economic gaps that still exist. Minister Miller stressed that the Government of Canada is committed to working with First Nations, Inuit, and Métis Nation leaders to ensure their communities have the full support they need during this outbreak, and to regular communication with Indigenous partners and provinces and territories.</p>\n\n<p>Canada’s Chief Public Health Officer Dr. Theresa Tam also participated in these discussions. The Prime Minister emphasized that the Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19, and that the well-being and safety of Indigenous peoples and all Canadians is the Government’s top priority.</p>\n\n<p>The Prime Minister highlighted the Government of Canada’s ongoing commitment to work with First Nations, Inuit, and Métis Nation leaders to fund and support preparedness and mitigation measures in their communities. This new funding builds on previous investments to help ensure health care measures, supplies, and equipment are in place, and provide Indigenous communities with accurate information, training for health care providers, and support to ensure health risk plans are up-to-date, follow best practices, and are culturally and regionally responsive.</p>\n\n<p>The Prime Minister and Indigenous leaders committed to continued collaboration in combating the COVID-19 outbreak.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">Government of Canada takes action on COVID-19</a></li>\n</ul></div>\n      "
}