{
  "path": "/en/news/news-releases/2021/07/20/helping-over-320-canadian-families-find-affordable-homes-ontario",
  "pageTitle": "Helping over 320 Canadian families find affordable homes in Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves a safe and affordable place to call home, yet many Canadians in Ontario and across the country continue to struggle with high housing costs. That is why the Government of Canada continues to invest in affordable, energy-efficient housing to build back better, grow the middle class, and tackle climate change, while working to end homelessness and help vulnerable Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $5&nbsp;million in funding to help over 320 Ontario families and individuals find a place to live and build their future. This funding will be delivered through the Affordable Housing Innovation Fund, which was expanded in Budget 2021, and will build a total of 30,000 affordable housing units for Canadians.</p>\n\n<p>Through this initiative, the government is helping to build 95 new rental units in Hamilton, 72 in London, 68 in Mississauga, 50 in Simcoe, and 43 in Kitchener. All projects will be built with energy-efficient passive housing design, which will result in significant reductions in the energy consumption and pollution of the buildings. This will lower operating costs for building operators and increase affordability for tenants.</p>\n\n<p>Since 2015, through programs like the First-Time Home Buyer Incentive and the Rapid Housing Initiative, the Government of Canada has helped more than one million Canadians find a safe and affordable place to call home. The government will continue to do whatever is necessary to grow the middle class, build back stronger communities, and make life more affordable for Canadians while getting us closer to our goal of eliminating chronic homelessness in Canada.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As we finish the fight against COVID-19, finding an affordable place to live remains a challenge for many Canadians in communities across the country. Today’s announcement is great news for families in Ontario, and we will continue to help all Canadians find safe, affordable housing. Thanks to smart investments like these, we will grow our middle class, fight climate change, and build back better for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every Canadian deserves a safe and affordable place to call home. The government is taking action by investing across the housing spectrum in innovative solutions to housing challenges, to increase the supply of affordable housing. These projects will provide over 320 families much-needed places to live, as well as jobs, services, and amenities. In addition, through the Affordable Housing Innovation Fund, we are encouraging innovative ways to reduce energy consumption and greenhouse gas emissions. This is the National Housing Strategy at work.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development and Minister responsible for Canada Mortgage and Housing Corporation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Affordable Housing Innovation Fund, which was launched in 2016, is a $200&nbsp;million fund delivered by the Canada Mortgage and Housing Corporation, under the National Housing Strategy (NHS).</li>\n\t<li>Canada’s NHS is an ambitious, 10-year plan that will invest over $72&nbsp;billion to give more Canadians a place to call home. Launched in 2017, the NHS is building and repairing thousands of housing units, and helping households with affordability support.</li>\n\t<li>To help Canadians find affordable housing, Budget 2021 provides $2.5&nbsp;billion over seven years in new funding, and reallocates $1.3&nbsp;billion in previously announced funding, to speed up the construction, repair, and support of over 35,000 additional housing units.</li>\n\t<li>As part of the new funding, Budget 2021 provides an additional $600&nbsp;million over seven years, starting in 2021-22, to renew and expand the Affordable Housing Innovation Fund.</li>\n\t<li>To date, this program has committed funding to support the creation of over 17,600 units, including more than 16,300 affordable housing units and units for persons with accessibility challenges. This new funding will support the creation of up to 12,700 more units, bringing the total to over 30,000 units.</li>\n\t<li>The Fund encourages new funding models and innovative building techniques in the affordable housing sector.</li>\n\t<li>The five projects announced today are being developed by Indwell, a supportive non-profit housing provider, developer, and property manager that has more than 25 years of experience and has developed over 600 rental units in Ontario.</li>\n\t<li>The Rapid Housing Initiative (RHI) is also helping ensure no one is left behind here in Ontario and across Canada. In Hamilton, the government announced $10.8 million in December 2020 through the RHI to support the creation of 45 new affordable units in under 12 months, and recently announced that additional funding will be provided to Hamilton under the second phase of RHI through Budget 2021.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/affordable-housing-innovation-fund\">Affordable Housing Innovation Fund</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap6\">Budget 2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n</ul></div>\n      "
}