{
  "path": "/en/news/news-releases/2020/08/21/new-investment-secure-made-canada-supply-n95-respirators-protect",
  "pageTitle": "New investment to secure made-in-Canada supply of N95 respirators to protect health care workers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every day, front line health care workers across the country put their health at risk as they work hard to fight COVID-19 and care for their fellow Canadians. These real-life heroes need the right protective equipment to keep themselves, their patients, and their families safe. That is why the Government of Canada and the Government of Ontario are taking steps to guarantee a secure, made-in-Canada supply of medical equipment to protect their health and safety.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Ontario, Doug Ford, today announced an agreement between the Government of Canada, the Government of Ontario and 3M Canada on a joint investment to expand a manufacturing facility for N95 respirators in Brockville, Ontario. The Government of Canada and the Government of Ontario are supporting 3M’s capital investment by contributing $23.33 million each. The facility will produce 25 million N95 respirators for the Government of Canada and 25 million for the Government of Ontario per year over five years. This will provide 50 million N95 respirators annually to help health care workers, first responders and other essential workers with the equipment they need to continue their vital work.</p>\n\n<p>The health and safety of all Canadians remain the top priority of the Government of Canada and the Government of Ontario. As we gradually and safely restart the economy, we will continue to work with Canadian industry and make strategic investments to support our health care workers and make our country more resilient to possible future waves of the virus.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Our health care workers have been on the front lines of our country’s fight against COVID-19 since the very beginning. While the virus remains a threat, we need to make sure these real-life heroes have the equipment they need. This agreement with 3M Canada highlights the Government of Canada’s commitment to protecting those who are doing so much to keep their fellow Canadians healthy and safe.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As a province and as a country, we have turned our manufacturing might towards fighting against COVID-19 and encouraging businesses to step up and produce the life-saving personal protective equipment and critical health supplies we need. We are proud to stand with our federal partners and invest in 3M’s new manufacturing facility for N95 respirators. It will create jobs and contribute to our economic recovery, but more importantly, it will protect our front line health care workers throughout the pandemic and beyond.”</p>\n\n<footer class=\"default\">The Hon. Doug Ford, Premier of Ontario</footer>\n</blockquote>\n\n<blockquote>\n<p>“From the beginning of this pandemic, Canada’s front line health care workers have worked tirelessly&nbsp;to keep Canadians safe and healthy. By partnering with 3M Canada, we’re securing a made-in-Canada supply of essential life-saving equipment and ensuring our health care workers have the protective equipment they need to continue their incredible efforts, and to do their job safely.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>&nbsp;“Ontario’s partnership with 3M and the federal government will provide a made-in-Ontario solution for the essential medical equipment our front line workers and health care professionals rely on. This new facility will mean jobs, a stronger supply chain, and further growth in our world-class manufacturing capacity.”</p>\n\n<footer class=\"default\">The Hon. Vic Fedeli, Ontario’s Minister of Economic Development, Job Creation and Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“This long-term investment in 3M for the production of N95 respirators will enhance Canada’s domestic supply of personal protective equipment and create jobs here at home. The ability to produce these highly sought-after respirators right here in Ontario means reliable access to this vital piece of PPE for those who depend on it to fulfill their duties in so many essential services.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic has highlighted the importance of increasing the availability of N95 respirators in North America. We are extremely proud to deliver a made-in-Canada solution that strengthens the North American region’s supply of PPE for health care workers, first responders and those in critical infrastructure and industry roles. We thank both the Canadian and Ontario governments for their close collaboration on this effort and share their goal of protecting Canadians.”</p>\n\n<footer class=\"default\">Penny Wise, President, 3M Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The first deliveries of N95 respirators produced as a result of this investment will begin in early 2021 to meet current demand for front line health care workers.</li>\n\t<li>It is expected that when fully operational more than 100 million N95 respirators will come off this new line in Brockville per year.</li>\n\t<li>A N95 respirator is one of the most important pieces of personal protective equipment to ensure the health and safety of front line health care workers and mitigate the spread of COVID-19.</li>\n\t<li>3M is a recognized leader in respiratory protection products, and its manufacturing capabilities for N95 respirators are in high demand worldwide. 3M Canada’s proposal was selected from more than 500 proposals on N95 respirators received and reviewed by the government.</li>\n\t<li>3M Canada has a long history in Canada and employs approximately 2,000 people in the country. It currently operates manufacturing facilities in Ontario (Perth, Brockville, Mississauga, and London), Quebec (Chicoutimi), and Manitoba (Morden), as well as a number of research and development facilities across the country.</li>\n\t<li>On March 20, the Government of Canada announced Canada’s Plan to Mobilize Industry to fight COVID-19, a call to action to manufacturers to support COVID-19 response efforts by building and ramping up domestic industrial capacity to meet the need for critical supplies.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\" title=\"Coronavirus disease (COVID-19)\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/services/drugs-health-products/covid19-industry/medical-devices/personal-protective-equipment/overview.html\">Personal protective equipment (COVID-19): Overview</a></li>\n</ul></div>\n      "
}