{
  "path": "/en/news/readouts/2022/12/09/prime-minister-justin-trudeau-meets-yukon-premier-sandy-silver",
  "pageTitle": "Prime Minister Justin Trudeau meets with Yukon Premier Sandy Silver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Premier of the Yukon, Sandy Silver, to discuss issues of importance to Yukoners and all Canadians. The Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency, Dan Vandal, and the Member of Parliament for Yukon, Brendan Hanley, were also in attendance.</p>\n\n<p>The Premier highlighted the productive discussions he, his ministers, and Yukon First Nations Chiefs had with federal ministers earlier this week in Ottawa as part of this year’s Yukon Days, an annual series of trilateral meetings. The Prime Minister and the Premier discussed the importance of providing access to high-quality health care and modernizing health system data. They also reaffirmed their shared commitment to advancing reconciliation through meaningful partnership with Indigenous Peoples in areas such as economic development and clean energy.</p>\n\n<p>The Prime Minister and the Premier noted the important role the Yukon plays in the development of critical minerals, which are key to Canada’s economic growth, and discussed related areas such as infrastructure. The Prime Minister also highlighted today’s release of Canada’s Critical Minerals Strategy, which will help create sustainable jobs in every region of our country.</p>\n\n<p>Prime Minister Trudeau thanked Premier Silver for his leadership as Premier over the past six years and committed to continue working with the Government of Yukon and future leadership when the Premier steps down in January 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/05/13/prime-minister-justin-trudeau-meets-yukon-premier-sandy-silver\">Prime Minister Justin Trudeau meets with Yukon Premier Sandy Silver</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadas-critical-minerals-strategy.html\">Canada’s Critical Mineral Strategy</a></li>\n</ul></div>\n      "
}