{
  "path": "/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement",
  "pageTitle": "Prime Minister announces next steps for Safe Restart Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we move into the fall and the world continues to deal with the impacts of COVID-19, the Government of Canada remains focused on keeping Canadians safe and healthy, while continuing to ensure they have the supports needed during this global health and economic crisis.</p>\n\n<p>The Prime Minister, Justin Trudeau, today shared the details of the investments that will be made through the Safe Restart Agreement. This will provide continued support to Canadians, as we safely restart our economy and build a more resilient Canada. &nbsp;</p>\n\n<p>Through the Agreement, reached earlier this summer, the Government of Canada announced over $19 billion in federal funding to help provinces and territories safely restart the economy. Provinces and territories were asked to outline in a letter how these funds would best be allocated within their jurisdictions, based on their priorities. The premiers have now submitted the <a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">letters</a> and the federal funding will be transferred to the provinces and territories.</p>\n\n<p>The Safe Restart Agreement supports measures to increase testing and contact tracing to protect Canadians from future waves of the virus. It will help support the capacity of our health care systems, including through services for people facing mental health challenges. It will also provide municipalities with funding so they can quickly deliver essential services, like public transit, that Canadians rely on every day, and secure a reliable source of personal protective equipment for essential workers.&nbsp;</p>\n\n<p>The Agreement will also provide direct support to Canadian workers, including safe child care to help parents returning to work. It will also provide income support for people without paid sick leave, and takes steps to protect the most vulnerable, like Canada’s seniors.</p>\n\n<p>As we continue to deal with the health and economic challenges of the pandemic, the government will continue to invest in Canadians. Together, working with the provinces and territories, we will build a more resilient Canada – one that is healthier and safer, cleaner and more competitive, and fairer and more inclusive for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Fighting COVID-19 and safely restarting our economy requires a Team Canada approach. We will continue to work together with provinces and territories to keep Canadians safe and healthy, and to build a more resilient Canada.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today marks a milestone in our fight against COVID-19. I am proud of the collaboration between our federal, provincial, and territorial governments and look forward to continuing to work together in our ongoing efforts to curtail the pandemic.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On July 16, 2020, the Prime Minister and Deputy Prime Minister announced an agreement to safely restart the economy that involved over $19 billion in funding from the federal government. The Safe Restart Agreement focuses on measures over six to eight months to restart the economy while protecting the health of Canadians.</li>\n\t<li>Funding will support the provinces and territories in their delivery and management of COVID-related response under seven key priorities:\n\t<ul>\n\t\t<li>Testing, contact tracing, and data management</li>\n\t\t<li>Health care capacity, including mental health and substance use</li>\n\t\t<li>Protecting vulnerable populations, including seniors in long-term care facilities</li>\n\t\t<li>Securing personal protective equipment</li>\n\t\t<li>Child care for returning workers</li>\n\t\t<li>Support for municipalities, including for public transit</li>\n\t\t<li>Sick leave</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement\">More support for Canadians through the Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/07/16/joint-communique-safe-restart-agreement\">Joint Communiqué – Safe Restart Agreement</a></li>\n</ul></div>\n      "
}