{
  "path": "/en/news/statements/2017/05/23/statement-prime-minister-canada-apparent-terrorist-attack-manchester",
  "pageTitle": "Statement by the Prime Minister of Canada on an apparent terrorist attack in Manchester, United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on an apparent terrorist attack in Manchester, United Kingdom:</span></p><p><span class=\"bumpedfont15\"><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span></span><span class=\"bumpedfont15\">I was devastated when I heard about the innocent victims who were killed or injured at the Ariana Grande concert tonight in Manchester – many of them far too young.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of all Canadians, our deepest condolences go out to the families and friends of those who were killed. We also wish a speedy recovery to everyone who was injured.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Canada and the United Kingdom are the closest of friends, and we stand together as a people in this most tragic of circumstances.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“With our allies and partners, we will continue to counter such senseless acts and to fight terrorism in its many forms. We will do all that we can to assist British authorities in bringing those responsible to justice. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Our hearts are with the people of the United Kingdom tonight, and we mourn with them the loss of so many innocent victims.”</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">***IMPORTANT***</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“We are still in the process of determining whether any Canadians have been impacted by this event.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">\"Canadian citizens in the United Kingdom requiring emergency consular assistance should contact the High Commission of Canada at 0207&nbsp;004&nbsp;6000 or call Global Affairs Canada's 24/7 Emergency Watch and Response Centre toll free at 00-800-2326-6831 or collect at +1&nbsp;613&nbsp;996-8885. An email can also be sent to <a href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a>.”</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\"> <br> </span></p></div>\n      "
}