{
  "path": "/en/news/news-releases/2022/03/04/prime-minister-travel-united-kingdom-latvia-germany-and-poland",
  "pageTitle": "Prime Minister to travel to the United Kingdom, Latvia, Germany, and Poland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will travel to Europe from March 6 to 11, 2022, to further strengthen Canada’s solidarity with our European partners and allies in the face of Russia’s unwarranted invasion of Ukraine.</p>\n\n<p>Canada stands united with our partners and allies in support of Ukraine. During the visit, the Prime Minister will engage with close allies to build on our coordinated response to Russia’s unprovoked and unjustifiable military aggression against Ukraine. He will also express Canada’s support to address the significant humanitarian challenges emerging in Ukraine and as refugees flee from Ukraine. The Prime Minister will also advance shared key priorities with international partners and allies, including trade, economic growth, climate action, and human rights.</p>\n\n<p>The Prime Minister will travel to London, United Kingdom, on March 6 2022, where he will meet with Prime Minister&nbsp;Boris&nbsp;Johnson, and be joined by the Prime Minister of the Netherlands Mark Rutte, to coordinate additional responses to Russia’s blatant violation of international law and the United Nations Charter. During his visit to the United Kingdom, the Prime Minister will also have an audience with Her Majesty The Queen.</p>\n\n<p>The Prime Minister will then travel to Riga, Latvia, on March 8, 2022, to meet with Prime Minister Krišjānis Kariņš. The leaders will review current security challenges, NATO’s assurance and deterrence measures, and discuss ways to further strengthen the bilateral relationship. Prime ministers Trudeau and Kariņš will be joined for a meeting by the Prime Minister of Estonia, Kaja Kallas, and the Prime Minister of Lithuania, Ingrida Šimonytė, to work together on additional support for Ukraine and other shared priorities. The Prime Minister will also meet with Latvia’s President, Egils Levits.</p>\n\n<p>While in Latvia, the Prime Minister will also meet with NATO Secretary General Jens Stoltenberg to discuss the Alliance’s response to Russia’s ongoing attacks on Ukraine, Canada’s unwavering support for NATO’s eastern flank, and the importance of continued coordination and collaboration amongst allies and partners in their support of Ukraine’s sovereignty, territorial integrity and independence. The Prime Minister will also meet with the Canadian Armed Forces members in Latvia as part of Operation REASSURANCE to thank them for their ongoing work to help make Europe stronger and more secure.</p>\n\n<p>The Prime Minister will then travel to Berlin, Germany, on March 9, 2022, where he will meet with Germany’s Chancellor, Olaf Scholz. Together, the leaders will discuss peace and security in Europe, including through their shared dedication to democracy and multilateralism. Prime Minister Trudeau and Chancellor Scholz will also explore avenues to deepen bilateral cooperation to enhance trade, fight climate change and build the economy of the future, including through the transition to clean energy. The Prime Minister will also meet with German President Frank-Walter Steinmeier.</p>\n\n<p>The Prime Minister will finally travel to Warsaw, Poland, on March 10, 2022, where he will meet with President Andrzej Duda, to further discuss security concerns in Eastern Europe and convey Canada’s support to Poland as it grapples with hundreds of thousands of Ukrainians fleeing the Russian invasion.</p>\n\n<p>During his trip, Prime Minister Trudeau will highlight successes of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) in creating jobs and growing the middle-class, and emphasize that Canada stands by its allies in these challenging times as stable and trusted partner.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“In light of Russia’s unwarranted and unjustifiable aggression against Ukraine, Canada is working in close collaboration with our allies and partners in defending democracy against authoritarianism and standing with the Ukrainian people. We will continue to ensure that Russia’s actions do not go unpunished.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-United Kingdom Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}