{
  "path": "/en/news/statements/2022/11/18/statement-prime-minister-latvias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Latvia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Latvia’s Independence Day:</p>\n\n<p>“Today, we join Latvian communities in Canada and around the world to celebrate Latvia’s Independence Day.</p>\n\n<p>“Canada and Latvia enjoy a strong and positive relationship built on deep ties between our peoples, and a shared commitment to democracy, freedom, and the rule of law. More than 30,000 people of Latvian heritage call Canada home and contribute to our country’s economic, cultural, and social fabric.</p>\n\n<p>“Canada was the first G7 country to recognize the restoration of Latvia’s independence in 1991, following over half a century of communist rule, and the first country to ratify Latvia’s accession to the North Atlantic Treaty Organization (NATO) in 2004. Since then, we have continued to strengthen our defence relationship: Canada leads the multinational NATO enhanced Forward Presence Battle Group in Latvia, with over 700 Canadian troops stationed in Latvia, working with the Latvian Land Forces and our Allies to reinforce NATO’s collective defence in Central and Eastern Europe. Canada has also increased our military presence in Latvia in the face of ongoing Russian aggression against Ukraine, standing shoulder-to-shoulder with our allies along NATO’s Eastern Flank. I have had the pleasure of meeting with some of the Canadian troops on the ground in Latvia on several occasions. Their presence, bravery, and determination are a testament to Canada’s enduring commitments to Latvia and the region.</p>\n\n<p>“Canada will continue to work with Latvia to strengthen our bilateral relationship for the benefit of Canadians and Latvians alike. During my visit to Latvia earlier this year, President Egils Levits and I reaffirmed our countries’ shared commitment to building new partnerships, including through innovation, cultural exchanges, and scientific cooperation. In the spring, I also had the pleasure of hosting the Prime Minister of Latvia, Krišjānis Kariņš, to further strengthen our bilateral relationship and discuss the coordination of our military support to Ukraine, as well as security issues in the broader Baltic region. And through the Canada-European Union Comprehensive Economic and Trade Agreement, we will keep creating good jobs and new opportunities for people on both sides of the Atlantic.</p>\n\n<p>“Today, on behalf of the Government of Canada, I invite all Canadians to recognize the continued contributions of Latvian Canadians to our great country and I offer my best wishes to all those celebrating Latvia’s Independence Day.</p></div>\n      "
}