{
  "path": "/en/news/statements/2020/05/29/statement-prime-minister-international-day-united-nations-peacekeepers",
  "pageTitle": "Statement by the Prime Minister on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of United Nations Peacekeepers:</p>\n\n<p>“Today, we join the international community to recognize the courage, selflessness, and sacrifices of the more than 1 million people who have served as <a href=\"https://peacekeeping.un.org/en/our-peacekeepers\">United Nations (UN) peacekeepers</a> since 1948. We also honour the memory of the thousands who have lost their lives in the cause of peace.</p>\n\n<p>“Whatever their nationalities or cultural backgrounds, UN peacekeepers share a common purpose: to protect those most vulnerable and help countries transition from conflict to peace. Every day, they work tirelessly to provide essential help and give hope to millions of people affected by conflicts. By supporting the empowerment of women and girls, advancing the rule of law, and promoting human rights, UN peacekeepers lay the groundwork for long-term, sustainable peace.</p>\n\n<p>“UN missions are also on the front lines of the global fight against COVID-19. In the Democratic Republic of Congo, the mission is supporting local production of protective masks. In South Sudan, the mission ran a month-long radio campaign in different languages to raise awareness of the virus and help people take steps to limit its spread. In Cyprus, the mission is working with non-governmental organizations to prevent and respond to gender-based violence in communities affected by the disease. Around the world, UN peacekeepers are stepping up their efforts and finding new ways to assist the people they serve.</p>\n\n<p>“As 2020 Chair of the UN Peacebuilding Commission and through its leadership of the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a> and the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>, Canada is doing its part to build more effective and diverse peace operations. We are also investing to strengthen conflict prevention and peacebuilding, and to advance the women, peace, and security agenda. Canada is committed to helping shape the evolution of peacekeeping and to making a positive contribution to international peace and security.</p>\n\n<p>“On behalf of all Canadians, I thank UN peacekeepers for their dedication to building a brighter future and a safer, more prosperous world. There is no greater gift that we can leave our children and grandchildren than true and lasting peace.”</p></div>\n      "
}