{
  "path": "/en/news/readouts/2020/03/14/prime-minister-justin-trudeau-speaks-premier-quebec-francois-legault",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Premier of Quebec, François Legault | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Premier of Quebec François Legault to discuss the evolution of COVID-19.</p>\n\n<p>The two leaders discussed the measures put in place by the governments of Canada and Quebec to protect the health and safety of Quebecers and all Canadians. In particular, they discussed measures taken at borders and airports and ways to work together to support workers and businesses, by providing supports such as Employment Insurance and sickness benefits.</p>\n\n<p>Both leaders reaffirmed their commitment to continued collaboration and coordination between their respective governments in the fight against COVID-19. They also agreed on the importance of reassuring Quebecers and all Canadians that all levels of government are working together to keep people safe.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of Quebecers and all Canadians is the Government’s top priority.</p>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">Government of Canada takes action on COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/13/first-ministers-discuss-collective-efforts-address-impact-covid-19\">First Ministers discuss collective efforts to address the impact of COVID-19</a></li>\n</ul></div>\n      "
}