{
  "path": "/en/news/news-releases/2017/04/03/prime-minister-announces-malala-yousafzai-will-visit-canada-receive",
  "pageTitle": "Prime Minister announces Malala Yousafzai will visit Canada to receive honorary citizenship | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Malala Yousafzai will visit Canada on April 12, 2017, to address the Canadian Parliament and to officially receive the honorary Canadian citizenship bestowed upon her in 2014.</p><p>At 15 years old, Ms. Yousafzai was the target of Taliban assassins after she became an outspoken advocate for the right of girls to learn and to attend school. She has since become an international spokesperson for girls’ education and the rights of women and girls. In recognition of this work, she was named a co-recipient of the 2014 Nobel Peace Prize.</p><p>Prime Minister Trudeau will take this opportunity to meet with Ms. Yousafzai to discuss girls’ empowerment through education and how they can actively contribute to the sustainable development of their communities and countries.</p><h2>Quotes</h2><blockquote><p>“I am pleased to announce Malala Yousafzai’s upcoming visit to Canada. Ms. Yousafzai’s courageous response to those who threatened her life, and her advocacy for girls’ education, has inspired many millions of people around the world. Her story is one of determination and dignity, and Canada is proud to call her an honorary citizen of this great country. I look forward to attending the upcoming ceremony and witnessing the historic moment when she becomes the youngest person to address the Parliament of Canada.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The people of Canada are leading the world in their response to the refugee crisis. I am honoured by Parliament's invitation and look forward to visiting this great nation of heroes.”<br><cite>— Malala Yousafzai</cite></p></blockquote><h2>Quick Facts&nbsp;</h2><ul><li>In October 2014, the Norwegian Nobel Committee selected Malala Yousafzai as a co-recipient of the 2014 Nobel Peace Prize.</li><li>A native of Pakistan, she is the youngest person to win the Nobel Peace Prize.</li><li>On October 21, 2014,&nbsp;the House of Commons&nbsp;unanimously supported bestowing honorary Canadian citizenship upon Ms. Yousafzai,&nbsp;to recognize&nbsp;her bravery in the fight for the rights of women and girls to go to school.&nbsp;</li><li>Ms. Yousafzai is one of just six people to receive honorary Canadian citizenship. The others are Raoul Wallenberg, Nelson Mandela, the 14th Dalai Lama, Aung San Suu Kyi, and the Aga Khan.</li></ul></div>\n      "
}