{
  "path": "/en/news/news-releases/2016/11/02/prime-minister-announces-intention-recommend-appointment-six-new",
  "pageTitle": "Prime Minister announces intention to recommend the appointment of six new Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will recommend, to the Governor General, the appointment of six new, independent Senators to fill vacancies in the Senate for Quebec.</p><p>In doing so, the Government is today taking further concrete steps to follow through on its commitment to improve the appointments process, and to restore public trust in a reformed Senate.</p><p>The individuals being recommended today for appointment to the Senate were chosen using the Government of Canada’s new merit-based process – which is designed to help ensure that the Senate is independent, reflective of Canada’s diversity, and best able to tackle the broad range of challenges and opportunities facing the country.</p><p>Under the new process, the following people are being recommended for appointment to the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Renee_Dupuis\"><strong>Renée Dupuis (Quebec)</strong></a></li><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Eric_Forest\"><strong>Éric Forest (Quebec)</strong></a></li><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Rosa_Galvez\"><strong>Rosa Galvez (Quebec)</strong></a></li><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Marc_Gold\"><strong>Marc Gold (Quebec)</strong></a></li><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Marie_Francoise_Megie\"><strong>Marie-Françoise Mégie (Quebec)</strong></a></li><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes#Raymonde_Saint_Germain\"><strong>Raymonde Saint-Germain (Quebec)</strong></a></li></ul><p>Additional information on the first cycle of the permanent process will be made public when the Independent Advisory Board for Senate Appointments completes its report to the Prime Minister later this year.</p><h2>Quote</h2><blockquote><p>“In keeping with our commitment to Canadians, all vacant Senate seats will soon be filled. Once appointed, these six exceptional candidates from Quebec, together with the other recent nominees, will be able to contribute to a Senate which is reflective of our great country. I would like to thank all Canadians who applied to be members of the Senate, as well as extend my gratitude to the members of the Independent Advisory Board for Senate Appointments for their excellent work.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Under the Canadian Constitution, the Governor General appoints people to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>For the first time ever, the process was opened up to allow Canadians to apply. Following a four-week application period, which generated over 2,700 applications from Canadians across the country, the candidate submissions were reviewed by the Independent Advisory Board for Senate Appointments, which then provided the Prime Minister with non-binding recommendations. From that pool of candidates, the Prime Minister selected the six people he will recommend to the Governor General for appointment to the Senate.</li><li>In making their recommendations, the Independent Advisory Board for Senate Appointments was guided by public, transparent, non-partisan and merit-based criteria to identify highly-qualified people.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators will join their peers in examining and revising legislation, investigating national issues, and representing regional, provincial and minority interests – all important functions in a modern democracy.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2016/11/02/biographical-notes\">Biographical Notes</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.democraticinstitutions.gc.ca/eng/content/frequently-asked-questions-senate-appointments-process-0\">Frequently Asked Questions – Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"/en/news/news-releases/2016/10/31/prime-minister-announces-intention-recommend-appointment-six-new\">Prime Minister announces intention to recommend the appointment of six new Senators</a></li><li><a href=\"/en/news/news-releases/2016/10/27/prime-minister-announces-intention-recommend-appointment-nine-new\">Prime Minister announces intention to recommend the appointment of nine new Senators</a></li><li><a href=\"/en/news/news-releases/2016/03/18/prime-minister-announces-intention-recommend-appointment-seven-new\">Prime Minister announces intention to recommend the appointment of seven new Senators</a></li><li><a href=\"http://www.democraticinstitutions.gc.ca/eng/content/minister-democratic-institutions-announces-launch-permanent-phase-independent-senate\">Minister of Democratic Institutions Announces Launch of the Permanent Phase of the Independent Senate Appointments Process</a></li><li><a href=\"http://www.democraticinstitutions.gc.ca/eng/content/minister-democratic-institutions-announces-establishment-independent-advisory-board-senate\">Minister of Democratic Institutions Announces Establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"http://www.democraticinstitutions.gc.ca/eng/content/government-announces-immediate-senate-reform\">Government Announces Immediate Senate Reform</a></li></ul></div>\n      "
}