{
  "path": "/en/news/statements/2016/12/06/statement-prime-minister-canada-national-day-remembrance-and-action",
  "pageTitle": "Statement by the Prime Minister of Canada on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p>\n<p>“Twenty-seven years ago today, 14 young women were murdered at l'École Polytechnique de Montréal simply because they were women.</p>\n<p>“On this somber anniversary, let us reflect on what Canadians – women, men, and youth – can do to rid the country and the planet of the scourges of misogyny and gender-based violence.</p>\n<p>“The statistics on violence against girls and women are unacceptable. Far too many girls and women, here in Canada and around the world, suffer physical and psychological harm at the hands of others – often people they love and trust.</p>\n<p>“On this day – and every day – we recommit ourselves to finding solutions that help prevent future acts of violence. Men and boys are a vital part of the solution to change attitudes and behaviours that allow for this violence to exist. There must be zero tolerance for violence against women, and only with everyone’s support can we build a Canada that is safe for all.</p>\n<p>“That is why the Government of Canada is investing in several programs, both in Canada and around the world, to help promote gender equality by supporting education and prevention efforts, as well as helping those who have been targeted by gender-based violence. For example, we will continue to grow and maintain Canada’s network of shelters and transition houses, so no one fleeing domestic violence is left without a place to turn.</p>\n<p>“As we mourn today with the families and friends of those bright and talented young women who were victims of that senseless act of hatred, I encourage everyone to think about how their own personal actions matter. Start by joining the conversation online using the hashtag #ActionsMatter. Together we can change minds and stop gender-based violence before it starts.”</p></div>\n      "
}