{
  "path": "/en/news/news-releases/2023/03/17/building-more-homes-faster",
  "pageTitle": "Building more homes, faster | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Right now, in cities across the country, it is too hard to build the housing we need, particularly affordable housing. Housing policies are often barriers to producing results and many Canadians – from young families, to seniors, to newcomers – are finding it harder to find an affordable place to call home. It is clear that we need to accelerate change so the system works for all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, was in Guelph, Ontario today to launch the Housing Accelerator Fund (HAF), a $4&nbsp;billion initiative that will provide funding for local governments to fast track the creation of 100,000 new homes across Canada. Local governments are now invited to develop innovative action plans, in line with the flexible criteria, to remove barriers to building more homes, faster.</p>\n\n<p>The Fund will help cities, towns, and Indigenous governments unlock new housing supply by speeding up development and approvals, like fixing out-of-date permitting systems, introducing zoning reforms to build more density, or incentivizing development close to public transit. Local governments are encouraged to think big and be innovative in their approaches. They could be accelerating project timelines, allowing increased housing density, encouraging affordable housing units, and more. The Fund will provide upfront funding to support implementation, as well as additional funds upon delivering results.</p>\n\n<p>Over the next decade, the Government of Canada aims to double the rate of housing construction to make housing more affordable. Building more housing, including affordable housing, is a key part of making life more affordable and building an economy that works for all Canadians. When we work together across orders of government, we can build a better future for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada has the fastest growing population in the G7, but our housing supply hasn’t kept up with demand. The Housing Accelerator Fund will help local governments cut red tape and backlogs, build the housing we need, and give more people in Canada a safe and affordable place to call home. We will continue to work to make life more affordable and create stronger, more prosperous communities from coast to coast to coast.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<blockquote>\n<p>“The Housing Accelerator Fund is a bold new initiative to address the pressing need for housing in Canada. We recognize that the key to increasing housing affordability is to boost the supply of homes available to Canadians. By partnering with local governments, this fund will enable us to create long-term systemic changes in our housing system and make a tangible impact in increasing housing supply. With this initiative, our government is helping more Canadians access a home that meets their needs and is within their means. This is a significant step toward building more housing faster in our cities and ensuring that everyone has a safe and affordable place to call home.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Housing and Diversity and Inclusion</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The application portal for the Housing Accelerator Fund (HAF) will open this June. Local governments are encouraged to begin preparing their proposed action plans today. A full list of eligible system reforms is available on the website of the Canada Mortgage and Housing Corporation.</li>\n\t<li>The HAF is a $4&nbsp;billion initiative from the Government of Canada that will run until 2026-27. It was announced in Budget&nbsp;2022, along with other initiatives to make housing more affordable and accessible for Canadians, including:\n\t<ul class=\"bulletOutline\"><li>Investing $1.5&nbsp;billion to launch a third round of the Rapid Housing Initiative and create at least 4,500 additional affordable housing units across Canada, with 25 per cent of investments going toward women-focused housing projects;</li>\n\t\t<li>Introducing a new Tax-Free First Home Savings Account to allow Canadians to save up to $40,000 tax-free to help buy their first home;</li>\n\t\t<li>Doubling the First-Time Home Buyers’ Tax Credit to provide up to $1,500 in direct support to home buyers to offset closing costs involved in buying a first home;</li>\n\t\t<li>Launching a $200&nbsp;million stream under the Affordable Housing Innovation Fund to develop and scale up rent-to-own projects.</li>\n\t</ul></li>\n\t<li>To guide the design and mechanism of the HAF, the federal government sought Canadians’ input and consulted stakeholders throughout 2022. Engagements with Indigenous communities and organizations are ongoing.</li>\n\t<li>Local governments interested in applying for the HAF will need to meet program requirements and submit an action plan as part of their application. The action plan must detail the local government’s commitment to a housing supply growth target; alignment to federal priorities of creating dense, affordable, inclusive, and diverse communities; and initiatives they plan to undertake to increase and speed up the supply of housing in their communities. In the absence of municipal level authority, a regional district, province or territory may also apply to the HAF. Support may also be provided to jurisdictions that request assistance due to capacity issues.</li>\n\t<li>The Government of Canada will negotiate an agreement with Quebec to ensure municipalities in the province can access the program while respecting the province’s laws.</li>\n\t<li>The HAF is part of a larger suite of measures from the federal government to support the creation of housing through Canada’s National Housing Strategy (NHS), an $82+ billion plan that has already committed to the creation and repair of over 400,000 units. Progress on programs and initiatives under the NHS are updated quarterly at <a href=\"http://www.placetocallhome.ca\">www.placetocallhome.ca</a>. The <a href=\"https://www.placetocallhome.ca/en/housing-funding-initiatives-map\">Housing Funding Initiatives Map</a>&nbsp;shows affordable housing projects that have been developed through the NHS.</li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/housing-accelerator-fund/housing-accelerator-fund-backgrounder\">Housing Accelerator Fund –&nbsp;Building more homes, faster</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/housing-accelerator-fund\">Housing Accelerator Fund</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/20/making-housing-more-affordable-canadians\">Making housing more affordable for Canadians</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/en/housing-funding-initiatives-map\">Housing Funding Initiatives Map</a></li>\n</ul><p>&nbsp;</p></div>\n      "
}