{
  "path": "/en/news/statements/2020/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p>\n\n<p>“On December 6, 1989, 14 young women were murdered at the École Polytechnique de Montréal in a tragic and senseless act of violence. Their lives were unfairly and cruelly cut short, just because they were women. On this <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/remembrance-commemoration-en.html\">National Day of Remembrance and Action on Violence Against Women</a><a name=\"_Hlt56772984\" id=\"_Hlt56772984\"></a><a name=\"_Hlt56772985\" id=\"_Hlt56772985\"></a>, we mourn the loss of these daughters, sisters, and friends who had such promising lives ahead of them.</p>\n\n<p>“The safety of women must be the foundation of any society. Yet still today, too many women, girls, and people of diverse gender identities and expressions face violence and discrimination in Canada and around the world. We still have a lot of work to do to ensure that they can live without injustice, without misogyny, and without fear. That is why today is part of the <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism against Gender-Based Violence</a><a name=\"_Hlt56773007\" id=\"_Hlt56773007\"></a><a name=\"_Hlt56773006\" id=\"_Hlt56773006\"></a><a name=\"_Hlt57134751\" id=\"_Hlt57134751\"></a><a name=\"_Hlt57134750\" id=\"_Hlt57134750\"></a>, encouraging us to reflect and take concrete action to prevent, denounce, and eliminate violence against women.</p>\n\n<p>“Gender-based violence has no place in our communities or our country, and the Government of Canada is continuing to implement a national action plan to address it. This plan must ensure that survivors, their families, and all those who face gender-based violence have reliable and timely access to protection, support services, and justice. The government also continues to collaborate closely with its partners to develop a national action plan to address the national tragedy of missing and murdered Indigenous women, girls, two-spirit, and LGBTQ people.</p>\n\n<p>“From the École Polytechnique to Portapique, firearms have caused too many tragedies and deaths. This year, we banned over 1,500 models and variants of assault-style firearms and some of their components, including the weapon used at the École Polytechnique. We will also soon introduce legislation to implement the remaining parts of our commitment to protect Canadians from gun violence. In addition, the government is accelerating investments in shelters and transition houses to help women and children who are fleeing violence. In response to the global COVID-19 pandemic, we have invested $100 million in emergency funding to help organizations that provide support and services to people experiencing gender-based violence.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join the families and loved ones of the victims in honour of their memory.&nbsp;We all have a role to play in creating a culture of respect, defending women’s rights, and ending gender-based violence. Together, we can build a Canada that is safer, fairer, and more equal.”</p></div>\n      "
}