{
  "path": "/en/news/statements/2020/03/16/g7-leaders-statement",
  "pageTitle": "G7 Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Leaders of the Group of Seven, acknowledge that the COVID-19 pandemic is a human tragedy and a global health crisis, which also poses major risks for the world economy.&nbsp; We are committed to doing whatever is necessary to ensure a strong global response through closer cooperation and enhanced coordination of our efforts.&nbsp; While current challenges may require national emergency measures, we remain committed to the stability of the global economy.&nbsp; We express our conviction that current challenges related to the COVID-19 pandemic need a strongly coordinated international approach, based on science and evidence, consistent with our democratic values, and utilizing the strengths of private enterprise.</p>\n\n<p>We are committed to marshalling the full power of our governments to:</p>\n\n<ul>\n\t<li>Coordinate on necessary public health measures to protect people at risk from COVID-19;</li>\n\t<li>Restore confidence, growth, and protect jobs;</li>\n\t<li>Support global trade and investment;</li>\n\t<li>Encourage science, research, and technology cooperation.</li>\n</ul>\n\n<p>By acting together, we will work to resolve the health and economic risks caused by the COVID-19 pandemic and set the stage for a strong recovery of strong, sustainable economic growth and prosperity.</p>\n\n<p><strong>Accelerate Our Response to COVID-19</strong></p>\n\n<p>We will work hard to protect the health and safety of everyone in our countries.&nbsp; Stepping up the response to the outbreak remains our foremost priority.&nbsp; We will coordinate our efforts to delay the spread of the virus, including through appropriate border management measures.</p>\n\n<p>We will enhance our efforts to strengthen health systems in our countries and globally.&nbsp; We fully support the WHO in its global mandate to lead on disease outbreaks and emergencies with health consequences, leaving no geographical vacuum, and encourage all countries, international organizations, and the private sector to assist global efforts such as the Global Preparedness and Response Plan.</p>\n\n<p>We stress the value of real-time information sharing to ensure access to the best and latest intelligence, improving prevention strategies and mitigation measures.</p>\n\n<p>We will pool epidemiologic and other data to better understand and fight the virus.</p>\n\n<p>We will increase coordinated research efforts, including through voluntary support for the global alliance Coalition for Epidemic Preparedness and Innovation.&nbsp; We will support the launch of joint research projects funded by both public and private resources, and the sharing of facilities, towards rapid development, manufacture and distribution of treatments and a vaccine, adhering to the principles of efficacy, safety, and accessibility.</p>\n\n<p>We will make efforts to increase the availability of medical equipment where it is most needed.</p>\n\n<p>We will coordinate with online platforms to maximize public access to the latest correct and relevant official information, in recognition that millions of citizens receive information and news via social media.</p>\n\n<p>To implement these objectives, and adapt measures if necessary, will require efforts across all parts of our governments, and we ask our health ministers to continue to coordinate on a weekly basis.</p>\n\n<p><strong>Forcefully Address the Economic Impact of the Outbreak</strong></p>\n\n<p>We resolve to coordinate measures and do whatever it takes, using all policy tools, to achieve strong growth in the G7 economies, and to safeguard against downside risks.&nbsp;</p>\n\n<p>To this end, we are mobilizing the full range of instruments, including monetary and fiscal measures, as well as targeted actions, to support immediately and as much as necessary the workers, companies and sectors most affected.&nbsp; This is particularly important for small and medium businesses and working families.</p>\n\n<p>We also ask our central banks to continue to coordinate to provide the necessary monetary measures in order to support economic and financial stability, and to promote recovery and growth.</p>\n\n<p>We ask our finance ministers to coordinate on a weekly basis on the implementation of those measures and to develop further timely and effective actions.</p>\n\n<p>We reinforce the importance of coordination among international organizations even in the face of challenges to business continuity. We call on the IMF and the World Bank Group and other International Organizations to further support countries worldwide as part of a coordinated global response, focused on this specific challenge.&nbsp; We also ask our finance ministers to work closely with International Organizations to design and implement swiftly the international financial assistance that is appropriate to help countries, including emerging and developing economies, face the health and economic shock of COVID-19.</p>\n\n<p>We will address disturbances to international supply chains and continue our work to facilitate international trade.</p>\n\n<p><strong>Restore and Expand Growth </strong></p>\n\n<p>We will continue to work together with resolve to implement these measures to respond to this global emergency.&nbsp; In facing the economic challenge, we are determined not only to restore the level of growth anticipated before the COVID-19 pandemic but also to build the foundation for stronger future growth.&nbsp; We will continue to coordinate through the G7 Presidency including at the G7 Leaders’ Summit and call upon the G20 to support and amplify these efforts.</p></div>\n      "
}