{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-meets-prime-minister-antigua-and-barbuda",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Prime Minister of Antigua and Barbuda Gaston Browne | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with the Prime Minister of Antigua and Barbuda, Gaston Browne, on the margins of the Commonwealth Heads of Government Meeting.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Browne agreed to work together to advance shared priorities in response to the many crises facing the world.</p>\n\n<p>The two leaders discussed Russia’s illegal invasion of Ukraine, which Prime Minister Trudeau condemned as an affront to the fundamental principles of sovereignty, territorial integrity, and international law. They agreed on the need for Commonwealth countries to work together to defend democracy, peace and security, and human rights.</p>\n\n<p>Recognizing the invasion is undermining access to food and energy across the Commonwealth, the prime ministers agreed to work together to improve food security, tackle climate change, create opportunities for youth, and make life better and more affordable for people around the world.</p>\n\n<p>The leaders underscored their shared commitment to the core values that bring the countries of the Commonwealth together: free and democratic societies and the promotion of peace and prosperity to improve the lives of all people. They spoke at length about the importance of strong leadership, modernization, and renewal of this important institution.</p>\n\n<p>They also discussed economic recovery in the Caribbean, including through improved access to sustainable financing. Prime Minister Trudeau emphasized the importance of global ambition on climate action as key to ensuring the present and future resilience of the world’s small island states.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/antigua_barbuda/index.aspx?lang=eng\">Canada and Antigua and Barbuda</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}