{
  "path": "/en/news/news-releases/2021/12/13/10-day-child-care-families-new-brunswick",
  "pageTitle": "$10-a-day child care for families in New Brunswick | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every child deserves the best possible start in life, and all parents should have the ability to build both a family and career. Yet, too many families across Canada lack access to affordable, inclusive, and high-quality child care. The COVID-19 pandemic has also made it clear that without access to child care, too many parents – especially women – cannot fully participate in the workforce.</p>\n\n<p>That is why the Government of Canada has laid out a plan to provide Canadian parents with, on average, $10‑a‑day child care spaces for children under six years old. This plan to build a Canada‑wide, community‑based early learning and child care system will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of New Brunswick, Blaine Higgs, today announced an agreement that will support an average of $10‑a‑day child care in the province, significantly reducing the price of child care for families. Through the agreement, the governments of Canada and New Brunswick will work together to improve access to high-quality, affordable, flexible, and inclusive early learning and child care programs and services. This includes creating 3,400 new licensed early learning and child care spaces by the end of March&nbsp;2026. With federal funding of almost $492&nbsp;million over the next five years, New Brunswick will also see a 50 per cent reduction in average parent fees for children under the age of six in regulated child care by the end of 2022.</p>\n\n<p>This agreement will fund critical services, and grow a strong and skilled workforce of early childhood educators, including through the creation of a wage grid and greater opportunities for professional development. The agreement will also support an early learning and child care system that is fully inclusive of children with disabilities and children needing enhanced or individual supports, and ensures all families have equitable access to high-quality, affordable early learning and child care.</p>\n\n<p>The agreement also includes a clear commitment to work collaboratively with First Nations organizations and communities to better understand their needs and establish a plan for early learning and child care services for Indigenous children.</p>\n\n<p>Since 2015, the government has been helping make life more affordable for families. This includes programs like the Canada Child Benefit (CCB), which is increased annually to help families keep up with the costs of living and raising their children. The CCB puts more money into the pockets of nine out of 10 Canadian families with children and has helped lift 435,000 children out of poverty. The time for a Canada-wide early learning and child care system is now. The Government of Canada will continue to work with provinces, territories, and Indigenous partners across the country to make life easier and more affordable for families, grow the middle class, create jobs, help parents return to the workforce, and give children across the country a better start in life.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to affordable child care. That is why we’re making $10‑a‑day child care a reality across the country. Today’s agreement with New Brunswick is an important step forward to delivering on our Canada-wide early learning and child care system, which will create jobs, grow the middle class, and give our kids the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, we’re signing an agreement that works for New Brunswick’s families and early childhood sector. We are helping families find more affordable, quality, and inclusive child care, but we’re also able to help support small businesses and build on successful programs that have increased the quality of learning in facilities.”</p>\n\n<footer class=\"default\">The Hon. Blaine Higgs, Premier of New Brunswick</footer>\n</blockquote>\n\n<blockquote>\n<p>“Affordable, high-quality child care is both an economic and a social policy. It gives our children the best possible start in life and allows both mothers and fathers to work, which increases our workforce and grows the economy. Fee reductions this coming year and the eventual average of $10 a day will deliver thousands of dollars of savings to New Brunswick families with young children. This agreement with the Government of New Brunswick helps families afford the cost of living and strengthens our plan to ensure Canada has a strong recovery that leaves no one behind.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know parents are working hard to support their families and need access to child care that meets their needs. Our vision and objectives for early learning and child care are quite simple: reduce child care fees, create more spaces, ensure equitable access for all children, and grow a strong and skilled early childhood educator workforce. Today’s historic agreement with New Brunswick is another important step on the path to ensuring all families have access to high-quality, affordable, flexible, and inclusive early learning and child care.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“This agreement will give thousands of New Brunswick children a head start. They’ll learn to play, and learn to learn, guided by skilled and passionate educators. When we say the early years are the most important: this agreement shows a commitment to that fact. This agreement will change lives.”</p>\n\n<footer class=\"default\">The Hon. Dominic Cardy, New Brunswick’s Minister of Education and Early Childhood Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“This announcement is good news for families in every corner of New Brunswick. Starting next year, they will see their child care costs go down significantly as a result of this agreement. We worked with our provincial counterparts to ensure this agreement supports high-quality, affordable, and accessible child care to give our children the best start in life.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Earlier this year, the Government of Canada reached similar agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>, and <a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta\">Alberta</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> to strengthen the early learning and child care system in the province.</li>\n\t<li>New Brunswick will create 3,400 new child care spaces within its early learning facility designation system by the end of March&nbsp;2026, including 500 spaces by March&nbsp;2023.</li>\n\t<li>In addition to the federal contribution, New Brunswick will contribute an additional $53 million over the course of the agreement, which builds on the province’s current investments of $70&nbsp;million in early learning and child care annually.</li>\n\t<li>The governments of Canada and New Brunswick will create an Implementation Committee that will monitor progress on child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>Budget&nbsp;2021 provides new investments to build a high-quality, affordable, flexible, and inclusive early learning and child care system across Canada. These investments total up to $30&nbsp;billion over five years, and combined with previous investments announced since 2015, $9.2&nbsp;billion every year, permanently.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 12,600 spaces in New Brunswick.</li>\n\t<li>Investments in child care will benefit all Canadians. Studies show that for every dollar invested&nbsp;in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n\t<li>To promote greater gender equality at home and in the workplace, the Government of Canada has also introduced the Parental Sharing Benefit in 2019. This new measure provides an additional five weeks of Employment Insurance parental benefits when parents – including adoptive and same-sex parents – agree to share parental benefits.</li>\n\t<li>In addition to these investments, the Government of Canada is directly supporting parents, no matter how they choose to care for their children, through the Canada Child Benefit.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada child benefit</a></li>\n</ul></div>\n      "
}