{
  "path": "/en/news/news-releases/2017/11/15/canada-bolsters-peacekeeping-and-civilian-protection-measures",
  "pageTitle": "Canada bolsters peacekeeping and civilian protection measures | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For decades, peacekeeping has helped provide protection to millions of vulnerable people affected by conflicts. However, the context for modern peace operations has changed. Today’s conflicts are intractable, more dangerous, and more complex. Given this new reality, we need to find new solutions. Canada is advancing innovative approaches to enhancing the protection of children, increasing the participation of women in peace operations, and providing the specialized capacities that the UN needs to deliver on their mandates.</p><p>That is why today at the 2017 UN Peacekeeping Defence Ministerial, the Prime Minister, Justin Trudeau, announced the launch of the <i>Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers.</i> This initiative, created in partnership with retired General Romeo Dallaire, will identify early warning signs, take action to end recruitment, and promote the reporting of abuses and grave violations against children.</p><p>During the Summit, the Prime Minister also announced the <i>Elsie Initiative on Women in Peace Operations. </i>Through this, Canada and partner nations will provide assistance and incentives to increase the proportion of women deployed in UN peace operations. Studies have demonstrated a strong link between women’s involvement in peace operations and the achievement of long-term, sustainable peace.</p><p>Finally, Canada announced that it will also make a range of specialized military capabilities available to the UN. These smart pledges include a Quick Reaction Force that includes approximately 200 troops and accompanying equipment; an Aviation Task Force of armed helicopters; and tactical airlift support to address critical gaps in the UN’s ability to transport troops, equipment, and supplies to their missions.</p><p>In addition to military capabilities, Canada will also develop and implement innovative new training programs designed to enhance the overall effectiveness of UN operations. This will include the establishment of a Canadian Training and Advisory Team to work with a partner nation before and during its deployments to peace operations, as well as contributions to UN centres, schools, and mobile training teams.</p><p>Moving forward, Canada will continue to work with the UN – as well as potential partner and host nations – to identify locations where Canada’s military capabilities can fill key gaps and bring the most value to UN peace support operations.</p><h2>Quote</h2><blockquote><p>“The nature of conflict has changed. So too have the demands of peace operations. Discrete offerings and one-off commitments have gotten us this far, but we won’t be able to deliver true, transformative change without a real institutional change. Canada is prepared to help lead that charge. To rethink how we engage, not just where we engage. To close the institutional gaps that prevent us from being even more effective agents of peace in a world that sorely needs it. That’s how we’ll protect the world’s children, empower women and girls, and build a more peaceful and a more prosperous world.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The 2017 UN Peacekeeping Defence Ministerial brings together&nbsp;over 500 delegates from 80 countries and five international organizations to improve peacekeeping. The conference – the fourth in a series of high-level UN peacekeeping conferences – has become an important part of the international community’s efforts to support UN peacekeeping operations.&nbsp;</li><li>Canada is taking a comprehensive approach to peacekeeping that draws from civilian, police, and military resources, with protection of civilians as a core concern.</li><li>Canada’s engagement in peace operations is centred on four core elements:<ul><li>providing Canadian personnel and training for UN peacekeeping missions;</li><li>strengthening Canadian support for conflict prevention, mediation, and peacebuilding efforts;</li><li>advancing the role of women in the promotion of peace and security; and,</li><li>supporting UN reform efforts to make peace operations more effective.</li></ul></li><li>In November 2017, Canada launched its National Action Plan for the Implementation of the United Nations Security Council Resolutions on Women, Peace and Security 2017-2022. The action plan outlines a whole-of-government approach to implement this important agenda and ensures our activities in fragile and conflict-affected states align with broader commitments on gender equality, respect, and empowerment of women and girls. This is Canada’s second action plan, which builds on the first that was put in place from 2011-2016.</li><li>The Vancouver Principles build on a 2017 Joint Doctrine Note on Child Soldiers developed by the Canadian Armed Forces. They have been inspired in part by the Paris Principles and Guidelines on Children Associated with Armed Forces or Armed Groups.</li></ul><h2>Related Products</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/15/canadian-contributions-united-nations-peace-support-operations\">Canadian contributions to United Nations peace support operations</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/15/canadian-police-support-international-peace-operations-and-missions\">Canadian police support for international peace operations and missions</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/15/elsie-initiative-women-peace-operations\">The Elsie Initiative on Women in Peace Operations</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/15/women-peace-and-security\">Women, peace and security</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/psop.aspx?lang=eng&amp;_ga=2.4921907.1095575966.1510688093-526198145.1494258314\">The Peace and Stabilization Operations Program</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng&amp;_ga=2.228830428.1903829476.1510082977-192648234.1473179889\">Canada’s Feminist International Assistance Policy</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_sexes/cnap_ip-pi_pnac-17-22.aspx?lang=eng\">Canada’s National Action Plan on Women, Peace and Security</a></li></ul></div>\n      "
}