{
  "path": "/en/news/news-releases/2019/08/07/prime-minister-announces-appointment-honourable-nicholas-kasirer",
  "pageTitle": "Prime Minister announces appointment of the Honourable Nicholas Kasirer to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Nicholas Kasirer to the Supreme Court of Canada, effective September 16, 2019.</p>\n\n<p>Justice Kasirer has led an exceptional career as a judge and professor, earning the esteem of his peers in Canada and around the world.</p>\n\n<p>He served for a decade as a judge on the Court of Appeal of Quebec, to which he was appointed in 2009. Prior to that, he spent twenty years as a professor of law at McGill University, where he also served as Dean of Law from 2003 to 2009. A former law clerk for the Honourable Jean Beetz of the Supreme Court of Canada, Justice Kasirer is perfectly bilingual.</p>\n\n<p>This appointment is the third under the Supreme Court appointment process launched by the Government of Canada in 2016. Through this process, an independent and non-partisan advisory board is tasked with identifying candidates.</p>\n\n<p>Justice Kasirer will fill the vacancy created by the upcoming retirement of Justice&nbsp;Clément Gascon. In the case of Quebec seats, an advisory board is created that reflects Quebec’s unique legal tradition and ensures greater participation by its government in the selection process for judges from the province.</p>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/07/10/honourable-nicholas-kasirer\">The Honourable Nicholas Kasirer</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.fja.gc.ca/scc-csc/2019/nominee-candidat-eng.html\">Candidate questionnaire filled out by Nicholas Kasirer</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2019/07/10/prime-minister-announces-nomination-honourable-nicholas-kasirer\">Prime Minister announces the nomination of the Honourable Nicholas Kasirer to the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/15/prime-minister-announces-advisory-board-select-next-supreme-court-justice\">Prime Minister announces advisory board to select the next Supreme Court justice</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2019/index-eng.html\">Supreme Court of Canada appointments</a></li>\n\t<li><a href=\"https://www.fja.gc.ca/scc-csc/2019/questions-eng.html\">Frequently Asked Questions</a></li>\n\t<li><a href=\"https://fja-cmf.gc.ca/scc-csc/2019/qualifications-eng.html\">Qualifications and assessment criteria</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/15/arrangement-concerning-appointment-process-fill-seat-will-be-left-vacant-supreme\">Arrangement concerning the appointment process to fill the seat that will be left vacant on the Supreme Court of Canada following the departure of Justice Clément Gascon</a> (Memorandum of Understanding)</li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}