{
  "path": "/en/news/readouts/2020/11/26/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the twenty-second call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>First Ministers discussed the continued rise in COVID-19 cases across the country. As the holiday season is fast approaching, they discussed limiting non-essential travel to help reduce interprovincial and interterritorial transmission of cases, and agreed on the need to encourage Canadians not to travel abroad. First Ministers also expressed their support for addressing the recent challenges Nunavut has faced in relation to COVID-19, and Premier Savikataaq thanked the Prime Minister for the financial support announced yesterday. The Prime Minister also outlined federal supports that are available to people and businesses across the country, such as the newly launched Canada Emergency Rent Subsidy and the new Lockdown Support, to help them through restrictions initiated by local jurisdictions.</p>\n\n<p>First Ministers also agreed on the importance of working together to ensure Canadians have timely and broad access to vaccines once they are available. The Prime Minister highlighted that Canada is in a good position to fight the virus and protect Canadians thanks to its agreements with seven vaccine companies, and has secured access to the highest number of doses per capita of any country. Premiers discussed the importance of working in partnership with the federal government on getting vaccines to vulnerable people&nbsp;and Indigenous communities. Minister LeBlanc updated premiers on the ongoing work by the federal government alongside provincial and territorial officials to ensure Canadians receive vaccines as soon as they are available, and discussed the procurement strategy, the regulatory process, and work underway to prepare for delivery and distribution of vaccines.</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, in order to minimize the impacts of an increase in cases and support economic recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2020/11/government-of-canada-is-providing-immediate-assistance-to-territorial-government-communities-and-inuit-partners-in-nunavut-to-address-the-covid-19-.html\">Government of Canada is providing immediate assistance to Territorial government, communities and Inuit partners in Nunavut to address the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/23/prime-minister-announces-funding-advance-development-canadian-covid\">Prime Minister announces funding to advance the development of Canadian COVID-19 vaccine technologies</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/25/new-agreements-secure-additional-vaccine-candidates-covid-19\">New agreements to secure additional vaccine candidates for COVID-19</a></li>\n</ul></div>\n      "
}