{
  "path": "/en/news/readouts/2020/03/26/prime-minister-justin-trudeau-speaks-president-south-korea-moon-jae",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of South Korea Moon Jae-in | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of South Korea, Moon Jae-in, to discuss recent developments in the COVID‑19 pandemic.</p>\n\n<p>Prime Minister Trudeau voiced support for South Korea, one of the first countries hit with a major outbreak of the virus. He commended President Moon and the Korean people for their steadfast and diligent campaign against COVID-19, which has resulted in several weeks of fewer and fewer new cases.</p>\n\n<p>Prime Minister Trudeau and President Moon shared their commitment to take decisive action to combat the pandemic. They spoke of the need to have a strong, science based medical response, and exchanged views on national measures each country has used to prevent the spread of the virus, and protect and health and safety of their citizens. They agreed on the urgent priority of vaccine development and treatments. &nbsp;They also discussed vital strategies to support their respective national economies.</p>\n\n<p>The two leaders emphasized the critical importance of international coordination on COVID-19&nbsp;prevention and containment strategies while also mitigating the impact on the global economy. &nbsp;They&nbsp;agreed on the importance of sharing health research and scientific data with the international community so that all countries could learn from the experiences of others. &nbsp;Both leaders also spoke of the need to act collectively to support countries with weaker health, financial and economic systems. &nbsp;They looked forward to discussing these issues in the G20 context.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/21/prime-minister-announces-efforts-bring-canadians-home-abroad\">Prime Minister announces efforts to bring Canadians home from abroad</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}