{
  "path": "/en/news/news-releases/2019/03/26/budget-2019-investments-help-canadians-find-and-keep-good-jobs",
  "pageTitle": "Budget 2019 investments to help Canadians find and keep good jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As the nature of work changes, Canadians want to build their skills and learn new ones, so they can enjoy greater job security and build a better future for themselves and their families. The Government of Canada is working to make it easier for Canadian students and workers of all ages to find and keep good jobs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Winnipeg, Manitoba to highlight how Budget 2019 will help Manitobans – and all Canadians – succeed in a rapidly changing job market and an increasingly competitive global economy.</p>\n\n<p>Introduced in Budget 2019, the new Canada Training Benefit will help workers gain the skills they need. Thanks to the new Benefit, workers will be able to take four weeks off every four years to pursue training to improve their skills or learn new ones. The Benefit will provide a credit to help workers pay for training, as well as up to four weeks of income support through a new Employment Insurance Training Support Benefit. The government will also consult with provinces and territories on changes to labour laws to help make sure jobs are protected, so that workers can take the time they need to keep their skills up to date and in-demand.</p>\n\n<p>Through Budget 2019, the government is also helping more young Canadians pursue the careers of their choice, by enhancing support for apprenticeships and making post-secondary education more affordable. New measures will support post-secondary education for First Nations, Inuit, and Métis Nation students, so they can gain the skills they need to succeed.</p>\n\n<p>With new investments in student work placements, Budget 2019 is a significant step towards making sure there is a work placement for every student who wants one. Young Canadians will also benefit from support for service experiences through the Canada Service Corps, and opportunities to work or study abroad, giving them an advantage in our global economy.</p>\n\n<p>Canadians are among the most skilled and highly educated workers in the world. With this year’s budget, the Government of Canada is making sure Canadians can keep developing their skills throughout their working lives, so they can build good careers and benefit from Canada’s growing economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“People in Winnipeg and across Canada want the education, skills, and experience they need to succeed in today’s changing global economy. Through Budget 2019, we are making smart investments in Canadians, and giving students and workers the support they need to find and keep good jobs, and build a better future for themselves and their families.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canada Training Benefit is about giving workers the two things they need most to upgrade their skills: time and money. These measures will help Canadians find and keep good, well-paying jobs and ensure everyone has a fair chance at success – not just for today but for the future of work in Canada.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Employment, Workforce Development and Labour</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul type=\"disc\">\n\t<li>The Organisation for Economic Co-operation and Development estimates that one in ten Canadian jobs are at high risk of automation, with about one in three jobs likely to experience significant change as a result of automation.</li>\n\t<li>The Government of Canada makes significant investments in skills development – close to $7.5 billion annually. More than $3 billion of this programming is delivered in partnership with the provinces, territories and Indigenous groups, and targets students and Canadians who are unemployed.</li>\n\t<li>Introduced in Budget 2019, the Canada Training Benefit includes a new tax credit that will provide working Canadians between 25 and 64 with up to $5,000 over their career to pay for up to 50 per cent of their training fees.</li>\n\t<li>The government is also lowering interest rates on Canada Student Loans and Canada Apprentice Loans, and eliminating interest charges entirely during the six-month grace period. Together, these measures will save the average borrower approximately $2,000 over the lifetime of their loan and help make paying back student loans more affordable.</li>\n\t<li>Budget 2019 investments will also create up to 84,000 new student work placements per year by 2023-2024 for young people to learn new skills, build their resumes, and help them start their careers.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul type=\"disc\">\n\t<li><a href=\"https://budget.gc.ca/2019/docs/plan/toc-tdm-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://budget.gc.ca/2019/docs/themes/good-jobs-de-bons-emplois-en.html\">The Canada Training Benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html\">Canada Service Corps</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/youth-jeunes/youth-jeunes-en.pdf\">Investing in Young Canadians</a></li>\n</ul></div>\n      "
}