{
  "path": "/en/news/news-releases/2019/12/04/prime-minister-concludes-productive-nato-leaders-meeting",
  "pageTitle": "Prime Minister concludes productive NATO Leaders Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the NATO Leaders Meeting in London, United Kingdom. Over the last two days, Prime Minister Trudeau met with Allies to mark the 70th anniversary of the Alliance and discuss shared priorities.</p>\n\n<p>During the meeting, Prime Minister Trudeau reiterated Canada’s unwavering commitment to NATO and its values, and highlighted the significant ways in which Canada strengthens the Alliance. The Prime Minister announced that Canada is expanding its commitment to the NATO Readiness Initiative by increasing our contribution by 6 fighter aircraft and a frigate at the Secretary-General’s request. This brings our total commitment to 12 CF-18s, an expeditionary air task force, a maritime patrol aircraft, three frigates, a submarine, a mechanized infantry battalion, a mobile hospital, and a platoon for chemical, biological, radiological and nuclear decontamination. This contribution is another demonstration of Canada’s strong support for NATO and for the collective security of the Alliance.</p>\n\n<p>Today, Prime Minister Trudeau joined Allies in agreeing to the London Declaration, reaffirming the solidarity, unity, and cohesion of the Alliance. Prime Minister Trudeau also had bilateral meetings with President Trump of the United States, President Levits of Latvia, Prime Minister Rutte of the Netherlands, Prime Minister Solberg of Norway, and Prime Minister Sánchez of Spain.</p>\n\n<p>The Leaders Meeting was an opportunity to discuss enhancing the Alliance’s agility and effectiveness, including NATO space policy, the renewal of NATO’s counter-terrorism action plan, and working to address emerging and future threats. Leaders endorsed NATO’s first-ever policy to prevent and respond to sexual exploitation and abuse, in which Canada played a significant role.</p>\n\n<p>While in London, the Prime Minister attended a reception given by Her Majesty Queen Elizabeth II, followed by a dinner hosted by the Prime Minister of the United Kingdom and Northern Ireland, Boris Johnson. Prime Minister Trudeau also had a private audience with Her Majesty at Buckingham Palace, and met with His Royal Highness, The Prince of Wales.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For 70 years, NATO has been fundamental to Canada’s security and defence, and we remain committed to this Alliance. In recent years, Canada has strengthened its engagement in NATO, taking on vital leadership roles. Today, Canada is leading NATO missions in Latvia, Iraq, and NATO maritime forces in the Mediterranean Sea and the Black Sea, and advancing the Women, Peace and Security agenda. Canada will continue to pull our weight within NATO, as we work together to keep Canadians safe and build a more peaceful and stable world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>All 29 nations endorsed the London Declaration reaffirming their commitment to the Alliance’s collective freedoms, values, and security.</li>\n\t<li>Prime Minister Trudeau participated in an armchair discussion with Prime Minister Mark Rutte of the Netherlands during the NATO Engages event, to discuss the future and importance of the Alliance.</li>\n\t<li>Currently, Canada is leading NATO’s enhanced Forward Presence Battle Group in Latvia, commanding NATO Mission Iraq for a second year, and commanding Standing NATO Maritime Group 2.</li>\n\t<li>Canada also contributes to trans-Atlantic security by providing support for Ukraine’s security and stability, primarily through Operation UNIFIER.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nato.int/\">North Atlantic Treaty Organization (NATO)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and NATO</a></li>\n\t<li><a href=\"https://jfcnaples.nato.int/nmi/news-room/news/2019/nato-mission-iraq-welcomes-a-new-commander\">NATO Mission Iraq welcomes a new Canadian Commander</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/official_texts_171584.htm?selectedLocale=en\">London Declaration</a></li>\n</ul></div>\n      "
}