{
  "path": "/en/news/news-releases/2018/11/15/strengthening-canada-singapore-commercial-relationship",
  "pageTitle": "Strengthening the Canada-Singapore commercial relationship | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>On the margins of the ASEAN Meeting, the Prime Minister took the opportunity to meet with companies in the region in order to draw attention to -- and encourage new investments in -- Canada.&nbsp;</p><p>The Prime Minister also made a focus of his visit to meet with and learn how to best support Canadian companies expanding their operations in the region.&nbsp;</p><p>Whether attracting international investment or helping open markets for Canadian businesses, creating jobs and growing the economy remained at the core of these conversations.</p><p>While in Singapore, the Prime Minister sat down with several global business leaders in bilateral meetings and as part of a financial roundtable discussion hosted by investment company Temasek. He promoted Canada as one of the best places to invest, and encouraged continued co-operation to deepen Canada’s trade and investment relationship with Singapore, ASEAN, and Asia.</p><p>The Prime Minister met with senior leadership from the following companies:</p><ul><li><b>Agrocorp</b>: One of the world’s leading buyers of pulses and the first company to use Canada’s Global Skills Strategy visa program, Agrocorp today announced plans to invest $5 million in a new protein plant in Saskatchewan.</li></ul><ul><li><b>CapitaLand</b>: One of Asia’s largest real estate companies with a global portfolio that includes integrated developments, shopping malls, serviced residences, offices, homes, real estate investment trusts and funds. CapitaLand is headquartered in Singapore.</li></ul><ul><li><b>DBS Bank</b>: Among the largest banks in Asia, DBS Bank has strong business ties with Canadian financial institutions and offers Canadian-backed insurance products to their clients in East Asia.</li></ul><ul><li><b>GIC: </b>Singapore’s largest sovereign wealth fund and among the largest sovereign wealth funds in the world, GIC has co-invested with Canadian pension funds and invested in Canadian artificial intelligence companies.</li></ul><ul><li><b>JTC Corporation: </b>A real estate company based in Jurong, Singapore, that also offers industrial land, gardens and parks, factories, office space and housing.</li></ul><ul><li><b>Keppel Corporation: </b>One of Singapore’s largest conglomerates, Keppel Corporation’s subsidiaries include the world’s largest oil rig builder and several other offshore and marine, property, and infrastructure businesses. They are working with Export Development Canada (EDC) to promote the use of Canadian products in the company’s supply chain.</li></ul><ul><li><b>Mapletree Investments: </b>A real estate development, investment, and capital management company headquartered in Singapore, Mapletree Investments manages over $40 billion in global assets, including Canadian real estate.</li></ul><ul><li><b>Olam International: </b>The third largest agri-business in the world, Olam International operates in 70 countries and supplies sustainable agricultural and food products to tens of thousands of customers.</li></ul><ul><li><b>Pavilion Energy: </b>A major Singaporean energy company, Pavilion Energy supplies one-third of Singapore’s power and is a leading provider of clean energy and LNG.</li></ul><ul><li><b>PSA: </b>One of the world’s largest port operators, PSA recently made significant investments in British Columbia’s trade and transportation infrastructure.</li></ul><ul><li><b>Razer: </b>A global leader in gaming hardware and software, and one of the biggest brands in eSports, Razer has signaled interest in Canadian talent and technology.&nbsp;</li></ul><ul><li><b>Singapore Power Group: </b>One of Singapore’s largest corporations and a leading energy utilities company in Asia Pacific, Singapore Power Group has expressed interest in partnering with Canadian companies to offer smart grid solutions.</li></ul><ul><li><b>Singapore Technologies Engineering: </b>A global technology, defence, and engineering group, and among the largest companies listed on the Singapore Exchange, Singapore Technologies Engineering procures from Canadian aerospace and aviation industries and has expressed interest in Canadian smart cities technology and Canada’s Innovation Superclusters Initiative.</li></ul><ul><li><b>Singtel: </b>Singapore’s leading telecom company, Singtel serves over 685 million mobile customers around the world.</li></ul><ul><li><b>Surbana Jurong</b>: A Singapore-based consulting firm industrial and infrastructure development The company provides urban planning and design, development management, quantity surveying, waste management, engineering, project management, construction management, security, and water management solutions.</li></ul><ul><li><b>Temasek: </b>One of Singapore’s largest sovereign wealth funds, Temasek has billions of dollars of investment in Canada across a wide range of sectors and provinces, and has shown a strong interest in Canadian artificial intelligence.</li></ul><p>The Prime Minister also spoke at the Singapore FinTech Forum during the Singapore FinTech Festival. He highlighted how Canadian FinTech companies are leaders in the industry – making investing easier and more accessible, and keeping banking up-to-date in the digital marketplace for people around the world. At the Forum, the Prime Minister announced the expansion of Canada's successful Canadian Technology Accelerator program, with a new accelerator being launched in Singapore.</p><p>The ‎Prime Minister also attended the opening of a new office in Singapore for Canadian company Element AI. He highlighted how Canadian companies like Element AI are developing transformative technologies and positioning Canada as a world leader in artificial intelligence and deep learning.</p><p>The Prime Minister also met with representatives of the Canadian Chamber of Commerce and the Canada-ASEAN Business Council.</p><h2>Quote</h2><blockquote><p>“The close relationship between Canada and Singapore has always been forward-looking – and now, with the CPTPP coming into force, that’s more true than ever. Canadian entrepreneurs are already setting Canada up for success in Singapore and other countries across the Asia-Pacific region. Our government will continue to strengthen existing partnerships, while opening the door to new markets and investment opportunities, to create good, middle class jobs for Canadians.”<br>—<cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Canada and Singapore are among 11 member countries of the Comprehensive and Progressive Agreement on Trans-Pacific Partnership.</li><li>Singapore is the largest source of foreign direct investment from Southeast Asia to Canada and a top destination of Canadian investment within the region.</li><li>Canadian direct investment in Singapore was $5.7 billion in 2017. Foreign direct investment in Canada from Singapore was $354 million in 2017, up from $321 million in 2016.</li><li>Most of Canada's top financial institutions and some 150 Canadian firms have operations in Singapore.</li><li>This is the third edition of the Singapore FinTech Festival, organized by the Monetary Authority of Singapore (MAS). It is one of the largest of FinTech events and attracts more than 30,000 participants in various fields from over 100 countries. More than 5,000 companies were represented at the 2017 edition.</li><li>This will be the first time that Canada has a pavilion at the Festival with attending representatives of some 20 Canadian companies from British Columbia, Ontario, and Quebec. The Canada FinTech Forum will provide Canadian companies with an opportunity to showcase their products and services as well as their technologies and innovations to a regional audience.</li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/news-releases/2018/11/06/prime-minister-travel-singapore-and-papua-new-guinea\">Prime Minister travels to Singapore and Papua New Guinea</a></li><li><a href=\"/en/news/news-releases/2018/11/14/prime-minister-concludes-successful-visit-singapore-and-participation\">Prime Minister concludes successful visit to Singapore and participation at ASEAN</a></li></ul></div>\n      "
}