{
  "path": "/en/news/statements/2020/09/15/statement-prime-minister-international-day-democracy",
  "pageTitle": "Statement by the Prime Minister on the International Day of Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Democracy:</p>\n\n<p>“Today, we join our international partners to celebrate the <a href=\"https://www.un.org/en/observances/democracy-day\">International Day of Democracy</a>. We recognize that the respect for freedoms, human rights, and the rule of law are essential for democracies to thrive. We also take this opportunity to remind ourselves of our shared responsibility to protect and promote democratic values.</p>\n\n<p>“This year’s theme – COVID-19: A Spotlight on Democracy – highlights the impacts of the pandemic on the state of democracy around the world. From enabling the free flow of information to ensuring transparency and accountability, democracy has an important role to play in helping us confront the global pandemic.</p>\n\n<p>“To continue the fight against disinformation and hate speech, the Government of Canada is harnessing the tools at its disposal to mitigate these actions online, including through the <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a>, which was launched in 2019. This initiative supports democracy and social cohesion in Canada by promoting an information ecosystem that is trusted, diverse, safe, and free from disinformation and illegal content. The initiative also builds citizen resilience to online disinformation through third-party civic, news, and digital media literacy activities and programming to equip Canadians with the tools, and skills they need to critically assess information online.</p>\n\n<p>“Canada also recognizes democracy’s place at the heart of our international system, and the need to strengthen democratic institutions around the world to promote peace and stability. That is why we are committed to the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">2030 Agenda for Sustainable Development</a>, to help create a more equitable, prosperous, and secure world for future generations. We are investing to promote and protect democracy as well as media and press freedoms worldwide by supporting electoral processes, reinforcing democratic practices, and strengthening civic engagement. Canada stands with people around the world protesting peacefully, including recently in Belarus, Hong Kong, Venezuela, and Lebanon, as they seek to advance democratic principles.</p>\n\n<p>“Today, we also celebrate a milestone in the history of Canadian democracy, by marking <a href=\"https://www.elections.ca/anniversary\">100 years since the creation of Elections Canada</a>, the longest standing non-partisan electoral commission in the world. Today, Elections Canada continues to ensure that the federal electoral process in Canada remains transparent.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to reflect on our democratic traditions and the values that bring us together. By being engaged in the democratic process, we can help safeguard our institutions and help protect democracy worldwide.”</p></div>\n      "
}