{
  "path": "/en/news/readouts/2022/01/10/prime-minister-justin-trudeau-holds-36th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 36th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc held the 36th call with Canada’s provincial and territorial premiers to discuss their ongoing collaboration to address the COVID-19 pandemic.</p>\n\n<p>First Ministers discussed the COVID-19 Omicron variant of concern, noting that its high transmissibility makes it different from previous variants.&nbsp;They expressed concern over the strain on health care systems, businesses, workers, and families across the country, and discussed ways to continue working together to keep Canadians safe. They raised the need to strengthen health care systems, noting the particular challenges with health human resources capacity.</p>\n\n<p>The Prime Minister reiterated that the federal government will continue to provide the tools provinces and territories need to respond to the spread of COVID-19, including vaccines, rapid tests, and therapeutics. Premiers noted the measures they are implementing in their respective jurisdictions, and emphasized the importance of vaccines, rapid tests, and therapeutics as part of their response efforts.</p>\n\n<p>The Prime Minister provided reassurance that the federal government has secured enough vaccine doses for all eligible Canadians to receive a booster as well as a fourth dose, if that becomes necessary. First Ministers emphasized that both the Moderna and the Pfizer vaccines are safe and effective, and that the best vaccine is the one offered. The Prime Minister also noted that the federal government continues to procure rapid tests, with 140&nbsp;million tests planned for delivery to provinces and territories in January alone. Since the beginning of the pandemic, the federal government has purchased over 425&nbsp;million rapid tests, at a total cost of almost $3&nbsp;billion. Additionally, the Prime Minister noted that antiviral treatments are currently being reviewed by Health Canada. The federal government is working closely with provinces and territories to ensure quick deployment, if these treatments are approved.</p>\n\n<p>The Prime Minister highlighted measures taken by the government to support Canadians and businesses during this challenging time. These include the Canada Worker Lockdown Benefit, which provides $300 a week to eligible individuals who cannot work due to a COVID-19 lockdown, as well as the expansion of the Local Lockdown Program, which provides wage and rent subsidies to employers facing capacity restrictions.</p>\n\n<p>First Ministers recognized the impact the pandemic has had on Canadians, including pandemic fatigue and mental health challenges. They committed to continue close collaboration, as they have done since the start of the pandemic, to have Canadians’ backs and finish the fight against COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Canada’s vaccine supply</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/12/government-of-canada-announces-additional-measures-to-contain-the-spread-of-the-omicron-variant.html\">Government of Canada announces additional measures to contain the spread of the Omicron variant</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-services-procurement/news/2021/12/government-of-canada-signs-agreements-for-covid-19-oral-antiviral-treatments.html\">Government of Canada signs agreements for COVID-19 oral antiviral treatments</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/benefits/worker-lockdown-benefit.html\">Canada Worker Lockdown Benefit (CWLB)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/wage-rent-subsidies/local-lockdown-program.html\">Local Lockdown Program</a></li>\n</ul></div>\n      "
}