{
  "path": "/en/news/news-releases/2019/01/11/prime-minister-announces-support-canadas-first-geothermal-power",
  "pageTitle": "Prime Minister announces support for Canada’s first geothermal power facility | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking strong steps to protect the environment and grow the economy, while creating good, middle class jobs and more opportunities for Canadians.</p><p>The Prime Minister, Justin Trudeau, today announced support for a new geothermal power facility near Estevan in Southeastern Saskatchewan. The energy project, led by DEEP Earth Energy Production Corporation, is the first of its kind in Canada and taps into a new renewable energy resource.</p><p>Geothermal energy harnesses heat from the earth’s crust and transforms it into electricity to power our homes and businesses year round. DEEP’s geothermal facility will build on Saskatchewan’s leadership in the energy sector, using familiar drilling technologies from the oil, gas, and mining industries to tap into this reliable energy source.</p><p>The Government of Canada will provide $25.6 million in funding for the five Megawatt (MWe) facility, which will produce enough energy to power approximately 5,000 homes all while taking the equivalent of the yearly emissions of 7,400 cars out of the atmosphere. The project will create 100 jobs during construction, provide the provincial power grid with clean, renewable energy, and create new business opportunities for local communities.</p><p>The Government of Canada will continue to make smart investments in research and innovation to develop new clean energy technology, and meet our climate goals and create economic growth that benefits everyone.</p><h2>Quote</h2><blockquote><p>“Today’s announcement is an investment in the future of Saskatchewan, and all our children. DEEP’s project has the potential to transform how the province and the country produces energy, while creating good, middle class jobs for Canadians. This is another example of how we’re taking action to fight climate change today while strengthening our communities for tomorrow.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>Funding for this project is being provided through Natural Resources Canada’s Emerging Renewable Power Program. In 2014, Natural Resources Canada contributed $1 million through its ecoENERGY Innovation Initiative for a pre-feasibility study for this project. Natural Resource Canada’s Clean Energy Innovation Program and Innovation Saskatchewan also contributed $350,000 and $175,000, respectively, towards test drilling. The total cost of the project is $51.3 million.</li><li>The local community will channel excess heat from the facility to a 45-acre greenhouse for commercial use. Sustainable, affordable clean heating for major commercial greenhouses present new opportunities for the Saskatchewan agricultural sector.</li><li>The project will pave the way for additional investment in the Williston Basin, which has the capacity to support several hundred MWe of power generating capacity.</li><li>Canada is a world leader in the production and use of energy from renewable resources. In Canada, 66 per cent of electricity production is from renewable sources, such as hydroelectricity.</li><li>On January 9, 2019, Canada officially became a member of the International Renewable Energy Agency, joining 159 countries in an intergovernmental organization devoted to providing clean, sustainable energy for the world's growing population.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://deepcorp.ca/\">DEEP Earth Energy Production</a></li><li><a href=\"https://www.nrcan.gc.ca/energy/funding/20502\">Emerging Renewable Power Program</a></li></ul></div>\n      "
}