{
  "path": "/en/news/statements/2019/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p>\n\n<p>“Today, on International Women’s Day, we celebrate women around the world: their achievements, their contributions, and their leadership. We also take a hard look at the inequalities and injustices women still face – and redouble our efforts to build a gender-equal world.</p>\n\n<p>“This year’s theme, #InnovateForChange, is a call to remove barriers to women’s success as entrepreneurs, as tradespeople, and in science, technology, engineering, and mathematics (STEM). When women have the tools and opportunities they need to thrive in the careers of their choice, everyone benefits.</p>\n\n<p>“We have seen major progress in the last few years, as more and more women are entering under-represented fields and being recognized for their work. Last October, Canadian physicist Dr. Donna Strickland was a winner of the 2018 Nobel Prize in Physics – becoming only the third woman in history to win the prestigious award, and the first woman in 55 years. By breaking glass ceilings, trailblazers like Dr. Strickland pave the way for others to follow suit, and help empower more women and girls to pursue their highest ambitions.</p>\n\n<p>“Advancing gender equality is a top priority for the Government of Canada. Last year, for the first time in Canada’s history, we put gender equality at the core of the federal budget and provided important new funding for women entrepreneurs, newcomer women, and women in trades. In 2017, we launched the first-ever national Strategy to Prevent and Address Gender Violence. With Budget 2018, we made further investments in the strategy, and also announced important funding for organizations across Canada that are on the frontlines of the movement for gender equality. And last December, we created the new Department for Women and Gender Equality to lead these efforts.</p>\n\n<p>“We are also taking action beyond our borders to promote gender equality and help more women and girls achieve their goals. Canada made gender equality and women’s empowerment the central theme of its G7 presidency, and created the Gender Equality Advisory Council to steer that commitment. Thanks to their leadership, at the G7 Summit in Charlevoix, Canada and partners announced $3.8 billion to support quality education for women and girls in crisis and conflict situations – the single largest investment of its kind. Canada also looks forward to hosting the Women Deliver 2019 Conference in Vancouver this summer, and bringing together global leaders in the fight for gender equality.</p>\n\n<p>“Measures like these are making a concrete difference in the lives of women and girls the world over. But we still have a long way to go to promote the rights of women, girls, transgender, non-binary, and two-spirit people, and make sure everyone has the same support, opportunities, and chance to succeed. That includes addressing the major disparities among women, and breaking down particular barriers still faced by Indigenous women, women of colour, trans women, queer women, women with disabilities, and others. Moving forward means working to make sure everyone’s rights are equally protected, and everyone’s voice is heard.</p>\n\n<p>“Today, let’s celebrate the major achievements of women everywhere, and keep pushing for progress on gender equality. We all benefit when everyone has an equal opportunity to thrive – and we all have a role to play to make that a reality.”</p>\n\n<p>&nbsp;</p></div>\n      "
}