{
  "path": "/en/news/statements/2016/12/01/statement-prime-minister-canada-world-aids-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World AIDS Day:</p>\n<p>“Let us pause on World AIDS Day to remember the many people in Canada and around the world who have been lost to HIV/AIDS, and to renew our commitment to eliminating this disease in the years to come.</p>\n<p>“Today, and every day, we extend our compassion and kindness to everyone who is affected – not only those we have lost, but also those who are still living, including families.</p>\n<p>“Tens of thousands of Canadians are living with HIV, and over 36 million people worldwide are HIV-positive. Thanks to major advances in treatment and care, people diagnosed today are able to live with hope in ways not possible in decades past. Still, much work remains to be done to promote education, prevention, treatment, care, and to find a cure.</p>\n<p>“During the Fifth Replenishment Conference of the Global Fund, which Canada hosted in Montréal earlier this year, the Government of Canada pledged $804 million to international efforts to fight AIDS, malaria, and tuberculosis. At home, we are investing in the work of Canadian HIV/AIDS researchers, as well as community-based organizations to prevent new infections and ensure people living with HIV have access to treatment, care and support. We will continue to lead by example and help put an end to this serious, but preventable infection.</p>\n<p>“Finally, we all have a responsibility to do what we can to remove stigma and discrimination around HIV. All people living with HIV/AIDS, be they men, women, children, youth or trans persons deserve to be respected, and we must all challenge any negative attitudes or assumptions towards those living with this condition.</p>\n<p>“The fight against HIV/AIDS is a winnable one. I encourage all Canadians to support efforts to raise awareness about HIV/AIDS prevention through the UN-led #HIVPrevention campaign. By working together with researchers, activists, civil society, other countries, and the courageous people living with HIV/AIDS around the world, we can bring this global epidemic&nbsp;to an end.”</p></div>\n      "
}