{
  "path": "/en/news/news-releases/2022/11/08/connecting-canadians-high-speed-internet-new-brunswick-and-across",
  "pageTitle": "Connecting Canadians with high-speed Internet in New Brunswick and across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Reliable access to high-speed Internet is a necessity for all Canadians. It brings family and friends closer together, helps us work and study, and connects Canadian businesses with customers around the world. Connecting people in rural, remote, and Indigenous communities from coast to coast to coast to fast and reliable high-speed Internet will help create good, middle-class jobs and build an economy that works for all Canadians.\n</p>\n<p>The Prime Minister, Justin Trudeau, today announced a $475&nbsp;million top-up to the Universal Broadband Fund (UBF). The top-up will help connect an additional 60,000 rural homes across Canada to help achieve our goal of providing every community, in every province and territory, with high-speed Internet access.\n</p>\n<p>To date, the Government of Canada has already announced that up to 900,000 more homes will have access to high-speed Internet, with more announcements to come, and we are on track to meet our goal of providing access to high-speed Internet to 98 per cent of Canadians by 2026. Already, 93.5 per cent of Canadian homes today have access to high-speed Internet or are targeted to receive access through existing program commitments, compared to just 79 per cent in 2014.\n</p>\n<p>To better support the people of New Brunswick, the Prime Minister also announced up to $17.6&nbsp;million, on top of the previously announced $55&nbsp;million in federal funding, to provide high-speed Internet access to a total of more than 27,000 homes in New Brunswick. This expansion means that we have a plan to ensure that every home in New Brunswick has high-speed Internet access by 2030.\n</p>\n<p>As Canadians experience the rising cost of living due to global inflation, we will continue to deliver high-speed Internet to those who need it, in partnership with service providers, for $10 or $20 a month through the <a href=\"https://ised-isde.canada.ca/site/connecting-families/en\">Connecting Families</a> initiative. Recently, eligibility for this initiative was broadened from families receiving the maximum Canada Child Benefit (CCB) to include seniors receiving the maximum Guaranteed Income Supplement (GIS). Through this partnership, we are helping connect hundreds of thousands of low-income families and seniors to affordable high-speed Internet.\n</p>\n<p>The Government of Canada will continue to work with provinces and territories, municipalities, Indigenous communities, and Internet service providers so that all Canadians, no matter where they live, have access to high-speed Internet as soon as possible.\n</p>\n<h2>Quotes\n</h2>\n<blockquote>\n  <p>“From the student who relies on the Internet to hand in their assignments on time, to the small business owner who sells their products around the world online, every Canadian, wherever they are in the country, deserves good, reliable high-speed Internet. With today’s announcement, we will continue to improve and expand high-speed Internet access in every community across the country, to build an economy that works for all Canadians.”\n  </p>\n  <footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada\n  </footer>\n</blockquote>\n<blockquote>\n  <p>“We all know that Internet is no longer a luxury in this day and age – it’s a necessity. Access to fast, reliable Internet helps rural Canadians by levelling the playing field to access essential services like health care and education, participate in the digital economy, or simply connect with loved ones. Today’s announcement reinforces our government’s commitment to getting 100 per cent of Canadians connected, no matter where they live, by 2030. What’s more, I am happy to report that we’ve already connected over 93.5 per cent of Canadians, compared to 79 per cent in 2014, and are well on our way to reaching our target.”\n  </p>\n  <footer class=\"default\">The Hon. Gudie Hutchings, Minister of Rural Economic Development\n  </footer>\n</blockquote>\n<h2>Quick Facts\n</h2>\n<ul>\n  <li>The Universal Broadband Fund (UBF) is a $3.225&nbsp;billion investment by the Government of Canada designed to help connect 98 per cent of Canadians to reliable high-speed Internet by 2026 and 100 per cent of Canadians by 2030.</li>\n  <li>The government has partnered with several provinces to ensure that UBF dollars go even further. This includes <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/03/british-columbians-to-benefit-from-a-historic-plan-with-up-to-830-million-toward-connecting-all-remaining-rural-households-in-the-province-to-high-.html\">British Columbia</a>, <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/03/alberta-and-canada-expand-partnership-to-improve-access-to-high-speed-internet-for-albertans.html\">Alberta</a>, <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/07/nearly-280000-ontario-residents-to-benefit-from-historic-agreement-to-improve-access-to-high-speed-internet.html\">Ontario</a>, Quebec (<a href=\"https://pm.gc.ca/en/news/news-releases/2021/03/22/unprecedented-agreement-connect-nearly-150000-quebecers-high-speed\">Phase&nbsp;1</a> and <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/07/governments-of-canada-and-quebec-invest-94million-to-connect-more-than-18200households-in-quebec-to-high-speed-internet-by-september20220.html\">Phase&nbsp;2</a> of Operation High Speed), <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/02/newfoundlanders-and-labradorians-to-benefit-from-historic-136-million-plan-to-connect-all-remaining-rural-households-in-the-province-to-high-speed-.html\">Newfoundland and Labrador</a>, and <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/06/every-home-in-prince-edward-island-to-get-connected-to-high-speed-internet-thanks-to-federal-provincial-partnership.html\">Prince Edward Island</a>.</li>\n  <li>To date, the Government of Canada has invested $7.6&nbsp;billion in broadband Internet infrastructure to connect communities from coast to coast to coast.</li>\n  <li>The Government of Canada has also launched an update to the <a href=\"https://www.ic.gc.ca/app/sitt/bbmap/hm.html?lang=eng\">National Broadband Internet Service Availability Map</a>. Through this interactive tool, Canadians can find Internet service providers and connectivity projects underway in their area.</li>\n  <li>To provide Canadians with the latest information on the government’s progress toward accessing universal high-speed Internet, the government also published an interactive <a href=\"https://ised-isde.canada.ca/site/high-speed-internet-canada/en/universal-access/broadband-dashboard\">High-Speed Internet Access Dashboard</a> today. The Dashboard allows Canadians to track national progress and government funding by province and territory.</li>\n  <li>The Government of New Brunswick’s <a href=\"https://www2.gnb.ca/content/gnb/en/departments/finance/news/news_release.2022.09.0538.html#:~:text=The%20Remote%20Satellite%20Internet%20Rebate,%2C%20and%20March%2031%2C%202023.\">Remote Satellite Internet Rebate Program</a> will help connect remote homes not covered by UBF projects in the province.</li>\n</ul>\n<h2>Related Product\n</h2>\n<ul>\n  <li><a href=\"https://ised-isde.canada.ca/site/high-speed-internet-canada/en/canadas-connectivity-strategy/high-speed-access-all-canadas-connectivity-strategy\">High-Speed Access for All: Canada’s Connectivity Strategy</a></li>\n</ul>\n<h2>Associated Links\n</h2>\n<ul>\n  <li><a href=\"https://ised-isde.canada.ca/site/high-speed-internet-canada/en\">High-speed Internet for all Canadians</a></li>\n  <li><a href=\"https://ised-isde.canada.ca/site/high-speed-internet-canada/en/universal-broadband-fund\">Universal Broadband Fund</a></li>\n  <li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/09/connecting-all-canadians-high-speed-internet\">Connecting all Canadians to high-speed Internet</a></li>\n  <li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/06/government-of-canada-invests-55-million-to-bring-high-speed-internet-to-nearly-11000households-throughout-new-brunswick.html\">Government of Canada invests $55&nbsp;million to bring high-speed Internet to nearly 11,000 households throughout New Brunswick</a></li>\n</ul></div>\n      "
}