{
  "path": "/en/news/statements/2022/06/21/statement-prime-minister-national-indigenous-peoples-day",
  "pageTitle": "Statement by the Prime Minister on National Indigenous Peoples Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous Peoples Day:</p>\n\n<p>“Today, on National Indigenous Peoples Day, First Nations, Inuit, and Métis from coast to coast to coast will celebrate their unique histories, cultures, traditions, and languages with their families and communities. Every year, we celebrate the diversity of Indigenous cultures across Canada and the vibrancy of the Indigenous Peoples who fight every day to keep them alive.</p>\n\n<p>“National Indigenous Peoples Day is celebrated on the summer solstice, the longest day of the year, and a day that holds cultural, historical, and spiritual significance for Indigenous Peoples. This day is usually marked by coming together for celebratory events and ceremonies, with families and community members gathering to share food and showcase traditional practices.</p>\n\n<p>“Over the past year, we have made real progress with First Nations, Inuit, and Métis communities across the country by listening to them and working together to advance their priorities and make life better. The government has signed agreements to improve child and family services, which will keep children in their communities, surrounded by their culture. We have worked collaboratively to make major investments to increase affordable housing and safe spaces for Indigenous women in communities across the country. In April, the government and Inuit leaders endorsed the historic&nbsp;Inuit Nunangat Policy to support Inuit self-determination and Inuit-led solutions. While today is a time to celebrate First Nations, Inuit, and Métis across Canada, it is also an opportunity to acknowledge there is still work to be done to right past wrongs and close the gaps that still exist today.</p>\n\n<p>“This day marks one year since the <a href=\"https://www.justice.gc.ca/eng/declaration/legislation.html\"><em>United Nations Declaration on the Rights of Indigenous Peoples Act</em></a> became law, a historic milestone in our collective journey to move forward on reconciliation and create a renewed relationship with First Nations, Inuit, and Métis rooted in the recognition of rights, respect, and cooperation. While we work to address longstanding inequalities in housing, health care, education, and more, this law is the transformative, integral piece that will underpin every facet of our work.</p>\n\n<p>“This year also marks the beginning of the United Nations’ <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-indigenous-languages/international-decade.html\">International Decade of Indigenous Languages</a>, which draws attention to the significance of Indigenous languages, and the importance of supporting Indigenous Peoples in their efforts to preserve, revitalize, and promote their languages, like we are doing here in Canada.</p>\n\n<p>“On this day, and throughout <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1466616436543/1534874922512\">National Indigenous History Month</a>, we recognize the significant contributions of Indigenous Peoples in shaping our country into what it is today and moving toward a brighter and stronger Canada as shared partners. Being the longest day of the year, it is also the day that has the most light. As we continue to shine light on the hard truths of the past, let us also shine a light of hope for the future. I invite all Canadians to <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1528210353182/1580759773150\">learn more about First Nations, Inuit, and Métis</a> cultures and histories – particularly in your local areas – and <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada/indigenous-peoples-day.html\">participate in an event</a> or join the conversation on social media by using the hashtags #NIPD2022 and #NIPDCanada. Together, we will continue to advance reconciliation, support Indigenous Peoples, and build a better future for everyone.”</p></div>\n      "
}