{
  "path": "/en/news/news-releases/2022/07/19/delivering-clean-oceans-and-healthy-coasts-expanded-oceans-protection",
  "pageTitle": "Delivering clean oceans and healthy coasts with an expanded Oceans Protection Plan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are proud of our oceans. With the longest coastline in the world, marine and coastal areas are essential to our livelihoods and our economy right across the country. Since it was launched in 2016, the Oceans Protection Plan has strengthened protections for our coasts and wildlife, improved marine traffic and incident management, and advanced partnerships with Indigenous communities.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the next phase of Canada’s Oceans Protection Plan. With the new investment of $2 billion over nine years, announced in Budget 2022, Canada will establish 15 new measures to expand ocean protection initiatives to more regions and better proactively combat emerging threats to marine safety, while continuing or expanding 39 existing initiatives. This new funding is in addition to the $1.5&nbsp;billion initially announced in 2016 and brings the total invested in support of the plan to $3.5&nbsp;billion.</p>\n\n<p>The renewed and expanded plan will help make further progress to:</p>\n\n<ul>\n\t<li>Enhance the protection and restoration of vulnerable marine ecosystems and wildlife;</li>\n\t<li>Improve the efficiency, safety, and sustainability of Canada’s marine supply chains and mitigate their impacts on the environment, including by advancing research on marine pollution, ecosystems, and wildlife;</li>\n\t<li>Better manage marine traffic navigation off our coasts and marine incidents of all types; and</li>\n\t<li>Advance partnerships and training opportunities for Indigenous and coastal communities to incorporate their expertise and experiences in various aspects of marine safety and ecosystem protection.</li>\n</ul>\n\n<p>The renewed and expanded plan builds on the first, successful iteration, which delivered real results on key promises across the country. For example, since 2016, the government re-opened important incident response centers, like the Canadian Coast Guard Maritime Rescue Sub-Centre St. John’s and the new permanent station in Victoria. We also took action to protect species at risk, including the Southern Resident Killer Whale and funded initiatives to protect the North Atlantic Right Whale.</p>\n\n<p>The Oceans Protection Plan is a Canadian success story. When Indigenous Peoples, industry, communities, academia, and government work together to protect our environment, grow our economy, and support good jobs across the country, we deliver real results. A renewed and expanded Oceans Protection Plan will keep our oceans and coasts healthy, advance reconciliation, and build a clean future for our children and grandchildren.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“From keeping plastic pollution out of our waters to protecting more of our coasts than ever before, Canada is a world leader in marine safety and conservation. By expanding the Oceans Protection Plan and continuing to work with Indigenous and coastal communities across the country, we will accelerate our efforts to ensure Canada’s marine and coastal areas remain healthy, clean, and safe for generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s coastlines are critical to our communities, our economy, and our environment. Our government’s renewed investment and expansion of the Oceans Protection Plan means we will continue to make marine shipping safer, protect marine species and ecosystems, and provide greater opportunities for Indigenous Peoples to direct how their traditional coasts and waterways are protected. Our government is looking forward to continuing this important work to protect our coasts for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“Waterways and coastlines have always played a crucial role in the lives of Canadians. This next phase of the Oceans Protection Plan is continuing the important work of ensuring Canada’s three oceans are healthy, protected, and safe. From responding to marine emergencies to restoring aquatic ecosystems, we’ll be working in partnership with Indigenous Peoples and coastal communities to protect Canada’s mariners, waterways, and shorelines now, and for the generations to come.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<blockquote>\n<p>“With the longest coastline in the world, Canadians understand the importance of preserving the health of our oceans for future generations. Expanding and renewing the Oceans Protection Plan is a critical part of our collaborative effort to reverse habitat and biodiversity loss, conserve more of our coasts and waterways, support vital jobs and local economies and build more resilient coastal communities.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s beautiful oceans are vital to our future in so many ways, from fighting climate change to maintaining a sustainable way of life. Today’s renewed Ocean’s Protection Plan gives Environment and Climate Change Canada the tools to continue to study priority species, keep our shorelines pristine and reduce oil spill impacts. Our government has accomplished a lot in just a few years, but there is more work to do.”</p>\n\n<footer class=\"default\">The Hon. Steven Guilbeault, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada’s ocean economy accounts for approximately $31.65&nbsp;billion annually in GDP and employs approximately 300,000 Canadians across various industries.</li>\n\t<li>Marine transportation is among the safest and most cost-effective low-emission ways to move goods.</li>\n\t<li>Since its launch in 2016, over 50 initiatives have been implemented under the Oceans Protection Plan. These include:\n\t<ul>\n\t\t<li>Opening six Canadian Coast Guard search and rescue stations in British Columbia and Newfoundland and Labrador, and a seasonal inshore rescue boat station in Nunavut, to improve our ability to respond to marine incidents;</li>\n\t\t<li>Significantly increasing emergency response capacity with an Indigenous-led Canadian Coast Guard Auxiliary in British Columbia and the expansion of the Auxiliary across the Arctic, emergency tow kits, new vessels, equipment, and training on all three coasts;</li>\n\t\t<li>Funding over 60 projects across Canada to restore coastal aquatic habitats that support species like salmon and the endangered Southern Resident Killer Whale;</li>\n\t\t<li>Funding&nbsp;500<a href=\"https://tc.canada.ca/en/initiatives/oceans-protection-plan/%5bioID%5d24F8B44B8EFB4EAA8000964704230B38\"> </a>projects to remove and dispose of abandoned boats across Canada and making it illegal to abandon your boat in Canada’s waters;</li>\n\t\t<li>Supporting 750 individuals, including women, Indigenous Peoples, and Northerners, to graduate from specialized training to qualify for jobs in the marine industry;</li>\n\t\t<li>Modernizing Canada’s <a href=\"https://sopf.gc.ca/\">Ship-source Oil Pollution Fund</a> so that the polluter pays and making unlimited compensation available to those affected by an oil spill;</li>\n\t\t<li>Forming a bilateral agreement between Canada and 17 Pacific North Coast First Nations to advance collaborative oceans governance and management of British Columbia’s North Coast; and</li>\n\t\t<li>Holding on average one session per day with Indigenous communities across Canada to plan, develop, or execute the Oceans Protection Plan priorities and actions.</li>\n\t</ul>\n\t</li>\n\t<li>The implementation of the Oceans Protection Plan is a whole-of-government effort, with responsibility shared across Transport Canada, Fisheries and Oceans Canada, the Canadian Coast Guard, Environment and Climate Change Canada, Natural Resources Canada, and Health Canada, with support from Public Services and Procurement Canada and Global Affairs Canada.</li>\n\t<li>Today’s announcement delivers on the commitment set out in Minister of Transport Omar Alghabra’s <a href=\"https://pm.gc.ca/en/mandate-letters/2021/12/16/minister-transport-mandate-letter\">mandate letter</a> from December 2021, to launch the next phase of the Oceans Protection Plan to continue efforts to deliver a world-leading marine safety system, increase protection for marine species and ecosystems, and create stronger partnerships with Indigenous and other coastal communities, while strengthening marine research and science.</li>\n\t<li>In addition to today’s announcement, the government announced in Budget&nbsp;2022 its intention to propose amendments to the <em>Canada Shipping Act, 2001</em> and other acts, including to enable the proactive management of marine emergencies and cover more types of marine pollution.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/clean-air-and-a-strong-economy.html\">Budget&nbsp;2022 Backgrounder: Clean Air and a Strong Economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/protectingourcoasts\">Protecting our coasts through the Oceans Protection Plan</a>\n\n\t<ul>\n\t\t<li><a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan/safer-marine-traffic\">Safer marine traffic</a></li>\n\t\t<li><a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan/better-protected-coastal-ecosystems\">Better protected coastal ecosystems</a></li>\n\t\t<li><a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan/stronger-incident-prevention-response\">Stronger incident prevention and response</a></li>\n\t\t<li><a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan/stronger-partnerships-indigenous-coastal-communities\">Stronger partnerships with Indigenous and coastal communities</a></li>\n\t</ul>\n\t</li>\n\t<li><a href=\"https://tc.canada.ca/en/initiatives/oceans-protection-plan/report-canadians-investing-our-coasts-through-oceans-protection-plan\">Report to Canadians – Results of the Oceans Protection Plan</a></li>\n</ul></div>\n      "
}