{
  "path": "/en/news/statements/2019/06/05/statement-prime-minister-world-environment-day",
  "pageTitle": "Statement by the Prime Minister on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/environmentday/\">World Environment Day</a>, we join the international community to celebrate the natural world and reflect on our shared responsibility to safeguard the environment for generations to come. Environmental challenges – climate change first among them – affect everyone, and it’s up to all of us to work together to face them.</p>\n\n<p>“The theme for this year’s World Environment Day – <a href=\"https://www.un.org/en/events/environmentday/\">beat air pollution</a> – urges us to make changes in our daily lives to reduce air pollution and limit its effects on our health and environment.</p>\n\n<p>“Air pollution is a severe global threat. It kills <a href=\"https://www.who.int/air-pollution/news-and-events/how-air-pollution-is-destroying-our-health\">7 million people</a> worldwide every year. In Canada alone, air pollution each year contributes to over <a href=\"https://www.canada.ca/en/health-canada/services/air-quality/health-effects-indoor-air-pollution.html\">14,000 premature deaths</a>. It harms plants and animals, contaminates water and soil, and damages the resources we all rely on. Our health, environment, and economy do not exist in isolation. The threat posed by air pollution will only get worse – unless we do something about it.</p>\n\n<p>“That is why we are taking strong action now to reduce emissions and protect our clean air and water, while helping create good, middle class jobs and drive economic growth.</p>\n\n<p>“At home, we have introduced important measures to tackle air pollution from vehicles, power plants, and industries across the country. We have put a price on carbon pollution – the single most powerful way to cut greenhouse gas emissions while driving economic growth – and accelerated our plan to phase out coal by 2030. In <a href=\"https://www.budget.gc.ca/2019/home-accueil-en.html\">Budget 2019</a>, we announced investments to make zero-emission vehicles more affordable, and help communities, including those in rural and remote areas, transition to cleaner, more reliable, and affordable electricity.</p>\n\n<p>“Beyond our borders, Canada is honouring its commitments under the <a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/paris-agreement.html\">Paris Agreement</a> and working with international partners to fight climate change and its disastrous effects. We are a founding member of the <a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/climate-clean-air-coalition.html\">Climate and Clean Air Coalition</a>, a global partnership of governments, businesses, scientific institutions, and other organizations working to improve air quality and reduce pollutants that contribute to climate change and harm people’s health worldwide.</p>\n\n<p>“Today, I urge all Canadians to take <a href=\"https://www.worldenvironmentday.global/get-involved/world-environment-day-mask-challenge\">action</a> now. Turn off lights and unplug devices when they are not in use. Invest in high-efficiency home heating systems and equipment. Switch to public transit, or make your next vehicle purchase a zero-emission one.</p>\n\n<p>“By working together and making decisions every day that help protect our health and the environment, we can reduce air pollution, fight climate change, and build a world for our children and grandchildren that is cleaner, healthier, and more sustainable.”</p></div>\n      "
}