{
  "path": "/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-convenes-incident-response-group-ongoing",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group on the ongoing illegal blockades | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened a meeting of the Incident Response Group, where he was joined by ministers and senior officials working to help provinces and municipalities get the situation under control and end the ongoing&nbsp;illegal blockades and occupations taking place across the country.</p>\n\n<p>Ministers and officials updated the Prime Minister on the work underway with their provincial and municipal counterparts to end these blockades, including building on the Ontario&nbsp;government’s announcement of stiffer fines and penalties. They committed to continue providing all appropriate available federal resources to&nbsp;protect public order&nbsp;and&nbsp;keep people and communities safe.</p>\n\n<p>The group was briefed on the law enforcement action in Windsor, Ontario, led by the Ontario Provincial Police (OPP) with support from other police forces – including significant support from the RCMP. They emphasized the very real economic harm facing Canada as each hour passes where these illegal blockades remain unresolved. They reiterated their unwavering commitment to defend jobs, trade, and the economy.</p>\n\n<p>The Prime Minister and ministers were briefed by the RCMP on their efforts to secure ports of entry in Coutts, Alberta, and Emerson, Manitoba, and prevent further blockades from emerging, working with local police in these jurisdictions.</p>\n\n<p>Ministers and officials also updated the Prime Minister on their outreach to industry officials, as well as those responsible for critical infrastructure such as airports, ports, and railways, to ensure that they have the resources in place to safeguard against disruptions and further blockades. The Prime Minister stressed that border crossings cannot, and will not, remain closed, and that all options remain on the table.</p>\n\n<p>Today, the OPP, the RCMP, and the Ottawa Police Service established an enhanced Integrated Command Centre in response to the escalation of the current occupation in Ottawa. Additionally, the Prime Minister and ministers discussed further immediate actions the federal government is considering, and will reconvene tomorrow.</p>\n\n<p>They emphasized the urgent need for anyone participating in the blockades to return to their communities peacefully and immediately, and that consequences for breaking the law will be increasingly severe.&nbsp;The government’s top priority remains to keep people and communities safe, and to protect jobs, trade, and our economy.&nbsp;These blockades must be brought to an end, and the federal government will continue working on every option to end them.</p>\n\n<h2>Associated link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/10/prime-minister-justin-trudeau-convenes-incident-response-group\">Prime Minister Justin Trudeau convenes the Incident Response Group</a></li>\n</ul></div>\n      "
}