{
  "path": "/en/news/itineraries/2023/03/30/prime-ministers-itinerary-friday-march-31-2023",
  "pageTitle": "Prime Minister’s itinerary for Friday, March 31, 2023 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Moncton, New Brunswick</h2>\n\n<p><strong>10:45 a.m.&nbsp;</strong>The Prime Minister will meet with dental hygienist students and patients to discuss the importance of high quality and affordable dental care at a local dental college. He will be joined by the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, and the Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency, Ginette Petitpas Taylor.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Pooled photo opportunity</li>\n</ul><p><strong>11:00 a.m.&nbsp;</strong>The Prime Minister will make a dental care announcement. A media availability will follow. He will be joined by the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, and the Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency, Ginette Petitpas Taylor.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 10:15 a.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a>.</li>\n</ul><p><strong>1:00 p.m.&nbsp;</strong>The Prime Minister will visit a health care research institute and meet with health care workers and researchers. He will be joined by the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, and the Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency, Ginette Petitpas Taylor.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Pooled photo opportunity</li>\n</ul><h2>Dieppe, New Brunswick</h2>\n\n<p><strong>3:00 p.m.&nbsp;</strong>The Prime Minister will participate in a town hall with local families, hosted by the Boys and Girls Club of Moncton. He will be joined by the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, and the Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency, Ginette Petitpas Taylor.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 2:15 p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul></div>\n      "
}