{
  "path": "/en/news/news-releases/2023/02/11/prime-minister-travel-bahamas-meet-caribbean-community-caricom",
  "pageTitle": "Prime Minister to travel to The Bahamas to meet with Caribbean Community (CARICOM) leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Nassau, The Bahamas, on February 15 and 16, to participate as a special guest in the 44th Meeting of the Conference of Heads of Government of the Caribbean Community (CARICOM). At CARICOM, which brings together the leaders of 20 Caribbean governments, the Prime Minister will drive progress on shared priorities, including continued support for the Haitian people.</p>\n\n<p>The visit will provide an opportunity for the leaders to consider further regional political, security, and humanitarian assistance in support of the Haitian people and Haitian-led solutions to the ongoing situation in Haiti, which is having a devastating impact on the Haitian people. As a steadfast partner, Canada has taken action in response to the egregious situation, including by providing support to the Haitian National Police, deploying a long-range patrol aircraft to disrupt the activities of gangs, coordinating the delivery of vital security equipment purchased by the Haitian government, providing humanitarian support, and implementing robust sanctions on those responsible. We will continue to stand with the Haitian people as they strive for a brighter future.</p>\n\n<p>As CARICOM celebrates its 50th anniversary, the Prime Minister will participate in group discussions and bilateral meetings with CARICOM leaders. He will work to strengthen Canada’s partnership with countries in the Caribbean region, including by advancing democracy, human rights, economic growth that benefits everyone, and developing clean energy. The Prime Minister will also work with CARICOM leaders to increase trade and investment between Canada and the Caribbean to create jobs and growth, and advocate for climate action and resilience for the region, which is particularly vulnerable to climate change and natural disasters.</p>\n\n<p>As a steadfast partner, Canada continues to work with CARICOM to build a more secure, stable, and prosperous world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the Caribbean Community share strong ties between our peoples, common values, and a strong commitment to fighting climate change. I look forward to meeting with the leaders of CARICOM to discuss how we can continue to work together to support the people of Haiti, strengthen the Caribbean region, and build a better future for people and businesses in Canada, the Caribbean, and around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Over two million Canadians travel to CARICOM countries annually.</li>\n\t<li>Canada has long-standing ties with many CARICOM countries on a wide range of issues, including trade, security and defence, and governance.</li>\n\t<li>CARICOM is comprised of 15 Full Members and five Associate Members. The Full Members are Antigua &amp; Barbuda, The Bahamas, Barbados, Belize, Dominica, Grenada, Guyana, Haiti, Jamaica, Montserrat, Saint Lucia, Saint Kitts &amp; Nevis, Saint Vincent &amp; the Grenadines, Suriname, and Trinidad &amp; Tobago. The overseas territories of Anguilla, Bermuda, the British Virgin Islands, the Cayman Islands, and Turks &amp; Caicos Islands are Associate Members.</li>\n\t<li>The Conference of Heads of Government of the Caribbean Community meets twice a year at Regular and Inter-Sessional meetings, in summer and winter respectively.</li>\n\t<li>In 2021, Canada’s two-way merchandise trade with CARICOM countries reached $1.9 billion. In 2021, bilateral trade in services reached $3.9 billion.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/06/10/canadas-new-investments-and-assistance-latin-america-and-caribbean\">Canada’s new investments and assistance in Latin America and the Caribbean</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/bahamas/relations.aspx?lang=eng\">Canada-Bahamas Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"http://www.caricom.org/\">Caribbean Community (CARICOM)</a></li>\n</ul></div>\n      "
}