{
  "path": "/en/news/statements/2023/01/29/statement-prime-minister-national-day-remembrance-quebec-city-mosque",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia:</p>\n\n<p>“Today, we remember the six people who lost their lives and the 19 others who were seriously injured during the attack at the Centre culturel islamique de Québec in Sainte-Foy. We also salute the courage and selflessness of the first responders and community members who put their lives in danger and did everything they could to save worshippers that day.</p>\n\n<p>“We remember Ibrahima Barry, Mamadou Tanou Barry, Khaled Belkacemi, Abdelkrim Hassane, Azzedine Soufiane, and Aboubaker Thabti, who were fathers, husbands, friends, colleagues, Quebecers, and Muslims. In the days following this hateful act of terror, Canadians and communities around the world came together to say their names, honour their memories, support one another, and stand against Islamophobia in all its forms.</p>\n\n<p>“Islamophobia has no place in Canada, and we must continue our work to help Muslims feel safe. Last week, we appointed Amira Elghawaby as Canada’s first Special Representative on Combatting Islamophobia, to serve as a champion, advisor, expert, and representative to the Government of Canada. She will bring her experience as a journalist, an expert on issues of equity and inclusion, and a human rights advocate to the role to promote awareness of the diverse and intersectional identities of Muslims in Canada. She will also advise the government on the development of inclusive policies that reflect their realities.</p>\n\n<p>“The Government of Canada’s <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a> has built a foundation to address systemic racism and discrimination in federal institutions, public policies, programs, and services. By working with members of racialized and religious minority communities, the Strategy amplifies the voices of those with lived experience and provides the government with tangible solutions toward addressing systemic racism and combatting hate across the country.</p>\n\n<p>“Since the attack on January 29, 2017 – one of the deadliest mass shootings in Canadian history – we have introduced the toughest gun control measures in a generation to ensure this can never happen again.&nbsp;We banned over 1,500 types of assault-style firearms, expanded background checks for firearms licences, and introduced a freeze on the handgun market – making it illegal to buy, sell, or transfer a handgun in Canada. The government has also increased investments in the <a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/crm-prvntn/fndng-prgrms/scrt-nfrstrctr-prgrm-en.aspx\">Security Infrastructure Program</a> to support communities at risk of hate-motivated crimes by providing funding to enhance the security of their community gathering spaces, including places of worship. Approximately 30 per cent of projects improved the security infrastructure of Muslim organizations.</p>\n\n<p>“Today, on the National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia, I encourage everyone to take a moment to remember the victims, their families, and survivors of this attack, and to stand with members of the Muslim community. Let’s also reflect on the progress we have made – and the work that remains – to build a better, more inclusive, and safer, Canada. We will always stand against Islamophobia and all forms of hate, discrimination, and prejudice.”</p></div>\n      "
}