{
  "path": "/en/news/statements/2021/07/01/statement-prime-minister-canada-day",
  "pageTitle": "Statement by the Prime Minister on Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada Day:</p>\n\n<p>“Today, we celebrate our country and everyone who calls it home. We also reflect on everything we have accomplished, and look forward to what more we have to do.</p>\n\n<p>“The pandemic has changed our daily lives, taught us hard lessons, and kept us apart. But through this challenge and crisis, Canadians were there for each other. We all – young and old – made personal sacrifices to help keep our communities safe and healthy. We put signs in our windows and banged pots and pans for our front-line health care workers. We ordered takeout and shopped at our local small businesses. And once vaccines became available, we got our shots as soon as possible, so our communities could return to normal.</p>\n\n<p>“Hope, hard work, kindness, resilience, and respect. These are the values that Canadians have shown in the face of the pandemic, and today we should celebrate those values and what we’ve overcome. But while we acknowledge our successes, we must also recognize that, for some, Canada Day is not yet a day of celebration.</p>\n\n<p>“The horrific findings of the remains of hundreds of children at the sites of former residential schools in British Columbia and Saskatchewan have rightfully pressed us to reflect on our country’s historical failures, and the injustices that still exist for Indigenous peoples and many others in Canada. We as Canadians must be honest with ourselves about our past. And we must recognize that here in Canada there are still people who don’t feel safe walking the streets of their communities, who still don’t have the same opportunities as others, and who still face discrimination or systemic racism in their daily lives.</p>\n\n<p>“While we can’t change the past, we must be resolute in confronting these truths in order to chart a new and better path forward. Together, we have a long way to go to make things right with Indigenous peoples. But if we all pledge to do the work – and if we lead with those core values of hard work, kindness, resilience, and respect – we can achieve reconciliation and build a better Canada for everyone.</p>\n\n<p>“What makes Canada special is not the belief that this is the best country in the world, but the knowledge that we could be. And whether it’s finishing the fight against COVID-19, tackling the climate crisis, or walking the path of reconciliation, I know there is no challenge too great, if we face it together. Because the progress we’ve made as a country didn’t happen by accident, and it won’t continue without effort.</p>\n\n<p>“This Canada Day, let’s recommit to learning from and listening to each other so we can break down the barriers that divide us, rectify the injustices of our past, and build a more fair and equitable society for everyone. Together, we will roll up our sleeves and do the hard work that is necessary to build a better Canada.</p>\n\n<p>“From my family to yours, happy Canada Day.”</p>\n\n<p>&nbsp;</p></div>\n      "
}