{
  "path": "/en/news/news-releases/2018/05/22/estonian-prime-minister-juri-ratas-visit-canada",
  "pageTitle": "Estonian Prime Minister Jüri Ratas to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Prime Minister of Estonia, Jüri Ratas, will travel to Canada for a working visit from May 24 to 28, 2018.</p><p>The two leaders will meet in Ottawa on May 28. During their meeting, Prime Minister Trudeau and Prime Minister Ratas will discuss issues of mutual interest, including the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) and regional security challenges. They will also explore how Canada and Estonia can work even more closely together to create jobs in both countries and build economies that work for everyone.</p><p>As part of the celebrations to mark the 100<sup>th</sup> anniversary of Estonia’s independence, Prime Minister Ratas will meet with members of the Estonian-Canadian community in Toronto during his visit.</p><h2>Quote</h2><blockquote><p>“Canada and Estonia enjoy a strong relationship, rooted in decades of cooperation and strong people-to-people bonds. Our relationship is enriched by the vibrant Estonian-Canadian community – one of the largest Estonian communities outside Estonia. I look forward to meeting with Prime Minister Ratas during Estonia’s centennial year of independence to find ways to broaden our cooperation, and create more opportunities for Canadians and Estonians alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the first formal meeting between Prime Minister Trudeau and Prime Minister Ratas.</li><li>Canada and Estonia collaborate closely within the United Nations, the Organization for Security and Co-operation in Europe, the Organisation for Economic Co‑operation and Development, the North Atlantic Treaty Organization, the Digital7, and the Open Government Partnership.</li><li>On September 21, 2017, the provisional application of CETA took effect. CETA provides new opportunities for Canadian and Estonian businesses, and will enhance trade and investment in both countries.</li><li>CETA will provide Canadian businesses with greater access to the world's second-largest single market, with over 510 million consumers and a GDP of $22&nbsp;trillion, and will help eliminate barriers in virtually all sectors and aspects of Canada-EU bilateral trade.</li><li>Estonia ratified CETA on October 4, 2017.</li><li>Bilateral merchandise trade between Canada and Estonia totaled nearly $110&nbsp;million in 2017. Canadian merchandise exports to Estonia $24 million, and Canadian imports from Estonia reached about $86 million.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.international.gc.ca/world-monde/estonia-estonie/relations.aspx?lang=eng\">Canada and Estonia relations</a></li></ul></div>\n      "
}