{
  "path": "/en/news/statements/2021/06/03/statement-prime-minister-second-anniversary-final-report-national",
  "pageTitle": "Statement by the Prime Minister on the second anniversary of the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the second anniversary of <em>Reclaiming Power and Place</em>, the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls:</p>\n\n<p>“Today, we remember and honour those who were taken, those who remain missing, and the experiences of the families and survivors whose lives have been forever changed by violence. We recognize the strength and resilience of Indigenous women, girls, and two-spirit and LGBTQ people. We also honour everyone who advocated for, and contributed to the National Inquiry, and brought awareness to this ongoing national tragedy.</p>\n\n<p>“Two years ago today, the National Inquiry into Missing and Murdered Indigenous Women and Girls presented its final report, confirming a heartbreaking reality: for generations, Canada has failed Indigenous peoples. The report highlighted systemic violations and abuses of their human rights, including inherent, treaty, and constitutional rights, which have resulted in the tragedy of missing and murdered Indigenous women, girls, and two-spirit and LGBTQ people.</p>\n\n<p>“The Government of Canada immediately received and acknowledged the findings of the report, and since the report’s release, has been working closely with families and survivors, First Nations, Inuit, and Métis, Indigenous organizations, and the provinces and territories to develop a National Action Plan. Today, we are launching this plan and together taking another step forward to make the transformative change necessary to end this national tragedy against Indigenous women, girls, and two-spirit and LGBTQ people, and restore their power and place in a society where they are respected, safe, secure, and equal. I commend all those who have taken part in its development, especially the families and survivors whose courage has formed the core of this deeply important work.</p>\n\n<p>“As part of our federal contribution to the National Action Plan, the<em> </em>Federal Pathway<em>, </em>we<em> </em>will work closely with families and survivors, grassroots organizations, and Indigenous leaders on the implementation of a comprehensive and holistic approach to end the systemic racism, sexism, ableism, and economic inequality that has perpetuated violence against Indigenous women, girls, and two-spirit and LGBTQ people. True to the themes in the National Inquiry’s Final Report, the Federal Pathway focuses on four themes: culture, health and wellness, human security and safety, and justice. We are proposing historic new investments of $2.2 billion over five years, and $160.9 million ongoing, to support the implementation of the initiatives in the Federal Pathway. This new funding is part of the $18 billion in Budget 2021 to improve Indigenous people’s lives and advance reconciliation.</p>\n\n<p>“But new funding won’t bring back the lives we have lost or heal the pain that so many feel and, as we move forward, we all have a role to play in ending this tragedy and telling the truth of these injustices. Together, with families, survivors, Indigenous partners, and provincial and territorial governments, we will continue to respond to the National Inquiry’s Final Report in a way that honours those we have lost, leads to transformative change, and protects current and future generations.”</p></div>\n      "
}