{
  "path": "/en/news/statements/2021/02/06/statement-prime-minister-selection-next-premier-nova-scotia",
  "pageTitle": "Statement by the Prime Minister on the selection of the next premier of Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the selection of the next premier of Nova Scotia:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Iain Rankin on his successful bid to become the leader of the Nova Scotia Liberal Party and the next premier of the province.</p>\n\n<p>“I look forward to working closely with Mr. Rankin to continue to do whatever it takes, for as long as it takes, to protect and support Nova Scotians and all Canadians during this challenging time. Together, we will continue the fight against COVID-19, build an economy that works for everyone, and move forward on the issues that matter most to the province. By leveraging the <a href=\"https://www.canada.ca/en/atlantic-canada-opportunities/atlanticgrowth.html\">Atlantic Growth Strategy</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/09/connecting-all-canadians-high-speed-internet#:~:text=The%20Universal%20Broadband%20Fund%20was,by%20the%20end%20of%202023.\">securing fast and reliable internet access for rural communities</a>, and <a href=\"https://www.canada.ca/en/natural-resources-canada/news/2021/01/canada-invests-in-electric-vehicle-grid-integration-pilot-project-in-nova-scotia.html\">investing</a> in clean energy, we will create new middle class jobs, strengthen local communities, and build back better for everyone in Nova Scotia.</p>\n\n<p>“I also thank Stephen McNeil for his many years of service to Nova Scotia and Canada. His leadership and dedication to the people of Nova Scotia has created economic growth and inclusive communities. Most recently, he has worked tirelessly to keep Nova Scotians healthy and supported during the pandemic. I’m grateful for Premier McNeil’s valuable partnership and wish him and his family the very best in the future.”<em> </em></p></div>\n      "
}