{
  "path": "/en/news/news-releases/2020/01/26/interim-president-venezuela-juan-guaido-visit-canada",
  "pageTitle": "Interim President of Venezuela Juan Guaidó to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Interim President of Venezuela, Juan Guaidó, will visit Canada on January 27.</p>\n\n<p>The two leaders will discuss the importance of democracy and the need to respect the Venezuelan Constitution. Canada has pledged its steadfast&nbsp;support for Interim President Juan Guaidó of Venezuela and has called for a peaceful, Venezuelan-led transition toward free and fair elections as soon as possible.</p>\n\n<p>During the visit, Interim President Guaidó will also meet with François-Philippe Champagne, Minister of Foreign Affairs, and Karina Gould, Minister of International Development.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>”I commend Interim President Guaidó for the courage and leadership he has shown in his efforts to return democracy to Venezuela, and I offer Canada’s continued support. Canadians stand with the people of Venezuela in their pursuit of free and fair elections and basic human rights.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada<strong>&nbsp;</strong></footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On January 23, 2019, Juan Guaidó was declared Interim President of Venezuela.</li>\n\t<li>Canada has imposed targeted sanctions against 112 Maduro regime officials and, in collaboration with five other countries in the Americas, referred the Maduro regime’s illegitimate hold on power in Venezuela to the International Criminal Court.</li>\n\t<li>Canada has downgraded diplomatic relations and restricted engagement with the Maduro regime, in an effort to push for the peaceful restoration of Venezuela’s democracy.</li>\n\t<li>Canada has&nbsp;contributed&nbsp;over $66 million in stabilization, humanitarian, and development programming to address the regional migration and refugee crisis.</li>\n</ul>\n\n<h2>Associated Link&nbsp;</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/venezuela.aspx?lang=eng\">Canada and the Venezuela crisis</a></li>\n</ul></div>\n      "
}