{
  "path": "/en/news/news-releases/2019/05/29/prime-minister-travel-united-kingdom-and-france-75th-anniversary-d",
  "pageTitle": "Prime Minister to travel to United Kingdom and France for the 75th anniversary of D-Day and the Battle of Normandy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The 1944 Battle of Normandy—from the D-Day landings on June 6 to the liberation of Paris on August 25—was a pivotal event in the Second World War and one of Canada's greatest military accomplishments.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that he will travel to Portsmouth, Juno Beach, and Paris from June 4 to 7, 2019.</p>\n\n<p>Prime Minister Trudeau will attend commemorative events to mark the 75th anniversary of D-Day and the Battle of Normandy. The Canadian delegation will include the Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay, Veterans, representatives from Indigenous and Veterans organizations, parliamentarians, and young Canadians.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We owe an immeasurable debt to the veterans, the fallen, and all their loved ones who served and sacrificed during the Second World War. As we mark the 75th anniversary of D-Day, we come together to honour the Allied troops who came ashore that day and changed the course of history.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Portsmouth, England, an important British industrial city and port during the Second World War, was a major point of departure for the Allied fleet that sailed to the beaches of Normandy in June 1944.</li>\n\t<li>The Allied high command made the decision to attack on June 6, 1944—a date that has become known to history as “D-Day.” A massive Allied force would cross the English Channel, heading for an 80-kilometre stretch of the Normandy coast. There were five landing zones assigned to the forces of Allied nations: Juno Beach (Canada); Gold Beach (United Kingdom); Sword Beach (United Kingdom and France); and Utah Beach and Omaha Beach (United States).</li>\n\t<li>On August 25, 1944, the Allies liberated Paris, officially ending the Battle of Normandy.</li>\n\t<li>More than 45,000 Canadians lost their lives during the Second World War, of whom over 5,000 were killed during the Battle of Normandy and 359 on D-Day.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/history/historical-sheets/d-day\">75th Anniversary of the D-Day and the Battle of Normandy</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng&amp;_ga=2.65907431.858348360.1558665629-442098123.1558665629\">Canada-France bilateral relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.236244552.858348360.1558665629-442098123.1558665629\">Canada-United Kingdom bilateral relations</a></li>\n</ul></div>\n      "
}