{
  "path": "/en/news/statements/2021/12/08/statement-prime-minister-launch-christmas-lights-across-canada",
  "pageTitle": "Statement by the Prime Minister on the launch of Christmas Lights Across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the launch of the 37th edition of Christmas Lights Across Canada, which will run until January 7, 2022:</p>\n\n<p>“This evening, Canadians will have a chance to experience the spectacular new multimedia projection on Parliament Hill during the opening night of&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/christmas-lights.html\">Christmas Lights Across Canada</a>.</p>\n\n<p>“Over the next month, thousands of lights will illuminate prominent sites and monuments in the National Capital region and in Canadian provincial capitals from coast to coast to coast – uniting loved ones through the spirit of the season, whether they are together or apart. This year, we will also broadcast IllumiNATION — A Celebration of the Winter Solstice. The television show will invite Canadians to discover cultural traditions, legends, and customs from around the country, featuring a variety of artistic presentations from across Canada.</p>\n\n<p>“As we kick off the winter season with this festive tradition, we reflect on the past year where Canadians across the country came together and met the challenges of the COVID-19 pandemic with generosity, courage, and compassion. These lights are a reminder of our bright future and better days in the year ahead. During this celebration, we are also reminded of our cherished Canadian values – peace, unity, and hope for the future – which guide us in times when the world seems dark.&nbsp;These values are what the world needs now more than ever before. Together, we know that we are able to shape things for the better.</p>\n\n<p>“On behalf of the Government of Canada, I invite everyone to join the Christmas Lights Across Canada festivities in person or watch IllumiNATION, on December 21 at 8 p.m. EST on the Canadian Heritage <a href=\"https://www.youtube.com/c/CdnHeritage\">YouTube channel</a>. From our family to yours, Sophie and I wish all those celebrating a joyful Christmas season.”</p></div>\n      "
}