{
  "path": "/en/news/news-releases/2023/03/09/president-united-states-joe-biden-visit-canada",
  "pageTitle": "President of the United States Joe Biden to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of the United States, Joe Biden, will visit Canada on March 23 to 24, 2023 to continue working closely together to strengthen trade ties, create good jobs, grow the middle class, and drive economic growth that benefits everyone on both sides of the border. They will also continue to increase collaboration on defence and security, climate action, and immigration.</p>\n\n<p>With the Canada-United States-Mexico Agreement as the foundation, Prime Minister Trudeau and President Biden will underscore the importance of our mutually beneficial economic relationship to bolster competitiveness and build resilient supply chains, including on critical minerals – the building blocks for the clean economy. They will also discuss the progress made under the February 2021 Roadmap for a Renewed U.S.-Canada Partnership to advance bilateral cooperation on shared priorities including taking ambitious climate action and advancing countries where no one is left behind.</p>\n\n<p>Keeping North Americans safe from new and emerging threats requires a coordinated response. During the visit, the Prime Minister and the President will highlight ongoing cooperation on continental defence, including NORAD’s key role in defending North America. They will also advance cooperation in the Arctic.</p>\n\n<p>Prime Minister Trudeau and President Biden will also continue to cooperate on global issues of mutual interest including continuing their unwavering support for Ukraine as it defends itself against Russia’s war of aggression and advancing solutions to the broader global impacts of the war like food and energy security. They will also continue to support the people of Haiti and Haitian-led efforts to address the ongoing crisis. The leaders will further commit to advancing our countries’ shared priorities in the Indo-Pacific region, including national security, economic prosperity, respect for international law and human rights, democratic values, public health, and protecting our environment.</p>\n\n<p>Canada and the United States are steadfast partners in upholding democracy, human rights, and respect for the rule of law, and we will always work together to defend these shared values in our countries and beyond.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the United States are allies, neighbours, and most importantly, friends. As we face increasing global uncertainty, we will continue working together as we defend our continent and our shared values, create more opportunities for people and businesses on both sides of the border, and build strong economies as reliable suppliers as we move toward a net-zero world. I look forward to welcoming President Biden to Canada.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be President Biden’s first in-person visit since becoming president.</li>\n\t<li>Prime Minister Trudeau and President Biden have met on numerous occasions since the President’s inauguration in January 2021, including the first bilateral (virtual) meeting in February 2021, and again in November 2021, in Washington DC, in June 2022, in Los Angeles and in January 2023, at the North American Leaders Summit in Mexico City. They have also met on the margins of several international summits and meetings.&nbsp;</li>\n\t<li>He will be joined by the First Lady of the United States, Jill Biden.</li>\n\t<li>During his visit, the President will make an address to Parliament.</li>\n\t<li>Canada and the U.S. share the longest land border in the world, which is close to 9,000 km in length.</li>\n\t<li>It is estimated that around 400,000 people crossed the Canada-United States border every day (pre-pandemic) and that there were about 800,000 Canadian citizens living in the United States in 2021.</li>\n\t<li>Canada and the U.S. share one of the largest trading relationships in the world, with over $1 trillion in bilateral trade in goods and services in 2021, making Canada the largest U.S. trading partner in goods and services.</li>\n\t<li>Canada and the U.S. are each other’s top sources of imported energy.</li>\n\t<li>In February 2021, Prime Minister Trudeau and U.S. President Biden launched the Roadmap for a Renewed U.S.-Canada Partnership, which lays out an ambitious framework to grow our economies, strengthen the middle class, and build a healthier future.</li>\n\t<li>In 2021, Prime Minister Trudeau and U.S. President Biden established the Canada-U.S. Supply Chain Working Group which strengthens bilateral supply chain security and resilience and reinforces our deeply interconnected and mutually beneficial economic relationship.</li>\n\t<li>The Canada-United States-Mexico Agreement (CUSMA) is one of the largest free trade regions in the world, generating economic growth and helping to raise the standard of living for the people of all the member countries.</li>\n\t<li>Canada and the United States work closely in multilateral fora, such as: Arctic Council, Asia-Pacific Economic Cooperation (APEC), G20, G7, North Atlantic Treaty Organization (NATO), Organization of American States (OAS), Organisation for Economic Co-operation and Development (OECD), Organization for Security and Co-operation in Europe (OSCE), United Nations (UN) and World Trade Organization (WTO).</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada and United States Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n</ul></div>\n      "
}