{
  "path": "/en/news/statements/2022/11/16/statement-prime-minister-louis-riel-day",
  "pageTitle": "Statement by the Prime Minister on Louis Riel Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Louis Riel Day:</p>\n\n<p>“Today, we join the Métis People and Canadians across the country to commemorate the life of Louis Riel. The great Métis leader and founder of Manitoba was a defender of Métis rights, protector of their land, and advocate for the distinct Michif language and culture of the Métis People.</p>\n\n<p>“On this day in 1885, Louis Riel was tragically executed for leading the Northwest Resistance in defence of Métis rights. Throughout his life, Louis Riel was an impassioned advocate for equality, minority rights, and Indigenous Peoples. His contributions to the Métis People have helped define Canada as we know it today.</p>\n\n<p>“As we celebrate Louis Riel’s legacy and reflect on his vision of strong and prosperous Métis communities across the Homeland, we acknowledge that a lot of important work remains to be done on the journey to reconciliation, based on respect, cooperation, and partnership. The Government of Canada is committed to building a renewed relationship with the Métis and all Indigenous Peoples from coast to coast to coast.</p>\n\n<p>“The Canada-Métis Nation Accord, signed in 2017, has provided a framework for a renewed, respectful, and constructive Métis Nation-Crown relationship. The Accord has guided initiatives like the Government of Canada’s investments to build a Métis Nation Early Learning and Childcare system to improve culturally grounded early learning programs and support for Métis communities’ housing priorities.</p>\n\n<p>“Today, as we celebrate Louis Riel, I encourage all Canadians to learn more about the important contributions the Métis People has made – and continues to make – to Canada. Today and every day, we recommit to breaking down barriers they face and building a better Canada for everyone.”</p></div>\n      "
}