{
  "path": "/en/news/news-releases/2020/03/04/prime-minister-creates-committee-covid-19",
  "pageTitle": "Prime Minister creates committee on COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada’s top priority is the wellbeing and safety of all Canadians. With the COVID-19 outbreak evolving rapidly internationally, we need to continue working closely with local, provincial, territorial, and international partners to reduce potential risks to Canadians and our economy.</p>\n\n<p>While Canada has not experienced the impacts that other countries are experiencing right now, we must be prepared for all scenarios and closely follow best practices around the world. The Prime Minister, Justin Trudeau, today announced the creation of a new Cabinet committee on COVID-19.</p>\n\n<p>The Cabinet Committee on the federal response to the coronavirus disease (COVID-19) will complement the work being done by the Incident Response Group. It will meet regularly to ensure whole-of-government leadership, coordination, and preparedness for a response to the health and economic impacts of the virus. This includes coordination of efforts with other orders of government.</p>\n\n<p>The Committee will continue the measures already taken by the Government of Canada to limit the spread of the virus, and to make sure we are protecting the health and safety of all Canadians. Canadians are encouraged to follow regular updates and technical briefings that will continue to be led by the Public Health Agency of Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We take the international spread of COVID-19 seriously, and Canadians can be assured that their government and health officials are working tirelessly to keep them safe. This new committee will continue to monitor the health and economic impacts of the virus, and make sure our response&nbsp;takes all possible measures to prevent and limit the spread of the virus in Canada.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The members of the Cabinet Committee are:\n\t<ul>\n\t\t<li>The Hon. Chrystia Freeland (Chair)</li>\n\t\t<li>The Hon. Jean-Yves Duclos (Vice-Chair)</li>\n\t\t<li>The Hon. Navdeep Singh Bains</li>\n\t\t<li>The Hon. William Sterling Blair</li>\n\t\t<li>The Hon. Patricia Hajdu</li>\n\t\t<li>The Hon. Mélanie Joly</li>\n\t\t<li>The Hon. William Francis Morneau</li>\n\t\t<li>The Hon. Carla Qualtrough</li>\n\t</ul>\n\t</li>\n\t<li>The Honourable Kirsty Duncan, Deputy Leader of the Government in the House of Commons, will also be a core participant of the meetings.</li>\n\t<li>Canada has multiple systems in place to prepare for, prevent, detect, and respond to the spread of COVID-19. These include the following:\n\t<ul>\n\t\t<li>The Public Health Agency of Canada activated the Health Portfolio Operations Centre to ensure effective planning and coordination of the Agency's response efforts, in collaboration with international, federal, provincial, and territorial partners.</li>\n\t\t<li>The Public Health Agency of Canada, through Canada’s Chief Public Health Officer, is also in close contact with provincial and territorial Chief Medical Officers of Health to share information, coordinate response efforts, and support informed vigilance as the situation evolves.</li>\n\t\t<li>A Special Advisory Committee of Canada’s Chief Medical Officers of Health and senior public health officials is in place and&nbsp;focused on the coordination of federal, provincial and territorial preparedness and response across Canada’s health systems.</li>\n\t\t<li>Public Safety Canada has initiated the Government of Canada Operations Centre to coordinate activities across federal departments and agencies.&nbsp;</li>\n\t\t<li>Routine traveller screening procedures are in place at all of Canada’s ports of entry, and additional border screening measures have been expanded to all international airports in Canada to help identify any travellers returning to Canada who may be ill, and to raise awareness among travellers about what they should do if they become sick.</li>\n\t</ul>\n\t</li>\n\t<li>For the latest and most up-to-date information, visit canada.ca/coronavirus or call the new toll-free phone line (<a href=\"tel:1-833-784-4397\">1-833-784-4397</a>) to get answers to questions about the COVID-19.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_coronavirus\">Coronavirus disease (COVID-19): Outbreak update</a></li>\n\t<li><a href=\"https://travel.gc.ca/travelling/advisories\">Travel Advice and Advisories</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}