{
  "path": "/en/news/statements/2021/11/08/statement-prime-minister-indigenous-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Indigenous Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark Indigenous Veterans Day:</p>\n\n<p>“Today, on <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1605286948270/1605287188462\">Indigenous Veterans Day</a>, we honour Indigenous peoples – past and present – who have served and continue to serve with great pride and sacrifice for our freedom.</p>\n\n<p>“Each year, during Veterans’ Week and Remembrance Day, Canadians join together to acknowledge all those who served our country. But throughout our history, Indigenous veterans have not always been treated equally. Today serves as a reminder of their important contributions and bravery, and this year, the National Flag on the Peace Tower in Ottawa, and on all Government of Canada buildings and establishments across the country, is being lowered to honour and acknowledge the sacrifices Indigenous veterans have made for our country.</p>\n\n<p>“On this day, we recognize Indigenous women and men from across this land who have a proud tradition of military service. They have risked their lives to protect and defend our shared values and fundamental freedoms and the liberty of our partners and allies. From the War of 1812 through the two World Wars and the Korean War, to the recent conflicts in the Middle East and Afghanistan, they have strived to help bring peace and stability to some of the most unstable places in the world. Indigenous veterans have a proud legacy of courage, service, and excellence in the Canadian Armed Forces that continues today with the more than 2,500 Indigenous men and women making a difference across Canada and abroad. This includes in Canada’s Arctic and Northern regions, where Canadian Rangers use their unique survival skills to conduct important cold weather operations and assist with the national response to the pandemic in Indigenous communities.</p>\n\n<p>“Today, we also remember and express our heartfelt gratitude to the countless Indigenous soldiers, sailors, and aviators who lost their lives, and honour those who continue to live with scars, both seen and unseen. We will forever be grateful to them and their families for their service and sacrifices.</p>\n\n<p>“Canada recognizes in many ways the important contributions made by Indigenous veterans in defending our shared values and fundamental freedoms. This includes the <a href=\"https://www.veterans.gc.ca/eng/remembrance/memorials/canada/national-aboriginal-veterans-monument\">National Aboriginal Veterans Monument</a> in Ottawa, which commemorates their long tradition of military service. As we continue to walk the shared path of reconciliation, the government is working to ensure that all Indigenous veterans receive the recognition, the support, and the care they deserve.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to take a moment today to recognize the service and sacrifices of Indigenous veterans, and to preserve the memory of those who wore the uniform and gave their lives for our country. This year, as we continue to follow public health guidelines to keep each other and our communities safe, I encourage Canadians to visit the <a href=\"https://www.facebook.com/CanadaRemembers\">online commemorations</a>, share their stories, and wear a poppy in honour of our brave service members.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}