{
  "path": "/en/news/readouts/2022/02/19/prime-minister-justin-trudeau-convenes-seventh-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the seventh Incident Response Group meeting on the illegal blockades and occupations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the seventh meeting of the Incident Response Group where ministers and senior officials provided updates on the current situation and an assessment of the progress being made under the <em>Emergency Measures Regulations</em> and the <em>Emergency Economic Measures Order</em> under the <em>Emergencies Act. </em>It was reemphasized that the scope of the measures will be&nbsp;time-limited, as well as reasonable and proportionate to the threats they are meant to address.</p>\n\n<p>The group acknowledged the important work of Parliamentarians in the House of Commons as it resumed debate today on the government’s decision to invoke the <em>Emergencies Act </em>as significant enforcement actions were taking place in front of Parliament Hill.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>\n\n<p>The group was briefed on the ongoing efforts by police in Ottawa, where law enforcement agencies from across Canada have worked together using a strong and measured approach to restore order in the city’s downtown core. They recognized the efforts of the police forces, who have worked around-the-clock to end the occupation. Their work has resulted in at least 170 arrests, several charged and dozens of vehicles being towed since yesterday, including some blockades being removed.</p>\n\n<p>The group discussed the announcement earlier today of an investment of up to $20 million to provide non-repayable contributions to Ottawa businesses who have suffered losses due to the illegal blockades and occupations. They noted the significant costs to Canadians caused by these illegal blockades – from policing costs to disruption of our supply chains due to blockades at ports of entry. They were also provided with an update on the progress in implementing finance-related measures under the&nbsp;<em>Emergency Economic Measures Order.</em> It includes the freezing of 113 financial products, the disclosure of 47 entities, 251 Bitcoin addresses have been shared with virtual currency exchangers, and one financial institution proactively freezing the account of a payment processor to a value of $3.8 million.</p>\n\n<p>The group was briefed on the work being done by other federal government organizations, as well as efforts underway across the country to avoid further blockades, including at the Pacific Highway border crossing in British Columbia and at Prescott, Ontario. They reconfirmed the goal to bring a safe end to these illegal blockades and occupations and see order restored as soon as possible to ensure the safety of Canadians and an end to the economic disruptions.</p>\n\n<p>The Prime Minister and ministers were also briefed on the latest intelligence assessment in relation to the situation in and around Ukraine by General Wayne Eyre, the Chief of the Defence Staff, and on the delivery of Canada’s lethal military aid that arrived today in Ukraine.&nbsp;They also noted the G7 Foreign Ministers’ statement today that called on Russia to choose the path of diplomacy, to de-escalate tensions, to substantively withdraw military forces from the proximity of Ukraine’s borders and to fully abide by international commitments. They emphasized that any further military incursion into Ukraine would have severe costs and consequences, including through coordinated sanctions.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/18/prime-minister-justin-trudeau-convenes-sixth-incident-response-group\">Prime Minister Justin Trudeau convenes the sixth Incident Response Group meeting on the illegal blockades and occupations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/economic-development-southern-ontario/news/2022/02/government-of-canada-invests-up-to-20-million-to-support-downtown-ottawa-businesses-impacted-by-demonstrations.html\">Government of Canada invests up to $20 million to support downtown Ottawa businesses impacted by demonstrations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/statement-the-by-g7-foreign-ministers-on-russia-and-ukraine.html\">Statement by G7 Foreign Ministers on Russia and Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/02/federal-government-declares-a-public-order-emergency-under-the-emergencies-act-to-end-disruptions-blockades-and-the-occupation-of-the-city-of-ottawa.html\">Federal government declares a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades, and the occupation of the city of Ottawa</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/02/15/canada-invokes-emergencies-act-limit-funding-illegal-blockades-and\">Canada invokes the <em>Emergencies Act</em> to limit funding of illegal blockades and restore public order</a>&nbsp;&nbsp;</li>\n</ul></div>\n      "
}