{
  "path": "/en/news/statements/2021/07/28/statement-prime-minister-200th-anniversary-perus-independence",
  "pageTitle": "Statement by the Prime Minister on the 200th anniversary of Peru’s independence | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 200th anniversary of Peru’s independence:</p>\n\n<p>“Today, we join Peruvian communities in Canada and around the world in celebrating the bicentennial of Peru’s independence.</p>\n\n<p>“Our two countries enjoy a strong relationship built on common values and warm people-to-people ties. We also share a close trade and commercial relationship, strengthened by the Canada-Peru Free Trade Agreement and the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, which create jobs and new opportunities for people in both countries and make Peru one of Canada’s most important Latin American trading partners.</p>\n\n<p>“We work closely to foster sustainable economic development, advance gender equality, and promote human rights and democracy, both thanks to our bilateral relationship and through our common membership in the United Nations, the Organization of American States, and the Asia-Pacific Economic Cooperation. Canada also supports Peru through a development assistance program, which focuses on reducing poverty and inequality, improving business competitiveness, and reducing vulnerability to climate change in Peru.</p>\n\n<p>“The growing community of over 40,000 Canadians of Peruvian origin has enriched our national fabric and further strengthened the ties between our countries. We look forward to continuing to deepen our relationship and work together on shared priorities, including meeting the needs of Venezuelan migrants and refugees, promoting Indigenous rights, language, and culture, and supporting the global response to COVID‑19.</p>\n\n<p>“Today, I invite all Canadians to celebrate the ties that unite Canada and Peru and the important contributions that Peruvian Canadians make to our country. On behalf of the Government of Canada, I extend my best wishes to all those celebrating the 200th Peruvian Independence Day, here in Canada and around the world.”</p></div>\n      "
}