{
  "path": "/en/news/news-releases/2020/04/03/prime-minister-announces-support-food-banks-and-local-food",
  "pageTitle": "Prime Minister announces support for food banks and local food organizations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Food banks and local food organizations provide help to Canadians across the country, particularly people and communities most vulnerable to economic uncertainty. These organizations are facing an increased demand for their services, and added pressure from shortages in donations and volunteers. Now more than ever, they need our support to continue offering the services Canadians rely on to feel safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of $100 million to improve access to food for Canadians facing social, economic, and health impacts of the COVID-19 pandemic.</p>\n\n<p>The Government of Canada will provide funding to national, regional, and local organizations across Canada that are able to reach people and communities experiencing food insecurity. These organizations – including but not limited to Food Banks Canada, Salvation Army, Second Harvest, Community Food Centres Canada, and Breakfast Club of Canada – will work with partners to meet the urgent food needs of Canadians, including Indigenous peoples and Northern populations.</p>\n\n<p>This funding will be used to purchase food and other basic necessities. It will help these organizations find new, creative ways to reach people in need, so they can continue to carry out their important work while respecting physical distancing guidelines. They will be able to use the funding to buy or rent equipment and other materials to help address the unique needs of the communities they serve and the health-related challenges presented by COVID-19.</p>\n\n<p>By supporting Canada’s food banks and local food organizations, we are making sure vulnerable Canadians can get the food they need, when they need it most.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Many Canadians rely on food banks and local food organizations to feed their families and find support in hard times. Now, with more Canadians turning to these supports, and donations and available volunteers decreasing, they need our help more than ever. Today, we are giving food agencies the support they need to keep helping Canadians through this difficult time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Food banks and local food organizations are on the front lines making sure people get essential food support in their time of need. I encourage all my fellow Members of Parliament to contact the food security organizations in their region&nbsp;to ensure that the entire country is covered. If necessary, other networks will be added to the list of partners.”</p>\n\n<footer class=\"default\">The Hon. Marie-Claude Bibeau, Minister of Agriculture and Agri-Food</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2019, there were 1.1 million visits to food banks and 5.6 million meals served on average each month. It is expected that visits to food banks will increase significantly due to the COVID-19 pandemic.</li>\n\t<li>Without additional support, COVID-19 will have a disproportionate impact on vulnerable populations who are facing challenges dealing with the health, social, and economic impacts of the pandemic. Risks of stress and hardship are expected to rise as people become unable to access the social and community supports on which they usually rely.</li>\n\t<li>The $100 million investment is divided as follows:\n\t<ul>\n\t\t<li>$50 million to Food Banks Canada</li>\n\t\t<li>$20 million divided evenly between Salvation Army, Second Harvest, Community Food Centres Canada, and Breakfast Club of Canada</li>\n\t\t<li>$30 million for local-level organizations who serve people experiencing food insecurity</li>\n\t</ul>\n\t</li>\n\t<li>Funding will be delivered through the Government of Canada’s Local Food Infrastructure Fund. The Fund, launched in the summer of 2019, aims to strengthen food systems and facilitate access to safe and nutritious food for at-risk populations. Currently, more than 360 projects are receiving funding to increase accessibility of healthy, local foods within their communities, including through urban gardens, community kitchens, food banks, and greenhouses.</li>\n\t<li>Eligible activities for this new funding include the purchase of food, support for the transportation and distribution of food, hiring temporary help to fill volunteer shortages, and activities to implement biosecurity measures, such as the purchase of personal protective equipment, to reduce the spread of COVID-19 among volunteers and clients.</li>\n\t<li>The Local Food Infrastructure Fund is part of the Food Policy for Canada, the Government’s roadmap for a healthier and more sustainable food system in Canada. The Food Policy’s goal it to ensure that all people in Canada are able to access a sufficient amount of safe, nutritious, and culturally diverse food. It is focused on ensuring that our food system is resilient and innovative, sustains our environment, and supports our economy.&nbsp;</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update.html\">COVID-19: Changes to Canadian taxes and benefits</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/food-policy.html\">Food Policy for Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n</ul></div>\n      "
}