{
  "path": "/en/news/statements/2018/04/03/prime-minister-welcomes-final-report-special-envoy-myanmar",
  "pageTitle": "Prime Minister welcomes final report from Special Envoy to Myanmar | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the final report from his Special Envoy to Myanmar, the Honourable Bob Rae:</p><p>“Today, I welcome the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/rep_sem-rap_esm.aspx?lang=eng\">final report</a> from the Special Envoy to Myanmar, Bob Rae. I appreciate Mr. Rae’s thorough work as Special Envoy, and thank him for his invaluable insights, his professionalism, and his thoughtful recommendations.</p><p>“Canada is determined to help respond to this crisis. In the coming weeks, we will assess the recommendations in this report and outline further measures we intend to take.</p><p>“This report brings much needed awareness to the grave humanitarian crisis and gross violations of human rights faced by hundreds of thousands of people including Rohingya communities, other religious and ethnic minorities, and women and girls.</p><p>“Canada continues to drive critical humanitarian work in the region. Since the beginning of 2017, we have provided $45.9 million for aid partners to deliver life-saving and gender-responsive support for refugees, displaced people, and the communities who are hosting them. This includes $12.5 million for the Myanmar Crisis Relief Fund that matched the generous contributions Canadians made last year.</p><p>“We will continue to work closely with the international community and the United Nations on a path forward. We share a global responsibility to respond to this crisis and meet the needs of those displaced and most vulnerable.”</p></div>\n      "
}