{
  "path": "/en/news/news-releases/2021/06/14/prime-minister-concludes-productive-nato-summit",
  "pageTitle": "Prime Minister concludes productive NATO Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in the NATO Summit in Brussels, Belgium. At the Summit, leaders discussed threats and challenges affecting transatlantic security and joint efforts to strengthen shared commitments to keep our people safe. Leaders also welcomed an ambitious NATO 2030 agenda that will continue NATO’s adaptation to address evolving security challenges, including the security implications of climate change.</p>\n\n<p>During the meeting, Prime Minister Trudeau reiterated Canada’s unwavering commitment to NATO and to Alliance values, including individual liberty, democracy, human rights, and the rule of law. The Prime Minister highlighted Canada’s contributions and leadership within NATO, including our leadership of the enhanced Forward Presence Battle Group in Latvia, our command of Standing NATO Maritime Group One, with Her Majesty’s Canadian Ship <em>Halifax</em> as its flagship, as well as our contributions to NATO Mission Iraq and NATO’s Kosovo Force.</p>\n\n<p>Climate change is one of the greatest threats of our time, impacting all of our people and our global security. Prime Minister Trudeau announced Canada’s proposal to establish and host a new NATO Centre of Excellence on Climate and Security and work with Allies as the Centre’s framework nation. It would provide Allies with a central location to pool their knowledge and develop effective preparedness and responses to the security impacts of climate change.</p>\n\n<p>The Prime Minister also announced Canada’s contribution of $1 million to the NATO Trust Fund to support United Nations (UN) peace operations. This project aims to increase the safety and security of peacekeepers deploying to UN peace operations around the world.</p>\n\n<p>Recognizing the increasingly broad and sophisticated cyber threats facing Allies, Prime Minister Trudeau highlighted that Canada is providing cyber effects to NATO. This contribution will help shape how cyber operations will be integrated into NATO missions and operations. The Prime Minister reiterated that Canada’s cyber operations will be subject to all applicable domestic and international law.</p>\n\n<p>Prime Minister Trudeau joined Allies in endorsing the NATO 2030 agenda, and reaffirming the solidarity, unity, and cohesion of the Alliance. NATO 2030 sets out an ambitious agenda for a renewed and reinvigorated Alliance, which will enable NATO to meet the security challenges of today and tomorrow.</p>\n\n<p>The Prime Minister also participated in&nbsp;the German Marshall Fund’s <em>NATO 2030 at Brussels Forum </em>along with the Prime Minister of Estonia, Kaja Kallas. At the event, the Prime Minister reiterated Canada’s commitment to work with our Allies and partners to tackle global challenges, like ending COVID-19, fighting the climate crisis, and keeping our people safe. He also highlighted Canada’s role in NATO, and the importance that the Alliance has on our collective security and the promotion of democratic values around the world.</p>\n\n<p>Canada is a proud member of NATO, and the Summit was an opportunity for Allies to discuss shared priorities and values. Together, we will continue to protect our people and build a safer and more peaceful world for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As a founding member of NATO, the Alliance has been a cornerstone of Canada’s defence and security for more than 70 years. The advances we made at this Summit &nbsp;will ensure NATO continues to adapt to meet the security challenges of today and tomorrow, including those brought on by climate change, and will build a safer and more resilient world for our people.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister held meetings with the Secretary General of NATO, Jens Stoltenberg, the President of Latvia, Egils Levits, the Prime Minister of the Netherlands, Mark Rutte, and the Prime Minister of Spain, Pedro Sánchez.</li>\n\t<li>NATO Allies also endorsed the NATO Climate Change and Security Action Plan, the new NATO Comprehensive Cyber Defence Policy, a new NATO Policy on Preventing and Responding to Conflict-Related Sexual Violence, and a Strengthened Resilience Commitment. NATO Leaders also tasked the Secretary General to begin the process to update NATO’s Strategic Concept.</li>\n\t<li>NATO is a cornerstone of Canada’s international security and defence policy, and the primary international forum in which to engage and collaborate with Allies and Partner nations on transatlantic defence and security.<strong> </strong></li>\n\t<li>Canada is committed to NATO’s principle of collective defence and is providing direct support to NATO missions and operations. Currently, Canada is:\n\t<ul>\n\t\t<li>Leading the multinational NATO enhanced Forward Presence Battle Group in Latvia as a framework nation as part of Operation REASSURANCE since 2017.</li>\n\t\t<li>Commanding Standing NATO Maritime Group One (SNMG1) as part of Operation REASSURANCE, with Her Majesty’s Canadian Ship <em>Halifax</em> as its flagship. Canada is leading the mission until January 2022. SNMG1 operates in Western and Northern European waters, including the Baltic, North, and Norwegian Seas.</li>\n\t\t<li>Deploying Canadian Armed Forces members as part of NATO Mission Iraq (NMI) through Operation IMPACT. Canada is a strong supporter of NMI and commanded the mission from 2018 to 2020.</li>\n\t\t<li>Providing logistical and headquarters support to NATO’s Kosovo Force through Operation KOBOLD.</li>\n\t</ul>\n\t</li>\n\t<li>Canada also contributes to transatlantic security through our support for Ukraine’s security and stability, including through our military training mission, Operation UNIFIER.</li>\n\t<li>NATO&nbsp;Centres of Excellence (COEs)&nbsp;are international military organizations that are established, run and funded by individual NATO Allies (Framework Nations). NATO COEs train and educate personnel from Allied and Partner countries on specialized topics of relevance to NATO.&nbsp;A Canada-led NATO&nbsp;Centre of Excellence (COE) on Climate and Security&nbsp;would&nbsp;be an important vehicle for the Alliance to better understand, adapt to,&nbsp;and address the security implications of climate change.&nbsp;This would be&nbsp;the first NATO&nbsp;COE established in&nbsp;Canada.</li>\n\t<li>Canada’s contribution to&nbsp;NATO’s Trust Fund to support UN peacekeepers will allow NATO to share its expertise with the UN in key areas, including&nbsp;military performance and evaluation, medical care, countering improvised-explosive devices, and signals information and communications technology. This will contribute to more effective peace operations.</li>\n\t<li>By integrating Canada’s sovereign cyber effects into NATO&nbsp;operations and missions, Canada is&nbsp;joining a group&nbsp;of Allies volunteering to integrate their sovereign cyber effects to help achieve NATO operational objectives.&nbsp;Canada’s cyber operations will be subject to all applicable domestic and international law.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/14/strengthening-transatlantic-defence-and-security\">Backgrounder: Strengthening Transatlantic Defence and Security</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nato.int/\">North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/news_185000.htm?selectedLocale=en\">Brussels Summit Communiqué</a></li>\n\t<li><a href=\"https://www.nato.int/nato2030/#:~:text=NATO%202030%3F&amp;text=To%20support%20the%20Secretary%20General's,NATO%20an%20even%20stronger%20Alliance.\">NATO 2030</a></li>\n</ul></div>\n      "
}