{
  "path": "/en/news/readouts/2022/09/15/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister and the President discussed Canada’s continued assistance to Ukraine and work with like-minded partners to address the broader global impacts of Russia’s illegal and unjustifiable aggression. They spoke of the importance of maintaining strong unity amongst allies and continuing to impose severe costs on Russia in the face of its invasion of Ukraine.</p>\n\n<p>The Prime Minister commended the President’s leadership in defence of Ukraine and our shared democratic values. He highlighted the courage of the Ukrainian people in coming together to defend their country and their freedoms against Russia’s ongoing attacks. The Prime Minister welcomed Ukraine’s recent military gains, and reiterated Canada’s strong ongoing support for Ukraine, including military assistance. The leaders also discussed the need for increased support as the winter approaches. President Zelenskyy thanked Prime Minister Trudeau for Canada’s military, humanitarian, and development aid to Ukraine.</p>\n\n<p>The leaders strongly condemned Russia’s increasingly persistent, indiscriminate, and horrific attacks on civilians and civilian infrastructure in Ukraine. The Prime Minister also voiced his concern about the situation at the Zaporizhzhia nuclear power plant, in southeastern Ukraine. They agreed to continue engaging and mobilizing other leaders in support of Ukraine, and against Russia’s brutal actions, including at the upcoming United Nations General Assembly.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy agreed to keep in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/07/17/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/23/prime-minister-announces-additional-support-ukraine\">Prime Minister announces additional support for Ukraine</a></li>\n</ul>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}