{
  "path": "/en/news/readouts/2019/04/12/prime-minister-justin-trudeau-speaks-emmanuel-macron-president-france",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Emmanuel Macron, President of France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with President Emmanuel Macron of France.</p>\n\n<p>Prime Minister Trudeau and President Macron shared perspectives on working together to address violence and extremism. They discussed the tragic attacks in Christchurch and reiterated their solidarity to the people of New Zealand. Both leaders committed to finding new ways to collaborate in combatting hatred in all its forms.</p>\n\n<p>The two leaders also discussed relations with China, including the&nbsp;arbitrary detention of Canadian citizens in China and Canada’s ongoing efforts to secure their release. The Prime Minister and the President emphasized the importance of upholding the rule of law and respecting the independence of the judicial system.&nbsp;</p>\n\n<p>Prime Minister Trudeau highlighted the benefits of the Comprehensive Economic and Trade Agreement (CETA), which has been in provisional application since September 2017, and which has been ratified by 12 European Union Member States so far. They discussed the importance of other European Union Member States advancing their ratification of the agreement. CETA creates new middle class jobs and opportunities for business on both sides of the Atlantic.</p>\n\n<p>Prime Minister Trudeau and President Macron spoke about current political developments in Europe, including with respect to Brexit, populism, and upcoming European Parliament elections.</p>\n\n<p>The two leaders also discussed investing in artificial intelligence to create jobs and economic growth in France and Canada, and the need to uphold ethical standards in AI.</p></div>\n      "
}