{
  "path": "/en/news/statements/2019/11/18/statement-prime-minister-latvias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Latvia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Latvia’s Independence Day:</p>\n\n<p>“Today, we join Latvian communities in Canada and around the world to celebrate Latvia’s Independence Day.</p>\n\n<p>“Latvia and Canada enjoy a special relationship, based on close people-to-people ties and the shared values of democracy, freedom, and the rule of law. More than 30,000 people of Latvian descent call Canada home, and help make our country stronger, more prosperous, and more inclusive.</p>\n\n<p>“Canada was the first G7 country to recognize the restoration of Latvia's independence in 1991, and one of the first countries to ratify Latvia's accession to the North Atlantic Treaty Organization (NATO) in 2004. We will continue to work closely through the United Nations and through the Canada-European Union Comprehensive Economic and Trade Agreement, which is creating good jobs and new opportunities for people on both sides of the Atlantic.</p>\n\n<p>“During my visit to Latvia last year, I had the chance to reaffirm the close friendship between our two countries, as well as Canada’s commitment to NATO assurance and deterrence measures in Eastern and Central Europe. Canada leads a multinational battle group in Latvia as part of NATO’s enhanced Forward Presence, helping to maintain security and stability in Europe and strengthen our trans-Atlantic bond.</p>\n\n<p>“I look forward to working with Latvian Prime Minister Arturs Krišjānis Kariņš and President Egils Levits on reinforcing our strong relationship and creating new opportunities for Canadians and Latvians alike.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to all those celebrating Latvia’s Independence Day, here in Canada and around the world.”</p></div>\n      "
}