{
  "path": "/en/news/statements/2017/08/23/statement-prime-minister-black-ribbon-day",
  "pageTitle": "Statement by the Prime Minister on Black Ribbon Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black Ribbon Day, the National Day of Remembrance for the Victims of Communism and Nazism in Europe:</p><p>“Today, we join people in Canada and around the world to remember the victims and survivors of Communism and Nazism in Europe, and to pay tribute to all those who continue to face violence, loss of dignity, and repression from totalitarian regimes.</p><p>“On Black Ribbon Day, we mark the anniversary of the Molotov-Ribbentrop Pact, which was signed in 1939 between the Soviet Union and Nazi Germany. The infamous agreement carved Eastern and Central Europe into spheres of influence of Nazi Germany and the Soviet Union, and led to one of the darkest periods in human history.</p><p>“In the years that followed, the Soviet and Nazi regimes trampled upon national and personal freedoms across Europe. They robbed millions of people of their lives and livelihoods, and subjected countless men, women, and children to untold atrocities.</p><p>“Many of those who struggled against the horrors of the Soviet and Nazi regimes came to Canada as refugees. These Canadians and their descendants continue to make remarkable contributions to our country. Their stories underscore the importance of universal human rights – and remind us of the fragility of freedom.</p><p>“On behalf of the Government of Canada, I urge Canadians to reflect on the significance of this day. We all share the responsibility to promote and protect human rights, freedom, and democracy. We must stand guard against those who seek to devalue the humanity of others, and uphold the inherent dignity of every human being.”</p></div>\n      "
}