{
  "path": "/en/news/news-releases/2020/03/06/inuit-gavamakkut-piliriqatigiinningita-katimajiralaangit",
  "pageTitle": "ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ ᑲᑎᒪᔨᕋᓛᖏᑦ ᑲᔪᓯᑎᑦᓯᔪᑦ ᐊᒥᖅᑲᖅᑕᐅᓪᓗᑎᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓯᒪᔪᓄᑦ ᐱᓕᕆᐊᓂ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓇᑕᒥ ᐊᖏᔪᖅᑳᕐᔪᐊᖅ ᔭᔅᑎᓐ ᑐᕉᑑ, ᐊᖏᔪᖅᑳᖅ ᓇᐃᑖᓐ ᐆᐱᑦ ᐃᓄᐃᑦ ᑕᐱᕇᒃᑯᓐᓄᑦ ᑲᓇᑕᒥ, ᒥᓂᔅᑕᐃᑦ ᑲᑎᒪᔨᖏᑦ, ᐊᒻᒪᓗ ᓂᕈᐊᖅᑕᐅᓯᒪᓪᓗᑎᒃ ᐃᓄᐃᑦ ᓯᕗᓕᖅᑎᒋᔭᖏᑦ ᐃᓄᕕᐊᓗᐃᑦ ᐊᕕᒃᑐᖅᓯᒪᓂᖓᓂ ᑯᐊᐳᕇᖓᓴᓂᑦ, ᓄᓇᕗᑦ ᑐᖖᒐᕕᒃ ᑎᒥᖁᑎᖓᓂᑦ, ᒪᑭᕕᒃ ᑯᐊᐳᕇᓴᖓᓂᑦ, ᐊᒻᒪᓗ ᓄᓇᑦᓯᐊᕗᑦ ᒐᕙᒪᖓᓄᑦ ᐅᓪᓗᒥ ᑲᑎᓐᓂᖃᓚᐅᖅᐳᑦ ᑲᑎᒪᖃᑎᒌᓐᓂᐊᖅᑎᓪᓗᒋᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᕐᒧᑦ ᑲᑎᒪᔨᕋᓛᖏᑦ. ᑲᑎᒪᔨᕋᓛᑦ ᑲᑎᓐᓂᖃᓚᐅᖅᐳᑦ ᕿᒥᕐᕈᓂᐊᖅᓱᓂᒋᑦ ᐱᓕᕆᖃᑎᒌᒃᓯᒪᓕᕐᓂᐅᔪᑦ ᐊᒻᒪᓗ ᓯᕗᒻᒧᒋᐊᖅᑎᑕᐅᓯᒪᓕᖁᓪᓗᒋᑦ ᐊᒥᖅᑲᖅᑕᐅᓪᓗᑎᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᖁᔭᐅᓯᒪᔪᑦ ᐅᑭᐅᕆᓕᖅᑕᖓᓄᑦ ᓯᑕᒪᓂᒃ (4) ᐱᓕᕆᖃᑎᒌᓐᓂᕐᓂ.&nbsp;</p>\n\n<p>ᑲᑎᒪᔨᕋᓛᑦ ᐃᓚᒋᐊᖅᓯᓚᐅᖅᐳᑦ ᒪᕐᕉᓐᓂᒃ ᓄᑖᖑᓪᓗᑎᒃ ᑐᕌᕐᕕᒋᔭᐅᔪᑦᓴᓂᒃ, ᐱᕙᓪᓕᐊᔪᓕᕆᓂᕐᓂ ᐱᓇᓱᐊᕈᓯᐅᕙᒋᐊᓕᓐᓂᒡᓗ, ᐊᒻᒪᓗ ᒪᓕᒐᕐᔪᐊᓕᕆᓂᕐᒥ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᔪᑦ, ᐱᓕᕆᐊᒃᓴᕆᓕᐊᓂᒃᑕᒥᓐᓄᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓯᒪᔪᓄᑦ. ᐃᓚᒋᐊᖅᑎᑦᓯᓯᒪᓕᓚᐅᕐᒥᔪᑦ ᑐᕌᕐᕕᒃᓴᐅᖁᔭᐅᓪᓗᓂ ᐊᑐᓕᖅᑎᑕᐅᕙᓪᓕᐊᓂᖓᑕ ᐃᖅᑲᖅᑐᐃᕝᕕᒃᑎᒍᑦ ᐃᑲᔪᖅᑐᒐᐅᓯᒪᓕᖁᓪᓗᒋᑦ ᑲᓇᑕᓕᒫᒥ ᑭᓪᓕᓯᓂᐊᖅᑎᒃᑯᑦ ᑐᑭᓯᓂᐊᕈᑎᒋᓯᒪᔭᖏᑦ ᐊᓯᐅᔨᔭᐅᓯᒪᔪᑦ ᐊᒻᒪᓗ ᐃᓄᐊᖅᑕᐅᓯᒪᔪᓄᑦ ᓄᓇᖃᖅᑳᕐᓯᒪᔪᐃᑦ ᐊᕐᓇᖏᑕ ᐊᒻᒪᓗ ᓂᕕᐊᖅᓯᐊᖏᑕ ᑕᐃᒪᐅᓕᐊᓂᒃᑐᓄᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓪᓗᑎ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕐᓂᕐᒧᑦ, ᐊᒻᒪᓗ ᐃᓕᔭᐅᖃᑕᐅᓯᒪᔪᓄᑦ ᐃᒡᓗᓕᕆᓂᕐᒥ ᐊᒻᒪᓗ ᑕᐃᒪᐅᓕᐊᓂᒃᑐᓄᑦ ᐱᓕᕆᓂᖃᕐᓂᐅᔪᓄᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓪᓗᑎᒃ.</p>\n\n<p>ᐅᖃᓪᓚᐅᓯᖃᖃᑎᒌᓚᐅᖅᐳᑦ ᑲᔪᓯᑎᑕᐅᓯᒪᓪᓗᑎᒃ ᐱᓕᕆᐊᖑᔪᓄᑦ ᐊᒥᓱᕐᓚᐅᓪᓗᑎᒃ, ᐃᓚᖃᕐᑎᑕᐅᓪᓗᑎᒃ:</p>\n\n<ul>\n\t<li>ᐱᐅᓯᒋᐊᖅᑎᑦᓯᓂᕐᒥᒃ ᐊᑐᓕᖅᑎᑕᐅᕙᓪᓕᐊᓂᖏᑕ ᐃᓄᐃᑦ ᓄᓇᓕᕆᓂᕐᒧᑦ ᐊᖏᕈᑎᖏᑦ ᐋᖅᑭᒃᓱᐃᖃᑎᒌᒃᓯᒪᓂᖅᑎᒍᑦ ᒪᓕᒐᖁᑎᐅᔪᓂᒃ ᐊᒻᒪᓗ ᕿᒥᕐᕈᐃᔾᔪᑎᐅᕙᒐᔭᖅᑐᓂᒃ</li>\n\t<li>ᑐᓴᐅᒪᓕᖅᑎᑦᓯᓂᖅ ᐊᑐᓕᖅᑎᑕᐅᓂᖏᑕ ᓄᓇᖃᖅᑳᕐᓯᒪᔪᑦ ᐅᖃᐅᓯᖏᑕ ᒪᓕᒐᖁᑏᑦ, ᐊᒻᒪᓗ ᐃᑲᔪᖅᑐᕐᓗᒍ ᓴᑐᖅᓯᕙᓪᓕᐊᓂᖅ, ᐱᕚᓪᓕᖅᑎᑦᑎᓂᖅ, ᑕᐃᒪᐅᖏᓐᓇᖅᑎᑦᑎᓂᖅ ᐊᒻᒪᓗ ᓴᙱᓕᖅᑎᑦᑎᓂᖅ ᐃᓄᒃᑐᑦ ᐅᖃᐅᓯᕐᒥᒃ ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂᑦ.</li>\n\t<li>ᐊᑐᓕᖅᑎᑦᓯᓂᖅ ᐅᑭᐅᖅᑕᖅᑐᒥ ᐊᒻᒪᓗ ᐅᑭᐅᖅᑕᖅᑐᒥᐅᑦ ᒪᓕᒐᖁᑎᖓᑕ ᑐᖖᒐᕝᕕᖏᓂᒃ, ᐊᒻᒪᓗ ᐱᓕᕆᓂᖃᓕᕐᓂᕐᒥᒃ ᓄᑕᐅᓕᖅᑎᑕᐅᓯᒪᓕᖁᓪᓗᒋᑦ ᐋᖅᑭᒃᓱᐃᖃᑎᒌᓐᓂᐅᔪᑦ ᐱᓕᕆᔾᔪᓯᐅᕙᓐᓂᐊᖅᑐᓄᑦ ᐱᓕᕆᐊᓂᒃ, ᒪᓕᒐᖁᑎᓂᒃ, ᐊᒻᒪᓗ ᒪᓕᒐᕐᔪᐊᖁᑎᓂᒃ</li>\n\t<li>ᐱᓕᕆᓂᖃᕐᕕᐅᔪᓂ ᐅᖓᓯᒃᑐᕋᐅᑎᓂᐅᔪᑦ ᐃᓄᐃᑦ ᓄᓇᖓᑦᑕ ᐊᒻᒪᓗ ᑲᓇᑕᒥᐅᖑᖃᑎᖏᑕ ᖃᓂᒡᓕᓯᒪᓕᖅᑎᓪᓗᒋᑦ ᐱᓕᕆᓂᖃᕐᓂᖅᑎᒍᑦ ᓇᐃᑦᑑᑎᑕᐅᓗᑎᒃ, ᕿᑎᐊᓂᖅᐸᓯᒦᑦᑐᑎᒍᑦ, ᐊᒻᒪᓗ ᐊᑯᓃᖅᑐᒧᑦ ᐃᒡᓗᓕᕆᓂᕐᒥ ᐊᒻᒪᓗ ᓄᓇᓕᐅᔪᓂ ᐃᖅᑲᓇᐃᔭᕐᕕᐅᔪᓂᑦ ᐱᔭᐅᓯᒪᓕᕆᐊᖃᖅᑐᓂᒃ</li>\n</ul>\n\n<p>ᐅᑭᐅᖅ ᐊᑐᖅᐸᓪᓕᐊᓂᖓᓂ, ᑲᓇᑕᒥ ᒐᕙᒪᒃᑯᖏᑦ ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᑕᐱᕇᒃᑯᑦ ᑲᓇᑕᒥ ᐱᒻᒪᕆᐅᑎᐅᓪᓗᑎᒃ ᐱᓕᕆᓂᖏᑦ ᓯᕗᒻᒧᒋᐊᖅᓯᒪᓕᓚᐅᕐᒥᔪᑦ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕋᔭᕐᓂᕐᒥ ᐱᓕᕆᐊᓂ. ᑕᒪᒃᑯᐊ ᐱᓕᕆᐊᖑᓯᒪᓕᖅᐸᓪᓕᐊᔪᑦ ᐃᓚᖃᖅᐳᑦ ᑲᓇᑕᒥ ᒐᕙᒪᒃᑯᑦ ᒪᒥᐊᕝᕕᖃᓚᐅᕐᓂᖏᓂᒃ ᕿᑭᖅᑕᓂ ᐃᓄᖏᓐᓄᑦ ᐃᓕᖖᒐᐃᑎᑦᓯᓯᒪᓂᐅᔪᓄᑦ ᒐᕙᒪᑐᖃᒃᑯᑦ ᒪᓕᒐᖁᑎᖏᓂᑦ ᕿᑭᖅᑕᓂ ᐊᕕᒃᑐᖅᓯᒪᓂᖓᑕ ᐃᓗᐊᓂ ᐅᑭᐅᖏᑦ 1950-ᐃᓂᑦ 1975-ᐃᓄᑦ ᐊᑐᖅᑎᓪᓗᒋᑦ.</p>\n\n<p>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᕐᒧᑦ ᑲᑎᒪᔨᕋᓛᖏᑦ ᑕᑯᒃᓴᐅᑎᑦᓯᓯᒪᕗᑦ ᓄᑕᐅᓕᕆᐊᖅᑎᑕᐅᓯᒪᓪᓗᓂ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᐅᓕᖅᑐᓄᑦ ᐱᓕᕆᓂᖃᕐᓂᐊᕐᓂᕐᒥᓐᓄᑦ ᐊᒻᒪᓗ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕐᓂᐊᕐᓂᕐᓄᑦ ᑐᖖᒐᕝᕕᖃᖅᑎᑕᐅᓯᒪᓪᓗᑎᒃ ᐃᓕᑕᕆᔭᐅᓯᒪᓕᕐᓂᖏᑕ ᐱᔪᓐᓇᐅᑎᒋᔭᐅᔪᑦ, ᐅᐱᒋᑐᕋᐅᑦᓯᐊᕐᓗᑎᒃ, ᐱᓕᕆᐊᖃᖃᑎᒌᒃᓗᑎᒃ, ᐊᒻᒪᓗ ᐃᑲᔪᖃᑎᒌᒃᓗᑎᒃ ᐱᓕᕆᓂᖃᕐᓂᐊᕐᓂᕐᒥᓐᓂᒃ.</p>\n\n<h2>ᐅᖃᖅᑕᐅᓯᒪᔪᑦ</h2>\n\n<blockquote>\n<p>“ᐅᓪᓗᒥ ᑲᑎᒪᖃᑎᖃᕐᓂᕗᑦ ᐃᓄᐃᑦ ᓯᕗᓕᖅᑎᒋᔭᖏᓂᒃ ᐃᑲᔪᕐᓂᖃᒻᒪᕆᓚᐅᕐᑐᖅ ᐱᑕᖃᓕᖅᑎᑦᓯᒋᐊᒧᑦ ᐊᒻᒪᓗ ᓯᕗᓂᕐᒥ ᐱᓕᕆᖃᑎᒌᒍᓐᓇᕐᓂᕐᒧᑦ. ᐱᓕᕆᖃᑎᖃᕐᓂᖅᑎᒍᑦ ᓱᓕᓪᓗᑎᒃ ᐱᓕᕆᐊᖃᖃᑎᒌᓐᓂᕐᒥ, ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᐱᒻᒪᕆᐅᔪᑎᒍᑦ ᓯᕗᒻᒧᒋᐊᖅᑎᑦᓯᔪᓐᓇᖅᓯᓚᐅᕐᒪᑕ ᐊᒻᒪᓗ ᓇᓂᓯᓯᒪᓕᖅᓱᑎᒃ ᐊᑯᓃᖅᑐᒧᑦ ᐊᒻᒪᓗ ᒥᒃᓯᖃᑦᓯᐊᖅᑐᑎᒍᑦ ᐋᖅᑭᒋᐊᕈᑎᒃᓴᐅᔪᓐᓇᖅᑐᓂᒃ ᐱᕙᓪᓕᐊᔪᓕᕆᓂᐅᔪᓂ ᓄᓇᓕᐅᔪᓂᑦ ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂ. ᑲᔪᓯᑎᑦᓯᒪᓂᐊᖅᑐᒍᑦ ᑐᕌᕐᕕᒃᓴᖃᕐᓂᑦᑎᓐᓂᒃ ᐱᔾᔪᑎᐅᓗᐊᖅᓱᑎᒃ ᓄᓇᓕᐅᔪᓂ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓯᒪᔪᓂᒃ ᓱᓕᓪᓚᕆᒃᑐᑎᒍᑦ ᐃᑲᔪᕐᓂᖃᖅᐸᒃᑐᓂᒃ ᐃᓄᓐᓄᑦ, ᓲᕐᓗ ᐃᒡᓗᓕᕆᓂᕐᒧᑦ ᐊᒻᒪᓗ ᐆᒪᖅᑎᑦᓯᒋᐊᒃᑲᓐᓂᕐᓂᕐᒥᒃ.\"</p>\n\n<footer class=\"default\">ᓂᖅᑐᕐᓇᕐᑐᖅ, ᔭᔅᑎᓐ ᑐᕉᑑ, ᑲᓇᑕᒥ ᐊᖏᔪᖅᑳᕐᔪᐊᖅ</footer>\n</blockquote>\n\n<blockquote>\n<p>“ᐅᓪᓗᒥ ᑲᑎᒪᓂᕆᓚᐅᖅᑕᖓᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ ᑲᑎᒪᔨᕋᓛᑦ ᐱᕈᖅᑎᑦᑎᒋᐊᕈᑎᐅᓯᒪᕗᖅ ᓴᖖᒋᓂᖃᑦᓯᐊᖅᑑᓪᓗᓂ ᐱᓕᕆᖃᑎᒌᒃᓯᒪᓕᐅᓕᖅᑐᓂᒃ ᐅᑭᐅᓄᑦ ᐱᖓᓱᓄᑦ, ᓄᑕᐅᓕᖅᑎᑦᓯᒋᐊᓚᐅᖅᐳᒍᑦ ᐊᒥᖅᑲᕈᑎᒋᓪᓗᒋᑦ ᐱᓕᕆᓂᖃᕈᒪᓂᕐᓂᒃ ᑐᕌᖓᔪᓄᑦ ᓄᓇᓕᕆᓂᕐᒥ ᐊᖏᕈᑎᐅᓯᒪᔪᓂᑦ ᐊᑐᓕᖅᑎᑦᓯᓯᒪᓕᕆᐊᒥᒃ, ᐅᖃᐅᓯᓕᕆᓂᕐᒧᑦ, ᐃᖅᑲᓇᐃᔭᕐᕕᐅᔪᑦ ᐋᖅᑭᐅᒪᓂᕆᔭᖏᓄᑦ, ᐊᒻᒪᓗ ᐊᑐᓕᖅᑎᑦᓯᒋᐊᒥᒃ ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂ ᒪᓕᒐᖁᑎᐅᓕᕋᔭᖅᑐᒥᒃ ᒐᕙᒪᐅᔪᑦ ᐃᓗᐊᓂ. ᐅᑭᐅᕆᓂᐊᖅᑕᑦᑎᓐᓂ, ᐱᓕᕆᖃᑎᒌᓐᓂᐊᖅᑐᒍᑦ 10-ᖑᔪᓂᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓯᒪᔪᓂᒃ ᓴᖅᑭᑕᐅᓯᒪᓕᖁᓪᓗᒋᑦ ᐊᓯᔾᔨᖅᑕᐅᓯᒪᓕᕆᐊᖃᖅᑐᑦ ᐃᓄᓐᓄᑦ, ᑕᐃᒪᓗ ᐃᑲᔪᕐᓂᖃᓕᕋᔭᖅᑐᓂᒃ ᑲᓇᑕᒥᐅᓕᒫᓄᑦ.”</p>\n\n<footer class=\"default\">ᐊᖏᔪᖅᑳᖅ ᓇᐃᑖᓐ ᐆᐱᑦ, ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ</footer>\n</blockquote>\n\n<h2>ᖃᓄᐃᓕᖓᓂᖏᓂᒃ ᑕᑯᒋᐊᕐᓂᖅ</h2>\n\n<ul>\n\t<li>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ ᑲᑎᒪᔨᕋᓛᑦ ᐱᒋᐊᖅᑎᑕᐅᓚᐅᖅᓯᒪᕗᑦ ᕕᑉᕈᐊᕆ 2017-ᒥ. ᐱᒋᐊᖅᑎᑕᐅᓚᐅᖅᓯᒪᓪᓗᑎᒃ ᑐᖖᒐᕝᕕᖃᖅᑎᑕᐅᓪᓗᑎᒃ ᓇᓕᖅᑲᕇᒡᓗᑎᒃ ᐱᓕᕆᖃᑎᒌᒍᓐᓇᕐᓂᖏᑦ ᐃᓄᐃᑦ ᐊᒻᒪᓗ ᒐᕙᒪᒃᑯᑦ ᑕᐃᒪᐅᔭᕆᐊᖃᓪᓚᕆᖕᒪᑦ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕋᔭᕐᓂᕐᒧᑦ.</li>\n\t<li>ᑲᑎᒪᔨᕋᓛᑦ ᐃᒃᓯᕙᐅᑕᖃᑎᒌᒃᑐᑎᒃ ᐃᒃᓯᕙᐅᑕᖃᖅᐳᑦ ᑲᓇᑕᒥ ᐊᖏᔪᖅᑳᕐᔪᐊᕆᔭᐅᔪᒥᒃ ᐊᒻᒪᓗ ᐊᖏᔪᖅᑳᕆᔭᐅᔪᒥᒃ ᐃᓄᐃᑦ ᑕᐱᕇᒃᑯᓐᓄᑦ ᑲᓇᑕᒥ.</li>\n\t<li>ᑲᑎᒪᔨᕋᓛᑦ ᐃᓚᖃᑕᐅᑎᑦᓯᒻᒥᔪᑦ ᑐᓵᔭᖅᑐᕐᓯᒪᕙᒃᑐᓂᒃ ᐊᖏᔪᖅᑳᖑᓪᓗᑎᒃ ᑲᓇᑕᒥ ᒪᒃᑯᒃᑐᑦ ᐃᓄᐃᑦ ᑲᑎᒪᔨᖏᓐᓂᑦ, ᐸᐅᒃᑑᑎᑦ ᐊᕐᓇᐃᑦ ᐃᓄᐃᑦ ᑲᓇᑕᒥᑦ, ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᐅᑭᐅᖅᑕᖅᑐᒥ ᑲᑎᒪᔨᖏᑦ ᑲᓇᑕᒥᑦ.</li>\n\t<li>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ ᑲᑎᒪᔨᕋᓛᖏᑕ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᒃᓴᖁᑎᖏᑦ ᐅᑯᐊᖑᕗᑦ:\n\t<ul>\n\t\t<li>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᓄᓇᓕᕆᓂᖏᑦ</li>\n\t\t<li>ᐃᓄᐃᑦ ᓄᓇᖓᑕ ᒪᓕᒐᖁᑎᖏᑦ ᐋᖅᑭᒃᑕᐅᓯᒪᓕᕈᓐᓇᕐᓂᖏᑦ</li>\n\t\t<li>ᐆᒻᒪᖅᑎᑦᓯᒋᐊᒃᑲᓐᓂᕐᓂᖅ, ᐋᖅᑭᐅᒪᑎᑦᓯᒋᐊᕐᓂᖅ, ᐊᒻᒪᓗ ᖁᕝᕙᖅᑎᑦᓯᒋᐊᕐᓂᖅ ᐃᓄᒃᑐᑦ ᐅᖃᐅᓯᕐᒥᒃ</li>\n\t\t<li>ᓴᐃᒪᖃᑎᒌᒃᓯᒪᓕᕆᐊᕐᓂᕐᒧᑦ ᐱᓕᕆᐊᖑᔪᑦ</li>\n\t\t<li>ᐃᓕᓐᓂᐊᕐᓂᓕᕆᓂᖅ, ᐃᓕᓐᓂᐊᓕᓵᖅᑐᓕᕆᓂᖅ, ᐊᒻᒪᓗ ᐱᓕᒻᒪᒃᓴᐃᕙᓐᓂᖅ</li>\n\t\t<li>ᐋᓐᓂᐊᖃᕐᓇᖖᒋᑦᑐᓕᕆᓂᖅ ᐊᒻᒪᓗ ᖃᓄᐃᖖᒋᑦᓯᐊᕐᓂᓕᕆᓂᖅ</li>\n\t\t<li>ᐊᕙᑎᓕᕆᓂᖅ ᐊᒻᒪᓗ ᓯᓚᐅᑉ ᐊᓯᔾᔨᖅᐸᓪᓕᐊᓂᖓ</li>\n\t\t<li>ᐃᒡᓗᓕᕆᓂᖅ ᐊᒻᒪᓗ ᐃᖅᑲᓇᐃᔭᕐᕕᓕᕆᓂᖅ</li>\n\t\t<li>ᐱᕙᓪᓕᐊᔪᓕᕆᓂᖅ ᐊᒻᒪᓗ ᐱᓇᓱᐊᕈᓯᐅᕙᒋᐊᖃᖅᑐᓂᒃ ᐱᓕᕆᐊᖑᔪᑦ</li>\n\t\t<li>ᒪᓕᒐᕐᔪᐊᓕᕆᓂᕐᒥ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᔪᑦ</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>ᐱᑦᔪᑕᐅᖃᑕᐅᔪᓄᑦ ᐊᑦᑕᑕᖅᓯᒪᕝᕕᐅᒻᒥᔪᑦ</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">ᑲᓇᑕᒥ ᐊᖏᔪᖅᑳᕐᔪᐊᖅ ᐊᒻᒪᓗ ᐊᖏᔪᖅᑳᖅ ᐃᓄᐃᑦ ᑕᐱᕇᒃᑯᓐᓄᑦ ᑲᓇᑕᒥ ᑐᓴᖅᑎᑦᓯᓂᖓᑦ ᐃᓄᐃ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᖕᓂᖓᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᓂᐊᖅᑐᓂᒃ </a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂᕐᒥᐅᓄᑦ ᓇᓗᓇᐃᖅᓯᓯᒪᓕᕈᑎᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᐊᑎᒌᖕᓂᖓᓄᑦ</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">ᑲᓇᑕᐅᑉ ᐅᑭᐅᖅᑕᖅᑐᖓᓂ ᐊᒻᒪᓗ ᐅᑭᐅᖅᑕᖅᑐᒥᐅᑦ ᒪᓕᒐᖁᑎᖏᓐᓄᑦ ᑐᖖᒐᕝᕕᖁᑎᒋᔭᐅᔪᑦ </a></li>\n\t<li><a href=\"https://www.itk.ca/arctic-and-northern-policy-framework-inuit-nunangat/\">ᐅᑭᐅᖅᑕᖅᑐᒥ ᐊᒻᒪᓗ ᐅᑭᐅᖅᑕᖅᑐᒥᐅᑦ ᒪᓕᒐᖁᑎᖏᓐᓄᑦ ᑐᖖᒐᕝᕕᖁᑎᒋᔭᐅᔪᑦ: ᐃᓄᐃᑦ ᓄᓇᖓᑦ</a></li>\n</ul></div>\n      "
}