{
  "path": "/en/news/statements/2020/06/07/statement-prime-minister-canadian-armed-forces-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Armed Forces Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian Armed Forces Day:</p>\n\n<p>“Today, we thank former and current members of the Canadian Armed Forces for their unwavering dedication, courage, and selflessness, as they regularly put themselves in harm’s way to protect our country, our values, and our way of life.</p>\n\n<p>“Whether deployed far from home on combat or peace support operations, or on disaster relief efforts across the country, Canadian Armed Forces personnel have always answered the call to serve. And today is no different. As the COVID-19 pandemic has threatened the health and safety of our grandparents, parents, and seniors, Canadians in uniform have stepped up once again to help out in long-term care facilities and seniors’ residences. When we needed them most, they were there for us, serving with compassion and professionalism. In these challenging times, it is comforting to know that we can always rely on members of the Canadian Armed Forces.</p>\n\n<p>“This year has been difficult for all Canadians, and those in uniform have endured several tragedies. Together, we mourned the loss of six Canadian Armed Forces members in the CH-148 Cyclone helicopter accident near Greece, and the loss of a member of the Snowbirds family in British Columbia shortly thereafter. The deaths of these brave Canadian heroes are a reminder of how much they sacrifice, so that we can live in safety and enjoy the freedoms and values we cherish.</p>\n\n<p>“As we honour our military members, we also thank their families and loved ones. Military families make tremendous sacrifices, face unique challenges, and provide an enduring source of strength and support for our armed forces. Thank you. &nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I thank the past and present members of the Canadian Armed Forces and their families for their unwavering commitment. The life we enjoy as Canadians is made possible through the service and sacrifice of those who stand ready to defend us and the values we hold dear.”</p></div>\n      "
}