{
  "path": "/en/news/statements/2021/01/29/statement-prime-minister-fourth-anniversary-fatal-shooting-centre",
  "pageTitle": "Statement by the Prime Minister on the fourth anniversary of the fatal shooting at the Centre culturel islamique de Québec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the fourth anniversary of the fatal shooting at the Centre culturel islamique de Québec:</p>\n\n<p>“Four years ago tonight, a terrorist attack at the Centre culturel islamique de Québec in Ste-Foy claimed the lives of six people and seriously injured nineteen others.</p>\n\n<p>“On this sombre anniversary, we honour the memory of the victims of this hateful act of Islamophobia and racism. Our hearts go out to their families and loved ones who continue to suffer, and to all the residents of Quebec City whose community has been forever changed by this tragedy.</p>\n\n<p>“Today, we also remember the first responders who did everything they could, with courage and dedication, to save congregants and ease their pain. And we recognize the solidarity that Quebecers and all Canadians showed with Muslim communities across the country in denouncing this senseless act of violence.</p>\n\n<p>“To honour the victims of this tragedy and continue the fight against Islamophobia, hatred, and discrimination, we announced yesterday our intent to declare January&nbsp;29 as ‘National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia.’</p>\n\n<p>“Eliminating Islamophobia is a key pillar of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a>. In 2019, we launched the <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a>, which aims to combat online hate and help Canadians better understand disinformation and its impacts on our society. In addition, we are continuing to ensure that Canadians feel safe in their places of worship and in their communities, through investments from the <a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/crm-prvntn/fndng-prgrms/scrt-nfrstrctr-prgrm-en.aspx\">Communities at Risk: Security Infrastructure Program</a>. Our government also continues to protect communities from gun violence. For example, we strengthened gun control last year by prohibiting over 1,500&nbsp;models and variants of assault-style firearms and some of their components. These and several other measures are part of the Government of Canada’s commitment to fight Islamophobia, intolerance, extremist groups, and hatred, including online hate.</p>\n\n<p>“Today, on behalf of the Government of Canada, I invite all Canadians to remember the victims of this heinous act. We will stand united against division and violence, neither of which have any place in Quebec and in Canada. We will always defend our values of respect for diversity, openness, and inclusion, regardless of our beliefs, background, and religion. Together, we will also continue to fight against Islamophobia and all other forms of discrimination, to make our country and this world fairer, stronger, and more inclusive for all.”</p></div>\n      "
}