{
  "path": "/en/news/statements/2017/05/23/statement-prime-minister-canada-anniversary-komagata-maru-incident",
  "pageTitle": "Statement by the Prime Minister of Canada on the anniversary of the Komagata Maru incident | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the 103<sup>rd</sup> anniversary of the Komagata Maru incident:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“More than a century ago today, a great injustice took place when most of the 376 passengers onboard the Komagata Maru steamship were denied entry into Canada and forced to return to India where some were killed and many imprisoned.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Last year, <a href=\"/en/news/speeches/2016/05/18/komagata-maru-apology-house-commons\">I stood in the House of Commons to apologize</a> on behalf of the Government of Canada to all those affected by this tragic incident. An unjust federal law ultimately led to these passengers being turned away. For that grave injustice and for the regrettable consequences that followed, we are sorry.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Komagata Maru passengers share much in common with the many immigrants, past and present, who have come to Canada to build a better life for themselves and their families. By offering compassion and a fair chance at success, we not only help provide more opportunities for them and their loved ones, we also build a better Canada – one that is stronger, more inclusive, and more prosperous. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we honour the victims of the Komagata Maru tragedy and their descendants. Canadians are proud to be part of a country that respects and protects multiculturalism as a core and defining value, and we thank all those from the South Asian community who make such invaluable contributions to our society. We benefit greatly from the vibrant diversity of our country.”</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">&nbsp;</span></p></div>\n      "
}