{
  "path": "/en/news/news-releases/2018/11/06/governor-general-canada-visit-belgium-honour-canadians-service-and",
  "pageTitle": "Governor General of Canada to visit Belgium to honour Canadians’ service and sacrifice in First World War | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will visit Mons, Belgium, on November 10, 2018.</p><p>During her visit, the Governor General will attend commemoration events for the 100th anniversary of the First World War Armistice. As Commander-in-Chief of Canada, she will attend a remembrance ceremony at the St. Symphorien Military Cemetery. She will also attend the unveiling of a monument in memory of George Price – a Canadian soldier from Nova Scotia killed two minutes before the Armistice and believed to be the last Commonwealth soldier to die in action during the Great War.</p><p>At these ceremonies, the Governor General will pay tribute to all the Canadian soldiers who paid the ultimate price for freedom. She will then travel back to Canada to attend the National Remembrance Day Ceremony in Ottawa.</p><h2>Quote</h2><blockquote><p>“In Belgium, the Governor&nbsp;General will remember and honour the thousands of Canadians who stood on guard for us and gave their lives far from Canada’s shores. They served with valour and sacrificed beyond measure. We owe them an immense debt of gratitude for their service. We will not forget.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>This year marks the 100th anniversary of Canada’s Hundred Days and the First World War Armistice.</li><li>Canada made great contributions and sacrifices during the First World War, fought from 1914 to 1918. Our many achievements on the battlefield were capped by a three-month stretch of victories at the end of the war – from August 8 to November 11, 1918 – that came to be known as “Canada’s Hundred Days.”</li><li>Canadians marched through the streets of Mons on the morning of November&nbsp;11, 1918, celebrating the end of the war.</li><li>The Governor General’s last visit to Europe was in January 2018, when she visited Canadian troops in Ukraine and Latvia.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/last-hundred-days/100-anniversary\">Canada’s Hundred Days and the Armistice 100th anniversary</a></li><li><a href=\"http://www.canadainternational.gc.ca/belgium-belgique/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Belgium relations</a></li></ul></div>\n      "
}