{
  "path": "/en/news/readouts/2021/06/27/prime-minister-justin-trudeau-speaks-prime-minister-israel-naftali-bennett",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Israel Naftali Bennett | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Israel, Naftali Bennett.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Bennett on the formation of a new Israeli government with Alternate Prime Minister Yair Lapid. Prime Minister Trudeau highlighted the close relationship between Canada and Israel, bound together by shared democratic values and vibrant people-to-people ties.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Prime Minister Bennett discussed ways to expand trade and investment, and create new jobs and opportunities, including through the modernized Canada-Israel Free Trade Agreement. They highlighted the long history of cooperation between Canada and Israel on shared priorities, including advancing science, and promoting technology, innovation, and education.</p>\n\n<p>Prime Minister Trudeau shared concerns about&nbsp;the disturbing increase of antisemitism and hatred, at home and around the world. He stressed that Canada is committed to working with domestic and international partners to combat antisemitism&nbsp;and hatred&nbsp;in all its forms. Prime Minister Bennett thanked Canada for adopting the International Holocaust Remembrance Alliance definition of antisemitism.&nbsp;The two leaders discussed the importance of the Honourable Irwin Cotler’s work as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism.</p>\n\n<p>Prime Minister Trudeau underscored his firm belief in the right of Israelis and Palestinians&nbsp;to live with dignity, without fear, and with their human rights respected. He reaffirmed Canada's commitment to the goal of a comprehensive, just, and lasting peace in the Middle East, including the creation of a Palestinian state living side-by-side in peace and security with Israel. Prime Minister Trudeau noted Canada’s opposition to unilateral actions that prejudge the outcome of direct negotiations or jeopardize the prospects for peace. He confirmed Canada’s readiness to support efforts towards lasting peace, security, and prosperity.</p>\n\n<p>Prime Minister Trudeau noted Minister Garneau’s upcoming trip to the region and the two prime ministers looked forward to working together to further strengthen the relationship between their two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Israel Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/06/13/statement-prime-minister-formation-new-government-israel\">Statement by the Prime Minister on the formation of a new government in Israel</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/israel/fta-ale/index.aspx?lang=eng\">Canada-Israel Free Trade Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/statement-by-the-minister-of-foreign-affairs-on-the-situation-in-israel-the-west-bank-and-gaza.html\">Statement by the Minister of Foreign Affairs on the situation in Israel, the West Bank, and Gaza</a></li>\n</ul></div>\n      "
}