{
  "path": "/en/news/statements/2022/01/29/statement-prime-minister-national-day-remembrance-quebec-city-mosque",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia:</p>\n\n<p>“Today, we remember the six people who lost their lives and the 19 others who were seriously injured during the terrorist attack at the Centre culturel islamique de Québec in Sainte-Foy.</p>\n\n<p>“On the fifth anniversary of this tragedy, we also mark the first National Day of Remembrance of the Quebec City Mosque Attack and Action against Islamophobia. Today, we pay tribute to the victims of this hateful act of terror, who were senselessly killed at the hands of bigotry, Islamophobia, and racism. We express solidarity with the survivors and those injured, the families and friends who lost a loved one, and all the communities of Quebec City and across Canada whose lives have been changed forever.</p>\n\n<p>“We also honour the heroes and first responders who acted swiftly and courageously to save the lives of worshippers. This cowardly attack sought to instill fear and divide us. Instead, Canadians came together and united around shared values of diversity, peace, and respect. They showed their support to Muslim communities in Quebec City and across Canada by fighting discrimination, intolerance, and hatred in all its forms.</p>\n\n<p>“Canada strives to champion human rights, freedom of expression, and freedom of belief. The government condemns Islamophobia and all forms of racism and discrimination in our society, and that is why confronting Islamophobia is an important part of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a>.</p>\n\n<p>“Last July, the Government of Canada held a <a href=\"https://www.canada.ca/en/canadian-heritage/news/2021/07/the-government-of-canada-concludes-national-summit-on-islamophobia.html\">National Summit on Islamophobia</a>, where we committed to supporting anti‑racism programs that address Islamophobia and hate-fueled violence. We are moving forward with our intention to work with Muslim communities on the designation of a special representative to combat Islamophobia.</p>\n\n<p>“Our strategy includes a whole-of-government approach to tackling systemic racism with dedicated knowledge and expertise through the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>. It also includes investments to empower communities to combat different forms of racism, including Islamophobia, and to advance digital and civic literacy initiatives that address online disinformation and hate speech. We will establish a National Support Fund for Survivors of Hate-Motivated Crimes to help survivors and are committed to renewing and strengthening the Anti-Racism Strategy in 2022 with a National Action Plan to expand on our ongoing work to combat hate and racism.</p>\n\n<p>“The government will continue to strengthen gun control. On July&nbsp;7, 2021, we extended background checks to cover the lifetime of an applicant looking to obtain a firearms licence. We have also banned 1,500 assault-style weapons, and will proceed with a mandatory buyback, meaning these firearms can never be sold, transferred or bequeathed, and ensuring they’re rendered fully and permanently inoperable at government expense. We know there is more work to do and we want to work with any province or territory that wants to ban handguns across their jurisdiction. Our government also invested in the <a href=\"https://www.publicsafety.gc.ca/cnt/cntrng-crm/crm-prvntn/fndng-prgrms/scrt-nfrstrctr-prgrm-en.aspx\">Communities at Risk: Security Infrastructure Program</a>, to provide funding and support for communities at risk of hate crimes.</p>\n\n<p>“On behalf of the Government of Canada, I encourage everyone to take a moment to remember the victims and survivors of the fatal shooting at the Centre culturel islamique de Québec and to all those affected by this heinous crime. Together, we will continue to fight against Islamophobia, and all other forms of hatred, as we build a stronger, more diverse, and more inclusive Canada.”</p></div>\n      "
}