{
  "path": "/en/news/news-releases/2017/02/17/prime-minister-trudeau-concludes-successful-visit-europe",
  "pageTitle": "Prime Minister Trudeau concludes successful visit to Europe | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to France and Germany from February 16 to 17, 2017. During the visit, the Prime Minister addressed the European Parliament in Strasbourg, France, and visited Berlin and Hamburg, Germany.</p><p>The Prime Minister’s visit reinforced the close bonds between Canada, Germany, and the European Union (EU). It was also an opportunity to promote Canada’s role as a leader on progressive trade and investment, and highlight how the Canada-EU Comprehensive Economic and Trade Agreement (CETA) will create good, well-paying jobs, bolster our shared prosperity, and help grow the middle class.‎</p><p>During his historic address to the European Parliament, the Prime Minister spoke of the importance Canada places on its relationship with the EU and welcomed the European Parliament’s vote to approve CETA and the Canada-EU Strategic Partnership Agreement.</p><p>In Berlin, the Prime Minister met with outgoing President Joachim Gauck and German Chancellor Angela Merkel. In these meetings, key economic and foreign policy issues were discussed, including CETA. They also exchanged views on pressing international security concerns, including migration, the situation in Ukraine, and the fight against terrorism and Daesh.</p><p>While in Berlin, the Prime Minister paid<span lang=\"EN\" xml:lang=\"EN\"> his respects to </span>the more than six million Jewish victims <span lang=\"EN\" xml:lang=\"EN\">of the Holocaust at the Memorial to the Murdered Jews of Europe. During his visit, </span>he laid a wreath in honour of all the victims. He and Chancellor Merkel were greeted by the Mayor of Berlin, Michael Müller, at Breitscheidplatz, central square in Berlin. Both leaders laid a rose in memory of the innocent victims of the Christmas Market attack in December 2016.</p><p>In Hamburg, the Prime Minister met with Mayor Olaf Scholz as well as officials from several of Germany’s federal states. Following the meetings, the Prime Minister attended Hamburg’s annual St. Matthew’s Day banquet as this year’s invited guest of honour and delivered remarks. The German Vice Chancellor and Foreign Minister Sigmar Gabriel also spoke at the banquet as an invited guest.</p><h2>Quotes</h2><blockquote><p>“It was a great honour to be the first Canadian Prime Minister to address the full European Parliament following this week’s positive vote on CETA. This landmark trade deal puts people first, and will strengthen the middle class on both sides of the Atlantic. Together, I know Canada and the EU will continue to champion progressive free trade deals that benefit everyone.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Germany is a key partner, ally, and friend. We will continue working with Chancellor Merkel to strengthen this important relationship, while advancing our common goals and growing the middle class in both our countries. I look forward to returning to Germany this July for the G20 Leaders’ Summit in Hamburg.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></span></p></blockquote><h2>Quick Facts</h2><ul><li>While in Europe, the Prime Minister was joined by the Honourable Chrystia Freeland, Minister of Foreign Affairs; the Honourable François-Philippe Champagne, Minister of International Trade; and Stéphane Dion, who has been proposed as Canada’s next Ambassador to the European Union and Germany.</li><li>Canada and the EU are expected to implement CETA in spring 2017, which will allow businesses on both sides of the Atlantic to take full advantage of the Agreement’s significant economic benefits.</li><li>With CETA, Canada and the EU have set the bar high for progressive trade agreements</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2017/02/08/prime-minister-justin-trudeau-address-european-parliament-france-and\">Prime Minister Justin Trudeau to address European Parliament in France and Visit Germany</a></li><li><a href=\"http://www.europarl.europa.eu/news/en/news-room/20170209IPR61728/ceta-meps-back-eu-canada-trade-agreement\">CETA: MEPs back EU-Canada trade agreement</a>&nbsp;</li><li><a href=\"/en/news/news-releases/2016/10/30/canada-and-eu-sign-historic-trade-agreement-during-eu-canada-summit\">Canada and EU sign historic trade agreement during EU-Canada Summit</a></li><li><a href=\"http://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-EU Comprehensive Economic and Trade Agreement</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/spa-aps.aspx?lang=eng\">Canada-EU Strategic Partnership Agreement</a></li><li><a href=\"http://www.international.gc.ca/europe/eu-ue.aspx?lang=eng\">Canada and Europe</a></li></ul></div>\n      "
}