{
  "path": "/en/news/statements/2020/09/01/statement-prime-minister-40th-anniversary-terry-foxs-marathon-hope",
  "pageTitle": "Statement by the Prime Minister on the 40th anniversary of Terry Fox’s Marathon of Hope | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 40th anniversary of Terry Fox’s Marathon of Hope:</p>\n\n<p>“Terry Fox is a Canadian hero who taught us invaluable lessons about the importance of helping others. After losing his leg to cancer, he ran the Marathon of Hope to raise money for cancer research. Starting at Canada’s easternmost point in St.&nbsp;John’s, Newfoundland and Labrador, Terry ran – with a prosthetic leg – a marathon a day for 143 days. Sadly, before he arrived in Thunder Bay, Ontario, on September 1, 1980, his cancer spread to his lungs and Terry had to cut his cross-country tour short.</p>\n\n<p>“Through it all, Terry never lost hope and insisted on empowering people along his journey while fighting the disease. His extraordinary accomplishments captivated the country, instilled hope in Canadians, and helped shift their views of people with disabilities. Forty years later, people across Canada and around the world continue to be inspired by Terry’s tenacity and enthusiastic message of hope, which is as timely as ever during the COVID-19 pandemic.</p>\n\n<p>“The annual Terry Fox Run has become a Canadian tradition, inspired by Terry’s ability to raise awareness about cancer and encourage millions to donate to the cause. This year, the run on September 20 will be held virtually. Although we may not be physically together, we can run, walk, and ride in his honour and support fundraising efforts within our communities.</p>\n\n<p>“In July 2019, the Government of Canada announced an investment of $150 million over five years to the Terry Fox Research Institute. This funding will help establish a national Marathon of Hope Cancer Centres Network to advance precision medicine in cancer research across the country with the goal of achieving Terry Fox’s dream of a world without cancer. In May 2019, the government also announced <a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2019/05/minister-bains-announces-investment-to-accelerate-medical-breakthroughs-that-will-enable-truly-personalized-health-care.html\">an investment of up to $49 million in the Digital Health and Discovery Platform</a>, co-led by the Terry Fox Research Institute and involving over 90 partners across Canada. Thanks to new technologies, we are building the future of modern health care in Canada through cutting-edge, pooled research, in areas including cancer, to help all Canadians live healthier, longer lives.</p>\n\n<p>“Thanks to his exemplary courage, discipline, persistence, and patience, Terry Fox built a legacy that has inspired generations and helped raise over $800 million in his name. Today, and on September 20, as you participate in your local runs, think of Terry and how you can contribute to his mission of finding a cure for all types of cancer.”</p></div>\n      "
}