{
  "path": "/en/news/statements/2022/09/30/statement-prime-minister-national-day-truth-and-reconciliation",
  "pageTitle": "Statement by the Prime Minister on the National Day for Truth and Reconciliation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, a National Residential School Crisis Line offers emotional support and crisis referral services for residential school Survivors and their families. Call the toll-free Crisis Line at 1-866-925-4419. This service is available 24&nbsp;hours a day, 7&nbsp;days a week. The Hope for Wellness Help Line also offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at&nbsp;<a href=\"http://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>.</em></p>\n\n<p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day for Truth and Reconciliation:</p>\n\n<p>“Today, we mark the second <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">National Day for Truth and Reconciliation</a> – an opportunity to come together to reflect on the legacy of residential schools and the ongoing impacts on Survivors, their families and communities, as well as commit to continuing the hard, but necessary work to build a better future for all.</p>\n\n<p>“Between 1831 and 1998, at least 150,000 First Nations, Inuit, and Métis children were forcibly removed from their families and communities to attend residential schools, where they had to abandon their languages, cultures, spiritualities, traditions, and identities. Many experienced physical, emotional, and sexual abuse, and thousands never came home. The experiences and intergenerational trauma of these so-called schools continue to live on for Indigenous Peoples across the country every single day.</p>\n\n<p>“It is our shared responsibility to confront the legacy of residential schools and the ongoing impacts on Indigenous Peoples, so we can truly move forward together. That is why, last year, Parliament voted unanimously to establish the National Day for Truth and Reconciliation as an opportunity for all Canadians to learn more, honour the Survivors of residential schools, their families, and their communities, and remember the many children who never returned home. Reconciliation is not the responsibility of Indigenous Peoples – it is the responsibility of all Canadians. It is our responsibility to continue to listen and to learn.</p>\n\n<p>“This past July, His Holiness Pope Francis offered an apology to Survivors, their families, and their communities here in Canada, and recognized the abuses experienced at residential schools that resulted in cultural destruction, loss of life, and ongoing trauma for Indigenous Peoples across the country. It was a step forward in all the work that remains and a reminder that we still have more to do. We will continue to be there to support the painful but necessary work to locate unmarked graves, and to support Survivors as they tell their stories, including through the efforts of the Independent Special Interlocutor for Missing Children and Unmarked Graves and Burial Sites, Kimberly Murray, who was appointed this past June. We are also ensuring the appropriate supports are available for communities to heal and commemorate the lives that were lost.</p>\n\n<p>“Last month, alongside the National Centre for Truth and Reconciliation leadership, Survivors, and members of Indigenous communities, I witnessed the Survivors’ Flag raising on Parliament Hill to honour Survivors and all the lives that have been or continue to be impacted by the residential school system. The flag serves as a reminder of the government’s commitment to Survivors and future generations to never forget what happened at these so-called schools. Over the last year, we updated Canada’s Oath of Citizenship to recognize First Nations, Inuit, and Métis rights, and introduced legislation to establish a National Council for Reconciliation to track and report on the implementation of the Truth and Reconciliation Commission’s Calls to Action. Through the <cite><a href=\"https://www.justice.gc.ca/eng/declaration/index.html\">United Nations Declaration on the Rights of Indigenous Peoples Act</a></cite>, we continue to work with Indigenous Peoples to ensure their human rights are fully recognized, respected, and protected.</p>\n\n<p>“On this day, which is also known as <a href=\"https://www.orangeshirtday.org/\">Orange Shirt Day</a>, I invite everyone to listen to Survivors and learn more about the history and legacy of the residential school system by participating in a local event or wearing an orange shirt. Let’s take a moment today to participate, learn, and reflect. We all have a role to play on the journey toward reconciliation.”</p></div>\n      "
}