{
  "path": "/en/news/statements/2022/10/18/statement-prime-minister-persons-day",
  "pageTitle": "Statement by the Prime Minister on Persons Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Persons Day:</p>\n\n<p>“Today, on <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month/persons-day.html\">Persons Day</a>, we celebrate the resolve of the Famous Five, who helped ensure a better and fairer Canada where women can participate equally in all aspects of life.</p>\n\n<p>“On October&nbsp;18,&nbsp;1929, a landmark decision gave women the legal status of ‘persons’ and the right to serve as senators. This was made possible by the efforts of five Canadian women who joined efforts to ensure equal rights for women in Canada. As a result, our country’s highest court of appeal at the time declared the exclusion of women from public offices ‘a relic of days more barbarous than ours.’</p>\n\n<p>“While it must be noted the Famous Five case ruling did not benefit all women, including Indigenous women and women of Asian heritage and descent, it did mark critical progress in the advancement of gender equality in Canada, and it paved the way for subsequent generations of women to continue their push for equality, respect, and justice.</p>\n\n<p>“Achieving gender equality is a key priority which informs and guides all the work of the Government of Canada. To support this vision, we introduced the <a href=\"https://women-gender-equality.canada.ca/en/gender-results-framework.html\">Gender Results Framework</a> in 2018, which sets out our goals, tracks progress, and keeps the government accountable. In Budget 2022, we proposed new measures to make further progress toward these goals by ensuring more positions for women in senior management and leadership roles and increasing the number of women and underrepresented groups as administrators of Canada’s justice system. And we are delivering on our promise to build a Canada-wide early learning and child care system, which is already helping reduce costs for regulated child care this year, and is progressing toward $10-a-day child care on average from coast to coast to coast in the coming years. Access to affordable child care is a key contributor to women’s economic participation.</p>\n\n<p>“Internationally, Canada continues to support the United Nations’ <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Sustainable Development Goals</a> by advancing global efforts to empower women and girls around the world. This work is crucial at a time when the human rights and freedoms of so many women and girls continue to be restricted or rolled back. Right now, as women, girls, and students in Iran are bravely standing up to the oppressive Iranian regime, Canada is standing with them. Recently, we implemented further measures against the Iranian regime and its so-called “morality police,” and we will continue to use every tool at our disposal to implement the most robust sanctions in the world.</p>\n\n<p>“As we celebrate <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a> this October, we reaffirm our commitment to upholding the rights of women and girls everywhere. On this day, I invite all Canadians to continue standing up for the equality that makes our country such a great place to call home.”</p></div>\n      "
}