{
  "path": "/en/news/news-releases/2021/10/28/prime-minister-announces-chief-government-whip",
  "pageTitle": "Prime Minister announces Chief Government Whip | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Steven MacKinnon, Member of Parliament for Gatineau, has agreed to serve as Chief Government Whip. He will be sworn in as a member of the Privy Council and Chief Government Whip.</p>\n\n<p>Mr. MacKinnon will be part of a diverse team that will continue to take strong action to find real solutions to the challenges that Canadians face, including by delivering on key government priorities and finishing the fight against COVID-19 to build a better future for everyone.</p>\n\n<p>Mr. MacKinnon was first elected as the Member of Parliament for Gatineau in 2015. He has previously served as Parliamentary Secretary to the Minister of Public Services and Procurement and Parliamentary Secretary to the Minister of Public Services and Procurement and Accessibility.</p>\n\n<p>Mr. MacKinnon has worked on mergers, acquisitions, and financial communications at a global consultancy firm, and served in senior roles in government and politics. Over the course of his career, he has participated in negotiations related to constitutional issues, trade agreements, and collective agreements, as well as major health, education, and democratic reforms. He is a graduate of the University of Moncton and Queen’s University.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Steven MacKinnon is an experienced parliamentarian who has shown great dedication to deliver on our key commitments to build a better future for all Canadians. He will ensure our team in Parliament remains focused on implementing the priorities of the Government of Canada, and I am confident that Steven will fulfill his new duties with professionalism, integrity, and care. He has my trust and respect, and that of the whole caucus.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Fact</h2>\n\n<ul>\n\t<li><a name=\"_Hlt85479122\" id=\"_Hlt85479122\"></a><a name=\"_Hlt85479123\" id=\"_Hlt85479123\"></a>Each recognized party in the Parliament of Canada has a whip. Among other duties, the whips ensure that enough Members are in the chamber for debates and votes, determine which committees Members will sit on, and assign offices and seats in the House of Commons. Whips also work with Members to ensure the smooth functioning of Parliament, Members’ offices, and service to constituents.</li>\n</ul></div>\n      "
}