{
  "path": "/en/news/statements/2020/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p>\n\n<p>“Today, on <a href=\"http://www.canada.ca/iwd\">International Women’s Day,</a> we celebrate the accomplishments and leadership of women in Canada and around the world, and recommit ourselves to moving forward to a future in which everyone has an equal chance to succeed.</p>\n\n<p>“We all have women in our lives who inspire us every day. This year’s theme, Because Of You, honours those who have paved the way. In particular, we celebrate Canadian women leaders who challenge norms, lift up other women and girls, and change our country for the better. &nbsp;</p>\n\n<p>“Among those women leaders, we have Dr. Alaa Murabit. She is a Canadian-Libyan physician and UN High-Level Commissioner recognized globally for her work in security, health policy, and sustainable development.</p>\n\n<p>“Ann Divine, who immigrated to Canada in 2004, is an advocate for Black and immigrant business women. A former probation officer and human rights worker, she is the founder and CEO of a Halifax company that provides leadership, networking, and diversity training to people and organizations.</p>\n\n<p>“Kathryn Foss is a transgender woman, speaker, and retired member of the Canadian Armed Forces. Major (Ret’d) Foss has helped promote diversity and establish policy on transgender inclusion within our armed forces, notably as the founder of the Defence Team Pride Network.</p>\n\n<p>“Along with so many others in Canada and around the world, these three <a href=\"https://cfc-swc.gc.ca/commemoration/iwd-jif/trailblazers-pionnieres-en.html\">gender equality trailblazers</a> are among those highlighted this year. They show how the actions, big and small, of just one person can drive positive change. They motivate us to continue to break down barriers.</p>\n\n<p>“Gender equality is at the heart of everything we do as a government, both at home and abroad. That is why we have strengthened and increased the use of Gender-based Analysis Plus. We know how important it is to think intersectionally about public policy and decision-making. We laid the groundwork to close the gender wage gap, and promote equality by creating more flexible parental leave and introducing proactive pay equity legislation for federally regulated workers. We also invested in women’s organizations and Indigenous organizations, to advance equality and tackle barriers experienced by women across the country.</p>\n\n<p>“Internationally, we made historic investments in girls’ education and women’s rights around the world, and, in June 2019, we announced <a href=\"https://www.canada.ca/en/global-affairs/news/2019/06/canada-and-partners-announce-new-legacy-investments-to-support-womens-rights-and-gender-equality-at-home-and-abroad.html\">funding to mobilize resources</a> for women’s rights organizations and movements in developing countries.</p>\n\n<p>“In our homes, in our communities, and in our workplaces, everyone has a role to play to make real and lasting gender equality a reality. None of us can move forward if half of us are held back. I encourage all Canadians to celebrate women’s achievements, and to keep pushing for progress so we can all reach our full potential.”</p></div>\n      "
}