{
  "path": "/en/news/news-releases/2018/10/25/prime-minister-welcomes-increased-partnership-netherlands",
  "pageTitle": "Prime Minister welcomes increased partnership with the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the Prime Minister of the Netherlands, Mark Rutte, to explore how we can work together to address pressing global challenges and build on our countries’ close friendship.</p><p>During the visit, Prime Minister Trudeau and Prime Minister Rutte underscored the strong, long-standing relationship between our two countries – including Canada’s role in the liberation of the Netherlands at the end of the Second World War – and our common commitment to democracy, equality, and the rules-based international order.</p><p>At the Tomb of the Unknown Soldier, the two prime ministers honoured members of our armed forces, past and present, and those who have fallen in the service of our shared values. They also saluted the Canadian and Dutch forces who are serving side-by-side in Iraq and Mali, as well as in Latvia and Lithuania as part of NATO’s enhanced Forward Presence battlegroups.</p><p>Later, Prime Minister Rutte addressed the Canadian Parliament, becoming the first Dutch prime minister to do so. Following the address, Prime Minister Rutte announced the Netherlands’ endorsement of the Canada-led Ocean Plastics Charter, building on our countries’ close collaboration to fight climate change and protect the environment. A&nbsp;historic initiative to eradicate plastic pollution, the Charter was adopted during the G7 Summit in June under Canada’s leadership.</p><p>Prime Minister Trudeau and Prime Minister Rutte also met with Canadian and Dutch business leaders to discuss opportunities for innovation, collaboration, and increased trade and investment. They explored how to further leverage the Canada-EU Comprehensive Economic and Trade Agreement (CETA), which is already creating good, well-paying, middle class jobs for people in Canada and the Netherlands alike. Since CETA’s entry into force, Canadian exports to the Netherlands have increased by 33 per cent, while imports have increased by almost 24 per cent.</p><p>Prime Minister Trudeau and Prime Minister Rutte also held a town hall with students at a high school in Ottawa. They underlined the need to support young leaders and encourage their involvement in public policy in order to build a more inclusive, peaceful, and prosperous world.</p><p>Today, Prime Minister Rutte is also attending a Canada-Netherlands dialogue and expert roundtable on climate adaptation. The roundtable is a chance to welcome the announcement that Canada will provide $7.5&nbsp;million&nbsp;dollars in financial support for the Global Commission on Adaptation, an initiative spearheaded by the Netherlands, and that Canada will work with the Netherlands-hosted Global Center on Adaptation to help address critical climate adaptation gaps.</p><h2>Quote</h2><blockquote><p>“The Netherlands is one of Canada’s closest allies and friends. We share a strong commitment to gender equality, free trade, and international peace and security, and we are working closely together to fight climate change and build economies that benefit everyone. Today was an important opportunity to meet with Prime Minister Rutte to discuss how we can use the values that have united our countries for decades – democracy, the rule of law, and equality – to build a better future for people on both sides of the Atlantic.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Netherlands and Canada are active members of the United Nations, the World Trade Organization, NATO, the Organization for Security and Cooperation in Europe, the Organisation for the Prohibition of Chemical Weapons, and the various international judicial institutions headquartered in The Hague.</li><li>Canada and the Netherlands are both leaders in the fight against climate change, and Canada is working with the Netherlands, and other member states of the European Union, to ensure the effective implementation of the Paris Agreement.</li><li>The Ocean Plastics Charter was a key outcome of the G7 Summit in June, initially adopted by Canada, France, Germany, Italy, the United Kingdom, and the EU. The Charter outlines concrete actions to eradicate plastic pollution, and recognizes the need for urgent action to address the devastating impacts of marine litter on the health and sustainability of our oceans, seas, coastal communities, and ecosystems. In addition to the Netherlands, Jamaica, Kenya, the Marshall Islands, and Norway, as well as 18 companies, have endorsed the Charter since the Summit.</li><li>The Netherlands is also actively engaged in the Powering Past Coal Alliance, which was co-launched by Canada and the United Kingdom at the UN Climate Change Conference in November 2017. The Alliance is a voluntary coalition of 75&nbsp;governments, businesses and organizations that help lead global efforts to end the use of unabated coal power.</li><li>CETA is helping to create jobs, strengthen economic relations and boost Canada's trade with the world’s second-largest market. CETA is an inclusive free trade agreement, which covers virtually all sectors and aspects of Canada-EU trade in order to eliminate or reduce barriers.</li><li>Today, Canada also launched the new Canadian Centre for Climate Services, which will provide information to Canadians on how the climate is changing where they live and work so that they understand and can plan for climate impacts.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands Relations</a></li><li><a href=\"/en/news/news-releases/2018/10/25/netherlands-endorses-canada-led-ocean-plastics-charter\">The Netherlands endorses Canada-led Ocean Plastics Charter</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/canadian-centre-climate-services.html\">Canadian Centre for Climate Services</a></li></ul></div>\n      "
}