{
  "path": "/en/news/readouts/2022/02/28/prime-minister-justin-trudeau-speaks-secretary-general-united-nations",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Secretary-General of the United Nations António Guterres | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Secretary-General of the United Nations, António Guterres, about the situation in Ukraine.</p>\n\n<p>Prime Minister Trudeau strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty and independence of Ukraine. The Prime Minister expressed his profound concern for Ukraine and its people.</p>\n\n<p>The Prime Minister and the Secretary-General agreed on the historic and enduring importance of the UN Charter, international law, and ongoing dialogue to advance peace.</p>\n\n<p>The leaders expressed deep concern for the terrible human cost of war, and for the unfolding humanitarian crisis.</p>\n\n<p>The Prime Minister and the Secretary-General resolved to keep in close touch on this and other important global issues in days ahead.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/26/prime-minister-justin-trudeau-and-deputy-prime-minister-and-minister\">Prime Minister Justin Trudeau and Deputy Prime Minister and Minister of Finance Chrystia Freeland speak with Prime Minister of Ukraine Denys Shymal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/25/statement-nato-heads-state-and-government-russias-attack-ukraine\">Statement by NATO Heads of State and Government on Russia’s Attack on Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}