{
  "path": "/en/news/news-releases/2016/04/15/prime-minister-announces-significant-investment-perimeter-institute",
  "pageTitle": "Prime Minister announces significant investment for Perimeter Institute | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will invest $50 million, over five years, in Waterloo’s Perimeter Institute so that it can continue its world-leading research in theoretical physics.</p>\n<p>In Budget 2016, the Government defines a new vision for Canada’s economy: to build Canada as a centre of global innovation. Canada will be propelled by its globally competitive companies—like the Perimeter Institute—that support entrepreneurs and seize global market opportunities to grow the economy.</p>\n<p>This investment—which will be strengthened by investments from the Perimeter Institute’s other partners—will help the centre continue its work in scientific research, training, and education outreach in foundational theoretical physics, a branch of physics that focuses on understanding the nature of our universe.</p>\n<p>The Government of Canada understands the central role science plays in a thriving economy. In addition to today’s announcement, Budget 2016 boosted federal funding for science, and made significant investments in federal and university research labs to ensure Canada remains a world leader in global innovation.</p>\n<p><strong>Quote</strong></p>\n<p>“The Perimeter Institute and its researchers prove every day that Canada is a global leader in innovation and research. The work they are doing will lead to the technological discoveries of tomorrow that will contribute in tangible ways to our understanding of the universe around us. This is an investment in our future.”<br>-&nbsp;<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}