{
  "path": "/en/news/news-releases/2016/08/02/prime-minister-announces-new-supreme-court-canada-judicial",
  "pageTitle": "Prime Minister announces new Supreme Court of Canada judicial appointments process | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, announced a new process for appointing Supreme Court of Canada Justices that is open, transparent, and sets a higher standard for accountability.</p>\n<p>Under the new process, an independent and non-partisan Advisory Board has been given the task of identifying suitable candidates who are jurists of the highest caliber, functionally bilingual, and representative of the diversity of our great country.</p>\n<p>For the first time, any qualified Canadian lawyer or judge may apply for appointment to the Supreme Court of Canada through the&nbsp;<a href=\"http://www.fja-cmf.gc.ca/home-accueil/index-eng.html\">Office of the Commissioner for Federal Judicial Affairs</a>.</p>\n<p>The seven-member Advisory Board, chaired by former Prime Minister Kim Campbell, includes four members nominated by independent professional organizations. The Advisory Board will review candidates who apply and will submit a shortlist of three to five individuals for consideration by the Prime Minister.</p>\n<p>To enhance transparency, the assessment criteria guiding the Advisory Board, the questionnaire that all applicants must answer, and certain answers provided to the questionnaire by the Prime Minister’s eventual nominee, will all be made public.</p>\n<p>The Minister of Justice and the chair of the Advisory Board will appear before Parliament to discuss the selection process. A number of Members of Parliament and Senators – from all parties – will also have the opportunity to take part in a Q&amp;A session with the eventual nominee, before she or he is appointed to the Supreme Court of Canada.</p>\n<p>Fundamentally, this process will demonstrate a degree of rigor and responsibility that Canadians expect from their government.</p>\n<p><strong>Quote</strong></p>\n<p><strong>“</strong>The Supreme Court of Canada is respected nationally and internationally for its excellence—it is recognized as a model of a strong, independent judicial institution. This is due in no small part to a tradition of appointing only the most exceptional and impressive individuals to the court. We are committed to maintaining this tradition—and improving on it—by introducing an open, transparent and non-partisan process that will help ensure that the best, most well-qualified people reflective of Canadian society are named to Canada’s top court.”<br><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The following members have been named to the Independent Advisory Board for Supreme Court of Canada Judicial Appointments:<br><br></li>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/08/02/right-honourable-kim-campbell\">The Right Honourable Kim Campbell</a>&nbsp;– Chairperson – former Prime Minister of Canada and Canadian Consul General, and currently the Founding Principal of the Peter Lougheed Leadership College at the University of Alberta</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/camille-cameron\">Camille Cameron</a>&nbsp;– member – Dean of the Schulich School of Law at Dalhousie University, and Chair of the Canadian Council of Law Deans</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/jeff-hirsch\">Jeff Hirsch</a>&nbsp;– member – President of the Federation of Law Societies of Canada, and partner with a Winnipeg law firm</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/stephen-kakfwi\">Stephen Kakfwi</a>&nbsp;– member - former Premier of the Northwest Territories and President of the Dene Nation, and currently working to improve the recognition and realities of Aboriginal peoples within Canada</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/lili-anna-pereša\">Lili-Anna Pereša</a>&nbsp;– member - President and Executive Director of Centraide of Greater Montreal</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/richard-jamieson-scott\">Richard J. Scott</a>&nbsp;– member – former Chief Justice of the Manitoba Court of Appeal, and current counsel, arbitrator and mediator in a Winnipeg law firm</li>\n<li><a href=\"/en/news/backgrounders/2016/08/02/susan-ursel\">Susan Ursel</a>&nbsp;– member – currently a senior partner with a Toronto firm, and Chair of the Canadian component of the African Legal Research Team which provides legal research support to Envisioning Global LGBT Rights<br><br></li>\n</ul>\n<li>The application period ends on Wednesday, August 24.</li>\n<li>Qualified lawyers and persons holding judicial office from across Canada who wish to be considered for the upcoming vacancy must complete and submit an application package&nbsp;no later than 23:59 Pacific daylight time on August24, 2016<em>.</em></li>\n<li>Applications are now being accepted for the position that will become vacant in September with the retirement of the Honourable Justice Cromwell.</li>\n</ul>\n<p><strong><br>Related link</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">Backgrounder: New process for judicial appointments to the Supreme Court of Canada</a></li>\n</ul>\n<p><strong><br>Associated links</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/08/02/biographical-notes\">Biographical notes on members of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li>\n<li><a href=\"/en/news/2016/08/02/supreme-court-appointments-process-questions-and-answers\"></a><a href=\"http://www.fja-cmf.gc.ca/scc-csc/mandate-mandat-eng.html\">Terms of Reference for the Advisory Board</a></li>\n<li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and assessment criteria</a></li>\n<li><a href=\"/en/news/backgrounders/2016/08/04/mandate-letter-members-independent-advisory-board-supreme-court\">Mandate Letter (members) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li>\n<li><a href=\"/en/news/backgrounders/2016/08/04/mandate-letter-chair-independent-advisory-board-supreme-court-canada\">Mandate Letter (Chair) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li>\n</ul></div>\n      "
}