{
  "path": "/en/news/readouts/2021/06/11/prime-minister-justin-trudeau-meets-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Prime Minister Boris Johnson of the United Kingdom in advance of the G7 Leaders’ Summit, to discuss their expectations and shared priorities for the Summit, in Carbis Bay, UK.</p>\n\n<p>The two leaders highlighted vaccination progress in both countries, and emphasized the importance of efficient and equitable access to vaccines around the world to end the pandemic for good. They looked forward to making progress on other shared priorities, including promoting a global economic recovery that benefits everyone and grows the middle class, and advancing gender equality. The two leaders also discussed taking bold action on climate change in the lead-up to COP26, including the international transition away from coal.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson discussed the Open Societies agenda and emphasized that shared values, including democracy, human rights, gender equality and inclusion, must be at the core of an effective response to global challenges. The leaders reiterated their commitment to respond to challenges to these shared values.</p>\n\n<p>The two leaders’ wide-ranging discussion also touched on a number of foreign policy and global issues, including China, the downing of Ukraine International Airlines Flight 752, Afghanistan, NATO, and the Commonwealth.</p>\n\n<p>The two leaders also spoke about the deep ties that unite Canada and the United Kingdom, including trade that benefits workers and businesses on both sides of the Atlantic. Prime Minister Trudeau welcomed the launch of the UK accession process to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, and the two leaders agreed to redouble their efforts to secure a comprehensive Free Trade Agreement between Canada and the UK, with a view to unlocking the huge opportunities that exist for both countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom relations</a></li>\n\t<li><a href=\"https://www.g7uk.org/\">G7 UK 2021</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2019/01/g7-rapid-response-mechanism.html\">G7 Rapid Response Mechanism</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/canada-and-cptpp-parties-agree-to-commence-accession-process-with-united-kingdom.html\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n</ul></div>\n      "
}