{
  "path": "/en/news/readouts/2020/10/16/prime-minister-justin-trudeau-speaks-president-turkey-recep-tayyip-erdogan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Turkey Recep Tayyip Erdoğan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the President of Turkey, Recep Tayyip Erdoğan.</p>\n\n<p>The Prime Minister and the President exchanged views on the conflict in the Nagorno-Karabakh region. The Prime Minister stressed the importance of all parties seeking a peaceful resolution through dialogue and diplomacy, noting that there could be no military solution to this conflict. The Prime Minister expressed his deep concern about rising casualties, the loss of civilian lives and violations of the ceasefire. The Prime Minister urged Turkey to use its influence to bring the parties to the table to resolve the conflict peacefully.</p>\n\n<p>The leaders also discussed bilateral issues, including Canada’s recent decision to suspend certain export permits to Turkey in light of the current hostilities in the region and in line with Canada’s robust export control regime. &nbsp;</p>\n\n<p>Prime Minister Trudeau and President Erdoğan discussed their respective efforts to fight the COVID-19 pandemic. The Prime Minister thanked the President for Turkey’s leadership and support to other countries during the pandemic.</p>\n\n<p>The two leaders looked forward to staying in touch on issues of mutual concern and growing the important people-to-people and trade ties between Canada and Turkey.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/turkey-turquie/relations.aspx?lang=eng\">Canada-Turkey relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/09/joint-statement-by-canada-and-the-united-kingdom-on-the-armenia-azerbaijan-conflict.html\">Joint statement by Canada and the United Kingdom on the Armenia-Azerbaijan conflict</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/10/statement-from-minister-champagne-on-suspension-of-export-permits-to-turkey.html\">Statement from Minister Champagne on suspension of export permits to Turkey</a></li>\n</ul></div>\n      "
}