{
  "path": "/en/news/statements/2020/12/15/prime-minister-welcomes-report-special-advisor-canadas-ongoing-response",
  "pageTitle": "Prime Minister welcomes report from Special Advisor for Canada’s ongoing response to Iran’s shooting-down of Ukraine International Airlines Flight 752 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, as well as the Minister of Foreign Affairs, François-Philippe Champagne, and Minister of Transport, Marc Garneau, today issued the following statement to welcome the report from the Honourable Ralph Goodale, the Special Advisor for Canada’s ongoing response to the Ukraine International Airlines tragedy:</p>\n\n<p>“Today, we are pleased to accept the <a href=\"https://www.international.gc.ca/gac-amc/publications/flight-vol-ps752/index.aspx?lang=eng\">report</a> from Special Advisor Ralph Goodale, who is advising on the Government of Canada’s ongoing response to Iran’s shooting-down of Flight PS752. We thank Mr. Goodale for his dedication, heartfelt work, and thoughtful recommendations.</p>\n\n<p>“When Iran shot down a Ukrainian commercial jetliner, Flight PS752, it took the lives of 176 innocent people, including 138 with ties to Canada. The report provides valuable recommendations to identify lessons learned from this air disaster as well as those of Air India Flight 182 and Ethiopian Airlines Flight 302. Its findings will be used to establish best practices to respond to future international air disasters.</p>\n\n<p>“The report also highlights the importance of paying close attention to the needs of the families of victims of air tragedies, which must be at the heart of Canada’s response. Canadians must remain steadfast in our search for the transparency, accountability and justice the families need and deserve. The report contains important recommendations on ways to improve support for the families of victims of air disasters. These include robust engagement with families, and accurate, timely, and reliable information sharing with them as quickly as possible and on an ongoing basis. We must remember and honour the precious lives lost in these international air disasters.</p>\n\n<p>\"Relentless pursuit of the truth about what happened is absolutely vital. To that end, the Special Advisor has posed vital questions that Iran should answer comprehensively, with supporting evidence, to demonstrate the credibility of its investigations, and to convince the international civil aviation community that Iran can provide a safe airspace. The report strongly endorses Canada's \"Safer Skies\" initiative to help keep civilian aircraft away from dangerous conflict zones, and offers advice to improve the quality of safety investigations into air tragedies where military activity is the prime culprit.</p>\n\n<p>“The Government of Canada is acting quickly to address the recommendations in Special Advisor Goodale’s report as we approach the first anniversary of Iran’s downing of Ukraine International Airlines Flight 752.</p>\n\n<p>“Canada continues to work with international partners to pursue thorough and credible investigations into Iran’s shooting-down of this aircraft as we seek transparency, accountability, and justice for the victims and their families.”</p></div>\n      "
}