{
  "path": "/en/news/news-releases/2023/04/21/volkswagens-new-electric-vehicle-battery-plant-will-create-thousands",
  "pageTitle": "Volkswagen’s new electric vehicle battery plant will create thousands of new jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From mining critical minerals to building batteries and cars, Canada and Ontario continue to attract historic, transformational investments across the electric vehicle supply chain to secure more good-paying jobs for workers today and for decades to come.</p>\n\n<p>Last month, Canada and Ontario secured a historic investment from Volkswagen, Europe’s largest automaker. Volkswagen is investing $7&nbsp;billion to establish its first overseas electric vehicle battery manufacturing plant in St. Thomas, Ontario. This is the largest electric vehicle-related investment in Canadian history, signaling a strong vote of confidence in Canada and Ontario’s highly-skilled workers, strong economies, and competitive business environments.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Ontario, Doug Ford, were joined today by&nbsp;the Minister of Innovation, Science and Industry, François-Philippe Champagne, and Ontario’s Minister of Economic Development, Job Creation and Trade, Vic Fedeli, to highlight this generational deal for St. Thomas, Ontario, and Canada’s entire electric vehicle supply chain.</p>\n\n<p>The plant, Volkswagen’s largest to date, will create up to 3,000 direct jobs and up to 30,000 indirect jobs. Once complete in 2027, the plant will produce batteries for up to one million electric vehicles per year, bolstering Canada’s domestic battery manufacturing capacity to meet the demand for electric vehicles now and into the future. The plant, which will generate about $200&nbsp;billion in value, will be the largest manufacturing plant in Canada. Construction is expected to begin next year.</p>\n\n<p>To strengthen and grow St.&nbsp;Thomas and the surrounding communities, Ontario will invest in other important infrastructure projects across the region, including improvements to roads, highways, utility services, and police and fire services.</p>\n\n<p>Since 2020, historic new investments have been made in Ontario by global automakers as well as electric vehicle batteries and battery materials suppliers. From mining critical minerals to building batteries and electric vehicles, Canada and Ontario have the resources and skilled workers to continue leading the world. This means a strong economy, good-paying jobs, and clean air now and into the future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we talk about our made-in-Canada plan, we’re talking about creating good, middle-class jobs now and into the future, we’re talking about clean air for our kids and grandkids, and we’re talking about a strong economy that works for all Canadians. That’s what Volkswagen’s new electric vehicle battery plant in St. Thomas – the largest manufacturing plant in the country once built – is all about. It’s a win for workers, for the community, and for the economy.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<blockquote>\n<p>“This investment, the largest auto investment in our province’s history, is a big win for Ontario, the people of St. Thomas and surrounding areas. We’re thrilled to welcome Volkswagen and PowerCo SE to Ontario and thank them for their tremendous confidence in our province, our workers and our growing electric vehicle supply chain. Welcome to Team Ontario, Volkswagen!”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Doug Ford, Premier of Ontario</footer></blockquote>\n\n<blockquote>\n<p>“Today’s announcement is a true testament to our highly skilled workforce and Canada’s strong and growing battery ecosystem. Volkswagen’s decision to establish its first overseas gigafactory in Canada speaks to our country’s competitiveness when it comes to attracting major investments. It is also a vote of confidence in Canada as the green supplier of choice to the world. With Volkswagen and PowerCo SE, our government looks forward to working together toward a cleaner, more sustainable and resilient economy.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer></blockquote>\n\n<blockquote>\n<p>“Last October, we met with Volkswagen in Germany to discuss the possibility of a new EV battery manufacturing facility. Six months later, we’re proud to say this potential will become a reality. Volkswagen’s historic investment will strengthen our end-to-end electric vehicle supply chain and create more good-paying jobs for workers in St. Thomas and across the province. Our government continues to create the right conditions for businesses and workers to succeed now and in the future. Thank you, Volkswagen, for choosing Ontario.”</p>\n\n<footer class=\"default\">The Hon. Vic Fedeli, Ontario’s Minister of Economic Development, Job Creation and Trade</footer></blockquote>\n\n<blockquote>\n<p>“North America plays a key role in our global battery strategy. The region will become PowerCo’s second pillar beside Europe, with battery cells made in North America for North America. Gigafactory St. Thomas opens the door to a key market for e-mobility and battery cell production. We aim to make PowerCo a global player in the battery business and to pave the way for clean, sustainable mobility. Gigafactory St. Thomas is an important milestone in our roadmap.”</p>\n\n<footer class=\"default\">Thomas Schmall, Volkswagen Group Board Member for Technology</footer></blockquote>\n\n<blockquote>\n<p>“We are honoured to partner with Canada, Ontario, and the City of St. Thomas to take the EV industry to a new level. PowerCo was founded in Europe to make a difference in the battery business, offering cutting-edge cell technology and sustainable manufacturing. That includes the creation of up to 3,000 new jobs and great working conditions for our employees in the St. Thomas area. We share the same values and are committed to be a reliable partner for the people in St. Thomas and Ontario.”</p>\n\n<footer class=\"default\">Frank Blome, Chief Executive Officer of PowerCo SE</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>Canada has committed to providing Volkswagen with production support to match the United States <em>Inflation Reduction Act</em>’s (IRA) Advanced Manufacturing Production Credit, equalling USD$35 per kWh. Just like in the U.S., Canada’s support will only be for what is produced and sold and will phase out by 25 percentage points every year beginning in 2030 (after 2032, the credit would be eliminated). The agreement also has the flexibility to be adjusted should the U.S. Advanced Manufacturing Production Credit change in the U.S.</li>\n\t<li>Per battery investment with PowerCo SE ranges between $8&nbsp;billion and $13.2&nbsp;billion, depending on production levels. This is a part of an overall electric vehicle battery investment partnership by Canada and Ontario. Projections show that the full economic impact of the project will be equal to the value of government investment in less than five years.</li>\n\t<li>To support Volkswagen’s investment, the Government of Ontario is providing $500&nbsp;million in direct incentives to the company, and investing hundreds of millions of dollars more to strengthen and grow St. Thomas and the surrounding communities. This includes infrastructure improvements to roads, railways, water, electricity, and police and fire safety.</li>\n\t<li>Canada’s automotive sector supports over 500,000 workers, including nearly 100,000 auto plant workers in Ontario, and contributes $16&nbsp;billion annually to Canada’s gross domestic product, and is one of the country’s largest export industries.</li>\n\t<li>Ontario’s auto supply chain is comprised of over 700 parts firms, over 500 tool, die and mold makers, and over 300 connected and autonomous companies. The province is the only place in North America where five major automakers build their vehicles, including Honda, Toyota, Ford, General Motors, and Stellantis.</li>\n\t<li>Volkswagen Group is one of the world’s largest automakers with a portfolio of 10 companies.</li>\n\t<li>Volkswagen’s new electric vehicle battery manufacturing facility will be approximately 370 acres, which is larger than 378 American football fields. The entire industrial and supplier park will be 1,500 acres.</li>\n\t<li>In August 2022, the Government of Canada signed a Memorandum of Understanding with Volkwagen to advance cooperation on electric vehicle battery manufacturing in Canada.</li>\n\t<li>Since the beginning of 2022, the governments of Canada and Ontario have helped attract other historic investments across our electric vehicle supply chain – from mining to manufacturing – and provided funding to position Canada and Ontario as global leaders in battery manufacturing. This included support to:\n\t<ul class=\"bulletOutline\"><li>Retool Honda Canada’s manufacturing operations in Alliston, Ontario, to launch the next generation of hybrid-electric vehicles; and</li>\n\t\t<li>Modernize automaker Stellantis’ assembly plants in Windsor and Brampton, Ontario, to help the company increase production of electric vehicles.</li>\n\t</ul></li>\n\t<li>Canada’s <em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em> is an ambitious and achievable roadmap that outlines a sector-by-sector approach for Canada to reach its climate target of cutting emissions by 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n\t<li>Transportation accounts for about a quarter of our emissions in Canada. That’s why the Government Canada has an ambitious target of 100 per cent zero-emission vehicle sales by 2035, coupled with a suite of support measures from charging infrastructure to purchase incentives.</li>\n\t<li>Phase&nbsp;2 of Driving Prosperity, Ontario’s 10-year vision for the automotive sector, focuses on transforming the auto sector by building electric, autonomous and connected vehicles and supporting a broader supply chain that includes the exploration, mining and production of critical minerals for the fabrication of electric batteries in Ontario.</li>\n</ul><h2>Related Products</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/a-made-in-canada-plan-affordable-energy-good-jobs-and-a-growing-clean-economy.html\">Budget&nbsp;2023 Backgrounder: A Made-in-Canada Plan: Affordable Energy, Good Jobs, and a Growing Clean Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\"><em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em></a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/publications/canada-s-action-plan-clean-road-transportation\"><em>Canada’s Action Plan for Clean On-Road Transportation</em></a></li>\n\t<li><a href=\"https://www.ontario.ca/page/driving-prosperity-future-ontarios-automotive-sector\"><em>Driving Prosperity: The Future of Ontario’s Automotive Sector</em></a><em> </em></li>\n\t<li><a href=\"https://budget.ontario.ca/2023/index.html\"><em>2023 Ontario Budget: Building a Strong Ontario</em></a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2023/03/28/government-canada-releases-budget-2023\">Government of Canada releases Budget 2023</a></li>\n\t<li><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\"><em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em></a></li>\n\t<li><a href=\"https://budget.ontario.ca/2023/index.html\"><em>2023 Ontario Budget: Building a Strong Ontario</em></a></li>\n\t<li><a href=\"https://ised-isde.canada.ca/site/strategic-innovation-fund/en\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2023/03/canada-and-ontario-welcome-historic-investment-from-volkswagen.html\">Canada and Ontario welcome historic investment from Volkswagen</a></li>\n\t<li><a href=\"https://news.ontario.ca/en/release/1002392/ontario-fosters-new-opportunities-with-trade-mission-to-germany-and-austria\">Ontario Fosters New Opportunities with Trade Mission to Germany and Austria</a></li>\n\t<li><a href=\"https://www.vw.ca/en.html\">Volkswagen Canada</a></li>\n</ul></div>\n      "
}