{
  "path": "/en/news/readouts/2020/04/02/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with premiers to discuss the evolving COVID-19 situation. The leaders discussed preparations and actions undertaken by the federal government and provincial and territorial partners to protect the health and safety of all Canadians and to support workers and businesses.</p>\n\n<p>First Ministers reaffirmed their commitment to continued collaboration and coordination in addressing COVID-19. They talked about ongoing measures underway to ensure that Canadian health care workers have the necessary personal protective equipment and medical supplies they need. The Prime Minister updated premiers on the Government’s commitment to invest $2 billion to purchase testing products, ventilators, and protective personal equipment. This funding includes bulk purchases with provinces and territories, as well as measures to help businesses scale-up production or re-tool their manufacturing lines to produce products that will help in the fight against COVID-19. The Prime Minister noted that shipments of more than ten million masks have been delivered to Canada this week, and that the masks, along with thousands of gloves and swabs, were being delivered across the country. First Ministers agreed on the need to continue working together, including sharing necessary information, to ensure that equipment is provided where and when it is needed.</p>\n\n<p>First Ministers also discussed emergency actions taken by provinces and territories, including restrictions on non-essential travel between provinces, as well as between Canada and the United States, while ensuring that essential goods and supply chains are maintained.</p>\n\n<p>All First Ministers agreed on the need for continued federal-provincial-territorial collaboration to address the evolution of COVID-19. The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links:</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/prime-minister-announces-support-farmers-and-agri-food-businesses\">Prime Minister announces support for farmers and agri-food businesses under Canada’s response to COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states\">Prime Minister announces temporary border agreement with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}