{
  "path": "/en/news/news-releases/2017/07/05/prime-minister-concludes-visit-ireland-and-united-kingdom",
  "pageTitle": "Prime Minister concludes visit to Ireland and the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, concluded today his visit to Dublin, Ireland, and Edinburgh, Scotland, and will now travel to Hamburg, Germany, for the G20 Summit on July&nbsp;7&nbsp;and&nbsp;8.</p><p>While in Dublin, Prime Minister Trudeau met with Ireland’s Taoiseach (Prime Minister), Leo Varadkar. The two leaders discussed the strong people-to-people connections between Canada and Ireland, and how to take advantage of the opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p><p>Following the meeting with Taoiseach Varadkar, Prime Minister Trudeau met with the President of Ireland, Michael D. Higgins, to deepen the close collaborative relationship between the two like-minded countries.</p><p>Prime Minister Trudeau attended a Gaelic football and hurling demonstration event with local young people and a business roundtable with women entrepreneurs and other innovators from across business and government. He also visited a museum and a memorial that commemorate and celebrate the role of Irish emigrants in countries around the world, including Canada.</p><p>The Prime Minister then traveled to Edinburgh, Scotland, where he was received in audience by Her Majesty Queen Elizabeth II at the Palace of Holyroodhouse. He thanked her personally for her continued dedication and service to Canada. The Prime Minister also delivered remarks at a convocation ceremony at the University of Edinburgh.</p><h2>Quotes</h2><blockquote><p>“Irish Canadians helped make Canada the country it is today, and continue to play an enormous role in our country. I was pleased to meet with Taoiseach Varadkar and President Higgins to celebrate Canada and Ireland’s close friendship and to discuss CETA. We look forward to the good, middle class jobs and new opportunities that CETA will create for both of our countries.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“It was an honour to meet with Her Majesty The Queen, particularly as Canada celebrates the 150<sup>th</sup> anniversary of Confederation. Over the past 65 years, Her Majesty has stood with Canada in key moments of our history, and has always shown tremendous dedication to our country and its people.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In 2011, over 11.3 million Canadians claimed British Isles ancestry, including over 4.7 million of Scottish ancestry and over 4.5 million of Irish ancestry. In 2015, the United Kingdom was the 9<sup>th</sup> largest source of new permanent residents in Canada.</li><li>Canada and Ireland enjoy strong commercial relations with two-way bilateral merchandise trade worth over $2.4 billion in 2016, making it Canada’s tenth largest trading partner in the European Union. In that year, Canadian exports totaled over $496 million and imports were over $1.9 billion.</li><li>Canada and the UK enjoy a very robust commercial relationship. Two-way merchandise trade between Canada and the UK totaled over $25.3 billion in 2016, with Canadian exports being over $17 billion making the UK Canada’s fifth largest merchandise trade partner.</li><li>This was the Prime Minister’s second time being received in audience by Her Majesty. His first audience was on November 25, 2015.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1444997714981\">Her Majesty Queen Elizabeth II</a></li><li><a href=\"http://www.canadainternational.gc.ca/ireland-irlande/index.aspx?lang=eng\">Embassy of Canada to Ireland</a></li><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/index.aspx?lang=eng\">High Commission of Canada in the United Kingdom</a></li></ul></div>\n      "
}