{
  "path": "/en/news/news-releases/2019/07/10/prime-minister-announces-nomination-honourable-nicholas-kasirer",
  "pageTitle": "Prime Minister announces the nomination of the Honourable Nicholas Kasirer to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of the Honourable Nicholas Kasirer to the Supreme Court of Canada.</p>\n\n<p>Justice Kasirer has led an exceptional career as a judge and professor, earning the esteem of his peers in Canada and around the world. He served for a decade as a judge of the Court of Appeal of Quebec, where he was appointed in 2009. Prior to that, he led a twenty-year career as a professor of law at McGill University, including as dean of the Faculty of Law. Justice Kasirer is perfectly bilingual.</p>\n\n<p>On July 25, 2019, members of the House of Commons Standing Committee on Justice and Human Rights will participate in a special committee hearing, where the Minister of Justice and a representative of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments for Quebec Seats (Advisory Board) will explain the selection process for the nomination in greater detail. The hearing will be a chance for Parliamentarians to learn more about the reasons for this nomination, and the process the Advisory Board followed to recommend candidates.</p>\n\n<p>Members of the same House committee – as well as members of the Senate’s Legal and Constitutional Affairs Committee and representatives of the Bloc Québécois, the Green Party of Canada, and the People’s Party of Canada – will be invited to take part in a question and answer session with the nominee, which will also be held on July 25, 2019. The session will be moderated by a law professor.</p>\n\n<p>This nomination will fill the vacancy created by the upcoming retirement of Justice&nbsp;Clément Gascon. It represents the third nomination under the Supreme Court appointment process launched by the Government of Canada in 2016. Through the process, an independent and non-partisan advisory board is tasked with identifying candidates. In the case of Quebec seats, an advisory board is created that reflects Quebec’s unique legal tradition and ensures greater participation by its government in the selection process for judges from the province. The decision is ultimately made by the Prime Minister.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am happy to announce the nomination of Justice Kasirer to the Supreme Court of Canada. Canada’s Supreme Court is respected around the world for its strength, independence, and judicial excellence. With his outstanding legal and academic experience, gained over a distinguished thirty-year career, I know Justice Kasirer will be an asset to our country’s highest court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the selection process, a non-partisan Advisory Board identified jurists of the highest calibre who were functionally bilingual and met the statutory eligibility requirements for a Quebec seat.</li>\n\t<li>The selection process was launched on April 18, 2019, to fill the vacancy created by the upcoming retirement of Justice Clément Gascon.</li>\n\t<li>Under the requirements of the <em>Supreme Court Act, </em>the process was open only to qualified applicants trained in civil law and from Quebec. Candidates submitted applications, and a shortlist was developed.</li>\n\t<li>Once the Advisory Board compiled the shortlist, the federal Minister of Justice provided the list to the Minister of Justice of Quebec and consulted with:\n\t<ul>\n\t\t<li>the Chief Justice of Canada</li>\n\t\t<li>relevant Cabinet ministers</li>\n\t\t<li>opposition Justice critics</li>\n\t\t<li>members of the House of Commons Standing Committee on Justice and Human Rights</li>\n\t\t<li>members of the Standing Senate Committee on Legal and Constitutional Affairs</li>\n\t</ul>\n\t</li>\n\t<li>As set out in the arrangement between the Government of Canada and the Government of Quebec, the federal Minister of Justice and the Premier of Quebec each provided their recommendations on the shortlist to the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/07/10/honourable-nicholas-kasirer\">The Honourable Nicholas Kasirer</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.fja.gc.ca/scc-csc/2019/nominee-candidat-eng.html\">Candidate questionnaire filled out by Nicholas Kasirer</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/04/18/prime-minister-opens-process-select-next-justice-supreme-court-canada\">Prime Minister opens process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/15/prime-minister-announces-advisory-board-select-next-supreme-court-justice\">Prime Minister announces advisory board to select the next Supreme Court justice</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2019/index-eng.html\">Supreme Court of Canada appointments</a></li>\n\t<li><a href=\"https://www.fja.gc.ca/scc-csc/2019/questions-eng.html\">Frequently Asked Questions</a></li>\n\t<li><a href=\"https://fja-cmf.gc.ca/scc-csc/2019/qualifications-eng.html\">Qualifications and assessment criteria</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/15/arrangement-concerning-appointment-process-fill-seat-will-be-left-vacant-supreme\">Arrangement concerning the appointment process to fill the seat that will be left vacant on the Supreme Court of Canada following the departure of Justice Clément Gascon</a> (Memorandum of Understanding)</li>\n</ul></div>\n      "
}