{
  "path": "/en/news/news-releases/2020/10/30/prime-minister-announces-new-supports-indigenous-peoples-and",
  "pageTitle": "Prime Minister announces new supports for Indigenous peoples and communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The health, safety, and well-being of First Nations, Inuit, and Métis peoples is a priority during the global COVID-19 pandemic. The Government of Canada will continue to support Indigenous peoples and communities during this time to help contain the spread of the virus and keep people safe.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced over $200 million in new funding to provide support to Indigenous peoples and communities. The funding includes:</p>\n\n<ul>\n\t<li>$120.7 million to help Indigenous early learning and child care facilities safely operate during the pandemic. The investment is expected to support over 35,000 First Nations, Inuit, and Métis Nation children who access culturally relevant Indigenous early learning and child care programs. This funding will be co-managed through existing early learning and child care partnerships. It will assist Indigenous communities in addressing their most critical needs, including implementing enhanced cleaning protocols, hiring additional staff, and offering training.</li>\n\t<li>$59 million for First Nations to adapt their on reserve community infrastructure. First Nations can use the funds to implement public health and safety measures in community buildings by adding hand washing stations, buying hand sanitizers, personal protective equipment for staff, and cleaning supplies, installing signage and barriers to promote physical distancing, and doing safety checks and upgrades to existing ventilation systems.</li>\n\t<li>$25.9 million to provide immediate support to Indigenous post-secondary institutions in 2020-21. The investment will help these institutions address increased costs and financial uncertainty resulting from the pandemic, including putting in place supports to retain staff, automating services to process student applications and registrations, adapting courses for online learning, and implementing public health and safety measures for in-person services.</li>\n</ul>\n\n<p>The Government of Canada continues to take a distinctions-based approach to address the needs of Indigenous peoples and communities. Today’s investment builds on the work already being done through the Indigenous Community Support Fund, as well as additional funding provided for communities and organizations working with Indigenous peoples living in urban areas and off-reserve.</p>\n\n<p>We will continue to work with Indigenous peoples and communities to help them prevent the spread of COVID-19, keep people safe, and address the ongoing impacts of the pandemic.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Indigenous peoples and communities continue to face unique challenges during the pandemic. We will continue to listen to them, and ensure that students, children, parents, and communities have the support they need to keep safe and healthy and properly respond to this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This pandemic has been particularly hard on children and youth of all ages. We must ensure that they get the necessary support to be able to learn and thrive in a safe environment. This is why we are announcing new funding for communities and organizations, from early learning and child care to post-secondary, as they work to adjust to a new reality in light of COVID-19. We will continue to work with Indigenous partners to promote the health and safety of First Nations, Inuit and Métis throughout the country, and will continue to do so throughout and beyond the pandemic.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“Ensuring First Nations, Inuit and Métis Nation families have access to safe, high-quality and culturally relevant early learning and child care programs is essential to the recovery of Indigenous communities from COVID-19. Today’s announcement will support First Nations, Inuit and the Métis Nation in addressing the child care needs of their communities and giving their children a solid foundation for future success.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>First Nations community infrastructure includes daycare centres, band offices and community buildings, fire halls, women’s shelters, Aboriginal Head Start on Reserve sites, treatment centres, long-term care facilities, and National Native Alcohol and Drug Abuse Program treatment centres.</li>\n\t<li>On August 26, 2020, the Government of Canada announced $112 million in funding for First Nations to support community measures for a safe return for elementary and secondary schools on reserve.</li>\n\t<li>On April 22, 2020, the Government of Canada announced $75.2 million in support for Indigenous post-secondary students in 2020-21.</li>\n\t<li>On March 18, 2020, the Government of Canada announced a new distinctions-based Indigenous Community Support Fund to address immediate needs in First Nations, Inuit, and Métis communities. This fund provides Indigenous leadership with the flexibility needed to design and implement community-based solutions to respond to the spread of COVID-19 within their communities. To date, a total of $685 million in investments has been made through the Fund.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1581964230816/1581964277298\">Coronavirus (COVID-19) and Indigenous communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/29/prime-minister-announces-additional-funding-health-economic-and\">Prime Minister announces additional funding for health, economic, and social support for Indigenous peoples and communities</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1585189335380/1585189357198\">Indigenous Community Support Fund</a></li>\n</ul></div>\n      "
}