{
  "path": "/en/news/news-releases/2016/10/04/prime-minister-canada-announces-agreement-strengthened-canada-pension",
  "pageTitle": "Prime Minister of Canada announces agreement on strengthened Canada Pension Plan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to helping ensure that, after a lifetime of hard work, Canadians have a secure and dignified retirement. This security starts with a strong and stable pension plan.</p><p>The Prime Minister, Justin Trudeau, is proud to announce today that the Government has reached a milestone in improving retirement outcomes for hardworking Canadians, one that will enable them to retire with more money in their pockets.</p><p>Following confirmation today from British Columbia, all nine participating provinces have now agreed to move forward with strengthening the Canada Pension Plan (CPP). The Government of Canada is advancing legislation to enact the CPP enhancement, which will be introduced in Parliament shortly.</p><p>This strengthened CPP will mean greater income security for future retirees. The changes to the CPP will be phased in gradually over seven years, from 2019 to 2025.</p><h2>Quotes</h2><blockquote><p>“We promised that we would provide hardworking Canadians across the country with a more secure and dignified retirement. Today we kept that promise. This stronger and more stable pension program will help middle class Canadians enjoy their retirement years as they should – enjoying their health and families – instead of worrying about making ends meet.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“This is yet another example of how much we can accomplish for our citizens when there is close collaboration between provinces, territories and the federal government on common goals.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><strong><br></strong>Quick Facts</h2><ul><li>The CPP is a portable, low-cost and modest pension that pools risk among contributors and pays a predictable and lifetime benefit to Canadians when they retire. Once fully in place, an enhanced CPP will put up to 50% more into the pockets of future retirees.</li><li>It applies to all Canadians, except workers in Quebec, who contribute to the Quebec Pension Plan, which provides similar benefits to the current CPP.</li><li>The new CPP will increase the share of eligible annual earnings received during retirement from one-quarter to one-third. It will also increase by 14 per cent the maximum income range covered by the CPP.</li><li>To ensure that Canadians and the businesses they work for can adjust to these changes, the CPP enhancement will be introduced through a 7-year gradual phase-in starting on January 1, 2019. &nbsp;</li><li>To offset the impact of increased contributions on eligible low-income workers, the Government of Canada will enhance the Working Income Tax Benefit.</li><li>In addition, employee contributions to the enhanced portion of the CPP will be tax deductible in order to avoid increasing the after-tax cost of saving for Canadians.</li></ul><h2><strong><br></strong>Associated Links</h2><ul><li><a href=\"http://www.fin.gc.ca/n16/data/16-081_1-eng.asp\">Background on Agreement in Principle on Canada Pension Plan Enhancement</a></li><li><a href=\"http://www.fin.gc.ca/n16/16-081-eng.asp\">Canada’s Finance Ministers Agree to Strengthen Canada Pension Plan</a></li></ul></div>\n      "
}