{
  "path": "/en/news/statements/2021/09/30/gaa-ikidod-ogimaa-iwe-e-izhi-giizhigak-ji-mikwenjigaadeg-debwewin-gaye",
  "pageTitle": "Gaa-ikidod Ogimaa iwe E-izhi-giizhigak ji-mikwenjigaadeg Debwewin gaye Maamiinochigewin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gaanada Ogimaa Justin Trudeau owe gaa-giizhigak ikido owe E-izhi-giizhigak ji-mikwenjigaadeg Debwewin gaye Maamiinochigewin:</p>\n\n<p>“Noongom gaa-giizhigak ninandomaag gakina awiyag ji-nisidawinamowaad gaye ji-mikwendamowaad <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">Gaa-izhi-giizhigak Debwewin gaye Maamiinochigewin</a>. Naanaagadawendamog gaa-izhi-gagwaadagendamowaad gikino’amawaaganag gaye odinawemaaganiwaa’ gikino’amaadiiwigamigong onji, noongom giiyaabi. Gaye gi-daa-mikwenimaanaanig gakina abinoojiiyag wiikaa gaa-gii-bigiiwesigwaa endaawaad, gi-daa-gikendaamin giiyaabi, ji-onji-maamiinochigeying noongom gaye ji-anokaadamang owe niigaan ani-akiiwang.</p>\n\n<p>“E-izhi-giizhigak ji-mikwenjigaadeg Debwewin gaye Maamiinochigewin gi-nisidawinaamin 150,000 anishinaabensag endaawaad gii-onji-odaapinaawag ji-izhinizhawindwaa gikino’amaadiiwigamigong. Gikino’amaadiiwigamigong gii-izhiwinaawag e-gii-nishiwanaaji’indwaa, e-gii-gashkitoosigwaa ji-anishinaabemowaad gaye ji-anishinaabewaadiziwaad. Owe gaa-giizhigak gigishkigaadewan babigiwayaanan gaa-misko-ozaawaagin ji-mikwenimang Phyllis Webstad gaye anishinaabeg e-mikwenimaawaad gakina gaa-gii-izhaanid gete-gikino’amaadiiwigamigong gaye ji-maajii-maamiinochigeng omaa akiing. E-izhi-giizhigak ji-mikwenjigaadeg Debwewin gaye Maamiinochigewin gii-inaakonigem noongom gaa-ziigwang amii dash iwe Debwewin gaye Maamiinochigewin gaa-onji-izhichigeng, 80 gaa-izhibii’igaadeg Ge-izhichigeng. Nin-gii-andomigoo ji-dagwiiyaan anami’aawining ji-mikwenimindwaa gete-gikino-amawaaganag gaye igi gaa-gii-bigiiwesigwaa endaawaad, gaye iwe Bangan Gaa-badakideg Izhichigan gaye godak waakaa’iganan jiigi Ogimaawining, misko-ozaawaanzhegin gaye oshki-gakiiwe’on Gete-gikino’amawaaganag e-mikweni-mindwaa imaa Debwewin gaye Maamiinochigewin Waakaa’iganing onji.</p>\n\n<p>“Owe gikinoonowin, niibiwa gii-mikigaadewan gaa-gii-izhi-ningo’indwaa gete-gikino’amawaaganag abinoojiiyag, amii dash ezhi-ganwiikeying gaa-gii-izhi-maanzhichigemagak gii-gagwe-badagonindwaa anishinaabeg omaa, mii gaa-gii-izhiseg mii dash iwe ge-gagwe-maamiinochigaadeg omaa Gaanada Akiing. Noongom ginisidawinaamin gaa-gii-maanzhidoodawindwaa anishinaabeg gaawiin eta mewinzha, – noongom igo giiyaabi – ini gete-gikino’amaadiiwigamigoon gaa-gii-izhichigemagakin, giiyaabi bakaan gii-doodawindwaa anishinaabeg noongom gii-bimaadiziwaad omaa. Gikendaamodaa gaa-gii-bi-maanzhidoodaagemagakin gikino-amaadiiwigamigoon. Amii eta gikendamang gaa-gii-maanzhichigemagakin, maamiinochigeying dash mii ge-izhi-maajii-minoseg bimaadiziwin.</p>\n\n<p>“Apane 2015 gii-izhiseg, Gaanada Ogimaawiwining nin-gii-maajii-wiidanokiimaa-naanig Anishinaabeg ji-gagwe-minochigaadeg obimaadiziwiniwaa gaa-izhi-maanzhisewaad noongom, niibiwa dash aazha minose. Awashime 80 endaso-ngodwaak iwe Debwewin gaye Maamiinochigewin Gaa-andawenjigaadeg ji-izhisegg Gaanada Aki Ogimaawiwin ogiizhitoonaawaa gemaa omaajii-anokaadaanaawaa. Owe minik 117 nin-giizhitoomin ji-onizhishing nibi ishkoniganing gaye ni-maajitaamin ji-giizhitoowaang gakina ani-akiiwang. Nin-gii-inaakonigemin <em>Miziwekamig Anishinaabe Gashki’ewiziwin Inaakonigewin</em> ji-ayaamagak gaye nindasaanaan zhooniyaa anisinaabemowining gaye gikino’amaadiiwining babenak ji-izhi-ayaagin gikino’amaadiiwigamigoon. Gaye nindizhichigemin ji-gagwe-maamiinochigaadeg gaa-dazhinjigaadegin imaa Nanaando-gikenjigaadeg Gii-wanisewaad Anishinaabekweg gaye Ikwezensag Wiindamaage-mazina’iganing gaye Endawenjigaadeg Ji-izhichigeng, gaye ni-wiiji’iwemin ji-inaakonigaadeg ji-wiijidaamaawaad oniigi’igowaa’ abinoojiiyag gaawiin ji-odaapindwaa. Nin-ga-wiiji’aanaanig anishinaabeg gaa-daawaad odazhiikewiniwaang ji-mino-bimaadiziwaad gaa-ikidoomagak Budget 2021 mazina’iganing.</p>\n\n<p>“Omaa dash Gaanada Aki Ogimaawining nindoonji-giigid, e-inagwaa gakina Gaanada Akiing gaa-dibendaagoziwaad ji-gagwe-gikendamowaad aaniin gaa-gii-izhisewaad gete-gikino’amawaaganag gaye odinawemaaganiwaa’ gaye aaniin ge-gii-izhi-wiijitwaaying owe maamiinochigewin. Nindinaag gakina awiyag ji-gigishkamowaad babigiwayaan gaa-misko-ozaawaag ji-mikwenimindwaa igi endaso-abinoojiiyag.”</p></div>\n      "
}