{
  "path": "/en/news/statements/2021/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p>\n\n<p>“Today, we mark <a href=\"https://earthday.ca/\">Earth Day</a> – a day that has been celebrated by Canadians for 30 years.</p>\n\n<p>“More than ever, this past year has reminded us of the importance of nature. Canadians across the country have turned to the natural beauty around them – spending time at a park, walking around their neighbourhood, discovering a new cycling trail – as a way to help them cope with the impacts of the global COVID-19 pandemic.</p>\n\n<p>“While fighting the pandemic remains our top priority, we must not lose sight of the urgency of the climate crisis. Climate change continues to threaten our health, our way of life, and our planet. We need to take bold action now to protect the environment, build a healthier and cleaner future, and create new jobs and a stronger economy.</p>\n\n<p>“The Government of Canada will continue to lead in the fight against climate change. Since September alone, we have launched $53.6 billion in green recovery and climate action. In December, we released our strengthened climate plan,&nbsp;<em>A Healthy Environment and a Healthy Economy</em>, which includes major investments to help us fight the climate crisis, reach our environmental goals, and create a cleaner and more competitive economy. This plan will make it easier for Canadians to choose zero-emission vehicles and improve the energy efficiency of their homes, and expand clean transportation across the country, including by electrifying public transit systems. It will continue to put a price on pollution and more money back into people’s pockets, while helping Canadian businesses create low-carbon products and cut their emissions. This plan also embraces the power of nature, and it will lead to the planting of two billion trees and the restoration of natural spaces, which will clean the air, protect our land and water, and reduce pollution for generations to come. Through the plan, we will establish a competitive and clean growth economy for all, and achieve net-zero emissions by 2050.</p>\n\n<p>“We know that if you don’t have a serious plan to protect the environment, then you don’t have a serious plan to create jobs, strengthen our economy, and grow the middle class. That’s why just this week, the government announced new funding for the Net Zero Accelerator that will spur Canadian innovation to build net-zero technologies and attract investments in Canadian businesses. We also proposed to reduce the corporate and small business income tax rates by 50 per cent for businesses that manufacture zero-emission technologies.</p>\n\n<p>“Climate change knows no borders, and we cannot tackle it alone. Over the next two days, I will be meeting virtually with President Biden and other leaders from around the world for the Leaders Summit on Climate. The Summit is an important opportunity to discuss the urgent need and economic benefits of stronger climate action.</p>\n\n<p>“As Canadians, we are fortunate to be surrounded by nature. We have the world’s longest coastline as well as beautiful lakes, rivers, and streams. We are home to close to 50 national parks, and tens of thousands of plant and animal species. We have soaring mountains, and vast expanses of breathtaking grasslands, tundra, and forests. Our natural landscapes have shaped our country, and we must protect them for future generations. Let us continue to take decisive and ambitious action to ensure we leave our children and grandchildren with a cleaner, healthier, and more resilient planet.”</p></div>\n      "
}