{
  "path": "/en/news/news-releases/2022/05/11/prime-minister-latvia-krisjanis-karins-visits-canada",
  "pageTitle": "Prime Minister of Latvia Krišjānis Kariņš visits Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the visit of the Prime Minister of Latvia, Krišjānis Kariņš, who is in Canada from May 10 to 12, 2022.</p>\n\n<p>During Prime Minister Kariņš’ visit, the two leaders will meet to discuss further military support to Ukraine as the country continues to oppose Russia’s unjustifiable aggression and fight for Ukrainian sovereignty, territorial integrity, and independence. Ahead of the upcoming NATO Summit in Spain, the leaders will also discuss further strengthening NATO’s deterrence and defence measures along Europe’s eastern flank.</p>\n\n<p>The prime ministers will discuss the strong Canada-Latvia partnership and security issues in the broader Baltic region, ahead of the upcoming Canada-Baltics 3+1 Foreign Ministers Meeting, which Canada will host in June. This will build on the Prime Minister’s successful visit to Latvia earlier this year. During his visit, he met with Canadian troops deployed there as part of Operation REASSURANCE and strengthened the close friendship between Canada and Latvia.</p>\n\n<p>While in Canada, Prime Minister Kariņš will also meet with the Honourable Anthony Rota, Speaker of the House of Commons, and with the Deputy Prime Minister and Minister of Finance, Chrystia Freeland.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Latvia enjoy close ties based on shared values and a mutual commitment to transatlantic security as NATO Allies. I look forward to my meeting with Prime Minister Kariņš, where I will reaffirm Canada’s commitment to our European allies in supporting Ukraine and the Ukrainian people. Together, we will continue to work to defend democracy and human rights as Russia continues its unwarranted and unjustifiable attacks on Ukraine.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau last visited Latvia in March 2022.</li>\n\t<li>Canada and Latvia’s relationship is rooted in shared values of freedom, democracy, and the rule of law. Our ties are strong due in part to the 30,000 Canadians of Latvian heritage.</li>\n\t<li>Canada was the first G7 country to recognize the restoration of Latvia’s independence in 1991, and one of the first countries to ratify Latvia’s accession to NATO in 2004.</li>\n\t<li>Canada currently has 695 Canadian Armed Forces personnel leading NATO’s enhanced Forward Presence Battle Group in Latvia as part of Operation REASSURANCE.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\" title=\"Canada and the North Atlantic Treaty Organization\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/08/prime-minister-concludes-successful-bilateral-visit-latvia\">Prime Minister concludes successful bilateral visit to Latvia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\" title=\"Operation REASSURANCE\">Operation REASSURANCE</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}