{
  "path": "/en/news/statements/2022/05/29/statement-prime-minister-international-day-united-nations-peacekeepers",
  "pageTitle": "Statement by the Prime Minister on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of United Nations Peacekeepers:</p>\n\n<p>“Today, we join the international community to honour all United Nations (UN) peacekeepers who have served – and continue to serve – with courage and dedication in peacekeeping missions around the world. We also remember those who lost their lives, including over 100 Canadians, or were injured while deployed.</p>\n\n<p>“The Government of Canada has a long and proud history of supporting UN peacekeeping. For almost 70 years, more than 125,000 Canadians have served in UN peacekeeping operations, protecting people affected by conflicts by monitoring ceasefires and delivering humanitarian assistance, empowering women and girls, and promoting human rights around the world. They have represented the values our country holds dear: peace, freedom, and compassion.</p>\n\n<p>“Canada continues to be a leader and strong supporter of peacekeeping initiatives. Through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>, we are working alongside partners to increase the number of uniformed women in peace operations, to help achieve transformational change for peace operations. We are also helping to ensure that children remain children at all stages of a conflict through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles</a>, which help protect kids from becoming child soldiers.</p>\n\n<p>“By continuing to support peacekeeping, Canada is helping to build a safer, more peaceful future for all. On behalf of all Canadians, I thank UN peacekeepers for their bravery, sacrifice, and dedication, and for helping make the world a safer place.”</p></div>\n      "
}