{
  "path": "/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-meets-president-argentina-alberto-fernandez",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Argentina Alberto Fernández | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Argentina, Alberto Fernández, on the margins of the Summit of the Americas.</p>\n\n<p>Prime Minister Trudeau and President Fernández exchanged views on their respective efforts to promote inclusive economic growth, democratic resilience, and gender equality, both at home and across the hemisphere. Prime Minister Trudeau recognized Argentina’s commitment to climate action, and the two leaders agreed on the importance of working together with like-minded partners to achieve shared climate goals and a greener future.</p>\n\n<p>Prime Minister Trudeau and President Fernández discussed their shared concern over Russian aggression in Ukraine and its serious impacts, notably on energy and food security, in the Americas and around the world. Prime Minister Trudeau reiterated his appreciation for Argentina’s leadership as President of the United Nations Human Rights Council.</p>\n\n<p>The leaders also agreed on the need to bring stability back to Venezuela. Prime Minister Trudeau commended President Fernández’s efforts in welcoming Venezuelan refugees.</p>\n\n<p>Prime Minister Trudeau and President Fernández looked forward to meeting again soon to continue and strengthen their close cooperation, bilaterally, in the region, and globally.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/argentina-argentine/relations.aspx?lang=eng\">Canada-Argentina relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/07/prime-minister-justin-trudeau-speaks-president-argentina-alberto-fernandez\">Prime Minister Justin Trudeau speaks with President of Argentina Alberto Fernández</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}