{
  "path": "/en/news/news-releases/2022/03/03/new-canada-digital-adoption-program-help-small-businesses-thrive",
  "pageTitle": "New Canada Digital Adoption Program to help small businesses thrive in the digital economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Small businesses are the backbone of the Canadian economy and the heart of our communities across the country. As small businesses adapt to the digital economy and the lasting impacts of the COVID-19 pandemic, the Government of Canada is working to help them continue to grow, thrive, and create good jobs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the launch of the <a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/home\">Canada Digital Adoption Program</a> (CDAP), to help Canadian small- and medium-sized businesses grow their online presence and upgrade or adopt digital technologies. This investment, which will provide $4&nbsp;billion over four years, will support up to 160,000 small businesses and create good middle-class jobs across the country, including thousands of jobs for young Canadians.</p>\n\n<p>Under the CDAP, Canadian small- and medium-sized enterprises (SMEs) will be able to assess their digital readiness and apply for grants and loans online. This funding will help them leverage e-commerce opportunities, upgrade or adopt digital technologies, and digitize their operations to stay competitive and meet their customers’ needs in the digital marketplace. Depending on their size, specific needs, and goals, businesses can apply for funding through the <a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/00011.html \">Grow Your Business Online</a> or <a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/00013.html\">Boost your Business Technology</a><em> </em>streams.</p>\n\n<p>Accelerating the digital transformation will help Canadian businesses stay competitive while creating jobs and growing the economy, as we recover from the pandemic.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Small businesses have shown incredible resilience over the last two years as they faced unprecedented challenges from the pandemic. Supporting them has been – and will continue to be – a top priority for our government. That’s why we’re launching the Canada Digital Adoption Program to empower small businesses with the digital tools they need, while helping them create good jobs, particularly for young Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is committed to ensuring that all Canadian businesses benefit from the digital economy – from main street retail shops to entrepreneurs to manufacturers. The Canada Digital Adoption Program will support as many as 160,000 small- and medium- sized businesses to adopt new technologies while creating thousands of jobs for young Canadians. I encourage small business and owners and entrepreneurs to apply for the CDAP and leverage technology to grow their business and access new customers around the world.”</p>\n\n<footer class=\"default\">The Hon. Mary Ng, Minister of International Trade, Export Promotion, Small Business and Economic Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s small- and medium-sized businesses need&nbsp;more tools,&nbsp;more resources, and more financing to go digital. This is what our clients shared with us and the reason why BDC is so pleased to be part of&nbsp;the Canada Digital Adoption Program and offer advice and&nbsp;zero per cent interest&nbsp;loans to entrepreneurs, helping them meet their clients’ evolving needs. This is an investment in Canada’s future competitiveness and growth.”</p>\n\n<footer class=\"default\">Isabelle Hudon, President and CEO, Business Development Bank of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Announced in Budget 2021, the CDAP is expected to support as many as 160,000 small businesses and help create thousands of jobs, including nearly 30,000 job placements for young Canadians to gain valuable work experience, while helping businesses succeed.</li>\n\t<li>Funding under the CDAP consists of $1.4&nbsp;billion in grants and advisory services to SMEs and up to $2.6&nbsp;billion in loans from the Business Development Bank of Canada (BDC) to help SMEs cover the cost of implementing digital transformation plans.\n\t<ul>\n\t\t<li>Grow Your Business Online funding provides micro grants of up to $2,400 and youth e-commerce advisors’ support to help small businesses implement digital storefronts and e-commerce capabilities.</li>\n\t\t<li>Boost Your Business Technology funding provides grants covering 90 per cent of costs up to $15,000 to access advisory services to develop a digital adoption plan, access to zero per cent interest loans from the BDC, as well as opportunities for student placements.</li>\n\t</ul>\n\t</li>\n\t<li>SMEs interested in applying for a grant or loan under the CDAP can answer a <a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/00012.html\">few quick questions</a> online to help determine the funding that is best suited to meet their needs.</li>\n\t<li>Retail e-commerce has rapidly increased during the pandemic. According to <a href=\"https://www150.statcan.gc.ca/n1/pub/45-28-0001/2020001/article/00064-eng.htm\">Statistics Canada data</a>, year-over-year retail e-commerce increased by more than 110 per cent in May 2020 compared to May 2019.</li>\n</ul>\n\n<h2>Related&nbsp;Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/03/backgrounder--the-canada-digital-adoption-program.html\">Backgrounder - The Canada Digital Adoption Program</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/152.nsf/eng/home\">Canada Digital Adoption Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-support-for-small-business.html\">Budget 2021 Support for Small Business</a></li>\n</ul></div>\n      "
}