{
  "path": "/en/news/statements/2021/03/28/statement-prime-minister-holi",
  "pageTitle": "Statement by the Prime Minister on Holi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement on the occasion of Holi:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Today, Hindu communities in Canada and around the world will celebrate Holi.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Also known as the Festival of Colours, Holi marks the end of winter and the beginning of spring. It is a time to celebrate new beginnings, renew and strengthen relationships, and look forward to the year ahead with optimism and joy.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On this happy occasion, families and friends gather to look towards the new season. They will eat delicacies, sing, dance, and celebrate in colour-filled festivities. This year, as we continue to fight the global COVID-19 pandemic and follow public health guidelines to keep each other and our communities safe, people will find alternative ways to mark this special day.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Holi is one of the most celebrated festivals in South Asian communities around the world. Here in Canada, these celebrations demonstrate our diversity, and remind us that inclusion builds a stronger and more vibrant country. This joyous festival is also an opportunity to recognize the tremendous contributions that Canadians of the Hindu faith have made – and continue to make – to our country. Since the start of the pandemic, they have contributed to the collective effort in many ways, including by helping neighbours, supporting seniors, and following public health guidelines to protect everyone’s health.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On behalf of our family, Sophie and I wish all those celebrating, here in Canada and around the world, a fun, joyous, and happy Holi.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span><span>“Holi Hai!”</span></span></span></span></span></p></div>\n      "
}