{
  "path": "/en/news/statements/2017/05/01/statement-prime-minister-canada-mental-health-week",
  "pageTitle": "Statement by the Prime Minister of Canada on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This week, I encourage all Canadians to <a href=\"http://mentalhealthweek.ca/\">#GetLoud</a> to raise awareness about mental health, an important, but sometimes invisible, aspect of our general health.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year’s campaign, led by the <a href=\"http://www.cmha.ca/\">Canadian Mental Health Association</a>, asks us to speak up to make sure Canadians get the mental health care they need, when they need it. Mental health is a core part of our well-being, but too often long wait times or limited services stop Canadians from getting the mental health care they need.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“That is why the Government of Canada will <a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-03-en.html\">provide $5 billion over the next 10 years</a> to provinces and territories to support mental health initiatives. These investments will help improve access to evidence-based interventions and mental health services and care for people across the country. With a particular focus on youth and young adults, this will help as many as 500,000 young Canadians.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“We also know that providing greater access to care and support is just half of the equation. Having access to safe, adequate and affordable housing, and being able to find and keep a good paying job are also part of what makes a difference in people’s health. That is why the Government of Canada is making major investments in both housing and employment initiatives. As part of the new $5 billion National Housing Fund, persons with mental health and addiction issues will receive greater support.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Government of Canada remains committed to help communities address their unique mental health challenges. To build on Indigenous-led initiatives like the <a href=\"http://www.hc-sc.gc.ca/fniah-spnia/pubs/promotion/_mental/2014-sum-rpt-continuum/index-eng.php\">First Nations Mental Wellness Continuum Framework</a> and the <a href=\"http://news.gc.ca/web/article-en.do?nid=1105079\">National Inuit Suicide Prevention Strategy</a>, Budget 2017 pledges over $200 million over the next five years to increase support for mental health services for First Nations and Inuit. This includes making available, for the first time, the services of traditional healers as part of the Non-Insured Health Benefits Program administered by Health Canada.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The struggles of mental illness have affected so many of us, including my own family. For everyone who has struggled with a mental illness: thank you for sharing your stories, and for showing that being open is a strength. You are not alone. Today, I join Canadians to celebrate your resilience, and to get loud about the need for timely access to mental health services and support. Together, we can make sure all Canadians have the care and support they need to live full and healthy lives.”</span></p><p><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Associated Links</span></b></p><ul><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"https://www.canada.ca/en/public-health/topics/mental-health-services.html\">Mental Health Services</a> </span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"https://www.canada.ca/en/public-health/topics/mental-health-wellness.html\">Mental Health and Wellness</a> </span></li></ul></div>\n      "
}