{
  "path": "/en/news/readouts/2020/06/29/prime-minister-justin-trudeau-speaks-president-european-council-charles",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Council Charles Michel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Council, Charles Michel.</p>\n\n<p>Prime Minister Trudeau and President Michel discussed the COVID-19 pandemic. They agreed on the importance of international cooperation to respond effectively to its health, social, and economic impacts, to advance solutions for a sustainable recovery, and to ensure no country is left behind.</p>\n\n<p>The two leaders spoke about the deep trade ties between Canada and the European Union, and the opportunities that the Canada-European Union Comprehensive Economic and Trade Agreement creates for businesses and workers on both sides of the Atlantic.</p>\n\n<p>The Prime Minister and the President also exchanged views on a range of international issues, including Hong Kong and the situation in Venezuela where both leaders underlined their respective efforts to address the humanitarian crisis.&nbsp; Prime Minister Trudeau thanked President Michel for the European Union’s efforts in raising concerns about two Canadians arbitrarily detained in China.</p>\n\n<p>Prime Minister Trudeau and President Michel looked forward to continuing the close cooperation between Canada and the European Union to promote common priorities in the context of the UN, G7 and other international fora.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canada-announces-support-for-equitable-access-to-new-covid-19-medical-solutions.html\">Canada announces support for equitable access to new COVID-19 medical solutions</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}