{
  "path": "/en/news/statements/2020/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p>\n\n<p>“Today, on this <a href=\"https://www.un.org/en/observances/ending-violence-against-women-day\">International Day for the Elimination of Violence against Women</a>, we remain committed to ending gender-based violence and to building a future in which everyone has a real and fair chance at success. We thank the survivors, women’s rights advocates, and community organizations for their exceptional courage. We would also like to thank frontline workers who, during the COVID-19 global pandemic, have ensured that victims and survivors of violence continue to receive the support and services that they need.</p>\n\n<p>“Although violence has an impact on all Canadians, some people are at a greater risk of experiencing gender-based violence, including women and girls, two-spirit and LGBTQ people, Indigenous women and girls, racialized women, and women with disabilities.</p>\n\n<p>“In recent months, the COVID-19 global pandemic has further revealed the inequalities and injustices that the most vulnerable face. This year, the government granted <a href=\"https://www.canada.ca/en/status-women/news/2020/10/government-of-canada-accelerates-investments-in-shelters-transition-housing-and-other-organizations-providing-gender-based-violence-supports-and-se0.html\">$100&nbsp;million in emergency funding</a> to organizations that provide support and services to people experiencing and escaping gender-based violence across Canada. This investment has allowed nearly 1,000&nbsp;organizations across the country to receive much-needed funding to keep their doors open to those facing hardship. This funding also provides assistance for emergency shelters on reserve and in the Yukon, to support First Nations women and children.</p>\n\n<p>“The safety of women and girls must be the foundation on which all progress is built. The Government of Canada developed the <a href=\"https://cfc-swc.gc.ca/violence/strategy-strategie/index-en.html\">Gender-Based Violence Strategy</a> in 2017 and the <a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-ntnl-strtgy-hmnn-trffc/index-en.aspx\">National Strategy to Combat Human Trafficking</a> in 2019. The government also committed to moving forward with a National Action Plan on Gender-Based Violence. This is in addition to addressing the Calls for Justice in the report from the National Inquiry into Missing and Murdered Indigenous Women and Girls, and implementing the Calls to Action from the Truth and Reconciliation Commission. The government is working with Indigenous partners and the provinces and territories to develop a national action plan to address violence against Indigenous women, girls, and two-spirit and LGBTQ people.</p>\n\n<p>“The Government of Canada will continue to address violence against women, both at home and abroad. We are also working to increase the meaningful participation of women in peace operations and conflict prevention. It is at the core of our <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>, and our second <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/cnap_wps-pnac_fps.aspx?lang=eng\">National Action Plan on Women, Peace and Security</a>. Among other things, the government’s support is helping educate women and girls around the world about their rights to improve their access to justice and providing psychological support to victims of violence. Canada is also taking measures to end early and forced child marriages to help girls make their own life choices.</p>\n\n<p>“Today, as we mark the first day of the international <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism against Gender-Based Violence</a> campaign, I invite all Canadians to use the hashtag #16Days on social media to encourage everyone to think about concrete steps that we can take to denounce gender-based violence and protect human rights.”&nbsp;</p></div>\n      "
}