{
  "path": "/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-quebec-premier-francois-legault",
  "pageTitle": "Prime Minister Justin Trudeau meets with Quebec Premier François Legault | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with Quebec Premier François Legault today on the occasion of the 18th&nbsp;Summit of La&nbsp;Francophonie being held in Djerba, Tunisia, in order to discuss shared priorities.</p>\n\n<p>The Prime Minister and the Premier discussed promoting and defending the French language in Quebec and across Canada. They agreed on the importance of working together to ensure more French-language digital content. They discussed inflation, a global issue that is affecting all Quebecers and Canadians. They agreed to continue working together to make life for affordable for Quebecers and all Canadians. They also talked about immigration and health, and agreed to continue working together so that Quebecers and all Canadians have a health care system that meets their needs.</p>\n\n<p>Prime Minister Trudeau and Premier Legault agreed to continue working together on these and other shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la&nbsp;Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.francophoniedjerba2022.tn/fr\">Official website of the 18th Francophonie Summit in Djerba</a> (in French only)</li>\n\t<li><a href=\"/en/news/statements/2022/10/03/statement-prime-minister-results-provincial-election-quebec\">Statement by the Prime Minister on the results of the provincial election in Quebec</a></li>\n</ul></div>\n      "
}