{
  "path": "/en/news/news-releases/2016/03/18/prime-minister-announces-intention-recommend-appointment-seven-new",
  "pageTitle": "Prime Minister announces intention to recommend the appointment of seven new Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will recommend the appointment of seven new Senators to the Governor General. The new, independent Senators will fill two vacancies in Manitoba, three in Ontario, and two in Quebec.</p>\n<p>The following are the individuals who will be recommended for appointment to the Senate:</p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Raymonde_Gagné\"><strong>Raymonde Gagné (Manitoba)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Murray_Sinclair\"><strong>Justice Murray Sinclair (Manitoba)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Peter_Harder\"><strong>V. Peter Harder (Ontario)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Frances_Lankin\"><strong>Frances Lankin (Ontario)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Ratna_Omidvar\"><strong>Ratna Omidvar (Ontario)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#Chantal_Petitclerc\"><strong>Chantal Petitclerc (Quebec)</strong></a></li>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes#André_Pratte\"><strong>André Pratte (Quebec)</strong></a></li>\n</ul>\n<p><strong>Biographical notes hyperlinked above.</strong></p>\n<p>Over the last three months, the Independent Advisory Board for Senate Appointments undertook broad consultations in Manitoba, Ontario, and Quebec – and provided the Prime Minister with a number of non-binding recommendations. From that pool of candidates, the Prime Minister selected the seven new Senators he will recommend to the Governor General.</p>\n<p>The Prime Minister also announced today that he intends to appoint V. Peter Harder as Government Representative in the Senate. Mr. Harder will act as the Government’s Representative in the Senate in order to facilitate the introduction and consideration of Government legislation, and would be sworn in as a Privy Councillor.</p>\n<p>The new independent Senators will be expected to make a significant contribution to the work of the Senate, and to contribute to the ultimate goal that ensures a high standard of integrity, collaboration, and non-partisanship.</p>\n<p><strong>Quotes</strong></p>\n<p>“The Government is today taking further concrete steps to follow through on its commitment to reform the Senate, restore public trust, and bring an end to partisanship in the appointments process.”<br>–&nbsp;Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n<p>“The Senate appointments I have announced today will help advance the important objective to transform the Senate into a less partisan and more independent institution that can perform its fundamental roles in the legislative process more effectively–including the representation of regional and minority interests–by removing the element of partisanship, and ensuring that the interests of Canadians are placed before political allegiances.”<br>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Taking today’s announcements into account, there are 17 vacancies in the Senate. Up until today’s announcements, Manitoba, Ontario and Quebec have had the largest number of vacancies.</li>\n<li>Under the Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li>\n<li>The Advisory Board, which recommended these individuals to the Prime Minister, is an independent and non-partisan body whose mandate is to provide the Prime Minister with merit-based recommendations on Senate nominations. The Prime Minister thanked the Advisory Board for all of its extensive and diligent work to consult widely, assess, and recommend these eminent individuals for appointment to the Senate.</li>\n</ul>\n<p><strong><br>Related Product</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/03/18/biographical-notes\">Biographical notes</a></li>\n</ul>\n<p><strong><br>Associated Link</strong></p>\n<ul>\n<li>For further information on the new Senate appointments process and the Advisory Board, please refer to the news releases and related background materials released on January 19, 2016 and December 3, 2015 and available at <a href=\"http://www.democraticinstitutions.gc.ca/\">http://www.democraticinstitutions.gc.ca/</a></li>\n</ul></div>\n      "
}