{
  "path": "/en/news/news-releases/2016/11/07/prime-minister-canada-announces-national-oceans-protection-plan",
  "pageTitle": "The Prime Minister of Canada announces the National Oceans Protection Plan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Whether facing the Atlantic, Pacific or Arctic oceans, the health and protection of our coasts are critical to our environment, our economy, and to all Canadians. Today, Canada is announcing a marine safety plan that meets – or exceeds – international standards and is supported by commitments to Indigenous co-management, environmental protections, and science-based standards. &nbsp;</p><p>Canada has the longest coastline in the world. Our coasts support traditional Indigenous and coastal community livelihoods, enable the export and import of our goods overseas, are home to abundant Canadian fisheries, attract tourism, and play a key role in strengthening the economy and growing our middle class.</p><p>It is therefore vital for Canada to have a plan to ensure that our coasts are protected in a modern and advanced way that ensures environmental sustainability, safe and responsible commercial use, and collaboration with coastal and Indigenous communities.</p><p>In order to meet these objectives, the Prime Minister today announced a $1.5 billion national Oceans Protection Plan.</p><p>The Oceans Protection Plan has four main priority areas:</p><ul><li>creating a world-leading marine safety system that improves responsible shipping and protects Canada’s waters, including new preventive and response measures;</li><li>restoring and protecting the marine ecosystems and habitats, using new tools and research, as well as taking measures to address abandoned boats and wrecks;</li><li>strengthening partnerships and launching co-management practices with Indigenous communities, including building local emergency response capacity; and,</li><li>investing in oil spill cleanup research and methods to ensure that decisions taken in emergencies are evidence based.</li></ul><p>The Oceans Protection Plan was developed based on work done over the past two years between Indigenous and coastal communities and various government programs, and will be implemented next year.</p><h2>Quotes</h2><blockquote><p>“Canada’s economy, environment and history are inextricably linked to our coastal regions. The $1.5 billion Oceans Protection Plan unveiled today will make Canada a world-leader in marine safety and takes a powerful step toward co-management of our coasts with Indigenous and coastal communities, together making sure they remain healthy, clean, and safe for generations to come.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“As a government, everything we do, and every action we take, is done with one goal in mind: we want to leave our kids and grandkids with a better place to live – whether we’re creating good, well-paying jobs for the middle class; ensuring our communities are safe and protected; or taking the necessary action to safeguard our environment.&nbsp;And by working together with our partners along the coasts and across the country, I know we can preserve our coastlines for generations to come.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>A significant volume of Canada’s commodities and processed goods are exported via marine transportation.</li><li>Marine trade employs approximately 250,000 Canadians and injects more than $25 billion to Canada’s economy.</li><li>The Oceans Protection Plan will include over $1.5 billion in funding over five years, starting in 2017-18.</li><li>As soon as 2017, Canadians will begin to see concrete improvements, such as a Maritime Rescue Sub-Centre in St. John’s and legislation introduced to prohibit vessel abandonment in Canadian waterways.</li><li>As part of the new marine safety system, improved marine traffic and navigation information – including hydrography and charting – will be provided to mariners, Indigenous peoples, and coastal communities.</li><li>Enhanced resources will be provided to the Canadian Coast Guard, including new rescue stations, new towing capacity, and new communications equipment.</li><li>New research into the impacts of increased shipping on marine ecosystems will be funded.</li><li>New oil spill response methods will also be funded.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-ocean-protection-plan-world-leading-marine-safety-system\">World-leading marine safety system</a></li><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-oceans-protection-plan-preserving-and-restoring-canada’s\">Preserving and restoring the marine ecosystem</a></li><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-oceans-protection-plan-creating-stronger-indigenous\">Partnerships with Indigenous communities and stronger evidence base</a></li><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-oceans-protection-plan-what-it-means-canada’s-regions\">Oceans Protection Plan in each region</a></li><li><a href=\"/en/news/speeches/2016/11/07/prime-minister-justin-trudeau-announces-oceans-protection-plan\">Speech: Prime Minister Trudeau announces the Oceans Protection Plan</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.tc.gc.ca/eng/oceans-protection-plan.html\">Oceans Protection Plan</a></li></ul></div>\n      "
}