{
  "path": "/en/news/news-releases/2018/10/03/prime-minister-announces-appointment-three-senators",
  "pageTitle": "Prime Minister announces the appointment of three senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/10/03/patti-laboucane-benson\">Patti LaBoucane-Benson (Alberta)</a></li><li><a href=\"/en/news/backgrounders/2018/10/03/paula-simons\">Paula Simons (Alberta)</a></li><li><a href=\"/en/news/backgrounders/2018/10/03/peter-m-boehm\">Peter Boehm (Ontario)</a></li></ul><p>Dr. LaBoucane-Benson is a proud Métis who has dedicated her life to helping Indigenous families. Her most recent work has focused on increasing Indigenous peoples’ awareness of their legal rights and responsibilities, and improving opportunities for vulnerable youth in Alberta.</p><p>Ms. Simons is an award-winning journalist and author who has told Edmonton’s stories in print, on the radio, on television, and on stage for over 30 years. She has covered a wide variety of topics in her writing, including international trade and mental health, and also co-authored a best-selling history book on Alberta.</p><p>Dr. Boehm has enjoyed an extensive and distinguished career in the foreign service, which culminated with him serving most recently as Deputy Minister for the G7 Summit and Personal Representative of the Prime Minister.</p><p>These individuals were recommended by the Independent Advisory Board for Senate Appointments and chosen using the process open to all Canadians. This process ensures senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“These three new independent senators bring a wealth of experience with them to the Red Chamber. Whether working as a community educator and researcher, a journalist, or an ambassador, all three have gained a deep appreciation and understanding of this country. I have full confidence that they will be excellent representatives for their regions and for all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>There have been 43 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Once appointed by the Governor General and summoned to the Senate, the new senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/10/03/patti-laboucane-benson\">Patti LaBoucane-Benson</a></li><li><a href=\"/en/news/backgrounders/2018/10/03/paula-simons\">Paula Simons</a></li><li><a href=\"/en/news/backgrounders/2018/10/03/peter-m-boehm\">Peter Boehm</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li></ul></div>\n      "
}