{
  "path": "/en/news/readouts/2022/01/18/prime-minister-justin-trudeau-speaks-ministers-situation-ukraine",
  "pageTitle": "Prime Minister Justin Trudeau speaks with ministers on the situation in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Deputy Prime Minister and Minister of Finance Chrystia Freeland, Minister of Foreign Affairs Mélanie Joly, Minister of National Defence Anita Anand, Minister of International Development Harjit S. Sajjan, President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness Bill Blair, Minister of Immigration, Refugees and Citizenship Sean Fraser, and&nbsp;Minister of Public Safety&nbsp;Marco E. L. Mendicino to discuss security concerns in Ukraine. They were joined by Chief of the Defence Staff General Wayne Eyre, Interim Clerk of the Privy Council Janice Charette, and other senior officials.</p>\n\n<p>During the call, the Prime Minister and ministers discussed the latest developments in Ukraine. They condemned Russia’s military buildup in and around the country as well as Russia’s annexation and illegal occupation of Crimea. They underlined the need for Russia to de-escalate the situation and uphold its international commitments, and emphasized Canada’s commitment to continued coordination and engagement between allies and partners.</p>\n\n<p>Minister Joly, who is currently in Ukraine, provided an update on her work with her Ukrainian counterparts in support of the country’s sovereignty and territorial integrity in the face of Russian aggression. She met yesterday in Kyiv with Ukraine’s Prime Minister, Denys Shmyhal, and Deputy Prime Minister for European and Euro-Atlantic Integration, Olga Stefanishyna, and met today with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>Minister Anand highlighted the role of the Canadian Armed Forces (CAF) for military training and capacity building in Ukraine through Operation UNIFIER, which has trained more than 12,500 members of Ukraine’s Security Forces since the mission began in 2015. Approximately 200 CAF personnel are currently deployed to Ukraine under Operation UNIFIER. The minister noted she recently spoke with her Ukrainian counterpart.</p>\n\n<p>Together, the Prime Minister and ministers raised the need to find a peaceful solution through dialogue. They reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine, and considered current and future assistance to Ukraine. Prime Minister Trudeau emphasized that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions.</p>\n\n<p>The Prime Minister and ministers agreed to continue closely monitoring the situation over the coming days and weeks.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/12/g7-foreign-ministers-statement-on-russia-and-ukraine.html\">G7 Foreign Ministers’ Statement on Russia and Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/minister-joly-to-travel-to-ukraine-france-and-belgium.html\">Minister Joly to travel to Ukraine, France and Belgium</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/minister-joly-meets-with-ukrainian-prime-minister-and-deputy-prime-minister.html\">Minister Joly meets with Ukrainian Prime Minister and Deputy Prime Minister</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n</ul></div>\n      "
}