{
  "path": "/en/news/readouts/2023/01/10/prime-minister-justin-trudeau-meets-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of the United States of America, Joe Biden, at the North American Leaders’ Summit in Mexico City, Mexico.</p>\n\n<p>The Prime Minister and the President discussed a wide range of bilateral and global issues.</p>\n\n<p>Prime Minister Trudeau invited President Biden to Canada. The President will visit Canada in March.</p>\n\n<p>The two leaders discussed the critical importance of North American trade, competitiveness, and supply chains, including critical minerals and semiconductors.</p>\n\n<p>Specifically on trade, the Prime Minister reiterated the benefits of the free flow of commerce between Canada and the United States. The Prime Minister raised Buy America, softwood lumber, and steel and aluminum.</p>\n\n<p>The leaders noted progress to fix the NEXUS backlog. The Minister of Public Safety, Marco E. L. Mendicino, will share details later today.</p>\n\n<p>The Prime Minister and the President discussed their shared commitment to the defence of North America, including Canada’s acquisition of F-35 fighter jets for the Royal Canadian Air Force. The leaders discussed Putin’s ongoing illegal invasion of Ukraine. The Prime Minister informed the President that Canada will purchase a U.S.-manufactured National Advanced Surface-to-Air Missile System (NASAMS) for Ukraine.</p>\n\n<p>The leaders also discussed the ongoing crisis in Haiti, and their mutual commitment to work together to&nbsp;support&nbsp;Haitian-led solutions,&nbsp;promote&nbsp;dialogue toward democratic elections, and&nbsp;enhance&nbsp;effective law enforcement capacity. The&nbsp;leaders committed to continuing bilateral and hemispheric support for Haiti and its people.</p>\n\n<p>The Prime Minister and&nbsp;the&nbsp;President discussed their mutual commitment to&nbsp;tackling the climate crisis.</p>\n\n<p>The leaders also discussed China and a coordinated approach to the Indo-Pacific.</p>\n\n<p>Finally, the leaders&nbsp;denounced the Iranian regime’s continued attacks on brave women, students, and the people of Iran. The Prime Minister raised Flight&nbsp;PS752,&nbsp;which was shot down by Iranian missiles, and underscored the importance to keep working to get the victims’ families the justice and accountability they deserve.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/20/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-services-procurement/news/2023/01/canada-finalizes-agreement-to-purchase-new-fighter-jets-for-royal-canadian-air-force.html\">Canada finalizes agreement to purchase new fighter jets for Royal Canadian Air Force</a></li>\n\t<li><a href=\"https://www.canada.ca/en/border-services-agency/news/2023/01/joint-statement-by-canada-and-the-united-states-on-nexus.html\">Joint Statement by Canada and the United States on NEXUS</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2023/01/defence-minister-anita-anand-announces-air-defence-system-donation-to-ukraine.html\">Defence Minister Anita Anand announces air defence system donation to Ukraine</a></li>\n</ul></div>\n      "
}