{
  "path": "/en/news/news-releases/2023/03/24/working-united-states-grow-our-clean-economies-and-create-good-middle",
  "pageTitle": "Working with the United States to grow our clean economies and create good, middle-class jobs on both sides of our border | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, welcomed the President of the United States of America, Joe Biden, to Canada from March 23 to 24 to continue building on our historic partnership and close friendship to make life better for people on both sides of our shared border. The leaders issued a joint statement with commitments to drive significant progress on shared priorities including growing the middle class, making life more affordable for people, and creating good jobs through clean growth and economic integration, taking ambitious climate action and protecting the environment, and defending North America and advancing peace and security around the world.</p>\n\n<p>Canada and the U.S. are each making significant investments to build our clean economies and grow the middle class. To continue making life more affordable and creating good, middle-class jobs, the two leaders agreed to continue discussions to carve-in Canadian goods into Buy America requirements. The Prime Minister announced that Canada is moving forward with a new investment tax credit for clean technology manufacturing and the leaders launched an Energy Transformation Task Force to accelerate our work together over the next year across the spectrum of the clean economy. The leaders agreed to work together to promote trade in clean goods, including clean steel and aluminum, and continue to collaborate on renewable energy and electric vehicle supply chains, the critical minerals value chain, nuclear energy, and aligning zero-emission vehicle (ZEV) infrastructure to create new opportunities for people to thrive and have great careers.</p>\n\n<p>Working together with the U.S., we will advance a cross-border semiconductor manufacturing corridor, beginning with the signing of an arrangement between Canada and IBM to expand domestic research and development and advanced packaging of semiconductors. Semiconductors enable advances in clean energy, communication, computing, and more, and Canada has a vital role to play in the North American semiconductor ecosystem. Canada’s investment of up to $250 million in this sector will also improve North American competitiveness and supply chain resiliency, help cut pollution, foster economic and national security, and create good middle-class jobs.</p>\n\n<p>To address irregular migration, we are expanding the Safe Third Country Agreement to apply not only at designated ports of entry, but across the entire land border, including internal waterways, ensuring fairness and more orderly migration between our two countries. This change will come into effect at 12:01 A.M (EDT) on Saturday, March 25, 2023. Canada also announced we will welcome 15,000 migrants on a humanitarian basis from the Western Hemisphere over the course of the year, with a path to economic opportunities to address forced displacement, as an alternative to irregular migration.</p>\n\n<p>In both Canada and the U.S., we recognize that to continue growing our economies and making sure people have the best opportunities to succeed, we have to take bold, ambitious action to fight climate change and protect more nature. To further protect the Great Lakes, a source of pride for Canadians and Americans alike, Canada is investing an additional, historic $420 million, as part of our renewed joint commitment to preserving and restoring these iconic waters and ensuring the resiliency of the communities and people that depend on them. This Canadian investment builds on our 50 years of collaboration and continues fighting pollution and protecting our waters. Together, the leaders also agreed to renew and accelerate their climate and nature commitments including cutting pollution from their respective electricity grids. They also committed to advancing the conservation and environmental protection of the Arctic, in partnership with Indigenous Peoples, and continuing to work together to deliver clean air.</p>\n\n<p>Canada is also investing in protecting North America through the North American Aerospace Defense Command (NORAD). The Prime Minister announced a $7.3 billion project to upgrade and build new fighter infrastructure to support the arrival of our new fleet of F-35 fighter jets and make sure our troops have the best equipment to defend North America. He also announced that our early warning Arctic Over the Horizon Radar (OTHR) and threat tracking system will be located in Southern Ontario, complementing a future system based in the Canadian High Arctic. These Canadian systems will complement planned U.S. systems, in order to significantly expand situational awareness of potential threats to our continent. Funding for these projects comes from Canada’s $38.6 billion plan to modernize continental defence.</p>\n\n<p>The leaders also committed to deepen cooperation to protect our critical infrastructure against cyber threats, improve intelligence sharing on cross-border fentanyl and precursor chemical trafficking, and reducing firearms violence through the Cross-Border Crime Forum.</p>\n\n<p>To promote peace and security around the world, Canada is investing an additional $100 million to provide enhanced policing support and equipment to the Haitian National Police, to bolster Haitian-led solutions to the crisis and support peace and security. Canada is also imposing additional sanctions on two more members of the Haitian elite, bringing the total of individuals directly sanctioned by Canada to 19, in addition to coordinated sanctions with our international partners. These sanctions will freeze the assets of former senator Nenel Cassy and businessman and former presidential candidate Steeve Khawly, and make them inadmissible to Canada.</p>\n\n<p>The Prime Minister and the President reiterated their support for Ukraine and condemned Russia’s illegal, brutal, and unprovoked aggression and acknowledged the long-term challenge to the international order posed by the People’s Republic of China. The leaders will continue to work together on countering foreign interference to protect our democratic values. They also discussed cooperation to promote a free, open, prosperous, and secure Indo-Pacific, including through the U.S.-Canada Indo-Pacific Strategic Dialogue, which took place on March 10, and the President expressed support for Canada joining the Indo-Pacific Economic Framework (IPEF).</p>\n\n<p>During his visit, the President made an address to Parliament and attended a dinner hosted by the Prime Minister, deepening the strong, growing, and unique friendship between our countries and the people who call them home.</p>\n\n<p>Canada and the United States are steadfast partners and we will continue working closely together to make life more affordable, create good jobs, protect the environment, and promote peace and security in our countries and around the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the United States share a deep sense of friendship, history, and common values. Our ongoing cooperation on issues such as trade, security, and the environment reflects a strong commitment making life better for people on both sides of our shared border.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The Prime Minister made a series of new funding announcements, including:\n\t<ul class=\"bulletOutline\"><li>Increasing investments to up to $250 million in the Canadian semiconductor industry;</li>\n\t\t<li>Addressing irregular migration by expanding the Safe Third Country Agreement to unofficial ports of entry;</li>\n\t\t<li>Investing $420 million in protecting and restoring the iconic Great Lakes;</li>\n\t\t<li>Investing $100 million in additional equipment and support for the Haitian National Police to support peace and security in Haiti; and</li>\n\t\t<li>Investing $7.3 billion in infrastructure to support the arrival of our F-35 fighter jets, from our $38.6 billion NORAD modernization plan, and confirming Southern Ontario will be the location for one of Canada’s early warning and threat tracking systems.</li>\n\t</ul></li>\n\t<li>The Prime Minister was accompanied by Chrystia Freeland, Deputy Prime Minister and Minister of Finance of Canada, as well as Melanie Joly, Minister of Foreign Affairs, Mary Ng, Minister of International Trade, Export Promotion, Small Business and Economic Development, François-Philippe Champagne, Minister of Innovation, Science and Industry of Canada, Steven Guilbeault, Minister of Environment and Climate Change of Canada, Jonathan Wilkinson, Minister of Natural Resources and Anita Anand, Minister of National Defence.</li>\n\t<li>For his visit, President Biden was accompanied by Jill Biden, the First Lady of the United States, Antony Blinken, Secretary of State, Jennifer Granholm, Secretary of Energy, Jake Sullivan, National Security Advisor, Jen O’Malley Dillion, Deputy Chief of Staff, Liz Sherwood-Randall, Homeland Security Advisor, Karine Jean-Pierre, Press Secretary, Lael Brainard, Director of the National Economic Council, and Juan Gonzalez, Senior Director for Western Hemisphere, National Security Council.</li>\n\t<li>Prime Minister Trudeau and President Biden have met on numerous occasions since the President’s inauguration in January 2021, including the first bilateral (virtual) meeting in February 2021, and again in November 2021, in Washington, DC, in June 2022, in Los Angeles, and in January 2023, at the North American Leaders’ Summit in Mexico City. They have also met on the margins of several international summits and meetings.</li>\n\t<li>In February 2021, Prime Minister Trudeau and President Biden launched the Roadmap for a Renewed U.S.-Canada Partnership, which lays out an ambitious framework to grow our economies, strengthen the middle class, and build a healthier future.</li>\n\t<li>In 2021, Prime Minister Trudeau and President Biden established the Canada-U.S. Supply Chain Working Group, which strengthens bilateral supply chain security and resilience and reinforces our deeply interconnected and mutually beneficial economic relationship.</li>\n\t<li>The Canada-United States-Mexico Agreement (CUSMA) establishes one of the largest free trade regions in the world, generating economic growth and helping to raise the standard of living for the people of all the member countries.&nbsp;</li>\n\t<li>Canada and the United States share the longest and most secure border in the world, which approximately $3.4 billion worth of goods and services cross daily in 2022.&nbsp;</li>\n\t<li>Bilateral trade between Canada and the United States in goods and services was over $1.3 trillion in 2022.</li>\n\t<li>In 2021, bilateral steel and aluminum trade between Canada and the U.S. was valued at $34.3 billion.</li>\n\t<li>In 2022, the United States remained Canada’s top trading partner in both goods and services. This includes the fact that Canada’s exports to the United States surpassed $598 billion.&nbsp;</li>\n\t<li>In 2021, the U.S. accounted for 91% of Canada’s energy exports by value. The energy relationship is reciprocal. The U.S. accounted for 73% of Canada’s energy imports by value.&nbsp;</li>\n\t<li>Canada buys more goods from the United States than China, France, and Japan combined.</li>\n\t<li>Canada is the top trading partner of most U.S. states.</li>\n\t<li>Canadian companies operating in the United States directly employ 634,000 Americans.</li>\n</ul><h2>Related Products</h2>\n\n<ul><li><a href=\"/en/news/statements/2023/03/24/prime-minister-trudeau-and-president-biden-joint-statement\">Joint Statement by Prime Minister Trudeau and President Biden</a></li>\n\t<li><a href=\"/en/news/backgrounders/2023/03/24/backgrounder-canada-and-united-states-advance-work-grow-our-clean\">Backgrounder: Canada and the United States advance work to grow our clean economies and create good, middle-class jobs on both sides of our border</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://international.gc.ca/world-monde/country-pays/united_states-etats_unis/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/09/president-united-states-joe-biden-visit-canada\">President of the United States Joe Biden to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed Canada-U.S. Partnership</a></li>\n</ul></div>\n      "
}