{
  "path": "/en/news/news-releases/2020/03/04/supporting-green-transportation-quebec-and-canada",
  "pageTitle": "Supporting green transportation in Quebec and Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Transportation is the second largest source of greenhouse gas emissions in Canada. To build a better future, we need to make green transportation more affordable for everyone in Quebec and across the country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Saint-Jérôme to meet with workers at The Lion Electric Co., a zero-emission bus and urban truck manufacturer. During his visit, he highlighted how the Government of Canada is working to advance green transportation and fight climate change.</p>\n\n<p>The Government of Canada is committed to achieving net-zero emissions by 2050. That is why we implemented measures to make zero-emission vehicles more affordable. Residents of Quebec accounted for 53 per cent of all requests accepted through the Incentive for Zero-Emission Vehicles Program, as of January 31, 2020. This shows the significant impact that combined zero-emission vehicle supports, from different orders of government, have had in Quebec.</p>\n\n<p>Earlier this week, the Prime Minister also announced that the Government of Canada intends to propose an extension to the existing zero-emission vehicle incentive for on-road vehicles, which was announced in Budget 2019. The incentive, which allows businesses to claim 100 per cent of the cost of the purchase of on-road passenger vehicles, would be expanded to include off-road vehicles and automotive equipment.</p>\n\n<p>The Government of Canada is also working with partners, including other orders of government, businesses, and all Canadians, to reduce emissions and support public transit. This includes joint investments with the Government of Quebec to extend Montréal Metro’s Blue line, and to establish a structuring public transit network in Quebec City. The Government of Canada is also looking to work in partnership with the provinces and territories to increase the number of zero-emission buses.</p>\n\n<p>All of these investments will help us protect the environment in a way that encourages innovation, grows the economy, and creates good jobs for the middle class, and all those working hard to join it.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians know that economic growth and environmental protection go hand in hand. That is why we are taking strong steps to achieve ambitious emission reduction targets, create good, well-paying jobs, and accelerate our progress toward a cleaner future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2018, the Government of Canada invested $50,000 in The Lion Electric Co. to support research, development, adaptation and adoption of products, services or processes that demonstrate innovation or are driven by new technologies.</li>\n\t<li>Budget 2019 provided $300 million over three years, starting in 2019-20, to introduce a new incentive program to encourage more Canadians to buy zero-emission vehicles.</li>\n\t<li>As of January 31, 2020, over 36,000 Canadians and Canadian businesses have benefitted from this point-of-sale incentive.</li>\n\t<li>To support the transition to a low-carbon transportation system, the Government of Canada has set targets for sales of zero-emission vehicles in Canada, which are as follows: 10 per cent of new light-duty vehicle sales to be zero-emission vehicles by 2025, 30 per cent by 2030, and 100 per cent by 2040.</li>\n\t<li>Zero-emission vehicles made up 3 per cent of all new light-duty vehicle sales in Canada in 2019, a significant increase from 2 per cent in 2018.</li>\n</ul>\n\n<h2>Associated Links&nbsp;&nbsp;&nbsp;&nbsp;<strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong></h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/02/making-zero-emissions-vehicles-more-affordable\">Making zero-emissions vehicles more affordable</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/greenhouse-gas-emissions/projections/2019.html\">Greenhouse gas emissions projections</a></li>\n\t<li><a href=\"https://www.tc.gc.ca/en/services/road/innovative-technologies/zero-emission-vehicles.html\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/energy-efficiency-transportation/zero-emission-vehicle-infrastructure-program/21876\">Zero-Emission Vehicle Infrastructure Program</a></li>\n</ul></div>\n      "
}