{
  "path": "/en/news/news-releases/2022/09/23/prime-minister-announces-appointment-new-chief-justice-supreme-court",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of the Supreme Court of the Northwest Territories | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Shannon Smallwood, a judge of the Supreme Court of the Northwest Territories, as the new Chief Justice of the Supreme Court of the Northwest Territories, effective September 22, 2022.</p>\n\n<p>Chief Justice Smallwood replaces Chief Justice Louise A. Charbonneau, who retired, effective July 11, 2022.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am pleased to announce the appointment of the Honourable Shannon Smallwood as the new Chief Justice of the Supreme Court of the Northwest Territories. The first Indigenous person appointed to this position, Chief Justice Smallwood brings over two decades of legal experience, including 11 years within this Court, to her new role. I know she will continue to serve Northerners with dedication and wish her every success.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial services in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/09/23/honourable-shannon-smallwood\">The Honourable Shannon Smallwood</a></li>\n</ul></div>\n      "
}