{
  "path": "/en/news/news-releases/2019/03/28/national-pharmacare-make-prescription-drugs-more-accessible-and",
  "pageTitle": "National pharmacare to make prescription drugs more accessible and affordable | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians pay too much for prescription drugs – and that means far too many go without the medicine they need. With Budget 2019, the Government of Canada is taking important first steps on implementing national pharmacare, to make prescription drugs more affordable and accessible to more Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Halifax, Nova Scotia to highlight the Government of Canada’s plan to move forward with important measures that will lay the foundation for national pharmacare.</p>\n\n<p>Through Budget 2019, the government announced its intention to move forward, in partnership with provinces, territories, and other partners and stakeholders, on three foundational elements of national pharmacare:</p>\n\n<ul>\n\t<li>Create a Canadian Drug Agency, which would assess the effectiveness of new prescription drugs and negotiate drug prices on behalf of Canada’s drug plans to help lower drug costs for Canadians by up to $3 billion per year in the long term.<br>\n\t&nbsp;</li>\n\t<li>Develop a national formulary – a comprehensive, evidence-based list of prescription drugs – which would help promote coverage that is more consistent across the country.<br>\n\t&nbsp;</li>\n\t<li>Establish a national strategy for high-cost drugs for rare diseases to help Canadians<strong> </strong>–&nbsp;many of whom are children – get better and more consistent access to the much-needed treatments that they need.</li>\n</ul>\n\n<p>From young children who need lifesaving drugs to seniors who need affordable medication, the Government of Canada is working with its partners to provide all Canadians with a better quality of life.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“No Canadian should have to choose between putting food on the table and paying for the prescription drugs they or their family need. Through Budget 2019, we are taking action to make medication more accessible and to lower the cost of prescription drugs for Canadians of all ages. These are important steps toward building a system that helps all Canadians get the medicine they need when they need it.”</p>\n\n<footer class=\"default\"><span>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</span></footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2019, <em>Investing in the Middle Class</em>, is the government’s plan to create more good well-paying jobs, put homeownership within reach of more Canadians, help working people get the training they need to succeed, support seniors, and lay the foundation for national pharmacare.</li>\n\t<li>In Budget 2018, the Government of Canada announced the creation of the <a href=\"https://www.canada.ca/en/health-canada/corporate/about-health-canada/public-engagement/external-advisory-bodies/implementation-national-pharmacare.html\">Advisory Council on the Implementation of National Pharmacare</a> to lead a national dialogue on how best to implement national pharmacare in a manner that is affordable for Canadians and their employers.</li>\n\t<li>The Advisory Council has engaged thousands of Canadians from across the country through stakeholder roundtables, targeted engagement sessions, and community town halls. They provided preliminary recommendations in their interim report, released on March 6, 2019. Their final report is expected this spring.</li>\n\t<li>Budget 2019 proposes $35 million over four years, starting in 2019–20, to establish a Canadian Drug Agency Transition Office to support the development of this vision.</li>\n\t<li>Budget 2019 also proposes to provide up to $1 billion over two years, starting in 2022–23, with up to $500 million per year ongoing, to help Canadians with rare diseases access the drugs they need.</li>\n\t<li>In Budget 2017, the Government of Canada committed $11 billion over 10 years in new funding for provinces and territories to improve access to home care and mental health services across the country.</li>\n\t<li>Through Budget 2019, an additional $50 million is proposed to support the implementation of a national dementia strategy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/home-accueil-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/themes/pharmacare-assurance-medicaments-en.html\">Moving Forward on Implementing National Pharmacare</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/corporate/about-health-canada/public-engagement/external-advisory-bodies/implementation-national-pharmacare/interim-report.html\">Interim report from the Advisory Council on the Implementation of National Pharmacare</a></li>\n</ul></div>\n      "
}