{
  "path": "/en/news/readouts/2022/03/16/prime-minister-justin-trudeau-speaks-president-indonesia-joko-widodo",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Indonesia Joko Widodo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Indonesia, Joko Widodo.</p>\n\n<p>The two leaders agreed on the importance of an immediate cease fire in Ukraine. The Prime Minister thanked the President for his strong personal expression against the war, and for Indonesia’s support for the United Nations resolution reaffirming Ukraine’s territorial integrity and demanding that Russia unconditionally withdraw its forces. They discussed the urgent humanitarian crisis and agreed on the need to work together to mitigate the global economic impacts resulting from the invasion of Ukraine.</p>\n\n<p>Prime Minister Trudeau welcomed Indonesia’s strong emphasis on economic growth that works for everyone, pandemic recovery, climate action, and gender equality in the context of its G20 Presidency this year, and pledged Canada’s support. The Prime Minister cautioned that Russia’s invasion of Ukraine would certainly have an impact on cooperation within the G20.</p>\n\n<p>The two leaders welcomed the 70th anniversary of diplomatic relations between Canada and Indonesia this year and highlighted the first round of negotiations toward a Canada-Indonesia Comprehensive Economic Partnership Agreement that is currently underway. The Prime Minister noted the strong alignment between Canada and Indonesia on climate change issues and stressed the importance of a global standard for pricing pollution.</p>\n\n<p>The leaders committed to staying in close touch on these issues.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/indonesia-indonesie/index.aspx?lang=eng\">Canada and Indonesia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/canada-to-begin-negotiations-with-indonesia-on-a-comprehensive-economic-partnership-agreement.html\">Canada to begin negotiations with Indonesia on a Comprehensive Economic Partnership Agreement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n</ul></div>\n      "
}