{
  "path": "/en/news/news-releases/2016/06/28/canada-lift-mexican-visa-requirements",
  "pageTitle": "Canada to lift Mexican visa requirements | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada has made it a top priority to re-establish and strengthen our relationship with one of our most important partners, Mexico.</p>\n<p>Today, the Prime Minister, Justin Trudeau, announced Canada’s intention to lift the visa requirement for Mexican visitors beginning December 1, 2016. The announcement came during a productive two-day State visit to Canada by Mexican President Enrique Peña Nieto.&nbsp;</p>\n<p>Lifting the visa requirement will deepen the ties between Canada and Mexico and will increase the flow of travellers, ideas, and business between both countries.</p>\n<p>Canada and Mexico both understand the importance of having a productive and respective relationship – one that allows for greater trade, stronger growth, and more clean job creation.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada is pleased to deliver on the government’s commitment to lift the visa requirement for Mexican nationals. We look forward to the social and economic benefits that lifting the visa requirement will bring to both countries, especially to the middle class here in Canada.”<br><em>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canadian officials are currently working with their Mexican counterparts on final details to ensure a successful visa lift. This includes expanding existing collaboration and cooperation on migration issues––with the goal of ensuring that the benefits of the visa lift are fully maximized by both countries.</li>\n<li>Until November 30, 2016, the visa requirement is still in place for Mexico. Additional information will be provided to Mexican citizens in advance of the visa lift, so that they can experience a seamless transition to visa-free travel.</li>\n</ul>\n<p><strong>Related product</strong></p>\n<ul>\n<li>Backgrounder – <a href=\"/en/news/backgrounders/2016/06/28/canada-lift-visa-requirements-mexico\">Canada to lift visa requirements for Mexico&nbsp;</a></li>\n</ul></div>\n      "
}