{
  "path": "/en/news/news-releases/2020/07/23/prime-minister-thanks-chief-defence-staff-his-service-canadians",
  "pageTitle": "Prime Minister thanks Chief of the Defence Staff for his service to Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that General Jonathan Vance will retire in the coming months as Chief of the Defence Staff, a position he has held since July 2015. He also thanked him for his many years of service to Canadians and congratulated him on his upcoming retirement from the Canadian Armed Forces.</p>\n\n<p>General Vance is one of the longest serving military commanders in Canadian history. As Canada’s longest serving Chief of the Defence Staff, he has led the Canadian Armed Forces as they defended our country against military threats, and deployed overseas to confront adversaries and support our allies. He helped Canadians at home cope with natural disasters and domestic crises, including most recently during the COVID-19 pandemic. General Vance was key to the development and implementation of the fully funded Strong, Secure and Engaged defence policy, which is helping to build a more secure and peaceful world. He has also led significant progressive reforms in our Armed Forces, including through Operation Honour, which aims to eliminate sexual misconduct in the Canadian military.</p>\n\n<p>Before becoming Chief of the Defence Staff, General Vance commanded at all levels, from platoon commander to brigade commander, in both peacekeeping and combat operations. He was awarded the Meritorious Service Cross twice, is a Commander of the Order of Military Merit, and was awarded the Mentioned-in-Dispatches for his leadership during peacekeeping operations in Croatia.</p>\n\n<p>Today, the Prime Minister is initiating the recruitment process to appoint the next Chief of the Defence Staff. General Vance will continue to serve in his role until he relinquishes command to the new Chief of Defence Staff, who will be named in the coming months.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“In his five years as Chief of the Defence Staff, General Vance has served with distinction during a challenging period, leading the Canadian Armed Forces as they served at home and around the world, from Mali to Ukraine to Iraq. He has also worked with the Forces to make them more inclusive and representative of the country they defend and the Canadians they protect. With almost 40 years of service, General Vance has devoted his life to this country and we thank him for his dedication and leadership.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Over the past five years, General Vance has served with distinction as the Chief of Defence Staff. During his tenure, General Vance has led the Canadian Armed Forces through transformative change whether through the development of Canada’s new defence policy, Strong, Secure, Engaged, the promotion of a more inclusive and welcoming Canadian Armed Forces and our re-engagement with allies and like-minded countries around the world. Under his leadership, the Canadian Armed Forces were always well prepared to respond to disasters like floods and forest fires, security challenges around the world, and, most recently, a health pandemic. Canadians recognize the service and sacrifices General Vance has made for Canada. His sense of duty was always driven towards looking after the members of the Canadian Armed Forces and their families. I want to thank him and his family for their service to Canada.”</p>\n\n<footer class=\"default\">The Hon. Harjit Singh Sajjan, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“I would like to thank all members of the Canadian Armed Forces and your families for all you do for Canada and Canadians every day. Whether at home or abroad, you are more important to the success of our nation than most will ever know. It has been an honour to serve with you and a privilege to lead the profession of arms in Canada.”</p>\n\n<footer class=\"default\">General Jonathan Vance, Chief of the Defence Staff</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Chief of the Defence Staff is appointed through a Governor in Council appointment, and is responsible for the command, control, and administration of the Canadian Armed Forces, as well as military strategy, plans, and requirements.</li>\n\t<li>A Governor in Council appointment is made by the Governor General, on the advice of the Queen’s Privy Council of Canada. The appointments are made through an Order in Council and range from heads of agencies and chief executive officers of Crown corporations to members of quasi-judicial tribunals.</li>\n</ul></div>\n      "
}