{
  "path": "/en/news/statements/2021/03/26/statement-prime-minister-passover",
  "pageTitle": "Statement by the Prime Minister on Passover | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the occasion of Passover:</p>\n\n<p>“Tomorrow evening at the conclusion of Shabbat, Jewish communities in Canada and around the world will observe the beginning of Passover.</p>\n\n<p>“Traditionally, families and friends gather around the Seder table to share symbolic foods like matzah and maror, drink wine, read from the Haggadah, and reflect on the story of the Exodus.</p>\n\n<p>“Even though this year’s eight days of celebration will be different due to the global COVID-19 pandemic, Passover invites us to find hope from the triumph of the Israelites over slavery and affliction. Through conviction and perseverance, they gained freedom and a better life. Just as people have for millennia, we continue to be inspired by this story of strength and determination in the face of hardship – especially as we continue to do everything we can to fight COVID-19.</p>\n\n<p>“For generations, Jewish Canadians have helped make our country stronger and more resilient. Over the last year, many of them have worked on the front lines and helped their neighbours and communities face the challenges brought on by the pandemic. Just as we have come together to keep each other safe in these unprecedented times, we must recommit ourselves to a country free from antisemitism, hate, and discrimination. Only together can we build a safer and more inclusive world for all.</p>\n\n<p>“On behalf of our family, Sophie and I extend our best wishes to all those celebrating Passover in Canada and around the world. Next year, we will celebrate together.</p>\n\n<p>“!חג פסח שמח</p>\n\n<p>“Chag Pesach Sameach!</p></div>\n      "
}