{
  "path": "/en/news/news-releases/2016/08/23/prime-minister-canada-and-premier-ontario-announce-agreement-under",
  "pageTitle": "The Prime Minister of Canada and the Premier of Ontario announce agreement under new federal infrastructure funding program | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to making significant investments in infrastructure that will improve our public transit systems, strengthen Canadian communities, and help create jobs and grow the middle class now while building a strong foundation for a sustainable economic future.</p>\n<p>Today, the Prime Minister, Justin Trudeau, and the Premier of Ontario, Kathleen Wynne, announced a bilateral agreement that will provide more than $2.97 billion in combined funding – by the Government of Canada, Ontario, and municipalities – for projects across the province.</p>\n<p>This agreement will reduce commute times and make public transit more efficient and inclusive, so that millions of people spend less time waiting in traffic, and more time doing the things they love.</p>\n<p>These investments mean renewed and expanded transit systems, upgraded transit vehicles, timely repairs to subway tracks, new public transit express routes, and enhanced accessibility that will help improve the quality of life for Ontarians.</p>\n<p><strong>Quotes</strong></p>\n<p>\"We are committed to investments that will make a real difference in our communities – investments that will give Canadians more time to spend with loved ones, and to be out enjoying all that their towns and cities have to offer. These investments will provide Ontarians with improved public transit systems that will get them to work on time, and back home quickly and safely. They will also help generate new jobs, grow the middle class, promote a healthier environment, and lay a solid foundation for the sustainable economy of the future.\"<br>—&nbsp;<em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“I am delighted Ontario has reached an agreement with the federal government on the Public Transit Infrastructure Fund. This partnership between Ontario, the federal government and our municipalities builds on the historic infrastructure investments Ontario is already making as part of our economic plan for jobs and growth. The projects supported through this new agreement will make people’s everyday transit experiences better and support the growth of our low-carbon economy for decades.”<br><em>— The Honourable Kathleen Wynne, Premier of Ontario</em></p>\n<p><strong>Quick facts</strong></p>\n<ul>\n<li>The Government of Canada is providing up to 50 per cent of the funding needed for projects supported under this agreement. The funding is being provided through a new federal infrastructure program, the Public Transit Infrastructure Fund.</li>\n<li>This funding is part of the first phase of&nbsp;<em>Investing in Canada</em>, the Government of Canada’s historic $120-billion plan to support public infrastructure across the country over the next 10 years.</li>\n<li>Phase 1 of&nbsp;<em>Investing in Canada</em>&nbsp;will provide $11.9 billion in investments to support public transit systems, green infrastructure projects, and social infrastructure projects. Details on Phase 2 of&nbsp;<em>Investing in Canada</em>&nbsp;will be announced in the coming months.</li>\n<li>The funding available through the Public Transit Infrastructure Fund will be managed through agreements between the Government of Canada and provincial and territorial governments.</li>\n<li>Under this agreement, the Government of Canada has made its funding retroactive to April 1, 2016, so projects can proceed without delay to ensure a productive construction season.</li>\n</ul>\n<p><strong><br>Related products</strong></p>\n<ul>\n<li>Backgrounder:&nbsp;<a href=\"/en/news/backgrounders/2016/08/23/canada-and-ontario-sign-agreement-public-transit-infrastructure\">Complete list of approved projects in Ontario</a></li>\n</ul>\n<p><strong><br>Associated links</strong></p>\n<ul>\n<li><a href=\"http://www.infrastructure.gc.ca/map-carte/on-eng.html\">Federal infrastructure investments in Ontario</a>&nbsp;</li>\n<li><a href=\"http://infraconsults.ca/\">Have your say on infrastructure</a></li>\n<li><a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\">Investing in Canada, the Government of Canada's new $120 billion infrastructure plan</a></li>\n<li><a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">The Public Transit Infrastructure Fund</a></li>\n</ul></div>\n      "
}