{
  "path": "/en/news/news-releases/2019/03/13/governor-general-canada-visit-new-york-city",
  "pageTitle": "Governor General of Canada to visit New York City | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to New York City, from March 15 to 16, 2019.</p>\n\n<p>During the visit, the Governor General will meet with the Secretary-General of the United Nations, António Guterres. This meeting will be a chance for Her Excellency to acknowledge the important work of the United Nations in responding to today’s most pressing global challenges.</p>\n\n<p>The Governor General will also meet with Ambassadors and Permanent Representatives to the United Nations in New York to showcase Canada’s contribution in several different areas of international collaboration, including promoting gender equality and advancing science and space exploration.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada is a founding member of the United Nations, and we will always work with our partners around the world to build a more just, inclusive, and sustainable future. The Governor General’s visit will underscore Canada’s dedication to an international community built on shared values and united behind common goals.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Her Excellency’s second visit to the United States as Governor General.</li>\n\t<li>Canada has been active at the United Nations since its creation in 1945, and played a key role in drafting the&nbsp;<a href=\"https://www.un.org/en/charter-united-nations/index.html\">UN Charter</a>, an international treaty that sets out basic principles of international relations.</li>\n\t<li>Canada is the fifth-largest donor to the UN system.</li>\n\t<li>The Canada-United States partnership is forged by shared geography, similar values, common interests, deep connections and powerful, multi-layered economic ties.</li>\n\t<li>Canada and the United States enjoy the largest trading relationship in the world, and close to 400,000 people cross the shared border each day for business or pleasure or to maintain family ties.</li>\n</ul></div>\n      "
}