{
  "path": "/en/news/statements/2023/04/17/statement-prime-minister-41st-anniversary-canadian-charter-rights-and",
  "pageTitle": "Statement by the Prime Minister on the 41st anniversary of the Canadian Charter of Rights and Freedoms | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 41st anniversary of the <em>Canadian Charter of Rights and Freedoms</em>:</p>\n\n<p>“The <a href=\"https://laws-lois.justice.gc.ca/eng/const/page-12.html\"><em>Canadian Charter of Rights and Freedoms</em></a> is one of the most significant documents in Canadian history and a cornerstone of our democratic society. Today, we mark the 41st anniversary of its adoption with the signing of the Proclamation of the <em>Constitution Act, 1982</em>, and we recommit to the values of equality, diversity, and inclusion it promotes and defends.</p>\n\n<p>“Deeply rooted in Canada’s identity, the Charter guarantees fundamental rights and freedoms to every Canadian, including the rights to vote and move freely within the country, and freedom of expression and religion. As one of our country’s greatest accomplishments, it ensures that all people in Canada are treated with respect, dignity, and consideration, regardless of race, religion, national or ethnic origin, colour, sex, age, or ability.</p>\n\n<p>“This year, we also celebrate the 41st anniversary of <a href=\"https://laws-lois.justice.gc.ca/eng/const/page-13.html#:~:text=35%20(1)%20The%20existing%20aboriginal,are%20hereby%20recognized%20and%20affirmed.&amp;text=(2)%20In%20this%20Act%2C,and%20M%C3%A9tis%20peoples%20of%20Canada.\">Section&nbsp;35 of the&nbsp;<em>Constitution Act, 1982</em></a>, which recognizes and affirms Indigenous and Treaty rights of First Nations, Inuit, and Métis in Canada. We will continue to work with Indigenous partners to advance reconciliation and build renewed nation-to-nation, Inuit-Crown, and government-to-government relationships.</p>\n\n<p>“On behalf of the Government of Canada, I invite everyone in Canada to reflect on the importance of the Charter and the collective responsibility we have to uphold it for generations to come. Together, we can ensure that our country continues to stay true to our shared values of equality, justice, and freedom – and remains a place of choice for people from around the world to live and raise a family.”</p></div>\n      "
}