{
  "path": "/en/news/statements/2018/09/03/statement-prime-minister-labour-day",
  "pageTitle": "Statement by the Prime Minister on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p><p>“On Labour Day, we celebrate Canada’s workers and the major achievements of our country’s labour movement. Today, thanks to generations of labour activists, Canada’s workplaces are safer, more equitable, and more just. We honour the dedication and determination of the labour movement, and continue to stand with workers from coast to coast to coast.</p><p>“Canada’s workers have been the backbone of our country for generations. From building crucial infrastructure, to providing the services we rely on, our workers make Canada strong. Year after year and across every sector and industry, they grow our economy and strengthen the middle class at the heart of our country’s success.</p><p>“That is why the Government of Canada works every day to support Canada’s workers and make sure people across our country have a real and fair chance at success. Today, Canada’s economy is the fastest-growing in the G7 – and the unemployment rate is at its lowest level since the 1970s. This year, we created a stronger Canada Workers Benefit to help low-income workers keep more of their hard-earned money, succeed in the workforce, and build a better future.</p><p>“Canada’s workforce is more diverse than ever before – and all of us benefit when everyone has a chance to participate in the workforce and contribute to our economy. With <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a>, we introduced measures to address the gender wage gap and increase job opportunities for women, especially those in underrepresented groups. We are also taking action to reduce work-related dangers and harassment, and we are proposing changes to the <i>Canada Labour Code</i> to provide five days of paid leave to workers in federally regulated workplaces who are survivors of family violence.</p><p>“From protecting the right to organize to improving workplace safety and job training, the Government of Canada is proud to be a partner to the labour movement. Together with provinces and territories, we are making major investments to create employment and skills training programs that meet the diverse needs of Canadian workers – and thanks to our historic agreement to strengthen the Canada Pension Plan, we are making sure more Canadians have a secure and dignified retirement. The Government of Canada will continue to take action to support workers, grow our economy, and make a real difference in the lives of Canadians.</p><p>“On Labour Day, I encourage all Canadians to celebrate the workers who make our country a better place to live. On behalf of the Government of Canada, Sophie and I wish all Canadians a safe and happy Labour Day.”</p></div>\n      "
}