{
  "path": "/en/news/readouts/2021/06/15/prime-minister-justin-trudeau-meets-prime-minister-alexander-de-croo",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Alexander De Croo of Belgium | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the Prime Minister of Belgium, Alexander De Croo, in Brussels, Belgium. This was their first in-person meeting since Prime Minister De Croo’s inauguration.</p>\n\n<p>The leaders discussed COVID-19 and measures being taken in both countries to save lives, support workers and businesses, and end the pandemic for good. Prime Minister Trudeau thanked Prime Minister De Croo for Belgium’s role in ensuring timely vaccine deliveries to Canada and for his country’s commitment to continue vaccine exports.</p>\n\n<p>Following a successful NATO Summit, the prime ministers spoke about the strength of transatlantic relations and their collaboration within NATO.</p>\n\n<p>The two leaders discussed their respective approaches to tackling climate change, and the importance of investing in clean technologies. They also spoke about the immense potential of clean and renewable energy sources, including hydrogen and wind power.</p>\n\n<p>Prime Minister Trudeau and Prime Minister De Croo highlighted the strong bilateral and commercial relations between Canada and Belgium, and how the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) has benefitted businesses and workers in both countries, increasing bilateral trade by 30 per cent since ratification of the agreement.</p>\n\n<p>The two leaders spoke about their approaches to advancing gender equality, and working toward a strong economic recovery that is inclusive, including through measures such as affordable child care.</p>\n\n<p>The prime ministers discussed the two countries’ shared democratic values and commitment to multilateral institutions and the rules-based international order.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/belgium-belgique/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Belgium relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/14/prime-minister-concludes-productive-nato-summit\">Prime Minister concludes productive NATO Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/02/prime-minister-attend-g7-leaders-summit-nato-summit-and-canada\">Prime Minister to attend G7 Leaders’ Summit, NATO Summit, and Canada-European Union Summit</a></li>\n</ul></div>\n      "
}