{
  "path": "/en/news/statements/2021/04/29/statement-prime-minister-death-thomas-berger",
  "pageTitle": "Statement by the Prime Minister on the death of Thomas Berger | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of former B.C. Supreme Court Justice Thomas Berger:&nbsp;</p>\n\n<p>“Today, I join Canadians in mourning the loss of one of Canada’s most respected lawyers and Indigenous and environmental rights activists, and former B.C. Supreme Court Justice, Thomas Berger.</p>\n\n<p>“Mr. Berger had a distinguished career, which spanned over half a century and comprised many roles. He served as a Member of Parliament, Member of the Legislative Assembly, and Leader of the Official Opposition in B.C. As a champion of human rights, and a prominent lawyer, he changed the face of provincial and federal laws, giving a voice to thousands, while laying the foundation for a better, more just future for millions of people across Canada, especially Northerners and Indigenous peoples.</p>\n\n<p>“Mr. Berger was counsel for the Nisga’a Nation in the landmark <em>Calder v. British Columbia</em> case, which led the Supreme Court of Canada to acknowledge, for the first time, the Aboriginal title to the land. At the age of 38, Mr. Berger was appointed to the B.C. Supreme Court, and would go on to play a pivotal role in many other matters related to Indigenous rights. For his many contributions, Mr. Berger received the Order of Canada in 1990 and the Order of British Columbia in 2004.&nbsp;</p>\n\n<p>“Mr. Berger will be remembered as the consummate advocate. He not only gave a voice to the voiceless – he truly listened, and in doing so, empowered a generation of leaders to become voices for their own communities.</p>\n\n<p>“Sophie and I send our deepest condolences to Mr. Berger’s family and friends. Canada is a stronger, fairer, and more inclusive country thanks to Thomas’ lifelong dedication to social justice and public service.”</p></div>\n      "
}