{
  "path": "/en/news/statements/2017/04/07/statement-prime-minister-canada-world-health-day",
  "pageTitle": "Statement by the Prime Minister of Canada for World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement for World Health Day:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we celebrate the founding of the <a href=\"http://www.who.int/en/\">World Health Organization</a> (WHO), and highlight our shared global responsibility to promote better health. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, the campaign for <a href=\"http://www.who.int/campaigns/world-health-day/2017/en/\">World Health Day</a> – <i>Depression: let’s talk</i> – is focused on how depression affects people of all ages, from all walks of life, all around the world.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“<a href=\"https://www.canada.ca/en/public-health/services/publications/diseases-conditions/report-canadian-chronic-disease-surveillance-system-mental-illness-canada-2015.html\">One in three Canadians</a> will experience a mental illness during their lifetime, but these serious health problems are not always visible. By talking about depression and mental health openly and honestly, we can help end the stigma that too often acts as a barrier for those who want and need help.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year’s World Health Day reminds us that there can be no health without mental health. That is why, working with provinces and territories, we have committed $5&nbsp;billion over the next ten years to support mental health initiatives, so that more Canadians can get the help they need.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Government of Canada will continue to help communities address their unique mental health challenges and to work together with the WHO to promote mental health and our collective well-being.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, I encourage all Canadians to join the international community to celebrate World Health Day and to raise awareness about depression. We all have a role to play to create more open conversations about mental health, and to help each other get the care we need.”</span></p><p><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Associated links</span></b></p><ul><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"https://www.canada.ca/en/public-health/topics/mental-health-services.html\">Mental health services</a> </span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"https://www.canada.ca/en/public-health/topics/mental-health-wellness.html\">Mental health and wellness</a> </span></li></ul></div>\n      "
}