{
  "path": "/en/news/statements/2022/06/28/g7-leaders-communique-executive-summary",
  "pageTitle": "G7 Leaders’ Communiqué – Executive Summary | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Leaders of the Group of Seven (G7), met in Elmau, Germany, on 26-28 June 2022, were joined by the Leaders of Argentina, India, Indonesia, Senegal and South Africa, as well as Ukraine.</p>\n\n<p>At a time when the world is threatened by division and shocks, we, the G7, stand united. We underscore our resolve to, together with partners, jointly defend universal human rights and democratic values, the rules-based multilateral order, and the resilience of our democratic societies. In doing so, we will address the key challenges of our time:</p>\n\n<ul>\n\t<li>We reemphasise our condemnation of Russia’s illegal and unjustifiable war of aggression against Ukraine. We will stand with Ukraine for as long as it takes, providing the needed financial, humanitarian, military, and diplomatic support in its courageous defence of its sovereignty and territorial integrity. We are ready to reach arrangements together with interested countries and institutions and Ukraine on sustained security commitments to help Ukraine defend itself and to secure its free and democratic future.</li>\n\t<li>Our financial support in 2022 amounts to more than USD 2.8 billion in humanitarian aid, and we are ready to grant, or have pledged and provided USD 29.5 billion in budget aid. We are strongly committed to supporting Ukranian reconstruction through an international reconstruction conference and plan, drawn up and implemented by Ukraine in close coordination with international partners.</li>\n\t<li>We will continue to impose severe and enduring costs on Russia to help bring an end to this war. Beyond its direct implications, Russia’s aggression is impeding the global recovery and dramatically worsening energy security and access to food globally. To this end, we remain steadfast in our commitment to our unprecedented coordination on sanctions for as long as necessary, acting in unison at every stage, and will reduce Russia’s revenues, including from gold.</li>\n\t<li>We will help to stabilise and transform the global economy while tackling rising costs of living for our citizens. We will coordinate on our economic security, strengthen the resilience of supply chains and secure a level-playing field.</li>\n\t<li>We will take immediate action to secure energy supply and reduce price surges driven by extraordinary market conditions, including by exploring additional measures such as price caps. We reaffirm our commitment to phase out our dependency on Russian energy, without compromising on our climate and environmental goals.</li>\n\t<li>With our partners, we have made significant progress towards the target of USD 100 billion for the most vulnerable, building on the 2021 Special Drawing Rights allocation. To protect people from hunger and malnutrition, and in response to Russia’s weaponisation of grain, we will increase global food and nutrition security through the Global Alliance on Food Security. We will provide an additional USD 4.5 billion to this end, stand by our commitments to keep our food and agricultural markets open and step up efforts to help Ukraine produce and export.</li>\n\t<li>We endorse the goals of an open and cooperative international Climate Club, and will work with partners towards establishing it by the end of 2022. To drive urgent, ambitious, and inclusive action to align ourselves with 1.5°C pathways and to accelerate implementation of the Paris Agreement, we commit to a highly decarbonised road sector by 2030, a fully or predominantly decarbonised power sector by 2035, and prioritising concrete and timely steps towards the goal of accelerating phase-out of domestic unabated coal power.</li>\n\t<li>Through our Partnership for Global Infrastructure and Investment, we aim to mobilise USD 600 billion over the next five years to narrow the global investment gap. We will step up our cooperation globally, including through working towards new Just Energy Transition Partnerships with Indonesia, India, Senegal and Vietnam, building on our existing partnership with South Africa.</li>\n\t<li>To overcome the current COVID-19 pandemic, we will build on our provision of over 1.175 billion vaccine doses since we last met. We will also prevent, prepare, and respond to future pandemics and health challenges including through the G7 Pact for Pandemic Readiness.</li>\n\t<li>Guided by the conviction that democratic values make us stronger in tackling global challenges, we will cooperate with civil society and our partners beyond the G7 to strengthen the resilience of our societies, promote human rights online and offline, address disinformation, and achieve gender equality.</li>\n</ul>\n\n<p>With these joint commitments and actions taken today, and by working together with partners, we will make progress towards an equitable world.</p></div>\n      "
}