{
  "path": "/en/news/statements/2019/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p>\n\n<p>“Thirty years ago today, at the École Polytechnique de Montréal, 14 young women were murdered in a senseless antifeminist attack. Today, on the <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/remembrance-commemoration-en.html\">National Day of Remembrance and Action on Violence Against Women</a>, we gather to mourn their loss and honour their memory. Their deaths robbed us of daughters, sisters, friends, and colleagues, and of their limitless potential.</p>\n\n<p>“Today, we reaffirm our commitment to fight the hatred that drove this tragedy, and the misogyny that still exists in our communities and our country. In Canada and around the world, too many women, girls, and people of diverse gender identities face violence and discrimination. That is unacceptable, and must never be tolerated. As we mark the <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism against Gender-Based Violence</a>, we have the opportunity to not just recognize the persistence of violence against women, but to take action to prevent and address it.</p>\n\n<p>“We can and we must end gender-based violence. That is why we are investing to better support survivors and their families, making the justice system more responsive to their needs, and supporting the important work of women’s organizations across the country. We are also working closely with the provinces, territories, and Indigenous partners to co-develop a National Action Plan to implement the Calls for Justice from the National Inquiry into Missing and Murdered Indigenous Women and Girls. At the same time, we are committed to strengthening gun control and banning the type of weapon that took lives at École Polytechnique. Together, we can stand up to attitudes that devalue women, and create a future where everyone is safe and heard.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to help put an end to gender-based violence. Together, we can foster a culture of respect, and build a Canada that is safer and more just for everyone.”</p></div>\n      "
}