{
  "path": "/en/news/statements/2022/06/05/statement-prime-minister-canadian-armed-forces-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Armed Forces Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian Armed Forces Day:</p>\n\n<p>“Today, we honour and recognize members of the Canadian Armed Forces (CAF) who display unwavering courage, sacrifice, and selflessness every day they wear the uniform. Here at home and around the world, they embody the values we hold dear – peace, freedom, and democracy.</p>\n\n<p>“There are approximately 2,000 CAF members who are currently deployed on nearly 20 different operations across Canada and around the world, including providing humanitarian assistance to Ukrainians in Poland who have been displaced by Russia’s illegal invasion of their country. In total there are approximately 1,400 CAF members serving on <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a> as part of our multiyear commitment to support the North Atlantic Treaty Organization’s ongoing assurance and deterrence measures in Central and Eastern Europe in response to Russian aggression in the region.</p>\n\n<p>“Canadians in uniform are always ready to help our communities when we need it most. As record heat waves, wildfires, and floods continue to rise as a result of climate change, the proud members of the CAF will continue to step up to protect our communities. Last year, the CAF provided emergency assistance, protected Canadians from extreme weather events, and supported impacted communities as well as critical infrastructure. Since the beginning of the pandemic, they helped in long-term care facilities and seniors’ residences and provided support to the federal, provincial, and territorial governments to distribute COVID-19 vaccines.</p>\n\n<p>“The Government of Canada is working to ensure a safe and inclusive working environment for all. We are achieving culture change in the CAF by introducing measures to eliminate discrimination, violence, and harassment, as well as efforts to increase diversity and promote inclusion as a core institutional value.</p>\n\n<p>“On behalf of the Government of Canada, I thank our CAF members – as well as their families and loved ones – for their service and selfless commitment to our country.”</p></div>\n      "
}