{
  "path": "/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-united-states-congressional-leadership",
  "pageTitle": "Prime Minister Justin Trudeau meets with United States congressional leadership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau attended two meetings with United States congressional leadership, hosted respectively by the Speaker of the United States House of Representatives, Nancy Pelosi, and the United States Senate Majority Leader, Chuck Schumer. During these meetings, the leaders discussed a range of shared bilateral values as well as economic and security interests.</p>\n\n<p>The Prime Minister thanked the congressional leaders for their support in advocating for the release of Canadians Michael Kovrig and Michael Spavor, who were detained arbitrarily in China. He underlined that their support exemplified the strong bilateral relationship between Canada and the U.S., built over the past 150 years. The Prime Minister highlighted that this relationship is rooted in our shared history and geography, extensive people-to-people ties, economic integration – including through the Canada-United States-Mexico Agreement (CUSMA), close security cooperation, and a wide range of social, economic, and cultural ties.</p>\n\n<p>His counterparts noted with appreciation that Canada has always stood shoulder to shoulder with the U.S. – from our close cooperation after 9/11, and the warm hospitality shown to stranded Americans in Gander, Newfoundland and Labrador, to our shared sacrifices on Juno Beach in June 1944.</p>\n\n<p>The leaders discussed our shared interests internationally, including the importance of ongoing collaboration in advocating for democracy, human rights, and the rule of law on the world stage. The Prime Minister and congressional leaders discussed a range of global issues, including China, Haiti, and the importance of working together to ensure a free and open Indo-Pacific.</p>\n\n<p>They noted the close bilateral cooperation between Canada and the U.S. during the COVID-19 pandemic, particularly with respect to our shared border, and underlined the contributions made and the leadership demonstrated by both countries in the global fight against the pandemic. They noted the critical importance of the border to the economic and security ties between our countries, and highlighted the wide-ranging cooperation on the Great Lakes – an important shared economic and environmental asset between our countries.</p>\n\n<p>The Prime Minister referred to his recent participation in the United Nations climate summit in Glasgow, and the important commitments made there to reach net-zero emissions economies by 2050 – from meeting our respective enhanced 2030 greenhouse gas reduction targets and reaching net-zero electricity by 2035, to meeting commitments under the Global Methane Pledge, which aims to help keep the goal of limiting warming to 1.5 degrees Celsius within reach. He also referenced the call at COP26 for 60 per cent of the world’s emissions to be covered by a price on carbon pollution by 2030, and stressed Canada’s intention to build on this initiative.</p>\n\n<p>The Prime Minister underscored the importance of the Canada-U.S. economic relationship and the need to continue working together to deepen our economic cooperation, particularly as we seek to build enhanced supply chain security and resilience bilaterally and globally. He emphasized the need to build resilience against global challenges into our shared supply chains to achieve mutual goals, such as supporting the electrification of the transportation sector, meeting increasing demand for zero-emission vehicles, creating good middle class jobs, and protecting supply chains. The Prime Minister warned that if Canada and the U.S. do not approach the next generation of automotive production together, it will only benefit offshore competition.</p>\n\n<p>Building on our shared commitment to secure supply chains and advance toward zero-emissions economies, the Prime Minister expressed Canada’s concerns with the electric vehicle tax credits embedded in the Build Back Better framework released by the U.S. last month. The Prime Minister noted that the credits would seriously undermine the auto sector provisions of CUSMA and harm the competitiveness of the Detroit-Windsor corridor. The Prime Minister reminded congressional leaders that companies import billions of dollars’ worth of auto parts from the U.S. to Canada every year and noted that the tax credits would decrease demand for these parts, leading to job losses and lost revenue across the U.S. He urged congressional leaders to support the transition towards zero-emission vehicles without undermining decades of integration of the Canada-U.S. auto sector and good middle class jobs on both sides of the border.</p>\n\n<p>The Prime Minister noted Canada’s support for the landmark, two-pillar plan on international tax reform by the Organisation for Economic Co-operation and Development and, in that context, conveyed Canada’s approach to enacting a Digital Services Tax.</p>\n\n<p>The Prime Minister discussed the North American Leaders’ Summit taking place today, and stressed the importance of reinforcing trilateral dialogue on a range of shared priorities, including ending the fight against COVID-19 and enhancing trilateral economic cooperation, including when it comes to the auto sector, climate action, migration, and shared security issues.</p>\n\n<p>The Prime Minister thanked his hosts for productive meetings. The leaders looked forward to finding solutions to our shared challenges that contribute to building back better for both Canada and the U.S., and strengthening our relationship as friends, allies, and partners.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/videos/2021/09/24/prime-minister-trudeau-announces-release-michael-kovrig-and-michael-spavor\">Prime Minister Trudeau announces the release of Michael Kovrig and Michael Spavor</a></li>\n\t<li><a href=\"https://www.state.gov/summit-for-democracy/#Summit\">The Summit for Democracy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement (CUSMA)</a></li>\n</ul></div>\n      "
}