{
  "path": "/en/news/statements/2020/06/20/statement-prime-minister-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/refugeeday/\">World Refugee Day</a>, Canada stands in solidarity with the millions of people around the world who long for what is often taken for granted: a safe place to call home. We will continue to do our part to support refugees and forcibly displaced people.</p>\n\n<p>“This year, our world has changed significantly. As the COVID-19 pandemic has plunged us into uncertain times, Canada remains committed to its humanitarian tradition, and to an asylum system that is fair and efficient. We will continue to work closely with international partners to find ways to support people seeking refuge from persecution, violence, and insecurity as we navigate the unprecedented challenges we are facing as a global community during this crisis.</p>\n\n<p>“Canada’s reputation as a welcoming place of refuge has led many to look to our country to create a better future for themselves and their families. When refugees and forcibly displaced people rebuild their lives in our communities, they also contribute to building a better Canada. As business owners, community volunteers, Members of Parliament, or Governors General, refugees have played a key role in making Canada the strong, prosperous, and compassionate country it is today.</p>\n\n<p>“Earlier this year, I appointed <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/10/prime-minister-announces-special-envoy-humanitarian-and-refugee\">the Honourable Bob Rae as Canada’s Special Envoy on Humanitarian and Refugee Issues</a>. Since 2017, Mr. Rae has been Canada’s Special Envoy to Myanmar, helping to resolve the humanitarian and security crisis in that country. He will continue his important work in Myanmar, while also addressing other pressing refugee and humanitarian assistance issues around the globe.</p>\n\n<p>“For a second year, the United Nations High Commissioner for Refugees’ Global Trends report shows that Canada is a leader in terms of refugee response and support and is the number one resettlement country globally. As Canadians, we are proud to open our hearts, homes, and communities to refugees.</p>\n\n<p>“Through good times and bad, our country has strived to be a beacon of hope for the world’s most vulnerable. Today, I call on Canadians and people around the globe to stand with those fleeing hardship and violence. All countries share a moral responsibility to help refugees and forcibly displaced people find shelter and start their lives anew.”</p></div>\n      "
}