{
  "path": "/en/news/news-releases/2018/12/12/prime-minister-announces-appointment-four-senators",
  "pageTitle": "Prime Minister announces the appointment of four senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/12/12/margaret-dawn-anderson\">Margaret Dawn Anderson</a> (Northwest Territories)</li><li><a href=\"/en/news/backgrounders/2018/12/12/pat-duncan\">Pat Duncan</a> (Yukon)</li><li><a href=\"/en/news/backgrounders/2018/12/12/dr-stanley-kutcher\">Dr. Stanley Kutcher</a> (Nova Scotia)</li><li><a href=\"/en/news/backgrounders/2018/12/12/dr-rosemary-moodie\">Dr. Rosemary Moodie</a> (Ontario)</li></ul><p>Ms. Anderson is a proud Inuvialuk who has been a public servant with the Government of the Northwest Territories for more than 20 years, working with communities and Indigenous peoples across the territory. She is an active member of her community who has devoted much of her professional and personal life to improving the territorial justice system.</p><p>Ms. Duncan is a former premier of Yukon, with extensive experience in business and public service. Ms. Duncan has also been an active volunteer in her community and is heavily involved with sports in the Yukon.</p><p>Dr. Kutcher is a renowned expert in adolescent mental health and a leader in mental health research, advocacy, training, and policy development, who has been involved in mental health work in over 20 countries.</p><p>Dr. Moodie has made significant contributions to reduce social inequities and health disparities among children and communities locally and internationally. She currently works as a neonatologist at Toronto’s Hospital for Sick Children and as a clinical teacher at the University of Toronto’s Department of Paediatrics.</p><p>These individuals were recommended by the Independent Advisory Board for Senate Appointments and chosen using the process open to all Canadians. Since this process has been in place, the proportion of women in the Senate has increased from 37 per cent to 47 per cent, and the number of senators who identify as Indigenous has more than doubled. With these appointments, all Senate vacancies have now been filled.</p><h2>Quotes</h2><blockquote><p>“These four new independent senators bring with them a wealth of knowledge and experience that will greatly benefit Parliament and all of Canada. They know what it means to serve, and have dedicated their careers to making a difference in the lives of others. I look forward to working with them on issues that matter most to Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“I thank all members of the Independent Advisory Board for Senate Appointments for their excellent work. Their recommendations have helped us appoint senators who reflect Canada’s diversity, who will make significant contributions to the work of Parliament, and who will ensure a high standard of integrity, collaboration, and non-partisanship in the Red Chamber.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Senate now has a full complement of 105 Senators – the first time in eight years.</li><li>There have been 49 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Once appointed by the Governor General and summoned to the Senate, the new senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/12/12/margaret-dawn-anderson\">Margaret Dawn Anderson </a></li><li><a href=\"/en/news/backgrounders/2018/12/12/pat-duncan\">Pat Duncan</a></li><li><a href=\"/en/news/backgrounders/2018/12/12/dr-stanley-kutcher\">Dr. Stanley Kutcher</a></li><li><a href=\"/en/news/backgrounders/2018/12/12/dr-rosemary-moodie\">Dr. Rosemary Moodie</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li></ul></div>\n      "
}