{
  "path": "/en/news/statements/2022/02/06/statement-prime-minister-international-day-zero-tolerance-female-genital",
  "pageTitle": "Statement by the Prime Minister on the International Day of Zero Tolerance for Female Genital Mutilation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Zero Tolerance for Female Genital Mutilation:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/observances/female-genital-mutilation-day\">International Day of Zero Tolerance for Female Genital Mutilation</a>, we come together to condemn this human rights violation that threatens the physical and mental health and well-being of women and girls around the world.</p>\n\n<p>“Female genital mutilation/cutting (FGM/C) is a harmful practice conducted for non‑medical reasons. Over 200 million women and girls are survivors of FGM/C, and it is estimated that millions more are vulnerable to undergoing FGM/C every year. Canada firmly and unequivocally denounces FGM/C. Since 1997, Canada’s <em>Criminal Code</em> has explicitly recognized the practice as a form of aggravated assault. It is illegal, and any individual who performs or helps with the practice, including those who take a child abroad for the practice, can be criminally charged.</p>\n\n<p>“The COVID-19 pandemic has hindered some of the progress made to date in ending this violent practice. The United Nations (UN) also estimates that two million additional girls are at risk of undergoing FGM/C by 2030 as a result of the impacts of the pandemic. The ongoing health strain posed by COVID‑19 has also limited the ability of advocacy programs and social services to provide access to sexual and reproductive health care for women and girls.</p>\n\n<p>“Canada is a strong advocate for gender equality and the empowerment of women and girls at home and abroad. Last August, the Government of Canada announced $530,000 in funding toward End FGM Canada Network’s <a href=\"https://www.endfgm.ca/impact-1\">Joining Hands Project</a>, to address systemic discrimination against girls at risk of FGM/C and survivors. Thanks to Canada’s <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, we continue to take action to address sexual and gender-based violence, in line with the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">UN’s 2030 Agenda for Sustainable Development</a> aimed at targeting and eliminating harmful practices by the end of the decade.</p>\n\n<p>“In 2019, the government committed to investing an average of $1.4 billion annually by 2023 to support the health and rights of women, children, and adolescents around the world through global organizations and Canadian and international non-governmental organizations, including $700 million per year specifically for sexual and reproductive health and rights. This also includes $325 million funded through Canadian civil society organizations, which is going to 11 sexual and reproductive health and rights projects to mitigate the disproportionate impacts of the pandemic on women and girls and help increase access to essential services, with a focus on Sub‑Saharan Africa.</p>\n\n<p>“On this day, we reaffirm our steadfast commitment to end FGM/C. No woman or girl should ever live in fear of physical or psychological harm that threatens her well-being and violates her human rights. Canada will continue to promote and protect the sexual and reproductive health and rights of women and girls. By advocating for gender equality, we will continue to build a safer, fairer, and brighter future for everyone.”</p>\n\n<p><em>If you are in Canada, and you believe you or someone you know is at risk of undergoing FGM/C, please seek assistance through your local police or child protective services. In addition, if you or the person at risk is a Canadian citizen abroad, please contact the nearest Canadian embassy or consulate, call 1-613-996-8885 or email </em><a href=\"mailto:sos@international.gc.cas\"><em>sos@international.gc.ca</em></a>.</p></div>\n      "
}