{
  "path": "/en/news/statements/2016/05/02/statement-prime-minister-canada-mental-health-week",
  "pageTitle": "Statement by the Prime Minister of Canada on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p>\n<p>“This week is Mental Health Week, an occasion for all Canadians to have a candid discussion about mental health and wellness and help put an end to the stigma around mental illness once and for all.</p>\n<p>“In Canada and around the world, many suffer in silence with an illness that is invisible to others. One in five Canadians will struggle with mental illness at some point in their lives. Too often, they hesitate to seek the help and support they need out of fear of discrimination or shame.</p>\n<p>“We all have a responsibility to raise our awareness about mental health. We must actively encourage honest and open conversations – in our homes, our workplaces, and our communities – about what mental health is and what we can do to increase our collective well-being. We must listen to our loved-ones, our colleagues, our friends, look out for signs and offer them support and advice in times of need. It can be a challenge for all of us to cope with the fast pace of life, daily stresses, and obligations. We all need to stand strong together.</p>\n<p>“This week, we also thank those who have publicly shared their personal struggles with mental health – including my own mother, Margaret. They are true examples of courage, bravery, and resilience. Their stories help us all become more understanding, more compassionate, and more empathetic.</p>\n<p>“Let us use our voices this week to help change the way society views mental health issues and those living with them. Now is the time to <a href=\"http://www.cmha.ca/mental-health/mental-health-week/#.VxU4iUwrLRb\">GET LOUD</a> for mental health.”</p></div>\n      "
}