{
  "path": "/en/news/readouts/2020/04/28/prime-minister-justin-trudeau-speaks-prime-minister-india-narendra-modi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of India Narendra Modi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of India, Narendra Modi, to discuss the latest developments regarding the COVID-19 pandemic.</p>\n\n<p>Prime Minister Modi offered his condolences to Canadians following the tragic shooting in Nova Scotia. Prime Minister Trudeau thanked Prime Minister Modi and highlighted the resilience and strength of Canadians.</p>\n\n<p>The two leaders had an exchange on their respective efforts to fight the pandemic, protect the health and safety of their people, and provide economic support for their citizens.&nbsp;Prime Minister Trudeau expressed his appreciation to Prime Minister Modi for India's ongoing help to repatriate Canadians seeking&nbsp;to return home during this crisis and for India’s commitment to the continued export of key pharmaceutical products. They agreed to continue cooperating closely and noted the value of the important people-to-people ties between the two countries.</p>\n\n<p>The leaders highlighted the need for global coordination, including through the G20, on pandemic response and to stabilize the global economy. They spoke of the vital need to keep supply chains open for medical equipment and other critical supplies, as well as the need for increased international cooperation to accelerate the development of diagnostics, treatments, and potential vaccines.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/india-inde/relations.aspx?lang=eng\">Canada-India relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n</ul></div>\n      "
}