{
  "path": "/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians",
  "pageTitle": "Working together to improve health care for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Canadians, we place a lot of value in our universal, public health care system. Unfortunately, it hasn’t been living up to expectations. Across the country, patients seeking emergency care are finding their emergency rooms overwhelmed or even closed. People are waiting for surgeries that are postponed or cancelled. The health care system and the workers who uphold it are under enormous strain, a situation that was exacerbated by the pandemic, and needs immediate action to deliver better health care for Canadians.</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, and his provincial and territorial counterparts met to work together on improving Canada’s health care system. Prime Minister Trudeau and premiers discussed shared health priorities to deliver real results for Canadians as well as the importance to uphold the <em>Canada Health Act </em>to protect Canada’s publicly funded health care system. Canadians must have equitable access to medical care based on their needs, not their ability to pay.</p>\n\n<p>At the working meeting with premiers, the federal government announced it will increase health funding to provinces and territories by $196.1&nbsp;billion over 10 years, including $46.2&nbsp;billion in new funding. This funding includes the following elements:</p>\n\n<ul>\n\t<li>An immediate, unconditional $2&nbsp;billion Canada Health Transfer (CHT) top-up to address immediate pressures on the health care system, especially in pediatric hospitals and emergency rooms, and long wait times for surgeries. This builds on previous CHT top-ups that total $6.5&nbsp;billion provided throughout the pandemic.</li>\n\t<li>A 5 per cent CHT guarantee for the next five years, which will be provided through annual top-up payments as required.&nbsp;This is projected to provide an additional $17.3&nbsp;billion over 10&nbsp;years in new support. The last top-up payment will be rolled into the CHT base at the end of the five years to ensure a permanent funding increase, providing certainty and sustainability to provinces and territories. With this guarantee, the CHT is projected to grow by 33 per cent over the next five years, and 61 per cent over the next 10 years.</li>\n\t<li>$25&nbsp;billion over 10 years to advance shared health priorities through tailored bilateral agreements that will support the needs of people in each province and territory in four areas of shared priority:\n\t<ul class=\"Indent1 bulletOutline\">\n\t\t<li>family health services;</li>\n\t\t<li>health workers and backlogs;</li>\n\t\t<li>mental health and substance use; and</li>\n\t\t<li>a modernized health system.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<p class=\"Indent1\">These additional federal investments will be contingent on continued health care investments by provinces and territories. This funding builds on the $7.8&nbsp;billion over five years that has yet to flow to provinces and territories for mental health and substance use, home and community care, and long-term care.</p>\n\n<ul>\n\t<li>$1.7&nbsp;billion over five years to support hourly wage increases for personal support workers and related professions, as federal, provincial, and territorial governments work together on how best to support recruitment and retention.</li>\n\t<li>$150&nbsp;million over five years for the Territorial Health Investment Fund&nbsp;in recognition of medical travel and the cost of delivering health care in the territories.</li>\n</ul>\n\n<p>In addition, the government will work with Indigenous partners to provide additional support for Indigenous health priorities:</p>\n\n<ul>\n\t<li>$2&nbsp;billion over 10 years to address the unique challenges Indigenous Peoples face when it comes to fair and equitable access to quality and culturally safe health care services. The government will work with Indigenous partners to prioritize investments.</li>\n</ul>\n\n<p>These investments, on top of already significant funding, will help build a health care system that includes:</p>\n\n<ul>\n\t<li>access to high-quality family health services when they need them, including in rural and remote areas, and for underserved communities;</li>\n\t<li>a resilient and supported health care workforce that provides high-quality, effective, and safe health care services;</li>\n\t<li>access to timely, equitable, and quality mental health, substance use, and addictions services to support Canadians’ well-being;</li>\n\t<li>access to a patient’s own electronic health information that is shared between the health professionals they consult; and</li>\n\t<li>access to home care and safe long-term care so Canadians can age safely and live in dignity.</li>\n</ul>\n\n<p>While provinces and territories are already taking steps to advance work on these shared priorities, Canadians expect more concrete actions to improve health care services. The funding announced today can help accelerate progress.</p>\n\n<p>Canadians deserve to know what progress is being made. That is why to access their share of the federal funding, including the 5 per cent CHT guarantee, provincial and territorial governments are asked to commit to improving how health information is collected, shared, used, and reported to Canadians to promote greater transparency on results, and to help manage public health emergencies. Canadians should be able to access their own health information and benefit from it being shared between health workers, across health settings, and across jurisdictions. That is why provinces and territories are also asked to agree to adopt common standards and policies related to data.</p>\n\n<p>The Government of Canada recognizes that provinces and territories have their own unique circumstances. As such, bilateral agreements are intended to be flexible, and provinces and territories will have options to tailor these agreements to address the unique needs of their populations and geography. As part of these agreements, provincial and territorial governments are asked to develop action plans that will outline how funds will be spent and how progress will be measured. Investments are to be centered around the following four shared health priorities: family health care; health workforce and backlogs; mental health and substance use; and modernizing the health care system with standardized information and digital tools. Each province and territory will have flexibility in designing their action plans, including the addition of targeted results with indicators that are tailored to their realities.</p>\n\n<p>During the COVID-19 pandemic, we showed that we can work together to tackle big challenges. The Government of Canada will continue to work in collaboration with provinces and territories on next steps, in the best interest of Canadians, their families, and health care workers. We will work to deliver concrete outcomes for Canadians and improve the health care system that Canadians value and depend on.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is about strengthening our health care system to address existing challenges and provide Canadians with the safe, high-quality care they need and deserve, including when it comes to mental health. Building on the lessons of the pandemic, we will continue to take a Team Canada approach to deliver the best results for patients, support our health care workers, and protect our health care system now and into the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“It is clear to Canadians that we need to invest in strengthening Canada’s public health care system and ensure better health care outcomes for Canadians across the country. The investments we are prepared to make today will help Canadians access the high quality, public, and timely health care they deserve.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians deserve better health care and we need immediate actions to address current and future challenges. These investments will support those actions so that people have timely access to family health services and that we have less people waiting for treatments, diagnosis, and surgeries, and more mental health and substance use services across the country. We must also work together to collect, share, and use health information to strengthen and improve the delivery of health care while continuing to support our health care workers.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government continues to work with our partners across the country to build a better health care system. Today’s working meeting builds on our shared objective of ensuring all Canadians, regardless of where they live or their ability to pay, can access the care they need, when they need it. I look forward to working with our provincial and territorial partners in the coming weeks to deliver on Canadians’ priorities.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“Mental health is health, and through these bilateral agreements, we are working with provinces and territories to integrate mental health and substance use care as a full and equal part of our universal health care system. These agreements will work to provide greater access to mental health services, reduce substance use harms, and lower stigma. Together, we must ensure that all Canadians have access to supports and services for their mental health and well-being – when they need them, wherever they need them.”</p>\n\n<footer class=\"default\">The Hon. Carolyn Bennett, Minister of Mental Health and Addictions and Associate Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Canada Health Transfer (CHT) is the largest major federal transfer to provinces and territories. It provides long-term, predictable funding for health care and supports the principles of the <em>Canada Health Act</em>. CHT payments are made on an equal per capita basis to provide comparable treatment for all Canadians, regardless of where they live. The CHT grows in line with a three-year moving average of nominal gross domestic product, with total funding guaranteed to increase by at least 3 per cent per year. In 2023-24, the federal government will provide a total of $49.4&nbsp;billion to provinces and territories under the CHT, an increase of 9.3 per cent, or $4.2&nbsp;billion, from 2022-23.</li>\n\t<li>The funding outlined today is in addition to $11&nbsp;billion in existing funding ($4.8&nbsp;billion remaining) through the 2017 bilateral agreements on Home Care and Mental Health (to 2026-27), and $3&nbsp;billion for long-term care provided in Budget&nbsp;2021.</li>\n\t<li>As part of today’s announcement, the Government of Canada will provide $505&nbsp;million over five years to the Canadian Institute for Health Information, Canada Health Infoway, and federal data partners to work with provinces and territories on developing new health data indicators, and to support the creation of a Centre of Excellence on health workforce data and underpin efforts to use data to improve health care.</li>\n\t<li>The CHT, along with historical tax point transfers for health to provinces and territories dating back to the 1970s, accounts for nearly one third of all the money provinces and territories spend on health care. The value of these tax points is $25&nbsp;billion in 2022-23.</li>\n\t<li>In addition to the CHT, the Government of Canada has made significant targeted investments to support health systems, including more than $72&nbsp;billion over the course of the COVID-19 pandemic to protect the health and safety of Canadians. More than eight out of every 10 dollars provided to fight COVID-19 and support Canadians was provided by the federal government.</li>\n\t<li>The federal government works collaboratively and in partnership with Indigenous partners and communities to support improved access to high quality, culturally appropriate health services, greater Indigenous control of health services, and improved health outcomes. Each year, the government invests approximately $5&nbsp;billion in Indigenous health. This includes important new investments announced since 2021 to support further progress, including:\n\t<ul class=\"Indent1 bulletOutline\">\n\t\t<li>$354&nbsp;million over five years to increase the number of nurses and other medical professionals in remote and isolated First Nations communities;</li>\n\t\t<li>$250&nbsp;million over five years to further support recruitment and retention of health professionals on reserve;</li>\n\t\t<li>$825&nbsp;million over three years for distinctions-based mental health and wellness strategies;</li>\n\t\t<li>$127&nbsp;million over three years to foster health systems free from racism and discrimination; and</li>\n\t\t<li>$107&nbsp;million over three years to continue efforts to transform how health services are designed and delivered by First Nations communities.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/news/2023/02/working-together-to-improve-health-care-for-canadians.html\">Backgrounder – Working together to improve health care for Canadians</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/services/canada-health-care-system.html\">Canada’s health care system</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/canada-health-transfer.html\">Canada Health Transfer</a></li>\n\t<li><a href=\"https://laws-lois.justice.gc.ca/eng/acts/c-6/page-1.html\"><em>Canada Health Act</em></a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}