{
  "path": "/en/news/news-releases/2017/10/19/governor-general-travel-thailand-royal-cremation-king-bhumibol",
  "pageTitle": "Governor General to travel to Thailand for the Royal Cremation of King Bhumibol | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency, the Right Honourable Julie Payette, Governor General of Canada, will travel to Bangkok, Thailand as Canada’s official representative at the Royal Cremation of the late King Bhumibol Adulyadej of Thailand on October 26, 2017.</p><p>The Royal Cremation of King Bhumibol follows one year of official mourning since his passing last year at the age of 88.</p><p>Under King Bhumibol’s rule, our two countries became closer partners and our people-to-people connections grew stronger. Canada firmly believes that our long-term relationship must be built on the fundamental values of democracy and respect for human rights.‎</p><h2>Quote</h2><blockquote><p>“During his remarkable seventy-year reign, King Bhumibol devoted himself to improving the lives of the Thai people and was a true partner for Canada. On behalf of all Canadians, the Governor General will pay respects to this historic leader.” <br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>King Bhumibol made a Royal Visit to Canada in 1967, along with Her Majesty Queen Sirikit of the Kingdom of Thailand, for the centennial anniversary of Confederation and Montreal Expo ‘67.</li><li>The last meeting between a Canadian Prime Minister and King Bhumibol occurred during Prime Minister Jean Chrétien’s visit to Thailand in 1997.</li><li>People-to-people connections between Canada and Thailand are strong. Approximately 18,600 Thais visited Canada in 2016 for tourism, study, or employment purposes. An estimated 6,000 Canadians reside in Thailand and more than 250,000 Canadians visited Thailand as tourists in 2016.&nbsp;</li><li>Canada’s first Ambassador to Thailand was appointed in 1961 and the first resident Ambassador established the Embassy of Canada in Bangkok in 1967. Today Thailand is also represented by the Royal Thai Embassy in Ottawa, a Consulate-General in Vancouver, and honorary Consulates-General in Edmonton, Toronto, and Montréal.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/thailand-thailande/bilateral_relations_bilaterales/canada-thailand-thailande.aspx?lang=eng\">Canada-Thailand relations</a></li></ul></div>\n      "
}