{
  "path": "/en/news/statements/2021/06/21/statement-prime-minister-national-indigenous-peoples-day",
  "pageTitle": "Statement by the Prime Minister on National Indigenous Peoples Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous Peoples Day:</p>\n\n<p>“Today, on <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1100100013248/1534872397533\">National Indigenous Peoples Day</a>, we invite all Canadians to learn and celebrate the vibrant and diverse cultures, languages, and beautiful traditions of First Nations, Inuit, and Métis peoples. We also recognize the important contributions Indigenous peoples have made, and continue to make, to Canada.</p>\n\n<p>“As the longest day of the year, the summer solstice has held deep cultural, historical, and spiritual significance for many Indigenous peoples and communities for generations. And it was 25 years ago that the Government of Canada joined Indigenous organizations in choosing June 21 to celebrate National Indigenous Peoples Day.</p>\n\n<p>“While today is a time to celebrate Indigenous peoples from coast to coast to coast, it is also an opportunity to acknowledge that there is much more work to do on the important journey to reconciliation. The recent tragic findings of remains near the former Kamloops Residential School serve as a stark reminder of the systemic oppression, inequalities, and discrimination that Indigenous peoples have endured over the past years, decades, and centuries, and the injustices and challenges they continue to face today.</p>\n\n<p>“Under the residential school system, at least 150,000 Indigenous children were forcibly separated from parents and communities, and carried off to places where their languages and culture were prohibited in an attempt to intentionally eliminate them. These children suffered emotional, physical, and sexual abuse. The Truth and Reconciliation Commission also reported that thousands of children who were sent to these schools never returned home. The exact number of children who died may never be known and, devastatingly, many parents never found out what happened to their children. This intergenerational trauma experienced by families continues to today and we must continue to ensure that the necessary <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1622742779529/1622742809449\">supports</a> for those who have been retraumatized by the recent events are provided. We must never forget those innocent souls lost – this must be our collective commitment toward reconciliation.</p>\n\n<p>“The Government of Canada continues to call on the Catholic Church to issue a formal apology to Indigenous peoples impacted by the residential school system. Taking responsibility is one of the Calls to Action of the Truth and Reconciliation Commission, and is an essential step to advancing truth and reconciliation in Canada.</p>\n\n<p>“We must also acknowledge, honour, and respect those who have passed. We recently made the National Day for Truth and Reconciliation, September 30, a federal holiday. The goal is to encourage Canadians to learn about and reflect on our country’s history and present day truths, as well as to commemorate the survivors, their families, and their communities – as called for by the Truth and Reconciliation Commission and Indigenous leaders.</p>\n\n<p>“Saying sorry for these tragedies is not enough. We need to right past wrongs and address ongoing challenges, and we can only accomplish this with action. That is why the Government of Canada has been working in partnership with Indigenous peoples, provinces, and territories to implement the Truth and Reconciliation Commission’s Calls to Action. Seventy-six of the report’s 94 Calls to Action fall under the sole or shared responsibility of the federal government and over 80 per cent of them have been completed or are well underway, and it is our priority to complete those Calls to Action.</p>\n\n<p>“On June 3, two years after the release of <em>Reclaiming Power and Place: The Final Report of the National Inquiry into Missing and Murdered Indigenous Women and Girls, </em>the Government of Canada released the Federal Pathway. This is the government’s contribution to the <em>2021 National Action Plan: Ending Violence Against Indigenous Women, Girls and 2SLGBTQQIA+ People</em>. Budget 2021 also<em> </em>proposes historic investments that will support the implementation of the initiatives in the Federal Pathway, create a safer future for Indigenous peoples, and contribute to ending this national tragedy.</p>\n\n<p>“It is the responsibility of the Government of Canada to make significant change within our federal institutions. We must continue to review our laws and policies to see how we can improve outcomes for Indigenous peoples and for all Canadians, and rebuild or develop laws and policies accordingly in partnership with Indigenous peoples.</p>\n\n<p>“We are putting those words into action. Today, the Parliament will pass legislation to advance the implementation of the United Nations Declaration on the Rights of Indigenous Peoples. Indigenous leaders, the Truth and Reconciliation Commission, and the National Inquiry into Missing and Murdered Indigenous Women and Girls have all said that the Declaration is a roadmap for the federal government to work in partnership with Indigenous peoples to advance reconciliation. This new law is a historic step toward fully recognizing, respecting, and protecting the human rights of Indigenous peoples. By implementing the Declaration, we are advancing social and economic equality, promoting economic participation, and protecting Indigenous governance and laws, lands and territories, and cultures and languages.</p>\n\n<p>“We’ve also made real progress to address ongoing challenges and to close the gaps that still exist for Indigenous peoples and communities. Through Jordan’s Principle, the federal government is committed to providing First Nations children living on and off reserve with equitable access to government-funded public services. Since 2016, more than 911,000 products, services, and supports were approved under Jordan's Principle. These included speech therapy, educational supports, medical equipment, mental health services and more. We also remain committed to working with our Indigenous partners to support Indigenous students’ access to a safe and high-quality education that meets their unique needs and helps them get the best start in life. And with the support of the Government of Canada, First Nations communities have lifted more than 100 long-term drinking water advisories. This progress is just a few examples of what we have accomplished, but there’s much more to do.</p>\n\n<p>“All of us have a role to play in telling the truth of our past and addressing the systemic injustices that Indigenous peoples and communities still face today. The Government of Canada will continue to work to do better so Indigenous peoples across this country feel safe and respected, and have a real and fair chance at success. Only through concrete actions, and by working together, will we build a better path forward.”</p></div>\n      "
}