{
  "path": "/en/news/news-releases/2022/04/06/prime-minister-co-chair-united-nations-sustainable-development-goals",
  "pageTitle": "Prime Minister to co-chair the United Nations Sustainable Development Goals Advocates group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Building a future that is fair, equal, and peaceful, with clean air and clean water for everyone, is at the heart of the United Nations Sustainable Development Goals (SDGs). All UN member States adopted the 17 SDGs as part of a shared blueprint that focuses on ending poverty, improving health and education, reducing inequality, spurring economic growth – all while tackling climate change and protecting the environment.</p>\n\n<p>Today, Prime Minister Justin Trudeau announced that, at the invitation of the United Nations Secretary-General António Guterres, he and the Prime Minister of Barbados, Mia Mottley, will be co-chairing the Sustainable Development Goals Advocates group.</p>\n\n<p>SDG Advocates work to raise global awareness of the Sustainable Development Goals and the need for accelerated action by using their respective platforms. Advocates include academics, politicians, artists, musicians and more, from around the world.</p>\n\n<p>As co-chair, the Prime Minister will continue to advocate for the important global issues that he champions on the world stage, including fighting climate change, protecting nature, and empowering women and girls all over the world. The Prime Minister will bring attention to these critical challenges alongside SDG Advocates and partners.</p>\n\n<p>This is an opportunity for Canada to reinforce its commitment to the <a href=\"https://sdgs.un.org/2030agenda\">2030 Agenda for Sustainable Development</a> at home and abroad, and to achieve an inclusive and resilient recovery from the pandemic, one that will create a more peaceful, prosperous, and sustainable future that leaves no one behind.</p>\n\n<p>In February 2021, the Government of Canada released the <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy,</a> which aims to create and foster a whole-of-society approach to accelerate progress on the SDGs, in Canada and abroad. The strategy respects the inherent rights of Indigenous Peoples, and mobilizes academia, the private sector, civil society and international partners, to build a better future for everyone.</p>\n\n<p>Women and girls, Indigenous Peoples, persons with disabilities, and other marginalized groups have borne the brunt of the pandemic, and of growing inequality across the world. That’s why Canada will continue to take a gender-responsive approach to its international implementation of the 2030 Agenda through its Feminist Foreign Policy, including the Feminist International Assistance Policy.</p>\n\n<p>The pandemic has taught us we need to make better decisions regarding the planet’s resources and its biodiversity. Working together, we can reinforce the three pillars of sustainable development – social, economic, and environmental – to protect the planet for future generations.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Sustainable Development Goals are a path forward for Canada and the world that leaves no one behind. As co-chair of the SDG Advocates group, I look forward to rallying countries, governments, the private sector, and others, to come together to accelerate our progress and continue to raise our voices - and our ambition - on the way to 2030.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada’s 2030 Agenda National Strategy seeks to advance progress on the SDGs through widespread, collaborative engagement and action. The intended result is all partners contributing in their unique ways and with others toward achieving the SDGs.</li>\n\t<li>The 2030 Agenda provides a comprehensive framework to build a more resilient, inclusive, and sustainable future.</li>\n\t<li>The 2030 Agenda highlights the importance of ensuring the benefits of sustainable development reach everyone. It highlights the centrality of achieving gender equality and empowering all women and girls in realizing the SDGs. It is relevant across all regions of Canada and in communities of all kinds. It matters to remote communities in the North, across rural and coastal Canada, and in towns and cities of all sizes.</li>\n\t<li>Canada is helping to realize the SDGs around the world with attention to progress on eradicating poverty and inequality, promoting and protecting human rights, enabling access to health care and services, education, energy, inclusive and sustainable economic growth and decent jobs, action to address climate change and leveraging fair and inclusive trade to raise incomes and broaden its benefits for under-represented groups, such as women and Indigenous Peoples.</li>\n\t<li>Canada believes that promoting rights-based, open, and inclusive societies is an effective way to build a safer and more prosperous world. All people should have the opportunity to fully benefit from equal participation in economic, political, social and cultural life.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://sdgs.un.org/\">United Nations - Sustainable Development</a></li>\n\t<li><a href=\"https://sdgs.un.org/2030agenda\">Transforming our world: the 2030 Agenda for Sustainable Development</a></li>\n\t<li><a href=\"https://www.unsdgadvocates.org/\">SDG Advocates</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li>\n</ul></div>\n      "
}