{
  "path": "/en/news/readouts/2022/05/16/prime-minister-justin-trudeau-meets-mayor-regina-sandra-masters",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Regina Sandra Masters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of Regina, Sandra Masters.</p>\n\n<p>The two leaders discussed a range of shared priorities, including building green infrastructure, growing a cleaner, greener economy, improving access to affordable housing, advancing reconciliation, enhancing research partnerships and opportunities, and attracting and retaining talent.</p>\n\n<p>The Prime Minister and Mayor discussed priorities outlined in the City’s Community Safety &amp; Well-being Plan as well as the need to tackle homelessness and to continue partnering on making housing more affordable for the residents of Regina. They also discussed the investment of $300 million proposed in the federal government’s Budget 2022 to support an Urban, Rural and Northern Indigenous Housing Strategy, and indicated their interest in working collaboratively to better serve Regina’s urban Indigenous community.</p>\n\n<p>The Prime Minister updated the Mayor on the federal government’s ongoing efforts to upgrade critical infrastructure across Canada.</p>\n\n<p>The Prime Minister and Mayor looked forward to their continued collaboration on these priorities and other issues that are important to the people of Regina and Saskatchewan, and to all Canadians.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget 2022</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/moving-forward-on-reconciliation.html\">Budget 2022: Moving Forward on Reconciliation</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget 2022: Making Housing More Affordable</a></li>\n</ul></div>\n      "
}