{
  "path": "/en/news/statements/2022/01/27/statement-prime-minister-international-holocaust-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on International Holocaust Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Holocaust Remembrance Day:</p>\n\n<p>“Today, on <a href=\"https://en.unesco.org/commemorations/holocaustremembranceday\">International Holocaust Remembrance Day</a>, we remember and pay tribute to the more than six million Jews who were systematically persecuted and murdered by the Nazis during the Holocaust, and the millions of other victims of Nazi atrocities. We offer our deepest sympathies to their families and loved ones and recommit our efforts to keep their memory alive for future generations.</p>\n\n<p>“In 2005, the United Nations General Assembly designated January 27 as a day of remembrance to mark the liberation of Auschwitz-Birkenau, the largest Nazi concentration and extermination camp. On this day, we also honour the brave survivors, and recognize the heroes who risked their lives to save others during the dark days of the Holocaust. We will continue to share their stories of courage, hope, and perseverance against unspeakable evil, so that the pain and loss endured during the Shoah will never be forgotten.</p>\n\n<p>“One of the darkest chapters in history, the Holocaust is a stark reminder of the dangers of allowing antisemitism, xenophobia, prejudice, and discrimination to spread unchallenged. It also reminds us that silence must never be an option when humanity is threatened. Sadly, more than 75 years after the liberation of Auschwitz-Birkenau that revealed to the entire world the horrors born of racism, hate, and indifference, antisemitism is still a lived reality for Jewish communities in Canada and around the world.</p>\n\n<p>“The Government of Canada strongly opposes and condemns the disturbing rise of antisemitism at home and abroad. Reinforcing our efforts to advance Holocaust awareness, remembrance, and research, and to combat antisemitism is essential to promoting and protecting human rights globally. That is why, in 2021, we announced the reappointment of the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism. That same year, during the Malmö International Forum on Holocaust Remembrance and Combating Antisemitism, <a href=\"https://www.canada.ca/en/canadian-heritage/services/canada-holocaust/canada-pledges.html\">Canada made concrete pledges</a> to strengthen Holocaust remembrance efforts and to combat antisemitism and hatred. In support of those commitments, the government will lead the development of a companion handbook to the International Holocaust Remembrance Alliance’s working definition of antisemitism, which we adopted as part of Canada’s <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a>. This handbook will help support the adoption, understanding, and practical use of the definition across Canada, as we seek to combat the multifaceted nature of modern antisemitism. Last year, we also hosted the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat/national-summits.html\">National Summit on Antisemitism</a> to better understand the pervasiveness of antisemitism in Canada and identify actions the government can take to address key issues facing Jewish communities. And we are fighting antisemitism, disinformation, and online hate by supporting the international Inter-Parliamentary Task Force to Combat Online Antisemitism, the <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a>, the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, and other initiatives that combat antisemitism and hate in Canada and around the world.</p>\n\n<p>“In 2021, the government recommitted to the principles of the Declaration of the Stockholm International Forum on the Holocaust and supported the adoption of the 2020 International Holocaust Remembrance Alliance Ministerial Declaration. This year, as part of a strengthened and renewed Anti-Racism Strategy, we will be launching a National Action Plan on Combatting Hate that includes actions to combat hate crimes, training and tools for public safety agencies, and investments to support digital literacy, prevent radicalization to violence, and protect vulnerable communities. We will continue to work with the Jewish community to combat antisemitism, Holocaust denial and distortion, and all other forms of discrimination, to ensure that Jewish Canadians can live proudly and openly in our country. Together, we will persevere to build a better Canada where we celebrate diversity, compassion, and inclusion as our strengths.</p>\n\n<p>“Today, as we pause to remember and honour the victims and survivors of the Holocaust, I invite all Canadians to join me in reaffirming and strengthening our resolve to combat antisemitism and all forms of discrimination, wherever and whenever they occur. We all have a responsibility to stop the seeds of intolerance and hate from taking root or spreading in our communities, our country, and our world. On this day, let us all come together and repeat the vow ‘Never Again’.”</p></div>\n      "
}