{
  "path": "/en/news/news-releases/2016/11/27/prime-minister-announces-significant-support-africa-and-la",
  "pageTitle": "The Prime Minister announces significant support for Africa and La Francophonie at the XVI Summit of La Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>While attending the XVI Summit of La Francophonie in Madagascar, Prime Minister Justin Trudeau today announced that the Government of Canada will provide $112.8&nbsp;million for international aid projects that will benefit several African countries and Haiti.</p><p>This funding will contribute to projects that aim to fight climate change, empower women, and&nbsp;protect their rights. It will also be used to stimulate economic growth, which will create job opportunities for young people and women, and to counter terrorism and prevent radicalization.</p><p>During the Summit, the Prime Minister held discussions with his counterparts from countries of La Francophonie on issues related to the Summit’s theme – <em>Shared Growth and Responsible Development: Conditions for Stability Around the World and Within La Francophonie</em><em>.</em></p><p>The Prime Minister also highlighted that Ontario has been granted observer status in the Organisation internationale de la Francophonie (OIF). This bolsters Canadian representation in the OIF and will provide greater exposure for Franco-Ontarian communities on a global scale.</p><h2>Quote</h2><blockquote><p><em>“Canada’s participation in the Summit is in keeping with our desire to revitalize our commitment to La Francophonie and Africa. Working together with other member and observer States and governments, we can better address the numerous challenges that face members of La Francophonie, from climate change, to gender inequality, to human rights – including LGBTQ2 issues. Canada congratulates Madagascar on a successful Summit of La&nbsp;Francophonie.”<br></em><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><strong><br></strong>Quick Facts</h2><ul><li>Africa plays a leading role within La Francophonie. The previous two summits (Kinshasa in 2012 and Dakar in 2014) took place in Africa. African countries account for 29 of the 54&nbsp;full members.</li><li>In addition to Ontario, La Francophonie also welcomed Argentina and South Korea as observers, and New Caledonia as an associate member.</li><li>The governments of Quebec, New Brunswick and Ontario are represented at the XVI&nbsp;Summit of La Francophonie respectively by premiers Philippe Couillard and Brian Gallant, as well as by Marie-France Lalonde, Minister responsible for Francophone Affairs (Ontario).</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2016/11/27/prime-minister-announces-significant-support-international-aid-while\">Fact Sheet: The Prime Minister announces significant support for international aid while attending the XVI&nbsp;Summit of La Francophonie</a></li></ul><h2>Associated Links:</h2><ul><li><a href=\"http://www.international.gc.ca/franco/event-evenements.aspx?lang=frahttp://www.international.gc.ca/development-developpement/humanitarian_response-situations_crises/foodassistance-assistancealimentaire.aspx?lang=eng\">Major La Francophonie Events – 2016 Francophone Summit in Antananarivo, Madagascar</a></li><li><a href=\"http://www.international.gc.ca/franco/index.aspx?lang=eng\">Canada in La Francophonie</a></li><li><a href=\"http://www.francophonieantananarivo-2016.mg/\">XVI Summit of La Francophonie 2016</a>&nbsp;(Available in French only)</li></ul></div>\n      "
}