{
  "path": "/en/news/readouts/2021/04/13/prime-minister-justin-trudeau-speaks-leader-new-democratic-party-jagmeet",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Leader of the New Democratic Party Jagmeet Singh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Leader of the New Democratic Party, Jagmeet Singh, ahead of next week’s budget.</p>\n\n<p>The Prime Minister provided an update on the COVID‑19 situation in Canada and discussed the budget’s priorities. Mr. Singh presented the Prime Minister with his party’s views for the upcoming federal budget.</p>\n\n<p>The Prime Minister emphasized the need for all parties in the House of Commons to work together in order to pass important pieces of legislation, including on measures designed to help millions of Canadians through the pandemic, on our net-zero commitment, UNDRIP, and on ending conversion therapy. He also highlighted the importance of continuing to support vulnerable people and address inequalities. The Prime Minister reiterated that the environment and the economy go hand-in-hand. He indicated that keeping Canadians healthy and safe, creating jobs, and ensuring a strong recovery for the middle class remain priorities for the government.</p>\n\n<p>This meeting follows the Deputy Prime Minister’s consultations with the opposition parties, as part of an ongoing engagement.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/announcement-annonce/home-accueil-en.html\">Budget 2021</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">Coronavirus disease (COVID-19): Canada’s response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/net-zero-emissions-2050.html\">Net-Zero Emissions by 2050</a></li>\n\t<li><a href=\"https://www.justice.gc.ca/eng/declaration/index.html\">Implementing the United Nations Declaration on the Rights of Indigenous Peoples in Canada</a></li>\n</ul></div>\n      "
}