{
  "path": "/en/news/statements/2021/06/13/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Public Service Week, which runs from June 13 to 19, 2021:</p>\n\n<p>“Today marks the start of <a href=\"https://www.canada.ca/en/treasury-board-secretariat/services/innovation/awards-recognition-special-events/national-public-service-week.html\">National Public Service Week</a>, an opportunity to recognize all public servants across the country for their hard work and their important contributions in their service to Canadians.</p>\n\n<p>“The National Public Service Week’s theme is ‘Proudly Serving Canadians’. Every day, federal public servants rise to the challenge of delivering timely, effective programs and services that support the work of the Government of Canada and meet the needs of Canadians. Over the past year, they worked to defend and protect our country’s interests and values, and helped implement new government policies, initiatives, and programs aimed at improving the lives of Canadians. They also supported the government response to natural disasters, including flooding in the Northwest Territories.</p>\n\n<p>“Since the start of the global COVID-19 pandemic, federal public servants have supported the government’s efforts to minimize the impact of this public health crisis. They have helped deliver the government’s emergency financial and economic assistance, as well as the procurement and pan-Canadian coordination of COVID-19 vaccines, therapeutics, and other supplies. They have also supported COVID-19 data tracking and enhanced testing and research for the virus, implemented border measures, assisted Canadians stranded abroad, and helped fight the pandemic worldwide.</p>\n\n<p>“Federal public servants have continued to show their unwavering professionalism and creative thinking, adapting the way they work to ensure that they could continue to deliver essential services to Canadians when they needed them the most. They are challenging conventional ways of doing things, adopting new technology, and finding innovative ways to support the government’s efforts to keep Canadians healthy and safe, and our businesses open.</p>\n\n<p>“Federal public servants continue to set an example for service excellence. I am proud of their innovation and inspired by their dedication to their fellow Canadians. The Government of Canada will continue to work to ensure that the federal public service has the right people and resources to serve Canadians and their country well. We will also work to make sure that our federal public service is more diverse and inclusive and truly representative of the people it serves.</p>\n\n<p>“To our federal public servants, I say thank you. Your hard work, creativity, and commitment to Canada will help us come out of this pandemic a stronger and more resilient country. I look forward to continuing to work with you as we tackle today’s challenges, for the benefit of all Canadians.”</p></div>\n      "
}