{
  "path": "/en/news/statements/2015/12/02/statement-prime-minister-canada-appointment-parliamentary-secretaries",
  "pageTitle": "Statement by the Prime Minister of Canada on the appointment of Parliamentary Secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after the appointment of 35 parliamentary secretaries:</p>\n<p>“In order to build a country that works for everyone, you need a strong and diverse team. Today I have the pleasure of announcing that 35 remarkable Canadians will be taking on new and expanded responsibilities. These highly motivated individuals, who come from a variety of backgrounds and communities across our great country, bring a wealth of talent and experience to the table that will complement existing Cabinet strengths.</p>\n<p>“Canadians voted for new leadership and a new tone in Ottawa. They told us what is important to them and our whole team will work together with other parliamentarians, other orders of government, and Indigenous communities to deliver a plan to address their priorities. We are focused on growth for the middle class, open and transparent government, a sustainable environment and economy, further strengthening Canada’s diversity, and balancing security and opportunity.</p>\n<p>“Each Minister has been assigned a parliamentary secretary to work hand-in-hand with them. Additionally, we will be introducing legislation to formalize the equal status of our ministerial team sitting around the Cabinet table.</p>\n<p>“I am also pleased to announce the appointment of Ginette Petitpas Taylor, as Deputy Government Whip, and Arnold Chan, as Deputy Government House Leader.</p>\n<p>“Our extraordinary team of Canadians will work tirelessly to honour the trust Canadians have given us. Together, we will build an even better future for our children and grandchildren.”</p>\n<p>The biographies of the new parliamentary secretaries can be found <a href=\"http://pm.gc.ca/sites/pm/files/docs/parliamentary_secretaries_e.pdf\">here</a>.&nbsp;</p>\n<p>For more on parliamentary secretaries, please consult: <a href=\"/en/news/backgrounders/2015/11/27/open-and-accountable-government\">Open and Accountable Government</a></p>\n<p>Please also consult: <a href=\"/en/news/news-releases/2015/11/13/prime-minister-canada-makes-ministerial-mandate-letters-public\">Prime Minister of Canada Makes Ministerial Mandate Letters Public</a></p></div>\n      "
}