{
  "path": "/en/news/news-releases/2016/06/13/government-canada-provide-immediate-support-indigenous-mental",
  "pageTitle": "Government of Canada to provide immediate support for Indigenous mental wellness | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced immediate and targeted mental wellness support for Indigenous communities. The Prime Minister made the announcement after meeting with youth from Nishnawbe Aski Nation.</p>\n<p>Some Indigenous communities in Canada – particularly those located in rural, remote and isolated areas – are facing distressing mental health and suicide crises. These communities too often lack proper access to vital services and support, and the service offerings that do exist are not always culturally-appropriate or properly aligned with community needs.</p>\n<p>New funding of approximately $69 million will support immediate measures that will provide urgently needed help and support while the Government of Canada works with Indigenous Leaders in the context of the Health Accord to develop a long-term plan to address these important health issues.</p>\n<p><strong>Quotes</strong></p>\n<p>“I have spent much of the last few months meeting with and listening to members of Indigenous communities, and the loss of life to suicide and the feelings of despair being felt in their communities – especially by their youth – is tragic and completely unacceptable. We all need to work together to find effective, sustainable and culturally appropriate services and programs that address the very real challenges being confronted by these communities.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“While we will continue to engage Indigenous partners in finding long-term solutions to these pressing issues, we know that urgent action is needed – and it is needed now - to address the health and mental wellness crises being faced by Indigenous people.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Government of Canada currently provides close to $300 million annually for community-based mental health and addictions programming on-reserve and in the territories.</li>\n<li>This new funding – to be provided over three years – will support various measures, including:\n<ul>\n<li>Four crisis response teams to provide surge capacity for rapid response services and crisis coordination in regions located in Ontario, Manitoba and Nunavut identified as having the greatest need;</li>\n<li>An increase of mental wellness teams from 11 to 43 for communities most at-risk in order to strengthen existing community supports;</li>\n<li>Training for existing community-based workers to ensure that care services are provided in a culturally appropriate and competent way; and</li>\n<li>The establishment of a 24-hour culturally safe crisis response line.</li>\n</ul>\n</li>\n<li>New measures will also involve working in close collaboration with Inuit partners to develop a community-led suicide prevention approach.</li>\n<li>Additionally, funding has been provided for two permanent mental health workers to deliver care in Attawapiskat.</li>\n</ul></div>\n      "
}