{
  "path": "/en/news/news-releases/2018/07/19/prime-minister-host-first-ministers-meeting",
  "pageTitle": "Prime Minister to host First Ministers’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will host a First Ministers’ Meeting (FMM) in the fall.</p><p>At the FMM, First Ministers will discuss ways to build on Canada’s economic growth through diversifying international trade and improving trade within our borders.</p><p>The Prime Minister will lead discussions on how to eliminate barriers to trade between provinces and territories, and work toward a stronger, more interconnected Canadian economy that is free from unnecessary barriers and restrictions imposed by provinces and territories.</p><p>The FMM is an important opportunity for federal, provincial, and territorial leaders to discuss shared priorities, strengthen collaboration, and work together to make life better for all Canadians.</p><h2>Quotes</h2><blockquote><p>“Foreign companies shouldn’t have easier access to Canadian markets than Canadian companies from another province. I look forward to sitting down with Premiers to discuss ways we can create an even stronger, more interconnected economy, and create good, middle class jobs in every region of the country.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our country works best when we work together. Removing trade barriers between provinces and territories is key to growing our economy and creating jobs. We look forward to these discussions on how to best ensure prosperity for middle class Canadians.”<br><cite>—The Hon. Dominic LeBlanc, Minister of Intergovernmental and Northern Affairs and Internal Trade</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In 2017, federal, provincial, and territorial governments negotiated a historic Canadian Free Trade Agreement to improve the flow of goods, services and investments across provincial and territorial borders, giving consumers more choice and lower prices. It also committed all governments to work together to reduce the rules and regulations that hinder trade within Canada and stifle the growth of Canadian businesses.</li><li>Internal trade accounts for just under one-fifth of Canada's annual gross domestic product, or $370 billion. It also accounts for almost 40 per cent of all provincial and territorial exports.</li><li>Estimates suggest that removing interprovincial trade barriers could result in an economic benefit roughly comparable to the projected benefit of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</li><li>For businesses to succeed internationally, it is important for them to first establish a stable and supportive market at home.</li><li>Internal trade also helps protect Canada against the uncertainties of the global economy.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://canadaspremiers.ca/en/\">Canada’s Premiers</a></li></ul></div>\n      "
}