{
  "path": "/en/news/statements/2021/12/08/statement-prime-minister-formation-new-government-germany",
  "pageTitle": "Statement by the Prime Minister on the formation of a new government in Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in Germany:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Chancellor Olaf Scholz on the formation of a new government in Germany.</p>\n\n<p>“Our two countries have enjoyed a strong and profound relationship, rooted in close cultural and people-to-people ties, shared values of diversity and democracy, as well as a commitment to multilateralism. We are allies and partners on the world stage, including at the G7, G20, NATO, Organisation for Economic Co-operation and Development, and World Trade Organization. Over the years, we have joined efforts on a number of common priorities, such as combatting climate change, advancing international peace and security, and creating trade and investment opportunities. More recently, we closely coordinated our responses to address the humanitarian crisis in Afghanistan and worked together to ensure safe passage out of the country for foreign nationals and Afghans at risk.</p>\n\n<p>“I look forward to working with Chancellor Scholz and his government to continue strengthening the tight bonds and long-lasting relationship between Canada and Germany. As we recover from the COVID-19 pandemic, we will work together to build back better for Canadians and Germans alike, and deliver on the issues that matter most to them. Through the Canada-European Union Comprehensive Economic and Trade Agreement, we will continue to create good, middle class jobs and new opportunities on both sides of the Atlantic.</p>\n\n<p>“I want to thank Chancellor Angela Merkel, with whom I had the pleasure to work closely over the years, for her partnership and her invaluable contributions to advancing Canada-Germany relations. For 16 years, she has been a global champion for peace, security, and democracy, embodying so many of the values that we cherish as Canadians. I will miss her counsel and leadership, and wish her all the best in her future endeavours.”</p></div>\n      "
}