{
  "path": "/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition",
  "pageTitle": "Prime Minister Trudeau announces increased climate ambition | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Climate change is the greatest long-term threat that we face as a global community, but it is also our greatest economic opportunity. By taking bold climate action, we will create new jobs for the future, strengthen our economy, and grow the middle class, while also ensuring clean air and water for our kids and grandkids.</p>\n\n<p>During today’s Leaders Summit on Climate, Prime Minister Justin Trudeau, announced that Canada will enhance our emissions reduction target under the Paris Agreement – known as a Nationally Determined Contribution (NDC) – by 40-45% below 2005 levels, by 2030. As a signatory to the Paris Agreement, Canada’s NDC reflects its highest possible ambition in light of its current national circumstances.&nbsp;</p>\n\n<p>In his address, Prime Minister Trudeau also highlighted the importance of working with other global leaders to tackle climate change, create growth, and improve the well-being of all people. Climate change knows no borders, so every country must do its part to invest in a cleaner world. Going forward, Canada will continue to work closely with the United States and other countries to reach our ambitious climate goals, including through our Roadmap for a Renewed U.S.-Canada Partnership and the corresponding High Level Ministerial Dialogue on Climate Ambition.</p>\n\n<p>Today’s announcement builds on the $53.6 billion that the government has invested since October to establish Canada’s green recovery for the COVID-19 pandemic, create jobs, and secure a cleaner future for everyone.&nbsp; Budget 2021, announced this week, also builds on that approach, including through a new investment in Canada’s Net-Zero Accelerator that will incentivize Canadian business and industry to develop net-zero technologies, and build our clean industrial advantage.</p>\n\n<p>Budget 2021 also includes new measures to make life more affordable and communities more livable, by helping more than 200,000 Canadians make their homes greener and working towards conserving 30 per cent of Canada’s lands and oceans by 2030. These new measures will help Canada exceed its Paris climate targets, reduce pollution, and help us reach net-zero emissions by 2050.</p>\n\n<p>Since 2015, we have been committed to finding real solutions to help tackle the climate crisis, while also creating jobs, strengthening our economy, and growing the middle class. We have put a rising price on pollution that puts money back into the pockets of Canadians, made new investments in public transit, committed to reducing pollution by planting 2 billion trees, and banned harmful single-use plastics to protect our oceans. Together we will continue to take action in the fight against climate change and secure a better future for Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada understands that if you don’t have a plan to tackle climate change, then you don’t have a plan to create jobs and economic growth. Canada is a committed partner in the global fight against climate change, and together we will build a cleaner and more prosperous future for all.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s Strengthened Climate Plan put us on track to not just meet but to exceed our 2030 emissions goal – but we were clearly aware that more must be done. With time running out and with the global shift to a low-carbon economy turning into a sprint, Canadians have been calling for increased climate ambition.&nbsp; Canadians understand the need to ensure the future economic prosperity of our country and to ensure a sustainable future for our children and grandchildren. Canada is among the countries at the Summit stepping up its commitment to reduce emissions and accelerate the benefits of clean energy, clean technology and clean growth.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada will continue to support developing countries in their transition to a carbon neutral and nature positive future. Left unchecked, climate change and biodiversity loss will have a devastating effect on people, ecosystems and economies around the world. Now is the time for global climate action.”</p>\n\n<footer class=\"default\">\n<p>The Hon.&nbsp;Karina Gould, Minister of International Development</p>\n\n<p>&nbsp;</p>\n</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2021 includes $101.4 billion over three years in proposed investments as part of the Government of Canada’s growth plan that will create good jobs and support a resilient and inclusive recovery.</li>\n\t<li>From 2015 to 2019, the Government of Canada invested roughly $60 billion toward climate action and clean growth.</li>\n\t<li>Since October 2020, the Government of Canada has invested $53.6 billion into Canada’s green recovery.</li>\n\t<li>Under the Paris Agreement to the United Nations Framework Convention on Climate Change (UNFCCC), countries agreed to collectively strengthen the global response to climate change, including by limiting global warming to well below 2°C, while also pursuing efforts to limit warming to 1.5°C. Canada will formally submit its new NDC to the UNFCCC in the coming months.</li>\n\t<li>Canada has been steadfast in its commitment to support mitigation and adaptation efforts of developing countries, particularly the poorest and most vulnerable and, in the months ahead, will build on the $2.65 billion climate finance pledge made over the last five years with commitments that will help those already being affected by climate change to adapt.&nbsp;</li>\n\t<li>Canada has become a global leader in clean technology with 11 Canadian companies appearing on the 2021 Global Cleantech 100 list of the most innovative and promising clean technologies from around the world.</li>\n\t<li>The Leaders Summit on Climate is an important opportunity for heads of state and government to meet and discuss stronger climate action in the lead up to COP26 taking place this November in Glasgow.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2021/04/canadas-enhanced-nationally-determined-contribution.html\">Canada’s Enhanced Nationally Determined Contribution</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\"><em>Budget 2021 - A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/23/prime-minister-canada-welcomes-plan-revitalize-and-expand-ties-united\">Prime Minister of Canada welcomes plan to revitalize and expand ties with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}