{
  "path": "/en/news/readouts/2022/02/13/prime-minister-justin-trudeau-speaks-president-poland-andrzej-duda",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Poland Andrzej Duda | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Poland, Andrzej Duda, to discuss security concerns in Eastern Europe.</p>\n\n<p>The Prime Minister and President discussed their shared concerns about the continuing buildup of Russian military forces in and around Ukraine, as well as Russia’s ongoing aggression and destabilization activities. Prime Minister Trudeau reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine and emphasized that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions. Referencing their recent discussion with the President of the United States of America and European leaders, the Prime Minister and President emphasized the importance of coordination and unity among allies.</p>\n\n<p>The two leaders exchanged views on how best to support&nbsp;Ukraine, and both commented on the courage and determination of the Ukrainian people, especially in the face of continuing Russian military buildup along their borders.</p>\n\n<p>Prime Minister Trudeau underscored the remarkable cooperation between Canada and Poland, and President Duda thanked him for Canada’s friendship. The two leaders discussed ways in which they could collaborate in the future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/11/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with President of the United States of America Joe Biden and European leaders on Russia and the situation in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/minister-of-foreign-affairs-urges-canadians-to-leave-ukraine.html\">Minister of Foreign Affairs urges Canadians to leave Ukraine</a></li>\n</ul></div>\n      "
}