{
  "path": "/en/news/itineraries/2022/08/24/prime-ministers-itinerary-thursday-august-25-2022",
  "pageTitle": "Prime Minister’s itinerary for Thursday, August 25, 2022 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Cambridge Bay, Nunavut</h2>\n\n<p><strong>11:30 a.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, will arrive in Cambridge Bay.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>11:50 a.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will tour the Cambridge Bay North Warning System site. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity outside of the facility</li>\n</ul>\n\n<p><strong>12:30 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will participate in a Qulliq lighting ceremony. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>12:45 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will attend a luncheon. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>1:45 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will tour the Canadian High Arctic Research Station. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>2:30 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will participate in a family photo.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>2:45 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will attend a briefing and discussion with members of the Canadian Armed Forces. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity at the start of the meeting</li>\n</ul>\n\n<p><strong>3:35 p.m.&nbsp;</strong>The Prime Minister&nbsp;and the Secretary General of NATO, Jens Stoltenberg, will meet with local community members. Minister of National Defence Anita Anand, Minister of Foreign Affairs Mélanie Joly, and Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency Dan Vandal will also be in attendance.</p>\n\n<p class=\"Indent2\">Itqaumavik Park</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity at the start of the meeting</li>\n</ul></div>\n      "
}