{
  "path": "/en/news/statements/2022/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p>\n\n<p>“Today marks the start of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a>. It is a time to honour the legacy of Black Canadians, past and present, and to recognize and celebrate the significant contributions they continue to make to our country.</p>\n\n<p>“This year, the Government of Canada’s Black History Month theme is ‘February and Forever: Celebrating Black history today and every day.’ It invites us to pay tribute to, and learn more about, the important roles that Black Canadians have played in building and shaping a more prosperous, diverse, and inclusive Canada.</p>\n\n<p>“Black Canadians and their communities have a long history of being trailblazers and change makers. Among them is Dr.&nbsp;Alexandra Bastiany, an advocate for diversity in medicine who recently became Canada’s first Black woman interventional cardiologist. Twenty-one-year-old Alphonso Davies from Edmonton is taking the soccer world by storm. Born to Liberian parents, he came to Canada at the age of five. He now plays for the Canadian men’s national soccer team and is a Global Goodwill Ambassador for the United Nations High Commissioner for Refugees.</p>\n\n<p>“Black history is Canadian history. Canadians of African ancestry have been an integral part of the fabric of this land for centuries. While Black History Month is a time for learning and celebration, we cannot forget that people of African descent created Black History Month in opposition to anti‑Black racism, hate, and discrimination. Racism, hate, and discrimination continue to be a reality for many Canadians. We also know that the COVID-19 pandemic has further exposed social and economic fractures in Canada. Inequality, injustice, and inherent privilege still exist in our society, and we must continue to work together to build a better and more inclusive future for all Canadians.</p>\n\n<p>“As part of our strong commitment to combat all forms of anti‑Black racism and advance human rights and economic prosperity for Black Canadians, we officially recognized the <a href=\"https://www.un.org/en/observances/decade-people-african-descent\">United Nation’s International Decade for People of African Descent</a> (2015-24). And we are making it a priority to develop a whole‑of‑government action plan to ensure equality before the law, eradicate systemic racism, and improve the social, health, and economic well‑being of Black Canadians.</p>\n\n<p>“We continue to work in partnership with Black communities to advance this work. In 2020, we launched Canada’s first <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a> to support Black Canadian business owners and entrepreneurs – for whom barriers were exacerbated during the COVID-19 pandemic – as they grow their businesses, and to empower them to succeed into the future. We also committed to developing a Black Canadians Justice Strategy in consultation and cooperation with provinces, territories, and Black Canadians.</p>\n\n<p>“We will continue to build on historic investments to community organizations that are at the heart of Black Canadian communities. From recently supporting 1,400&nbsp;projects with Black-led organizations across Canada to moving forward with the implementation of the Black-led Philanthropic Endowment Fund. As part of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti‑Racism Strategy</a>, we continue to provide resources to communities and organizations to eliminate inequities and tackle racism.</p>\n\n<p>“On behalf of the Government of Canada, I encourage everyone to learn more about <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black Canadian history</a>, as we strive to make our country stronger, fairer, and more inclusive. Let’s aspire to be a society where all Black Canadians can succeed and prosper.”</p></div>\n      "
}