{
  "path": "/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need",
  "pageTitle": "Prime Minister announces further support to help Canadians in need | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians across the country are continuing to face challenges during this difficult time, particularly those who are most vulnerable to the health, social, and economic impacts of COVID-19. For many Canadians who were already struggling, it’s even harder now, and they are turning more and more to charities and non-profit organizations for help.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of $350 million to support vulnerable Canadians through charities and non-profit organizations that deliver essential services to those in need.</p>\n\n<p>The government has been working to put in place supports for all Canadians facing a tough situation. However, COVID-19 is having a disproportionate impact on those most vulnerable, creating a greater need for community-based organizations. To help these Canadians, the Government of Canada will provide additional support to charities and non-profit organizations through the Emergency Community Support Fund.</p>\n\n<p>The investment will flow through national organizations that have the ability to get funds quickly to local organizations that serve vulnerable populations. It will support a variety of activities, such as:</p>\n\n<ul>\n\t<li>Increasing volunteer-based home deliveries of groceries and medications</li>\n\t<li>Providing transportation services, like accompanying or driving seniors or persons with disabilities to appointments</li>\n\t<li>Scaling up help lines that provide information and support</li>\n\t<li>Helping vulnerable Canadians access government benefits</li>\n\t<li>Providing training, supplies, and other required supports to volunteers so they can continue to make their invaluable contributions to the COVID-19 response</li>\n\t<li>Replacing in-person, one-on-one contact and social gatherings with virtual contact through phone calls, texts, teleconferences, or the Internet</li>\n</ul>\n\n<p>With these further supports, we are making sure vulnerable Canadians feeling the financial and social impacts of COVID-19 can get the help they need, when they need it most. The government will continue to have the backs of organizations helping Canadians get through this difficult time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“While COVID-19 is affecting all Canadians, some people are more at risk to the impacts of the pandemic. Today’s announcement will further help our most vulnerable Canadians and ensure organizations have what they need to help. Canadians need to look out for one another in the these difficult times. We will get through this together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 crisis is having a real and significant impact on all Canadians. Today’s announcement will help ensure that if Canadians need the support of a community organization, it will be there for them.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>COVID-19 is having a disproportionate impact on vulnerable populations who may be less able to deal with the health, social, and economic impacts of the pandemic. Risks of stress, hardship, and abuse are expected to rise as people become unable to access the social and community supports on which they rely in their everyday lives.</li>\n\t<li>The Emergency Community Support Fund will provide funding to national intermediaries with networks across the country, including United Way Canada, the Canadian Red Cross, and the Community Foundations of Canada.</li>\n\t<li>These partners will disburse funds to local community-based organizations working with vulnerable populations, including seniors, persons with disabilities, members of LGBTQ2 communities, veterans, newcomers, women, children and youth, and members of Indigenous communities and racialized communities, such as Black Canadians.</li>\n\t<li>This announcement builds on the work that has been done for vulnerable Canadians, including increased support for those experiencing homelessness, help for women and children fleeing violence, counselling services for children and youth, and support for seniors.</li>\n\t<li>Charities and non-profit organizations are also able to apply for the 75 per cent wage subsidy that the government announced on March 27, 2020.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/03/prime-minister-announces-support-food-banks-and-local-food\">Prime Minister announces support for food banks and local food organizations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}