{
  "path": "/en/news/statements/2019/08/08/statement-prime-minister-canadas-ambassador-united-states",
  "pageTitle": "Statement by the Prime Minister on Canada’s Ambassador to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on Canada’s Ambassador to the United States, David MacNaughton:</p>\n\n<p>“It is with great affection and gratitude – and of course, considerable regret – that I have accepted Ambassador David MacNaughton’s decision to leave Washington. D.C., at summer’s end, to return to his home in Toronto, and take up new challenges in the private sector.</p>\n\n<p>“David has long been and remains a trusted advisor, friend, and counselor.</p>\n\n<p>“But he is more than that: He is a Canadian patriot – one whose honesty, moderation, and wisdom were pivotal to Team Canada in our successful renegotiation of NAFTA in 2017 and 2018.</p>\n\n<p>“For this, he has earned every Canadian’s gratitude.</p>\n\n<p>“David’s skill in bridging partisan and ideological divides – always putting Canadians’ interests first, never deviating from objectives he knew to be both possible and desirable&nbsp;– has been unparalleled.</p>\n\n<p>“Working alongside our Foreign Minister, Chrystia Freeland, and Canada’s team of expert negotiators, David has been our point person with Congress and with the U.S. administration, in the most difficult and uncertain trade negotiations this country has ever faced.</p>\n\n<p>“It’s no exaggeration to say his contribution has been historic.</p>\n\n<p>“The Canada-U.S.-Mexico Agreement preserves, updates, and modernizes our most important trading relationship, just as we set out to do.</p>\n\n<p>“Alongside our European and Pacific trade agreements, it secures Canadian exporters’ access to markets comprising 1.5 billion people around the world.</p>\n\n<p>“It protects hundreds of thousands of Canadian workers’ jobs, and preserves this country’s prosperity at a moment of global uncertainty, even as we diversify our exports worldwide.</p>\n\n<p>“David also played a critical role in persuading U.S. lawmakers and the administration to end U.S. tariffs on Canadian steel and aluminum, allowing Canada to correspondingly remove our reciprocal tariffs, last May.</p>\n\n<p>“I can attest that his dedication to this last task was truly tireless. Indeed, he shared with me some months ago his growing desire to return home – but only once tariffs on Canadian aluminum and steel had been lifted. In this, too, he succeeded.</p>\n\n<p>“My friend, as you return home to Canada, I can only share with you my deep thanks, and your country’s deep thanks, for your exemplary service.</p>\n\n<p>“Following David’s departure at the end of August, Canada will continue to be well-served by Kirsten Hillman, who becomes Canada’s Acting Ambassador to the United States.</p>\n\n<p>“As Canada’s Deputy Ambassador to the United States since 2017, Ms. Hillman was a critical member of the teams that secured the new NAFTA, and that got steel and aluminum tariffs removed.</p>\n\n<p>“Previously, Ms. Hillman served as the assistant deputy minister of the Trade Agreements and Negotiations Branch at Global Affairs Canada. In that role, Ms. Hillman was responsible for leading and overseeing Canada’s trade negotiations agenda, including the ratification of the Canada-European Union Comprehensive Economic and Trade Agreement.</p>\n\n<p>“Canada will continue to be in strong hands in Washington.”</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2019/08/statement-from-ambassador-david-macnaughton.html\">Statement from Ambassador David MacNaughton</a></li>\n</ul></div>\n      "
}