{
  "path": "/en/news/statements/2017/10/22/statement-prime-minister-anniversary-attack-national-war-memorial-and",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the attack at the National War Memorial and Parliament Hill in Ottawa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the three-year anniversary of the attack at the National War Memorial and Parliament Hill:</p><p>“Three years ago today, a senseless attack at the National War Memorial and Parliament Hill in Ottawa claimed the life of ceremonial honour guard Corporal Nathan Cirillo and injured several others. &nbsp;</p><p>“On this solemn anniversary, I join Canadians across the country to remember and pay tribute to Corporal Cirillo and to Warrant Officer Patrice Vincent, who was killed two days earlier that year in a terrorist attack in Saint-Jean-sur-Richelieu, Quebec. We offer our deepest sympathies to their families and friends, and to all those affected by these attacks.</p><p>“Today, we also honour the bravery of the first responders – the Senate Protective Service and the House of Commons Security Services, the RCMP, former House of Commons Sergeant-at-Arms Kevin Vickers, and medical personnel – who kept us safe on that tragic day.</p><p>“These attacks were intended to instill fear and divide Canadians. Instead, they only served to unite us. We emerged stronger than before, showing the world that our most cherished values – freedom, democracy, diversity, and inclusion – will always triumph over fear and hatred.</p><p>“As we mourn today the loss of these two members of the Canadian Armed Forces, I invite all Canadians to thank our courageous men and women in uniform – both here at home and abroad – who put their lives in harm’s way every day to defend our country and keep us safe.”</p></div>\n      "
}