{
  "path": "/en/news/readouts/2022/04/05/prime-minister-justin-trudeau-speaks-crown-prince-abu-dhabi-his-highness",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Crown Prince of Abu Dhabi His Highness Sheikh Mohammed bin Zayed Al Nahyan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Crown Prince of Abu Dhabi and Deputy Supreme Commander of the Armed Forces of the United Arab Emirates, His Highness Sheikh Mohammed bin Zayed Al Nahyan.</p>\n\n<p>The two leaders discussed the urgent humanitarian crisis and the importance of an immediate cease-fire in Ukraine. The Prime Minister condemned the deliberate targeting of civilians by Russian forces. The Prime Minister and the Crown Prince agreed on the need to work together to mitigate the global economic impacts resulting from the invasion of Ukraine. The Prime Minister invited the Crown Prince to participate in the “Stand Up For Ukraine” campaign pledging event on April 9, which the Prime Minister is convening with the President of the European Commission, Ursula von der Leyen, in order to raise funds for Ukrainian refugees and internally displaced people.</p>\n\n<p>The two leaders noted the close relationship between Canada and the United Arab Emirates (UAE), reflected in the recent visit by the Governor General of Canada to the UAE from March 17 to 19. The Prime Minister reiterated Canada’s condemnation of the recent Houthis attacks on the UAE and congratulated the Crown Prince for the successful conclusion of Expo 2020. The Prime Minister also thanked the Crown Prince for the UAE’s support to Afghan refugees. The leaders agreed to continue strengthening bilateral relations between Canada and the UAE.</p>\n\n<p>The Prime Minister and the Crown Prince agreed to continue cooperating in response to the humanitarian crisis in Ukraine and the war’s impact on global food security and energy supplies.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/uae-eau/relations.aspx?lang=eng\">Canada-United Arab Emirates relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/14/governor-general-travel-middle-east\">Governor General to travel to the Middle East</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/26/stand-ukraine-european-commission-and-government-canada-team-global\">Stand up for Ukraine: European Commission and Government of Canada team up with Global Citizen to mobilize support for refugees</a></li>\n</ul></div>\n      "
}