{
  "path": "/en/news/statements/2017/05/17/statement-prime-minister-canada-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister of Canada on the International Day Against Homophobia, Transphobia and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia and Biphobia:&nbsp;</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today marks #IDAHOT – the International Day Against Homophobia, Transphobia and Biphobia.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“No matter who we love or how we identify, all of us deserve to feel safe and secure, live free from discrimination and persecution, and express ourselves fully. Today – and every day – I join Canadians to support gender expression, gender identity and sexual orientation rights for people in Canada and around the world, and to challenge stigma, violence, and prejudices wherever they occur.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Through measures including Bills C-16 and C-39 – and with the help of Member of Parliament Randy Boissonnault, <a href=\"/en/news/news-releases/2016/11/15/prime-minister-announces-special-advisor-lgbtq2-issues\">Special Advisor on LGBTQ2 issues</a> – our Government continues to work to make sure transgender and other gender-diverse people, as well as people of diverse sexual orientations, can live freely and fully according to their identity. Canada will seek to co-chair the Equal Rights Coalition, to provide leadership within the new inter-governmental network to protect and promote the rights of lesbian, gay, transgender, and intersex people around the world.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In Canada and around the world, we must continue to fight against homophobia, transphobia, and biphobia, and to defend gender expression, gender identity and sexual orientation rights. </span><span lang=\"EN\" xml:lang=\"EN\">We deplore the recent, reprehensible reports of violations of the human rights of gay and bisexual men in Chechnya. We call for the protection of all people in Chechnya whose sexual orientation makes them a target for persecution. Human rights have no borders.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, I ask Canadians and people </span>around the world to fight hatred, honour love<span lang=\"EN-US\" xml:lang=\"EN-US\">, and defend human rights for everyone. Together, we can build a world where all of us are free to be who we are and love who we love.”</span></p><p><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Associated Links</span></b></p><ul><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"http://dayagainsthomophobia.org/\">International Day Against Homophobia, Transphobia and Biphobia</a>.</span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"http://international.gc.ca/world-monde/world_issues-enjeux-mondiaux/rights_lgbti-droits_lgbti.aspx?lang=eng\">The human rights of LGBTI persons</a></span></li><li><a href=\"http://www.canada.pch.gc.ca/eng/1448633333972\">Rights of LGBTI persons</a></li></ul></div>\n      "
}