{
  "path": "/en/news/readouts/2022/10/05/prime-minister-justin-trudeau-meets-nova-scotia-premier-tim-houston",
  "pageTitle": "Prime Minister Justin Trudeau meets with Nova Scotia Premier Tim Houston | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with Nova Scotia Premier Tim Houston in Halifax, Nova Scotia, to discuss ways the federal and provincial governments can continue to work together to help people rebuild and recover from Hurricane Fiona and its impacts.</p>\n\n<p>The Prime Minister reiterated the Government of Canada’s commitment to keep working with provincial governments, municipal partners, and local First Nations communities to support recovery efforts and help rebuild communities, and highlighted federal support programs available, including through Disaster Financial Assistance Arrangements and the new Hurricane Fiona Recovery Fund.</p>\n\n<p>The Prime Minister and the Premier recognized the progress that has been made, but indicated that power and telecommunication outages remain a concern for many people and businesses. The two leaders discussed the support Canadian Armed Forces personnel are providing in the response and clean-up efforts.</p>\n\n<p>The Prime Minister and the Premier also discussed other shared priorities, including growing the economy, creating jobs, and addressing the rising cost of living, as well as energy, health care, and the fight against climate change.</p>\n\n<p>The leaders agreed to stay in close contact as recovery efforts continue.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/campaigns/hurricane.html\">Government of Canada Response to Hurricane Fiona</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/04/rebuilding-after-hurricane-fiona\">Rebuilding after Hurricane Fiona</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/25/prime-minister-justin-trudeau-convenes-second-incident-response-group\">Prime Minister Justin Trudeau convenes the second Incident Response Group meeting to discuss Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/10/government-of-canada-providing-assistance-to-atlantic-canada-with-recovery-from-hurricane-fiona.html\">Government of Canada providing assistance to Atlantic Canada with recovery from Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/mrgnc-mngmnt/rcvr-dsstrs/dsstr-fnncl-ssstnc-rrngmnts/index-en.aspx\">Disaster Financial Assistance Arrangements (DFAA)</a></li>\n</ul></div>\n      "
}