{
  "path": "/en/news/news-releases/2019/05/31/governor-general-canada-travel-france-75th-anniversary-d-day-and",
  "pageTitle": "Governor General of Canada to travel to France for 75th anniversary of D-Day and the Battle of Normandy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General and Commander-in-Chief of Canada, will travel to Normandy, France, from June 3 to 6, 2019.</p>\n\n<p>During the visit, the Governor General will attend commemorative events to mark the 75th anniversary of D-Day and the Battle of Normandy, including the unveiling of a Canadian monument in Chambois and a ceremony at Bény-sur-Mer Canadian War Cemetery. The Governor General will also attend a ceremony in Bernières-sur-Mer to honour the Queen’s Own Rifles of Canada.</p>\n\n<h2><strong>Quote</strong></h2>\n\n<blockquote>\n<p>“The sacrifices made by Canadians, on D-Day and throughout the war, paved the way for us to live in free and democratic societies. In Normandy, the Governor General will pay her respects to the thousands of Canadians who fought and died in one of the most important battles in human history.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2><strong>Quick Facts</strong></h2>\n\n<ul>\n\t<li>June 6, 2019, marks the 75th anniversary of the D-Day landings and the start of the Battle of Normandy.</li>\n\t<li>On June 6, 1944, Allied troops stormed the beaches of Normandy to open the way to Germany from the west coast of Europe.</li>\n\t<li>On August 25, 1944, the Allies liberated Paris, officially ending the Battle of Normandy.</li>\n\t<li>Canadians suffered the highest casualties of any divisions in the British Army Group during the Battle of Normandy. On D-Day, 359 Canadian soldiers were killed and over 5,000 Canadians lost their lives during the two-and-a-half-months of fighting that followed.</li>\n\t<li>The Bény-sur-Mer Canadian War Cemetery holds the graves of more than 2,000&nbsp;Canadians who gave their lives during the landings in Normandy and during the early stages of the Battle of Normandy.</li>\n\t<li>Founded on April 26, 1860, the Queen's Own Rifles of Canada is the oldest continuously serving infantry regiment in Canada.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/history/second-world-war/d-day/75th-anniversary\">75th Anniversary of D-Day and the Battle of Normandy</a></li>\n</ul></div>\n      "
}