{
  "path": "/en/news/readouts/2022/09/10/prime-minister-justin-trudeau-speaks-prime-minister-elizabeth-truss-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Elizabeth Truss of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the United Kingdom (UK), Elizabeth Truss.</p>\n\n<p>Prime Minister Trudeau passed on his deepest condolences to the people of the UK following the passing of Her Majesty Queen Elizabeth&nbsp;II and noted that both countries, along with many others in the Commonwealth and around the world, are in shared sorrow at this great loss. He expressed his gratitude for the leadership and strength that Prime Minister Truss has&nbsp;demonstrated through these historic recent days.</p>\n\n<p>Prime Minister Trudeau also congratulated Prime Minister Truss on her recent appointment. The two leaders discussed the importance of building on the strong relationship between their two countries, particularly to address ongoing global concerns such as Russia’s illegal and unjustifiable invasion of Ukraine, uncertainties facing the global economy, energy and food security, climate change and biodiversity.</p>\n\n<p>The prime ministers discussed the continuing need to counter Russian false narratives and disinformation, particularly in the Global South, as well as the need to work together to strengthen partnerships with developing countries, including in and through the Commonwealth.</p>\n\n<p>Prime Minister Trudeau underlined his interest in working closely with Prime Minister Truss to support a successful 15th Conference of the Parties to the United Nations Convention on Biological Diversity, to be hosted by Canada in Montréal in December, which will focus on protecting nature and halting biodiversity loss around the world.</p>\n\n<p>The two leaders confirmed their shared support for&nbsp;efforts to reinforce supply chain security and to&nbsp;promote free and open rules-based trade globally. Prime Minister Trudeau confirmed Canada’s support for UK accession to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) and emphasized that ongoing negotiations toward a comprehensive, ambitious, and inclusive free trade agreement between Canada and the UK remain a priority.</p>\n\n<p>The two leaders also noted the importance of continuing to hold Iran accountable for the downing of Flight&nbsp;PS752, and committed to support the ongoing work of the International Coordination and Response Group for the victims of Flight&nbsp;PS752 and efforts&nbsp;to&nbsp;bring&nbsp;this case before the International Court of Justice.</p>\n\n<p>Prime Minister Truss&nbsp;reflected&nbsp;warmly&nbsp;on the year she spent in Burnaby, British Columbia, during her youth, noting the&nbsp;positive and&nbsp;formative&nbsp;experience of living and attending school in Canada.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Truss looked forward to meeting in person soon and agreed to work together to advance shared priorities at&nbsp;upcoming meetings&nbsp;including at&nbsp;the 77th Session of the United Nations General Assembly in New&nbsp;York&nbsp;City.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/united_kingdom-royaume_uni/index.aspx?lang=eng\">Canada and the United Kingdom</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/book.html\">Condolences for Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/09/06/statement-prime-minister-welcoming-new-prime-minister-united-kingdom\">Statement by the Prime Minister welcoming the new Prime Minister of the United Kingdom</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN conference on biodiversity: COP15 in Montréal</a></li>\n</ul></div>\n      "
}