{
  "path": "/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response",
  "pageTitle": "Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking significant and decisive action to support Canadians and businesses facing hardship as a result of the COVID-19 global pandemic.</p>\n\n<p>No Canadian should have to choose between protecting their health, putting food on the table, paying for their medication or caring for a family member. This is why the government introduced the Canada Emergency Response Benefit (CERB), a taxable benefit of $2,000 every four weeks for up to four months for eligible workers who have lost their income due to COVID-19.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the government is stepping up to better support those who need help but don't qualify for the CERB, and Canadians working in essential jobs who make less than they would if they received the benefit.</p>\n\n<p>To help more Canadians benefit from the CERB, the government will be changing the eligibility rules to:</p>\n\n<ul>\n\t<li>Allow people to earn up to $1,000 per month while collecting the CERB.</li>\n\t<li>Extend the CERB to seasonal workers who have exhausted their EI regular benefits and are unable to undertake their usual seasonal work as a result of the COVID-19 outbreak.</li>\n\t<li>Extend the CERB to workers who recently exhausted their EI regular benefits and are unable to find a job or return to work because of COVID-19.</li>\n</ul>\n\n<p>The COVID-19 pandemic has placed particular demands on low-income workers in certain sectors, including those on the front-line in hospitals and nursing homes, those ensuring the integrity of the food supply, or providing essential retail services to Canadians.</p>\n\n<p>In recognition that these essential workers’ salaries are often less or similar than what they would receive from the CERB, the government will work with provinces and territories through a new transfer to cost-share a temporary top-up to the salaries of workers deemed essential in the fight against COVID-19, who make less than $2,500 a month. Details as to the application and delivery of this measure will be released shortly following further work with provinces and territories. This measure could help several million workers currently involved in the COVID-19 response.<strong>&nbsp;</strong>The government will continue to look for ways to better help all Canadians during this difficult time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We will do whatever it takes to protect the health and safety of Canadians, while making sure that our workers and businesses are supported. This is an extremely difficult time for all Canadians, and we need to make sure that essential workers have the support they need so they can continue to do the critical work we all rely on. Together, we will get through this difficult time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic has had significant impacts on workers in all sectors, including those on the front-line saving lives in hospitals and nursing homes. The measures we are introducing today will ensure that they are properly compensated for their efforts, and ensure that workers who have lost income as a result of the pandemic get the help they need through the Canada Emergency Response Benefit.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“We remain unequivocal in our commitment to support Canadian workers impacted and unable to work due to COVID-19. Through the Canada Emergency Response Benefit we are ensuring that Canadians have access to the emergency income they need during this difficult time. Today’s announcement recognizes that many Canadian workers who did not qualify for the CERB were still in need of financial assistance – which is why we have worked hard to expand the eligibility criteria to be more inclusive.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The government is working to get money into the pockets of Canadians as quickly as possible. Canadians begin to receive their CERB payments within 10 days of application. Canadians will have to apply every four weeks, attesting that they continue to meet the eligibility criteria for the CERB payment, which will be available to individuals for a maximum of 16 weeks, until October 3, 2020.</li>\n\t<li>The more accessible CERB and the top-up for low-income essential workers are part of the government’s COVID-19 Economic Response Plan, which committed $107 billion in support to Canadians and businesses facing hardship as a result of COVID-19.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/04/expanding-access-to-the-canada-emergency-response-benefit-and-proposing-a-new-wage-boost-for-essential-workers.html\">Backgrounder: Expanding access to the Canada Emergency Response Benefit and proposing a new wage boost for essential workers</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}