{
  "path": "/en/news/news-releases/2021/04/06/support-testing-and-contact-tracing-through-safe-restart-agreement",
  "pageTitle": "Support for testing and contact tracing through the Safe Restart Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>More than a year into the global COVID-19 pandemic, the Government of Canada continues to do whatever it takes to help stop the spread of the virus and its variants. Together with the provinces and territories, we are working to keep people safe, healthy, and supported during this crisis.</p>\n\n<p>The Prime Minister, Justin Trudeau, announced the final instalment of the over $19&nbsp;billion Safe Restart Agreement, to help provinces and territories safely restart the economy, and provide continued support to Canadians.</p>\n\n<p>Since the Agreement was reached last summer, this federal funding has been used to support the capacity of our health care systems, secure personal protective equipment for essential workers, and protect the most vulnerable in our communities. This funding has also supported safe and affordable child care, and assisted in the operating needs of municipalities and public transit.</p>\n\n<p>In British Columbia, the Safe Restart Agreement has helped enhance data management and analytics capabilities to model the potential spread of COVID-19. In Alberta, it has helped to provide support for continuing care and seniors’ facilities, including more staff and cleaning supplies. In Nova Scotia, it supported the province’s testing strategy, including enhancing its mobile testing capacity to reach and support rural communities.</p>\n\n<p>Testing, screening, and contact tracing play a critical role in helping to fight the pandemic and curb transmission, particularly in shared spaces such as workplaces, long-term care homes, and shelters. In February, we exceeded the goal of having the capacity to undertake 200,000 COVID-19 tests per day across the country, which was a key objective of the Safe Restart Agreement. The final instalment of $700 million will help provinces and territories to further increase their testing capacity and support Canadians through this crisis.</p>\n\n<p>Eight of every ten dollars spent in Canada to respond to the pandemic have come from the federal government, and we will continue to do whatever it takes, for as long as it takes, to ensure Canadians are safe and supported. Together, we will continue to build on the Team Canada approach to fight and beat this virus, and build back better for all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Unprecedented times call for unprecedented actions. That is exactly what we have seen over the last year, as all orders of government have come together to fight the COVID-19 pandemic and curb the spread of new variants. We will continue working with the provinces and territories, and use all available tools at our disposal, to safely restart our economy, support our communities and businesses, and keep Canadians safe and healthy. Together, we can build back better from the pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Safe Restart Agreement is another example of our government‘s commitment to providing provinces and territories with the support they need to help keep Canadians safe and healthy. Together, we will continue to work collaboratively to make sure that Canadians from coast to coast to coast are supported in their recovery from the pandemic.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On July 16, 2020, the Prime Minister and Deputy Prime Minister announced an agreement to safely restart the economy that involved over $19 billion in funding from the federal government. The Safe Restart Agreement focused on measures over six to eight months to restart the economy while protecting the health of Canadians.</li>\n\t<li>The funding has supported the provinces and territories in their response to COVID-19 under seven key priorities:\n\t<ul>\n\t\t<li>Testing, contact tracing, and data management</li>\n\t\t<li>Health care capacity, including mental health and substance use</li>\n\t\t<li>Protecting vulnerable populations, including seniors</li>\n\t\t<li>Securing personal protective equipment</li>\n\t\t<li>Child care for people returning to work</li>\n\t\t<li>Support for municipalities, including for public transit</li>\n\t\t<li>Sick leave</li>\n\t</ul>\n\t</li>\n\t<li>On August 26, 2020, the Prime Minister announced up to $2 billion in funding to support provinces and territories in their efforts to ensure a safe return to school, through the Safe Return to Class Fund. A first instalment of $1 billion was provided to provinces and territories in September 2020, and the second instalment of up to $1 billion was provided in January 2021.</li>\n\t<li>On March 25, 2021, the Deputy Prime Minister and Minister of Finance introduced Bill C-25, which would provide an additional $7.2 billion in support to provinces, territories, municipalities, and Indigenous communities for urgent health care needs, the COVID-19 vaccine rollout, and local infrastructure projects</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement\">More support for Canadians through the Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/07/16/joint-communique-safe-restart-agreement\">Joint Communiqué – Safe Restart Agreement</a></li>\n</ul></div>\n      "
}