{
  "path": "/en/news/news-releases/2022/04/09/stand-ukraine-91-billion-euros-124-billion-pledged-support-internally",
  "pageTitle": "Stand Up For Ukraine: 9.1 billion euros ($12.4 billion) pledged in support of internally displaced and refugees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The “Stand Up for Ukraine” global pledging event and campaign has raised 9.1 billion euros ($12.4 billion) for people fleeing the Russian invasion, inside Ukraine and abroad, including €1 billion from the European Commission.</p>\n\n<p>On top of that, the European Bank for Reconstruction and Development has announced an additional €1 billion in loan to cover the needs of the people displaced by the invasion.</p>\n\n<p>Out of these €10.1 billion in pledges and EBRD funding, €1.8 billion are for internally displaced persons and €8.3 billion for refugees in frontline EU Member States and countries, like Moldova.</p>\n\n<p>The €9.1 billion pledge is broken down as follows:</p>\n\n<ul>\n\t<li>€4.1 billion are financial contributions and in-kind donations for internally displaced people and refugees pledged by governments, companies and individuals around the world.</li>\n\t<li>€5 billion are loans and grants from European public financial institutions (the European Investment Bank, and the Council of Europe Development Bank).</li>\n</ul>\n\n<p>Pledges from governments for internally displaced people in Ukraine will be now channeled largely through the Ukrainian authorities, central and local level. Donations from the private sector and individuals for internally displaced people will be channeled mainly through UN agencies.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p><em>“Today, we raised over $12.4 billion to continue supporting the Ukrainian people who have been displaced by Putin's ongoing and unjustifiable war. Whether it's food, water, shelter, or medical aid – we will continue to have your backs and provide the assistance you need at this time. We are standing up for Ukraine.”</em></p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“<em>The solidarity of countries, companies and people worldwide offers some light in this dark hour. The ‘Stand Up For Ukraine' campaign has raised 9.1 billion euros for people fleeing bombs, inside and outside Ukraine, with an additional billion pledged by EBRD. And more will come. We will continue providing support. And once the bombs have stopped falling, we will help the people of Ukraine rebuild their country. We will continue to Stand up for Ukraine.”</em></p>\n\n<footer class=\"default\">Ursula von der Leyen, President of the European Commission</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Stand Up For Ukraine online pledging event concludes a broader social media campaign launched by the European Commission and the Government in Canada on Saturday, March26, in partnership with Global Citizen.&nbsp;</li>\n\t<li>The campaign answers a call for support launched by the President of Ukraine Volodymyr Zelenskyy. The aim of the campaign is to raise funding and other types of support to cater for the needs of the people fleeing the invasion inside and outside Ukraine.</li>\n\t<li>In particular:\n\t<ul>\n\t\t<li>For the more than four million people who have already sought shelter in the EU and for others who are likely to come: the funding will be used to cater for their short and medium-term needs in EU Member States, from food, housing and medical care to education and employment.</li>\n\t\t<li>For the 6.5 million people, including 2.5 million children, who had to flee their homes but stayed in Ukraine and are now internally displaced: funding and donations will provide them with vital humanitarian care.</li>\n\t</ul>\n\t</li>\n\t<li>In recognition of Poland's essential role in supporting refugees fleeing the invasion of Ukraine, the Stand Up For Ukraine pledging event took place in Warsaw, with the participation of President Duda.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-canada-helping-aide.aspx?lang=eng\">How Canada is helping – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_en\">EU solidarity with Ukraine</a> – available in <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_uk\">Ukrainian</a> and <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_ru\">Russian</a></li>\n\t<li><a href=\"https://www.globalcitizen.org/en/info/ukraine/\">The Stand Up For Ukraine campaign</a></li>\n</ul></div>\n      "
}