{
  "path": "/en/news/news-releases/2021/02/19/prime-minister-launches-process-select-next-justice-supreme-court",
  "pageTitle": "Prime Minister launches process to select the next justice of the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today launched the process to select the next justice of the Supreme Court of Canada, who will fill the vacancy created by the upcoming retirement of Justice Rosalie Silberman Abella.</p>\n\n<p>The Prime Minister also announced the members of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments. This non-partisan board is responsible for identifying candidates who are jurists of the highest caliber, functionally bilingual, and representative of the diversity of our country. The seven-member advisory board will be chaired by former Prime Minister Kim&nbsp;Campbell. The advisory board will review applications, and submit a shortlist of highly qualified candidates for consideration by the Prime Minister.</p>\n\n<p>Justice Abella was appointed to the Supreme Court of Canada from the Ontario Court of Appeal in 2004. In recognition of the convention of regional representation, the process will be open to all qualified applicants from Ontario.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“To appoint the next justice of the Supreme Court of Canada, we are launching an open and independent process that will identify the most exceptional Canadian lawyers and judges, while recognizing regional representation and the diversity of our country. On behalf of all Canadians, I also thank Justice Abella, the court’s longest-serving member, for her leadership, excellence, and dedication on our highest court over the past 17 years.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Qualifying candidates who wish to be considered for the upcoming vacancy must submit an <a href=\"https://fja-cmf.gc.ca/scc-csc/2021/form-formulaire-eng.html\">application package</a> no later than 23:59 Pacific time on April 2, 2021.</li>\n\t<li>Those interested in applying are encouraged to first review the statutory requirements set out in the <em><a href=\"https://laws-lois.justice.gc.ca/eng/acts/S-26/\">Supreme Court Act</a></em>, and the <a href=\"https://fja-cmf.gc.ca/scc-csc/2021/qualifications-eng.html\">qualifications and assessment criteria</a> that will guide the advisory board in evaluating a candidate’s suitability.</li>\n\t<li>Candidates may demonstrate they satisfy the geographical requirement by reference to their bar membership, judicial appointment, or other relationship with the province of Ontario.</li>\n\t<li>In 2016, the Government of Canada announced a new process for Supreme Court of Canada judicial appointments. It included the creation of an independent and non-partisan advisory board to identify qualified and suitable candidates for appointment to the Supreme Court of Canada.</li>\n\t<li>The following members have been named to the advisory board:\n\t<ul>\n\t\t<li>The Right Honourable <strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Kim_Campbell\">Kim Campbell</a>&nbsp;</strong>(Chairperson): former Prime Minister of Canada and Canadian Consul General, and the Founding Principal of the Peter Lougheed Leadership College at the University of Alberta.</li>\n\t\t<li><strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Erika_Chamberlain\"><strong>Erika Chamberlain</strong></a>: </strong>Dean of Law, University of Western Ontario.</li>\n\t\t<li>The Honourable <a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Louise_Charron\"><strong>Louise Charron</strong></a>: retired justice of the Supreme Court of Canada.</li>\n\t\t<li><strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Signa_Shanks\"><strong>Signa A. Daum Shanks</strong></a>: </strong>Professor, Osgoode Hall Law School.</li>\n\t\t<li><strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#David_Henry\"><strong>David Henry</strong></a></strong>:<strong> </strong>Chief Executive Officer, Association des services de réhabilitation sociale du Québec.</li>\n\t\t<li><strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Jill_Perry\"><strong>Jill Perry</strong></a></strong>:<strong> </strong>Managing lawyer, Nova Scotia Legal Aid.</li>\n\t\t<li><strong><a href=\"/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members#Beverley_Salmon\"><strong>Beverley Noel Salmon</strong></a></strong>: former municipal councillor, and Commissioner, Ontario Human Rights Commission.</li>\n\t</ul>\n\t</li>\n\t<li>Justice Abella will retire from the Supreme Court of Canada effective July 1, 2021.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/02/19/biographical-notes-independent-advisory-board-members\">Biographical notes: Independent Advisory Board members</a></li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.fja.gc.ca/scc-csc/index-eng.html\">Supreme Court of Canada appointment process</a></li>\n\t<li><a href=\"http://pm.gc.ca/eng/news/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">New process for judicial appointments to the Supreme Court of Canada</a></li>\n</ul></div>\n      "
}