{
  "path": "/en/news/readouts/2022/01/04/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier and Chair of the Council of the Federation John Horgan.</p>\n\n<p>The two leaders discussed the impacts of the COVID-19 Omicron variant in Canada. The Prime Minister reaffirmed that the Government of Canada will continue to work closely with provinces and territories to reduce the health, economic, and social impacts of this new variant, which is rapidly spreading across the country. He indicated he will convene another call with all premiers next week to discuss how governments are working together to keep Canadians safe.</p>\n\n<p>Prime Minister Trudeau and Premier Horgan also discussed the Canada Health Transfer, and agreed to continue discussions with all provincial and territorial governments to ensure Canadians are supported by effective health care systems.</p>\n\n<p>Premier Horgan provided an update on British Columbia’s significant recovery and rebuilding efforts following the extreme weather events that impacted families, businesses, and communities last November. The two leaders discussed the successful first meeting of the Committee of British Columbia and Federal Ministers on Disaster Response and Climate Resilience that was held on December 13, 2021, and noted that a second meeting will take place later this month.</p>\n\n<p>Prime Minister Trudeau and Premier Horgan agreed to remain in contact on these issues in the coming weeks.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/12/government-of-canada-announces-additional-measures-to-contain-the-spread-of-the-omicron-variant.html\">Government of Canada announces additional measures to contain the spread of the Omicron variant</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-holds-35th-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 35th call with premiers on COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/26/prime-minister-and-premier-british-columbia-announce-new-committee\">Prime Minister and Premier of British Columbia announce new committee to address extreme weather and climate resilience in the province</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/news/2021/12/committee-of-british-columbia-and-federal-ministers-on-disaster-response-and-climate-resilience-membership.html\">Committee of British Columbia and Federal Ministers on Disaster Response and Climate Resilience membership</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/news/2021/12/federal-and-british-columbia-ministers-and-first-nations-hold-meeting-on-disaster-recovery-and-climate-resilience2.html\">Federal and British Columbia ministers and First Nations hold meeting on disaster recovery and climate resilience</a></li>\n</ul></div>\n      "
}