{
  "path": "/en/news/readouts/2022/07/12/prime-minister-justin-trudeau-speaks-prime-minister-japan-kishida-fumio",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Japan Kishida Fumio | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Japan, Kishida Fumio, to convey Canada’s condolences for the death of former Japanese Prime Minister Abe Shinzo.</p>\n\n<p>Prime Minister Trudeau expressed his shock and deep sadness at the tragic death of former Prime Minister Abe. Noting that this senseless act of violence occurred a few days prior to Japan’s upper house elections, the leaders underlined their unwavering commitment to democratic values and the importance of free and fair elections without violence or intimidation.</p>\n\n<p>Prime Minister Trudeau underscored Canada’s deep and enduring friendship with Japan, a friendship that was expanded and deepened under Mr.&nbsp;Abe’s tenure as Prime Minister.</p>\n\n<p>The leaders discussed Prime Minister Abe’s visionary leadership in promoting a free and open Indo-Pacific region. Prime Minister Trudeau fondly recalled hosting Prime Minister Abe during his visit to Ottawa in April 2019 and their close cooperation over several years at the G7 and the G20, within the Asia-Pacific Economic Cooperation (APEC), and in other international forums.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Kishida reaffirmed their commitment to carry on former Prime Minister Abe’s enduring legacy by upholding democracy and the rule of law in the Indo-Pacific region and beyond.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/07/08/statement-prime-minister-assassination-former-japanese-prime-minister\">Statement by the Prime Minister on the assassination of former Japanese Prime Minister Shinzo Abe</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/photos/2019/04/28/prime-minister-justin-trudeau-welcomes-prime-minister-japan-shinzo-abe-parliament\">Prime Minister Justin Trudeau welcomes Prime Minister of Japan Shinzo Abe to Parliament Hill</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/27/prime-minister-justin-trudeau-meets-prime-minister-japan-kishida-fumio\">Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n</ul></div>\n      "
}