{
  "path": "/en/news/statements/2017/10/19/statement-prime-minister-canada-death-michael-pitfield",
  "pageTitle": "Statement by the Prime Minister of Canada on the death of Michael Pitfield | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of former Senator and Clerk of the Privy Council Michael Pitfield:</p><p>“I learned with great sadness today that one of Canada’s most devoted and longest-serving public servants has passed away.</p><p>“Michael joined the public service in 1959. Over the next fifty years, he would serve Canadians in a variety of roles, most notably as Secretary to the Cabinet, as Clerk to the Privy Council, and as the Senator for Ottawa-Vanier. He remains the youngest ever Canadian to lead the public service.</p><p>“His contributions to Canadian public life are far-reaching and enduring. Throughout his career, Michael challenged the status quo, knowing Canadians could be better served by their federal government and public service. He oversaw the introduction of new Cabinet committee systems and government processes, many of which continue to shape government decision-making today. He also helped lay the foundation for a more efficient, modern public service – now considered the best in the world.</p><p>“Michael played a pivotal role in the patriation of the Constitution and the establishment of the Canadian Charter of Rights and Freedoms. He was a tireless advocate of bilingualism and national unity whose leadership helped bring us closer as a country and make our democracy uniquely our own.</p><p>“On a personal level, I will remember Michael as a family friend, who was especially dear to my father and our family.</p><p>“In 1982, Michael joined the Senate of Canada, sitting as an independent until his retirement in 2010. In recognition of his work, he was appointed Federal Queen’s Counsel, Commander of the Royal Victorian Order, and made a member of the Queen’s Privy Council.</p><p>“On behalf of all Canadians, Sophie and I offer our deepest condolences to his three children, Caroline, Tom, and Kate, and to all of Michael’s family and friends.”</p></div>\n      "
}