{
  "path": "/en/news/news-releases/2023/04/13/supporting-millions-canadians-rising-cost-groceries",
  "pageTitle": "Supporting millions of Canadians with the rising cost of groceries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>With grocery prices going up, too many Canadians are struggling to make ends meet. In the face of global inflation and rising costs, the Government of Canada is providing much-needed relief to Canadians to ensure they can continue to put food on the table and pay the bills.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted the new one-time Grocery Rebate proposed in <em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em>. This targeted inflation relief has been designed to help support the Canadians hardest hit by rising food prices.</p>\n\n<p>The Grocery Rebate would help approximately 11&nbsp;million low- and modest-income Canadians and families across the country. This would mean a one-time payment of up to an extra $467 for eligible couples with two children; up to an extra $234 for single Canadians without children; and an extra $225 for seniors, on average. The rebate is part of a suite of measures proposed in Budget&nbsp;2023 to help make life more affordable for Canadians, including cracking down on predatory lending, providing more support for students, and lowering credit card transaction fees for small businesses.</p>\n\n<p>Budget&nbsp;2023 lays out the federal government’s plan to keep supporting Canadian families and build a stronger, more sustainable, and more secure economy for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With grocery prices on the rise, we’re putting more money back into the pockets of Canadians who need it most, when they need it most. The new Grocery Rebate, and the other measures we’ve put forward in Budget&nbsp;2023, will help build an economy that works for everyone, where every Canadian family can afford to put food on the table.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>In addition to the new Grocery Rebate, Budget&nbsp;2023 proposes more affordability measures including:\n\t<ul class=\"bulletOutline\"><li>Cracking down on predatory lending that takes advantage of some of the most vulnerable people in our communities, including low-income Canadians, newcomers, and seniors, often by extending very high interest rate loans;</li>\n\t\t<li>Cracking down on junk fees, including higher telecom roaming charges, event and concert fees, excessive baggage fees, and unjustified shipping and freight fees;</li>\n\t\t<li>Supporting hardworking small business owners by working with financial institutions to lower credit card transaction fees, while also protecting reward points for Canadian consumers offered by Canada’s large banks; and</li>\n\t\t<li>Making life more affordable for students with measures including increasing Canada Student Grants by 40 per cent and raising the interest-free Canada Student Loan limit from $210 to $300 per week of study.</li>\n\t</ul></li>\n\t<li>The Government of Canada is investing in the middle class, growing the economy, and making life more affordable for Canadians. We have also:\n\t<ul class=\"bulletOutline\"><li>Enhanced the Canada Workers Benefit for our lowest-paid essential workers, to provide up to $2,461 for families;</li>\n\t\t<li>Increased Old Age Security (OAS) benefits for seniors age 75 and older by 10 per cent as of July 2022, which is providing more than $800 in additional support to full pensioners;</li>\n\t\t<li>Supported about 3.5&nbsp;million families annually through the tax-free Canada Child Benefit, with families this year receiving up to $7,437 per child under the age of six, and up to $6,275 per child aged six through 17;</li>\n\t\t<li>Delivered $10-a-day child care in half of Canada’s provinces and territories, and at least a 50 per cent fee reduction in every other jurisdiction – and strengthened the child care system in Quebec with more child care spaces; and</li>\n\t\t<li>Doubled the Goods and Services Tax Credit (GSTC) for six months to help 11&nbsp;million individuals and families with the rising cost of living – with couples with two children receiving up to an extra $467 and seniors receiving an extra $225 on average.</li>\n\t</ul></li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/making-life-more-affordable.html\">Budget&nbsp;2023 Backgrounder: Making Life More Affordable</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2023/03/28/government-canada-releases-budget-2023\">Government of Canada releases Budget&nbsp;2023</a></li>\n\t<li><em><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\">Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</a></em></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/13/making-life-more-affordable-canadians-year\">Making life more affordable for Canadians this year</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">Affordability Plan</a></li>\n</ul></div>\n      "
}