{
  "path": "/en/news/readouts/2023/02/22/prime-minister-justin-trudeau-meets-mayor-longueuil-catherine-fournier",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Longueuil Catherine Fournier | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Mayor of Longueuil, Catherine Fournier, to discuss priority issues they are working on together.</p>\n\n<p>The Prime Minister and the Mayor discussed the importance of ensuring access to affordable housing, including by building new housing – a priority for the City of Longueuil and the Greater Montreal Area. They also discussed federal funding provided specifically as part of the Canada-Quebec Rapid Housing Initiative Agreement.</p>\n\n<p>The leaders discussed the challenges the City of Longueuil is facing with respect to drinking water and wastewater management. The Prime Minister noted that the Government of Quebec has access to $4.4&nbsp;billion in funding for municipal infrastructure projects through the Canada Community-Building Fund, and he reiterated that the Government of Canada will continue its historic investments in infrastructure in the coming years, working together with provinces and municipalities.</p>\n\n<p>The Prime Minister also welcomed the recent announcement of an agreement between the Montréal–Saint-Hubert Airport Authority and the City of Longueuil designed to further development in the airport’s innovation area and realize the Mayor’s vision for this large-scale project.</p>\n\n<p>Prime Minister Trudeau reiterated that Longueuil is a very important partner in managing the influx of irregular asylum seekers, and that the Government of Canada will continue to support the City in addressing this critical situation. He acknowledged the exceptional generosity of the City of Longueuil and the increased pressure on community organizations.</p>\n\n<p>Prime Minister Trudeau and Mayor Fournier agreed to continue working together on these priority issues for Longueuil.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rapid-housing\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/gtf-fte-eng.html\">Canada Community-Building Fund</a></li>\n</ul></div>\n      "
}