{
  "path": "/en/news/statements/2018/12/05/statement-prime-minister-launch-christmas-lights-across-canada",
  "pageTitle": "Statement by the Prime Minister on the launch of Christmas Lights Across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the launch of the 34th edition of Christmas Lights Across Canada, which will run in Canada’s Capital Region until January 7, 2019:</p><p>“Tonight, Canadians will gather on Parliament Hill to take part in the official illumination ceremony for the 2018 edition of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/christmas-lights.html\">Christmas Lights Across Canada</a>.</p><p>“Every night for the next month, thousands of Christmas lights will shine in Canadian capitals from coast to coast to coast – reminding us that light will always win out, even on the darkest winter nights.</p><p>“The Christmas holidays bring neighbours together and connect loved ones near and far. But while we look forward to the traditions that come with the season, the holidays can be a difficult time for some families. Let’s do what we can to support people in need in our communities. Let’s also honour Canadian Armed Forces members who are spending the holidays away from home.</p><p>“As the holiday season kicks off and 2018 draws toward its end, let’s lend a hand to our neighbours, appreciate the people in our lives, and celebrate everything that unites us. Together, we’ll keep building the Canada that makes us all proud.</p><p>“On behalf the Government of Canada, I invite Canadians to take part in the Christmas Lights Across Canada festivities in person or to watch the event live on the <a href=\"https://www.facebook.com/CdnHeritage\">Canadian Heritage</a> Facebook page. On behalf of our family, Sophie and I wish everyone celebrating a merry Christmas.”</p></div>\n      "
}