{
  "path": "/en/news/news-releases/2019/05/04/prime-minister-announces-changes-parliamentary-secretaries",
  "pageTitle": "Prime Minister announces changes to parliamentary secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes to the parliamentary secretaries:</p>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/parliamentary-secretaries/rob-oliphant\"><strong>Rob Oliphant</strong></a>&nbsp;becomes the Parliamentary Secretary to the Minister of Foreign Affairs.</li>\n\t<li><a href=\"https://pm.gc.ca/eng/parliamentary-secretaries/greg-fergus\"><strong>Greg Fergus</strong></a>&nbsp;becomes the Parliamentary Secretary to the President of the Treasury Board and Minister of Digital Government.</li>\n</ul>\n\n<p>Mr. Fergus fills the vacancy created when Joyce Murray was named President of the Treasury Board and Minister of Digital Government. His experience in the private and public sectors will support the continued implementation of the government’s ambitious agenda, while helping grow the economy and strengthen the middle class.</p>\n\n<p>Mr. Oliphant fills the vacancy created by outgoing Parliamentary Secretary Andrew&nbsp;Leslie. Mr. Oliphant’s experience on various parliamentary committees and associations – as well as his past work serving communities – will help him as he works to promote Canada’s interests and values, and represents our country on the world stage.</p>\n\n<p>The Prime Minister also took the opportunity to thank Mr. Leslie for his service to Canadians as Parliamentary Secretary to the Minister of Foreign Affairs.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/parliamentary-secretaries\">Parliamentary Secretaries</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/canadian-ministry-order-precedence\">The Canadian Ministry</a></li>\n</ul></div>\n      "
}