{
  "path": "/en/news/news-releases/2016/10/30/canada-and-eu-sign-historic-trade-agreement-during-eu-canada-summit",
  "pageTitle": "Canada and EU sign historic trade agreement during EU-Canada Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is committed to deepening trade and investment links with new and traditional partners. Negotiating trade agreements, such as the Canada-European Union (EU) Comprehensive Economic and Trade Agreement (CETA), will benefit Canadians, create new job opportunities, and help to grow the middle class and those working hard to join it.</p><p>In keeping with these objectives, Prime Minister Justin Trudeau, together with Donald Tusk, President of the European Council, and Jean-Claude Juncker, President of the European Commission, signed CETA during today’s European Union-Canada Leaders’ Summit.</p><p>CETA is a modern, progressive trade agreement that, when implemented, will generate billions of dollars in bilateral trade and investment, provide greater choice and lower prices to consumers, and create middle class jobs in many sectors on both sides of the Atlantic. Both Canada and the EU are committed to bringing CETA into force as soon as possible.</p><p>The leaders also signed the Strategic Partnership Agreement (SPA), which will enhance cooperation in important areas such as energy, environment and climate change, migration and peaceful pluralism, counter-terrorism and international peace and security, and effective multilateralism.</p><p>CETA is the product of hard work, frank negotiations, and a common commitment – by the Prime Minister, the Minister of International Trade, and countless Canadian public servants – to a strong Canada-EU partnership.</p><h2>Quotes</h2><blockquote><p>“The signing of CETA is a historic occasion. This modern and progressive agreement will reinforce the strong links between Canada and the EU, and create vast new opportunities for Canadians and Europeans alike—opening new markets for our exporters, offering more choices and better prices to consumers, and forging stronger ties between our economies.”<br>– <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Canada-EU partnership is based on shared values, a long history of close cooperation, and strong people-to-people ties. The signing of CETA and the SPA sets the stage for even deeper relations in the future which will bolster the middle class on both sides of the Atlantic.”<br>– <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“CETA will offer significant benefits for most sectors of the Canadian economy, from fishermen in Newfoundland and Labrador, to aerospace workers in Quebec, and from people assembling automobiles in Ontario, to forest industry workers in British Columbia to miners in the Northwest Territories.”<br>– <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In addition, the leaders issued a joint statement following the Summit that outlines commitments and key areas of focus for Canada and the EU in coming years. The statement focused on shared values and interests including peace, democracy, prosperity, protection of human rights, rule of law, environment, inclusion and cultural diversity.</li><li>CETA will provide Canada with access to the EU’s more than 500 million consumers. Canadian workers throughout the country stand to benefit significantly from increased access to this 28 country market which generates $20 trillion in annual economic activity.</li><li>The elimination of EU tariffs will assist sectors in every region of Canada, including advanced manufacturing, agriculture and agri-food, automotive, chemicals and plastics, fish and seafood, forestry and value-added wood products, metal and mineral products and technology.</li><li>EU-Canada summits are held as agreed upon by the Prime Minister of Canada and the presidents of the European Council and European Commission.</li><li>This year marks the 40th anniversary of the signing of the first Canada‑EU Framework Agreement (1976) and the establishment of the EU’s diplomatic mission in Ottawa.</li><li>Canada’s trade and investment relations continue to grow with the EU, the world’s second largest single market, and Canada’s second largest bilateral trading partner. Of Canada’s 21 priority markets for investment attraction, 11 are in the EU.</li></ul><h2>Related Products</h2><ul><li>Backgrounder – <a href=\"/en/news/backgrounders/2016/10/30/signing-canada-eu-strategic-partnership-agreement\">Signing of the Canada-EU Strategic Partnership Agreement</a></li><li>Backgrounder – <a href=\"/en/news/backgrounders/2016/10/30/next-steps-canada-eu-comprehensive-economic-and-trade-agreement\">Next steps for the Canada-EU Comprehensive Economic and Trade Agreement</a></li><li>Backgrounder – <a href=\"/en/news/backgrounders/2016/10/30/benefits-canada-eu-comprehensive-economic-and-trade-agreement\">Benefits of the Canada-EU Comprehensive Economic and Trade Agreement</a></li><li><a href=\"/en/news/statements/2016/10/30/eu-canada-summit-joint-declaration\">EU-Canada Summit Joint Declaration</a></li></ul><h2><strong><br></strong>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/ceta\">Canada-European Union: Comprehensive Economic and Trade Agreement (CETA)</a></li><li><a href=\"http://www.international.gc.ca/europe/spa-aps.aspx?lang=eng\">Strategic Partnership Agreement (SPA)</a></li></ul></div>\n      "
}