{
  "path": "/en/news/statements/2015/12/08/statement-prime-minister-canada-former-prime-minister-brian-mulroney",
  "pageTitle": "Statement by the Prime Minister of Canada on former Prime Minister Brian Mulroney receiving South Africa’s highest award to a foreign national | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on former Prime Minister Brian Mulroney receiving the Supreme Companion of O.R. Tambo award by the Government of South Africa:</p>\n<p>“On behalf of all Canadians, Sophie and I would like to congratulate Mr. Brian Mulroney on being awarded the highest honour South Africa bestows upon foreign nationals: the Supreme Companion of Oliver Reginald Tambo award. This prestigious award recognizes Mr. Mulroney’s exceptional contribution to South Africa’s liberation movement and his steadfast support for the release of Nelson Mandela.</p>\n<p>“Under the leadership of Mr. Mulroney, the Government of Canada strongly opposed apartheid, a system of racial segregation in South Africa that was at the centre of political violence in the country for decades.</p>\n<p>“Only four months after his release, Nelson Mandela travelled to Ottawa, Montréal and Toronto as a gesture of gratitude for Canada’s contribution. In 1998, Mr. Mandela became the first foreign leader to be awarded the Order of Canada. He later became the first living person to be awarded honourary Canadian citizenship in 2001.</p>\n<p>“In Canada, diverse perspectives and different opinions are celebrated, not silenced. Canadians know that we are stronger not in spite of our differences, but because of them. I am therefore very proud of the role Mr. Mulroney and Canada played in bringing an end to apartheid and helping Mr. Mandela’s fight for freedom.</p>\n<p>“I extend our congratulations once again to Mr. Mulroney on receiving this tremendous honour, and on showing the world that Canada champions pluralism and multiculturalism, both at home and abroad.”&nbsp;</p></div>\n      "
}