{
  "path": "/en/news/statements/2021/11/21/statement-prime-minister-25th-anniversary-final-report-royal-commission",
  "pageTitle": "Statement by the Prime Minister on the 25th anniversary of the final report of the Royal Commission on Aboriginal Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 25th anniversary of the final report of the Royal Commission on Aboriginal Peoples:</p>\n\n<p>“Twenty-five years ago today, the Royal Commission on Aboriginal Peoples released its final report. The five-volume landmark document outlined 440 recommendations on Indigenous governance, nation rebuilding, lands and resources, treaties, economic development, and social policy, and called for the renewal of the relationship between Indigenous and non-Indigenous peoples and all orders of government in Canada.</p>\n\n<p>“The Government of Canada established the Royal Commission on Aboriginal Peoples (the Commission) in 1991, in the aftermath of the conflict at Kanehsatà:ke and Kahnawà:ke, during a time of upheaval, concern, and hope, following longstanding challenges across the country. The Commission’s comprehensive mandate was developed in consultation with national and regional Indigenous leaders and groups, and federal, provincial, and territorial elected representatives. Its mandate was to investigate the evolution of the relationship between Indigenous peoples, the Canadian government, and Canadian society as a whole, propose specific solutions to the problems that have hindered those relationships, and examine all issues it deemed relevant to Indigenous peoples in Canada.</p>\n\n<p>“The Commission was co-chaired by Georges Erasmus, former National Chief of the Assembly of First Nations, and René Dussault, former Justice of the Quebec Court of Appeal, and had First Nation, Inuit, and Métis, as well as non-Indigenous commissioners. The Commission provided a historic opportunity for Indigenous voices to be heard and amplified. Over the course of five years, the commissioners held close to 200 days of public hearings, listened to numerous Indigenous organizations and over 2,000 individuals, and, commissioned 350 research studies dealing with virtually all aspects of Indigenous peoples’ lives. They also visited almost 100 Indigenous communities to hear directly from those unable to travel to the hearings. The report concluded that many policies pursued since the colonial period onwards had been wrong.<em> </em>In a country built on the ancestral lands of Indigenous peoples, many government policies and societal practices have led to the systemic erosion of many First Nations, Inuit, and Métis cultures, identities, practices, and governance structures and systems. &nbsp;</p>\n\n<p>“The Commission’s report, which was founded on the recognition of Indigenous peoples as self-governing nations with a unique place in Canada, was well received by many Indigenous leaders and communities at the time. Many were pleased with its thoroughness and reliability about the history of Crown-Indigenous relations, and found it to be an accurate reflection of their perspectives, interpretation of history, and historic and contemporaneous relationship with Canada.&nbsp;</p>\n\n<p>“Since 1996, the Commission’s report has continued to inform the actions of successive governments to support Indigenous peoples, even if many of its recommendations have not been fully implemented. It helped chart a path to a new relationship between the Government of Canada and Indigenous peoples. In 1998, the government released its official response to the report, <em><a href=\"https://publications.gc.ca/site/eng/9.849517/publication.html\">Gathering Strength: Canada’s Aboriginal Action Plan</a></em>. The Commission’s recommendations helped to pave the way for the Indian Residential Schools Settlement Agreement in 2007, the establishment of the Truth and Reconciliation Commission (TRC), and the government’s historic apology to former students of residential schools in 2008. Building on the work of the Commission, the TRC has had a broader impact on public policy, including a wider recognition of the harms and lasting impacts of residential schools. Canada also continues to come to terms with the tragedy of the unmarked graves and burial sites located near former residential schools earlier this year.</p>\n\n<p>“Together with the 94 Calls to Action of the TRC’s final report, the Commission’s report has shaped today’s pillars for reconciliation, which are to address the legacy of the past, recognize rights, and rebuild and renew relationships based on respect, cooperation, and partnership. The Commission also laid the groundwork for policy reforms with respect to Indigenous rights, land, and title, and for new legislative frameworks to recognize Indigenous jurisdiction and self-government.</p>\n\n<p>“The Government of Canada continues to dismantle colonial structures to fulfill its responsibilities toward Indigenous peoples. Following through on a recommendation from the &nbsp;Commission’s report, in 2017, the government dissolved the Department of Indian Affairs and Northern Development and established the Department of Crown-Indigenous Relations and Northern Affairs and the Department of Indigenous Services, to separate the process of rebuilding new relationships with Indigenous peoples from the administration of the <em>Indian Act</em>. With the recent coming into force of the <em>United Nations Declaration on the Rights of Indigenous Peoples Act</em>, the government is also taking further steps to recognize, respect, protect, and fulfill the human rights of Indigenous peoples, in consultation and cooperation with them.</p>\n\n<p>“While the Commission and subsequent initiatives have allowed for a more inclusive understanding and appreciation of the diversity and contributions of Indigenous peoples, we acknowledge that we still have a lot of work ahead of us, and that we must do what is necessary to accelerate our efforts in this regard. No relationship is more important to the government and to Canada than the one with Indigenous peoples. The country continues to come to terms with the realization of the intergenerational trauma of residential schools and its ongoing impact on lived realities. Many communities continue to grapple with the effects of colonization, which include systemic racism, violence, and discrimination, every single day. We have to acknowledge the truth and learn from our past to walk the shared path of reconciliation on a more secure foundation, one based on the principles of sharing and mutual recognition, respect, and responsibility.</p>\n\n<p>“On behalf of the Government of Canada, I invite everyone to learn more about Indigenous peoples, their histories, and the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1307458586498/1534857991723\">Report of the Royal Commission on Aboriginal Peoples</a>. Together, we can get to a place where self-determination and self-government are a reality for Indigenous nations and communities. I am confident that, by learning from the mistakes of the past, we can continue to gather strength, build capacity, and support healing to reach a full, authentic partnership, where nation-to-nation, Inuit-Crown, and government-to-government relationships can be truly renewed.”</p></div>\n      "
}