{
  "path": "/en/news/news-releases/2018/05/15/improved-railway-crossing-increase-safety-and-improve-traffic-flow",
  "pageTitle": "Improved railway crossing to increase safety and improve traffic flow in Edmonton | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Quality transportation infrastructure and efficient trade corridors are vital to Canada’s continued economic success. The Government of Canada is investing in infrastructure projects that improve safety, help people get to where they need to go faster, create good, well-paying middle class jobs, and boost productivity and economic growth.</p><p>The Prime Minister, Justin Trudeau, today announced more than $39 million for improvements to a railway crossing in Edmonton that will reduce congestion and travel times in the city. The improvements to the railway crossing at 50th Street and the Canadian Pacific Railway line will include:</p><ul><li>a new underpass beneath the existing railway crossing north of the Sherwood Park Freeway</li><li>two new traffic lanes on 50th Street, increasing the total number of lanes from four to six</li><li>the realignment and reconstruction of the intersection at 82 Avenue and 50th Street to maintain important connections between local residential neighbourhoods and commercial developments</li><li>new sidewalks and shared use paths along 50th Street so that people in the city can get where they need to go quickly and safely</li></ul><p>In addition, this project is expected to create nearly 900 good, well-paying middle class jobs during its construction.</p><h2>Quotes</h2><blockquote><p>“Canadian businesses rely on efficient and modern trade and transportation corridors to get their goods to market in our country and around the world. This investment will reduce congestion and travel times in Edmonton, give people safer ways to move around, and keep our businesses competitive, while creating hundreds of good, well-paying middle class jobs for Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our government is investing in Canada’s economy by making improvements to our trade and transportation corridors. We are supporting projects that will efficiently move commercial goods to market and people to their destinations, stimulate economic growth, create quality middle-class jobs, and ensure that Canada’s transportation networks remain competitive and efficient.”<br>—<cite>The Honourable Marc Garneau, Minister of Transport</cite></p></blockquote><blockquote><p>“One of the key areas of investments under the Investing in Canada long-term infrastructure plan is trade and transportation infrastructure. With investments of&nbsp;over&nbsp;$10&nbsp;billion over the next decade, we&nbsp;will help build stronger, more efficient transportation corridors to international markets and help Canadian businesses compete, grow and create more jobs for Canada's middle class.”<br>—<cite>The Honourable Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This funding is provided through the National Trade Corridors Fund, which supports projects that:<ul><li>help the transportation system withstand the effects of climate change and adapt to new technologies and innovation</li><li>address transportation bottlenecks and congestion along Canada’s trade corridors</li><li>support economic activity and the physical movement of goods and people in Canada</li><li>improve the movement of Canadian goods to markets around the world through our ports, airports, roads, railways, intermodal facilities, bridges and border crossings</li></ul></li><li>As announced in November&nbsp;2016 and detailed in&nbsp;Budget&nbsp;2017, the Government of Canada is investing $10.1&nbsp;billion over the next 11&nbsp;years in trade and transportation projects.&nbsp;</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.tc.gc.ca/eng/trade-transportation-corridors-initiative.html\">Trade and Transportation Corridor Initiative</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/tt-ct-eng.html\">Investing in Canada Plan</a></li><li><a href=\"https://www.tc.gc.ca/eng/future-transportation-canada.html\">Transportation 2030</a></li></ul></div>\n      "
}