{
  "path": "/en/news/readouts/2022/11/23/prime-minister-justin-trudeau-meets-belarusian-opposition-leader-sviatlana",
  "pageTitle": "Prime Minister Justin Trudeau meets with Belarusian Opposition Leader Sviatlana Tsikhanouskaya | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Belarusian Opposition Leader, Sviatlana Tsikhanouskaya.</p>\n\n<p>Prime Minister Trudeau reaffirmed Canada’s support for the democratic aspirations of the Belarusian people, and called for an end to the Lukashenko regime’s continuing human rights violations and efforts to silence dissent. He commended Ms. Tsikhanouskaya’s courageous work in defence of the rights and democratic ambitions of her fellow citizens.</p>\n\n<p>The Prime Minister and Ms. Tsikhanouskaya condemned the Lukashenko regime’s ongoing support for Russia’s unjustifiable aggression against Ukraine. The Prime Minister noted that on November 22, 2022, Canada announced further sanctions on Belarusian individuals and entities for facilitating and enabling the violation of Ukraine’s sovereignty and territorial integrity. These complement existing sanctions in response to both the regime’s support of the invasion and its systematic violation of human rights of the people of Belarus.</p>\n\n<p>The Prime Minister and Ms. Tsikhanouskaya looked forward to continued cooperation in support of the rights and aspirations of the people of Belarus.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/belarus/relations.aspx?lang=eng\">Canada-Belarus relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/belarus.aspx?lang=eng\">Canadian Sanctions Related to Belarus</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/11/canada-imposes-additional-sanctions-on-belarusian-regime.html\">Canada imposes additional sanctions on Belarusian regime</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/03/canada-imposes-additional-sanctions-on-belarusian-leadership.html\">Canada imposes additional sanctions on Belarusian leadership</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}