{
  "path": "/en/news/statements/2023/02/12/statement-prime-minister-international-day-against-use-child-soldiers",
  "pageTitle": "Statement by the Prime Minister on the International Day Against the Use of Child Soldiers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against the Use of Child Soldiers, also known as Red Hand Day:</p>\n\n<p>“Children should never be used as weapons of war. A child’s right to a safe, protective, and supportive environment is everyone’s responsibility. On this&nbsp;International Day Against the Use of Child Soldiers,&nbsp;Canada&nbsp;reaffirms its unwavering commitment to end the recruitment and use of children in armed conflicts.</p>\n\n<p>“Approximately 450 million children worldwide live in conflict-affected areas, including many displaced by war. In these situations, children can be forced to experience, witness, or participate in acts of violence, which causes resulting physical, physiological, and emotional harm that can have lifelong impacts.</p>\n\n<p>“The Government of Canada is committed to helping children live and grow in safety here at home, and around the world. In 2017, Canada introduced the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>. Endorsed by 106 member states of the United Nations,&nbsp;the<em>&nbsp;</em>Vancouver Principles prioritize the prevention of the recruitment and use of child soldiers during a peacekeeping mission. These principles ensure that all peacekeepers&nbsp;–&nbsp;military, police, and civilian&nbsp;–&nbsp;are prepared to act decisively and effectively to help prevent child recruitment. Canada also established the Dallaire Centre of Excellence for Peace and Security to prepare the Canadian Armed Forces to prevent the recruitment and use of children in armed conflict.</p>\n\n<p>“Today, we commit to continuing to work with the international community to ensure that all children can live their lives free from violence. Together, we can make sure children remain children, and build a safer, more just future for all.”</p></div>\n      "
}