{
  "path": "/en/news/news-releases/2017/01/18/prime-minister-canada-announces-parliamentary-secretary-minister",
  "pageTitle": "The Prime Minister of Canada announces Parliamentary Secretary to the Minister of Foreign Affairs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of <strong><a href=\"/en/parliamentary-secretaries/andrew-leslie\">Andrew Leslie</a></strong>, Member of Parliament for Orléans, to the position of Parliamentary Secretary to the Minister of Foreign Affairs.</p><p>In this new position, Mr. Leslie will assume special responsibilities for the Canada-U.S. relationship and play a critical role in building ties with the new U.S. administration.</p><p>Mr. Leslie was first elected in the Orléans riding in 2015. As a retired Lieutenant-General, he has a strong background in public service. His dedicated service has been recognized both domestically and internationally on numerous occasions during his 35-year career with the Canadian Armed Forces.</p><p>Mr. Leslie, currently the Chief Government Whip, will take up his responsibilities as Parliamentary Secretary on January 30, 2017. His successor as Chief Government Whip will be announced in the coming days.</p><h2>Quote</h2><blockquote><p>“I thank Andy for his outstanding service as Chief Government Whip, and I am delighted he has agreed to take on the role of Parliamentary Secretary to the Minister of Foreign Affairs with special responsibilities for the Canada-U.S. relationship. As a retired Lieutenant-General with years of experience working with the U.S., I know he has the necessary relationships and experience to help establish a constructive dialogue with the new U.S. administration.”<br><cite>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Related Product</h2><ul><li><a href=\"/en/parliamentary-secretaries\">Parliamentary secretaries</a></li></ul></div>\n      "
}