{
  "path": "/en/news/news-releases/2022/06/28/prime-minister-announces-additional-support-ukraine-and-shared",
  "pageTitle": "Prime Minister announces additional support for Ukraine and shared priorities at G7 Summit in Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G7 Summit in Elmau, Germany, where he announced significant new support for Ukraine. During the summit, he met with leaders of the world’s leading democracies to further our coordinated efforts to continue supporting Ukraine, build a cleaner future for everyone, get COVID-19 vaccines to those who need them, and advance our shared values of democracy, human rights, and gender equality.</p>\n\n<p>Building on the close collaboration of G7 partners in recent months to support Ukraine, Prime Minister Trudeau announced $151.7 million in new humanitarian, development, and peace and security support for Ukraine. This includes $75 million in humanitarian assistance to help get food, emergency cash and vouchers, protection, shelter and health services to Ukrainians. It also includes $52 million for agricultural solutions including grain storage units to help improve food security, $15 million to support lifesaving mine clearing efforts, and $9.7 million to support accountability for human rights violations. The Prime Minister also announced Canada will provide a $200 million loan to Ukraine through the International Monetary Fund to help meet its urgent liquidity needs. In addition, he announced $73 million in humanitarian assistance that Canada pledged on April 9, 2022, has now been allocated to address the crisis in Ukraine and neighbouring countries.</p>\n\n<p>At the Summit, G7 leaders committed to stand in unity to support the government and people of Ukraine in their fight for a peaceful, prosperous, and democratic future. This includes continuing to impose severe and direct economic costs on President Putin’s regime. The Prime Minister announced <a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/27/prime-minister-announces-additional-sanctions-support-ukraine\">new, targeted sanctions</a> against 34 additional supporters of Putin’s war and 48 entities in the Russian and Belarusian defence sectors. Canada will also sanction state-sponsored disinformation, ban the export of technologies that could improve Russia and Belarus’s manufacturing capability, and ban the import of certain gold goods from Russia. G7 leaders issued a joint statement in which they reiterated their commitment to support Ukraine as it seeks to defend itself from Russian aggression.</p>\n\n<p>Russia’s invasion of Ukraine has driven up the price of food and fuel, which is increasing the cost of living and creating food insecurity for people around the world, especially in the Global South. Last week, at the Commonwealth Heads of Government Meeting in Kigali, Rwanda, the Prime Minister <a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">announced $250 million in emergency food assistance</a> and discussed with other Commonwealth leaders the impacts of Russia’s military aggression against Ukraine on the world’s most vulnerable, including rising food prices, critical shortages, and fears of famine. In Elmau, the Prime Minister shared these perspectives with other G7 leaders, who collectively committed an additional $4.5 billion (USD) to protect the most vulnerable from hunger and malnutrition.</p>\n\n<p>Leaders had the opportunity to meet with Dr. Jutta Allmendinger, Chair of the 2022 Gender Equality Advisory Council, to discuss challenges related to gender equality, including the disproportionate impacts of the pandemic on women and girls; increased vulnerability of Ukrainian women and girls to human trafficking; and the use of sexual violence in conflict.</p>\n\n<p>Throughout the Summit, Prime Minister Trudeau spoke with G7 leaders and invited guests to reiterate the need for ambitious and coordinated action on climate change. Together, G7 Leaders will work to establish an open and cooperative Climate Club to accelerate progress toward the implementation of the <em>Paris Agreement</em>, which will complement Canada’s climate leadership including through the global pollution pricing challenge. G7 leaders also committed to narrow the global investment gap for sustainable infrastructure and mobilize private investment, and recognized Just Energy Transition Partnerships as a means to support transitions to low carbon and climate resilient societies. They also committed to take immediate action to secure energy supply and stop the increases in energy prices, without compromising on our climate and biodiversity goals, including the clean energy transition.</p>\n\n<p>To continue the fight against COVID-19, G7 leaders agreed to accelerate access to vaccines, diagnostics, and therapeutics in developing countries through the ACT-Accelerator. Prime Minister Trudeau highlighted that Canada has already contributed $732 million in multilateral funding for 2021-22 to meet its burden share and committed over $2 billion to date, making it one of the largest contributors. He also underlined Canada’s international leadership beyond funding, with the Government of Canada playing an active role in the governance of the ACT-Accelerator and its COVAX Facility, across all levels.</p>\n\n<p>At the conclusion of the Summit, G7 leaders issued a joint communiqué in which they agreed to jointly defend the rules-based international system and address the key challenges of our time. Guided by our shared values and our drive to making life better for people, leaders vowed to cooperate with civil society and partners beyond the G7 to strengthen the resilience of our societies, promote human rights online and offline, and achieve gender equality. &nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“At this critical time, we must continue to act together to defend peace, security, human rights, and democracy. At this G7 Summit, leaders worked together to further coordinate our efforts to support Ukraine, take ambitious climate action, and build strong economies with a better future for all people.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the start of Russia’s military aggression against Ukraine, Canada has committed $1.6 billion in loans and $1.3 billion in direct support to Ukraine, including $320 million in humanitarian assistance.</li>\n\t<li>During the Summit, Prime Minister Trudeau held bilateral meetings with the following leaders: the Prime Minister of the United Kingdom, Boris Johnson, the President of the European Commission Ursula von der Leyen, the Chancellor of Germany, Olaf Scholz, Prime Minister of Japan, Kishida Fumio, the President of France, Emmanuel Macron, Prime Minister of India, Narendra Modi, President of Indonesia, Joko Widodo, and the Prime Minister of Italy, Mario Draghi.</li>\n\t<li>Argentina, India, Indonesia, Senegal, and South Africa also participated in this year’s Summit at the invitation of Chancellor of Germany Olaf Scholz.</li>\n\t<li>With the exception of 2020, the G7 leaders have come together each year since the 1970s to discuss issues of domestic and global concern.</li>\n\t<li>Canada last held the presidency of the G7 in 2018. Germany holds the presidency in 2022, and Japan will hold it in 2023. Canada will next host the G7 in 2025.</li>\n\t<li>The Prime Minister also welcomed the news of the upcoming official visit of Chancellor of Germany Olaf Scholz to Canada from August 21 to 23, 2022. During this visit, the two leaders will meet to strengthen the Canada-Germany strategic partnership and discuss ways the two countries can partner to promote energy security and the transition to clean energy technologies, including secure access to key resources.</li>\n\t<li>The Prime Minister also welcomed the news of the upcoming visit of President of the European Commission Ursula von der Leyen to Canada in September 2022. The President’s visit will coincide with the Canada-European Union CETA Clean Tech Summit, which will bring together experts and industry leaders with a view to promoting bilateral trade, innovation, and growth in clean tech sectors.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/06/28/additional-canadian-support-ukraine-announced-2022-g7-summit\">Additional Canadian support for Ukraine announced at 2022 G7 Summit</a></li>\n\t<li><a href=\"/en/news/statements/2022/06/28/g7-leaders-communique-executive-summary\">G7 Leaders’ Communiqué – Executive Summary</a></li>\n\t<li><a href=\"/en/news/statements/2022/06/28/g7-leaders-communique\">G7 Leaders Communiqué</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-statement-g7-declaration.aspx?lang=eng\">2022 Resilient Democracies Statement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-statement-g7-ukraine-declaration.aspx?lang=eng\">G7 Statement on Support for Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-statement-annex-g7-declaration-annexe.aspx?lang=eng\">Annex to G7 Statement on Support for Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-06-28-g7-food-security-securite-alimentaire.aspx?lang=eng\">G7 Statement on Global Food Security</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-06-28-g7-climate-club-climat.aspx?lang=eng\">G7 Statement on Climate Club</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li><a href=\"https://www.g7germany.de/g7-en\">G7 Germany 2022</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n</ul></div>\n      "
}