{
  "path": "/en/news/news-releases/2022/09/23/prime-minister-announces-canadas-ambassador-china",
  "pageTitle": "Prime Minister announces Canada’s Ambassador to China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Jennifer May as Canada’s Ambassador to China.</p>\n\n<p>Ms. May’s experience with the Public Service of Canada has spanned over 30 years across three continents. She was most recently appointed as Canada’s Ambassador to Brazil in 2019 and has previously served in Canadian diplomatic missions in Europe, Latin America, and Asia, including in Beijing. She joined the Department of External Affairs in 1990.</p>\n\n<p>As Ambassador to China, Ms. May will lead Canada’s important work in standing up for democratic values, human rights, and the rule of law. Her work will be key to advancing Canadian priorities in the Canada-China relationship, including supporting the long-standing people-to-people, economic, and business ties between our two countries.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am pleased to announce the appointment of Jennifer May as Canada’s Ambassador to China. A dedicated public servant, Ms. May’s many years of diverse experience on international missions, and her deep understanding of Asia, will serve to manage this important bilateral relationship and advance Canadian interests in China.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada has an embassy in Beijing, and consulates general in Chongqing, Guangzhou, Hong Kong, and Shanghai. These diplomatic missions are supported by a secondary network of 10 trade offices, spread across the country, which are operated through an arrangement with the Canadian Commercial Corporation. China maintains an embassy in Ottawa and consulates general in Calgary, Montréal, Toronto, and Vancouver.</li>\n\t<li>Canada’s relationship with China is founded in strong people-to-people ties: over 1.8 million Canadians are of Chinese origin, Chinese languages are the most spoken languages in Canada after English and French, and immigrants born in China are one of Canada’s largest immigrant groups.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/09/23/jennifer-may\">Jennifer May</a></li>\n</ul></div>\n      "
}