{
  "path": "/en/news/readouts/2022/02/26/prime-minister-justin-trudeau-and-deputy-prime-minister-and-minister",
  "pageTitle": "Prime Minister Justin Trudeau and Deputy Prime Minister and Minister of Finance Chrystia Freeland speak with Prime Minister of Ukraine Denys Shymal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau joined a call between Deputy Prime Minister and Minister of Finance Chrystia Freeland and the Prime Minister of Ukraine, Denys Shymal<strong>, </strong>to offer support and express solidarity to the people in Ukraine.</p>\n\n<p>Prime Minister Trudeau and Deputy Prime Minister Freeland strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty and independence of Ukraine. The two leaders emphasized that Ukraine’s security is also Europe’s security and that of all democratic states seeking to uphold fundamental principles of international law and state sovereignty. Prime Minister Shymal thanked Prime Minister Trudeau for the recently announced sanctions and for Canada’s dedicated support to the people of Ukraine.</p>\n\n<p>Prime Minister Trudeau commended Prime Minister Shymal and President Zelenskyy’s courage and resolve to remain in Kyiv and to be leading the people of Ukraine in such exemplary fashion, through this unprovoked and unjustified Russian invasion. The Deputy Prime Minister praised the groundswell of support from citizens of Ukraine and those in the region and around the world, who are demonstrating their solidarity with Ukraine in various ways.</p>\n\n<p>Prime Minister Trudeau stressed that Russia’s actions are blatant violations of international law, and will not be tolerated. The prime ministers discussed ways in which Canada could continue to support Ukraine in the immediate future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/26/joint-statement-further-restrictive-economic-measures\">Joint Statement on further restrictive economic measures</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine\">Statement by the Prime Minister on Russia’s attack in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}