{
  "path": "/en/news/readouts/2023/04/20/prime-minister-justin-trudeau-advances-concrete-climate-action-major",
  "pageTitle": "Prime Minister Justin Trudeau advances concrete climate action at the Major Economies Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated virtually in the fourth Leaders-level meeting of the Major Economies Forum (MEF) on Energy and Climate, aimed at accelerating collective efforts toward keeping a 1.5-degree Celsius limit on climate warming within reach. The event set the tone for an ambitious year for climate action in the lead up to COP28.</p>\n\n<p>At the Forum, hosted by the President of the United States, Joe Biden,&nbsp;the Prime Minister joined leaders from the world’s major economies: Argentina, Australia, Brazil, Egypt, European Commission, Germany, Indonesia, Japan, Republic of Korea, Mexico, Türkiye, United Arab Emirates, and the United Kingdom. His Excellency António Guterres, Secretary-General of the United Nations, and representatives from China, France, India, Italy, and Saudi Arabia were also in attendance.</p>\n\n<p>In his remarks, the Prime Minister highlighted Canadian climate ambition and leadership, including on pollution pricing. As the G7 country with the largest percentage of emissions reduction since 2019, Canada is demonstrating a clear path to deliver good jobs and economic growth, while fighting the climate crisis. The Prime Minister invited other countries to join these efforts and join Canada’s Global Carbon Pricing Challenge.</p>\n\n<p>Prime Minister Trudeau also underlined other action that Canada is taking to address the climate crisis while growing the economy, including accelerating progress on zero-emission vehicles. Additionally, the Prime Minister expressed support on work to help grow clean energy resources, end deforestation globally, and reduce non-CO2 greenhouse gas emissions.</p>\n\n<p>The Prime Minister announced that Canada is joining the Methane Finance Sprint to raise funding ahead of COP28, to help developing countries tackle this potent greenhouse gas. He also announced that Canada will provide $3.5 million over three years to help two Small Island Developing States in the Pacific – Fiji and Samoa – reduce methane emissions and achieve their Paris Agreement targets.</p>\n\n<p>Prime Minister Trudeau also noted support for the launch of the Carbon Management Challenge and for a robust replenishment of the Montreal Protocol’s Multilateral Fund to incentivize early action on hydrofluorocarbons (HFC) reductions. Finally, the Prime Minister took the opportunity to share Canada’s long-standing support for the ongoing efforts to improve the capacity of multilateral development banks to address global challenges, including climate change.&nbsp;&nbsp;</p>\n\n<p>The Prime Minister looked forward to continuing to work with the major economies and make progress toward COP28, and deliver good jobs for citizens, strong economies, and a healthy environment globally.&nbsp;</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"/en/news/news-releases/2022/06/17/prime-minister-supports-climate-action-initiatives-major-economies\">Prime Minister supports climate action initiatives at Major Economies Forum</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/03/29/delivering-clean-air-and-strong-economy-canadians\">Delivering clean air and a strong economy for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reduction Plan: Clean Air, Strong Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-action/pricing-carbon-pollution/global-challenge.html\">The Global Carbon Pricing Challenge</a></li>\n</ul></div>\n      "
}