{
  "path": "/en/news/statements/2016/11/11/statement-prime-minister-canada-death-leonard-cohen",
  "pageTitle": "Statement by the Prime Minister of Canada on the death of Leonard Cohen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Leonard Cohen:</p>\n<p>“It is with deep sorrow that I learned today of the death of the legendary Leonard Cohen.</p>\n<p>“A most remarkable Montrealer, Leonard Cohen managed to reach the highest of artistic achievement, both as an acclaimed poet and a world-renowned singer-songwriter. He will be fondly remembered for his gruff vocals, his self-deprecating humour and the haunting lyrics that made his songs the perennial favourite of so many generations.</p>\n<p>“Leonard Cohen is as relevant today as he was in the 1960s. His ability to conjure the vast array of human emotion made him one of the most influential and enduring musicians ever. His style transcended the vagaries of fashion.</p>\n<p>“Leonard Cohen was made a Companion of the Order of Canada in 2003 and received many artistic honours during his lifetime, including being inducted into the Canadian Music Hall of Fame, the Canadian Songwriters Hall of Fame, and the American Rock and Roll Hall of Fame.</p>\n<p>“He received a Lifetime Achievement Grammy in 2010 and was awarded the Glenn Gould Prize for lifetime achievement in the arts in 2011.&nbsp; In 2013, with a career already spanning more than fifty years, he won Junos as Artist of the Year and Songwriter of the Year for his 2012 album Old Ideas. His music had withstood the test of time.</p>\n<p>“On behalf of all Canadians, Sophie and I wish to express our deepest sympathies to Leonard Cohen’s family, friends, colleagues and many, many fans.</p>\n<p>“Leonard, no other artist's poetry and music felt or sounded quite like yours. We'll miss you.”</p></div>\n      "
}