{
  "path": "/en/news/statements/2021/04/11/statement-prime-minister-national-medical-laboratory-week",
  "pageTitle": "Statement by the Prime Minister on National Medical Laboratory Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Prime Minister, Justin Trudeau, today issued the following statement on National Medical Laboratory Week, which runs from April 11 to 17: </span></span></span></p>\n\n<p><span><span><span>“Today, as we mark the first day of National Medical Laboratory Week, we recognize and celebrate Canada’s medical laboratory professionals. From behind the scenes to the front lines, they are essential members of our health care team and COVID-19 response.</span></span></span></p>\n\n<p><span><span><span>“Since the start of the global pandemic, over 28 million COVID-19 tests have been performed across the country. Behind each test are dedicated, highly skilled laboratory professionals who are working day and night, alongside other health professionals, to identify cases of COVID-19 to stop its spread and keep Canadians safe.</span></span></span></p>\n\n<p><span><span><span>“Every day, laboratory professionals play a vital role in our health and well-being – from informing accurate cancer diagnoses, to preparing life-saving vaccines, to monitoring the health of a mom-to-be. </span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“A</span><span>s we continue to come together to&nbsp;fight the pandemic, I hope you take a moment this week to think about Canada’s laboratory professionals and the invaluable work they have done, and continue to do, to save lives and protect us. Some of the best ways we can thank these everyday heroes are by continuing to wear a mask, downloading and using the COVID Alert app, listening to public health experts, and staying at home as much as possible.</span></span></span></p>\n\n<p><span><span>“To every laboratory professional: we see you and thank you.” </span></span></p></div>\n      "
}