{
  "path": "/en/news/news-releases/2022/09/16/president-south-korea-yoon-suk-yeol-visit-canada",
  "pageTitle": "President of South Korea Yoon Suk Yeol to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of South Korea, Yoon Suk Yeol, will visit Toronto and Ottawa, on September 22 and 23, 2022. This will be President Yoon’s first bilateral visit abroad since he was elected in March 2022.</p>\n\n<p>Prime Minister Trudeau will meet with President Yoon while he’s in Ottawa to advance shared priorities and strengthen the strong trade relationship between our two countries to generate more economic growth that benefits everyone. This includes working even more closely together on energy, including electric vehicle batteries, critical minerals, and emerging technologies, as well as securing supply chains to create good, well-paying middle class jobs and support Canadian workers.</p>\n\n<p>South Korea is a key global partner for Canada, in particular in the Indo-Pacific region when it comes to many issues, notably regional and global security. During their time together, the two leaders will also explore ways Canada and South Korea can continue to work together on regional security issues on the Korean Peninsula, including through Operation NEON, which monitors and deters North Korean maritime activities. They will also continue to condemn Russia’s illegal and unjustifiable invasion of Ukraine, work together to support the Ukrainian people, and reaffirm their commitment to upholding the rule of law.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and South Korea enjoy a strong relationship, based on our shared democratic values, extensive trade and foreign investment, and strong people-to-people ties. I look forward to welcoming President Yoon to Canada and deepening the relations between our two countries, working even more closely together to drive economic growth that benefits everyone, and delivering results for middle class Canadians and South Koreans.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>South Korea is Canada’s seventh largest trading partner, the seventh largest merchandise export market, and the sixth largest source of merchandise imports.</li>\n\t<li>Canada-South Korea two-way merchandise trade is robust, and reached $16.7 billion in 2021. In the same year, Canada exported $6.3 billion of merchandise to Korea, consisting primarily of mineral ores, mineral fuels and oils, precious stones and metals, wood pulp, and meat.</li>\n\t<li>Next year, Canada and South Korea will celebrate 60 years of diplomatic relations.</li>\n\t<li>Canada and South Korea established a bilateral “Strategic Partnership” in 2014 which led to the implementation of the Canada-Korea Free Trade Agreement in 2015, Canada’s first and only trade agreement in the Indo-Pacific region.</li>\n\t<li>Over 200,000 Canadians identify themselves as being of Korean origin. Over 27,000 Canadians currently reside in South Korea, including about 3,200 English language teachers. There are approximately 3,000 Korean-born adoptees in Canada.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/republic_korea-republique_coree/relations.aspx?lang=eng#a2\">Canada and the Republic of Korea</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/korea-coree/overview-apercu.aspx?lang=eng\">Canada-Korea Free Trade Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/30/prime-minister-justin-trudeau-meets-president-south-korea-yoon-suk-yeol\">Prime Minister Justin Trudeau meets with President of South Korea Yoon Suk-yeol</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}