{
  "path": "/en/news/news-releases/2019/07/10/secretary-general-north-atlantic-treaty-organization-visit-canada",
  "pageTitle": "Secretary General of North Atlantic Treaty Organization to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, will visit Canada from July 14-16.</p>\n\n<p>On July 15, Prime Minister Trudeau and Secretary General Stoltenberg will have a bilateral meeting at the Canadian Forces Base in Petawawa, Ontario, followed by a joint media availability. The Prime Minister and the Secretary General will then have lunch with service members.</p>\n\n<p>During the visit, the two leaders will discuss global challenges and key issues facing the Alliance. Prime Minister Trudeau will stress the need for NATO partners to work together to defend the rules-based international order, advance peace and security, and build a better future for people around the world. He will highlight Canada’s steadfast commitment to the Alliance, and underscore Canada’s leadership within NATO, including at the head of the enhanced Forward Presence battlegroup in Latvia and the NATO training and capacity building mission in Iraq.</p>\n\n<p>Secretary General Stoltenberg will also travel to Toronto later that day, to deliver a keynote address at Massey College.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I look forward to meeting with Secretary General Stoltenberg to discuss pressing issues facing the Alliance and its partners, and to highlight Canada’s leadership on security challenges around the world. This year marks NATO’s 70<sup>th</sup> anniversary. Now more than ever, it’s vital that NATO Allies work together to defend the rules-based international order, and build a more peaceful, prosperous future for people around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau last met with Secretary General Stoltenberg during the NATO Summit in Brussels in July 2018. This is Mr. Stoltenberg’s third visit to Canada since becoming Secretary General of NATO.</li>\n\t<li>Canada is a founding member of NATO. Since its inception in 1949, NATO has been a central pillar of Euro-Atlantic defence and a cornerstone of Canadian defence and security policy.</li>\n\t<li>Canada has been a persistent contributor to NATO and European security, including through leadership contribution to NATO’s enhanced Forward Presence Battlegroup in Latvia and command of the NATO Mission in Iraq and of the NATO Standing Maritime Group 2. Moreover, it provides broad support for Ukraine.</li>\n\t<li>The Canadian Armed Forces are engaged, agile, deployable and responsive, and Canada is proud to have contributed to every NATO operation since the founding of the Alliance.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nato.int/\">North Atlantic Treaty Organization (NATO)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and NATO</a></li>\n</ul>\n\n<p><strong>Note to media</strong><strong>: </strong>Advance accreditation will be required for media wishing to cover events at the Canadian Forces Base in Petawawa. Accreditation requests should be sent to Second-Lieutenant<strong> </strong>Brigitte Van Hende at <a href=\"mailto:Brigitte.VanHende@forces.gc.ca\">Brigitte.VanHende@forces.gc.ca</a></p></div>\n      "
}