{
  "path": "/en/news/statements/2021/12/13/statement-prime-minister-birthday-his-highness-aga-khan",
  "pageTitle": "Statement by the Prime Minister on the birthday of His Highness the Aga Khan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking the birthday of His Highness Prince Karim Aga Khan:</p>\n\n<p>“Today, we join millions of Shia Imami Ismaili Muslims in Canada and around the world to celebrate the 85th birthday of their spiritual leader, His Highness the Aga Khan.</p>\n\n<p>“For more than six decades, His Highness has worked to advance gender equality, reduce poverty, and improve health care and education for the most vulnerable around the world. In the face of the global humanitarian crisis brought about by the COVID-19 pandemic, His Highness has worked to provide relief and support for families and communities through the <a href=\"https://www.akdn.org/our-agencies/aga-khan-foundation\">Aga Khan Foundation</a>.</p>\n\n<p>“Guided by the values of compassion, diversity, and generosity, the Aga Khan is a global humanitarian leader who has spent his life helping to build a more inclusive, peaceful, and prosperous world. In recognition of his contributions to the international community, including through the <a href=\"https://www.pluralism.ca/\">Global Centre for Pluralism</a>, based in Ottawa, and the&nbsp;<a href=\"https://www.akdn.org/\">Aga Khan Development Network</a>, the Government of Canada was proud to name His Highness an honorary Canadian citizen in 2009 and to invest him as an honorary Companion of the Order of Canada in 2005.</p>\n\n<p>“On this day, Sophie and I thank the Aga Khan for his remarkable leadership on the world stage and we wish him many years of health and happiness to come.</p>\n\n<p>“Salgirah Khushiali Mubarak!”</p></div>\n      "
}