{
  "path": "/en/news/statements/2018/05/16/prime-minister-welcomes-fourth-report-canada-united-states-council",
  "pageTitle": "Prime Minister welcomes fourth report from Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the fourth report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders:</p><p>“Today, I welcome the <a href=\"https://advancingwomeninbusiness.com/wp-content/uploads/2018/05/Increasing-womens-access-to-capital_Report.pdf\">fourth report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders</a>, which focuses on increasing women’s access to capital.</p><p>“I thank the Council for their work to explore how we can improve access to capital, an issue identified in the Council’s <a href=\"https://advancingwomeninbusiness.com/pillar-three/\">last report</a> as a key barrier facing women entrepreneurs. This report looks at concrete steps we can take – as capital providers, women entrepreneurs, and governments – to ensure that all entrepreneurs have access to the capital and financing they need to turn their ideas into successful businesses.</p><p>“We know that governments can promote economic growth that works for everyone by providing targeted support for women-owned and women-led businesses. The report highlights the $1.4 billion in new financing available for women entrepreneurs through the Business Development Bank of Canada and the capital available to increase women’s participation in traditionally male-dominated industries. We are also providing financing and insurance solutions for those looking to export to global markets, as well as new lending for women entrepreneurs in agriculture.</p><p>“In addition to these measures, Canada remains committed to improve the representation of women in leadership positions in venture capital firms. We also committed to increase the proportion of procurement for women-led businesses, and we are advancing gender equality in Canada’s boardrooms thanks to Bill C-25. These measures represent important steps toward making sure women entrepreneurs have access to the capital they need to grow thriving businesses.</p><p>“When women entrepreneurs succeed, all of us benefit – and it is vital that we work together to remove the barriers that limit the potential of women-led companies. We welcome these recommendations, and will continue our efforts to support women entrepreneurs and business leaders. We look forward to the final report from the Council, which will look at the advancement of women leaders in the private sector.”</p></div>\n      "
}