{
  "path": "/en/news/news-releases/2016/11/17/prime-minister-will-travel-liberia-and-attend-xvi-summit-la",
  "pageTitle": "Prime Minister will travel to Liberia and attend the XVI Summit of La Francophonie in Madagascar | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will visit Monrovia, Liberia on November&nbsp;24 and will then travel to Antananarivo, Madagascar, to take part in the XVI Summit of La Francophonie on November 26 and 27, 2016.</p><p>The Government of Canada is committed to promoting diversity and inclusion, gender equality, economic growth, and protection of the environment worldwide.</p><p>In Liberia, the Prime Minister will meet with President of the Republic of Liberia, Ellen Johnson Sirleaf, as well as with stakeholders who advocate for women’s rights and gender equality around the world. They will discuss the role of women in peace and security, governance, health, economic growth, and sustainable development in Liberia and throughout Africa.</p><p>In Madagascar, the Prime Minister will attend the Francophonie Summit, where he will promote diversity, the empowerment of women and girls, the need for gender equality, and efforts to combat climate change.</p><p>Canada places special importance on its participation in La Francophonie, which is an important forum to discuss major international issues and promote diversity and inclusion. The Prime Minister will use this first visit to Africa to reaffirm Canada’s commitment to Africa and to working together on shared priorities.</p><h2>Quotes</h2><blockquote><p>“This visit to Liberia and Madagascar demonstrates Canada’s renewed commitment to Africa. We want to strengthen relations with our African partners and advance issues such as the rights of women and girls, gender equality, health, and peace and security.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"The French language and culture have played a defining role in shaping the bilingual, diverse country that is Canada today and I am proud to participate in the Summit for the first time. I look forward to building new ties with Francophone countries around the world and working closely to tackle the challenges we collectively face.\"<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“We know African youth are vital to the future of La Francophonie and the development of Francophone communities around the world. That is why Canada is committed to several projects to support youth and promote entrepreneurship.” &nbsp;<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>President Ellen Johnson Sirleaf was the first woman elected head of state in Africa. She was awarded the Nobel Peace Prize in 2011 for her efforts to further women’s rights and women’s participation in peacekeeping and peacebuilding.</li><li>In 2014-2015, Canada provided more than $24 million in development assistance to Liberia, in the areas of health, education,&nbsp; food security and the environment. This included supporting the efforts of the Global Fund, which has given thousands of people in Liberia access to HIV and tuberculosis drugs, as well as bed nets to provide protection from malaria. Canada also committed more than $130 million in response to the Ebola crisis that affected Sierra Leone, Guinea and Liberia.</li><li>The theme of the XVI Francophonie Summit is “Shared Growth and Responsible Development: Conditions for Stability Around the World and Within La Francophonie.”</li><li>The Summit will be chaired by the President of Madagascar, Hery&nbsp;Rajaonarimampianina.</li><li>Michaëlle Jean, former Governor General of Canada, will participate in her first Francophonie Summit as Secretary General of La Francophonie.</li><li>For several months, Canada has been working with other states and governments in La Francophonie to prepare documents for the Summit, including the Antananarivo Declaration and its resolutions.</li><li>The heads of state and governments of La Francophonie will make a decision on requests for membership in the <em>Organisation internationale de la Francophonie</em>, including the Province of Ontario’s request for observer status, and will announce the host country for the XVII Summit.</li><li>Africa plays a leading role within La Francophonie. The previous two summits (Kinshasa in 2012 and Dakar in 2014) took place in Africa. African countries account for 29 of the 54 full members.</li><li>Canada is pleased to have a special political, institutional, and trade relationship with Madagascar. This relationship is strengthened by the personal ties that unite our people, as well as our shared commitment to La Francophonie.&nbsp;</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/franco/event-evenements.aspx?lang=frahttp://www.international.gc.ca/development-developpement/humanitarian_response-situations_crises/foodassistance-assistancealimentaire.aspx?lang=eng\">Major La Francophonie Events - 2016 Francophonie Summit in Antananarivo, Madagascar</a></li><li><a href=\"http://www.international.gc.ca/franco/index.aspx?lang=eng\">Canada in La Francophonie</a></li><li><a href=\"http://www.francophonieantananarivo-2016.mg/\">XVIe Sommet de la Francophonie 2016</a> (Available in French only)</li></ul></div>\n      "
}