{
  "path": "/en/news/statements/2018/08/23/statement-prime-minister-black-ribbon-day",
  "pageTitle": "Statement by the Prime Minister on Black Ribbon Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black Ribbon Day, the National Day of Remembrance for the Victims of Communism and Nazism in Europe:</p><p>“On this day in 1939, days before the beginning of the Second World War, Nazi Germany and Stalin’s Soviet Union signed the notorious Molotov-Ribbentrop Pact. The pact would strip countries in Eastern and Central Europe of their autonomy, and dismantle communities across the continent, including Jewish and Roma communities, and others.</p><p>“These corrupt regimes used the pact as a tool to invade and gain control over Europe and its people. The aggression that followed caused immense suffering, as millions of people were senselessly murdered and robbed of their basic human rights.</p><p>“Today, I join Canadians and our international partners to pay tribute to the victims of Communism and Nazism in Europe. We stand with the survivors and their descendants as they continue to cope with the trauma caused by these cruel regimes.</p><p>“Many of those who escaped the Soviet and Nazi regimes found a welcoming home in Canada to start their lives anew. These refugees and their descendants have made remarkable contributions to our country, helping to shape our Canadian identity and build the strong, diverse, and prosperous Canada we know today. Their stories remind us that we all share a responsibility to safeguard human rights, protect freedom and democracy, and make sure events like these never happen again.</p><p>“On behalf of the Government of Canada, Sophie and I extend our deepest sympathy to those who suffered and lost loved ones as a result of the Communist and Nazi regimes. It is with their stories in mind that we will continue to promote and protect human rights, freedom, and democracy.”</p></div>\n      "
}