{
  "path": "/en/news/statements/2022/05/21/statement-prime-minister-results-general-election-australia",
  "pageTitle": "Statement by the Prime Minister on the results of the general election in Australia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the results of the general election in Australia:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Anthony Albanese on his election as the 31st Prime Minister of Australia.</p>\n\n<p>“As the new Australian government takes shape, I look forward to working with Prime Minister-elect Albanese to deepen relations between our two countries to benefit Canadians and Australians alike.</p>\n\n<p>“Canada and Australia enjoy a productive trade relationship and a strong friendship, built on deep people-to-people ties, common values, and shared priorities. On the world stage, we collaborate closely within the United Nations, the Commonwealth, the G20, the World Trade Organization, the Asia-Pacific Economic Cooperation forum, and the Five Eyes partnership. Australia is the fifth largest global destination for Canadian direct investment abroad and our biggest defence partner in the Indo-Pacific region.</p>\n\n<p>“Together, we will continue to work on the issues that matter most to people in both countries. This includes ensuring a strong economic recovery from COVID-19, continuing the fight against climate change, and enhancing peace and security in the Indo-Pacific and around the world – particularly in the face of Russia’s illegal invasion of Ukraine. We will also continue promoting free and open trade, helping businesses succeed, and creating good middle-class jobs through the Comprehensive and Progressive Agreement for Trans-Pacific Partnership.</p>\n\n<p>“As the Government of Canada continues the work to develop a new, comprehensive Indo-Pacific strategy, we will keep strengthening our partnership with Australia while creating economic growth and new opportunities for people on both sides of the Pacific.</p>\n\n<p>“I thank former Prime Minister Scott Morrison for his valuable partnership over the years and wish him all the best in his future endeavours.”</p></div>\n      "
}