{
  "path": "/en/news/statements/2020/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p>\n\n<p>“Today, we join the international community to observe <a href=\"https://earthday.ca/\">Earth Day</a>.</p>\n\n<p>“As Canadians, we are fortunate to be surrounded by an abundance of nature. With this privilege comes a shared responsibility to safeguard our environment and the natural treasures we have inherited.</p>\n\n<p>“We want our children and grandchildren to be able to enjoy our majestic forests, breathe clean air, and play by our beautiful oceans, lakes, rivers, and streams. That is why the Government of Canada has taken important steps to protect our environment, while growing the economy and making life more affordable for families across the country.</p>\n\n<p>“This year, families are going to observe Earth Day in a different way, because our parks are closed and Canadians have to stay home. This does not mean we cannot all still appreciate and continue to share a resolve to protect our natural beauty and our environment.</p>\n\n<p>“Climate change continues to present a long-term threat to our health and economy. Last week, we made a historic investment to clean up orphan and inactive oil and gas wells, creating thousands of jobs and lasting environmental benefits. We also proposed a new Emissions Reduction Fund to reduce greenhouse gas emissions in Canada’s oil and gas sector, with a focus on methane.</p>\n\n<p>“Our number one focus right now is dealing with the immediate threat of COVID-19. But this does not mean that we can neglect the environmental crisis. Canada can, and will, build a stronger and more resilient economy by investing in a cleaner and healthier future for everyone.</p>\n\n<p>“We remain committed to our climate plan, which includes ambitious actions to reduce emissions, promote clean technology and jobs, and put a price on pollution. To meet our <a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/paris-agreement.html\">Paris Agreement</a> commitments, we are taking action so we can exceed Canada’s 2030 emissions reduction goal, achieve net-zero emissions by 2050, and position our businesses and industries to remain globally competitive. We are also committed to protecting 25 percent of Canada’s land and 25 percent of our oceans by 2025 to preserve our natural legacy for our generation and the next.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to do their part for the environment and to reflect on how fortunate we are to live in such a beautiful country.”</p></div>\n      "
}