{
  "path": "/en/news/statements/2020/06/14/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for <a href=\"https://www.canada.ca/en/treasury-board-secretariat/services/innovation/awards-recognition-special-events/national-public-service-week.html\">National Public Service Week</a>, which runs from June 14 to 20, 2020:</p>\n\n<p>“Every year, the Government of Canada marks National Public Service Week, in recognition of the important role federal public servants play in making this country a better place.</p>\n\n<p>“This year has been one of the most challenging in living memory, and has underlined the contribution of the federal public service and its devotion to serving Canadians every day. This rings especially true in uncertain times.</p>\n\n<p>“Since the early stages of the COVID-19 crisis, public servants have quickly mobilized to deliver emergency financial and economic assistance, support enhanced testing and research activities for the virus, and assist Canadians stranded abroad who wanted to come home.</p>\n\n<p>“As many of their colleagues worked on these urgent measures, other federal employees were ensuring that our food supply was safe and reliable, that our borders were secure, and that our transportation systems remained efficient.</p>\n\n<p>“Public servants were also there for Canadians when our country was tested by other difficult events this year, such as the historic snowstorm in Newfoundland and Labrador and the spring floods in Fort McMurray, Alberta. They also took part in the Government of Canada’s efforts to assist the families and loved ones of the victims of Ukraine International Airlines Flight PS752.</p>\n\n<p>“Public servants have demonstrated their dedication, professionalism, and creativity through and through. Our public service needs the right people to continue to serve Canadians well. This means recruiting and retaining talented people from a diversity of communities across the country.&nbsp; &nbsp;&nbsp;</p>\n\n<p>“To federal public servants, I say thank you. This has been a challenging year for our country, and the important work you do every day to serve Canadians will also be on display during this week’s virtual events which have been planned with everyone’s safety in mind.”</p></div>\n      "
}