{
  "path": "/en/news/statements/2021/07/26/weestamakaywin-ouschi-kischee-li-ministr-chi-kischi-baen-rseu-kenadaw",
  "pageTitle": "Weestamakaywin ouschi Kischee Li Ministr chi kischi baen rseu Kenadaw soon 30th Li Gouvarneur General, Soo Pleu Miyoer Kischi Awnoerab Mary Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kischee Li Ministr, Justin Trudeau, anoush pakitinam ooma ikouhk weestamakaywin chi kischi baen rseu Kenadaw soon neu Li Gouvarneur General, Soo Pleu Miyoer Kischi Awnoerab Mary Simon:</p>\n\n<p>“Poor ooki Li Gouvarnimaw di Kenadaw, niya moon l'onoer akwa li plizeer chi kischi baen rseu Kenadaw soon 30th Li Gouvarneur General, Soo Pleu Miyoer Kischi Awnoerab Mary Simon.</p>\n\n<p>“Geenihtowikow didawn Nunavik, dan li nor Quebec, Soo Pleu Miyoer gee-ayaw nawshpichi ta vee aen atoushkayt poor aykwawniki wawshakawmihk wiya. Noo poonistam chi weechihiwayt poor En Niskimoo li drway akwa ishipimawchihounawniwun, lee zhen moond, akwa itaykawweekihk, ki outistikouw mishcyat l'onoer akwa wiya neekawn En Niskimoo chi michimina atoushkaywina ishi aen zhawnd Kenadaw opaminikayw.</p>\n\n<p>“Shawpou soon myeukishkayimikawshhowin atoushkaywin, Soo Pleu Miyoer ki nawkwun for ahkamaymouwin chi awn navawn parmi li moond, manawchischikaywin, akwa li drway'd moond li troob. Ki wawpastahiwayw neekawneeshtawmawkaywin didawn di fors kakwuy ka michiminikouwuk awntor deu li moond ouschi di’ Arctic la riizhyoon, tou lee deu mishiway itay akwa tooroon not grawn piyee. Ishi Kenadaw soon Li Gouvarneur General akwa opaminikayw ishi kiyanawn li tayraen li Constitution akwa institutions, nikishkayistaen chi weechihiwayw soon ispray kishkayhtumowin akwa shoohkayihtumowin chi neepawistamakayt aen zhawnd Kenadaw didawn kahkiyuw li jeufarawns, tou lee deu out akwa lout bor la mayr, avek aykishchiitaymoowin akwa l'ispree, pi didawn deu Kenadaw soon promyee la lawngaezh. Akwa meena nitawpwaystayn aykwawnima, ishi Kenadaw soon li Shef di Neekawneew, chi atoushkayw ka weechihiwayt ooki braev li maambr ouschi Aen zhawnd Kenadaw L'armee La'sarvis aykwawniki noo poonistahkik kischee mishaw li saakrifis poor pat dawnzhee akwa kenawaymouwin ouschi kiyanawn li tayraen akwa li moond.</p>\n\n<p>“Nimiyeustayn mishi-akishoowin ouschi en sort ooma en momawn, ishi kiyanawn li tayraen ahkamaymi nakishkawtamwak avek oohin li troub di’ vayritee ouschi kiyanawn aan paar pawsee. Nikishkayistaen aykwawnima, ishi Kenadaw soon neekawn Indigene Li Gouvarneur General, Soo Pleu Miyoer chikee ahkamaymou soon tawn poor chi weechihikouyahk ka nakishkamahk oohin la vayritee ayimoohowin tout awn sawmbl, chi pimouhtayahk ooma aen pawr ouschi naayihtumowin, akwa chi oushistahk miyeuweechaytouwin awntor deu kahkiyuw aykwawniki ka oushistawchik li tayraen owikiwaw.</p>\n\n<p>“Anoush ooma en zhournee, kiyanawn meena l'onoer ishi Kischee La Renn Zabat Elizabeth la cuzyem, La Renn ouschi Kenadaw, aykwawina poor 69 tai pawsee ki weechihiwayw Li Tayraen akwa soon li moond avek kishaywatishiwin, aykishchiitaymoowin, akwa kishkayhstemowin. Aykwawnima ooma 13th napwaenmawn poor Li Gouvarneur General ouschi Kenadaw Kischee La Renn ashpinay ouschi ka geetakoo ishi ita la Renn pi la rway ka ayapichik didawn 1952.</p>\n\n<p>“Maarsii ishi Soo Pleu Miyoer Kischi Awnoerab Mary Simon poor outina ooma chi weechihiwayt akwa i va oofayr mitouni boon choer koonplimawn. Ninatoumawak kahkiyuw Aen zhawnd Kenadaw chi mishka pakoshayimoowin akwa miyeustamouwin didawn ooma aenportaan anavaan poor kiyanawn li tayraen, akwa kweetakoon avek niya chi mamishchimayahk maykwawt ka paytaw soon wawpaschikaywin poor kishchitaymoowin, nawut nayikoohk, akwa ayiwawk pikou Kenadaw ishi kiyanawn li tayraen il i hoo akwa li vyeu i’ofis.”</p>\n\n<h2>I soun paray Shakamouhtawin</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Kischee Li Ministr weestamakayw La Renn soon la paarmisyoon ouschi Kenadaw soon keestwawm Li Gouvarneur General</a></li>\n</ul></div>\n      "
}