{
  "path": "/en/news/statements/2022/01/22/gichi-ogimaa-odikidowin-nigodwaaso-biboon-e-izhisenig-gaa-gii",
  "pageTitle": "Gichi-Ogimaa odikidowin nigodwaaso-biboon e-izhisenig gaa-gii-baashkizond awiya La Loche Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gichi-Ogimaa Justin Trudeau noongom o-gii-bagidinaan owe ikidowin e-izhisenig nigodwaaso-biboon gaa-gii-baashkizond awiya gii-nisind La Loche Saskatchewan:</p>\n\n<p>“Ngodwaaso-biboon izhise imaa dazhiikewining La Loche Saskatchewan gaa-gii-nisindwaa niiwin awiyag dago gii-maaki’indwaa niizhwaaso awiyag godag.</p>\n\n<p>“Wiijigaabawitawaanaanig Saskatchewan gaye Gaanada Akiing gaa-onjiiwaad mikwenimaadaanig gaye naagadawenimaadaanig igiwe gaa-gii-nisindwaa. Wiinge go gi-wiijigaabawitawaanaanig gaa-gii-ishkwaanewaad gaye odinawemaaganiwaa’ igi gaa-gii-nisindwaa gaye owiijiiwaaganiwaa’ igi giiyaabi gaa-onji-gagwaadagendamowaad owe gii-izhisenig.</p>\n\n<p>“Gii-naanaagadawendamang owe gaa-gii-izhiseg, gi-nisidawinaamin gaawiin e-onizhishinzinog baashkiziganan e-maanzhi-aabajichigaadegin miinawaa. Ji-mino-bimaadiziwaad gakina Gaanada Akiing gaa-ayaawaad izhi-anda-wenjigaade amii dash endawendamaang ji-naadamawangidwaa gakina omaa gaa-ayaawaad gaawiin ji-gotaajisigwaa gii-daawaad odazhiikewininiwaang. Gakina gaa-gii-baashkizondwaa gaye gaa-gii-zhaabwiiwaad omaa Gaanada Akiing gaye odinawemaaganiwaa – Saskatchewan Quebec City Toronto Nova Scotia, gakina weweni daa-bimaadiziwag.</p>\n\n<p>“E-wii-ziidonangwaa dazhiikewining gaa-onjiiwaad daabishkoo La Loche, 2020 gii-izhiseg owe Ogimaawiwin Gaanada Akiing onji, nin-gii-ikidomin <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">awashime 1,500 daso dinookaanan baashkiziganan ji-webinigaadegin</a><a id=\"_Hlt93337976\" name=\"_Hlt93337976\"></a><a id=\"_Hlt93337977\" name=\"_Hlt93337977\"></a>. 2021 gii-izhiseg nin-gii-ikidomin gegaa $600 miniiyan daswaabik awashime niso-biboon izhiseg ji-aabadizid ji-wiiji’indwaa Anishinaabeg dago Eshkiimeg dago Wiisaakodewininiwag indendamowining mino-ayaawin inake. Owe gii-izhichigeng da-onji-mashkawichigaade weweni inendamowin Anishinaabe dazhiikewining – gaye miziwe Gaanada Akiing. Da-zoongi-wiiji’aa gaa-ayaad dazhiikewining, ji-gikino’amaading gaye ji-ozhi’ind-waa ge-inanokiiwaad iwe, ji-ozhichigaadegin gaye oshki-wiiji’iwe-izhichigewinan. Owe ogimaawiwin gaye da-onji-wiidookawaawag Anishinaabeg, gaye oodenaansing, gaye akiikaaning gaa-ayaawaad nawach babenak ji-izhi-bimaadiziwaad Anishinaabensag.</p>\n\n<p>“Owe Gaanada Aki ogimaawiwin wii-ziidooshkaagemagan ji-noojimowaad igi gaa-gii-onji-maanzhisewaad gii-nisindwaa imaa La Loche, ji-wiidookawindwaa igi Anishinaabeg gaa-niigaanishkamowaad, anishinaabewaadiziwin gaa-biminizha-igaadeg gaye gagwaadigisewin gaa-noojimotoowaad Anishinaabe’ ji-wiiji’indwaa. Ayaamagan ji-wiiji’indwa Anishinaabeg dago Eshkiimeg dago Wiisakodewininiwag imaa Hope for Wellness Helpline gaa-izhinikaadeg 1-855-242-3310 gemaa omaa <a href=\"https://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>. Da-wiiji’aawag awiyag 24 daso-diba’igan endaso-giizhig imaa Wellness Together Canada ishkwaandem 1-866-585-0445 gemaa <a href=\"http://www.wellnesstogether.ca\">www.wellnesstogether.ca</a>. Nin-ga-wiiji’iwemin ji-onji-noojimowaad inendamowwining inake Anishinaabeg – gaye gakina Gaanada Akiing gaa-onjiiwaad awiyag.</p>\n\n<p>“Omaa dash Gaanada Akiing ogimaawining onji, ninandomaag gakina awiyag ji-mikwenimaawaad ini gaa-gii-nisindwaa iwe apii imaa La Loche gaa-gii-aanjisenigin gaye obimaadiziwiniwaan January 22 gii-izhisenig 2016. Gi-wiijigaabawitaagoom, gi-ziidoshkaagoom gakina.”</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"bb8b2655-90a7-4955-b781-ad4667676918\" href=\"/en/news/statements/2022/01/22/statement-prime-minister-sixth-anniversary-shootings-la-loche\">Statement by the Prime Minister on the sixth anniversary of the shootings in La Loche, Saskatchewan</a></li>\n</ul></div>\n      "
}