{
  "path": "/en/news/news-releases/2015/11/30/prime-minister-announces-action-clean-jobs-and-energy",
  "pageTitle": "Prime Minister announces action on clean jobs and energy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today joined French President François Hollande, U.S. President Barack Obama and Bill Gates to announce the launch of Mission Innovation, an ambitious clean technology initiative that partners Canada with the United States, 18&nbsp;other countries, and leading representatives from the private sector.</p>\n<p>This global partnership, announced during the first day of the 21<sup>st</sup> Conference of the Parties to the United Nations Framework Convention on Climate Change (COP 21), seeks to double government investment over the next five years in clean energy research and development, and to spur private sector investment in clean technology.</p>\n<p>The Government of Canada fully supports this goal and clean technology research and development. Investing in clean technology can deliver real benefits for the environment and the economy, including more good-paying, middle class jobs for Canadians.</p>\n<p>Canada has a plan to invest an additional $100 million each year in clean technology producers, so they can tackle Canada’s most pressing environmental challenges, and create more opportunities for Canadian workers. The government will also invest an additional $200 million each year to support innovation and the use of clean technologies in the natural resources sector.</p>\n<p>By joining this coalition today, Canada is demonstrating its commitment to building stronger climate action partnerships and becoming a global leader on climate change and clean energy.&nbsp;</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada is proud to be a partner in this ambitious global initiative. By working together, we will deliver real benefits for our environment while also strengthening our economy, including through the creation of more middle class jobs.”</p>\n<p>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“A strong economy and healthy environment go hand-in-hand, and we are committed to leaving our children and grandchildren with a more sustainable and prosperous country. Mission Innovation will tap into the vast economic opportunities of our environment by helping to create the growth and jobs Canadians need.”</p>\n<p>– <em>Rt. </em><em>Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Twenty countries are participating in the initial launch of Mission Innovation, including Australia, Brazil, Canada, Chile, China, Denmark, France, Germany, India, Indonesia, Italy, Japan, Mexico, Norway, Saudi Arabia, South Korea, Sweden, the United Arab Emirates, the United Kingdom, and the United States.</li>\n<li>Mission Innovation is focused on increasing private sector investment with the help of a group of investors from countries that are prepared to contribute unprecedented levels of capital and drive clean innovation from the laboratory to the market place.</li>\n</ul>\n<p><strong>Related Product</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2015/11/30/canada’s-participation-mission-innovation\">Backgrounder – Canada’s Participation in Mission Innovation</a></li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://mission-innovation.net/joint-statement/\">Mission Innovation – Joint Launch Statement</a></li>\n</ul></div>\n      "
}