{
  "path": "/en/news/news-releases/2018/01/15/governor-general-canada-visit-ukraine-and-latvia",
  "pageTitle": "Governor General of Canada to visit Ukraine and Latvia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will visit Ukraine and Latvia, from January 17 to 19, 2018.</p><p>During the visit, the Governor General will meet with the President of Ukraine and the President of Latvia. Supported by the Canadian missions in Kyiv and Riga, the Governor General will highlight opportunities for further collaboration to strengthen Canada’s relationship with both countries.</p><p>In her role as Governor General and Commander-in-Chief, Her Excellency will visit Canadian troops in Ukraine serving under Operation UNIFIER and Canadian troops in Latvia serving under Operation REASSURANCE as part of NATO’s enhanced Forward Presence.</p><p>Her Excellency will be accompanied by General Jonathan Vance, Chief of the Defence Staff.</p><h2>Quote</h2><blockquote><p>“Canada enjoys an excellent relationship with Ukraine and Latvia. We will continue to support these two countries by contributing to the ongoing stability of the region. The Governor General’s visit will help further strengthen our political and commercial ties, and reaffirm our friendship.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>This will be Governor General Julie Payette’s first overseas visit as Commander-in-Chief to meet with Canadian troops.</li><li>This will be the first visit by a Governor General in Latvia. The last Governor General to visit Ukraine was the Right Honourable Michaëlle Jean in 2009.</li><li>Canada is unwavering in its support to Ukraine, both in helping to preserve and protect Ukraine’s sovereignty and in providing assistance to Ukraine to implement key reforms.</li><li>Operation UNIFIER is the Canadian Armed Forces training mission in Ukraine through which Canada provides military training and capacity-building assistance to Ukrainian Forces personnel in support of Ukraine’s efforts to maintain sovereignty, security, and stability.</li><li>The Canada-Ukraine Defence Cooperation Arrangement, signed in April 2017, is a key part of Canada’s multifaceted support for Ukrainian territorial integrity and sovereignty, security, and stability. This arrangement provides a framework for cooperation on important defence issues.&nbsp;</li><li>Canada supports NATO’s strengthened deterrence and defence posture in the Baltic region and NATO’s enhanced Forward Presence, which includes the deployment of multinational battlegroups in Latvia, Estonia, Lithuania, and Poland.</li><li>Canada leads NATO’s multinational enhanced Forward Presence Battlegroup Latvia, and contributes approximately 450&nbsp;troops to the deployment&nbsp;as part of Operation REASSURANCE. Canada is proud to serve as the Framework Nation for the battlegroup and to serve with our Allies, Albania, Italy, Latvia, Poland, Slovenia, and Spain.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/ukraine/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Ukraine relations</a></li><li><a href=\"http://international.gc.ca/world-monde/latvia-lettonie/relations.aspx?lang=eng\">Canada – Latvia relations</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/op-unifier.page\">Operation UNIFIER</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/nato-ee.page\">Operation REASSURANCE</a></li></ul></div>\n      "
}