{
  "path": "/en/news/readouts/2022/02/10/prime-minister-justin-trudeau-convenes-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group on the ongoing illegal blockades taking place across the country that are threatening trade, jobs, the economy, and our communities. He was joined by ministers and senior officials who are actively engaged and working closely with provincial and municipal governments, and who are assessing the requirements and deploying all federal resources necessary to help them get the situation under control.</p>\n\n<p>The Prime Minister, ministers, and officials emphasized their serious concern with the illegal blockades and occupations, and their determination to see them end quickly.&nbsp;The group discussed the significant federal support that the RCMP is providing to law enforcement partners both in Ontario and across Canada.</p>\n\n<p>Ministers and officials updated the Prime Minister on their continued engagement efforts with their provincial and municipal counterparts. In particular, they discussed their effort to work with the Government of Ontario to restore access to the Ambassador Bridge and other ports of entry, which are vital trade corridors and&nbsp;where the illegal blockades are resulting in real harm to jobs and our economies on both sides of the border. Ministers and officials have also been in close contact with representatives and officials from the United States of America to align efforts to resolve this situation. The Prime Minister discussed his recent conversation with Premier Ford. The group committed to continue providing federal resources to support enforcement efforts in Ottawa where the occupation has significantly disrupted local residents’ lives, impacting businesses and families with harassment, threats of violence, and vandalism. They reiterated that the federal government has and will continue to respond to all requests for appropriate support and resources.</p>\n\n<p>The Prime Minister and ministers will continue to work closely with all orders of government and local authorities to respond with whatever it takes to help provinces and municipalities end the blockades and bring the situation under control. The government’s top priority remains keeping people and communities safe, and defending jobs, trade, and our economy.</p></div>\n      "
}