{
  "path": "/en/news/readouts/2020/09/21/prime-minister-justin-trudeau-and-minister-intergovernmental-affairs",
  "pageTitle": "Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc speak with Manitoba Premier Brian Pallister | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc spoke with Manitoba Premier Brian Pallister to discuss the COVID-19 situation and how they will work together to support Canadians and keep people safe.</p>\n\n<p>The leaders discussed COVID-19’s impact on health care systems across the country. The Prime Minister reiterated his commitment to hosting a First Ministers’ Meeting this fall to discuss health transfers.</p>\n\n<p>Premier Pallister highlighted Manitoba’s focus on infrastructure projects as a key element in building safe and resilient communities. The Prime Minister, the Minister, and the Premier agreed that their governments will work closely together to make progress on short-term priorities, including the Lake Manitoba and Lake St. Martin Outlet Channels Project.</p>\n\n<p>Prime Minister Trudeau, Minister LeBlanc, and Premier Pallister also discussed internal trade and its ability to help in the economic recovery phase. Prime Minister Trudeau thanked Premier Pallister for his leadership in the area, and all agreed on the need to see progress on the issue through ongoing work to encourage provinces and territories to reduce barriers to trade.</p>\n\n<p>They agreed to continue to work closely together on the response to COVID-19, and the ongoing supports needed for economic recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2020/09/10/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address\">Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://iaac-aeic.gc.ca/050/evaluations/proj/80148\">Lake Manitoba and Lake St. Martin Outlet Channels Project</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}