{
  "path": "/en/news/news-releases/2020/05/14/prime-minister-announces-appointment-new-associate-chief-justice-her",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of Her Majesty’s Court of Queen’s Bench for Manitoba | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Gwen B. Hatch, a judge of Her Majesty’s Court of Queen’s Bench for Manitoba (Family Division), as the new Associate Chief Justice of Her Majesty’s Court of Queen’s Bench for Manitoba (Family Division).</p>\n\n<p>Associate Chief Justice Hatch replaces the Honourable Marianne Rivoalen, who was appointed to the Federal Court of Appeal on September 20, 2018.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Gwen B. Hatch continued success in her new role as Associate Chief Justice of the Family Division of Her Majesty’s Court of Queen’s Bench for Manitoba. Justice Hatch brings almost 40 years of experience in family law, wills, and estates litigation, including nearly seven as a judge on the province’s superior court. I trust that she will serve Manitobans well.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Justice Hatch was appointed to Her Majesty’s Court of Queen’s Bench for Manitoba (Family Division) on June 6, 2013.</li>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General, on the advice of Cabinet and on the recommendation of the Prime Minister.</li>\n\t<li>Her Majesty’s Court of Queen’s Bench for Manitoba deals with the most serious criminal trials and civil claims adjudicated in the province. The Court’s specialized Family Division hears cases exclusively in the area of family law and child protection.&nbsp;</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/05/14/honourable-gwen-b-hatch\">The Honourable Gwen B. Hatch</a></li>\n</ul></div>\n      "
}