{
  "path": "/en/news/news-releases/2020/10/01/prime-minister-announces-infrastructure-plan-create-jobs-and-grow",
  "pageTitle": "Prime Minister announces infrastructure plan to create jobs and grow the economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians across the country are feeling the impacts of COVID-19, and the Government of Canada will continue to be there to offer support for those who need it. As we work toward our economic recovery from the pandemic and begin to build back better, the government will continue to make investments in infrastructure that will create good jobs for Canadians, build stronger communities, and make our economy more sustainable and resilient for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $10 billion in new major infrastructure initiatives to create jobs and economic growth. The Canada Infrastructure Bank’s (CIB) Growth Plan will help Canadians get back to work and is expected to create approximately 60,000 jobs across the country. The three-year plan will connect more households and small businesses to high-speed Internet, strengthen Canadian agriculture, and help build a low-carbon economy.</p>\n\n<p>The Growth Plan will invest in five major initiatives:</p>\n\n<ul>\n\t<li>$2.5 billion for clean power to support renewable generation and storage and to transmit clean electricity between provinces, territories, and regions, including to northern and Indigenous communities.</li>\n\t<li>$2 billion to connect approximately 750,000 homes and small businesses to broadband in underserved communities, so Canadians can better participate in the digital economy.</li>\n\t<li>$2 billion to invest in large-scale building retrofits to increase energy efficiency and help make communities more sustainable.</li>\n\t<li>$1.5 billion for agriculture irrigation projects to help the agriculture sector enhance production, strengthen Canada’s food security, and expand export opportunities.</li>\n\t<li>$1.5 billion to accelerate the adoption of zero-emission buses and charging infrastructure so Canadians can have cleaner commutes.</li>\n</ul>\n\n<p>To accelerate the delivery of projects in which the CIB intends to invest, it will also allocate $500 million for project development and early construction works.</p>\n\n<p>Today’s announcement is part of the government’s campaign to create over one million jobs to rebuild from the pandemic, and our more than $180 billion commitment to invest in new infrastructure across Canada. The government will continue to focus on making investments to strengthen the middle class, create new jobs, and grow the economy, as we work together to fight COVID-19 and build a more resilient Canada. Together, we can create a Canada that is healthier and safer, cleaner and more competitive, and fairer and more inclusive for future generations.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“By investing in infrastructure, we are strengthening our communities and ensuring good jobs for today and in the future. We will continue to do what it takes to support Canadians through this crisis, safely get our economy back up and running, and get people back to work.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s infrastructure plan invests in thousands of projects, creates jobs across the country, and builds stronger communities. The Canada Infrastructure Bank is critical to expanding Canada’s ambition by bringing in the private sector to get more infrastructure built. The Bank’s $10-billion Growth Plan, focused on investments in broadband, clean energy, retrofits and agricultural irrigation, will create 60,000 jobs, grow the economy and help build a low-carbon future.”</p>\n\n<footer class=\"default\">&nbsp;The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“One of the defining features of the Canada Infrastructure Bank is attracting private investment to new infrastructure. Every dollar of public investment in these initiatives is intended to attract additional dollars from private and institutional investors. In that way, the CIB can have bigger impacts that benefit Canadians and Canada’s economy. We will be moving forward quickly to implement the $10 billion Growth Plan and deliver results.”</p>\n\n<footer class=\"default\">Michael Sabia, Chair of the Canada Infrastructure Bank</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Through the Canada Infrastructure Bank, the federal government has committed $35 billion to support infrastructure projects across the country. This includes the Bank's $10 billion Growth Plan announced today.</li>\n\t<li>The CIB was announced as part of the Government of Canada's historic, over $180 billion Investing in Canada Plan. It was created to work in partnership with provincial, territorial, municipal, and Indigenous partners, and leverage the private sector, to build infrastructure across Canada.</li>\n\t<li>The CIB attracts private sector and institutional investment to build sustainable infrastructure projects that are in the public interest.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://cib-bic.ca/en/canada-infrastructure-banks-growth-plan-backgrounder/\">Canada Infrastructure Bank’s $10 billion Growth Plan</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://cib-bic.ca/en/\">Canada Infrastructure Bank</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n</ul></div>\n      "
}