{
  "path": "/en/news/news-releases/2020/09/29/prime-minister-co-chairs-high-level-meeting-address-economic",
  "pageTitle": "Prime Minister co-chairs high-level meeting to address economic devastation caused by COVID‑19 and announces new funding to fight the pandemic | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Ministers Justin Trudeau of Canada and Andrew Holness of Jamaica, and United Nations Secretary-General António Guterres convened the second High-Level event on Financing for Development in the Era of COVID‑19 and Beyond.</p>\n\n<p>Heads of state, governments, and international organizations met to discuss how to bolster and urgently accelerate our global response to the immediate significant economic and human impacts of COVID‑19, and advance concrete solutions to international development over the medium and long-term.</p>\n\n<p>During the meeting, Prime Minister Trudeau announced an additional $400 million in international development funding this year. This new funding will go to trusted partners on the ground fighting COVID‑19, and will enable Canada to support the recovery and resilience of developing countries. It will also address short-term humanitarian and development needs caused by the pandemic and other crises. The ultimate objective is to ensure that the development gains made over the past decade are not lost, and ensure that 2030 Agenda and the achievement of the Sustainable Development Goals (SDGs) are not at risk. Canada will make sure that women and girls, who have been disproportionally impacted by the consequences of COVID‑19, benefit from this new funding.</p>\n\n<p>The pandemic has caused immense social and economic distress throughout the globe but it has acutely affected low- and middle- income countries. Through the High-Level event, the global community is coming together to enable recovery and build a future that is inclusive, sustainable and resilient.</p>\n\n<p>The Government of Canada continues to further global leadership on financing for international development and is investing more while supporting developing countries on their economic recoveries and resilience. The Government of Canada recently committed $220 million through the COVAX Advance Market Commitment to purchase vaccine doses for low- and middle-income countries, because we cannot beat this virus unless we end it everywhere.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Global cooperation is crucial to protect people, save lives and defeat COVID-19. Our investments will also help preserve the hard-won development gains we have made collectively that have lifted millions of people out of poverty these past decades.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The meeting was a follow-up to the first High-Level event held on May 28, in which participants were asked to develop proposals to overcome challenges in six areas of action, including:\n\t<ol>\n\t\t<li>The need to expand liquidity in the global economy and maintain financial stability to safeguard development gains.</li>\n\t\t<li>The need to address debt vulnerabilities for all developing countries to save lives and livelihoods for billions of people around the world.</li>\n\t\t<li>The need to create a space in which private sector creditors can proactively engage in effective and timely solutions.</li>\n\t\t<li>Prerequisites for enhancing external finance and remittances for inclusive growth and creating jobs.</li>\n\t\t<li>Measures to expand fiscal space and foster domestic resource mobilization by preventing illicit financial flows.</li>\n\t\t<li>Ensuring a sustainable and inclusive recovery by aligning recovery policies with the Sustainable Development Goals.</li>\n\t</ol>\n\t</li>\n\t<li>The proposals considered at the High-Level event will inform discussions and mobilize additional action at high-level meetings such as the World Bank and International Monetary Fund annual meetings and the G20 Leaders’ Summit, taking place later in 2020.</li>\n\t<li>More than 60 Heads of State and Government participated in the virtual event, which took place on the margins of the 75th session of the UN General Assembly.</li>\n\t<li>The High-Level event follows the September 8 convening of Finance Ministers, during which close to 40 Ministers and Vice-Ministers of Finance from around the world met to discuss a menu of policy options to identify people-centered solutions to the global economic fallout from COVID‑19.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/09/deputy-prime-minister-co-chairs-un-meeting-on-the-international-response-to-the-covid-19-pandemic.html\">Deputy Prime Minister co-chairs UN meeting on the international response to the COVID‑19 pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/25/new-agreements-secure-additional-vaccine-candidates-covid-19\">New agreements to secure additional vaccine candidates for COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID‑19 pandemic</a></li>\n</ul></div>\n      "
}