{
  "path": "/en/news/statements/2021/08/08/statement-prime-minister-death-honourable-bill-davis",
  "pageTitle": "Statement by the Prime Minister on the death of the Honourable Bill Davis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of the Honourable Bill Davis, former Premier of Ontario:&nbsp;&nbsp; &nbsp;</p>\n\n<p>“It is with great sadness that I learned today of the passing of the Honourable William&nbsp;Grenville&nbsp;‘Bill’&nbsp;Davis, former Premier of Ontario.</p>\n\n<p>“Mr.&nbsp;Davis spent more than 25 years serving his province and was the second longest serving Premier of Ontario. He led the province for 14&nbsp;years during a transformative time in its history. As Premier, and as a long-serving Minister of Education, he established TVOntario and oversaw the creation of several new universities and the province’s community college system.</p>\n\n<p>“He will be remembered for putting into place Canada's first-ever environmental land‑use plan and for his role in the patriation of the Constitution, which resulted in the <em>Canadian Charter of Rights and Freedoms</em>.</p>\n\n<p>“He was a skilled statesman who set aside partisanship and worked with my father, Pierre Elliott Trudeau, to bring forward concrete change and uphold our shared values, like diversity and human rights, through the creation of the Charter.</p>\n\n<p>“In recognition of his many accomplishments, Mr.&nbsp;Davis was sworn in as a member of the Queen’s Privy Council of Canada in 1982. He was invested as a Companion of the Order of Canada in 1986 and as a Companion of the Order of Ontario in 1987, and inducted as a Knight in France’s Legion of Honor in 2001.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our deepest condolences to Mr.&nbsp;Davis’ family and friends and to all the people of Ontario on the passing of a remarkable leader.”</p></div>\n      "
}