{
  "path": "/en/news/news-releases/2017/05/27/prime-minister-trudeau-attends-g7-summit-italy",
  "pageTitle": "Prime Minister Trudeau attends G7 Summit in Italy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded the G7 Leaders’ Summit in Taormina, Italy. While in Taormina, the Prime Minister emphasized Canada’s commitment to fight terrorism in all its forms, advance gender equity, combat climate change, and deliver economic growth that benefits the middle class.</p><p>The Leaders signed a joint Statement on the Fight Against Terrorism and Violent Extremism, and renewed their determination to prevent radicalization and violent extremism, and to bring the perpetrators of terrorism to justice. Prime Minister Trudeau highlighted the need for G7 members to refrain from paying ransom to terrorist groups.</p><p>Leaders adopted the first <i>G7 Roadmap for a Gender-Responsive Economic Environment</i> to remove barriers to the full economic, political, and social participation of women and girls around the world. Canada is committed to advancing gender equity during its 2018 G7 presidency.</p><p>Prime Minister Trudeau reaffirmed Canada’s commitment to take measures to transition to a low-carbon economy, and to implement the Paris Agreement. The Prime Minister emphasized that responsible development of energy resources and meeting goals under international agreements go hand in hand.</p><p>The Prime Minister also underlined the importance of fully implementing the Canada-European Union Comprehensive Economic and Trade Agreement – an important milestone in Canada’s efforts to champion trade deals that create good, middle class jobs and benefit everyone.</p><p>In 2018, Canada will hold the G7 presidency. Building on the themes of Italy’s 2017 presidency, Canada will showcase the country’s domestic and international priorities: to build a strong middle class, advance gender equity, fight climate change, and promote respect for diversity and inclusion.</p><h2>Quote</h2><blockquote><p>“At the G7 this weekend, we had some excellent discussions on issues of security, climate change, gender equity, and economic growth that benefits the middle class. We talked about the global anxieties around inequality and how governments must help people deal with the uncertainty of a changing world. On this, I echoed my previous statements, calling on governments to work with their citizens to develop real, lasting solutions, together.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Leaders of the G7 – united by common values of freedom and democracy, and respect for human rights and the rule of law – come together each year to discuss issues of domestic and global concern. The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States. Representatives of the European Union also attend meetings.</li><li>The G7 dates back to the mid-1970s, and the G7 presidency, which rotates annually between member countries, sets the agenda for the year in consultation with G7 partners. Italy holds the presidency in 2017, and Canada will hold it in 2018.</li><li>G7 ministerial-level meetings are also held each year to build on the Leaders’ agenda. Italy will convene a total of twelve G7 ministerial meetings in 2017.</li><li>The Prime Minister met with his counterparts from France, Guinea (Chairperson of the African Union) along with the Chairperson of the African Union Commission, Japan, United Kingdom, Nigeria, and the United States of America.</li><li>During the Summit, Leaders committed to address inequality, harness innovation, and help workers bridge skills gaps. They also examined ways to support innovation across economies, and improve access to education and training relevant to today’s changing world and digital economy.</li><li>The Prime Minister emphasized Canada’s continued support for Ukraine and the need to maintain G7 solidarity regarding sanctions on Russia. Leaders also reaffirmed their commitment on non-proliferation and disarmament, including in North Korea.</li><li>The Prime Minister is deeply concerned by the unprecedented numbers of people fleeing conflict and persecution globally. Canada is committed to providing assistance and protection for refugees, and to addressing the root causes of their plight.</li><li>While at the G7, Prime Minister Trudeau and Prime Minister Shinzo Abe of Japan welcomed reaching substantial agreement on an acquisition and cross services agreement, and have agreed to sign it as soon as possible. Such an agreement will facilitate cooperation between Canadian and Japanese forces, notably during joint training exercises, humanitarian assistance and disaster relief operations and United Nations peacekeeping missions.</li><li>Following the Summit, G7 Leaders issued a joint communiqué on key global priorities and challenges, including countering terrorism and threats to security, driving inclusive and sustainable economic growth, and strengthening the foundations for gender equity and the empowerment of women.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.g7italy.it/sites/default/files/documents/G7%20Taormina%20Leaders%27%20Communique_27052017_0.pdf\">G7 Taormina Leaders’ Communiqué</a></li><li><a href=\"http://www.g7italy.it/sites/default/files/documents/G7%20Taormina%20Statement%20on%20the%20Fight%20Against%20Terrorism%20and%20Violent%20Extremism_0.pdf\">G7 Taormina Statement on the Fight Against Terrorism and Violent Extremism</a></li><li><a href=\"http://www.g7italy.it/sites/default/files/documents/Action%20Plan_0.pdf\">G7 People-centered Action Plan on Innovation, Skills and Labour</a></li><li><a href=\"http://www.g7italy.it/sites/default/files/documents/Gender%20Roadmap_0.pdf\">G7 Roadmap for a Gender-responsive Economic Environment</a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng&amp;_ga=2.135529393.1221666357.1494525110-1509584865.1475765971\" title=\"Canada and the G7\">Canada and the G7</a></li><li><a href=\"http://www.g7italy.it/en\" title=\"Italian G7 Presidency 2017\">Italian G7 Presidency 2017</a></li></ul></div>\n      "
}