{
  "path": "/en/news/news-releases/2022/05/25/delivering-better-health-care-seniors-saskatchewan",
  "pageTitle": "Delivering better health care for seniors in Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>All seniors deserve to be treated with dignity and respect. As we recover from the COVID-19 pandemic and build a better future for everyone, the Government of Canada continues to address the existing gaps in our health care system that were exposed by the pandemic, particularly for those in long-term care homes. By working with provinces and territories, we can ensure all seniors get the care they deserve when they need it, no matter where they live.</p>\n\n<p>The Prime Minister, Justin Trudeau, and Saskatchewan’s Minister of Health and Addictions, Seniors, and Rural and Remote Health, Everett Hindley, today announced the signing of a bilateral agreement to improve care for residents of the province’s long-term care homes through the Safe Long-Term Care Fund (SLTCF).</p>\n\n<p>Through this agreement, Saskatchewan is receiving more than $32&nbsp;million through the SLTCF to improve care by supporting enhanced screening protocols for staff, safer dining practices, and increased cleaning and housekeeping.</p>\n\n<p>Building on historic investments made throughout the pandemic, <em>Budget&nbsp;2022: A Plan to Grow Our Economy and Make Life More Affordable</em> proposes new measures to ensure our health care system can support Canadians as they age by investing in innovations in brain health and improving treatment for those living with dementia. Delivering better health care for Canadians is a key part of our plan to make life more affordable, create jobs, grow the middle class, and build a stronger economic future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“No matter who you are or where you live in Canada, you should have access to quality health care when you need it. Today’s agreement to better support people who live and work in long-term care homes is good news for everyone in Saskatchewan. We will continue to work with all provinces and territories to be there for our seniors, ensure that everyone can be treated with dignity and respect as they age, and build a long-term care system we can all be proud of.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Everyone in Canada, including seniors, should have access to the safe, quality health care they need and deserve. Today’s agreement with Saskatchewan will help address the challenges we have seen in long-term care homes, ensuring that all seniors are treated with dignity and appropriate care. By working with all provinces and territories to strengthen our health care system, our government will continue to be there for seniors in Saskatchewan, and everywhere across Canada.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p><a name=\"_Hlk104363812\" id=\"_Hlk104363812\">“</a>Saskatchewan is&nbsp;continuing to&nbsp;make significant&nbsp;investments&nbsp;to improve long-term care. As a province, we are investing more than $750 million this year&nbsp;to support Saskatchewan&nbsp;seniors in long-term care, including&nbsp;fulfilling our commitment to hire 300 new full-time equivalent continuing care aides in long-term care and home care&nbsp;and continued progress on long-term care home&nbsp;replacement&nbsp;projects in six communities.”</p>\n\n<footer class=\"default\">The Hon. Everett Hindley, Saskatchewan’s Minister of Health and Addictions, Seniors, and Rural and Remote Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since its introduction in 2020, the $1&nbsp;billion Safe Long-Term Care Fund (SLTCF) has helped provinces and territories improve infection prevention and control in long-term care homes across the country. Provinces and territories have used this funding to undertake a range of activities, including carrying out infection prevention and control readiness assessments, making improvements to infrastructure, such as ventilation, and hiring additional staff and topping up wages.</li>\n\t<li>With today’s announcement, the federal government has signed and announced agreements through the SLTCF with nine provinces and territories, including&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2021/08/government-of-canada-invests-close-to-134-million-to-support-canadians-living-and-working-in-long-term-care-in-british-columbia.html\">British Columbia</a>,&nbsp;<a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/19/delivering-better-health-care-new-brunswick-and-across-canada\">New Brunswick</a>,&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2021/08/government-of-canada-invests-15-million-to-support-canadians-living-in-long-term-care-in-newfoundland-and-labrador.html\">Newfoundland and&nbsp;Labrador</a>, the&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2021/08/government-of-canada-invests-more-than-31-million-to-support-canadians-living-and-working-in-long-term-care-in-the-northwest-territories.html\">Northwest Territories</a>,&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2022/02/government-of-canada-invests-more-than-27-million-to-support-canadians-living-in-long-term-care-in-nova-scotia.html\">Nova Scotia</a>,&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2022/04/government-of-canada-invests-more-than-379-million-to-support-canadians-living-in-long-term-care-in-ontario.html\">Ontario</a>,&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2021/08/government-of-canada-invests-more-than-6-million-to-support-canadians-living-and-working-in-long-term-care-in-prince-edward-island.html\">Prince Edward Island</a>, and&nbsp;<a href=\"https://www.canada.ca/en/health-canada/news/2021/08/government-of-canada-invests-over-3-million-to-support-canadians-living-and-working-in-long-term-care-in-yukon.html\">Yukon</a>.</li>\n\t<li>In addition to the SLTCF, the Government of Canada has also invested to address the gaps in long-term care identified since the beginning of the pandemic through:\n\t<ul>\n\t\t<li>$740&nbsp;million in the Safe Restart Agreement to provide support to vulnerable populations, including those in long-term care;</li>\n\t\t<li>Up to $3&nbsp;billion to support a temporary increase to the wages of low-income essential workers; and</li>\n\t\t<li>An additional $10.7&nbsp;million to Healthcare Excellence Canada to support long-term care homes across the country through the LTC+ initiative. More than 1,500 facilities across Canada are participating in the program.</li>\n\t</ul>\n\t</li>\n\t<li><a href=\"https://budget.gc.ca/2021/report-rapport/p1-en.html#2\">Budget&nbsp;2021</a> included an additional investment of $3&nbsp;billion over five years to support provinces and territories in developing and implementing standards for long-term care. This funding will help provinces and territories strengthen compliance and enforcement activities and support workforce stability, including through wage top-ups and improvements to workplace conditions.</li>\n\t<li>Budget&nbsp;2022 reiterated the government’s commitment to work with provinces and territories to improve health care, including for long-term, home, and community care. Budget&nbsp;2022 also proposed the creation of an expert panel, which will report to the Minister of Seniors and the Minister of Health, to study the idea of an Aging at Home Benefit.</li>\n\t<li>Saskatchewan has developed an action plan for the implementation of today’s bilateral agreement: <a href=\"https://www.canada.ca/en/health-canada/corporate/transparency/health-agreements/shared-health-priorities.html\">Shared Health Priorities and Safe Long-term Care Fund</a>.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/strong-public-health-care.html\">Budget&nbsp;2022 Backgrounder: Strong Public Health Care</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/corporate/transparency/health-agreements/shared-health-priorities.html\">Shared Health Priorities and Safe Long-term Care Fund</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/19/delivering-better-health-care-new-brunswick-and-across-canada\">Delivering better health care in New Brunswick and across Canada</a></li>\n</ul></div>\n      "
}