{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy,&nbsp;while at the G7 Summit,&nbsp;to express Canada’s ongoing support for Ukraine against Russia’s military aggression.</p>\n\n<p>President Zelenskyy highlighted recent Russian missile strikes across Ukraine, including in Kyiv. He also noted the military and financial assistance required to support Ukraine to defend against the Russian hostility that continues to violate its sovereignty, territorial integrity, and the rights of the Ukrainian people. The two leaders discussed what further assistance Canada and G7 countries could provide to Ukraine, and President Zelenskyy expressed his gratitude for Canada’s unwavering support.</p>\n\n<p>Prime Minister Trudeau shared insights with President Zelenskyy on the important conversations that took place about the invasion of Ukraine at the Commonwealth Heads of Government Meeting over the past several days, in Kigali, Rwanda. He also sought the President’s perspectives on G7 priorities.</p>\n\n<p>The Prime Minister and President expressed concern related to the growing global food insecurity caused by Russia’s aggression and the urgent need to facilitate the resumption of Ukrainian grain exportation to supply countries in need.&nbsp;</p>\n\n<p>Both leaders committed&nbsp;to stay in close touch.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/14/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}