{
  "path": "/en/news/news-releases/2022/09/13/national-day-mourning-canada-honour-her-majesty-queen-elizabeth-ii",
  "pageTitle": "National Day of Mourning in Canada to honour Her Majesty Queen Elizabeth II | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that September&nbsp;19, 2022, will be<em> </em>a National Day of Mourning in Canada, to mark the passing of Her Majesty Queen Elizabeth&nbsp;II. This coincides with Her Late Majesty’s State Funeral in London, United Kingdom, and the end of the official period of mourning in Canada.</p>\n\n<p>The National Day of Mourning is an opportunity for Canadians from coast to coast to coast to commemorate Her Majesty. It will be designated a holiday for the public service of Canada, and other employers across the country are also invited to recognize the National Day of Mourning.</p>\n\n<p>There will also be a national commemorative ceremony to honour the life and service of Her Majesty. The ceremony will be held at the Christ Church Cathedral in Ottawa on September&nbsp;19, 2022, at 11:00&nbsp;a.m. It will be preceded by a memorial parade and a 96-gun salute – one shot for each year of Her Majesty’s life – and followed by a flypast of Royal Canadian Air Force CF‑18s. The ceremony, including the memorial parade, will be broadcast live for everyone to watch.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“On September&nbsp;19, Canadians from across the country will pay their respects to Canada’s longest-reigning sovereign, Her Majesty Queen Elizabeth&nbsp;II. For most Canadians, she was the only monarch we ever knew and many of us felt a deep affection and appreciation for her dedication to Canada. This is a time to honour an extraordinary life of public service marked by grace, dignity, and an unwavering sense of duty.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Her Majesty Queen Elizabeth&nbsp;II acceded to the throne on February 6, 1952. She was crowned in Westminster Abbey on June 2, 1953, and reigned for over 70 years.</li>\n\t<li>Long associated with the Royal Family, Christ Church Cathedral is the Anglican cathedral in Canada’s capital. It has been the site of state funerals for several Canadian prime ministers and governors general, as well as commemorative services for members of the Royal Family.</li>\n\t<li>To pay tribute to Her Majesty, those in Canada’s National Capital Region may gather along the parade route on the National Day of Mourning. Details will be communicated in the coming days.</li>\n\t<li>Canadians are also invited to sign the online <a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/book.html\">book of condolences</a> or express their condolences <a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/send-condolences.html\">in other ways</a>.</li>\n\t<li>Statutory holidays in Canada can only be granted through legislation, which must pass through the House of Commons and the Senate, and receive Royal Assent. The Government of Canada has consulted the provinces and territories, who will determine an appropriate way to mourn Her Majesty Queen Elizabeth&nbsp;II in their jurisdictions.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/10/statement-prime-minister-proclamation-accession-his-majesty-king-charles\">Statement by the Prime Minister on the proclamation of the accession of His Majesty King Charles&nbsp;III</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen.html\">Commemoration for Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/monarchy-crown.html\">Monarchy and the Crown</a></li>\n</ul></div>\n      "
}