{
  "path": "/en/news/news-releases/2016/09/19/prime-minister-announces-significant-support-following-meeting",
  "pageTitle": "Prime Minister announces significant support following UN meeting on refugees and migrants | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is playing a leadership role on the world stage in refugee resettlement and international migration issues.</p>\n<p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will increase humanitarian assistance this fiscal year by 10 percent. The Prime Minister also announced over $64.5 million in new multi-year funding to support people affected by humanitarian crises around the world, and $467 million in programming as part of Canada’s strategy to address the crises in Syria, Iraq, and the surrounding region.</p>\n<p>The Government of Canada recognizes the significant contributions migrants and refugees can make to sustainable economic growth and to building dynamic, inclusive societies. In Canada, migrants and refugees fill skills gaps and labour market shortages, address some of the challenges associated with an aging population, increase international trade, and draw in investment from around the world – all of which strengthen the middle class at home.</p>\n<p><strong>Quotes</strong></p>\n<p>“Millions of people around the world are fleeing their homes because of conflict and persecution. The international community must come together to address their immediate needs and to help rebuild their lives. Today’s announcement will help accomplish this by providing forcibly displaced people with much-needed supplies and services, like education for young children.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canada is a nation built from the ground up by immigrants and refugees. We have a proud history of opening our arms—and our borders—to those most in need, and we look forward to welcoming many more migrants and refugees in the coming years. We will continue to lead with warm hearts and open minds.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canada will provide much of the support announced today through international partners, including UN agencies and the International Committee of the Red Cross to help meet the immediate, life-saving needs of populations affected by humanitarian crises around the world.</li>\n<li>The funds will provide predictable multi-year support through key international partners over the next three years, and focus on helping those displaced, including refugees, in four key areas: meeting basic needs; improving access to and the quality of public services; improving protection for refugees and other vulnerable populations; and, helping to ensure that vulnerable children have access to quality education, with a particular focus on reducing barriers to education for girls.</li>\n<li>Through its refugee resettlement programs, the Government of Canada has almost tripled the number of resettled refugees Canada could welcome in 2016.</li>\n<li>Canada is proud and fortunate to have resettled 25,000 Syrian refugees from November 2015 to February 2016. By the end of 2016, we expect to have welcomed over 44,000 refugees in total, including 17,800 privately sponsored refugees.</li>\n</ul>\n<p><strong><br>Related product</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/09/19/canada-provides-significant-support-following-meeting-refugees-and\">Backgrounder: Canada provides significant support following UN meeting on refugees and migrants</a></li>\n</ul>\n<p><strong><br>Associated Links:</strong></p>\n<ul>\n<li><a href=\"http://www.cic.gc.ca/english/refugees/welcome/index.asp?utm_source=slash-refugees&amp;utm_medium=short-url&amp;utm_campaign=refugees2015\">Canada resettles Syrian Refugees</a></li>\n<li><a href=\"http://www.international.gc.ca/development-developpement/humanitarian_response-situations_crises/syria-syrie.aspx?lang=eng\">Canada’s response to the conflict in Syria</a></li>\n<li><a href=\"http://international.gc.ca/world-monde/security-securite/middle_east-moyen_orient/humanitarian_assistance-aide_humanitaire.aspx?lang=eng\">Canada helps the most affected</a></li>\n</ul></div>\n      "
}