{
  "path": "/en/news/news-releases/2018/01/16/prime-minister-attend-world-economic-forum-davos",
  "pageTitle": "Prime Minister to attend World Economic Forum in Davos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Davos, Switzerland, from January 22 to 25, 2018, to attend the World Economic Forum annual meeting.</p><p>At the meeting, the Prime Minister will meet with other world leaders, global business leaders, and representatives of civil society to explore ways to grow Canada’s middle class and create new opportunities for Canadian businesses. He will stress the need for investments and innovation as we look to create jobs, develop a well-educated and highly skilled workforce, and promote clean growth and renewable energy.</p><p>Prime Minister Trudeau will also discuss Canada’s focus on advancing gender equality and women’s empowerment, and hold a public session with Malala Yousafzai to explore how we can create a better future through women’s education and empowerment. &nbsp;</p><h2>Quote</h2><blockquote><p>“I look forward to this year’s World Economic Forum annual meeting as an opportunity to share and hear ideas on how we can work together to promote women’s important role as leaders and entrepreneurs. We must have the full and equal participation of all to have economies that work for everyone and a future that is fairer, more inclusive, and more compassionate.”<br>—<cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>The World Economic Forum brings together the world’s private, public, and civil society leaders in collaborative activities focused on shaping global, regional, and industry agendas.</li><li>The Prime Minister will be joined in Davos by Minister of Innovation, Science and Economic Development Navdeep Bains, Minister of Finance Bill Morneau, Minister of Foreign Affairs Chrystia Freeland, and Minister of Status of Women Maryam Monsef, each of whom will have their own program of meetings during the four-day meeting. Canada’s strong presence at the Forum underscores the importance of this meeting for shaping the international agenda and advancing economic opportunities for Canadians.</li><li>Under the theme “Creating a Shared Future in a Fractured World,” this year’s Forum will encourage leaders from all sectors to explore bold ideas and exciting opportunities for collaboration and co-operation with a view to improving global governance and building more sustainable economies that work for everyone.</li><li>In 2013, Malala Yousafzai and her father founded the Malala Fund, an organization that promotes girls’ education, with the help of Shiza Shahid.</li></ul><h2>Associated link</h2><ul><li><a href=\"https://www.weforum.org/events/world-economic-forum-annual-meeting-2018\">World Economic Forum annual meeting</a></li></ul></div>\n      "
}