{
  "path": "/en/news/statements/2016/09/05/statement-prime-minister-canada-labour-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p>\n<p>“Today, we commemorate Labour Day – an occasion to celebrate the many accomplishments of Canada’s labour movement.</p>\n<p>“For more than a century, the labour movement has played an integral role in improving the lives of Canadian workers, and protecting Canada’s middle class and those working hard to join it. In the face of great adversity, the labour movement has fought to ensure fair living wages, safe working conditions, an inclusive workplace, and equitable relations with employers. &nbsp;</p>\n<p>“The Government of Canada is committed to collaborating with the labour movement to ensure that working people are protected and supported during their entire careers and retirement. That is why we worked hard with the provinces and territories and achieved an agreement in principle to expand the Canada Pension Plan, invested more than $85 million in union-based apprenticeship training, and temporarily increased Employment Insurance benefits for workers hit hardest by the commodities downturn. We have also committed to repair and build roads and bridges, and other infrastructure across Canada, which will create better, well-paying jobs for union members and more livable communities for Canadian families.</p>\n<p>“We are working to restore fair and balanced labour laws that acknowledge the important role of unions in promoting and protecting Canada’s middle class and those working hard to join it, and improve workers’ access to good quality skills training.</p>\n<p>“Moving forward, we will amend the Canada Labour Code to allow federally regulated workers the right to formally request flexible work arrangements from their employers.</p>\n<p>“On behalf of the Government of Canada, Sophie and I wish all Canadians a safe and happy Labour Day.”</p></div>\n      "
}