{
  "path": "/en/news/statements/2021/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p>\n\n<p>“Today, on the&nbsp;<a href=\"https://www.un.org/en/observances/ending-violence-against-women-day\">International Day for the Elimination of Violence against Women</a>, we come together to condemn misogyny and sexism in all of their forms, and remain steadfast in our work to ending gender-based violence here in Canada and around the world. We also recognize the survivors, advocates, and community-based organizations, who work tirelessly every day to end discrimination and violence against women and girls, and support survivors.</p>\n\n<p>“Living in fear of violence is a reality for too many Canadian women; more than four in 10 women in Canada have experienced some form of psychological, physical, or sexual violence from an intimate partner. Some women and girls continue to be at a higher risk of gender-based violence due to the discrimination and additional barriers they face because of their sexuality, race, disability, or social and economic situation. Since the outbreak of COVID-19, there have been escalated rates of gender-based violence around the world. The social and economic impact of the public health emergency has resulted in a shadow pandemic. It has underscored the systemic issues that lead to violence, as well as the gaps in support to protect and prevent those at risk from harm.</p>\n\n<p>“The Government of Canada is taking action to prevent and address gender-based violence, including investing more than $600&nbsp;million over five years in Budget&nbsp;2021 to develop a <a href=\"https://www.publicsafety.gc.ca/cnt/trnsprnc/brfng-mtrls/prlmntry-bndrs/20210302/015/index-en.aspx\">National Action Plan to End Gender‑Based Violence</a>, which builds on the federal <a href=\"https://women-gender-equality.canada.ca/en/gender-based-violence-knowledge-centre/gender-based-violence-strategy.html\">Gender-Based Violence Strategy</a> announced in 2017 and the <a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/2019-ntnl-strtgy-hmnn-trffc/index-en.aspx\">National Strategy to Combat Human Trafficking</a>&nbsp;launched&nbsp;in 2019. From this funding, the government has committed $30&nbsp;million, over five years, to support crisis hotlines in their work to help those experiencing gender-based violence. Since the beginning of the pandemic, we have invested nearly $300&nbsp;million to support shelters, sexual assault centres, and organizations assisting women and children experiencing violence. This funding will ensure that these organizations are able to provide the necessary services and support to those who need it most. Additionally, the 2020 Fall Economic Statement has committed $724.1&nbsp;million to establish a comprehensive Violence Prevention Strategy to increase access to a continuum of culturally relevant supports for Indigenous women, children and LGBTQ2 people, including Two-Spirit, facing gender-based violence. This strategy includes the construction of new Indigenous-specific shelters and transitional housing across the country.</p>\n\n<p>“Earlier this year, the <a href=\"https://mmiwg2splus-nationalactionplan.ca/\">2021 Missing and Murdered Indigenous Women, Girls, and 2SLGBTQQIA+ People National Action Plan</a> was launched, which outlines concrete steps needed to end this national tragedy.&nbsp;At the same time, the government launched the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway</a> in response to the National Inquiry into Missing and Murdered Indigenous Women and Girls and the federal component of the National Action Plan. The Federal Pathway provides a comprehensive roadmap to address the root causes of gender-based violence against Indigenous women, girls and LGBTQ2 people along four interconnected themes: culture, health and wellness, human safety and security, and justice. The government will continue to work alongside families and survivors, Indigenous governments and organizations, and provincial and territorial partners to implement this plan and bring about the transformative change needed to end violence against Indigenous women, girls, and LGBTQ2 people.</p>\n\n<p>“Ending all forms of gender-based violence and harmful practices, especially for women and girls, in all their diversity, is also a priority for Canada’s international efforts. Centred around our Feminist International Assistance Policy, Canada’s international response to COVID-19 has prioritized responding to the increase in gender-based violence as a result of the pandemic, particularly through providing comprehensive services to survivors of violence and supporting the essential work of local organizations working on the frontlines. Canada is also working to prevent gender-based violence in fragile and conflict-affected states and believes that increasing the meaningful participation of women&nbsp;in conflict prevention, conflict resolution, and peacebuilding around the world is vital to sustainable peace. This work is done through our second <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/cnap_wps-pnac_fps.aspx?lang=eng\">National Action Plan on Women, Peace and Security</a>, the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>, and the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>.</p>\n\n<p>“Today, as we start the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/16-days.html\">16 Days of Activism against Gender-Based Violence</a>, let us reflect on what everyone can do to address and to protect the rights and well-being of women, girls, and gender-diverse people to bring an end to gender-based violence in Canada and around the world. I encourage Canadians to participate in activities being held around this year’s theme, ‘16 and Beyond,’ and use the hashtag #16Days on social media. By speaking up against acts of gender-based violence, we can build a more inclusive, safer, and brighter future for everyone.”</p></div>\n      "
}