{
  "path": "/en/news/statements/2022/09/27/statement-prime-minister-results-russias-sham-referendums-occupied",
  "pageTitle": "Statement by the Prime Minister on the results of Russia’s sham referendums in occupied regions of Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the results of Russia’s sham referendums in occupied regions of Ukraine:</p>\n\n<p>“The so-called referendums held by Russia in the illegally occupied regions of Donetsk, Luhansk, Kherson, and Zaporizhzhia, in Ukraine, have absolutely no legitimacy. There are numerous reports of voters being intimidated through force, and these referendums are in blatant violation of international law, motivated by Putin’s notion that he can redraw the map as he pleases.</p>\n\n<p>“Canada does not and will not ever recognize the results of these sham referendums or Russia’s attempted illegal annexation of Ukrainian territories.</p>\n\n<p>“Canada and its international partners will continue to support Ukraine against Putin’s attacks on its territorial integrity and the rules-based international order. In response to this further escalation, we intend to impose new sanctions against persons and entities that are complicit in this latest attempt to undermine the principles of state sovereignty, and that share responsibility for the ongoing senseless bloodshed across Ukraine.</p>\n\n<p>“We are actively engaging with our international partners and allies to ensure a united rejection of these illegitimate ‘votes’ and to continue coordinating our response to Russia’s ongoing, unprovoked, and unjustifiable aggression against Ukraine.</p>\n\n<p>“Canada also reiterates its strong condemnation of Russia’s war crimes in Ukraine, which include rape, torture, and the indiscriminate murder of civilians, and we will use every tool at our disposal to ensure that these violations of international law do not go unpunished.</p>\n\n<p>“Canada remains steadfast in its commitment to Ukraine’s sovereignty, territorial integrity, and independence. We will continue to hold Russia accountable for its actions and to support the Ukrainian people and government as they defend their freedoms, their democracy, and their way of life.</p>\n\n<p>“Ukraine’s territory will remain Ukraine’s.”</p></div>\n      "
}