{
  "path": "/en/news/statements/2020/06/06/statement-prime-minister-76th-anniversary-d-day-and-battle-normandy",
  "pageTitle": "Statement by the Prime Minister on the 76th anniversary of D-Day and the Battle of Normandy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on the 76th anniversary of D-Day and the Battle of Normandy:</p>\n\n<p>“Today, on the 76th anniversary of D-Day and the Battle of Normandy, we remember and honour the brave Canadians and Newfoundlanders who fought, and those who gave their lives, alongside Allied forces in a battle that became a turning point in the Second World War and changed the course of history.</p>\n\n<p>“On June 6, 1944, over 14,000 Canadians stormed Juno Beach, as part of the largest combined sea, air, and land military operation in history. Together with Allies, Canadian soldiers broke through German defences on the beaches of Normandy and opened up a new Western Front in Europe.</p>\n\n<p>“In breaching the Atlantic Wall, the Allies overcame difficult odds and achieved a critical victory. But the two-and-a-half months of fighting in Normandy that followed came at a terrible cost to Canada. More than 5,000 were killed and another 13,000 Canadian troops were wounded, some of whom suffered permanent and life-changing injuries.</p>\n\n<p>“The bravery and selflessness demonstrated by Canadians on that day in Normandy, and throughout the war, remind us of the incredible cost of defending freedom, human rights, and democracy. We must remember them, and the more than one million Canadians who served during the Second World War.</p>\n\n<p>“As the global COVID-19 pandemic has forced us to move this year’s <a href=\"https://www.facebook.com/CanadaRemembers/\">commemorative ceremonies</a> online, I invite all Canadians to pay tribute to the courage and sacrifice of those who fought in the D-Day landings and the Battle of Normandy. It is our solemn responsibility to remember those who served and sacrificed. They gave everything so that we can enjoy the peace and freedom that we hold so dear today.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}