{
  "path": "/en/news/news-releases/2023/03/29/prime-minister-strengthens-partnerships-more-democratic-future-second",
  "pageTitle": "Prime Minister strengthens partnerships for a more democratic future at second Summit for Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Democracy is facing unprecedented challenges around the world. Since the first Summit for Democracy, in December 2021, we have witnessed Russia’s full-scale invasion of Ukraine – one of the greatest threats to democracy of our time – and rising authoritarianism, foreign interference, and increased polarization. But what we have also seen since the last Summit is the collective resolve of the democratic world to come together to protect our shared values and build a better future.</p>\n\n<p>The Prime Minister, Justin Trudeau, today reaffirmed our unwavering commitment to building strong democracies and resilient institutions at the second Summit for Democracy, which was co-hosted by the United States of America, Costa Rica, the Netherlands, Republic of Korea, and Zambia.</p>\n\n<p>Strong democracies do not happen by accident, and they do not continue without effort. Today, Prime Minister Trudeau announced over $50 million for initiatives that promote and protect democracy at home and abroad.</p>\n\n<p>Upholding human rights is a fundamental part of democracy. That is why this funding includes over $28 million to support the human rights of marginalized communities – particularly women, girls, 2SLGBTQI+ persons, Indigenous Peoples, and religious minorities – by improving inclusion and representation in democratic processes, including in the digital space.</p>\n\n<p>During the Summit, Prime Minister Trudeau highlighted <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/summit-democracy_sommet-democratie.aspx?lang=eng\">Canada’s achievements</a> and significant progress on our 35 domestic and international commitments from last Summit to advance democracy, counter authoritarianism and corruption, and protect human rights both at home and abroad.</p>\n\n<p>Canada has completed many of these commitments, including:</p>\n\n<ul><li>Implementing the <a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Plan to Protect Canada’s Democracy</a>;</li>\n\t<li>Successfully chairing the <a href=\"https://www.idea.int/sites/default/files/news/Canadian%20Chairship%20of%20IDEA%20End%20of%20Year%20Report%20December%205.pdf\">International Institute for Democracy and Electoral Assistance</a> (International IDEA) to promote free, fair, and inclusive elections globally, and the <a href=\"https://freedomonlinecoalition.com/canadian-chairship-of-the-freedom-online-coalition-end-of-year-report/\">Freedom Online Coalition</a> which helped defend internet freedom and addressed internet shutdowns perpetrated by Iran;</li>\n\t<li>Co-chairing the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/freedom_expression_media-liberte_expression_medias.aspx?lang=eng\">Media Freedom Coalition</a> to promote free and independent media worldwide;</li>\n\t<li>Supporting the <a href=\"https://www.opengovpartnership.org/ogp-multi-donor-trust-fund/\">OGP Multi-Donor Trust Fund for 2022</a> to fund initiatives that lead to increasing government transparency and improving accountability; and</li>\n\t<li>Launching the first <a href=\"https://women-gender-equality.canada.ca/en/free-to-be-me/federal-2slgbtqi-plus-action-plan.html\">Federal 2SLGBTQI+ Action Plan</a> in Canada.</li>\n</ul><p>We remain focused on ongoing commitments from engaging youth and leading the G7 Rapid Response Mechanism which fights misinformation and disinformation, to supporting media freedom and advancing responsible business conduct for Canadian companies operating abroad.</p>\n\n<p>Canada’s commitment to democracy, human rights, and the rule of law is unwavering. We will continue to take action, at home and abroad, to promote and protect these fundamental principles.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today, we joined our international partners in reaffirming our commitment to strengthening democracy. The democracies we are a part of didn’t happen by accident, and they won’t endure without effort. But by continuing to work together, and continuing to show people that their institutions can deliver for them, we can strengthen democracies around the world and create a more prosperous and peaceful world for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>During the Summit, the Prime Minister endorsed the <a href=\"https://www.state.gov/declaration-of-the-summit-for-democracy-2023/\">Declaration of the Summit for Democracy</a>, a joint leaders’ statement reflecting summit participants’ support for defending and strengthening democracy, promoting respect for human rights, advancing technology for democracy, and fighting corruption.</li>\n\t<li>Discussions between leaders at the Summit for Democracy 2023 focused on five themes, each led by a regional co-host:\n\t<ul class=\"bulletOutline\"><li>Democracy Delivering Economic Growth and Shared Prosperity (Republic of Korea)</li>\n\t\t<li>Democracy Delivering Justice for All (Netherlands)</li>\n\t\t<li>Democracy Delivering Strong Institutions (Zambia)</li>\n\t\t<li>Democracy Delivering on Global Challenges (United States)</li>\n\t\t<li>Democracy Delivering Inclusion and Equality (Costa Rica)</li>\n\t</ul></li>\n\t<li>The Prime Minister participated in the virtual plenary session hosted by the President of Costa Rica, Rodrigo Chaves Robles, on the topic of inclusion and equality. During this session, he shared Canada’s approach and experience on inclusion and diversity, both at home and through our international engagement, and highlighted how democracies can better deliver respect for human rights, equality, and racial justice for all people.</li>\n\t<li>The Prime Minister delivered Canada’s pre-recorded national statement providing an update on Canada’s progress against a subset of our 35 commitments made in 2021.</li>\n\t<li>Minister Joly will deliver pre-recorded remarks that will kick off the marquee event on media freedom in the Netherlands.</li>\n\t<li>Parliamentary Secretary Oliphant will share pre-recorded remarks on Canada’s efforts to promote youth political participation both at home and internationally, during a ministerial discussion hosted by Costa Rica.&nbsp;</li>\n\t<li>In 2021-22, Canada’s investments in international democracy programming totaled $157 million, including Ukraine ($9M), Honduras ($7M), and Myanmar ($5M).</li>\n\t<li>Canada promotes and protects democracy and human rights through multilateral engagement and advocacy at the G7, the United Nations, the Organisation for Economic Co-operation and Development, the Organization for Security and Co-operation in Europe, the Commonwealth, and within La Francophonie. Our efforts also include active participation in multi-stakeholder forums such as the Community of Democracies, the Media Freedom Coalition, the Freedom Online Coalition, and International IDEA. Additionally, Canada upholds democracy around the world through international assistance and capacity-building programmes and through our network of missions abroad.</li>\n</ul><h2>Related Products</h2>\n\n<ul><li><a href=\"/en/news/backgrounders/2023/03/29/backgrounder-canada-announces-over-50-million-funding-during-second\">Backgrounder: Canada announces over $50 million in funding during second Summit for Democracy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/12/09/summit-democracy-2021-submission-and-commitments-canada\">Summit for Democracy 2021 Submission and Commitments: Canada</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.state.gov/summit-for-democracy/\">The Summit for Democracy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/advancing_democracy-avancer_democratie.aspx?lang=eng\">How Canada advances democracy in the world</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Protecting democracy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}