{
  "path": "/en/news/news-releases/2021/04/17/prime-minister-trudeau-participate-leaders-summit-climate",
  "pageTitle": "Prime Minister Trudeau to participate in Leaders Summit on Climate | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in the virtual Leaders Summit on Climate hosted by the President of the United States of America, Joe Biden, on April 22 and 23.</p>\n\n<p>Consistent with the <a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\"><em>Roadmap for a Renewed U.S.-Canada Partnership</em></a>, Canada is committed to working with the United States to take action on the climate crisis, and to create jobs and economic opportunity for people in both our countries.</p>\n\n<p>The Leaders Summit on Climate will be an important opportunity for heads of state and government, and business and civil society leaders to meet and discuss the urgent need for stronger climate action. The Summit will also highlight how reducing emissions and adapting to climate change will lead to new economic opportunities and jobs, including here in Canada.</p>\n\n<p>During the Summit, Prime Minister Trudeau will discuss how Canada is taking bold climate action – including through our climate plan, <em>A Healthy Environment and a Healthy Economy</em> – to make life more affordable and communities more livable, create jobs and middle class growth, and ensure cleaner air and water for our kids and grandkids.</p>\n\n<p>Canada’s Minister of Environment and Climate Change Jonathan Wilkinson will also participate in a session on how nature-based solutions can be an important part of climate action. Minister of International Development Karina Gould will also represent the Canadian delegation.</p>\n\n<p>Leaders at the virtual Summit will also discuss how to strengthen collective efforts to reduce emissions, mobilize public and private sector investments to drive the net-zero transition, and help vulnerable countries cope with climate impacts.</p>\n\n<p>Climate change knows no borders. Only by working together with our global partners, can we build a stronger, more resilient, and cleaner future for Canadians and people around the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Climate change is one of the greatest threats we face as a world, but it also presents an enormous economic opportunity. I commend President Biden for convening this Summit, and look forward to sharing how Canada has been working to fight climate change, protect our environment, and grow our economy. By continuing to work together, we will create new jobs and build a cleaner and more resilient future for all our people.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Summit will reconvene the Major Economies Forum on Energy and Climate, which brings together 17 countries responsible for approximately 80 percent of global emissions and global GDP, and which previously helped contribute to successful outcomes in the lead up to COP 15 in Copenhagen.</li>\n\t<li>Other participants will include countries that have shown strong climate leadership, are especially vulnerable to climate impacts or are charting innovative pathways to a net-zero economy.&nbsp;</li>\n\t<li>According to the Intergovernmental Panel on Climate Change (IPCC), additional commitments are needed to keep under the Paris Agreement goal of limiting warming to 1.5°C in reach and avoid the worst impacts of climate change.</li>\n\t<li>The estimated size of the global clean technology market is expected to range between $2.5 trillion and $6.4 trillion (USD) by 2022-23. Canada’s strengthened climate plan seizes that opportunity and positions Canadian workers and businesses to be among the leaders in the increasingly low-carbon global economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/23/prime-minister-canada-welcomes-plan-revitalize-and-expand-ties-united\">Prime Minister of Canada welcomes plan to revitalize and expand ties with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}