{
  "path": "/en/news/readouts/2022/06/10/prime-minister-justin-trudeau-meets-president-dominican-republic-luis",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of the Dominican Republic Luis Abinader | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of the Dominican Republic, Luis Abinader, on the margins of the Summit of the Americas.</p>\n\n<p>Prime Minister Trudeau expressed condolences for the death of Orlando Jorge Mera, the Minister of Environment and Natural Resources of the Dominican Republic.</p>\n\n<p>Prime Minister Trudeau and President Abinader welcomed the opportunity to discuss their shared commitment to democracy, diversity, human rights, and their resolve to tackle some of the most pressing challenges in the region.</p>\n\n<p>The leaders recognized the many ties between their countries in trade and investment, as well as in the tourism sector. They noted the importance of creating a predictable and transparent regulatory environment in order to build strong, resilient, and inclusive economies.</p>\n\n<p>The two leaders condemned Russia’s violation of the sovereignty and territorial integrity of Ukraine. They recognized the international impacts of the ongoing conflict, as seen in rising energy and food prices. In these challenging times, Prime Minister Trudeau and President Abinader underscored the importance of working together to promote and defend democracy. They discussed how establishing a strategic partnership between Canada and the Alliance for Development in Democracy could help address key issues such as irregular migration, climate change, and economic recovery from the COVID-19 pandemic.</p>\n\n<p>The two leaders discussed the importance of supporting Haitian-led solutions to restore stability in Haiti.</p>\n\n<p>The Prime Minister raised the case of the Canadian air crew in the Dominican Republic and received assurances that the authorities will address the matter according to the rule of law.</p>\n\n<p>Prime Minister Trudeau and President Abinader looked forward to meeting again soon to work together on the priorities impacting the region and the hemisphere.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/dominican_republic-republique_dominicaine/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Dominican Republic relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}