{
  "path": "/en/news/news-releases/2018/05/08/prime-minister-nominates-new-chief-electoral-officer",
  "pageTitle": "Prime Minister nominates new Chief Electoral Officer | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of <a href=\"/en/news/backgrounders/2018/05/08/stéphane-perrault\">Stéphane&nbsp;Perrault</a> as the new Chief Electoral Officer of Canada.</p><p>Born and raised in Montréal, Mr. Perrault’s distinguished career with the Government of Canada spans more than two decades as both a senior executive and lawyer. He has been the Acting Chief Electoral Officer since December 2016.</p><p>As the head of Elections Canada, the Chief Electoral Officer is responsible for operating fair and efficient federal elections in accordance with the <i>Canada Elections Act</i> and other laws that govern the federal electoral process, including the <i>Referendum Act</i> and the <i>Electoral Boundaries Readjustment Act</i>. Elections Canada works to ensure all Canadians can exercise their democratic rights to vote and to be a candidate.</p><p>Stéphane&nbsp;Perrault was chosen as the nominee for the position of Chief Electoral Officer through the Government’s open, transparent, and merit-based appointment process.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the nomination of Stéphane Perrault as Canada’s new Chief Electoral Officer. His experience leading the agency for the last year and a half and administering many by-elections across the country make Mr. Perrault an excellent choice to head Elections Canada.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Chief Electoral Officer is an independent Agent of Parliament. Under the <i>Canada Elections Act</i>, the Chief Electoral Officer is appointed by resolution of the House of Commons to hold office for a term of 10&nbsp;years.</li><li>The Leader of the Government in the House of Commons tabled this nomination in the House of Commons for referral to the Standing Committee on Procedure and House Affairs. The Committee will have 30 days to examine the nomination and report back to the House of Commons, at which time the House will vote on the appointment.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/05/08/stéphane-perrault\">Stéphane Perrault</a></li></ul></div>\n      "
}