{
  "path": "/en/news/statements/2016/06/28/joint-statement-prime-minister-canada-and-president-united-mexican",
  "pageTitle": "Joint statement by the Prime Minister of Canada and the President of the United Mexican States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, and the President of Mexico, Enrique Peña Nieto, issued the following joint statement on the occasion of the State Visit:</p>\n<p>The governments of Canada and Mexico affirmed the importance of a renewed strategic partnership founded on the fundamental values of democracy, respect for human rights, diversity, inclusion, gender equality, Indigenous rights, good governance, and rule of law, as well as on improved economic opportunity and respect for our shared environment.</p>\n<p>Both Canada and Mexico agree that now is the time to bring our students together, to strengthen our business relationships, and to create sustainable economic growth for all of our people.</p>\n<p>Our renewed strategic partnership will focus on four themes: strengthening the ties between Canadians and Mexicans, and facilitating our people’s mobility; promoting shared and inclusive prosperity; fostering the safety and security of our people; and demonstrating regional and global leadership.</p>\n<p>To further elevate and deepen bilateral engagement, we are pleased to announce the launch of the <strong>Canada-Mexico High Level Strategic Dialogue (HLSD),</strong> to be led by our respective foreign ministers with the advice and support of other Cabinet members, as appropriate. The HLSD will be structured around the four themes indicated above. The first meeting will take place in Mexico in October 2016 and will follow up on the initiatives launched during the visit (see attached factsheets for details).</p>\n<p>Canada and Mexico enjoy strong diplomatic, cultural, educational, and commercial relations. Since the entry into force of the North American Free Trade Agreement (NAFTA), both countries – along with the United States – have witnessed dramatically increased trade and investment. Our two countries are each other’s third largest two-way trading partners, and our economies are increasingly integrated in various sectors&nbsp;– including agriculture, automotive, aerospace, mining, energy, education, tourism, and the environment. Greater collaboration in <strong>transport</strong> – through the development of international trucking corridors – will only enhance this interconnectivity.</p>\n<p>Collaboration between our two countries is already extensive, but now is the time for us to do more together, to make our relationship deeper, broader, and mutually more productive for the benefit of all our people.</p>\n<p>One of the top priorities will be <strong>strengthening connections and facilitating mobility</strong> for our people. We are pleased to announce that the lifting of the visa requirement for Mexican citizens visiting Canada is scheduled for December 1, 2016. The ordered and legal movement of people is a responsibility that we both share. We look forward to more Mexican visitors, students, and business people coming to Canada. Furthermore, we have agreed to grow our cultural connections and expand opportunities for Canadian and Mexican students studying in each country.</p>\n<p>Canada and Mexico share a commitment to an open and rules-based global trading system. As members of an integrated North American economy, we will work to advance our <strong>shared and inclusive prosperity</strong> by seeking to further expand our growing trade and investment relationship, and to overcome trade barriers between our two countries. In this regard, Canada and Mexico share a commitment to resolve trade issues using science-based decision making. Mexico is in the final stages of its due diligence to achieve full normalization of beef trade with Canada by October 1st, 2016.</p>\n<p>Together, we will advance our North American approach to the creation of a clean growth economy and jointly tackle the causes and impacts of climate change – through our shared commitment to ratify the <strong>Paris Agreement</strong> – and to promote and develop renewable sources of energy to meet our respective developmental challenges.</p>\n<p>Both countries have also agreed to share more information about how we can improve the health and prosperity of our Indigenous Peoples.</p>\n<p>Mexico’s recent <strong>energy reforms</strong> provide a unique opportunity to enhance collaboration in our bilateral energy relationship, aiming to boost prosperous, inclusive, and low-carbon energy sectors, while also involving key federal and provincial agencies, Indigenous partners, companies, and institutions. At the local level, our regulatory bodies are already sharing and developing best regulatory practices for a secure, low-emission, and responsible hydrocarbon industry amid the energy transition. Furthermore, they have launched partnerships with universities for sustainability innovation and talent development in the oil and gas sectors. At the federal level, we will continue to share best experiences on consultation and engagement to enhance participation of Indigenous communities in the energy sector. We will also foster cooperation on science, technology, and innovation and further partnerships between Canadian and Mexican academic institutions on low-emission energy solutions.</p>\n<p>To increase prosperity and improve equality in both our countries, we will deepen cooperation to promote the <strong>safety and security of our people</strong> – including closer ties between our public safety agencies and enhanced cooperation in areas related to peacekeeping, humanitarian assistance, emergency preparedness, border management and consular cooperation. We will also work together on initiatives to build capacity in areas of justice sector reform, anti-corruption, human smuggling, crime prevention, open data, and open government.</p>\n<p>With a shared commitment to address challenges faced by the world’s most vulnerable and insecure states, our countries will demonstrate <strong>regional and global leadership </strong>through<strong> </strong>enhanced cooperation in our hemisphere and around the globe. We will further our sustainable development cooperation, tackle threats to our environment, protect human rights, and promote social and financial inclusion. These efforts will be conducted at the regional level – through organizations such as the Organization of American States – and globally, through cooperation in multilateral institutions like the UN and the G20. To enhance the security of our borders and people, we will work to fully implement the Arms Trade Treaty.</p>\n<p>As we address the challenges of today and the decades ahead, we are committed to working in a spirit of cooperation, unity of purpose, and mutual respect. Together we endeavour to set a positive example of progressive inclusive societies that value diversity, sound government, and respect for human dignity for all.</p>\n<p><strong>Related products</strong></p>\n<ul>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/economic-prosperity-between-canada-and-mexico\">Economic prosperity between Canada and Mexico</a></li>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/environmental-cooperation-between-canada-and-mexico\">Environmental cooperation between Canada and Mexico</a></li>\n<li>Fact sheet – <a href=\"/en/news/backgrounders/2016/06/28/canada-mexico-cooperation-security-and-defence\">Canada-Mexico cooperation on security and defence</a></li>\n<li>Fact sheet – <a href=\"/en/news/2016/06/28/strengthening-cultural-and-social-ties-between-canada-and-mexico\">Strengthening cultural and social ties between Canada and Mexico</a></li>\n</ul></div>\n      "
}