{
  "path": "/en/news/statements/2021/10/31/statement-prime-minister-results-general-election-japan",
  "pageTitle": "Statement by the Prime Minister on the results of the general election in Japan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the results of the general election in Japan:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Prime Minister Kishida Fumio on his victory in Japan’s general election.</p>\n\n<p>“I look forward to working with Prime Minister Kishida to build back better from the COVID-19 pandemic and promote greater prosperity for people on both sides of the Pacific.</p>\n\n<p>“Canada and Japan share a close friendship, rooted in deep people-to-people ties and decades of cooperation. We also enjoy a strong trade, innovation, and investment relationship bolstered by the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, which has been helping businesses and workers in both our countries succeed since 2018.</p>\n\n<p>“We will continue to work closely together in various multilateral institutions, including the G7, G20, Asia-Pacific Economic Cooperation (APEC), World Health Organization, and United Nations. Canada greatly values Japan’s active participation in the <a href=\"https://www.canada.ca/en/global-affairs/news/2019/05/ottawa-group-and-wto-reform.html\">Ottawa Group</a>, and we will keep working side by side in this group of like-minded countries to achieve meaningful reforms to the World Trade Organization, improve dispute resolution, and facilitate global trade.</p>\n\n<p>“Guided by our shared values and our vision for a free and open Indo-Pacific, we will explore ways to make further progress on the issues that matter most to people in Canada and Japan – including advancing gender equality, combatting violent extremism, and fighting climate change. Through our continued collaboration, we will bring our two countries even closer together.”</p></div>\n      "
}