{
  "path": "/en/news/news-releases/2016/09/21/prime-minister-canada-welcomes-progress-national-holocaust-monument",
  "pageTitle": "Prime Minister of Canada welcomes progress on National Holocaust Monument | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in a site dedication ceremony for the National Holocaust Monument, which is being built at the corner of Wellington and Booth streets in Ottawa.</p>\n<p>The Monument, which is scheduled to be unveiled in 2017, will honour the millions of Jews and other innocent victims who died in the Holocaust. It will also promote a better understanding of the historical events surrounding the Holocaust and how they affected Canada, and celebrate the tremendous contributions that Holocaust survivors have made to this country.</p>\n<p><strong>Quotes</strong></p>\n<p>“It is important for Canadians and the rest of the world to remember the suffering and murder of millions of Jews and others in the Holocaust. We must never forget the stories of the victims, and the important lessons of the Holocaust. As Canadians and citizens of the world, we must fight the hatred and fear that once fuelled these deplorable acts, and ensure that tolerance and pluralism always triumph over anti-Semitism and racism. We must also pay tribute to the resilience of those who survived that horrific ordeal and went on to make enormous contributions here in Canada as well as many other countries around the world.”<br><em>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“This national monument will stand as a testament to the suffering of the millions who lost their lives and families to the Holocaust and tell the stories of those who came to Canada to build a new life. The Monument will serve as a reminder to future generations of Canadians to keep the lessons of history alive in our country’s consciousness. We must never take for granted our freedom, diversity, and deep commitment to human rights.”<br>—<em>The Honourable Mélanie Joly, Minister of Canadian Heritage<br><br></em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The design of the Monument, entitled “Landscape of Loss, Memory and Survival,” was developed by Team Lord of Toronto and depicts a stylized star, created by the confluence of six triangular shapes, or “volumes,” that are organized around a large gathering space for ceremonies.</li>\n<li>The fully integrated design uses architecture, landscaping, art, and interpretation to communicate the hardship and suffering of victims while conveying a powerful message of humanity’s enduring strength and survival.<br><br></li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://canada.pch.gc.ca/eng/1443025436163/1443025436165%20-%20a2\">The National Holocaust Monument</a></li>\n<li><a href=\"http://holocaustmonument.ca/index.php?lang=en\">The National Holocaust Monument Development Council</a></li>\n</ul></div>\n      "
}