{
  "path": "/en/news/readouts/2021/01/22/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden. The two leaders agreed to meet next month in order to advance the important work of renewing the deep and enduring friendship between Canada and the United States.</p>\n\n<p>The Prime Minister and the President recognized that both countries’ fundamental priority is to end the global COVID-19 pandemic. They discussed collaboration on vaccines and acknowledged that the two countries’ efforts are strengthened by existing exchanges of medical personnel and the flow of critical medical supplies. The two leaders discussed working closely together to defeat COVID-19 by responding to new variants and following expert advice.</p>\n\n<p>The Prime Minister and President discussed their shared vision for sustainable economic recovery, creating jobs, and growing the middle class. To that end, they discussed strengthening Canada-U.S. supply chain security and resilience.</p>\n\n<p>Reflecting on the extraordinary and deeply interconnected economic relationship between the two countries, and with a view to promoting and protecting it, the Prime Minister and President agreed to consult closely to avoid measures that may constrain bilateral trade, supply chains, and economic growth.</p>\n\n<p>The Prime Minister raised Canada’s disappointment with the United States’ decision on the Keystone XL pipeline. The Prime Minister underscored the important economic and energy security benefits of our bilateral energy relationship as well as his support for energy workers.</p>\n\n<p>The Prime Minister and President reiterated the urgent need for ambitious action on climate change, reaffirmed their commitment to the Paris Agreement, and agreed to work together on net-zero emissions, zero-emissions vehicles, cross-border clean electricity transmission, and the Arctic.</p>\n\n<p>The two leaders discussed their shared commitment to promoting diversity and inclusion, including by working in partnership with Indigenous peoples.</p>\n\n<p>The Prime Minister and President agreed to expand cooperation on continental defence and in the Arctic, including the need to modernize NORAD, and discussed their Foreign Affairs and National Defence ministers and secretaries of State and Defense meeting at the earliest opportunity.</p>\n\n<p>The Prime Minister and President reaffirmed their shared values and interests on the global stage. The two leaders discussed the arbitrary detention of Michael Kovrig and Michael Spavor and agreed to work together.</p>\n\n<p>The leaders reiterated their firm commitment to multilateral institutions and alliances. The Prime Minister raised the importance of the softwood lumber industry, and urged the removal of duties.</p>\n\n<p>Prime Minister Trudeau, President Biden and their respective teams look forward to further discussing their expanding cooperation at their upcoming meeting.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-inauguration-joe-biden-president-united\">Statement by the Prime Minister of Canada on the inauguration of Joe Biden as President of the United States of America</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-united-states-decision-keystone-xl\">Statement by the Prime Minister of Canada on the United States’ decision on the Keystone XL project</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/11/07/statement-prime-minister-canada-result-us-presidential-election\">Statement by the Prime Minister of Canada on the result of the U.S. presidential election</a></li>\n\t<li><a href=\"https://www.cbsa-asfc.gc.ca/services/covid/menu-eng.html\">Coronavirus disease (COVID-19): Current border measures and requirements</a></li>\n</ul></div>\n      "
}