{
  "path": "/en/news/statements/2022/08/24/statement-prime-minister-ukrainian-independence-day",
  "pageTitle": "Statement by the Prime Minister on Ukrainian Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ukrainian Independence Day:</p>\n\n<p>“Today, we mark Ukrainian Independence Day. On this day in 1991, Ukraine declared its independence as a nation. Today, 31 years later, Ukrainians are fighting for their freedom in the face of Russia’s illegal and unjustifiable invasion of their country.</p>\n\n<p>“Despite Russia’s brutality, Ukrainians have been relentless in their bravery and defence of their homeland. We have all seen the powerful images: images of ordinary people protecting their country, images of volunteers bringing food and aid to communities, and images of Ukrainian-Canadians sending support back home.</p>\n\n<p>“Ukrainians are not only defending their country; they are defending the values of freedom and democracy that we hold dear here in Canada and in many places around the world. We must continue to come together with our allies and partners to offer our steadfast support to the Ukrainian people. Canada has provided unprecedented support, including economic aid, military equipment, and training to members of the Armed Forces of Ukraine as part of Operation UNIFIER. We are also helping Ukrainians fleeing violence to find safety in Canada and are working with partners to provide them the services and supports they need, like language training and help enrolling in school, upon their arrival in our communities.</p>\n\n<p>“The relationship between Canada and Ukraine is built upon generations of people-to-people ties. Nearly 1.4&nbsp;million people of Ukrainian descent live in Canada today – the second largest Ukrainian diaspora in the world. Canada was also the first Western country to recognize Ukraine’s independence, and we have worked alongside the people of Ukraine to help build a safe, democratic, and prosperous country ever since. The bonds uniting our peoples are unbreakable.</p>\n\n<p>“On this Ukrainian Independence Day, I am saddened that today cannot be a proper moment of celebration, but it can be a moment of pride: for the country you have built, for the people bravely protecting it, and for the values we hold dear. Tonight, the Parliament Buildings will be lit up with the blue and yellow colours of the Ukrainian flag to tell the people of Ukraine: You are not alone. Canadians stand with you. And fate shall smile upon you once more.</p>\n\n<p>“Slava Ukraini!”</p></div>\n      "
}