{
  "path": "/en/news/readouts/2021/11/22/prime-minister-justin-trudeau-meets-nova-scotia-premier-tim-houston",
  "pageTitle": "Prime Minister Justin Trudeau meets with Nova Scotia Premier Tim Houston | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau, along with Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc and Minister of Immigration, Refugees and Citizenship Sean Fraser, met with Nova Scotia Premier Tim Houston to discuss shared priorities.</p>\n\n<p>The Prime Minister and Premier spoke about the importance of working together to ensure a strong economic recovery from the pandemic. They agreed that vaccination is the most effective tool against COVID-19, and encouraged everyone in Nova Scotia and across Canada to get vaccinated in order to keep each other safe.</p>\n\n<p>The two leaders spoke about the work under way in the province to improve access to health care, including mental health services, and efforts to recruit health care professionals. They underlined the importance of increasing immigration, and spoke about the need to transition off coal and how the Atlantic Loop can assist in realizing this goal.</p>\n\n<p>The Prime Minister and Premier agreed to continue collaborating on these priorities and other issues of importance to Nova Scotians and all Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Canada’s vaccine supply</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-action/powering-future-clean-energy.html\">Powering our future with clean electricity</a></li>\n\t<li><a href=\"https://www.canada.ca/en/atlantic-canada-opportunities/atlanticgrowth/reports/cleanpower.html\">Towards a Clean Power Roadmap for Atlantic Canada</a></li>\n</ul></div>\n      "
}