{
  "path": "/en/news/readouts/2022/03/07/prime-minister-justin-trudeau-meets-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Prime Minister Boris Johnson of the United Kingdom at the Royal Air Force Base in Northolt, United Kingdom.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson strongly condemned the ongoing military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine, and worked together to identify additional measures to hold all responsible stakeholders accountable. The prime ministers discussed the growing international consensus against the Russian aggression, as demonstrated by the recent vote in the United Nations General Assembly, and agreed to expand coordination amongst counties providing military, financial, and humanitarian support to Ukraine. The leaders recognized the heroic efforts and sacrifices of the Ukrainian Armed Forces and people, and denounced in particular Russia’s attacks against Ukrainian civilians.</p>\n\n<p>The two leaders decided to deepen bilateral collaboration with respect to security and intelligence in order to better combat threats to democracy, including foreign interference, economic coercion, disinformation, and cyber-attacks. In this regard, they spoke about close and effective cooperation between Canada and the United Kingdom in multilateral fora, including within the Media Freedom Coalition, G7, and Five Eyes on countering disinformation and foreign interference and strengthening democracies globally. The leaders discussed next steps for the modernization of the free trade agreement between Canada and the United Kingdom and dedicated additional attention to securing reliable supply chains, especially for energy and critical minerals.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-United Kingdom relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cuktca-acccru/read_agreement-consultez_accord.aspx?lang=eng\">Canada-UK Trade Continuity Agreement (Canada-UK TCA)</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-02-09-freedom-expression-media-liberte-expression-medias.aspx?lang=eng\">Global Conference for Media Freedom: Joint communiqué</a></li>\n</ul></div>\n      "
}