{
  "path": "/en/news/statements/2021/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:</p>\n\n<p>“Today, we pause to remember and honour every Canadian whose life was cut short or forever changed by a terrorist attack.</p>\n\n<p>“On this day in 1985, the bombing of Air India Flight 182 claimed the lives of 329 innocent people, including citizens of Canada, India, the United States, the United Kingdom, and other countries.</p>\n\n<p>“This despicable act of terror remains the deadliest terrorist attack in Canada’s history. Sadly, it was not the last time Canada had to confront the malice of terrorism. From the attack at the National War Memorial and Parliament Hill in 2014 to the most recent deadly hate crime targeting a Muslim family in London, Ontario, our country and world continue to suffer from the devastating consequences of terrorist acts.</p>\n\n<p>“Terrorists seek to instill fear in Canadians, divide us, and make us question our democratic institutions through their cowardly acts of violence. We must continue to address racism, misogyny, hatred, and intolerance in our society, and uphold the values of diversity, inclusion, and pluralism – values that are stronger than fear, hatred, and intolerance.</p>\n\n<p>“Canada condemns all forms of terrorism. We will continue to work closely with our allies and international partners to prevent radicalization to violence, to modernize and enhance our security efforts, defend peace and justice, and promote human rights both at home and abroad. As part of our commitment to the <a href=\"https://www.christchurchcall.com/call.html\">Christchurch Call to Action</a>, Canada and other countries are stepping up efforts to halt the spread of violent extremist and terrorist content online and to strengthen the resilience and inclusiveness of our societies against terrorist and violent extremist ideologies.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our deepest sympathies to all those who have lost a loved one to or been harmed by terrorism. We also acknowledge the many community leaders across the country – from teachers to faith leaders – who continue to work to bring people together and to prevent radicalization to violence. And we thank our women and men in uniform, diplomats, as well as the security, intelligence, and law enforcement community in Canada and around the world who work hard every day, often at great personal risk, to keep us all safe and make Canada and the world a better place.”</p></div>\n      "
}