{
  "path": "/en/news/readouts/2022/03/13/prime-minister-justin-trudeau-speaks-president-chile-gabriel-boric",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Chile Gabriel Boric | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Chile, Gabriel Boric, to congratulate him on his inauguration on March 11.</p>\n\n<p>The two leaders discussed Russia’s unprovoked, illegal invasion of Ukraine. The Prime Minister and the President both stressed the importance of working closely with partners in the Americas and around the world to continue to oppose such unlawful use of force and aggression and to implement a robust, unified response. The Prime Minister and the President also discussed how to respond to foreign threats to democracies, including foreign state sponsored disinformation and misinformation. They committed to join forces in their efforts to effectively address the emerging humanitarian and refugee crisis in Ukraine and neighbouring countries.</p>\n\n<p>Prime Minister Trudeau and President Boric discussed the close friendship and ongoing collaboration between Canada and Chile, both within the Americas and globally. The two leaders agreed to work together on advancing shared priorities and addressing global issues, including in the context of the upcoming Summit of the Americas in June 2022. They agreed to partner on promoting democracy, human rights, gender equality, inclusive economic growth and international law. The two leaders also expressed the desire to continue to advance together ambitious climate action, including on renewable energies.</p>\n\n<p>Prime Minister Trudeau and President Boric look forward to the opportunity to meet in person in the coming months.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/chile-chili/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Chile relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng&amp;_ga=2.67006890.589644227.1640126716-2017077305.1613070365\">Canada-Chile Free Trade Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/corporate/international-affairs/partnerships-countries-regions/latin-america-caribbean/canada-chile-environmental-agreement.html\">Canada-Chile Agreement on Environmental Cooperation</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/venezuela.aspx?lang=eng\">Canada and the Venezuela crisis</a></li>\n</ul></div>\n      "
}