{
  "path": "/en/news/news-releases/2021/10/08/prime-minister-announces-changes-senior-ranks-public-service",
  "pageTitle": "The Prime Minister announces changes in the senior ranks of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes in the senior ranks of the Public Service:</p>\n\n<p class=\"Indent1\"><strong>Dr. Harpreet S. Kochhar</strong>,<strong> </strong>currently<strong> </strong>Associate Deputy Minister of Health, becomes President of the Public Health Agency of Canada, effective October 12, 2021.</p>\n\n<p class=\"Indent1\"><strong>Heather Jeffrey</strong>, currently Assistant Deputy Minister, Strategy and Integration, COVID-19 Task Force, Health Canada, becomes Associate Deputy Minister of Health, effective October 12, 2021.</p>\n\n<p>The Prime Minister thanked <strong>Iain Stewart</strong> for his service as President of the Public Health Agency of Canada upon his return as President of the National Research Council of Canada, effective October 12, 2021, and recognized his leadership in successfully implementing the COVID-19 vaccine rollout. He also thanked <strong>Mitch Davies</strong> for serving as Interim President of the National Research Council of Canada in Mr. Stewart’s absence.</p>\n\n<p>The Prime Minister took the opportunity to acknowledge other changes in the senior ranks of the Public Service that took place last month:</p>\n\n<p class=\"Indent1\"><strong>Gina Wilson</strong>, Senior Associate Deputy Minister of Diversity, Inclusion and Youth, Canadian Heritage, is also serving as Deputy Minister for Women and Gender Equality, effective September 1, 2021.</p>\n\n<p class=\"Indent1\"><strong>Shalene Curtis-Micallef</strong>, previously Assistant Deputy Minister, Tax Law Services, Department of Justice Canada, is Associate Deputy Minister of Justice, effective September 1, 2021.</p>\n\n<p class=\"Indent1\"><strong>Nancy Gardiner</strong>, previously Assistant Deputy Minister, Departmental Programs and Operations, Women and Gender Equality Canada, is President of the Federal Economic Development Agency for Southern Ontario, effective September 1, 2021.</p>\n\n<p class=\"Indent1\"><strong>Frances McRae</strong>, previously Assistant Deputy Minister, Small Business and Marketplace Services, Innovation, Science and Economic Development Canada, is Chief Administrative Officer of the Royal Canadian Mounted Police, effective September 1, 2021.</p>\n\n<p class=\"Indent1\"><strong>Ted Gallivan</strong>, previously Assistant Commissioner, Compliance Programs Branch, Canada Revenue Agency, is Executive Vice-President of the Canada Border Services Agency, effective September 1, 2021.</p>\n\n<p class=\"Indent1\"><strong>Donnalyn McClymont</strong>, previously Assistant Secretary to the Cabinet, Senior Personnel Secretariat, Privy Council Office, is Deputy Secretary to the Cabinet (Senior Personnel and Public Service Renewal), Privy Council Office, effective September 24, 2021.</p>\n\n<p>The Prime Minister also congratulates the following individuals on their retirement from the Public Service, and thanks them for their dedication and service to Canadians:</p>\n\n<ul>\n\t<li>James Meddings, President of the Federal Economic Development Agency for Southern Ontario</li>\n\t<li>Guylaine Roy, Deputy Minister for Women and Gender Equality</li>\n\t<li>Kevin Stringer, Chief Administrative Officer of the Royal Canadian Mounted Police</li>\n\t<li>Janine Sherman, Deputy Secretary to the Cabinet (Senior Personnel and Public Service Renewal), Privy Council Office</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/dr-harpreet-s-kochhar\">Dr. Harpreet S. Kochhar</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/heather-jeffrey\">Heather Jeffrey</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/gina-wilson\">Gina Wilson</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/shalene-curtis-micallef\">Shalene Curtis-Micallef</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/nancy-gardiner\">Nancy Gardiner</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/frances-mcrae\">Frances McRae</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/ted-gallivan\">Ted Gallivan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/10/08/donnalyn-mcclymont\">Donnalyn McClymont</a></li>\n</ul></div>\n      "
}