{
  "path": "/en/news/statements/2018/10/01/statement-prime-minister-womens-history-month",
  "pageTitle": "Statement by the Prime Minister for Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for Women’s History Month:</p><p>“From community to community and one generation to the next, women have made Canada what it is today – often without the recognition they deserve. During <a href=\"https://www.swc-cfc.gc.ca/commemoration/whm-mhf/index-en.html\">Women’s History Month</a>, we work to set things right – and honour the women who have shaped our past and continue to shape our future.</p><p>“This year’s theme, Make an Impact, highlights the contributions women have made – as advocates, leaders, entrepreneurs, artists, academics, and more – to every aspect of our society. Today, women continue to push the dial. Around the world, women are throwing a spotlight on the obstacles they face – and paving the way for better protection of everyone’s rights.</p><p>“Thanks to generations of activists and advocates, we have made real progress as a country and a world. But as their movements remind us, injustices and inequalities remain a reality for women in Canada and beyond. That’s unacceptable. Whether reducing the gender wage gap, supporting women entrepreneurs, or preventing and addressing gender-based violence, the Government of Canada will continue to take steps to make sure everyone, no matter their gender identity, has the freedom and opportunities they need to thrive.</p><p>“Women’s leadership is key to tackling the challenges we face as a world – from fighting climate change, to building peace, to growing economies that work for everyone. Canada recognized that when it made gender equality and women’s empowerment <a href=\"https://g7.gc.ca/en/g7-presidency/themes/advancing-gender-equality-women-empowerment/g7-public-engagement-paper/\">a top priority for our G7 Presidency</a>. The historic investment that came out of the Summit, together with commitments made at the UN General Assembly, now stands at over $4 billion for education for women and girls in conflict and crisis situations. These funds will give critical support to the world’s most vulnerable women and girls, and empower the next generation of global changemakers.</p><p>“Seeing our history more clearly – telling untold stories and recognizing unacknowledged contributions – can help us transform our present and reimagine our future. All of us have a role to play in challenging sexism, discrimination, and gender inequality. That starts with valuing women and girls, standing with them, and making sure their voices are heard.</p><p>“On behalf of the Government of Canada, Sophie and I encourage Canadians to celebrate the women who have shaped Canada into the thriving, diverse, and prosperous country we call home today.”</p></div>\n      "
}