{
  "path": "/en/news/news-releases/2022/09/21/prime-minister-delivers-action-united-nations-general-assembly",
  "pageTitle": "Prime Minister delivers action at the United Nations General Assembly | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the 77th Session of the United Nations (UN) General Assembly (UNGA) high-level week, where he worked closely with our global partners to address the world’s biggest challenges and make life better for people. He advanced action in key areas including health, food security, and climate action and worked with partners to continue standing up for Ukraine in the face of Putin’s illegal and unjustifiable invasion and countering Russian false narratives and disinformation.</p>\n\n<p>On the margins of UNGA, Prime Minister Trudeau announced $1.21&nbsp;billion in new funding at the pledging conference for the Global Fund to Fight AIDS, Tuberculosis, and Malaria’s Seventh Replenishment, hosted by the President of the United States, Joe Biden. This funding, a 30 per cent increase from the last pledge, will fight these diseases and help meet the Global Fund’s goal of saving 20 million lives over the next three years.</p>\n\n<p>The Prime Minister also allocated $100 million from previously <a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/12/prime-minister-attends-second-global-covid-19-summit-contribute\">announced</a> funding to the Global Fund’s COVID-19 Response Mechanism, to support countries in mitigating the impact of COVID-19 on HIV/AIDS, TB and malaria programs and initiate urgent improvements in health and community systems. He also announced $55 million has been allocated for partners to help mitigate the impacts of the COVID-19 pandemic and advance action on global health and sexual and reproductive health.</p>\n\n<p>Prime Minister Trudeau also participated in the Global Food Security Summit where he highlighted Canada’s ongoing efforts to tackle the global food security crisis and announced the allocation of $245&nbsp;million in humanitarian funding to UN, Canadian, and international organizations working to ensure no one goes hungry. With several countries already under threat of famine due to drought and other shocks to the food system, Russia’s illegal invasion of Ukraine has further jeopardized global food security. While we continue to support the Ukrainian people, we are also addressing the wide-ranging impacts on people around the world.</p>\n\n<p>On the margins of UNGA, the Prime Minister hosted a meeting with Caribbean and regional partners to continue to advance ways the international community can help support Haiti’s stability and sustainable development. At the meeting, he announced $20&nbsp;million to the UN Development Programme’s Multi-Donor Trust Fund Contribution for Post-Earthquake Reconstruction Efforts in Haiti.</p>\n\n<p>To confront the rise of hate and violent extremism, the Prime Minister also participated in the Christchurch Call Leaders’ Summit 2022, where he underscored Canada’s pledge to eliminate terrorist and violent extremist content online. He announced up to $1.9&nbsp;million in new funding over three years to Tech Against Terrorism for Phase&nbsp;2 of their Terrorist Content Analytics Platform, a secure online tool that helps small and medium-sized online platforms identify and counter terrorist content.</p>\n\n<p>During his visit, Prime Minister Trudeau highlighted Canada’s strong leadership on climate action and the global biodiversity crisis ahead of the 15th Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity taking place in Montreal this December. He made a call to action for renewed commitments from leaders for an ambitious post-2020 Global Biodiversity Framework, in particular to address the financing gap for nature. While in New York, the Prime Minister announced $10&nbsp;million in funding over four years for the Climate Risk and Early Warning Systems initiative to improve emergency preparedness in developing countries, particularly the small island developing states.</p>\n\n<p>The Prime Minister also announced that Canada will join the Forests and Climate Leaders’ Partnership (FCLP) to implement solutions that reduce forest loss and increase restoration.</p>\n\n<p>While in New York City, the Prime Minister, as Co-Chair of the UN Sustainable Development Goals Advocates group, underlined Canada’s commitment to making life better for people, including by advancing gender equality. He announced a $10&nbsp;million contribution over three years to Invest in Childcare to ensure access to quality and affordable childcare in low- and middle-income countries worldwide, which addresses a main barrier to women’s participation in the economy.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“By working with our global partners, we are delivering real results for people: clean air, clean water, economic growth that works for everyone, and a healthy and strong middle class. At UNGA this week, we came together to address some of the most critical challenges of our time and make life better for Canadians and many around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>While in New York, the Prime Minister attended the opening of the High-Level General Debate of the 77th Session of the UN General Assembly. He also attended a welcoming reception for heads of delegation hosted by the President of the United States of America, Joe Biden, and Dr. Jill Biden and an event with the Clinton Global Initiative - Executive Roundtable on Unlocking and Realizing the Benefits of Inclusive Job Growth hosted by Secretary Hillary Rodham Clinton.</li>\n\t<li>In New York City, Prime Minister Trudeau also held bilateral meetings with the the President of Moldova, Maia Sandu, the President of the Republic of Suriname, Chan Santokhi, the President of the European Commission, Ursula von der Leyen and the Secretary-General of the United Nations, António Guterres.</li>\n\t<li>Canada’s pledge of $1.21&nbsp;billion in new funding to the Global Fund is a 30 per cent increase over our last pledge. The Global Fund is at the centre of the collective fight against the HIV/AIDS, tuberculosis, and malaria epidemics, and a critical partner in advancing sexual reproductive health and rights. The Global Fund is a partnership between governments, civil society, technical partners, the private sector and people affected by the diseases to support country-led prevention, treatment and care programs.</li>\n\t<li>Canada’s support to the UN Development Programme’s Multi-Donor Trust Fund Contribution for Post-Earthquake Reconstruction Efforts in Haiti is part of Canada’s efforts to address the impacts of the August 2021 earthquake affecting more than 800,000 people, including an estimated 300,000 children. Canada works alongside other leading international donors to ensure its aid is effective and aligned with Haiti’s priorities.</li>\n\t<li>The Christchurch Call to Eliminate Terrorist &amp; Violent Extremist Content Online (Christchurch Call to Action) is a commitment by 120 governments, online service providers, and civil society organizations to coordinate and collaborate on efforts to eliminate terrorist and violent extremist content online. In 2019, the Government of Canada provided up to $1 million in funding to create the Terrorist Content Analytics Platform (TCAP). This second tranche of funding will help expand the TCAP’s capabilities to identify and assess increased content across a wider range of platforms, and help develop a content moderation tool to assist smaller tech companies in quickly removing terrorist content.</li>\n\t<li>In June 2022, Canada <a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">announced</a> $250&nbsp;million in funding for 2022 and 2023 to help address the global food security crisis, building on the $514.5&nbsp;million already allocated in 2022 for emergency food and nutrition assistance. This funding will help address increasing global food and nutrition needs – especially for the most vulnerable, with a focus on Sub-Saharan Africa. In June, $5 million was <a href=\"https://www.canada.ca/en/global-affairs/news/2022/06/ministers-sajjan-and-bibeau-participate-in-ministerial-conference-uniting-for-global-food-security-and-announce-5million-matching-fund-in-response-.html\">allocated</a> for a matching fund with the Humanitarian Coalition. While in New York City, the Prime Minister announced that the $245&nbsp;million in funding is being allocated as follows:\n\t<ul>\n\t\t<li>$151&nbsp;million to the World Food Programme;</li>\n\t\t<li>$42 million to various Canadian and international NGOs;</li>\n\t\t<li>$35&nbsp;million to UNICEF;</li>\n\t\t<li>$14 million to the Canadian Foodgrains Bank and</li>\n\t\t<li>$3&nbsp;million to the Food and Agriculture Organization.</li>\n\t</ul>\n\t</li>\n\t<li>In May 2022, during the second Global COVID-19 Summit, the Prime Minister <a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/12/prime-minister-attends-second-global-covid-19-summit-contribute\">announced</a> $732&nbsp;million in multilateral funding for the Access to COVID-19 Tools (ACT) Accelerator. While in New York City, the Prime Minister announced that $155&nbsp;million in funding is being allocated as follows:\n\t<ul>\n\t\t<li>$100 million for the Global Fund’s COVID-19 Response Mechanism to help support the global response to the COVID-19 pandemic by providing important support to diagnostics, therapeutics, and health systems worldwide.</li>\n\t\t<li>$25&nbsp;million in funding to the World Health Organization to continue supporting 10 countries in their efforts to address ongoing needs in their health care systems. This includes strengthening the delivery of essential health services and equity-oriented primary health care in the context of COVID-19 response and recovery.</li>\n\t\t<li>$25&nbsp;million in funding to Unitaid in support of their medical oxygen response. This funding will aim to increase the supply of medical oxygen for both COVID-19 clinical care and future health emergencies in developing countries.</li>\n\t\t<li>$5&nbsp;million in funding to support the Foundation for Innovative New Diagnostics’ efforts to develop new testing methods multiplex molecular platforms that can efficiently test for COVID-19 and other diseases, such as HPV screening for cervical cancer that will help advance women and adolescent health in developing countries.</li>\n\t</ul>\n\t</li>\n\t<li>Invest in Childcare is an initiative of the World Bank Group. The initiative will generate at least US$180 million in new funding to ensure quality, affordable childcare in low- and middle-income countries worldwide,</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/17/prime-minister-attend-united-nations-general-assembly-new-york\">Prime Minister to attend United Nations General Assembly in New York</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/09/canada-announces-a-121-billion-contribution-to-fight-hivaids-tuberculosis-and-malaria-and-additional-support-to-mitigate-the-impact-of-covid-19.html\">Canada announces a $1.21-billion contribution to fight HIV/AIDS, tuberculosis and malaria and additional support to mitigate the impact of COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/09/government-of-canada-announces-up-to-19-million-in-funding-to-combat-online-terrorist-and-violent-extremist-content.html\">Government of Canada announces up to $1.9 million in funding to combat online terrorist and violent extremist content</a></li>\n\t<li><a href=\"https://www.cbd.int/cop/\">Conference of the Parties (COP)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://www.theglobalfund.org/en/seventh-replenishment/#:~:text=20%20years%20after%20the%20Global,to%20save%2020%20million%20lives.\">The Global Fund Seventh Replenishment</a></li>\n</ul></div>\n      "
}