{
  "path": "/en/news/news-releases/2021/02/10/new-public-transit-investments-build-strong-communities-fight-climate",
  "pageTitle": "New public transit investments to build strong communities, fight climate change, and create new jobs across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in public transit infrastructure shortens commute times for families, creates good middle class jobs, grows our economy, and cuts air pollution. Since 2015, the Government of Canada has invested more than $13 billion in 1,300 public transit projects for communities across Canada. This is the largest public transit investment in Canadian history, and as we build back better from the global COVID-19 pandemic, we will continue to make these smart investments that support Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $14.9 billion for public transit projects over the next eight years, which includes permanent funding of $3 billion per year for Canadian communities beginning in 2026-27. This announcement provides cities and communities the predictable transit funding they need to plan for the future, and is part of our plan to create one million jobs, fight climate change, and rebuild a more sustainable and resilient economy. These investments will:</p>\n\n<ul>\n\t<li>Help Canadians move around easier and create new jobs by building major public transit projects, providing dedicated planning funding to accelerate future major projects, and supporting the expansion of large urban transit systems that many Canadians depend on every day.</li>\n\t<li>Reduce pollution and create jobs for Canadians by enhancing public transit systems and switching them to cleaner electrical power, including supporting the use of zero-emission vehicles and related infrastructure, complementing the work of the Canada Infrastructure Bank.</li>\n\t<li>Support healthy lifestyles in our communities and meet the growing demand for active transportation projects, including by building walkways and paths for cycling, walking, scooters, e-bikes, and wheelchairs.</li>\n\t<li>Help Canadians living in rural and remote areas travel to and from work more easily and access essential services, by working with rural, remote, and Indigenous communities to identify and create transit solutions that meet their needs.</li>\n\t<li>Support our cities and communities by making a permanent and stable federal commitment to funding public transit, and facilitate partnerships between all orders of government, Indigenous communities, transit agencies, and other stakeholders to develop an approach to permanent public transit funding in a manner that offers the greatest benefits to Canadians.</li>\n</ul>\n\n<p>Investing in public transit infrastructure will build strong communities across the country and deliver a better quality of life for all Canadians. The government will continue to invest in projects that best support our recovery, create middle class jobs and economic growth, and help us reach our climate targets. Together, we can create a Canada that is cleaner, more competitive, and more resilient for generations to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we invest in public transit infrastructure, we are supporting good middle class jobs, creating better commutes, fighting climate change, and helping make life easier and more affordable for Canadians. We will continue to do what it takes to ensure our economic recovery from COVID-19 and build back a more resilient country for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we build back better, it is time to ambitiously invest in modern and sustainable public transit across our country, to reduce congestion, to help create a million jobs, and to support cleaner and more inclusive communities. Permanent, long-term funding for public transit will mean new subway lines, light-rail transit and streetcars, electric buses, cycling paths and improved rural transit. It will mean that Canadians can get around in faster, cleaner, and more affordable ways. And it will help drive us to net-zero emissions and ensure a more sustainable future for our kids.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>&nbsp;“Our government is committed to investing in public transit in communities across the country. We are working in collaboration with municipal, provincial and territorial governments to support Canadians in building a strong economy and clean environment.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Investing in cleaner and more affordable modes of transportation is an important part of Canada’s strengthened climate plan – one that means we will exceed our 2030 target and that will put us on a path to get to net-zero emissions by 2050. Transportation accounts for one-quarter of Canada’s emissions and represents an area that is in need of smart climate investments, like the ones that we have announced today, to support good Canadian jobs, a stronger economy, and a healthier planet.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since 2015, the Government of Canada has spent over $13 billion in more than 1,300 public transit projects across Canada. These investments have helped build more than 240 kilometres of new public transit subway and light rail line, purchase over 300 zero-emission buses, and create almost 500 kilometres of active transportation trails, bike and pedestrian lanes, and recreational paths.</li>\n\t<li>Through the Investing in Canada Plan, the Government of Canada is already investing $28.7 billion to support public transit projects, including $5 billion available for investment through the Canada Infrastructure Bank.</li>\n\t<li>In October, as part of the Canada Infrastructure Bank’s three-year, $10 billion Growth Plan, the government announced that $1.5 billion of the available funding will be used to accelerate the adoption of zero-emission buses and charging infrastructure so Canadians can have cleaner commutes.</li>\n\t<li>Canada’s <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview.html\">strengthened climate plan</a> committed to provide permanent public transit funding. The plan encourages cleaner modes of transportation, such as low and zero-emission vehicles, transit, and active transportation, to make communities healthier, less congested, and more vibrant.</li>\n\t<li>In July 2020, the Government of Canada announced the Safe Restart Agreement, a federal investment of over $19 billion to help provinces and territories restart their economies while protecting the health of Canadians. The investment included a contribution of up to $2 billion to support municipalities with COVID-19 operating costs for six to eight months, and a commitment to cost-match more than $2.3 billion to support any additional provincial or territorial contributions for public transit.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/office-infrastructure/news/2021/02/a-plan-to-permanently-fund-public-transit-and-support-economic-recovery.html\">A Plan to Permanently Fund Public Transit and Support Economic Recovery</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/01/prime-minister-announces-infrastructure-plan-create-jobs-and-grow\">Prime Minister announces infrastructure plan to create jobs and grow the economy</a></li>\n</ul></div>\n      "
}