{
  "path": "/en/news/statements/2017/09/11/statement-prime-minister-anniversary-911-and-national-day-service",
  "pageTitle": "Statement by the Prime Minister on the anniversary of 9/11 and the National Day of Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 16<sup>th</sup> anniversary of the September 11, 2001, terrorist attacks and on the National Day of Service:</p><p>“Sixteen years ago today, terrorist attacks in the United States killed nearly 3,000 innocent victims, including 24 Canadians. On this solemn anniversary, we remember the lives taken so cruelly, and we offer our deepest sympathies to their loved ones and the many who still struggle with the trauma caused by these attacks.</p><p>“Today, we also honour the bravery of the first responders and countless others who put themselves in harm’s way on 9/11. We remember those who knowingly risked their lives to save others – who rushed into the rubble, who climbed the stairs of the collapsing towers, who stormed the cockpit of a hijacked plane. Their acts of heroism and sacrifice live on, through the women and men they saved, and the stories from which we continue to draw strength.</p><p>“Even in the darkness of 9/11, humanity’s capacity for goodness shone through. We continue to be inspired by the people of Gander, Halifax, Vancouver and other Canadian cities who opened their hearts and their homes to stranded air travelers and crews from around the world in the aftermath of these attacks.</p><p>“On this National Day of Service, I also want to thank those who continue to fight on the front lines against terrorism – women and men in uniform, the intelligence community, diplomats, and security and law enforcement professionals. They work tirelessly to keep us safe at home and abroad.</p><p>“While recent events have shown that no country is immune to senseless acts of terror, we must stand united – as an international community – against violence and all acts that seek to sow fear and division. Such acts only strengthen our resolve to counter hate by promoting the values of diversity, inclusion, and peace.</p><p>“On behalf of the Government of Canada, Sophie and I encourage Canadians to take part in acts of service today to honour the selflessness shown by so many on 9/11.”</p></div>\n      "
}