{
  "path": "/en/news/statements/2021/07/26/statement-prime-minister-welcome-canadas-30th-governor-general-her",
  "pageTitle": "Statement by the Prime Minister to welcome Canada’s 30th Governor General, Her Excellency the Right Honourable Mary Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome Canada’s new Governor General, Her Excellency the Right Honourable Mary Simon:</p>\n\n<p>“On behalf of the Government of Canada, it is my honour and privilege to welcome Canada’s 30th Governor General, Her Excellency the Right Honourable Mary Simon.</p>\n\n<p>“Born in Nunavik, in northern Quebec, Her Excellency has spent a lifetime working on behalf of those around her. A tireless advocate for Inuit rights and culture, young people, and the environment, she has received countless honours and was the first Inuk to hold a position as a Canadian ambassador.</p>\n\n<p>“Throughout her distinguished career, Her Excellency has shown a deep commitment to advancing social, economic, and human rights issues. She has played a leading role in strengthening the ties between the people of the Arctic regions, both nationally and internationally. As Canada’s Governor General and steward of our country’s Constitution and institutions, I know that she will contribute her unique experience and perspective to representing Canadians in all their diversity, both here at home and abroad, with dignity and integrity, and in both of Canada’s official languages. I am also confident that, as Canada’s Commander-in-chief, she will work to support the brave members of the Canadian Armed Forces who make tremendous sacrifices for the safety and security of our country and our people.</p>\n\n<p>“I am inspired by the historic nature of this moment, as our country continues to come to terms with the difficult realities of our collective past. I know that, as Canada’s first Indigenous Governor General, Her Excellency will devote herself to helping us as we confront these difficult truths together, walk the shared path of reconciliation, and build bridges between all those who call our country home.</p>\n\n<p>“On this day, we also pay tribute to Her Majesty Queen Elizabeth II, Queen of Canada, who for 69 years has served the Commonwealth and its peoples with grace, dignity, and wisdom. This is the 13th appointment of a Governor General of Canada by Her Majesty since she acceded to the throne in 1952.</p>\n\n<p>“I thank Her Excellency the Right Honourable Mary Simon for accepting to serve and offer her my most heartfelt congratulations. I invite all Canadians to find hope and inspiration in this important step forward for our country, and to join me in wishing her well as she brings her vision for a fairer, more equitable, and more just Canada to our country’s highest and oldest office.”</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Prime Minister announces The Queen’s approval of Canada’s next Governor General</a></li>\n</ul>\n\n<p><br>\nAlso available in the following languages:</p>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/ediri-yati-holi-ki-ta-koldhere-nedhe-prime-minister-betsiane-si-canada\">Denesuline</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/tshishe-utshimau-e-pitshitinak-utaiamun-tshetshi-pushukatakan-tshishe\">Innu-aimun</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/uqausiusimajuq-kanataup-angajuqkaajjuanganut-tunngasuktittinirmut-kanaup\">Inuktitut</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/uqausiusimajuq-kanataup-angajuqqaajjuanganut-tunngasuktittinirmut-kanaup\">Inuktut Qaliujaaqpait</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/weestamakaywin-ouschi-kischee-li-ministr-chi-kischi-baen-rseu-kenadaw\">Michif-Cree</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/aen-itwayhk-awa-li-pramyii-miniss-ka-miyoonakishkatowaat-canada-30th-li\">Michif French</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/klusuwaqn-wejiaq-prime-minister-wjit-piskwatoq-kanata-30th-kaplnolowey\">Mi'kmaq</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/gaa-ikidod-gaanada-ogimaa-ji-biindiganaad-gaanada-aki-mary-simon-30\">Ojibway (Western)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/witamakaiwin-awe-kanikanakisic-kigiukuma-aipitikaiwinagin-kanata\">Oji-Cree</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/07/26/wihtamakewin-ohci-kihci-okimaw-ta-atamiskawat-kanata-ohci-30th\">Plains Cree</a></li>\n</ul></div>\n      "
}