{
  "path": "/en/news/readouts/2019/08/25/prime-minister-justin-trudeau-meets-shinzo-abe-prime-minister-japan",
  "pageTitle": "Prime Minister Justin Trudeau meets with Shinzo Abe, Prime Minister of Japan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with Prime Minister Shinzo Abe of Japan on the margins of the G7 Summit in France.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Abe on his successful hosting of the G20 Summit in Osaka in June. &nbsp;They also recalled the productive visit of Prime Minster Abe to Canada in April during which they were able to further &nbsp;advance the strong Canada-Japan bilateral relationship.</p>\n\n<p>The Prime Ministers reviewed current trends in the global economy and underlined the importance of collective strategies to promote growth and trade.&nbsp;They&nbsp;undertook to grow commercial ties, including through the Comprehensive and Progressive Trans-Pacific Partnership and through increased investment opportunities&nbsp;for the benefit of the people and businesses of both countries.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Prime Minister Abe welcomed the close bilateral and multilateral cooperation between Canada and Japan on global and security issues, including promoting security in the Asia-Pacific region. &nbsp;Canada’s contribution to enforcing United Nations Security Council sanctions against North Korea was highlighted in this regard. The two leaders expressed concern with the recent missile launches by North Korea in violation of UN sanctions. &nbsp;</p>\n\n<p>The leaders also discussed other regional issues such as China, where two Canadians remain in arbitrary detention, and Hong Kong.</p>\n\n<p>The Prime Ministers also had an exchange on relations with the Republic of Korea.&nbsp;</p>\n\n<p>The Prime Ministers expressed concern with the wildfires in the Amazon and agreed on the need for the G7 summit to address this pressing issue.&nbsp;&nbsp;</p></div>\n      "
}