{
  "path": "/en/news/news-releases/2019/06/04/prime-minister-announces-appointment-new-chief-justice-court-queens",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of the Court of Queen’s Bench of New Brunswick | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Tracey K. DeWare, a judge of the Court of Queen’s Bench of New Brunswick, Family Division, as the new Chief Justice of the Court of Queen’s Bench of New Brunswick.</p>\n\n<p>Chief Justice DeWare replaces the Honourable David D. Smith, who retired effective March 20, 2019, after more than 26 years of distinguished service as a judge.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am happy to announce the appointment of the Honourable Tracey K. DeWare as Chief Justice of the Court of Queen’s Bench of New Brunswick. Chief Justice DeWare brings over 18 years of experience practising law in Moncton, and, more recently, nearly seven years as a judge on the province’s superior court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and on the recommendation of the Prime Minister.</li>\n\t<li>Justice DeWare will be the first female Chief Justice of the Court of Queen’s Bench of New Brunswick.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/06/04/honourable-tracey-k-deware\">The Honourable Tracey K. DeWare</a></li>\n</ul></div>\n      "
}