{
  "path": "/en/news/news-releases/2017/04/21/prime-minister-trudeau-attend-nato-leaders-meeting-g7-summit-and",
  "pageTitle": "Prime Minister Trudeau to attend NATO Leaders’ Meeting, G7 Summit, and traveI to Italy and Vatican City | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Brussels, Belgium, to participate in the NATO Leaders’ Meeting on May 25. Following the NATO Meeting, he will visit Taormina, Italy, from May 26 to 27, to participate in the 43<sup>rd</sup> G7 Leaders’ Summit. He will then go to Rome and Vatican City.</p><p>Discussions at the NATO Meeting will focus on Euro-Atlantic security issues, including NATO’s counter-terrorism role and burden-sharing within the Alliance.</p><p>During the Prime Minister’s first official visit to Italy, the Prime Minister will seek ways to expand opportunities for Canadians and Italians alike, and to help create good, well-paying middle class jobs on both sides of the Atlantic. He will discuss the timely ratification of the Comprehensive Economic and Trade Agreement (CETA), and address pressing global issues, including international and regional security, climate change, and migration.</p><p>In Vatican City, Prime Minister Trudeau will have an audience with His Holiness Pope Francis for the first time.</p><h2>Quotes</h2><blockquote><p>“Canada is a leading member of NATO and will lead the multinational battlegroup that will soon deploy to Latvia. I look forward to next month’s meeting where we will reaffirm Canada’s unwavering commitment to NATO, and take important steps to promote international peace and security, and a safer world for all.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The G7 is committed to addressing many of the most pressing global challenges of our time. At next month’s meeting, I will have the opportunity to sit down with some of our closest international partners, and promote the importance of a strong middle class, and building economies that benefit everyone, not just the wealthiest few.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“I look forward to meeting with His Holiness Pope Francis for the very first time. He is the religious leader for millions of Canadians, and our meeting will allow us to explore how Canada and the Holy See can further collaborate on a range of international issues.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be Prime Minister Trudeau’s second visit to Belgium.</li><li>The NATO Leaders’ Meeting will include an inauguration of NATO’s new Headquarters.</li><li>Canada, along with 11 other countries, founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. Over the past 68 years, NATO has proven itself to be a major contributor to international peace and security.</li><li>Since 2014, Canada has actively worked alongside NATO allies to maintain security and stability in Central and Eastern Europe. Measures include training, exercises and other operational tasks.</li><li>The Leaders of the G7 – united by the common values of freedom and democracy, and respect for human rights – come together each year to discuss domestic and global issues. The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom and the United States. Representatives of the European Union also attend meetings.</li><li>A business delegation organized by the Italian-Canadian Chamber of Commerce will accompany Prime Minister Trudeau on his official bilateral visit to Rome.</li><li>Canada and Italy enjoy strong and historic people-to-people connections. Canada’s large and dynamic Italian-Canadian community, almost 1.5 million strong, is particularly interested and engaged in all aspects – cultural, social, economic and political – of our bilateral relations.</li><li>Canada and the Holy See share a commitment to promote dignity and freedom of conscience and religion.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/belgium-belgique/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Belgium Relations</a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li><li><a href=\"http://www.canadainternational.gc.ca/holy_see-saint_siege/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Holy See Bilateral Relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;menu_id=8\">Canada-Italy Relations</a></li><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li><li><a href=\"http://w2.vatican.va/content/vatican/en.html\">The Holy See</a></li><li><a href=\"http://www.g7italy.it/en\">Italian G7 Presidency 2017</a></li><li><a href=\"http://www.nato.int/\">North Atlantic Treaty Organization</a></li></ul></div>\n      "
}