{
  "path": "/en/news/readouts/2023/04/20/prime-minister-justin-trudeau-meets-president-and-ceo-us-chamber-commerce",
  "pageTitle": "Prime Minister Justin Trudeau meets with President and CEO of the U.S. Chamber of Commerce Suzanne Clark | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President and Chief Executive Officer of the U.S. Chamber of Commerce, Suzanne Clark.</p>\n\n<p>Building on President Biden’s successful visit to Canada last month, the Prime Minister and Ms. Clark discussed ongoing efforts to grow our economies and create good, middle-class jobs in both countries. Prime Minister Trudeau and Ms. Clark also spoke about the pivotal role of rules-based, progressive trade that upholds environmental and labour standards and ensures inclusive economic growth.</p>\n\n<p>Prime Minister Trudeau noted the importance of strategic investments that create good manufacturing and research jobs in clean energy, including renewable energy and electric vehicle supply chains, as well as the critical minerals value chain, to strengthen economic security and unlock opportunities for people and businesses on both sides of the border.&nbsp;</p>\n\n<p>The Prime Minister also emphasized the importance of working together to build integrated, sustainable, and competitive economies in both countries, and of engaging the private sector, including through public-private partnerships, to further advance North American competitiveness.</p>\n\n<p>Prime Minister Trudeau and Ms. Clark looked forward to speaking more about these issues in the future.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/24/working-united-states-grow-our-clean-economies-and-create-good-middle\">Working with the United States to grow our clean economies and create good, middle-class jobs on both sides of our border</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2023/03/24/prime-minister-trudeau-and-president-biden-joint-statement\">Prime Minister Trudeau and President Biden Joint Statement</a></li>\n</ul></div>\n      "
}