{
  "path": "/en/news/news-releases/2021/10/31/prime-minister-concludes-successful-g20-leaders-summit-italy",
  "pageTitle": "Prime Minister concludes successful G20 Leaders’ Summit in Italy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G20 Leaders’ Summit in Rome, Italy, with a focus on the urgent priorities of protecting the environment and fighting climate change and biodiversity loss.</p>\n\n<p>Prime Minister Trudeau emphasized the importance of G20 leadership in building and sustaining climate action, including fully implementing the Paris Agreement, promoting clean growth, and moving forward on net-zero emissions goals. He also reiterated Canada’s support for ongoing efforts under the United Nations (UN) Conference on Biological Diversity, toward the target of 30 per cent global land and marine conservation by 2030.</p>\n\n<p>Climate change affects us all, and we must ensure all countries are equipped to help build a cleaner and more resilient future for everyone. That is why, in June, Canada doubled its international climate finance commitment from the $2.65 billion announced in 2015 to $5.3 billion over the next five years, including increased support for adaptation, as well as nature-based solutions, and confirmed its support for the transition to clean energy and the phasing-out of coal worldwide. Earlier this week, Canada and Germany published a delivery plan to demonstrate the path to mobilizing US$100 billion in annual climate financing, helping to provide transparency on this key commitment in the lead up to the upcoming UN Climate Change Conference of the Parties in Glasgow.</p>\n\n<p>The Prime Minister also addressed a G20 side event on the critical role of the private sector, and of public-private partnerships, in the global fight against climate change. During the event, he highlighted Canada’s support for international climate finance as critical to helping developing countries address climate change, and underscored the central role that the private sector has to play in meeting climate finance goals. To date, Canada’s support for climate action in developing countries has helped them move toward a cleaner future, and contributed to cutting global pollution – the equivalent of removing about 47 million cars from the roads for one year. They have also helped at least 5.9 million people adapt to the effects of climate change, and mobilized significant contributions from the private sector. &nbsp;</p>\n\n<p>During the Summit, the Prime Minister took part in discussions with G20 leaders on sustainable development in the context of recovery from the COVID-19 pandemic. He reiterated the need for collective G20 action and leadership in working toward the Sustainable Development Goals (SDGs), and emphasized that this work should prioritize gender equality and the protection of the most vulnerable. He also highlighted the importance of investments in quality infrastructure for sustainable and inclusive development.</p>\n\n<p>Through the <em>Financing for Development in the Era of COVID-19 and Beyond Initiative</em>, Canada has helped to bring leaders together to develop practical policy approaches to help achieve the SDGs while responding to the impacts of the pandemic. Canada will continue to take a leadership role in development finance, including for gender equality and women’s economic empowerment, in financing for COVID-19 vaccines, and in advocacy on behalf of Small Island Developing States.</p>\n\n<p>Later today, the Prime Minister will attend the Global Summit on Supply Chain Resilience, hosted by the United States on the margins of the G20 Leaders’ Summit. The smooth and effective operation of supply chains is fundamental to economic prosperity and security in Canada and around the world. The Prime Minister will highlight the importance of multilateral collaboration and a rules-based, predictable trading environment in ensuring supply chain resilience.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“While we aim to finish the fight against COVID-19, we must not lose sight of the existential threat posed by climate change. Canada has worked with our G20 partners to address global challenges, promote our shared values, and create jobs and opportunities for people in our countries. Now, we join together again to call for accelerated action on tackling climate change, so we can build a cleaner, better world for the generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the Summit, Prime Minister Trudeau held bilateral meetings with leaders, including the Prime Minister of the United Kingdom, Boris Johnson, the Prime Minister of Spain, Pedro Sánchez, the President of the European Council, Charles Michel, the President of the European Commission, Ursula von der Leyen, and the President of Argentina, Alberto Fernández.</li>\n\t<li>On the first day of the Summit, G20 leaders focused on the ongoing response to the COVID-19 pandemic, including equitable access to vaccines. Leaders also committed to supporting a global economic recovery for everyone, and advanced their efforts to implement new mechanisms to prepare the world for, and increase our resilience towards, future health emergencies.</li>\n\t<li>The G20 includes Argentina, Australia, Brazil, Canada, China, Germany, the European Union, France, India, Indonesia, Italy, Japan, Mexico, Russia, Saudi Arabia, South Africa, South Korea, Turkey, the United Kingdom and the United States.</li>\n\t<li>This was the first in-person meeting of G20 leaders since 2019 and the seventh G20 Summit attended by Prime Minister Trudeau.</li>\n\t<li>Italy holds the G20 presidency in 2021, and Indonesia will hold it in 2022.</li>\n\t<li>Under the Paris Agreement to the United Nations Framework Convention on Climate Change (UNFCCC), countries agreed to collectively strengthen the global response to climate change, including by limiting the global average temperature rise to well below 2°C, while also pursuing efforts to limit warming to 1.5°C.</li>\n\t<li>At the request of the United Kingdom, Canada and Germany co-led a delivery plan to provide transparency on the path to delivering US $100 billion per year through to 2025 in climate financing support to developing countries. In April 2021, at a Leaders Summit on Climate, the Prime Minister announced that Canada would enhance its target to reduce greenhouse gas emissions under the Paris Agreement – known as a Nationally Determined Contribution (NDC) – by 40-45 per cent below 2005 levels, by 2030. Canada officially submitted its enhanced NDC to the United Nations Framework Convention on Climate Change in July 2021.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/2021-10-31-g20-rome.aspx?lang=eng\">G20 Rome Leaders’ Declaration</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/30/global-health-and-economy-prime-minister-concludes-productive-first\">Global Health and Economy: Prime Minister concludes productive first day of G20 Leaders’ Summit in Italy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/25/prime-minister-travel-netherlands-italy-and-united-kingdom\">Prime Minister to travel to the Netherlands, Italy, and the United Kingdom</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.g20.org/rome-summit.html\">G20 Rome Summit 2021 </a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Italy Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance/delivery-plan.html\">Climate Finance Delivery Plan: Meeting the US$100 Billion Goal</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n\t<li><a href=\"https://www.un.org/en/coronavirus/financing-development\">Financing for the Development in the Era of COVID-19 and Beyond Initiative</a></li>\n</ul></div>\n      "
}