{
  "path": "/en/news/statements/2022/09/28/statement-prime-minister-50th-anniversary-1972-summit-series",
  "pageTitle": "Statement by the Prime Minister on the 50th anniversary of the 1972 Summit Series | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 50th anniversary of the 1972 Canada-Soviet Union Hockey Series (Summit Series):</p>\n\n<p>“Fifty years ago today, Canada’s top professional players faced the Soviet Union’s national team in the finale of an eight-game hockey series known as the Summit Series. Against the backdrop of the Cold War, both countries, who were playing against one another for the very first time, represented different styles of not only hockey, but sets of values and political systems too.</p>\n\n<p>“Few moments have brought Canadians together like the Summit Series of 1972. It is estimated that three quarters of the population at that time – 15&nbsp;million Canadians – tuned into the final game of the series from their homes, offices, and classrooms that Thursday afternoon. With just 34 seconds remaining, Paul Henderson secured the series victory by scoring the winning goal of the final game, and Canadians from coast to coast to coast erupted in celebration.</p>\n\n<p>“In the heat of the Cold War, many saw Canada’s victory as much more than defeating an opponent on the ice. It helped define who we are as Canadians. The series paved the way for more European and Eastern Bloc players to play in North America, and their different styles of play ultimately changed hockey forever.</p>\n\n<p>“The grit and determination displayed by players throughout the Summit Series continues to serve as a lesson to us all of what can be accomplished with hard work, dedication, and heart. These heroes taught us to never give up, and perhaps the most important lesson of all: they showed us that having a peaceful competition on ice can go a long way for diplomacy. The world is in a different place today than it was during the Cold War. The challenges we face are not the same, but we will never stop fighting for what is right.</p>\n\n<p>“Last week, I was honoured to meet the heroes from Team Canada ’72 and stand in the House of Commons to remember this iconic moment – one of the greatest in Canada’s sporting history. Today, as we celebrate the 50th anniversary of the Summit Series, and all the members of this historic team, let’s remember the best of who we are as Canadians. Let’s continue our work to make sure people – young and old, players and fans – can be part of this sport in a safe and respectful environment. And let’s remember that with hope and hard work, there’s nothing we can’t overcome.”</p></div>\n      "
}