{
  "path": "/en/news/news-releases/2018/11/15/prime-minister-concludes-successful-visit-singapore-and-participation",
  "pageTitle": "Prime Minister concludes successful visit to Singapore and participation at ASEAN | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Singapore and his participation at the 33rd Association of Southeast Asian Nations (ASEAN).</p><p>Canada is committed to deepening ties with the Asia Pacific region in order to expand and diversify trade, attract global investment, and create good, middle class jobs at home.</p><p>As part of the third Canada-China Annual Leaders’ Dialogue, the Prime Minister met with the Premier of the State Council of the People's Republic of China, Li Keqiang. The two leaders discussed how Canada and China can increase trade and commercial opportunities between the two countries, work more closely together to fight climate change and plastic pollution, and create more jobs for all our citizens.</p><p>At the ASEAN Working Lunch, the Prime Minister promoted Canada as a partner of choice for trade and investment, and stressed the importance of multilateral trade agreements that build a stronger middle class and benefit everyone. The Prime Minister also reiterated Canada’s desire to join the East Asia Summit and the ASEAN Defense Ministers’ Meeting-Plus, which would allow Canada to expand cooperation on a wide range of economic, political, and security issues.</p><p>The Prime Minister met with Prime Minister Lee Hsien Loong and President Halimah Yacob of Singapore. The leaders discussed the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), the importance of the global rules-based trading system, and how countries need to come together more than ever to tackle common challenges. Canada and Singapore also exchanged two Memoranda of Understanding to enhance cooperation in the areas of cybersecurity and smart cities.</p><p>While in Singapore, the Prime Minister announced the Canada-ASEAN Cooperation to Mitigate Biological Threats, as well as the expansion of Canada's successful Canadian Technology Accelerator program, with a new accelerator being launched in Singapore.</p><p>The Prime Minister also spoke to students and faculty at the National University of Singapore about the importance of a world community built on shared values, standards, and rules. He also met with Canadian students studying in Singapore.</p><p>The Prime Minister will now travel to Papua New Guinea for the last leg of his trip, to take part in the Asia Pacific Economic Cooperation (APEC) Leaders’ Meeting.</p><h2>Quotes</h2><blockquote><p>“I thank the Prime Minister and President of Singapore for their invitation to attend the 33rd ASEAN Summit, and congratulate them on their successful ASEAN events this past year. The relationship between Canada and Singapore will only deepen as the CPTPP comes into force and creates new opportunities and good, middle class jobs for people in both our countries.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada is a leader in areas that matter most to ASEAN, from championing open and free trade to fighting climate change and promoting sustainable development. Canada’s presence as a guest of the Chair attests to our strong partnership with ASEAN and our desire to grow the partnership even more, for the benefit of Canadians and people in Southeast Asia alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Bilateral relations between Canada and Singapore are wide-ranging and are built on areas of mutual interest, such as trade, science, technology, security, and defence.</li><li>Canada and Singapore cooperate within multilateral fora such as APEC, the World Trade Organization, the Commonwealth, the United Nations and ASEAN.</li><li>Singapore is Canada’s largest Southeast Asian destination for Canadian direct investment abroad and the largest source of foreign direct investment from the region.</li><li>Canada has been a Dialogue Partner of ASEAN for over 40 years, and supports the organization’s efforts to enhance peace, stability, and prosperity in Southeast Asia and the wider Asia-Pacific region.</li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2018/11/14/prime-minister-announces-initiatives-singapore\">Prime Minister announces continued collaboration with Singapore</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li><li><a href=\"/en/news/news-releases/2018/11/14/strengthening-canada-singapore-commercial-relationship\">Strengthening the Canada-Singapore commercial relationship</a></li><li><a href=\"/en/news/news-releases/2018/11/13/prime-minister-announces-strengthened-partnership-china\">Prime Minister announces strengthened partnership with China</a></li></ul></div>\n      "
}