{
  "path": "/en/news/news-releases/2019/06/18/trans-mountain-expansion-will-fund-canadas-future-clean-economy",
  "pageTitle": "Trans Mountain Expansion will fund Canada’s future clean economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada has approved the Trans Mountain Expansion (TMX) and that every dollar the federal government earns from this project will be invested in Canada’s clean energy transition.</p>\n\n<p>The environment and the economy go hand-in-hand. When we create prosperity today, we can invest in the clean jobs, technologies, and infrastructure of the future&nbsp;<em>—</em>&nbsp;and help Canadians benefit from opportunities presented by a rapidly changing economy.</p>\n\n<p>The key to creating prosperity is finding new markets for our businesses to sell their products and services. Nowhere is the need to diversify greater than for our energy sector, where 99 per cent of our conventional resources are sold to one market&nbsp;<em>—</em>&nbsp;and often at large discounts. Canadians understand that we need to open up new international markets, in order to get a full and fair price, support workers and their families, and foster competitiveness.</p>\n\n<p>Today’s approval was based on the confidence that:</p>\n\n<ul>\n\t<li>strong environmental protections have been and continue to be put in place, and that the effects of the project can be mitigated through conditions and recommendations outlined by the National Energy Board (NEB), as well as measures including the historic $1.5 billion Oceans Protection Plan and the national climate plan.</li>\n\t<li>consultations with Indigenous peoples involved meaningful, two-way dialogue, which fulfilled the legal duty to consult and helped identify new accommodation measures and conditions to appropriately address potential impacts on Indigenous rights and concerns expressed by Indigenous communities.</li>\n</ul>\n\n<p>The Prime Minister also announced that every dollar the federal government earns from this project will be invested in Canada’s clean energy transition. It is estimated that additional corporate income tax revenues from the project alone could generate $500 million per year once the project has been completed. This money, as well as any profit from the sale of the pipeline, will be invested in clean energy projects that will power our homes, businesses, and communities for generations to come.</p>\n\n<p>In addition, the Prime Minister announced that the Government of Canada will launch the next phase of engagement with Indigenous groups on ways they could share in the benefits of the expansion, including through equity ownership or revenue sharing. This is an important step on our path toward reconciliation with Indigenous peoples.</p>\n\n<p>By moving forward with TMX, we are creating jobs, diversifying markets, accelerating our clean energy transition, and opening up new avenues for Indigenous economic prosperity.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We have a responsibility to ensure that the decisions we make today move us toward a cleaner, sustainable economy. Major resource projects can move forward, but only if we do so in a way that protects the environment and respects Indigenous rights. The TMX project is a significant investment in Canadians and in Canada’s future that will create thousands of good, middle class jobs, maintain the highest environmental standards, and fund the clean energy solutions that Canada needs to stay competitive on the global stage.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This decision reflects guidance from the Federal Court of Appeal’s ruling in August 2018 that quashed the government’s approval of the project. The ruling found that the NEB had erred in its decision to exclude considerations of the environmental impact of project-related marine shipping, and that the government had failed to meet its legal duty to consult with Indigenous peoples. The ruling also provided guidance on how to address these errors.</li>\n\t<li>Following that decision, the federal government launched the most comprehensive consultations with Indigenous groups and communities that it has ever conducted for a major project. The government appointed a former Supreme Court Justice, the Honourable Frank Iacobucci, to provide oversight and direction to the government on the process.</li>\n\t<li>The Government of Canada takes its environment and climate commitments seriously and is working to protect our oceans and coastlines through:\n\t<ul>\n\t\t<li>Historic investments through the&nbsp;<a href=\"https://www.tc.gc.ca/en/campaigns/protecting-coasts.html\">Oceans Protection Plan</a></li>\n\t\t<li>A $15.7 billion investment to&nbsp;<a href=\"https://pm.gc.ca/eng/news/2019/05/22/prime-minister-announces-renewal-canadian-coast-guard-fleet\">renew the Canadian Coast Guard</a>&nbsp;fleet, so it can continue to deliver its critical missions in support of safe marine trade</li>\n\t\t<li>A $167.4 million&nbsp;<a href=\"https://www.tc.gc.ca/en/campaigns/whales-initiative-protecting-southern-residen-killer-whale.html\">Whales Initiative</a>, and an&nbsp;<a href=\"https://www.canada.ca/en/fisheries-oceans/news/2018/10/government-of-canada-taking-further-action-to-protect-southern-resident-killer-whales.html\">additional $61.5 million</a>, to address threats to the Southern Resident Killer Whale</li>\n\t</ul>\n\t</li>\n\t<li>Through the Oceans Protection Plan, the Government of Canada is taking strong action to prevent marine pollution incidents, and to increase capacity to respond if an incident takes place.</li>\n\t<li>These consultations led to the development of eight broad accommodation measures that will be tailored to respond to the concerns raised by Indigenous communities, including enhanced marine response capacity and fish habitat restoration, to address the impact on Indigenous rights.</li>\n\t<li>On February 22, 2019, as directed by the Government of Canada, the NEB delivered a reconsideration report, which included an overall recommendation that the TMX project be approved as it is in the public interest.</li>\n\t<li>The report outlined 156 conditions that would be imposed if the project was approved, as well as 16 recommendations that fall outside the Board’s mandate but within the authority of the Government of Canada. These conditions cover a wide range of areas, including emergency preparedness and response, pipeline safety and integrity, and consultation with affected Indigenous communities.</li>\n\t<li>The Government of Canada is committed to acting on the NEB’s recommendations and conditions, and has made amendments to strengthen six of the conditions to further address concerns of Indigenous groups.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder1.html\">How we got here</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder2.html\">What informed the government decision</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder5.html\">Bolstering marine safety</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder7.html\">Strengthening emergency response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder6.html\">Protecting the Southern Resident Killer Whale</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder8.html\">Advancing cumulative effects management</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder3.html\">Next steps</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder9.html\">Economic benefits of the Trans Mountain Expansion project</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder10.html\">Indigenous engagement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2019/06/canadas-plan-for-climate-change-and-clean-growth.html\">Canada’s plan for climate change and clean growth</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2019/06/greenhouse-gas-emissions-from-the-trans-mountain-project.html\">Greenhouse gas emissions from the Trans Mountain project</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder11.html\">Accommodations and amended conditions</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain/the-decision/backgrounder12.html\">National Energy Board’s 16 recommendations</a></li>\n\t<li><a href=\"https://www.fin.gc.ca/n19/data/2019-06-18_1-eng.asp\">Transition to a clean economy</a></li>\n\t<li><a href=\"https://www.fin.gc.ca/n19/data/2019-06-18-eng.asp\">Indigenous participation in the economic development of the Trans Mountain Expansion project</a></li>\n\t<li><a href=\"https://www.canada.ca/content/dam/nrcan-rncan/site/tmx/Letter_from_Iacobucci_accessible_en.pdf\">Letter from former Supreme Court Justice, the Honourable Frank Iacobucci</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/campaign/trans-mountain.html\">Trans Mountain Expansion Project</a></li>\n\t<li><a href=\"https://www.neb-one.gc.ca/pplctnflng/mjrpp/trnsmntnxpnsn/trnsmntnxpnsnrprt-eng.html\">National Energy Board – Reconsideration Report</a></li>\n\t<li><a href=\"https://www.canada.ca/content/dam/nrcan-rncan/site/tmx/TMX-CCAR_June2019-e-accessible.pdf\">Crown Consultation and Accommodation Report</a></li>\n\t<li><a href=\"https://www.transmountain.com/\">Trans Mountain Corporation</a></li>\n</ul></div>\n      "
}