{
  "path": "/en/news/statements/2021/07/19/statement-prime-minister-eid-al-adha",
  "pageTitle": "Statement by the Prime Minister on Eid al-Adha | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Eid al-Adha:</p>\n\n<p>“Today, Muslims in Canada and around the world will celebrate Eid al-Adha as they mark the end of the Hajj, the annual Islamic pilgrimage to Mecca.</p>\n\n<p>“On this day, Muslims traditionally attend prayers, exchange gifts and greetings, provide aid to the poor, perform a sacrifice, and share a special meal with family and friends. This important day still offers an opportunity to reflect on lessons of sacrifice, compassion, and generosity, and to show appreciation for life’s blessings. It is also a time for all Canadians to recognize the many contributions that Muslim Canadians have made to our country for generations.</p>\n\n<p>“While some people will once again be able to gather safely with family and friends to celebrate this year’s Eid, others may still be isolated and alone. And many are missing out once again on the pilgrimage to Mecca. But if we continue to follow public health guidelines and get our COVID-19 vaccines as soon as it’s our turn, we will beat this virus and we will all be able to celebrate together next year.</p>\n\n<p>“Sadly, today will also be more sombre as we continue to acknowledge that Islamophobia and anti-Muslim hatred is real in Canada. The recent tragedy in London, Ontario, is a painful reminder that Muslims continue to face insults, threats, and violence in communities across the country. Hatred and discrimination have no place in our society. That is why the Government of Canada will host the National Summit on Islamophobia on July 22, to continue to take strong action against this hate and discrimination. Together, we must choose inclusion over intolerance, and reaffirm our commitment to a diverse Canada, where everyone – no matter their faith, ethnicity, culture, or gender – can feel welcome, safe, and respected.</p>\n\n<p>“On behalf of our family, Sophie and I wish all those observing Eid al-Adha a wonderful celebration.</p>\n\n<p>“Eid Mubarak!”</p></div>\n      "
}