{
  "path": "/en/news/news-releases/2017/05/04/prime-minister-trudeau-meets-youth-council-discuss-reconciliation",
  "pageTitle": "Prime Minister Trudeau meets with Youth Council to discuss reconciliation with Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Listening to the diverse voices of young Canadians will help us build a stronger, more prosperous Canada, where everyone has a real and fair chance at success. That is why the Prime Minister, Justin Trudeau, will meet with the Prime Minister’s Youth Council over the coming days to discuss the role of youth in reconciliation with Indigenous Peoples. This will be the third in-person meeting of the Youth Council since its inaugural meeting in September 2016.</p><p>The Youth Council will meet with several Cabinet ministers, the Parliamentary Secretary for Youth, and Indigenous leaders. They will also meet with Indigenous youth in the Montréal area, and visit the Kahnawà:ke Mohawk Territory, where they will meet with local youth from the community.</p><p>The Government of Canada is committed to listening to young people about issues that matter to them. As Minister of Youth, the Prime Minister wants to hear directly from young people about reconciliation with Indigenous Peoples, and the Youth Council is one way to support this dialogue. In the months to come, the Youth Council will continue to meet with other youth and leaders in their communities to talk about reconciliation as well as to hear the perspectives of young people on the pressing challenges of our time.</p><h2>Quotes</h2><blockquote><p>“I believe in the unlimited potential of Canada and young Canadians. I am pleased to once again meet with the Youth Council to get their important views on how we can build a better and stronger Canada where everyone has a chance to succeed.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Young Canadians can make – and are already making – significant contributions to advancing reconciliation with Indigenous Peoples. Our meeting over the next few days continues this important conversation and will help raise awareness of reconciliation among young Canadians from coast to coast to coast.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>On May 5, 2017, at 4:30 p.m. ET, the Prime Minister, Minister Mélanie Joly and the Youth Council will take part in a <a href=\"https://www.facebook.com/YouthCanada/\">Facebook Live event</a> and the public is encouraged to join the discussion. The livestream will showcase the Prime Minister’s Youth Council at work, and provide an opportunity for all Canadians to ask questions and contribute to the conversation about what young Canadians can do to support reconciliation with Indigenous Peoples.</li><li>The Youth Council is currently composed of 26 young Canadians, from diverse communities from all regions of Canada, who have a wide range of knowledge and experience.&nbsp;The Youth Council provides non-partisan advice to the Prime Minister and the Government of Canada on issues of importance to them and to all Canadians.</li><li>Over 17,000 young Canadians have signed up to learn about and participate in engagement and consultation activities supported by the Government of Canada. These opportunities range from online and in-person discussions, to consultations, and domestic and international delegations on topics such as accessibility legislation, climate change, agriculture, international relations, and youth employment.</li><li>In March 2017, the Government of Canada issued its first online <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council/youth-newsletter/2017/march.html\">newsletter</a> for young Canadians, which highlights the work of the Youth Council and engagement opportunities and activities for all Canadian youth. Young Canadians are encouraged to <a href=\"https://fluidsurveys.com/s/youth-jeunesse/?l=en\">sign up to receive the newsletter</a> and learn about more ways to get involved.&nbsp;</li></ul><h2>Associated Link</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li></ul></div>\n      "
}