{
  "path": "/en/news/news-releases/2020/01/13/prime-minister-hold-cabinet-retreat-manitoba",
  "pageTitle": "Prime Minister to hold Cabinet retreat in Manitoba | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a Cabinet retreat in Winnipeg, Manitoba, from January 19 to 21.</p>\n\n<p>During the retreat, the Prime Minister and ministers will discuss how to continue delivering real, positive results for all Canadians.</p>\n\n<p>Discussions will reflect the government’s commitment to fight climate change, strengthen the middle class, walk the road of reconciliation, keep people safe and healthy, and respond to global challenges.</p>\n\n<p>The three-day retreat is an opportunity to address key priorities moving forward, as well as the importance of doing so in an open and collaborative way. The government will continue to work with provinces, territories, municipalities, Indigenous peoples, stakeholders, and industry on the issues that matter most to Canadians.</p>\n\n<p>At the start of a new year, the government remains focused on building a better Canada for everyone. The upcoming Cabinet retreat is a chance to keep making progress, from ensuring that workers can find good jobs and seniors can count on a secure retirement, to making life more affordable for the middle class.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I look forward to a productive Cabinet meeting in Winnipeg, a fantastic city and an important economic and cultural centre for the Prairies. In October, Canadians sent a clear message that they want a government that finds common ground and ensures that everyone, from every region, benefits from a strong and growing modern economy. That is exactly what our government will deliver.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote></div>\n      "
}