{
  "path": "/en/news/statements/2022/06/30/joint-statement-between-canada-spain",
  "pageTitle": "Joint Statement between Canada & Spain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>On the occasion of the visit of the Prime Minister of Canada, Justin Trudeau, to Madrid, Canada and Spain commit to deepening our bilateral relationship, characterized by shared values, strong economic links and people-to-people ties.</p>\n\n<p>Our two countries are equally determined to protect democracy, human rights and the rule of law; and to steer sustainable, fair and inclusive economic growth. We are mutually motivated to meet the challenges of an equitable post-COVID recovery, effective and urgent climate change action, and a just energy transition; to advance gender equality and the empowerment of women and girls in all their diversity; and to stand up for multilateralism and the rules-based international order. Canada and Spain firmly commit to enhancing our partnership in support of peace, inclusion, prosperity and sustainability, at home and around the world.</p>\n\n<p>Together, we reiterate our condemnation of Russia’s unprovoked and unjustifiable aggression against Ukraine in the strongest possible terms, and reaffirm our unwavering commitment to <strong>Ukraine’</strong>s independence, sovereignty and territorial integrity. Russia’s aggression is an attack on democracy and a violation of international law, including the UN Charter, and it continues to cause widespread and senseless suffering and death. We renew our call on Russia to immediately withdraw all of its military forces and equipment from within the internationally recognized borders of Ukraine and return to a path of dialogue and diplomacy. We condemn Russia’s targeting of civilians in Ukraine and agree on the need to ensure accountability for any atrocities, war crimes or possible crimes against humanity it commits. We pledge our steadfast support to Ukraine and salute the courage and resilience of its people, including the millions of Ukrainians who have had their lives upended or been forcibly displaced. We thank all those in the global humanitarian community who continue to strive to offer them protection and assistance.</p>\n\n<p>We express our commitment to working together and with our international partners in support of those suffering around the world from the global impacts of Russia’s aggression, particularly vulnerable persons now experiencing greater <strong>food, energy and economic insecurity</strong>. The <strong>rules-based international system</strong> has been fundamental to the security, prosperity and continued progress of our societies, and we are committed to reinforcing it to meet the new challenges we are facing. The <em>Joint Statement on Reinforcing Multilateralism Together </em>launched in Madrid in 2020<em> </em>remains more relevant than ever. We will continue to support the implementation of the recommendations included in Secretary General Guterres’ “Our Common Agenda”, to ensure an effective, efficient, relevant and accountable United Nations system. As co-chair of the <em>Sustainable Development Goals (SDG) Advocates group</em>, Prime Minister Trudeau welcomes President of Government Sanchez’s leadership in the fight against climate change, protecting nature, and empowering women and girls all over the world. We look forward to close collaboration on shared priorities in the context of the G20.</p>\n\n<p>As transatlantic partners and friends, we reaffirm our <strong>commitment to</strong> <strong>NATO</strong> as the cornerstone of our collective security and defence. We will continue to work together with our NATO Allies to protect our shared strategic interests, guided by the Alliance’s new Strategic Concept. We endorse the Strategic Concept’s 360-degree approach to security, its updated consideration of climate change, and its integration of gender perspectives and the Women, Peace, and Security agenda. We stand firmly together to protect the Eastern flank through the Enhanced Forward Presence in Latvia, and to ensure NATO’s ability to address new and emerging threats along all its borders. We recognize that the current context requires enhancing the cooperation between NATO and the European Union. NATO’s Southern flank also poses new challenges to the Alliance, with complex and diverse threats from both state and non-state actors. Spain welcomes Canada’s recent full membership in the Sahel Alliance to enhance the stability and global development of the region. We recognize the impact that climate change is already having on security dynamics around the world and see the establishment of a NATO Climate Change and Security Center of Excellence (CoE) in Canada as an opportunity to work together on this field.</p>\n\n<p>Spain and Canada recognize that the <strong>climate emergency</strong> is the most serious challenge of our time. We are committed to accelerating climate action, in particular through clean technology and renewable energy investments, and stress the urgent need to increase global climate action to ensure that global greenhouse gas emissions are halved by 2030 and to reach net zero by 2050. We underline the need to reach the Paris Agreement goals, including to accelerate global efforts to make financial flows consistent with a pathway towards low greenhouse gas emissions and climate resilient development. Spain praises the decision made by Canada to host the COP15 for the UN Conference on Biodiversity in Montreal in December 2022. Both leaders also take note of the important discussions currently underway at the 2022 UN Ocean Conference in Lisbon, Portugal.</p>\n\n<p>We are committed to increasing our cooperation to <strong>advance the rule of law and safeguard democracy</strong> whenever it is threatened or undermined, to protect and promote human rights both online and offline, and to counter the growing threat of disinformation. We stand united in our commitment to advance human rights and fundamental freedoms, gender equality and inclusion, as the <strong>digital transformation</strong> continues to alter the foundations of our societies. We will also work within multilateral alliances, including the Freedom Online Coalition and the Media Freedom Coalition, and we will foster research and collaboration among public and private academic institutions, such as the new agreement between the University of Toronto’s Munk School of Global Affairs &amp; Public Policy, and the IE University’s School of Global and Public Affairs.</p>\n\n<p>As champions of <strong>feminist foreign policy</strong>, we share an engagement in advancing feminist approaches, eliminating structural and indirect barriers for all women, girls and marginalized people, and integrating gender perspectives across all our government policy. We reaffirm our commitment to the priorities defined in our <em>Declaration in Favour of Gender Equality</em> of 2018, and our determination to promote gender equality and the leadership of women in our bilateral economic relationship. We commit to cooperating to advance a feminist foreign policy agenda across a range of multilateral fora.&nbsp;</p>\n\n<p>In this era of <strong>post-COVID recovery</strong>, we are committed to fostering economic growth that benefits all our citizens, enhances environmental sustainability, and protects labour rights. Both countries are committed to the development of entrepreneurship, SMEs and innovation as the basis for quality employment, while ensuring adequate protection for digital economy and other non-standard workers, as well as strong and comprehensive social protection for those in need. As we celebrate the 5<sup>th</sup> anniversary of the <strong>Comprehensive Economic and Trade Agreement (CETA)</strong> between Canada and the EU, we applaud the rapid growth of bilateral trade between our two countries and note the potential for enhanced partnerships between our business, investment and innovation communities. We reaffirm our commitment to open, transparent, and inclusive trade guided by the rules-based multilateral trading system and the indispensable role of the World Trade Organization (WTO) at its core. We advocate for the swift and effective implementation of <a href=\"https://www.oecd.org/tax/beps/statement-on-a-two-pillar-solution-to-address-the-tax-challenges-arising-from-the-digitalisation-of-the-economy-october-2021.htm\" target=\"_blank\">the two-pillar solution</a> to address the tax challenges arising from digitalisation and globalisation of the economy under the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting (BEPS) Project.</p>\n\n<p>We intend to continue strengthening cooperation initiatives in the transatlantic framework, as stipulated in the <em>Strategic Partnership Agreement</em> between the <strong>EU and Canada</strong>. As Spain prepares for its presidency of the Council of the European Union in the second half of 2023, we intend to expand our longstanding engagement in policy areas of mutual interest.</p>\n\n<p>We are committed to building on our friendship to strengthen our economies and protect the well-being of our populations in the face of <strong>economic instability and inflation</strong>, and meet our countries and regions’ short- and long-term strategic interests at the confluence of energy security and environmental sustainability. Specifically, we note the potential of <em>Repsol’s</em> Liquefied Natural Gas (LNG) facility in Saint John, New Brunswick, to eventually export LNG to Europe. Spain’s LNG re-gasification plants may provide needed capacity to support efforts to reduce European reliance on Russian energy.</p>\n\n<p>Our two countries share a vital relationship with <strong>Latin America and the Caribbean</strong>. We commit to working together, with our regional partners, to support democracy and prosperity in the hemisphere as well as an inclusive and sustainable recovery from the COVID-19 pandemic. We will<strong> </strong>encourage international financial institutions to provide adequate financing to middle-income <strong>Latin American and Caribbean</strong> countries according to their specific needs. We will also continue close collaboration and engagement with others to address the root causes and impacts of irregular migration and forced displacement and will continue to work together to seek solutions as members of the Group of Friends of the Quito Process and the Comprehensive Regional Protection and Solutions Framework (MIRPS) Support Platform, respectively.</p>\n\n<p>We are convinced of the abiding value of strong academic, cultural, and person-to-person ties in our bilateral relationship, and commit to support their deepening by supporting ambitious <strong>cultural initiatives</strong>, including work and travel opportunities for youth through our Youth Mobility Agreement, while encouraging strengthened links between our researchers, academics and students. &nbsp;Spain and Canada note the growing importance of the <strong>Spanish language</strong> in Canada, first foreign language in university and regulated education, which is promoted through the different programs on assistantships and visiting professors program, as well as the Spanish Resource Centers in Canadian Universities and the first Tribune of Canadian Hispanism. Likewise, Canada and Spain welcome the depth of the relations between numerous cultural and scientific entities of both countries that intertwine, even more so, our civil societies.</p>\n\n<p>We note the <strong>historic connections</strong> between coastal communities of our two countries, including Spanish sailors’ presence in the Atlantic Coast of Canada and the Spanish exploration in the West Coast, in particular being honoured by the reconstruction in Pasaia (Gipuzkoa) of a replica of the 16<sup>th</sup> Century Basque whaling vessel, the Nao San Juan, located in Red Bay, Labrador, a UNESCO World Heritage Site.</p>\n\n<p>We recognize the many similar advantages and challenges our two countries face domestically, as richly <strong>diverse, multilingual societies, </strong>committed to resettlement and<strong> </strong>welcoming of immigrants and refugees from around the world, who make invaluable contributions to our respective societies. To this end, we commit to sharing lessons learned and good practices, including with respect to community sponsorship of refugees, which has been successfully piloted, and is now being expanded, to Spain’s municipalities</p>\n\n<p>In order to advance in this common agenda, we will strengthen our political cooperation through regular high-level consultations at the level of the Spanish Secretary of State for Foreign and Global Affairs and the Canadian Deputy Minister of Foreign Affairs on a yearly basis.</p></div>\n      "
}