{
  "path": "/en/news/news-releases/2018/09/24/prime-minister-announces-appointment-two-senators",
  "pageTitle": "Prime Minister announces the appointment of two Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent Senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/09/24/beverley-busson\">Beverley Busson</a> (British Columbia)</li><li><a href=\"/en/news/backgrounders/2018/09/24/martin-klyne\">Martin Klyne</a> (Saskatchewan)</li></ul><p>Mrs. Busson is a champion of women in the workforce and enjoyed a distinguished career in the RCMP. Her efforts to push gender-based barriers and her expertise in security led to her becoming the first woman to lead the RCMP, when she was named Commissioner in 2006.</p><p>Mr. Klyne is a proud member of the Cree Métis with extensive business experience. He focused much of his career and volunteer efforts on advancing the economic development of Indigenous communities.</p><p>Both of these individuals were recommended by the Independent Advisory Board for Senate Appointments and chosen using the process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“I am pleased to welcome two new members to the Senate who have done tremendous work in their professional lives and as active members of their communities. I am confident that they will work diligently and with integrity to serve the best interests of the country and all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>There have been 40 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests –important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/09/24/beverley-busson\">Beverley Busson</a></li><li><a href=\"/en/news/backgrounders/2018/09/24/martin-klyne\">Martin Klyne</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li></ul></div>\n      "
}