{
  "path": "/en/news/statements/2021/07/26/aen-itwayhk-awa-li-pramyii-miniss-ka-miyoonakishkatowaat-canada-30th-li",
  "pageTitle": "Aen itwayhk awa Li Pramyii Miniss ka miyoonakishkatowaat Canada 30th Li Goovarner Giniraal, Aen Mamiyoohk Adret Aanoraabl Mary Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Li Pramyii Miniss, Justin Trudeau, anoosh wiihtam ooma ka miyoonakishkatowaat&nbsp;Canada neu Li Goovarner Giniraal, Aen Mamiyoohk Adret Aanoraable Mary Simon:</p>\n\n<p>“Li Goovarnimaan ouschi Canada, mitoni ooma l’oneur akwa kishchi kaykway ka miyoonakishkatowak awa Canada 30 Li Goovarner Giniraal. Aen Mimiyoohk Adret Aanoraable Mary Simon.</p>\n\n<p>“Kii nihtawahkiw Nunavik, taykay oonorr Quebec, Aen Mimiyoohk Adret tapitow atooshkawayw li moond. Noo wiihkaat aayayshkooshiw awa ouschi lii drway poor lii Inuit, li zheen moond, akwa la tayr, mishchet kii miiyaaw l’oneur akwa wiiya niikaan Inuk ka apit anita Canada opiihkishkwayshtamaakew.</p>\n\n<p>“Mishiwayitay aen atoshkaywin awa, Aen Mimiyoohk Adret waapahtahiwew ooma kishchi ashotamaakew ka atoshkahta miiyo pimatishiwin, manaachischikawin akwa lii drway poor li moond. Oniikaanayshtam ooma wiichihitowin anita li moond akwa Li Graan Noor rizhyoon, lii deu li moond aanchyii akwa mishoway daan li moond aantyii. Li Canada Goovarner Giniraal akwa kaa kanawayshchikayt ooma la naasyoon lway awka enn baachiss, nikishkayimaaw kaa wiichitaaw ouschi anima kaa ishi kishkayta akwa ka piihkishkwayshtamaakew, akwa ka kishchiikaapawew akwa Canada mishiwaytay, lii deu kiikiwaahk awka toot li moond, akwa kishchiikaapawew akwa ka kishchiikaapawew akwa la vayritii, akwa lii deu ouschi Canada si vray lii la laang. Ni kishkayihitayn, awa Canada Li Kommaander aen li shef, ka aansaamb ka atooshkawew ooki L’aarmii kaa shoohki atooshkaychik ouschi kwayesh kanawapamikaywuk akwa kwayash kanawaaytamok ooma nayshoon akwa lii moond.</p>\n\n<p>“Mitoni ooma nikishchi itaytayn ka ishpayik anoosh, ooma naasyoon maachi nishtoohtamok naaway noo kwaayesh kaakii pii ishpayik. Ninishtoohtayn, awa Canada Ayishiinoo Li Goovarner Giniraal kayishpayihk, Aen Mimiyooh Adret ka wiichihitaaw ooma kaa wii aansaamb atooshkayhk ooma la vayritii, aansaamb ka pimohtaahtamihk, akwa aen poon ka mamawii ooshtaahk ouschi oota naasyoon kaa ishinihkaataakik ta mayzoon.</p>\n\n<p>“Anoosh la zhoornii, ki mamihchimaanaw awa La Renn Queen Elilzabeth II, La Renn ouschi Canada, 69 l’aanii aashay pamiihiw ooki Commonwealth akwa li moond mitoni ouschi kishaywatishiwin, aykishchiitaymoowin, akwa nipwahkowin. Ooma 13<sup>th</sup> l’oovraazh ouschi Li Goovarner Giniraal oota Canada araa La Renn anita ouschi kaakii maachi apit aen 1952.</p>\n\n<p>“Maarsii aen Mimiyoohk Adret Aanoraable ouschi ooma kaa otina aen pamiihiwayhk awka mitoni ni nohtay nanashkomaaw kwaayesh toochikaatew. Ni wiihkoomaawuk toot li moond ka mishkaahkik pakoshayimoowin akwa miiyo ishiwaapahtamihk ootay niikaan oota naasyoon, akwa ka maamawi wiichihihaayahk naawach fayr, paray, akwa kwaayesh ka tootamakayhk oota naaysoon anit ouschi ooma kaa ishpaak akwa kaayaash l’offis.”</p>\n\n<h2>Kaykaach li mem</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Li Pramyii Miniss wiihtam La Renn taray itaytum ouschi Canada awa Li Goovarner Giniraal</a></li>\n</ul></div>\n      "
}