{
  "path": "/en/news/statements/2016/11/25/statement-prime-minister-canada-international-day-elimination-violence",
  "pageTitle": "Statement by the Prime Minister of Canada on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p>\n<p>“An estimated one in three women around the world experience violence in their lifetime. This statistic is unacceptable. It is crucial for all of us – women, men, and youth – to work together to put an end to this violence.</p>\n<p>“Violence against women is the world’s greatest and most persistent violation of human rights, leaving women and girls vulnerable and unable to fully participate in society. It damages families, communities, and countries.</p>\n<p>“Violence against women is not a women’s issue. Men must boldly work alongside women to combat this violence – and not simply because they have wives, daughters, or sisters. Women deserve the full depth of respect, safety, and dignity, regardless of their relationships with men.</p>\n<p>“To change the prevalence of this violence, we must first challenge the attitudes and behaviours that allow this violence to exist, and that allow disrespect for and abuse of women to become commonplace. We must teach our daughters and sons the importance of gender equality and the need to treat everyone with equal respect.</p>\n<p>“That is why the Government of Canada is investing in several programs both in Canada and around the world to help promote gender equality, support efforts to prevent gender-based violence, and stop human trafficking.</p>\n<p>“Today and throughout the 16 Days of Activism Against Gender-Based Violence, I encourage all Canadians not only to think about how their actions matter, but also to stand up against gender-based violence. Get started by joining the conversation online using the hashtag #ActionsMatter. Together, we can create a world that does not tolerate violence against women.”</p></div>\n      "
}