{
  "path": "/en/news/statements/2016/12/08/joint-statement-leaders-canada-france-germany-italy-united-kingdom-and",
  "pageTitle": "Joint statement from the leaders of Canada, France, Germany, Italy, the United Kingdom and the United States on the situation in Aleppo (Syria) | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A humanitarian disaster is taking place before our very eyes. Some 200,000 civilians, including many children, in eastern Aleppo are cut off from food and medicine supplies. Aleppo is being subjected to daily bombings and artillery attacks by the Syrian regime, supported by Russia and Iran. Hospitals and schools have not been spared. Rather, they appear to be the targets of attack in an attempt to wear people down. The images of dying children are heart breaking. We condemn the actions of the Syrian regime and its foreign backers, especially Russia, for their obstruction of humanitarian aid, and strongly condemn the Syrian regime’s attacks that have devastated civilians and medical facilities and use of barrel bombs and chemical weapons.</p>\n<p>The urgent need now is for an immediate ceasefire to allow the United Nations to get humanitarian assistance to people in eastern Aleppo and to provide humanitarian relief to those who have fled eastern Aleppo. The opposition have agreed the UN’s 4-point plan for Aleppo. The regime needs to agree (to) the plan too. We call on the Syrian regime to do this urgently to alleviate the dire situation in Aleppo; and call on Russia and Iran to use their influence to help make this happen.</p>\n<p>We urge all parties in Syria to adhere to international humanitarian law, including the Geneva Conventions. UN Secretary-General Ban Ki-moon has spoken about war crimes being committed in Syria. There must not be impunity for those responsible. We call on the UN to investigate respective reports and gather evidence to hold the perpetrators of war crimes to account. We are ready to consider additional restrictive measures against individuals and entities that act for or on behalf of the Syrian regime.</p>\n<p>At the same time, Russia is blocking the UN Security Council, which is therefore unable to do its work and put an end to the atrocities. The regime’s refusal to engage in a serious political process also highlights the unwillingness of both Russia and Iran to work for a political solution despite their assurances to the contrary. We support the efforts of the UN Special Envoy (Staffan) de Mistura to resume the political process through negotiations. Only a political settlement can bring peace for people in Syria.</p></div>\n      "
}