{
  "path": "/en/news/statements/2020/10/18/statement-prime-minister-persons-day",
  "pageTitle": "Statement by the Prime Minister for Persons Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for Persons Day:</p>\n\n<p>“Today, we celebrate&nbsp;<a href=\"https://cfc-swc.gc.ca/commemoration/whm-mhf/persons-personne-en.html\">Persons Day</a>, an important milestone in the struggle for women’s rights and participation in Canadian political life. On October 18, 1929, Canada’s highest court of appeal recognized women as ‘persons’ and granted them the right to be appointed to the Senate.</p>\n\n<p>“The <a href=\"https://cfc-swc.gc.ca/commemoration/whm-mhf/persons-personne-en.html\">Famous Five</a> – Emily Murphy, Nellie McClung, Irene Parlby, Louise McKinney, and Henrietta Muir Edwards – won a hard-fought, two-year-long battle in the landmark Persons Case. It is crucial to acknowledge that while the Persons Case was an important part of women’s history in Canada, many women continued to face discrimination regarding political participation in Canada, including Indigenous women, racialized women, and women with disabilities.</p>\n\n<p>“This year’s Persons Day theme – Because of You – honours feminist grassroots efforts and accomplishments that have helped advance gender equality in our country. As we fight the global COVID-19 pandemic, we thank the many women, in all their diversity, who have bravely served and continue to work on the frontlines of our communities across Canada. These women are essential workers in areas such as health care, education, food service, and caregiving, and many shoulder an even greater burden of unpaid care work at home.<a name=\"Para6265618\" id=\"Para6265618\"></a><a name=\"Para6265528\" id=\"Para6265528\"></a> We must also remember that women – in particular low-income women and women in vulnerable situations – have experienced the impacts of the pandemic at a higher rate. As we continue to safely restart our economy and build a fairer and more inclusive Canada, the government’s feminist, intersectional response to the pandemic and recovery will protect the social, economic, and political gains<a name=\"Para6265619\" id=\"Para6265619\"></a> women and their allies have fought hard to secure for decades.</p>\n\n<p>“This year’s theme also serves as a reminder that gender equality benefits everyone. As Canadians, we recognize our role in the global effort to ensure that all people, regardless of their gender, gender identity, or gender expression, can participate freely and fully in our society. That is why the Government of Canada continues to take a leadership role to promote human rights and advance gender equality to empower women and girls, both at home and abroad, thanks to our feminist foreign policy.</p>\n\n<p>“On Persons Day, we pay tribute to the many women who fought, and those who continue to fight, to make gender equality a reality in Canada. As we celebrate Women’s History Month, I invite Canadians to learn more about the countless activists who have helped Canada become a more equal, just, and inclusive democracy. It is up to all of us, no matter our gender identity or expression, to carry their legacy forward, achieve progress in advancing gender equality, and fight discrimination of every kind in Canada and around the world.\"</p></div>\n      "
}