{
  "path": "/en/news/statements/2022/01/22/statement-prime-minister-sixth-anniversary-shootings-la-loche",
  "pageTitle": "Statement by the Prime Minister on the sixth anniversary of the shootings in La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the sixth anniversary of the deadly shootings in La Loche, Saskatchewan:</p>\n\n<p>“Six years ago today, the community of La Loche, Saskatchewan, suffered an attack that killed four people and seriously injured seven others.</p>\n\n<p>“On this sombre anniversary, I join the people of Saskatchewan and all Canadians to remember and pay tribute to the innocent lives that were lost. We offer our deepest sympathies to the survivors as well as the victims’ families and friends who continue to endure the pain of loss and trauma caused by this attack.</p>\n\n<p>“As we reflect on this tragedy, we recognize that each life lost to gun violence is one too many. The safety and security of all Canadians is the government’s top priority, and we will continue to do everything we can to protect them and help create safer communities. We owe it to all the victims and survivors of gun violence in Canada and their families – from Saskatchewan to Quebec City, from Toronto to Nova Scotia.</p>\n\n<p>“In the spirit of supporting communities like La Loche, in 2020, the Government of Canada announced a <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">ban of more than 1,500 models of assault-style firearms and their variants</a><a id=\"_Hlt93337976\" name=\"_Hlt93337976\"></a><a id=\"_Hlt93337977\" name=\"_Hlt93337977\"></a>. In 2021, we announced an investment of almost $600&nbsp;million over three years for distinctions-based approaches to mental wellness for First Nations, Inuit, and the Métis Nation. This strategy will continue to increase access to and strengthen mental wellness in Indigenous communities – and across the country. It will enhance community-based supports, from training existing and new wellness workers, to creating additional community services. The government will continue to work in partnership with Indigenous, municipal, provincial, and territorial governments to ensure a better future for all Indigenous youth.</p>\n\n<p>“The Government of Canada is also committed to supporting the healing process of those affected by the La Loche tragedy, including by enhancing support for Indigenous-led, culturally relevant, and trauma-informed mental wellness services for Indigenous Peoples. Crisis intervention support and services are available for First Nations, Inuit, and Métis through the Hope for Wellness Helpline at 1‑855‑242‑3310 or online chat at <a href=\"https://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>. Confidential mental health support is also available 24 hours a day, and is free for all Canadians through the Wellness Together Canada portal at 1‑866‑585‑0445 or online at <a href=\"http://www.wellnesstogether.ca\">www.wellnesstogether.ca</a>. We will continue to invest in mental health services and supports that can make a real difference in the lives of Indigenous Peoples – and all Canadians.</p>\n\n<p>“On behalf of the Government of Canada, I encourage everyone to remember the victims and survivors of the tragedy in La Loche, whose lives forever changed on January 22, 2016. We are with you, and you have our unwavering support.”</p>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"77666a59-9463-4b27-b653-3198e31b3475\" href=\"/en/news/statements/2022/01/22/honi-nita-ediri-canada-keyaghe-kodhiri-nedhe-thitelase-tue-saskatchewan\">Statement in Denesuline</a></li>\n\t<li><a href=\"/en/news/statements/2022/01/22/weestamakaywin-ouschi-kischee-li-ministr-ishpee-sizyem-ashpin-ouschi\">Statement in Michif-Cree</a></li>\n\t<li><a href=\"/en/news/statements/2022/01/22/kihci-okimaw-o-wihtamakewin-nikotwasik-askiy-aspin-ohci-nipahtakewin\">Statement in Plains Cree</a></li>\n\t<li><a href=\"/en/news/statements/2022/01/22/gichi-ogimaa-odikidowin-nigodwaaso-biboon-e-izhisenig-gaa-gii\">Statement in Western Ojibway</a></li>\n</ul></div>\n      "
}