{
  "path": "/en/news/readouts/2019/12/10/prime-minister-justin-trudeau-and-special-representative-jim-carr-meet",
  "pageTitle": "Prime Minister Justin Trudeau and Special Representative Jim Carr meet with Alberta Premier Jason Kenney | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and the Prime Minister’s special representative for the Prairies, Jim Carr, met with Alberta Premier Jason Kenney to discuss common priorities. The Prime Minister reaffirmed his commitment to work collaboratively with Premier Kenney on behalf of the people of Alberta.</p>\n\n<p>The Prime Minister reiterated the Government of Canada’s determination to see the Trans Mountain Expansion (TMX) project completed, and highlighted to Premier Kenney that there are currently over 2,200 people working on its construction outside Edmonton and in Burnaby. The governments of Canada and Alberta share a determination to complete this critical project. The Prime Minister and Premier Kenney also discussed work underway by their governments to ensure Indigenous communities benefit from economic opportunities related to the development of natural resources and related infrastructure. They also spoke about the opportunity of liquefied natural gas exports to Canada’s economy.</p>\n\n<p>The Prime Minister and Premier Kenney talked about challenges in the oil and gas sector, and the importance of governments supporting workers in the province.&nbsp;</p>\n\n<p>The Prime Minister stressed the importance of taking real action to fight climate change, emphasizing that it is possible for the governments of Canada and Alberta to work together. He highlighted last week’s federal announcement that Alberta’s Technology Innovation and Emissions Reduction (TIER) regulations meet the Government of Canada’s stringency benchmark criteria for carbon pollution pricing systems, for 2020, for the emission sources they cover. The Prime Minister noted that there would be opportunities to work in partnership with Alberta on clean energy and innovation.&nbsp;</p>\n\n<p>The Prime Minister and Premier Kenney also discussed the Fiscal Stabilization Program. The Prime Minister noted that the upcoming meeting of finance ministers will be an opportunity for Alberta to provide its views on the future operation of the program.&nbsp;</p>\n\n<p>The Prime Minister and Premier Kenney discussed the federal impact assessment regime, and the Prime Minister invited Premier Kenney to provide suggestions for improvements on its implementation.&nbsp;They also expressed a desire to reach an equivalency agreement on methane regulations, which protect our environment and are effective in meaningful reductions of methane.</p>\n\n<p>In addition, the Prime Minister and Premier Kenney discussed the significant infrastructure investments that governments are making in Alberta through the Investing in Canada Plan, and reviewed a number of other issues of national importance, including removing barriers to internal trade and developing energy projects.</p>\n\n<p>They agreed to continue to collaborate on these important priorities, and look forward to the next First Ministers’ Meeting.</p></div>\n      "
}