{
  "path": "/en/news/news-releases/2020/01/17/governor-general-canada-travel-poland-75th-anniversary-liberation",
  "pageTitle": "Governor General of Canada to travel to Poland for the 75th anniversary of the liberation of Auschwitz-Birkenau | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Poland on January 27, 2020.</p>\n\n<p>This follows the Governor General’s visit to Jerusalem to attend the Fifth World Holocaust Forum, “Remembering the Holocaust: Fighting Antisemitism”. In Poland, she will take part in the commemoration of the 75th anniversary of the liberation of Auschwitz-Birkenau, which was the largest Nazi concentration and extermination camp. The Governor General will pay tribute to the more than 1.1 million people who lost their lives there, including approximately 1 million Jews.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Although 75 years have passed since the liberation of Auschwitz-Birkenau, our world is not immune to the scourge of antisemitism. Today, far too many Jewish communities still face unacceptable acts of antisemitism and discrimination. Through our words and actions we must always stand up to hatred and racism in every form. The Governor General’s visit will highlight Canada’s commitment to preserve the memories of the victims and survivors of the Holocaust, and repeat the vow, ‘Never Again’.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Governor General Julie Payette last visited Poland in August 2019.</li>\n\t<li>Members of Parliament, including the Chair of the Canada-Israel Interparliamentary Group, Michael Levitt, will travel with the Governor General as part of the Canadian delegation.</li>\n\t<li>More than 200 Auschwitz survivors, including several from Canada, are expected to attend the commemoration ceremonies.</li>\n\t<li>During the horrors of the Holocaust, over 6 million Jews, and millions of other victims, were murdered in one of history’s darkest chapters.&nbsp;</li>\n\t<li>Approximately 40,000 Holocaust survivors resettled across Canada after the Second World War.</li>\n\t<li>Canada and Poland are active members of the International Holocaust Remembrance Alliance, an intergovernmental organization dedicated to strengthening, advancing, and promoting Holocaust education, research, and remembrance.</li>\n\t<li>January 27 will also mark International Holocaust Remembrance Day, and the 20th anniversary of the Declaration of the Stockholm International Forum on the Holocaust.</li>\n\t<li>Canada and Poland have a close relationship, rooted in shared history and a vibrant community of more than a million Polish-Canadians.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/poland-pologne/bilateral_relations_bilaterales/canada-poland-pologne.aspx?lang=eng\">Canada – Poland Relations</a></li>\n\t<li><a href=\"http://auschwitz.org/en/home-page75/\">75th Anniversary of the Liberation of Auschwitz</a></li>\n\t<li><a href=\"https://www.holocaustremembrance.com/\">International Holocaust Remembrance Alliance</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}