{
  "path": "/en/news/news-releases/2018/04/26/canada-further-strengthens-trade-enforcement-protect-steel-and",
  "pageTitle": "Canada further strengthens trade enforcement to protect steel and aluminum workers and industries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced increased funding for the Canada&nbsp;Border Services Agency (CBSA) and Global Affairs Canada to further strengthen Canada’s trade enforcement.</p><p>This further bolsters Canada’s efforts to prevent transshipment and diversion of unfairly priced foreign steel and aluminum into the North American market. While Canada already has strong and effective enforcement, we are taking these additional steps to ensure our workers and industries are not harmed by unfair trade.</p><p>The new funding – more than $30 million over five years, starting immediately, and $6.8&nbsp;million per year after that – will mean more than 40 new officers to investigate trade-related complaints, including those related to steel and aluminum.</p><p>This will also enable the gathering of more accurate data on imports to help us better monitor trade trends and better protect our industries and workers against unfair trade.</p><p>In addition to the new funding, the Government of Canada is:</p><ul><li>Further aligning Canada’s marking regime with that of our closest trading partner, the United States. Regulatory changes – subject to a 15-day consultation period through the <i>Canada Gazette</i> – will expand the scope of steel and aluminum products that need to be marked with their country of origin.</li></ul><ul><li>Bringing into force the regulations announced by the Prime Minister on March 27, 2018. These include regulatory changes that allow the CBSA to identify and stop companies that try to avoid duties, and that give the CBSA greater flexibility to determine whether prices charged in the exporter’s domestic market are distorted. They also include measures to give unions standing to participate in trade remedy proceedings.</li></ul><p>The Government of Canada is also consulting regularly with provincial-territorial representatives, as well as industry and union stakeholders, through recently established trade monitoring committees on steel and aluminum to ensure imports do not hurt Canadian and North American jobs.</p><p>Canada will continue to monitor the trade situation closely, and will take additional steps as needed to support our industries.</p><h2>Quote</h2><blockquote><p>“Canadian workers and industries deserve a level playing field, and we will continue to protect them from unfair trade practices. Part of that includes making sure Canadian trade enforcement agencies have the resources they need to defend the competitiveness of our businesses and our important North American trading relationships. We will stand up for our workers and industries, and do what is needed to preserve the fair and open trading environment they depend on.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada’s trade remedy system helps preserve a fair and open trading environment for our producers. It protects Canadian businesses from the impacts of foreign goods that have benefited from unfair subsidies or that are being sold in Canada at artificially low prices.</li><li>There are currently 72 trade remedy measures in force on steel and aluminum imports, applied to 23 countries. Canada’s enforcement regime ensures that 100 per cent of steel shipments identified as potentially subject to trade remedy measures are verified by the CBSA in a timely and comprehensive manner.</li><li>In 2017, the Canadian steel industry employed more than 23,000&nbsp;Canadians and contributed $4.2&nbsp;billion to Canada’s gross domestic product (GDP). The Canadian aluminum industry employed 10,500&nbsp;workers while contributing $4.7&nbsp;billion to Canada’s GDP. These industries are vital suppliers to the Canadian manufacturing, energy, automotive, and construction industries.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/news/news-releases/2018/03/27/canada-acts-further-prevent-transshipment-and-diversion-steel-and\">Canada acts to further prevent transshipment and diversion of steel and aluminum to protect North American workers against unfair trade</a></li></ul></div>\n      "
}