{
  "path": "/en/news/statements/2017/03/08/statement-prime-minister-canada-international-womens-day",
  "pageTitle": "Statement by the Prime Minister of Canada on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the occasion of International Women’s Day:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we join people all over the globe to celebrate the remarkable achievements that women have made everywhere, and reaffirm our commitment to gender equality worldwide.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, Canada’s theme for&nbsp;<a href=\"http://www.swc-cfc.gc.ca/commemoration/iwd-jif/index-en.html\">International Women’s Day</a>&nbsp;is #EqualityMatters, which reminds us that society is better – more prosperous, peaceful, secure, and cohesive – when women’s rights are respected, when women are valued and empowered, and when they lead the way in our communities.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“While we have taken significant steps toward gender equality, we know that much more work needs to be done.&nbsp;</span><span lang=\"EN-US\" xml:lang=\"EN-US\">Women around the world continue to receive lower pay and fewer promotions. They are denied legal control over their bodies and reproductive health. They face much higher rates of harassment and verbal, physical, and sexual abuse.</span><span lang=\"EN-US\" xml:lang=\"EN-US\">&nbsp;In impoverished communities, women are the least likely to have access to healthcare, the last ones to eat, and the most vulnerable to the hardships brought on by disease.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“That is why we will continue to place gender equality and rights, and the empowerment of women and girls, at the heart of our international development work. These efforts received a considerable boost this morning with the announcement that&nbsp;<a href=\"https://www.canada.ca/en/global-affairs/news/2017/03/canada_announcessupportforsexualandreproductivehealthandrights.html\">Canada will provide $650 million in funding</a>&nbsp;to address gaps in sexual and reproductive health and rights in the world’s poorest and most vulnerable communities.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, I remind Canadians that we all have a role to play in the fight for gender equality, and that we all benefit from a more gender equal world. Women and men, girls and boys, we must all step up and speak out, because half of the population cannot solve a problem that affects us all.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, Sophie and I encourage all Canadians to join us in celebrating International Women’s Day, as we renew our commitment to a more positive, just, and equal world.”</span></p></div>\n      "
}