{
  "path": "/en/news/news-releases/2022/10/07/canada-implement-new-measures-against-iranian-regime",
  "pageTitle": "Canada to implement new measures against the Iranian regime | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada stands with the brave women, students, and the people of Iran who are peacefully protesting the tragic killing of Mahsa Amini at the hands of the Iranian regime’s so-called ‘morality police.’ The Iranian regime’s brutal repression of these protests – killing, beating, and arresting protesters – is once again demonstrating its blatant disregard for human rights and human life. We are listening to and joining our voices with those who are demanding better.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canada will take significant, further action against the Iranian regime. We intend to:</p>\n\n<ul>\n\t<li>List the Iranian regime, including the Islamic Revolutionary Guard Corps (IRGC) and its top leaders – more than 10,000 officers and senior members – as inadmissible to Canada for their engagement in terrorism and systemic and gross human rights violations, by pursuing a designation under the <em>Immigration and Refugee Protection Act. </em>This will deny them access to Canadian territory.</li>\n\t<li>Significantly expand sanctions against those responsible for the Iranian regime’s egregious human rights abuses by building on our existing sanctions, including those announced this week, to implement the most robust and comprehensive set of sanctions in the world against the IRGC. We will also introduce a new tailored regulation to ensure no sanctioned individual connected to the IRGC can enter Canada, pending the passage of Bill S-8.</li>\n\t<li>Invest $76 million to strengthen Canada’s capacity to implement sanctions and ensure we can move more quickly to freeze and seize sanctioned individuals’ assets, including through a dedicated bureau at Global Affairs Canada and additional support to the RCMP to investigate and identify assets and gather evidence. This builds on new authorities introduced in Budget 2022.</li>\n\t<li>Pursue all the tools at our disposal, including the <em>Justice for Victims of Corrupt Foreign Officials Act</em> (Sergei Magnitsky Law), which enables restrictive financial and property measures for foreign nationals responsible for gross violations of human rights.</li>\n</ul>\n\n<p>Taken together, this new suite of measures will help hold the Iranian regime to account for its egregious actions. These new measures build on our previous actions, which were already some of the strongest in the world against the Iranian regime, including designating the state of Iran as a state supporter of terrorism. Earlier this week, Canada also announced additional sanctions against senior Iranian officials and prominent entities that directly implement repressive measures, violate human rights, and spread the Iranian regime’s propaganda. These sanctions effectively froze any assets these individuals may hold in Canada. We will continue to use every tool at our disposal to implement the most robust sanctions against the Iranian regime in the world.</p>\n\n<p>Canada will continue to work with our international partners to ensure the Iranian regime is held accountable for its heinous conduct, including for the downing of Ukraine International Airlines Flight 752, which killed 138 people en route to Canada, including 55 Canadians and 30 permanent residents.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The Iranian regime continues to demonstrate its blatant disregard for human rights and human life. Canada unequivocally stands in solidarity with people marching in the streets of Iran, and the streets of cities around the world, in the name of freedom and justice. To the strong, resilient, and proud Iranian Canadian community: We hear your voices, we hear your calls for action. That is why today, we’re using the most powerful tools we have to crack down on this brutal regime and the individuals responsible for its heinous behaviour. Our government will continue to use every single tool at our disposal, including the Magnitsky sanctions.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The IRGC leadership are terrorists. The IRGC is a terrorist organization. Today, Canada is formally recognizing that – and acting accordingly. The actions we are taking today to hold senior members of the IRGC to account will ensure that Canada will never be a haven for its money, for its leaders, or for their henchmen. Canada is proud to stand with the brave people of Iran.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>These new measures, combined with previous actions against the Iranian regime, are in line with our allies who are strongest on Iran, like the United States.</li>\n\t<li>Mahsa Amini, a 22-year-old Kurdish-Iranian woman, died last month while in custody of Iran’s so-called ‘morality police.’ Ms. Amini’s death was a direct result of the systemic harassment and repression that women face in Iran.</li>\n\t<li>Nine other regimes have previously been designated inadmissible to Canada under the <em>Immigration and Refugee Protection Act</em>,<em> </em>paragraph 35(1)(b) for terrorism, systemic or gross human rights violations, genocide, war crimes or crimes against humanity. Iran could be the first regime to be designated since 2003. The designation of a regime is a permanent decision.</li>\n\t<li>On October 3, 2022, Canada imposed new sanctions on Iran under the <em>Special Economic Measures Act</em>, in response to gross human rights violations that have been committed in Iran, including its systematic persecution of women and in particular, the egregious actions committed by Iran’s so-called ‘morality police’ and its leadership.</li>\n\t<li>In 2017, Canada expanded the scope of the <em>Special Economic Measures Act</em> to allow the government to impose sanctions in response to gross and systemic human rights violations.</li>\n\t<li>On October 4, 2022, Canada marked the 1,000th day since Iran’s egregious downing of Ukraine International Airlines Flight 752, killing 176 innocent people on board – including 55 Canadians, 30 permanent residents, and a total of 138 people en route to Canada. Canada is working with our international partners to hold Iran accountable in accordance with international law.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/10/04/statement-prime-minister-1000th-day-egregious-downing-flight-ps752\">Statement by the Prime Minister on the 1,000th day since the egregious downing of Flight PS752</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-imposes-sanctions-on-iran-for-systematic-human-rights-violations.html\">Canada imposes sanctions on Iran for systematic human rights violations</a></li>\n</ul></div>\n      "
}