{
  "path": "/en/news/statements/2021/04/09/statement-prime-minister-canada-passing-duke-edinburgh",
  "pageTitle": "Statement by the Prime Minister of Canada on the passing of The Duke of Edinburgh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the passing of His Royal Highness The Duke of Edinburgh:</p>\n\n<p>“It was with deep sadness that I learned of the passing of The Duke of Edinburgh.</p>\n\n<p>“A man of great service to others – first as a decorated naval officer and later as a dedicated leader in the areas of community engagement and philanthropy – the Duke always sought out the best in people and challenged them to strive for greater heights.</p>\n\n<p>“Prince Philip maintained a special relationship with the Canadian Armed Forces and over the years became Colonel‑in‑Chief of six Canadian units. In 2011, he was named honorary general of the Canadian Army and the Royal Canadian Air Force, as well as honorary admiral of the Royal Canadian Navy.</p>\n\n<p>“The global program that bears his title – the Duke of Edinburgh’s Award – has helped empower millions of young people from all backgrounds to realize their greatest potential, and is but one example of his contributions to the social fabric of this country and the world. He was also the patron of more than forty organizations in Canada, including the Canadian Aeronautics and Space Institute and the Outward Bound Trust. During his last visit to Canada in April 2013, the Duke was named the first-ever Extraordinary Companion of the Order of Canada by the Governor General of Canada.</p>\n\n<p>“Prince Philip was a man of great purpose and conviction, who was motivated by a sense of duty to others. He will be fondly remembered as a constant in the life of our Queen – a lifelong companion who was always at her side offering unfailing support as she carried out her duties.</p>\n\n<p>“A family has lost a beloved husband, father, grandfather, and great grandfather. The&nbsp;thoughts of Canadians are with Queen Elizabeth II and the members of the Royal Family as they mourn such a significant loss.”</p></div>\n      "
}