{
  "path": "/en/news/news-releases/2019/11/22/governor-general-canada-visit-italy-75th-anniversary-italian-campaign",
  "pageTitle": "Governor General of Canada to visit Italy for the 75th anniversary of the Italian Campaign | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General and Commander-in-Chief of Canada, will travel to Italy, from November 29 to December 4, 2019.</p>\n\n<p>The Governor General will meet with the President of Italy, His Excellency Sergio Mattarella, to discuss shared priorities between Canada and Italy, as well as opportunities to strengthen the close ties between our two countries.</p>\n\n<p>During the visit, the Governor General will participate in commemorative events hosted by the Government of Canada to mark the 75th anniversary of the Italian Campaign in Pontecorvo and Ortona. She will also attend a ceremony in Ravenna to pay tribute to the bravery of those who served our country overseas during the Second World War.</p>\n\n<p>The Governor General will visit the Cassino War Cemetery, the Moro River Canadian War Cemetery, the Ravenna War Cemetery, and the Villanova Canadian War Cemetery to honour fallen service members whose courage and sacrifice will never be forgotten.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Italian Campaign was a key military effort for Allied forces during the Second World War. From Pachino to the Po, Canadians overcame unforgiving weather, tough terrain, and fierce opposition as they drove back enemy forces. This visit will be an opportunity for the Governor General to further strengthen Canada’s close relationship with Italy, and to honour the brave Canadians who fought and died helping to liberate the country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Italian Campaign began on the island of Sicily in&nbsp;July&nbsp;1943, and moved north up the Italian mainland through to the end of the war in&nbsp;Europe in&nbsp;May&nbsp;1945.</li>\n\t<li>More than 93,000 Canadians served with the Allied forces in the Italian Campaign. As they fought in Sicily and on the Italian mainland, nearly 6,000 Canadians lost their lives.</li>\n\t<li>Canadians played a pivotal role in helping the Allies to victory in places like Sicily, Ortona, the Liri Valley, and Rimini.</li>\n\t<li>Those who fought in Italy were among the more than one million Canadians who served in uniform during the Second World War.</li>\n\t<li>Today, Canada and Italy enjoy strong and historic people-to-people ties, including through Canada’s large and dynamic Italian-Canadian community.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/events/italian-campaign-75th-anniversary\">The 75th anniversary of the Italian Campaign</a></li>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance\">Veterans Affairs Canada: Remembrance</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Italy Relations</a></li>\n</ul></div>\n      "
}