{
  "path": "/en/news/statements/2017/11/01/statement-prime-minister-meeting-modern-treaty-and-self-governing-first",
  "pageTitle": "Statement by the Prime Minister on meeting with Modern Treaty and Self-Governing First Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement after meeting with Modern Treaty and Self-Governing First Nations:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, I had the honour of meeting with the Modern Treaty and Self-Governing First Nations to celebrate and reinforce our unique and enduring relationship.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“We know that our national journey to reconciliation requires systemic changes that recognize the right to advance self-determination and self-government. Modern treaties and self-government agreements are examples of reconciliation in action. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we talked about the strides taken toward self-determination, and our shared desire to ensure Indigenous governments continue to thrive for the benefit of Indigenous communities and all Canadians. We know that we need to speak openly and honestly about our common goals so we can find solutions that respond to the specific needs and circumstances of different peoples and different communities.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“I was inspired to hear from Indigenous governments taking concrete steps to manage their lands and resources, and to promote the social and economic health and sustainability of their communities. This work greatly benefits their communities and the country as a whole.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, I thank the Modern Treaty and Self-Government partners for meeting today under the shared desire to build a better future for our children and grandchildren. Working together, we will continue to forge a new government-to-government relationship built on recognition of rights, respect, collaboration, and partnership.”</span></p></div>\n      "
}