{
  "path": "/en/news/statements/2016/11/20/statement-prime-minister-canada-national-child-day",
  "pageTitle": "Statement by the Prime Minister of Canada on National Child Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark National Child Day:</p>\n<p>“Every day, I am energized by the potential of Canada’s young people. I am equally concerned by the challenges they face, and deeply aware that the decisions we make today will shape the world they will one day inherit.</p>\n<p>“That is why, on National Child Day, I encourage all Canadians to celebrate our children and youth, and to reflect on the obligation that we have to our children and grandchildren.</p>\n<p>“Each child deserves to be raised in an environment that is free of violence, discrimination, and exploitation; to grow up with proper nutrition, health care, and a good education; and to have a voice in matters that affect them, and a real, fair chance to succeed.</p>\n<p>“The Government of Canada remains committed to programs that help every child get the best possible start in life and reach their full potential. Here, at home, we are giving Canadian families more money to help with the high cost of raising their kids through the new Canada Child Benefit, which stands to lift about 300,000 children out of poverty. We are also working with our international partners to create environments where all children are treated with dignity and respect, and given all the opportunities they need to succeed.</p>\n<p>‘While the world has made significant progress in advancing children’s rights since the introduction of the <em>UN Convention on the Rights of the Child</em>, there is still a lot of work to do. Millions of children and young people continue to be denied basic human rights – including education, primary health care, and personal security. Many more are forced into early marriages, recruited as child soldiers, or become victims of child labour.</p>\n<p>“On this day, Sophie and I invite all Canadians to join us in celebrating National Child Day by speaking to children of all ages about their rights. We also urge you to visit the <a href=\"http://www.phac-aspc.gc.ca/ncd-jne/\">National Child Day website</a> for activities and events in your communities marking this special day.</p>\n<p>“Canada’s future is only as strong and boundless as the dreams and aspirations of our children and youth. We must support them in everything they do and want to be.”</p></div>\n      "
}