{
  "path": "/en/news/news-releases/2022/08/19/supporting-local-economy-iles-de-la-madeleine-investing-critical",
  "pageTitle": "Supporting the local economy in the Îles-de-la-Madeleine by investing in critical infrastructure | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Îles-de-la-Madeleine are an iconic region of great importance for all Canadians – from providing seafood to tourism opportunities. By investing in critical infrastructure in the region, we are creating good jobs and supporting the local economy for generations to come.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a new investment of almost $40&nbsp;million over four years, starting in 2022-23, to rebuild the fishers’ wharf at the Port of Cap-aux-Meules, an important gateway for transportation, fishing, and tourism in the Îles-de-la-Madeleine, Quebec.</p>\n\n<p>With this new funding, the fishers’ wharf will be demolished and reconstructed to ensure it can continue to serve the local fishery, which provides good jobs to over 1,300 people – about 10 per cent of the region’s population. Construction could begin as early as 2024.</p>\n\n<p>The Government of Canada is supporting rural and remote communities throughout the country and addressing their unique realities and challenges. As we build a better future for everyone, we will continue to be there for people living in rural and remote communities so they can have equal access to economic growth, good jobs, and new opportunities.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When our remote communities are stronger, our country is stronger. The Port of Cap-aux-Meules is critical to the Madelinots, their well-being, and the local economy. The funding we are announcing today will create good jobs and economic opportunities for years to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“With this long-awaited announcement for the community of the Îles-de-la-Madeleine, our government is demonstrating its commitment to the viability of the fishers’ wharf at the Port of Cap-aux-Meules, while ensuring the safety of wharf users and allowing long-term operations to be maintained.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are here today to welcome great news that will benefit all the Madelinots. The wharf at the Port of Cap-aux-Meules is truly the beating heart of the Islands. It is the main connection between the Islands and the mainland, and it is the key driver of the local economy, for tourism and seafood industries alike. Our government is committed to listening to Canadians, and today is another example of this at work. We know that rural and remote communities all have the ability to thrive when we give them the tools they need.”</p>\n\n<footer class=\"default\">The Hon. Diane Lebouthillier, Minister of National Revenue</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Port of Cap-aux-Meules is the main gateway for passengers and cargo to and from the Îles-de-la-Madeleine.</li>\n\t<li>The fishers’ wharf at the Port of Cap-aux-Meules was built some 50&nbsp;years ago and is reaching the end of its operational life cycle. The last detailed inspection of the wharf confirmed a significant deterioration of its concrete structure in certain areas, reducing the capacity of the wharf to support heavy loads. Transport Canada immediately implemented restrictions to ensure the safety of users and installed a temporary wharf in 2022 to provide for the missing mooring posts.</li>\n\t<li>In advance of today’s announcement, the government conducted consultations with wharf users and a study to determine what repairs were required to allow the wharf to continue to serve the local community.</li>\n\t<li>The Government of Canada conducts regular maintenance and annual inspections to ensure the safety of its facilities and of activities taking place on those sites.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/14/strengthening-transportation-infrastructure-safety-and-well-being\">Strengthening transportation infrastructure for the safety and well-being of the Îles-de-la-Madeleine community</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/03/transport-canada-ensures-peoples-safety-and-the-continuity-of-activities-at-the-fishers-wharf-at-cap-aux-meules.html\">Transport Canada ensures peoples’ safety and the continuity of activities at the fishers’ wharf at Cap-aux-Meules</a></li>\n</ul></div>\n      "
}