{
  "path": "/en/news/statements/2021/09/30/statement-prime-minister-national-day-truth-and-reconciliation",
  "pageTitle": "Statement by the Prime Minister on the National Day for Truth and Reconciliation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day for Truth and Reconciliation:</p>\n\n<p>“Today, I invite everyone across the country to recognize and observe the first <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">National Day for Truth and Reconciliation</a>. It is a day to reflect on the painful and lasting impacts of residential schools in Canada, and to honour survivors, their families, and their communities. It is also a day to remember the many children who never returned home, and an opportunity for us all to learn more, and to affirm the need for reconciliation and commit ourselves to the work ahead.</p>\n\n<p>“The National Day for Truth and Reconciliation recognizes that at least 150,000 Indigenous children from across the country were forcibly separated from their families and their communities. Children were brought to residential schools where too many experienced abuse and were removed from their cultures, languages, and traditions. This federal day builds on the momentum of Orange Shirt Day, which was inspired by the story of Phyllis Webstad and chosen by Indigenous peoples to remember the legacy of residential schools and promote the path of reconciliation. The National Day for Truth and Reconciliation was established through legislation passed earlier this spring, and is a direct response to the Truth and Reconciliation Commission’s Call to Action number 80. As part of commemorations for this historic day, I was honoured to participate in a sunset ceremony to commemorate survivors and those who never returned to their families and communities, as the Peace Tower and other buildings near Parliament Hill were illuminated in orange, and a newly commissioned Survivors’ Flag from the National Centre for Truth and Reconciliation was raised.</p>\n\n<p>“This year, the tragic locating of unmarked graves at former residential school sites across the country has reminded us of not only the impacts of colonialism and the harsh realities of our collective past, but also the work that is paramount to advancing reconciliation in Canada. Today, we also recognize the harms, injustices, and intergenerational trauma that Indigenous peoples have faced – and continue to face – because of the residential school system, systemic racism, and the discrimination that persists in our society. We must all learn about the history and legacy of residential schools. It’s only by facing these hard truths, and righting these wrongs, that we can move forward together toward a more positive, fair, and better future.</p>\n\n<p>“Since 2015, the Government of Canada has been working in partnership with Indigenous peoples to close the gaps that still exist for far too many – and together we’ve made real progress. Over 80 per cent of the Truth and Reconciliation Commission’s Calls to Action that fall under the sole or shared responsibility of the federal government are completed or well underway. We’ve ended 117 long-term drinking water advisories, with a concrete plan to end all of them in the near future. We’ve passed the <em>United Nations Declaration on the Rights of Indigenous Peoples Act</em>, protected Indigenous languages, and invested in education so thousands of Indigenous children are in new or better schools. We have also taken steps together to address the important issues identified in the National Inquiry into Missing and Murdered Indigenous Women and Girls’ Final Report and Calls for Justice, and we have co-developed Indigenous child and family services legislation to ensure that Indigenous children remain with their family and community. And we will continue to invest directly in Indigenous communities, as outlined in Budget 2021, to build a better future for everyone.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to take this opportunity to learn more about the history of residential schools in Canada, listen to the stories of survivors and their families, and reflect on how each of us can play a part in the journey of reconciliation. I also encourage everyone to wear an orange shirt today to help spread awareness, because every child matters.”</p>\n\n<p>Also available in the following languages:</p>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2021/09/30/uqausiksaq-kanatamu-angajuqkaaqmut-uvani-suliniqmut-amma\">Inuktitut</a></li>\n\t<li><a href=\"/en/news/statements/2021/09/30/gaa-ikidod-ogimaa-iwe-e-izhi-giizhigak-ji-mikwenjigaadeg-debwewin-gaye\">Ojibway (Western)</a></li>\n\t<li><a href=\"/en/news/statements/2021/09/30/kihci-okimaw-o-wihtamakewin-ohci-tapwewin-mina-wahkowicihiwewin-kisikaw\">Plains Cree</a></li>\n</ul></div>\n      "
}