{
  "path": "/en/news/itineraries/2023/04/24/prime-ministers-itinerary-tuesday-april-25-2023",
  "pageTitle": "Prime Minister’s itinerary for Tuesday, April 25, 2023 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>National Capital Region, Canada</h2>\n\n<p><strong>10:00&nbsp;a.m.&nbsp;</strong>The Prime Minister will chair the Cabinet meeting.</p>\n\n<p><strong>2:00&nbsp;p.m.&nbsp;</strong>The Prime Minister will attend Question Period.</p>\n\n<p><strong>4:15&nbsp;p.m.&nbsp;</strong>The Prime Minister will meet with the Members of the Artemis&nbsp;II Crew: Commander, Reid Wiseman, Pilot, Victor Glover, Mission Specialist, Christina Hammock Koch, and Mission Specialist, Jeremy Hansen.</p>\n\n<p class=\"Indent2\"><em>Closed to media</em></p>\n\n<p><strong>4:35&nbsp;p.m.&nbsp;</strong>The Prime Minister and the Members of the Artemis&nbsp;II Crew will meet with industry experts and youth participants who will showcase their projects with respect to space exploration. He will be joined by the Minister of Innovation, Science and Industry, François-Philippe Champagne.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Pooled coverage</li>\n</ul><p><strong>5:15&nbsp;p.m.&nbsp;</strong>The Prime Minister will participate in an industry panel discussion with the Members of the Artemis&nbsp;II Crew, moderated by the President of the Canadian Space Agency, Lisa Campbell and the NASA Administrator, Senator Bill Nelson. He will be joined by the Minister of Innovation, Science and Industry, François-Philippe Champagne.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\"><li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 4:30&nbsp;p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul><p><strong>6:15&nbsp;p.m.&nbsp;</strong>The Prime Minister will attend the Space Canada and Aerospace Industries Association of Canada (AIAC) reception. He will be joined by the Minister of Innovation, Science and Industry, François-Philippe Champagne.</p>\n\n<p class=\"Indent2\"><em>Closed to media</em></p>\n\n<p>The Prime Minister will speak with the African Union Commission Chairperson, H.E. Moussa Faki Mahamat.</p></div>\n      "
}