{
  "path": "/en/news/news-releases/2017/09/19/ukrainian-president-petro-poroshenko-visit-canada",
  "pageTitle": "Ukrainian President Petro Poroshenko to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today announced that the President of Ukraine, Petro Poroshenko, will come to Canada for a working visit on September 22 and 23, 2017. The two leaders will meet on September 22, 2017, in Toronto on the margins of the Invictus Games.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">During their meeting, Prime Minister Trudeau and President Poroshenko will discuss how to strengthen the already robust security and people-to-people connections between Canada and Ukraine. Prime Minister Trudeau will also reiterate Canada’s ongoing </span><span lang=\"EN\" xml:lang=\"EN\">support for the people of Ukraine, its sovereignty and territorial integrity, and its reform efforts.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">Our two countries have a long history of friendship, common values, and shared ambitions for the future of our people. Canada is committed to the continued deepening of our relations with Ukraine, including through the opportunities created by the Canada-Ukraine Free Trade Agreement.</span></p><h2><span lang=\"EN-US\" xml:lang=\"EN-US\">Quote</span></h2><blockquote><p>“Canada and Ukraine enjoy a historic friendship forged through generations of shared values and strong relations. Canada will continue to work closely with Ukraine to bring greater security, prosperity, and economic independence to the Ukrainian people.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><span lang=\"EN-US\" xml:lang=\"EN-US\">Quick Facts</span></h2><ul><li>Prime Minister Trudeau last met with President Poroshenko in Kyiv, Ukraine, in July 2016.</li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">Since 2015, the Canadian Armed Forces have trained more than 4,800 members of the Ukrainian armed forces as part of Operation UNIFIER, Canada’s military training mission in Ukraine</span>.</li><li>The coming into force of the Canada-Ukraine Free Trade Agreement on August 1, 2017, represents a notable milestone in the countries’ bilateral relationship, and will generate commercial benefits for Canadian and Ukrainian businesses alike.</li><li>Canada-Ukraine bilateral merchandise trade increased 14 per cent in 2015 and 34 per cent in 2016. In that same year, Canada’s merchandise exports to Ukraine totalled $265.2 million and merchandise imports totalled $107.4 million.</li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">Canada and Ukraine have enjoyed close bilateral relations since Canada became the first Western nation to recognize Ukraine’s independence on December 2, 1991.&nbsp; </span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">Canada and Ukraine’s people-to-people ties are strengthened by the almost 1.3&nbsp;million-strong Ukrainian-Canadian community. &nbsp;</span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">Since January 2014, Canada has committed more than $700 million in multi-faceted support to Ukraine, encompassing a broad range of financial, development, stabilization and security, non-lethal military and humanitarian assistance. </span></li></ul><h2><span lang=\"EN-US\" xml:lang=\"EN-US\">Associated Link</span></h2><ul><li><a href=\"http://www.canadainternational.gc.ca/ukraine/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Ukraine Relations</a></li></ul></div>\n      "
}