{
  "path": "/en/news/news-releases/2019/07/23/prime-minister-announces-appointment-senator",
  "pageTitle": "Prime Minister announces the appointment of a Senator | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed Tony Loffreda as an independent Senator to fill a vacancy in Quebec.</p>\n\n<p>Mr. Loffreda is a certified public accountant with 35 years of experience in the Canadian financial industry. Hailing from the Ahuntsic neighbourhood in Montréal, Quebec, Mr. Loffreda is an active member of his community. He has chaired fundraising activities across the province and has received numerous awards and distinctions for his exceptional contributions to Quebec and Canada.</p>\n\n<p>Mr. Loffreda was recommended by the Independent Advisory Board for Senate Appointments and chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.<strong>&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am happy to welcome Tony Loffreda as Parliament’s newest independent Senator. His dedicated service to his community and province, along with his extensive experience on various boards and committees, makes him a great choice to represent the people of Quebec. I look forward to working with him, and I have no doubt that he will serve all Canadians well.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Senate now has a full complement of 105 Senators.</li>\n\t<li>There have been 50 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li>\n\t<li>Since 2016, the selection process for Senators has been opened to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides the Prime Minister with recommendations.</li>\n\t<li>The Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General and summoned to the Senate, new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/07/23/tony-loffreda\">Tony Loffreda</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n</ul></div>\n      "
}