{
  "path": "/en/news/statements/2022/01/22/honi-nita-ediri-canada-keyaghe-kodhiri-nedhe-thitelase-tue-saskatchewan",
  "pageTitle": "Honi Nı̨t’ą́ ëdırı Canada k’ëyaghë Kodhırı Nëdhë Thı̨telasë Tuë, Saskatchewan ëłk’ëtaghë nënë hodhırı tëłk’ıdhıɁa t’anodhırnısı | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada këyaghë Kodhırı Nëdhë, Justın Trudeau, duhų dzınë k’ë ëdırı honı nı̨́Ɂąsę̈ ëłk’ëtaghë nënë hodhırı dënë bëtałk’ëdhı Thı̨telasë Tuë, Saskatchewan k’ëyaghë:</p>\n\n<p>“Duhų dzınë k’ë ëłk’ëtaghë nënë hodhırı, hayorı̨la Thı̨telasë Tuë, Saskatchewan k’ëyaghë, dı̨ghı̨ dënë łąldé tëłk’ıdhıɁa, łasdı̨ dënë tth’ı hëtıë ëya hadája delk’ëdhıɁa.</p>\n\n<p>“Ëdırı ëłtth’ılë hanodhırnısı bënonıë dzınë k’ë, Saskatchewan chú Canada hots’ı̨ dënë tarëlyų ëła t’ahı dënë besdołı̨nısı bëdanelnı ha bëba nųt’asę̈. Hëtıë nuhëdzıëɁa t’ahı hadaghınası ëyı chú ı̨łah dënë t’anodhırá bët’a horënası, t’ahı bëts’enıë dalı̨ ëłu bëba honëlyę̈lësı dënë tëłk’ıdhıɁa bësdołı̨ ëdırı ëłtth’ılë hanodhırá bëba yatı nëzu nıt’ąsę̈.</p>\n\n<p>“Ëdırı ëłtth’ıłë hanodhıra bëdanelnı, k’ëdorılyą dënë tëłkıdhıɁa bësdołı ı̨łaghë duazë łąsë tëłk’ıdhıɁá. Canada K’ëyaghë hots’ı̨ k’odhır nëdhë bëba hëtıë la nëcha dënë ëya hanech’a boghëdıdałı̨, ëłu yëgha hok’ënadé ha ëya chú dënë hoghëdı bası, ëyı hëł hayorı̨la nats’ëdeı́ ëya ts’ëné hëdı̨ nats’ëdé ha. Nuhnı̨́ nuhëts’ën nǫrëltth’ı t’ahı bëba horënası ëyı chú hadaghınası tëłk’ıdhıɁa ëją Canada k’ëyaghë, ı̨łah dënë tth’ı bëba – Saskatchewan hots’ı̨ Quebec Hayorı̨la Nëdhë hots’ën, Toronto hots’ı̨ Nova Scotıa hots’ën.</p>\n\n<p>“NuhëdąyınëɁa hayorı̨la Thı̨telasë Tuë k’ësı, Nonë́na Lamıl nonë́na nënë k’ë Kodhır Nëdhë Canada k’ëyaghë hots’ı̨ honı nıɁą́ <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">ëłk’ënı naltł’aɁa ëtëłk’ıdhı ı̨łaghë lamıl sǫlónëna bëhchënë tëłk’ıdhı bët’orëɁa hoɁę̈lë ëyı chú nahıë ëyı tëłk’ıdhı ląt’ı̨ tth’ı bëdı̨ hoɁą́</a><a id=\"_Hlt93337976\" name=\"_Hlt93337976\"></a><a id=\"_Hlt93337977\" name=\"_Hlt93337977\"></a>. Nonë́na Lamıl nonë́na ts’ën ı̨łaghë nënë k’ë, yatı nıt’ą tsąba $Ëłk’ëtaghë bëhchënë mıllıon taghë nënë k’ëyaghë bët’orëɁa há, t’ahı bënı bası hëtıë ghëna ha ëdırı T’ahı tthë Nıh K’ë nadenısı, Hëtena dalı̨, ëyı chú Tanısë Ts’ën Bëyası Dënë bëba. Ëdırı ërıhtł’ıs dëtł’ıs nısı bëgharı bënı bası hëtıë ghëna natsır halye ha Dënë Dedlınë Ją́ Nıh K’ë Nade hayorı̨la hots’ı̨ – tąbąı tu cho hots’ı̨, nask’ëdhı tu cho hots’ën ëja’ nıh nëdhë k’ë. Hayorı̨la – bası hëtıë bët’orëɁa ha nëzu halye, dënë hadonëltën t’ahı atth’ë hots’ı̨ nadenıs ëyı hëł dënë hëtıë ts’ëna bası k’anı ëghëłana yonıłthırsı, hayorı̨la ëłu hoɁąsı hayorı̨la bëts’ëdı nųt’a bası. K’odhır Nëdhı ëłu ëła Dënë Dedlınë Ją Nıh K’ë Nade, hayorı̨la hasë, honë́na provincial, chú taghë yathë nënë k’odhırı dënë hëł ëghëdalana hanëdhe Dënë Dedlınë Ją Nıh K’ë Nade dënë godhë bëba ëłtth’ı bası daghëna há.</p>\n\n<p>“Kodhır Nëdhë Canada k’ëyaghë hots’ı̨ dënë ts’ëdanı naghëda há t’ahı Thı̨telasë Tuë ëłtth’ılë hanodhırnıs bası, ëdırı hoɁąsı dënë ts’ëdı dalı̨ Dënë Dedlınë Ją Nıh K’ë Nade – bëgharı, dënë ch’anıë hëł, ëyı chú bët’a ëyası-bëgha k’oją hëtıë naghëda bënı bası dënë ts’ëdı Dënë Dedlınë Ją Nıh K’ë Nade bëba. Hëtıë ëya ch’ëne ch’a ëts’ëdı chú ëyı bası dënë ëghëdalana hųlı̨ T’ahı tthë Nıh K’ë nadenısı, Hëtena dalı̨, ëyı chú Tanısë Ts’ën Bëyası Dënë bëba Nats’eda honı̨dhën bası Ëts’ëdı ëdırı 1‑855‑242‑3310 bëts’ën yaghułtı ëyı hılë de tsątsanë bënı hųlı̨ k’ë ëją <a href=\"https://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>. Nëdzı k’oję̈leɁa dënë bënı hëtıë ts’ëna ëts’ëdı hųlı̨ nonë́na ts’ën dı̨ghı̨ sa ërıhtł’ıs dzınë dǫnëlt’ú, naghënı hılëɁa Canada hots’ı tarëlyų bëba Hëtıë Ts’ëna Ëła Canada nųt’ąhı ëją 1‑866‑585‑0445 bëts’ën yaghułtı ëyı hılë de tsątsanë bënı hųlı̨ k’ë ëją <a href=\"http://www.wellnesstogether.ca\">www.wellnesstogether.ca</a> tth’ı nëba hoɁą. Ëłu bëgha ëghëdaleda há hëtıë dënë bënı hëtıë ts’ëna ha, ëts’ëdı hëł Dënë Dedlınë Ją Nıh K’ë Nade Dënë ëładunë ts’ënaghı bası – Canadıans tth’ı bëba.</p>\n\n<p>“Kodhır Nëdhë Canada k’ëyaghë hots’ı̨ bëda gharı bëba, tarëlyų dënë borëske dënë hadaghına ëyı chú dënë bët’a honëlyę̈lësı ëłtth’ılë hanodhır bëɁa Thı̨telasë Tuë nıh k’ë, t’ahı daghëna ëładunë hajası Ëłëts’ëlts’ų Dzınë Zaghë, nonë́na ts’ën naké, Nonë́na Lamıl ëłk’ëtaghë ch’adhël dzınë k’ë t’anodhır bëdanelnı há. Nëhëł nedesę̈, ëyı chú hëtıë bënëdhë natsır hulta nëts’ëdedı.”</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"bb8b2655-90a7-4955-b781-ad4667676918\" href=\"/en/news/statements/2022/01/22/statement-prime-minister-sixth-anniversary-shootings-la-loche\">Statement by the Prime Minister on the sixth anniversary of the shootings in La Loche, Saskatchewan</a></li>\n</ul></div>\n      "
}