{
  "path": "/en/news/news-releases/2017/04/27/prime-minister-announces-ministerial-working-group-address-phoenix",
  "pageTitle": "Prime Minister announces ministerial working group to address Phoenix pay issues | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Each and every day, public servants work hard to strengthen the middle class and improve the lives of Canadians. The pay problems experienced by some Government of Canada employees are completely unacceptable. No one should have to worry about being paid for their work.</p><p>That is why, as part of our government’s commitment to resolve all outstanding Phoenix pay issues, the Prime Minister, Justin Trudeau, today announced the creation of the Working Group of Ministers on Achieving Steady State for the Pay System.</p><p>The Working Group, chaired by Ralph Goodale, Minister of Public Safety and Emergency Preparedness, has already begun its work with support from the Privy Council Office.</p><p>The Working Group is an opportunity to leverage the experience of its members, and to take a whole-of-government approach to address the issues.</p><h2>Quote</h2><blockquote><p>“It is unacceptable for people to be working and not get paid. This working group will bolster the actions we have already taken, and ensure that we fulfill our commitment to the Public Service to fix the issues that have impacted employees.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Working Group members are:<ul><li>The Hon. Ralph Goodale, Minister of Public Safety and Emergency Preparedness (Chair);</li><li>The Hon. Scott Brison, President of the Treasury Board;</li><li>The Hon. Bill Morneau, Minister of Finance;</li><li>The Hon. Jim Carr, as acting Minister of Public Services and Procurement;</li><li>The Hon. Catherine McKenna, Minister of Environment and Climate Change;</li><li>Steven MacKinnon, Parliamentary Secretary to the Minister of Public Services and Procurement.</li></ul></li><li>The Phoenix pay system, which was implemented in two phases in 2016, administers pay for over 290,000 employees across 98 federal organizations.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.tpsgc-pwgsc.gc.ca/remuneration-compensation/paye-centre-pay/mise-a-jour-phenix-phoenix-updates-eng.html\">Phoenix Pay System</a></li></ul></div>\n      "
}