{
  "path": "/en/news/news-releases/2021/07/06/new-support-child-and-family-services-cowessess-first-nation",
  "pageTitle": "New support for child and family services in Cowessess First Nation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>First Nation, Inuit, and Métis children deserve the best possible start in life – to grow up in their communities, immersed in their cultures, and surrounded by loved ones. That is why the Government of Canada worked with Indigenous partners to co-develop the historic <em>Act respecting First Nations, Inuit and Métis children, youth and families</em> to improve child and family services and to reduce the number of Indigenous children and youth in care.</p>\n\n<p>The Prime Minister, Justin Trudeau, the Premier of Saskatchewan, Scott Moe, and the Chief of Cowessess First Nation, Cadmus Delorme, today announced that the first Coordination Agreement under the<em> Act respecting First Nations, Inuit and Métis children, youth and families </em>has been signed with Cowessess First Nation – Treaty 4 Territory – and the Province of Saskatchewan.</p>\n\n<p>The tragedy experienced in the community with the findings of unmarked graves associated with the Marieval Indian Residential School has been a sorrowful reminder of the critical importance of supporting First Nations jurisdiction over the well-being of their children, youth, and families. This Coordination Agreement is a historic step forward in Canada’s journey to reconciliation. It will ensure the necessary transition measures are in place so Cowessess First Nation can effectively exercise their jurisdiction under the <em>Miyo Pimatisowin Act</em>. The Nation will be making their own decisions about what is best for their children, their families, and their community.</p>\n\n<p>As part of the Agreement, the Government of Canada will invest $38.7 million over the next two years to support the First Nation in the implementation of their child and family services system. The Province of Saskatchewan will continue to provide protection services for Cowessess First Nation children off reserve during the transition to the full implementation by Cowessess.</p>\n\n<p>The Government of Canada will continue to work with Indigenous partners, provinces, and territories to respond to the priorities of Indigenous peoples for child and family services reform, with a focus on the best interests of Indigenous children, cultural continuity, and substantive equality.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Every First Nation, Inuit, and Métis child should have the opportunity to grow up with their families and in their communities, so they can reach their full potential. We are pleased to support Cowessess First Nation in exercising their jurisdiction to ensure a better start for their children.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“By providing Cowessess First Nation with the jurisdiction and authority for child and family services, the children of Cowessess First Nation will have the opportunity to be raised in accordance with their own traditions and culture. This agreement will serve as a model for the rest of the country, and I commend Chief Delorme for his leadership in driving this initiative.”</p>\n\n<footer class=\"default\">The Hon. Scott Moe, Premier of Saskatchewan</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is an example of how reconciliation is possible in Canada. For over a year, over many long hours, Cowessess First Nation was empowered to exercise our full jurisdiction over our Nation’s children, youth, and families, to lead in creating the vision and design of a child welfare system that reflects our culture, values, and priorities, and to lead all discussions on the transition plan outlined in our Coordination Agreement. Our discussions weren’t always easy;&nbsp;turning the page on past injustices that we all inherited never is. But with Cowessess First Nation in the driver’s seat, supported by our federal and provincial partners who worked hard to enable our vision, today we stand ready to enter a new chapter of our history that will bring new support, hope, and opportunity to Cowessess First Nation children and youth.&nbsp;Our Agreement commits each government to their role in our healing journey and this new chapter, as one braid of sweetgrass.”</p>\n\n<footer class=\"default\">Cadmus Delorme, Chief, Cowessess First Nation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is a historic day. The announcement of the first-ever Coordination Agreement under the Act<em> </em>with Cowessess First Nation and Saskatchewan will support the Nation with the necessary tools and resources to be able to best care for their children, youth, and families. Every Indigenous child deserves the best chance and we believe this will benefit their children to have the opportunity to grow up connected to their culture, language, heritage, and community. Through the community’s vision and dedication, a strong partnership has developed and all partners are committed to ensuring the spirit of this Agreement is achieved.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On January 1, 2020, <em>An</em> <em>Act respecting First Nations, Inuit and Métis children, youth and families</em> came into force. The Act provides a pathway for Indigenous communities to exercise jurisdiction over child and family services, and establishes national minimum standards to ensure the best interests of Indigenous children, cultural continuity, and substantive equality.</li>\n\t<li>Under the Act, in order for an Indigenous law on child and family services to have force of federal law and prevail over conflicting federal, provincial, and territorial laws, a request must be made to enter into a Coordination Agreement.</li>\n\t<li>As of June 8, 2021, Indigenous Services Canada has received notices and requests to exercise jurisdiction under the Act from 38 Indigenous Governing Bodies representing over 100 Indigenous groups and communities. From this, 18 Coordination Agreement discussion tables have been established, including with Cowessess First Nation.</li>\n\t<li>Cowessess First Nation’s law, the <em>Miyo Pimatisowin Act</em>, has force of federal law since April 1, 2021. This enables them to exercise their jurisdiction in relation to child and family services and gives them the ability to decide what is best for their children, their families and communities.</li>\n\t<li>In November 2020, the Prime Minister announced over $542 million in funding to advance First Nations, Inuit, and Métis engagement to co-develop the implementation of the Act, and to support Indigenous communities and groups in building the capacity to establish their own child and family services systems.</li>\n\t<li>This funding supports the $3 billion already invested to improve the government’s funding support for First Nations child and family services.</li>\n\t<li>Through Budget 2021, the government invested an additional $1 billion over five years, with $118.7 million ongoing, to increase funding to support First Nations child and family services.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://laws-lois.justice.gc.ca/eng/annualstatutes/2019_24/\"><em>Act respecting First Nations, Inuit and Métis children, youth and families</em></a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1541187352297/1541187392851\">Reducing the number of Indigenous children in care</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1608565826510/1608565862367\">Notices and requests related to An Act respecting First Nations, Inuit and Métis children, youth and families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/27/more-support-advance-reform-services-indigenous-children-and-families\">More support to advance reform of services for Indigenous children and families</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-strong-indigenous-communities.html\">Budget 2021: Strong Indigenous Communities</a></li>\n</ul></div>\n      "
}