{
  "path": "/en/news/news-releases/2021/06/13/prime-minister-concludes-productive-g7-leaders-summit-united-kingdom",
  "pageTitle": "Prime Minister concludes productive G7 Leaders’ Summit in United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G7 Leaders’ Summit in Carbis Bay, United Kingdom.</p>\n\n<p>During the Summit, G7 leaders agreed to work together to address important challenges that all our people face, including ending COVID-19 and preparing for future pandemics, building a recovery that creates jobs and grows the middle class, fighting climate change and biodiversity loss, and advancing gender equality and democracy.</p>\n\n<p>To beat COVID-19 everywhere, Prime Minister Trudeau encouraged prioritizing equitable access to COVID-19 vaccines around the world, and urged continued G7 leadership in closing the funding gaps for the Access to COVID-19 Tools (ACT) Accelerator. The ACT Accelerator supports the global access of vaccines, tests, and treatments, and Canada is one of four countries around the world that has stepped up to meet their assessed share. At the Summit, G7 leaders announced a collective commitment of more than 2 billion doses to be shared with the world, and Canada’s portion of that is 100 million. Canada’s $1.3 billion contribution to the ACT Accelerator, as part of the $2.5 billion that we have contributed to the global fight against the virus, is helping provide 87 million vaccine doses to developing countries. We are also donating 13 million doses, procured by Canada, to other countries through COVAX.</p>\n\n<p>During the summit, G7 leaders agreed to take bold action to tackle climate change and build a green recovery that creates jobs, growth, and a cleaner future for our people. To drive this, the G7 leaders have each committed to increased 2030 targets, which will cut the G7’s collective emissions by around half compared to 2010. Climate change is a global challenge, and we must support all countries in the fight against it to build a cleaner and more resilient future for everyone. That’s why Prime Minister Trudeau announced a doubling of Canada’s climate finance, from $2.65 billion in 2015 to $5.3 billion over five years, including increased support for adaptation, as well as nature and nature-based solutions that are in line with the G7 Nature Compact. The Prime Minister also announced Canada will increase its provision of grants to 40 per cent, up from 30 per cent previously, for improved access by impacted communities. This funding will help developing countries build domestic capacity to take climate action, build resiliency, and reduce pollution, including by finding nature-based solutions to climate change like protecting biodiversity and planting trees, and supporting the transition to clean energy and the phasing-out of coal.</p>\n\n<p>He also emphasized the importance of continued G7 leadership on climate and energy in order to reach net-zero by 2050, while also equipping our workers with the skills to take full advantage of the growing economic opportunities associated with clean technology. As G7 Leaders met to discuss climate change, Canada took further action at home to curb harmful coal emissions, announcing a new policy statement on new thermal coal mining and expansion projects that explains that these projects are likely to cause unacceptable environmental effects and are not aligned with Canada’s domestic and international climate change commitments. &nbsp;Recognizing that thermal coal is the single largest contributor to climate change and a major source of toxic pollution that harms human health, Canada is already phasing out conventional coal-fired electricity across Canada by 2030 and co-founded the Powering Past Coal Alliance with the UK to accelerate the global transition off coal to clean power. As we continue to build a cleaner world, Canada will support workers in the energy sector adapt to these changes, equip them with the skills necessary to take advantage of new economic opportunities, and help them find well-paying jobs.&nbsp;</p>\n\n<p>G7 leaders also adopted the 2030 G7 Nature Compact, committing to conserve and protect at least 30 per cent of global and domestic land and ocean by 2030, which matches Canada’s ambitious domestic target. These new investments and commitments to global climate action and conservation builds on the work that Canada has been doing to fight climate change and build a cleaner future, while creating jobs and growth.</p>\n\n<p>The Prime Minister underscored the pandemic’s disproportionate impact on women, youth, marginalized, and underrepresented groups, including Black and racialized communities and Indigenous Peoples. He reiterated the importance of creating a global economic recovery that creates jobs, growth, and opportunities for everyone, and committed to tackling the global learning crisis. To help ensure a recovery that benefits all and address the stalled progress for global education due to the pandemic, Prime Minister Trudeau announced that Canada will renew its contributions to the Global Partnership for Education. This $300 million investment over five years will support girls’ education and help strengthen education systems in developing countries to achieve equitable and quality education for children worldwide.</p>\n\n<p>G7 leaders also discussed preserving hard-won progress and continuing collective efforts to help low- and middle-income countries whose situations have been worsened as a result of the pandemic and its economic impacts. Prime Minister Trudeau also highlighted Canada’s co-leadership of the Financing for Development in the Era of COVID-19 and Beyond Initiative, the most inclusive gathering of countries to focus on the socio-economic recovery and financing needs arising from the pandemic.&nbsp;</p>\n\n<p>The Prime Minister and his G7 counterparts also agreed to continue efforts to address key regional and global security challenges. Prime Minister Trudeau underlined the importance of continuing to champion the rights of women and girls, stand up for press freedom through the Media Freedom Coalition, and counter foreign threats to democracy including disinformation, through the G7 Rapid Response Mechanism. He also stressed the importance of collective efforts to oppose the use of arbitrary detention, including the Canada-led Declaration Against Arbitrary Detention in State-to-State Relations and its associated Partnership Action Plan.</p>\n\n<p>At the conclusion of the Summit, G7 leaders and invited guests issued a joint statement on open societies and reiterated that the shared values of democracy, human rights, gender equality, inclusion, the rule of law, and open economies must remain at the core of the G7’s responses to global challenges.</p>\n\n<p>Only together can we tackle the global challenges of today and tomorrow, and build back better for everyone. Canada will continue to work with our partners to finish the fight against COVID-19, create jobs, grow the middle class, fight climate change, and strengthen democracy around the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With the global COVID-19 pandemic continuing to challenge countries and people around the world, this Summit was a critical moment for G7 leaders to coordinate our collective approach to end this crisis and put the global community on the path to recovery. Only together can we tackle global challenges like climate change, create middle class jobs and opportunities for our people, and promote democracy, human rights, and the rule of law.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the Summit, Prime Minister Trudeau held bilateral meetings with the following leaders: the Prime Minister of the United Kingdom, Boris Johnson, the President of France, Emmanuel Macron, the Prime Minister of Italy, Mario Draghi, the Chancellor of Germany, Angela Merkel, Prime Minister of Japan, Yoshihide Suga, and the Prime Minister of Australia, Scott Morrison.</li>\n\t<li>Before taking part in the G7 Summit, the Prime Minister also spoke with Her Majesty Queen Elizabeth II.</li>\n\t<li>The Prime Minister also participated in an event hosted by His Royal Highness, The Prince of Wales, to encourage private sector leaders to improve sustainability and place nature, people, and the planet at the heart of global value creation.</li>\n\t<li>The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom, the United States and the European Union.</li>\n\t<li>Australia, India, South Africa, and South Korea also participated in this year’s Summit at the invitation of Prime Minister Boris Johnson of the United Kingdom.</li>\n\t<li>This was the first in person meeting of G7 leaders since 2019 and the fifth Summit attended by Prime Minister Trudeau.</li>\n\t<li>The United Kingdom holds the G7 presidency in 2021, and Germany will hold it in 2022. Canada last held the presidency of the G7 in 2018.</li>\n\t<li>In April 2021, Canada updated its Nationally Determined Contributions emissions target under the Paris Agreement, an economy-wide target to reduce greenhouse gas emissions to 40-45 per cent below 2005 levels by 2030.</li>\n\t<li>Canada has been one of the leading contributors to the global response to COVID-19, having mobilized over $2.5 billion in international assistance, including $1.3 billion for the ACT-Accelerator to ensure equitable access to COVID-19 tests, treatments, and vaccines.\n\t<ul>\n\t\t<li>This is in addition to the $1 billion increase to Canada’s loan commitment to the International Monetary Fund's Poverty Reduction and Growth Trust, which provides interest-free loans to low-income countries.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/13/building-back-fairer-cleaner-and-more-prosperous-future-all\">Building back: A fairer, cleaner, and more prosperous future for all</a></li>\n\t<li><a href=\"/en/news/backgrounders/2021/06/13/carbis-bay-g7-summit-communique\">G7 Leaders Communique</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2021-06-13-health-declaration-sante.aspx?lang=eng\">Carbis Bay Health Declaration</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2021-06-13-nature_compact-nature_horizon-2030.aspx?lang=eng\">G7 2030 Nature Compact</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2021-06-13-open_societies-societes_ouvertes.aspx?lang=eng\">Open Societies Statement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2021-06-13-research_compact-pacte_recherche.aspx?lang=eng\">Research Compact</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/02/prime-minister-attend-g7-leaders-summit-nato-summit-and-canada\">Prime Minister to attend G7 Leaders’ Summit, NATO Summit, and Canada-European Union Summit</a></li>\n\t<li><a href=\"https://www.g7uk.org/\">G7 United Kingdom 2021 </a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom Relations</a></li>\n</ul></div>\n      "
}