{
  "path": "/en/news/readouts/2020/11/16/prime-minister-justin-trudeau-speaks-prime-minister-netherlands-mark-rutte",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Prime Minister of the Netherlands Mark Rutte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the Netherlands, Mark Rutte.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte discussed the global COVID-19 pandemic and the response in Canada and the Netherlands to protect the health and safety of citizens and to support businesses and workers. They highlighted the role of improved testing and of progress toward developing a safe and effective vaccine in the fight against COVID-19.</p>\n\n<p>The Prime Ministers spoke about the strength of transatlantic relations. They emphasized their commitment to working together to advance shared priorities such as fighting climate change, protecting human rights, and promoting global peace and security, including through cooperation in NATO.</p>\n\n<p>The two leaders agreed on the importance of ongoing efforts to seek accountability and justice following the shooting down of Ukraine International Airlines Flight PS752 and of Malaysian Airlines Flight MH17, and the need to work together to prevent such tragedies from happening again.</p>\n\n<p>The Prime Ministers spoke of the significant role Canadian forces played in the Liberation of the Netherlands at the end of the Second World War, and how the people of Canada and the Netherlands continue to honour and remember the sacrifices of veterans.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte look forward to continued cooperation to further strengthen the deep and historic friendship between Canada and the Netherlands.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/05/05/statement-prime-minister-75th-anniversary-liberation-netherlands\">Statement by the Prime Minister on the 75th anniversary of the Liberation of the Netherlands</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}