{
  "path": "/en/news/readouts/2021/09/21/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden, who congratulated him on his re-election.</p>\n\n<p>The Prime Minister and President reiterated the importance of the mutually beneficial Canada-U.S. partnership for the security and prosperity of both countries.</p>\n\n<p>The two leaders committed to getting together in person soon to discuss bilateral cooperation on a range of important files. These include bilateral economic and trade issues such as Buy America provisions; close collaboration on fighting climate change and promoting a green economic recovery, including at the upcoming COP26 summit in Glasgow; and the response to COVID-19, which includes the management of the Canada-U.S. land border.</p>\n\n<p>The Prime Minister and President discussed China’s arbitrary detention of Canadian citizens Michael Spavor and Michael Kovrig.</p>\n\n<p>Prime Minister Trudeau also confirmed his intention to participate in the virtual Global COVID-19 Summit: Ending the Pandemic and Building Back Better Health Security to Prepare for the Next, which will be hosted by President Biden on September 22.</p>\n\n<p>The two leaders looked forward to staying in touch.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/09/statement-on-passing-of-1000-days-since-michael-kovrig-and-michael-spavor-were-arbitrarily-detained-in-china.html\">Statement on passing of 1,000 days since Michael Kovrig and Michael Spavor were arbitrarily detained in China</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://ukcop26.org\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid\">COVID-19: Travel, testing, quarantine and borders</a></li>\n</ul></div>\n      "
}