{
  "path": "/en/news/statements/2015/12/04/statement-prime-minister-canada-speech-throne",
  "pageTitle": "Statement by the Prime Minister of Canada on the Speech from the Throne | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today marking the delivery of the Speech from the Throne in the Senate Chamber:</p><p>“This plan was developed by listening to Canadians. It reflects their priorities, interests, and ambitions.&nbsp;&nbsp;</p><p>“Canadians have told us they want a real and fair chance at success. To provide real change, we will deliver a tax cut for the middle class, introduce a new Canada Child Benefit, and create jobs through new investments in public transit, as well as green and social infrastructure. We will work with the provinces and territories to make post-secondary education more affordable, begin to develop a new Health Accord, and enhance the Canada Pension Plan.</p><p>“We will restore Canadians’ trust in their public institutions, including the House of Commons and the Senate, by working with greater openness and transparency. This will include consulting on and implementing electoral reforms.</p><p>“Canadians want to live in a country where a clean environment and a strong economy go hand-in-hand. We will fight climate change, with the provinces and territories, as Canada works to put a price on carbon and reduce carbon pollution. We will also invest in clean technology and introduce new environmental assessment processes that seek and consider public input, with decisions informed by scientific advice.</p><p>“We will keep our diverse communities strong and will renew Canada’s nation-to-nation relationship with Indigenous peoples. This will include launching an inquiry into missing and murdered Indigenous women and girls, and working in collaboration so that every First Nations child receives a quality education.</p><p>“We will make it easier for new Canadians to build successful lives in Canada, reunite with their families, and contribute to the economic success of all citizens. In response to pressing international need, we will welcome 25,000 new Canadians from Syria by the end of February 2016. We will also provide more support for our veterans and their families, recognizing their service to our country.&nbsp;</p><p>“Canadians want a safe and peaceful nation that provides them with opportunities. We will strengthen our relationships with our allies and continue to work with them in the fight against terrorism, provide assistance to the world’s most vulnerable, contribute to greater peace throughout the world, invest in our Armed Forces, and negotiate trade agreements that expand our economic opportunities.</p><p>“We will undertake these and other initiatives while pursuing a responsible and transparent fiscal plan suited to challenging economic times.</p><p>“I have every confidence in this ambitious plan to bring real change to Canada. We will deliver what Canadians have asked for, open up new horizons for our country, and show the world that diversity, creativity, and compassion are vital to a peaceful and prosperous future.”</p></div>\n      "
}