{
  "path": "/en/news/readouts/2023/02/14/prime-minister-justin-trudeau-speaks-united-states-special-presidential",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the United States Special Presidential Advisor for the Americas, Senator Chris Dodd | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the United States Special Presidential Advisor for the Americas, Senator Chris Dodd.</p>\n\n<p>Prime Minister Trudeau and Senator Dodd discussed the ongoing political, humanitarian, and socioeconomic crisis in Haiti, and their commitment to work together to support Haitian-led solutions, promote dialogue toward democratic elections, and enhance Haiti’s effective law enforcement capacity.&nbsp; The Prime Minister talked about the importance of coordinated sanctions to pressure those responsible for the ongoing violence and instability in Haiti, to ensure they stop providing funds and weapons to criminal gangs.</p>\n\n<p>The Prime Minister and the Senator discussed the key role played by the Caribbean Community (CARICOM) in regional affairs, and the importance of our countries’ respective, ongoing engagement with CARICOM partners.&nbsp;They looked forward to seeing one another at the CARICOM Heads of Government meeting that will take place in Nassau, The Bahamas, on February 15 and 16, and to discussing regional efforts to support Haiti and its people with Caribbean partners.</p>\n\n<h2>Associated Links</h2>\n\n<ul class=\"Indent1\">\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2023/02/canada-deploys-cp-140-long-range-patrol-aircraft-to-support-haiti.html\">Canada deploys CP-140 long-range patrol aircraft to support Haiti</a></li>\n</ul></div>\n      "
}