{
  "path": "/en/news/news-releases/2021/01/11/prime-minister-hold-virtual-cabinet-retreat",
  "pageTitle": "Prime Minister to hold virtual Cabinet retreat | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a virtual Cabinet retreat with four sessions to take place on January 12, 14, 18, and 21, 2021.</p>\n\n<p>The Cabinet retreat will focus on the government’s ongoing work to manage the COVID-19 pandemic in Canada, including the largest rollout of vaccines in our country’s history. The Prime Minister and ministers will discuss ways to continue collaborating with provinces and territories, and Indigenous and public health partners, to immunize as many Canadians as possible – as quickly as possible – while prioritizing those at highest risk to save lives. They will also discuss our strict travel and border measures that are helping keep people safe, as well as actions to protect vulnerable people and to support all Canadians. The federal government will keep doing whatever it takes, for as long as it takes, to beat COVID-19 and protect Canadians through the crisis.</p>\n\n<p>Ministers will work to keep advancing an economic and jobs recovery that benefits all Canadians. This includes fighting climate change, investing in the green economy and skills training, creating a million jobs, building affordable housing, and improving high-speed internet access in rural areas to empower communities across the country while strengthening Canada’s competitiveness. It also includes supporting the creation of a Canada-wide early learning and child care system, and helping reduce student debt to ease the burden on young Canadians entering the workforce.</p>\n\n<p>The Government of Canada will continue to collaborate with provinces, territories, municipalities, and Indigenous communities on these and other priorities for Canadians. We will also work with all parliamentarians to deliver real results for Canadians as Parliament resumes at the end of January. Together, we will build a stronger Canada where everyone can reach their full potential.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As Canada continues to fight the global COVID-19 pandemic and take action to address its impacts, this Cabinet retreat will be an important opportunity to discuss the next steps to protect Canadians and build a better, more resilient, and more inclusive country for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote></div>\n      "
}