{
  "path": "/en/news/statements/2021/10/11/statement-prime-minister-international-day-girl",
  "pageTitle": "Statement by the Prime Minister on International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the Girl:</p>\n\n<p>“On the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month/international-day-girl-child.html\">International Day of the Girl</a>, we celebrate the power and potential of girls in Canada and around the world. The world is home to more than 1.1&nbsp;billion girls – they are the leaders, entrepreneurs, and changemakers of today and tomorrow. We are reminded that when girls get the support and opportunities they need, they can create a better world for themselves and future generations.</p>\n\n<p>“This year’s United Nations theme – <a href=\"https://www.un.org/en/observances/girl-child-day\">Digital generation. Our generation.</a> – celebrates the trailblazing, tech-savvy girls who are making a lasting impact across the country and the globe, amplifying underrepresented voices, and paving the way for other girls to follow in their footsteps.</p>\n\n<p>“Around the world, girls are less likely than boys to own and use devices, limiting their access to tech-related skills and jobs – but this gender divide goes beyond the digital space and connectivity. Today, girls in Canada are more likely to experience cyberbullying, family violence, and other forms of violence than boys, which leads to lower levels of mental health. Many of these challenges have been amplified by the COVID-19 pandemic, as young Canadians were asked to stay home, distance from their friends, and adapt to online learning. At a crucial age in their lives, they have made historic sacrifices to keep others and their communities safe.</p>\n\n<p>“On this day, we resolve to not only shine a light on these challenges, but to take concrete action to ensure women and girls have the tools they need to succeed, which includes digital connectivity, both here at home and around the world. That’s why the Government of Canada is continuing to work to end gender-based violence, invest in reliable and high-speed Internet, support girls’ pursuit of careers in STEM fields and skilled trades, and increase their political participation and leadership.</p>\n\n<p>“On the international stage, Canada continues to engage and work with our partners to address gender inequalities. Earlier this year, I participated in the Generation Equality Forum and announced nearly $180&nbsp;million to advance gender equality around the world. This funding will support activities that address social and institutional barriers to girls’ education, including developing digital tools to deliver programs to girls during the pandemic.</p>\n\n<p>“The International Day of the Girl is an important part of <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a> celebrations in Canada. Today, we recommit ourselves to lifting up women and girls in Canada and globally, and building a world where they can all feel safe and empowered – because nothing should stand in the way of girls fulfilling their dreams.”</p></div>\n      "
}