{
  "path": "/en/news/statements/2021/06/05/statement-prime-minister-world-environment-day",
  "pageTitle": "Statement by the Prime Minister on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/environment-day\">World Environment Day</a>, we join the global community in celebrating nature and recommit ourselves to building a cleaner, more resilient world.</p>\n\n<p>“World Environment Day 2021 marks the launch of the <a href=\"https://www.decadeonrestoration.org/\">United Nations’ Decade on Ecosystem Restoration</a>. This international initiative reminds us of the vital importance of healthy ecosystems and the urgent need to restore, protect, and sustain them for generations to come. To help put nature and biodiversity on a path to recovery, I signed the <a href=\"https://www.leaderspledgefornature.org/\">Leaders’ Pledge for Nature</a> in September. The race is on for a nature positive world in 2030.</p>\n\n<p>“From purifying the air we breathe to providing us with nutritious food and fresh water, ecosystems are essential to our health and well-being. They are also key to our continued prosperity – in the fight against climate change, we have no stronger, more natural allies. Ecosystems, as large as the ocean and as small as a tree, work together to reduce pollution. They also offer protection from the worst impacts of climate change, from storm surges to heat waves.</p>\n\n<p>“More than ever, we must work with nature, not against it. That is why, over the last five years, the Government of Canada has taken strong action to step up its conservation efforts and advance nature-based climate solutions. In 2016, working closely with Indigenous and coastal communities, we launched the Oceans Protection Plan to restore and preserve Canada’s marine ecosystems. Two years later, we made the single-largest investment in nature conservation in Canadian history. Most recently, in Budget 2021, we proposed significant new investments, including the Natural Infrastructure Fund, to further protect Canada’s land and oceans and support natural and hybrid infrastructure projects, such as local parks, green spaces, and waterfronts. These initiatives not only support the environment and contribute to our fight against climate change – they help local economies and create thousands of good jobs across the country.</p>\n\n<p>“To secure a greener future for Canadians, we remain committed to planting two billion trees over the next decade, and protecting 25 per cent of Canada’s land and oceans by 2025, and 30 per cent by 2030. We are also taking steps to reduce plastic pollution, and intend to undertake the first-ever Census of the Environment, which will increase our knowledge of Canada’s ecosystems, help monitor environmental trends, and promote better decision-making for a nature positive world.</p>\n\n<p>“Canada is also committed to implementing the UN Declaration on the Rights of Indigenous Peoples, which affirms Indigenous rights related to the conservation, protection, and sustainable management of the environment and its resources. We must also acknowledge and respect First Nation, Inuit, and Métis traditional ecological knowledge. Initiatives such as Indigenous Guardians are essential to implementing these practices. Indigenous peoples were the first to voice climate change concerns in their environment, and many continue to live off, and sustain their communities through, the land and waters around them.</p>\n\n<p>“The global COVID-19 pandemic and climate crisis remind us that we are only as healthy as our environment, and that we all have a role to play to restore it. This World Environment Day, I encourage Canadians to learn more about their local ecosystems and do their part to leave a stronger, cleaner planet for future generations.”</p></div>\n      "
}