{
  "path": "/en/news/statements/2020/07/01/statement-prime-minister-canada-day",
  "pageTitle": "Statement by the Prime Minister on Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada Day:</p>\n\n<p>“On Canada Day, we celebrate the amazing place we call home – and the people we share it with. Whether you are firing up the barbecue or playing outside with the kids, this is a chance to reflect on where we are as a country, and where we are headed.</p>\n\n<p>“The last few months have been difficult for all Canadians, but throughout this pandemic, we have been there for one another. We are neighbours helping neighbours, small businesses being there for their communities and their staff, Armed Forces answering the call to help protect our most vulnerable, and doctors and nurses keeping our families healthy. Because that’s what it means to be Canadian.</p>\n\n<p>“Canada’s success is because of its people. People who strive to live up to our shared values of peace, equality, and compassion, and know that diversity is our strength.</p>\n\n<p>“People who know that, only together, we can build a better country, where every senior has a safe place to live, and where we say no to racism, injustice, and hate. A country where we understand that our work to ensure everyone has an equal and fair chance at success is never finished.</p>\n\n<p>“What makes Canada special is not the belief that this is the best country in the world – it’s the knowledge that we could be, and that we will keep working to build that country. Because no challenge we face will be too great, if we face it together.</p>\n\n<p>“I invite all Canadians to join this year’s <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/canada-day.html\">virtual celebrations</a> and the #CanadaDay conversation online. Today, we celebrate the country we share and tomorrow, we look to the future and move forward, together.</p>\n\n<p>“Happy Canada Day, everyone!”</p></div>\n      "
}