{
  "path": "/en/news/news-releases/2018/09/18/prime-minister-spain-pedro-sanchez-visit-canada",
  "pageTitle": "Prime Minister of Spain Pedro Sánchez to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will meet with the Prime Minister of Spain, Pedro Sánchez, in Montréal on September 23.</p><p>During the visit, Prime Minister Trudeau and Prime Minister Sánchez will discuss the importance of progressive trade, and how the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) is creating good, middle class jobs and new opportunities for businesses and people on both sides of the Atlantic.</p><p>They will also explore ways for our countries to work more closely together to build economies that work for everyone, promote international peace and security, strengthen the rules-based international order, and advance gender equality.</p><p>The two leaders will hold a bilateral meeting and a joint press conference, and participate in an armchair discussion at the Global Progress Forum.</p><h2>Quote</h2><blockquote><p>“Canada and Spain are like-minded partners and allies, and share many important ties and values. I look forward to meeting with Prime Minister Sánchez to deepen our relationship and create more opportunities for people in both of our countries.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau and Prime Minister Sánchez met for the first time during the NATO Summit in Brussels, Belgium, in early July after Prime Minister Sanchez was officially sworn into office as President of the Government of Spain on June 1, 2018.</li><li>Spain and Canada are active members of NATO and participants in multilateral peace and security operations, including the International Coalition against Daesh in Iraq and in the NATO multinational battle group in Latvia, led by Canada.</li><li>Canada and Spain share a common perspective on key global challenges and a shared commitment to fundamental values, including diverse and inclusive societies.</li><li>Canada and Spain enjoy a strong and growing bilateral economic relationship and both benefit from the Canada-European Union Comprehensive Economic and Trade Agreement provisionally applied since September 2017. In 2017, Canada’s merchandise exports to Spain totaled $1.6 billion and merchandise imports from Spain reached $2.8 billion, making Spain Canada’s seventh-largest merchandise trading partner in the EU.</li><li>In 2017, Canadian investments in Spain were valued at $6.4 billion and the stock of Spain’s direct investment to Canada was valued at more than $5.8 billion.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng\">Canada – Spain Relations</a></li></ul></div>\n      "
}