{
  "path": "/en/news/readouts/2022/11/16/prime-minister-justin-trudeau-and-prime-minister-united-kingdom-rishi",
  "pageTitle": "Prime Minister Justin Trudeau and Prime Minister of the United Kingdom Rishi Sunak speak with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and the Prime Minister of the United Kingdom, Rishi Sunak, spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sunak expressed continued solidarity with Ukraine and conveyed their condolences for the civilian deaths caused by Russia’s brutal, appalling, and indiscriminate attacks across the country overnight.</p>\n\n<p>The leaders also discussed the recent explosions in eastern Poland, and the need to assess the situation, including a full investigation into what happened, and work in partnership with allies to respond accordingly. Regardless of the outcome of that investigation, it is clear that Putin’s invasion of Ukraine is to blame for the ongoing conflict and ensuing violence.&nbsp;</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau and Prime Minister Sunak for their countries’ support to Ukraine.</p>\n\n<p>The leaders agreed to stay in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/11/16/joint-statement-nato-and-g7-leaders-margins-g20-summit-bali\">Joint Statement of NATO and G7 Leaders on the margins of the G20 Summit in Bali</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/27/prime-minister-justin-trudeau-speaks-prime-minister-united-kingdom-rishi\">Prime Minister Justin Trudeau speaks with Prime Minister of the United Kingdom Rishi Sunak</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/10/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}