{
  "path": "/en/news/statements/2019/05/03/statement-prime-minister-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Press Freedom Day:</p>\n\n<p>“Today, we celebrate the important role journalists play around the world. We also take a hard look at the current state of press freedom, and remember those who have died in pursuit of the truth.</p>\n\n<p>“The theme of this year’s&nbsp;<a href=\"https://en.unesco.org/commemorations/worldpressfreedomday\">World Press Freedom Day</a>&nbsp;is ‘Media for democracy: Journalism and elections in times of disinformation.’ Journalists today face grave and growing challenges in their work to provide the public with reliable and quality information.</p>\n\n<p>“The digital age has made sharing information easier than ever before. But it has also given way to online spaces that peddle disinformation and reduce complex issues into oversimplified, toxic us-versus-them narratives.</p>\n\n<p>“Journalists increasingly find themselves competing in these online spaces against malicious foreign agents and opinion makers who would rather manipulate people and foment division than inform the public and create a common set of facts.</p>\n\n<p>“Independent, fact-based reporting is vital. Few professions have the power – and responsibility – to enrich conversations, open people to new ideas and perspectives, and widen the lens on the challenges we face.</p>\n\n<p>“By introducing measures to support Canadian journalism and provide better internet access to underserved communities, the Government of Canada is taking steps to make sure Canadians have access to reliable and trustworthy news sources. The government is also working to increase transparency during the election process. Recent changes to the&nbsp;<em>Canada Elections Act</em>&nbsp;will give Canadians additional tools to know who is trying to influence their vote.</p>\n\n<p>“On the international stage, Canada continues to advocate for independent media and strong democracies, and is taking steps to combat threats intended to undermine them. Last November, inspired by the findings and principles of the&nbsp;<a href=\"https://rsf.org/en/news/democratic-leaders-give-historic-commitment-based-declaration-information-and-democracy\">International Information and Democracy Commission</a>, we joined 11 other countries to take urgent action against threats to freedom of expression and a free press.</p>\n\n<p>“This summer, Canada and the United Kingdom will also co-host a media freedom conference in London to find ways to combat disinformation and support and defend media against censorship, imprisonment, personal attacks, and abuse. It is unacceptable that journalists face these threats, and more, for doing their job and standing up for their fellow citizens.</p>\n\n<p>“On behalf of Canadians, I thank all journalists in this country and around the world who reveal injustices and give us the facts to think more freely and critically about the world around us.”</p></div>\n      "
}