{
  "path": "/en/news/statements/2020/11/16/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Global Entrepreneurship Week, which runs from November 16 to 22, 2020:</p>\n\n<p>“Entrepreneurs move Canada forward. They transform imagination into reality, create millions of good paying jobs, build strong communities across the country, and generate economic growth for all of us.</p>\n\n<p>“Today marks the start of <a href=\"https://www.genglobal.org/canada\">Global Entrepreneurship Week</a>, a time to celebrate entrepreneurs and to thank them for their important contributions to our country’s prosperity. It is also an opportunity for aspiring entrepreneurs to explore their potential and to connect with the resources and tools they need to turn their visions and ideas into growing businesses.</p>\n\n<p>“The global COVID-19 pandemic has caused major disruptions to businesses in Canada and around the world. As we began to stay home and socially distance to keep ourselves and others safe, many businesses have had to shut their doors, while others have had to find new creative ways to sell their products.</p>\n\n<p>“Since the beginning of the pandemic, the Government of Canada has taken significant and decisive action to help Canadian businesses and entrepreneurs facing financial hardship adapt and position themselves for recovery. We launched and have proposed an expansion to the <a href=\"https://ceba-cuec.ca/\">Canada Emergency Business Account</a> to provide additional support to Canadian companies through loans during these challenging times. We also granted businesses the option to defer payment of any income tax due before October 2020. And through Canada’s Plan to Mobilize Industry, thousands of businesses and entrepreneurs across the country answered the call and retooled their supply chains to develop products that would contribute to the fight against COVID-19. When Canada needed hand sanitizer, Fluid Energy Group shifted its production line to help address the shortage by retooling its chemical production plant to produce more than 100,000 litres of sanitizer a day. And when health care workers and researchers needed more protective equipment, educational technology company InkSmith retooled its plant and formed a new company, The Canadian Shield, to start producing much-needed face shields to keep our front-line workers safe.</p>\n\n<p>“To help women entrepreneurs navigate this crisis, we provided $15 million in additional funding through the <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a>. We also announced over $300 million in funding to help Indigenous-owned businesses get through these difficult times and announced, in partnership with Canadian financial institutions, Canada’s first-ever <a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/09/prime-minister-announces-support-black-entrepreneurs-and-business\">Black Entrepreneurship Program</a> to help Black business owners and entrepreneurs across the country recover from this crisis and grow their businesses.</p>\n\n<p>“The Government of Canada will continue to support entrepreneurs and businesses so that they can recover from the economic impacts of COVID-19. That is why we proposed to extend the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a> until June 2021, to ensure businesses, charities, and non-profits have the support they need to keep their employees on the payroll and re-hire workers. We have also announced a new <a href=\"https://www.canada.ca/en/department-finance/news/2020/10/government-announces-new-targeted-support-to-help-businesses-through-pandemic.html\">Canada Emergency Rent Subsidy</a>, which would help cover up to 90 per cent of rent and mortgage interest for a business that is significantly affected by a mandatory public health order. With COVID-19 presenting challenges to international trade, we have also announced <a href=\"https://www.canada.ca/en/global-affairs/news/2020/11/minister-ng-announces-new-measures-to-help-canadian-small-businesses-access-global-markets-amid-covid-19.html\">new measures</a> to help Canadian businesses grow in the global marketplace.</p>\n\n<p>“Through this year, Canadian entrepreneurs have proven to be resilient and determined in the face of challenge, and we will continue to support them and their businesses through COVID-19 and beyond. Because we know that their success is Canada’s success – and we can only build back better if we support one another.</p>\n\n<p>“On behalf of the Government of Canada, I ask all Canadians to join me in celebrating and thanking our entrepreneurs who create jobs, grow communities, and help ensure our country remains one of the most prosperous in the world. Let’s continue buy local, order takeout, and do what we can to support Canadian businesses and their owners, so they can grow and thrive even in these difficult times. ”</p></div>\n      "
}