{
  "path": "/en/news/news-releases/2020/06/23/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of the Supreme Court of Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Patrick J. Duncan, a judge of the Supreme Court of Nova Scotia, as the new Associate Chief Justice of the Supreme Court of Nova Scotia.</p>\n\n<p>Associate Chief Justice Duncan replaces the Honourable Deborah K. Smith, who was appointed Chief Justice on June 22, 2019.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Patrick J. Duncan continued success as he takes on his new role as Associate Chief Justice of the Supreme Court of Nova Scotia. Associate Chief Justice Duncan brings with him a wealth of experience gained while serving as a judge on the provincial Supreme Court since 2007 and practising law for nearly three decades. I am confident that Nova Scotians will be well served by him in his new position.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/06/23/honourable-patrick-j-duncan\">The Honourable Patrick J. Duncan</a></li>\n</ul></div>\n      "
}