{
  "path": "/en/news/news-releases/2022/08/31/prime-minister-hold-cabinet-retreat-vancouver-focus-making-life-more",
  "pageTitle": "Prime Minister to hold Cabinet retreat in Vancouver to focus on making life more affordable for people | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a Cabinet retreat in Vancouver from September 6 to 8, 2022.</p>\n\n<p>The Cabinet will drive progress on our continued efforts to make life more affordable for Canadians, and keep delivering economic growth that benefits everyone.</p>\n\n<p>During the retreat, Cabinet will discuss what they heard when talking to Canadians over the summer. While Canadians have recovered all of the jobs lost since the beginning of the pandemic and our economy is growing, families are feeling the impacts of global inflation, particularly through rising food and gasoline costs. The Prime Minister and ministers will keep working to further strengthen the economy to meet the needs of Canadians, making life more affordable for families, and building a green, healthy future for everyone. Ministers will also work to advance other priorities for Canadians, including making housing more affordable, improving the delivery of government services, taking climate action and transitioning to a clean economy, strengthening democracy here in Canada and around the world, and creating safer communities.</p>\n\n<p>The Government of Canada will continue to work with the provinces, territories, municipalities, Indigenous Peoples, international partners, businesses, and other stakeholders on the issues that matter most to Canadians. As Parliament resumes next month, together, we will continue to build a better Canada for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“After spending the summer talking to people in our communities all across the country, I look forward to a productive Cabinet meeting that will build on our continued efforts to make life more affordable for people and deliver progress on the issues that matter most to Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"/en/cabinet\">Cabinet</a></li>\n</ul></div>\n      "
}