{
  "path": "/en/news/statements/2021/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World AIDS Day:</p>\n\n<p>“On <a href=\"https://www.unaids.org/en/World_AIDS_Day\">World AIDS Day</a>, we show our support for people living with HIV and AIDS in Canada and around the world. We remember those we have lost to this epidemic, and recognize the strength and resilience of people who are living with HIV.</p>\n\n<p>“Forty years ago, the first cases of a devastating lung infection – which would later become known as AIDS – were diagnosed and officially reported in the United States. Since then, AIDS-related illnesses have claimed the lives of over 36 million people globally and, as of last year, more than 37 million people were living with HIV.</p>\n\n<p>“This year’s theme for World AIDS Day, <a href=\"https://www.unaids.org/en/2021-world-aids-day\">‘End inequalities. End AIDS. End pandemics.’</a>, highlights the urgency of putting an end to the economic, social, cultural, and legal inequalities that have contributed to prolonging the HIV and AIDS epidemic, as well as the COVID-19 pandemic at home and abroad. By addressing these inequalities, raising awareness of the impacts of HIV and AIDS, and providing adequate care and prevention services, we can improve the health and quality of life of people living with this virus, and end AIDS as a public health threat by 2030.</p>\n\n<p>“As of 2018, it is estimated that over 62,000 people were living with HIV here in Canada, and the government is committed to supporting them. In 2019, the Government of Canada launched the <a href=\"https://www.canada.ca/en/public-health/services/reports-publications/accelerating-our-response-five-year-action-plan-sexually-transmitted-blood-borne-infections.html\">Five-Year Action Plan on Sexually Transmitted and Blood-Borne Infections</a>, with the goal of accelerating the prevention, diagnosis, and treatment of sexually transmitted and blood‑borne infections, and reducing the health impacts of these infections for people across the country. The government has also made important <a href=\"https://www.canada.ca/en/institutes-health-research/news/2019/06/government-of-canada-invests-close-to-23m-in-hivaids-research.html\">investments in HIV and AIDS research</a> to ensure better health outcomes for Canadians affected by HIV and AIDS. We are currently <a href=\"https://cihr-irsc.gc.ca/e/52691.html\">seeking nominations</a> from individuals to join the Canadian Institutes of Health Research HIV/AIDS and Sexually Transmitted and Blood-Borne Infections Research Advisory Committee, to help bring the perspective of people with lived experience of HIV or AIDS to research being done at home.</p>\n\n<p>“On the international stage, Canada continues to invest in the&nbsp;<a href=\"https://www.theglobalfund.org/en/\">Global Fund to Fight AIDS, Tuberculosis and Malaria</a> to ensure the world’s poorest and most vulnerable, particularly women and girls, have access to the treatment, care, and support they need. We have pledged more than $930 million over three years to the Global Fund starting in 2020, which will bring our total contribution to over $3.8 billion by the end of 2022. These commitments are helping to address the gender and social inequalities that can drive the spread of HIV and AIDS. Thanks to the Global Fund, nearly 22&nbsp;million people received life-saving antiretroviral treatment for HIV and AIDS in 2020 alone. Next year, Canada will also be hosting the world’s most important conference on HIV and AIDS – the International AIDS Conference – to help accelerate the HIV response in Canada and globally.</p>\n\n<p>“Today, on World AIDS Day, let us continue to raise awareness and challenge the stigma and discrimination associated with HIV and AIDS. Together, we can improve care and support for people living with HIV and AIDS, and work to end this epidemic for good, at home and around the world.”</p></div>\n      "
}