{
  "path": "/en/news/statements/2017/05/17/statement-prime-minister-canada-montreals-375th-anniversary",
  "pageTitle": "Statement by the Prime Minister of Canada on Montréal’s 375th anniversary | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the 375<sup>th</sup> anniversary of the founding of Montréal:</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Three hundred and seventy-five years ago today, French colonists led by Paul de Chomedey, Sieur de Maisonneuve, and Jeanne Mance established the fur trade settlement of Ville-Marie. Centuries later, we celebrate this major anniversary for the diverse and thriving Montréal we know today.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“The fourth largest Francophone city in the world, Montréal is a hallmark of the central role Canada’s Francophone community has played, and continues to play, in building our country. We honour the foundational contributions the French-speaking community has made to Canada, and we celebrate Montréal as a dynamic economic and cultural hub.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“We also recognize the Indigenous People who originally inhabited this island and knew it by its Indigenous name, Hochelaga. Thanks in great part to its Francophone and Indigenous roots, Montréal represents the best of Canada’s openness, diversity, and inclusiveness. Today, Montréal is home to people from all over the world who speak different languages, practice different religions, and represent different cultures. This diversity sets the city apart as an example of pluralism for the rest of the world.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“The former host of EXPO 67 and the 1976 Olympics, Montréal is the birthplace of the Just for Laughs Festival and the Cirque du Soleil. This city is home to an incredible arts scene, world class educational institutions, a large business community, diverse and world-renowned cuisine, and a rich sports legacy – most notably the Montréal Canadiens, winners of a record 24 Stanley Cups. The people who have called Montréal home are artists, inventors, Nobel laureates, world-class athletes, musicians, activists, and entrepreneurs – all of whom have shaped Canada and the world.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“As both a proud Montrealer and a Member of Parliament representing other Montrealers, I am happy and honoured to celebrate this important anniversary for my hometown. On behalf of all Canadians, bravo Montréal!”</span></p><p><b>Associated Link<br> </b></p><p><a href=\"http://www.375mtl.com/en/\">alive 375</a></p></div>\n      "
}