{
  "path": "/en/news/news-releases/2018/02/23/canada-announces-new-partnerships-india",
  "pageTitle": "Canada announces new partnerships with India | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and India share a strong relationship, and are working together to create good, middle class jobs and more opportunities for Canadians and Indians alike.</p><p>The Prime Minister, Justin Trudeau, today met with the Prime Minister of India, Narendra Modi, and announced a wide range of new initiatives and agreements between both countries that span education, security, sustainable development, trade and investment, and women’s health and empowerment.</p><p>Prime Minister Trudeau and Prime Minister Modi also released a Joint Statement that outlines the way forward for the Canada-India relationship and how we will invest in mutual growth, achieve gender equality, and empower women. We will also cooperate to strengthen our cultural and economic ties, build a more peaceful and secure world, and work together on climate change, oceans, space, and clean energy.</p><p>This morning, Prime Minister Trudeau laid a wreath at the Raj Ghat – a memorial dedicated to Mahatma Gandhi – to pay his respects to the leader of Indian independence. He also met with the Indian Minister of External Affairs, Sushma Swaraj.</p><p>Later today, Prime Minister Trudeau will meet with the President of India, Ram Nath Kovind, and the President of the Indian National Congress Party, Rahul Gandhi.</p><h2>Quote</h2><blockquote><p>“It was a pleasure to meet with Prime Minister Modi again. Canada and India share a special friendship, and the agreements that we reached today will grow our middle class, create new opportunities for Canadians and Indians alike, and deepen the bonds that bring our two countries together.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In expanding the Canada-India relationship, we will focus on the following areas:<ul><li>Growth and prosperity, including partnerships to support business development and customs cooperation, and increased partnerships to advance education, research, and innovation;</li><li>Women’s empowerment, specifically women’s social and economic empowerment, gender equality, and health issues such as sexual and reproductive health and rights, water and sanitation, and mental health;</li><li>Security, including increased cooperation in the areas of counter-terrorism and peacekeeping; and</li><li>Sustainable development, specifically increased cooperation in the areas of energy and issues related to the environment and climate change.</li></ul></li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2018/02/23/canada-india-joint-initiatives-and-agreements\">Canada-India joint agreements and initiatives</a></li><li><a href=\"/en/news/backgrounders/2018/02/22/canada-india-memoranda-understanding\">Canada-India Memorandums of Understanding</a></li><li><a href=\"https://www.canada.ca/en/privy-council/services/framework-cooperation-countering-terrorism-violent-extremism.html\">Framework for Cooperation on Countering Terrorism and Violent Extremism</a></li><li><a href=\"/en/news/backgrounders/2018/02/23/india-canada-joint-statement-partnership-security-and-growth\">India-Canada Joint Statement: Partnership for Security and Growth</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/01/22/prime-minister-trudeau-travel-india-state-visit\">Prime Minister Trudeau to travel to India for state visit</a></li><li><a href=\"/en/news/news-releases/2018/02/18/canada-and-india’s-relationship-strengthened-people-people-ties\">Canada and India’s relationship strengthened by people-to-people ties</a></li><li><a href=\"/en/news/news-releases/2018/02/20/prime-minister-announces-new-commercial-partnerships-india-and\">Canada announces new commercial partnerships with India</a></li></ul></div>\n      "
}