{
  "path": "/en/news/news-releases/2018/01/25/prime-minister-announces-funding-global-partnership-education",
  "pageTitle": "Prime Minister announces funding for the Global Partnership for Education | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A more peaceful and prosperous world starts with a quality basic education. That is why the Government of Canada, as part of its Feminist International Assistance Policy, is committed to investing in education around the world, especially for girls.</p><p>Today, at the World Economic Forum’s annual general meeting in Davos, Switzerland, Prime Minister Justin Trudeau announced that the Government of Canada will provide $180 million to the Global Partnership for Education (GPE) for 2018-2020. This pledge, a doubling of Canada’s current annual contribution to the GPE, will provide targeted support for girls’ education and help strengthen education systems in developing countries.</p><p>Canada has been a long standing supporter of the GPE’s development assistance, which helps children – especially the poorest, most vulnerable, and those living in fragile or conflict-affected countries – receive a quality basic education.</p><p>Canada’s investments help establish strong education systems that provide children and youth, particularly girls, with ten years of quality basic education. Our investments also help ensure that youth and adults, especially young women, have the knowledge and skills they need to secure a job and realize their full potential.</p><h2>Quote</h2><blockquote><p>“Canada is committed to making sure young people around the world, especially girls, get the education they deserve. A quality basic education is one of the most important things we can do for children, and the path forward to a more gender equal, peaceful, prosperous world.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>For the 2011-2014 and 2015-2018 periods, Canada’s contribution to the GPE was $57.6 million and $120 million, respectively.</li><li>Canada was a founding member of the GPE’s predecessor, the Education for All - Fast Track Initiative, which built support among G7 donors during Canada’s 2002 Kananaskis Presidency.</li><li>Multilaterally, Canada is the 10th largest bilateral donor to the GPE.</li><li>Sixty-four per cent of the GPE’s partner countries had as many girls as boys completing primary school in 2015.</li><li>With the pledges received during the 2018-2020 period, the GPE aims to help 19 million additional children to complete primary school, including 9.4 million girls and over 10.8 million children in countries affected by fragility or conflict; and, help 6.6 million additional children to complete lower secondary school, including 3.9 million girls and 3.9 million children in countries affected by fragility and conflict.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.globalpartnership.org/\">Global Partnership for Education</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/education.aspx?lang=eng\">Education in developing countries</a></li></ul></div>\n      "
}