{
  "path": "/en/news/news-releases/2020/11/13/helping-canadians-develop-skills-they-need-find-good-jobs",
  "pageTitle": "Helping Canadians develop the skills they need to find good jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Whether in industries shifting services online or small businesses navigating public health guidance, workers across the country have been facing new challenges since the beginning of the global COVID-19 pandemic. To tackle these challenges, Canadians need access to training and employment supports to develop new skills and find good jobs. That’s why the Government of Canada will continue to make investments to strengthen the middle class, create new jobs, and grow the economy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the details of an investment of $1.5 billion in the Workforce Development Agreements (WDAs) with provinces and territories. This investment will help Canadians in underrepresented groups and those in sectors that have been hardest hit by the pandemic – such as construction, transportation, and hospitality – quickly access supports to re-enter the workforce. It could include skills training, on-the-job training, employer-sponsored training, financial assistance and benefits, employment counselling and services, and job opportunities. This funding is in addition to the $3.4 billion provided to provinces and territories in 2020-21 under the WDAs and Labour Market Development Agreements (LMDAs).</p>\n\n<p>Today’s announcement is part of the government’s plan to make the largest investment in Canadian history in training for workers. This will help us reach our goal of creating over one million jobs. Working with the provinces and territories, we will support Canadian workers as they build new skills in growing sectors, help them receive education and accreditation, and connect them to employers and good jobs.</p>\n\n<p>As we work toward our economic recovery from the pandemic, the Government of Canada will continue to support Canadians and help them grow their potential. Together, we can build a stronger workforce and a more competitive and more resilient Canada.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Millions of Canadians have now returned to work after losing their jobs at the start of the pandemic, but there is still much more we can do. By investing in skills training and employment supports, we are investing in our biggest asset – our people. We will keep working with all provinces and territories to get the economy back up and running and Canadians back to work.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Working with our provincial and territorial counterparts, the Government of Canada is getting Canadian workers the training and supports they need to get good jobs as our country cautiously recovers from the impacts of COVID-19. Now more than ever, we need to strengthen workers’ futures and help them succeed as our economy recovers and evolves.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is focused on working closely with territories and provinces and we share the same goal of ensuring Canadians have opportunities for employment.&nbsp;This investment will give provinces and territories the flexibility they need to deliver the right tools for their residents, so they can find good jobs and help safely restart the economy.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>All provinces and territories have accepted the Government of Canada’s offer of additional funding through WDAs. The $1.5&nbsp;billion investment will be allocated as follows (rounded to the nearest million):\n\t<ul>\n\t\t<li>Ontario: $614 million</li>\n\t\t<li>Quebec: $303 million</li>\n\t\t<li>British Columbia: $212 million</li>\n\t\t<li>Alberta: $185 million</li>\n\t\t<li>Manitoba: $47 million</li>\n\t\t<li>Saskatchewan: $42 million</li>\n\t\t<li>Nova Scotia: $37 million</li>\n\t\t<li>New Brunswick: $22 million</li>\n\t\t<li>Newfoundland and Labrador: $19 million</li>\n\t\t<li>Prince Edward Island: $6 million</li>\n\t\t<li>Northwest Territories: $3 million</li>\n\t\t<li>Nunavut: $3 million</li>\n\t\t<li>Yukon: $3 million</li>\n\t</ul>\n\t</li>\n\t<li>Each year, the Government of Canada provides provinces and territories with approximately $3 billion in funding through the WDAs and LMDAs to help Canadians improve their skills, and find and keep good jobs. Budget 2017 provided an additional investment through these agreements of up to $625&nbsp;million annually, between 2017 and 2023.</li>\n\t<li>Under the WDAs and LMDAs, provinces and territories have flexibility to support their individual recovery efforts from the pandemic. For example, the scope of eligible expenses under these agreements has been broadened to include costs associated with online training, new physical distancing requirements, and mental health supports.</li>\n\t<li>The WDAs support the development and delivery of programs and services that help Canadians upgrade their skills, gain work experience, and start their own businesses. These services also support employment counselling and targeted programming for people with disabilities and older workers.</li>\n\t<li>The LMDAs help provinces and territories to support Canadians with Employment Insurance-funded skills training and employment assistance. This support allows workers to quickly find, return to, and keep jobs while ensuring a skilled workforce that meets employers’ current and emerging needs.</li>\n\t<li>Based on the latest job numbers from the Labour Force Survey, Canada’s labour market gained 84,000 jobs in October 2020. The national unemployment rate was 8.9 per cent in October 2020, down slightly from 9 per cent in September&nbsp;2020 and 13.7 per cent in May 2020. Close to 2.4 million Canadians have returned to work since April after they lost their job or stopped working during the pandemic.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/01/prime-minister-announces-infrastructure-plan-create-jobs-and-grow\">Prime Minister announces infrastructure plan to create jobs and grow the economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2020/09/x3.html\">Government of Canada introduces legislation to support Canadians through Recovery Benefits and extend access to funds for emergency measures</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/training-agreements/workforce-development-agreements.html\">Workforce Development Agreements</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/training-agreements/lmda.html\">Labour Market Development Agreements</a></li>\n</ul></div>\n      "
}