{
  "path": "/en/news/statements/2017/10/24/statement-prime-minister-canada-united-nations-day",
  "pageTitle": "Statement by the Prime Minister of Canada on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:</p><p>“Never before has the world been so interconnected. As more and more people are connected, so are the challenges we face. Challenges, such as climate change, do not recognize borders. They threaten all of our futures, no matter where we call home.</p><p>“Since its inception, the United Nations (UN) has played an invaluable role in bringing the international community together to face these challenges, promote peace and human rights, and drive social progress around the world.</p><p>“Canada has a storied past working to make the UN a stronger and more effective institution. Canadian leadership helped draft the Universal Declaration of Human Rights, resolve the Suez Canal crisis, and lay the foundation for peacekeeping missions. As UN peacekeepers, thousands of Canadians have put their lives on the line to protect those most vulnerable.</p><p>“Today, Canada continues to work closely with the UN to meet the challenges of the 21st century. When I addressed the UN General Assembly last month, I made clear that Canada is committed to implementing the Sustainable Development Goals (SDGs) at home and abroad.</p><p>“The achievement of the SDGs hinges on delivering economic growth that benefits everyone, empowering women and achieving gender equality, and taking ambitious action on climate change. We have a responsibility to future generations to not only achieve these goals, but to do so in a way that leaves no one behind.</p><p>“On this day, I invite Canadians to reflect on all that the UN has accomplished for humanity, and celebrate the employees of its many affiliated programmes, funds, and specialized agencies who work tirelessly every day toward a better world.”</p></div>\n      "
}