{
  "path": "/en/news/statements/2021/10/22/statement-prime-minister-anniversary-attack-national-war-memorial-and",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the attack at the National War Memorial and Parliament Hill | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the attack at the National War Memorial and Parliament Hill:</p>\n\n<p>“Seven years ago today, Canadians were left shocked and saddened by a tragic terrorist attack at the National War Memorial and Parliament Hill in Ottawa that claimed the life of Corporal Nathan&nbsp;Cirillo, a sentry at the Tomb of the Unknown Soldier, and injured several others.</p>\n\n<p>“On this sombre anniversary, I join Canadians as we remember Corporal Cirillo, along with Warrant Officer Patrice Vincent who was killed two days earlier in a separate attack in Saint-Jean-sur-Richelieu, Quebec.&nbsp;We offer our deepest sympathies to their families and friends, and to all those affected by these senseless acts of violence.</p>\n\n<p>“Today, we also honour the first responders who courageously risked their lives to protect us on that dark day. We salute the bystanders who rushed to the aid of Corporal Cirillo – the bravery and fortitude they showed during this tragic event truly exemplifies how Canadians are always there to help one another, even in the face of terror.</p>\n\n<p>“As Canadians, we will always stand up against violence and terrorism. We will not let acts of hate instill fear and divide us. Our response to these attacks reminds us of the values that define us – freedom, diversity, and inclusion.</p>\n\n<p>“As we take a moment to pay tribute to these two members of our Canadian Armed Forces, I encourage everyone to give thanks to our brave service men and women – past and present – who continue to defend and protect our communities and our country.”</p></div>\n      "
}