{
  "path": "/en/news/statements/2020/10/03/statement-prime-minister-30th-anniversary-german-reunification",
  "pageTitle": "Statement by the Prime Minister on the 30th anniversary of German reunification | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 30th anniversary of German reunification:</p>\n\n<p>“Today, we join the people of Germany as they celebrate the Day of German Unity and 30 years of German reunification.</p>\n\n<p>“On October 3, 1990, within a year of the fall of the Berlin Wall, East and West Germany were reunified. After decades of division, Germans came together to build a country committed to the values of freedom, democracy, human rights, and the rule of law.</p>\n\n<p>“In the 30 years since, a united Germany has worked to heal wounds left by the Cold War. Reunification drove integration in the country and across Europe, where it led to a greater political, economic, and monetary union within the European Union (EU). Germany championed EU membership for former Communist countries in Central and Eastern Europe, knitting together a continent once separated by the Iron Curtain under the banner of peace. It showed this same leadership in 2015 and 2016, when Germans responded to the humanitarian crisis in Syria by opening their hearts, homes, and communities to over one million people fleeing war and violence.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>“Canada was the first NATO ally to declare support for German reunification, and we have stood with Germany as a close friend and partner ever since. We work closely together in international bodies like the G7, G20, NATO, the Organization for Security and Co-operation in Europe, and the United Nations to strengthen multilateralism, uphold a rules-based international system, and build a more just, peaceful, and secure world.</p>\n\n<p>“On behalf of the Government of Canada, I wish those celebrating a happy Day of German Unity, and invite all Canadians to recognize Germany’s accomplishments over the past 30 years.”</p></div>\n      "
}