{
  "path": "/en/news/news-releases/2018/06/05/prime-minister-names-new-ambassador-climate-change",
  "pageTitle": "Prime Minister names new Ambassador for Climate Change | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada continues to provide international leadership to address climate change, honour its Paris Agreement commitments, and transition to a low-carbon, clean-growth economy. We know our future prosperity and well-being depend on taking ambitious, coordinated action at home and as a global community.</p><p>Today, on <a href=\"http://worldenvironmentday.global/\">World Environment Day</a>, the Prime Minister, Justin Trudeau, announced that Patricia Fuller has been appointed Canada’s new Ambassador for Climate Change, for a term of three years, effective immediately.</p><p>Ms. Fuller will advise both the Minister of the Environment and Climate Change and the Minister of Foreign Affairs on how Canada can best advance its climate change priorities on the world stage and work closely with Canadian missions to put the Government of Canada’s environmental policies into practice. She will reinforce Canada’s work with other countries on innovative climate solutions and promote our clean technology sector to global investors.</p><p>Working together on climate change, oceans, and clean energy is one of the key themes of <a href=\"/en/news/news-releases/2017/12/14/prime-minister-unveils-themes-canada’s-2018-g7-presidency\">Canada’s 2018 G7 Presidency</a>&nbsp;and will be at the centre of the discussions at the G7 Summit from June 8-9, 2018.</p><h2>Quotes</h2><blockquote><p>“Climate change is a global challenge that requires a global solution‎. Everywhere, we are seeing the effects of climate change reminding us of the need to act now. Canada’s new Ambassador for Climate Change, Ms. Fuller, is here to lead Canada’s efforts and work in collaboration with the global community to tackle climate change and promote clean economic growth.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“I’m very pleased to welcome Patricia Fuller as Canada’s new Ambassador for Climate Change. Canada is proud to work with our international partners to advance climate solutions like phasing out coal, reducing risks from extreme weather and climate impacts, and supporting clean solutions and innovation. We’re all in this together, and international collaboration is essential to make sure we are leaving a healthy environment and a strong economy to our kids and grandkids.”<br><cite>—The Hon. Catherine McKenna, Minister of Environment and Climate Change</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Climate Change Ambassador is appointed by the Governor in Council to hold office on a full-time basis for a term of up to three years.</li><li>The Climate Change Ambassador has a key role in government-wide engagement on climate change and in the implementation of Canada’s clean growth and climate change priorities.</li><li>Continued leadership and global cooperation are key to moving forward and meeting the Paris Agreement commitment to limit global temperature increases and to increase the ability to adapt to adverse impacts of climate change. To that effect, in December 2016, Canada released the <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a>&nbsp;to reduce greenhouse gas emissions and enable sustainable economic growth.</li><li>In 2014, Canada's clean and sustainable technology industry employed over 55,600 people in almost 800 technology companies in all regions of the country. Most of these companies are small and medium-sized enterprises. Total revenues from this industry reached nearly $12 billion.</li><li>Canada has committed $2.65 billion to international climate finance to support a wide range of programs and initiatives that will help developing countries mitigate and build resilience to the impacts of climate change, deploy clean energy technology, and manage natural resources sustainably.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/06/05/patricia-fuller\">Patricia Fuller</a></li></ul></div>\n      "
}