{
  "path": "/en/news/news-releases/2020/05/12/prime-minister-announces-additional-support-canadian-seniors",
  "pageTitle": "Prime Minister announces additional support for Canadian seniors | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>No Canadian should have to choose between putting food on the table, filling their prescriptions, or paying their bills. Yet too many seniors are facing significant health, economic, and social challenges due to COVID-19. They helped shape this country, and now they need our help.</p>\n\n<p>Since the start of the COVID-19 pandemic, the Government of Canada has introduced measures to support seniors. We invested $1.3 billion in a one-time special payment through the Goods and Services Tax (GST) credit in April. More than 4 million seniors benefited from this top-up, which gave an average of $375 for single seniors and $510 for senior couples. We also invested in community organizations that provide practical services to Canadian seniors, including the delivery of groceries and medications.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a series of additional measures to help Canadian seniors and provide them with greater financial security in this time of crisis. These measures include:</p>\n\n<ul>\n\t<li>Providing additional financial support of $2.5 billion for a one-time tax-free payment of $300 for seniors eligible for the Old Age Security (OAS) pension, with an additional $200 for seniors eligible for the Guaranteed Income Supplement (GIS). This measure would give a total of $500 to individuals who are eligible to receive both the OAS and the GIS, and will help them cover increased costs caused by COVID-19.</li>\n\t<li>Expanding the New Horizons for Seniors Program with an additional investment of $20 million to support organizations that offer community-based projects that reduce isolation, improve the quality of life of seniors, and help them maintain a social support network.</li>\n\t<li>Temporarily extending GIS and Allowance payments if seniors’ 2019 income information has not been assessed. This will ensure that the most vulnerable seniors continue to receive their benefits when they need them the most. To avoid an interruption in benefits, seniors are encouraged to submit their 2019 income information as soon as possible and no later than by October 1, 2020.</li>\n</ul>\n\n<p>The Government of Canada will continue to monitor and respond to the health, social, and economic impacts of COVID-19. We stand ready to take additional actions as needed to support all Canadians, including seniors, and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As workers, neighbours, parents, grandparents, spouses, caregivers, and volunteers, Canada’s seniors have shaped this country and contribute to our communities every day. They are among the most threatened by COVID-19, and we will support them and work to keep them safe.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Protecting the most vulnerable remains at the core of our response to COVID-19, and seniors are particularly feeling the impacts of the COVID-19 pandemic. Whether it be vulnerability due to physical or mental health, isolation, or simply struggling to get groceries and the supports they need, the measures announced today will help seniors during this difficult period.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Seniors have helped shape the Canada we know and love today. Supporting seniors during this difficult time is essential. With an additional $300 for OAS recipients plus a further $200 for GIS recipients, we are helping Canadian seniors get the support they need during the pandemic.”</p>\n\n<footer class=\"default\">The Hon. Deb Schulte, Minister of Seniors</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>There are currently 6.7 million seniors who are eligible for the OAS pension and 2.2 million who are eligible for the GIS.</li>\n\t<li>The government has taken a number of actions to support seniors through the outbreak of COVID-19, such as:\n\t<ul>\n\t\t<li>Providing a one-time special payment through the GST credit for low- and modest-income families. Close to 85 per cent of single seniors and almost half of senior couples benefited from this payment.</li>\n\t\t<li>Providing seniors flexibility with their Registered Retirement Income Funds, by reducing minimum withdrawals by 25 per cent for 2020. This will help preserve assets during a volatile market.</li>\n\t\t<li>Contributing $9 million through United Way Centraide Canada for local organizations to support practical services to Canadian seniors. These services could include the delivery of groceries, medications, or other needed items, or personal outreach to assess individuals’ needs and connect them to community supports.</li>\n\t\t<li>Investing $100 million to improve access to food for Canadians, including seniors, facing social, economic, and health impacts of the COVID-19 pandemic.</li>\n\t\t<li>Creating a $350 million Emergency Community Support Fund to support charities and non-profit organizations to adapt the services they provide to vulnerable groups, including seniors, in response to COVID-19.</li>\n\t\t<li>Introducing the Canada Emergency Response Benefit (CERB), a taxable benefit of $2,000 every 4 weeks for up to 16 weeks to eligible workers, including seniors, who have lost their income due to COVID-19. Pension income does not affect eligibility to the CERB. The government also extended the eligibility of this benefit to individuals who earn up to $1,000 per month, as well as workers who have recently exhausted their EI regular benefits and are unable to find a job or return to work because of COVID-19.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/new-horizons-seniors.html\">New Horizons for Seniors Program</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/03/prime-minister-announces-virtual-care-and-mental-health-tools\">Prime Minister announces virtual care and mental health tools for Canadians</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need\">Prime Minister announces further support to help Canadians in need</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID-19</a></li>\n</ul></div>\n      "
}