{
  "path": "/en/news/statements/2018/05/03/canada-portugal-statement-enhanced-cooperation",
  "pageTitle": "Canada-Portugal Statement on Enhanced Cooperation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>On May 13, 1953, a group of Portuguese immigrants aboard the ocean liner <i>Saturnia</i> arrived at Pier 21 in Halifax, marking the beginning of a large-scale wave of immigration from Portugal to Canada. On the 65th anniversary of this event, Canada and Portugal affirm their shared histories and common values of freedom, democracy, human rights and the rule of law. Both countries also share a strong commitment to creating economic growth that works for everyone, building a safer and more peaceful world, defending the international rules-based order, and advancing sustainable development and prosperity, as well as the full and timely implementation of the Paris Agreement on Climate Change.</p><p>As practical, tangible examples of enhanced engagement and collaboration between Canada and Portugal, Prime Minister Justin Trudeau and Prime Minister António Costa are pleased to highlight today three new and impending agreements:</p><ul><li>A new arrangement on youth mobility, signed today, will open further channels of exchange between Canadian and Portuguese young people</li><li>A memorandum of understanding on aeronautical search and rescue operations will be finalized and signed in the coming months to build upon existing defence relations.</li><li>A modernized agreement on social security will be finalized and signed at the earliest opportunity to continue to ensure income security protection and promote trade and investment.</li></ul><p>The two prime ministers also commit to deepening collaboration in such areas as peace and security, trade, oceans, gender equality and human rights, and people-to-people ties.</p><h2>Peace and Security</h2><p>In their efforts to build a safer and more peaceful world, Canada and Portugal remain fully engaged in strengthening democracy and the respect for human rights, a common commitment to peacekeeping, including in the United Nations Multidimensional Integrated Stabilization Mission in Mali (MINUSMA), promoting peace, stabilization and conflict prevention, the protection of women and children in armed conflict and the empowerment of women and girls in conflict-affected states, strengthening cooperation on global refugee issues, promoting safe, orderly and regular migration, combatting terrorism, and preventing and countering radicalization and violent extremism. Canada and Portugal are fully committed to integrating gender perspectives into all of these peace and security efforts.</p><p>Canada and Portugal emphasize the vital importance of the United Nations (UN) for maintaining a rules-based international order and serving as a key global forum for advancing international peace and security. Both countries reiterate their full support for the UN Secretary General’s efforts to increase the effectiveness of the organization and to achieve reform that enables it to better address today’s complex challenges in a comprehensive manner.</p><p>As founding members of the North Atlantic Treaty Organization (NATO), a cornerstone of the wider transatlantic partnership, Canada and Portugal reaffirm their commitment to NATO in order to bolster international security and build a more peaceful and secure world.In addition to the planned memorandum of understanding on aeronautical search and rescue operations, both countries will explore enhanced defence cooperation, including on material collaboration.</p><h2>Trade</h2><p>Prime Minister Trudeau and Prime Minister Costa express their commitment to work together to realize the full potential of their bilateral trade and investment relationship. They welcome the provisional application of the Comprehensive Economic and Trade Agreement (CETA) between Canada and the EU last September. This historic agreement offers many new opportunities for good, well-paying jobs, reinvigorated and diversified trade and investment in numerous areas. CETA will generate growth on both sides of the Atlantic through increased trade and investment, in particular for start-up companies and in the areas of information and communication technology , agriculture, cleantech and renewable energy, and aeronautical industries.</p><h2>Oceans</h2><p>As maritime countries that share the Atlantic Ocean as a fundamental and formative element of their identities, Canada and Portugal will continue to prioritize oceans-related cooperation, such as protecting our oceans for use today and for future generations. This will be done through further cooperation in forums such as the Canada-Portugal Committee on Fisheries Cooperation and under the framework of the 2013 Galway Statement on Atlantic Ocean Cooperation. Prime Minister Trudeau and Prime Minister Costa are pleased that cooperation in the promising field of ocean technologies has allowed Canadian and Portuguese academic institutions to access European and Canadian research and innovation funding.</p><h2>Gender Equality and Human Rights</h2><p>Both countries believe that gender equality, the empowerment of women and girls and the realization of their human rights, are critical to building peace, reducing poverty, growing our economies, and achieving sustainability. The prime ministers note that one important avenue for achieving these objectives is through Canada and Portugal’s national action plans for the implementation of the UN Security Council Resolution 1325 and its supporting resolutions, which form the women, peace and security agenda. Canada and Portugal will continue to cooperate closely in international human rights forums to promote and protect the universal realization of human rights.</p><h2>People-to-people ties</h2><p>Canada and Portugal cherish the presence of a vast Luso Canadian community in Canada, which has a deep connection with the Portuguese Republic. United by the Atlantic and by the people that have crossed it through the centuries, both prime ministers recognize the valuable contributions of the Portuguese-Canadian community to building a prosperous and diverse Canada, and salute its significant role in the political, cultural, social, and economic fabric of Canada.</p><h2>Related Product</h2><ul><li><a href=\"/en/news/news-releases/2018/05/03/prime-minister-announces-closer-collaboration-portugal\">Prime Minister announces closer collaboration with Portugal</a></li></ul></div>\n      "
}