{
  "path": "/en/news/news-releases/2019/05/22/prime-minister-announces-renewal-canadian-coast-guard-fleet",
  "pageTitle": "Prime Minister announces renewal of Canadian Coast Guard fleet | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Canadian Coast Guard saves lives, protects the environment, and helps our economy grow, while keeping our waters safe, secure, and open. But the Coast Guard fleet is aging, with most ships beyond their normal life expectancy. There is an urgent need to renew the fleet to ensure the Coast Guard can continue its essential and, often, life-saving work. &nbsp;</p>\n\n<p>The Coast Guard fleet is supported by Canada’s shipbuilding and marine industry, which fuels innovation and skills development, and creates new opportunities for Canadian workers and businesses across the country. The Government of Canada is revitalizing the industry, creating middle class jobs, and ensuring that Canada’s marine services have the modern ships they need to fulfill their missions.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a renewal of the Canadian Coast Guard fleet. As a first step, this renewal will provide up to 18 new large ships built in Canadian shipyards, helping the Coast Guard continue to deliver its important services, and creating good, middle class jobs across the country.</p>\n\n<p>Canada’s two partners under the National Shipbuilding Strategy (NSS) for large ship construction – Seaspan’s Vancouver Shipyards and Irving Shipbuilding of Halifax – will build the new ships to deliver missions including light icebreaking and offshore patrol and search and rescue. The Government of Canada is also investing in vessel life extensions, refits, and maintenance work at shipyards throughout Canada so that the current Coast Guard fleet can continue to deliver critical missions while the new ships are being built.</p>\n\n<p>Even with investments in maintenance, Coast Guard ships will eventually reach the end of their service lives, and more ships will be needed to renew the Coast Guard fleet. To support future shipbuilding needs and attract more talent and good jobs to our communities, the Government of Canada intends to add a third Canadian shipyard as a partner under the NSS. The Government of Canada will move forward with a competitive process to select the third shipyard in the coming months.</p>\n\n<p>The Government of Canada is working closely with our shipyards to strengthen our marine industry, and create new jobs and business opportunities across the country.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“By renewing the Coast Guard fleet, we’re making sure our Coast Guard has the ships they need to carry out their important work for the entire country in the years to come. Today’s announcement goes far beyond one shipyard, one industry, or one part of the country. We’re re-invigorating Canada’s world-class marine industry, supporting technological innovation, and creating good, middle class jobs from coast to coast to coast. We’re building a fleet for the future, today.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canadian Coast Guard saves lives at sea, maintains safe shipping, enables an otherwise ice choked economy, protects the marine environment and supports Canadian sovereignty and security. With increasing shipping trade and the impacts of climate change already upon us, demands on Canada’s Coast Guard will continue to grow. A renewed Coast Guard fleet ensures the confidence of Canadians – and the confidence of industries that rely on Coast Guard services to remain competitive.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<blockquote>\n<p>“The National Shipbuilding Strategy is the right approach to ensure our Coast Guard, Navy, and marine activities are supported by modern vessels. In addition to adapting to meet evolving federal shipbuilding requirements, the Strategy is creating jobs, generating benefits and prosperity in communities across Canada, and supporting a sustainable marine sector. We remain firmly committed to the National Shipbuilding Strategy, and will continue to work closely with our shipbuilding partners to continue its success into the future.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Public Services and Procurement and Accessibility</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Canadian Coast Guard delivers a number of services, including: search and rescue, environmental response, ice breaking, ocean science, and maintaining a massive navigation and communication system.</li>\n\t<li>Demands on the Coast Guard will only grow as the impacts of climate change, like extreme weather and natural disasters, become more frequent and intense.</li>\n\t<li>Total funding for the 18 large ships is $15.7 billion, which represents early estimates of project budgets including construction, logistics and support, contingency, project management and infrastructure costs.&nbsp;The costs of each ship will be announced following contract negotiations.</li>\n\t<li>The Government of Canada is investing in two new Arctic and Offshore Patrol Ships, which will be adapted for the Coast Guard to perform tasks including offshore patrols. These ships will be built by Irving Shipbuilding in Halifax.</li>\n\t<li>The Government of Canada is investing in up to 16 Multi-Purpose Vessels to support a variety of missions, including light icebreaking, environmental response, and offshore search and rescue. These ships will be built by Vancouver Shipyards.</li>\n\t<li>The Government of Canada will also proceed through a competitive process with the design of a new class of smaller ships, the new Mid-Shore Multi-Mission Ship, which would complement the work of the large fleet in shallow areas and deliver mid-shore science activities.</li>\n\t<li>Repairs, refits, and vessel life extension work will be carried out on the existing fleet until the new ships are delivered, with over $2 billion to be invested on a competitive basis for this purpose.</li>\n\t<li>In addition to funding for shipbuilding, the Government of Canada is also providing over $351 million to support ongoing Canadian Coast Guard capacity enhancements such as strengthening management oversight and promoting innovation and greener practices.</li>\n\t<li>The NSS is Canada’s long-term plan to renew the fleets of the Royal Canadian Navy and the Canadian Coast Guard. It aims to deliver vessels to these organizations, create jobs and generate economic growth for Canada, and build a sustainable Canadian marine sector.</li>\n\t<li>In 2018, the Government of Canada awarded approximately $1.8 billion in new contracts to Canadian companies under the NSS. Of that amount, more than $173 million went to small businesses with fewer than 250 full-time employees.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.tpsgc-pwgsc.gc.ca/app-acq/amd-dp/mer-sea/sncn-nss/index-eng.html\">National Shipbuilding Strategy</a></li>\n</ul></div>\n      "
}