{
  "path": "/en/news/news-releases/2015/11/13/prime-minister-canada-makes-ministerial-mandate-letters-public",
  "pageTitle": "Prime Minister of Canada makes ministerial mandate letters public | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau took the unprecedented step of publicly releasing all ministerial mandate letters, as part of his plan for open and transparent government for Canadians.</p>\n<p>The <a href=\"/en/ministerial-mandate-letters\">ministerial mandate letters</a> highlight the government’s commitment to invest in jobs and growth for the middle class and those working hard to join it. They outline the government’s strong, ambitious, and progressive vision that will deliver real change and shared prosperity. The mandate letters also provide a framework for what Ministers are expected to accomplish, including specific policy objectives and challenges to be addressed.</p>\n<p>Canadians expect their government to pursue its goals and objectives with a renewed sense of collaboration. That is why the Prime Minister commits in these letters to ongoing partnerships with provincial, territorial, and municipal governments. Ministers are similarly expected to meaningfully engage with Parliament, Indigenous Peoples, and the public service.</p>\n<p>This initiative today by the Prime Minister sets a historic precedent for openness and transparency, which Canadians expect from their government.</p>\n<p><strong>Quotes</strong></p>\n<p>“Today we are demonstrating that real change in government is possible. For the first time in our country’s history, we are making these letters public, so Canadians can hold us accountable to deliver on our commitments. We are ushering in a new era of openness and transparency in Canada.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Real, positive change means new leadership and transparent government for Canadians. Our Ministers are being encouraged in their mandate letters to consult closely as a team, to listen, and to carefully consider the expert advice of public servants. I am confident such measures will lead to better decision-making and results for Canadians.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>There are a total of 30 letters, one for each Cabinet Minister.</li>\n<li>Mandate letters provide Ministers with the Prime Minister’s expectations of approach and priorities. They are not intended to be an exhaustive list of all the files a Minister needs to work on.</li>\n</ul></div>\n      "
}