{
  "path": "/en/news/news-releases/2019/12/10/canada-signs-agreement-amendments-new-nafta",
  "pageTitle": "Canada signs agreement on amendments to the new NAFTA | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to further strengthening the Canadian economy, improving the lives of Canadian families, the middle class and those working hard to join it.</p>\n\n<p>Today, the Honourable Chrystia Freeland, Deputy Prime Minister, signed on behalf of the Government of Canada an agreement on amendments to the new North American Free Trade Agreement (NAFTA). Since the beginning of negotiations, the Government of Canada has consistently stood up for Canadian jobs and interests, and worked hard to ensure that the new NAFTA is a progressive trade agreement.</p>\n\n<p>The amendments involve improvements to the new NAFTA signed by Canada, the United States, and Mexico on November 30, 2018, in the areas of:</p>\n\n<ul>\n\t<li>state-to-state dispute settlement</li>\n\t<li>labour protection</li>\n\t<li>environmental protection</li>\n\t<li>intellectual property</li>\n\t<li>automotive rules of origin</li>\n</ul>\n\n<p>Canada’s focus has always been on what really matters: this agreement preserves jobs, fosters growth and supports hardworking Canadians. These improved outcomes make the deal more progressive, will further strengthen the trilateral economic relationship, and support the efforts of each of the three countries toward ratification and implementation of the new NAFTA.</p>\n\n<p>Canada remains committed to working closely with the United States and Mexico to ratify and implement the new NAFTA, and to supporting Mexico’s historic labour reform efforts.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am delighted that Canada, the United States, and Mexico have today taken an important step towards ratification of the new NAFTA. This is a progressive trade agreement that will be profoundly beneficial for our economy, for Canadian families, and for the middle class. It is excellent for hundreds of thousands of Canadian workers.”</p>\n\n<p><em>—</em>The Hon.&nbsp;Chrystia Freeland, Deputy Prime Minister</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>North America is home to nearly 490 million people.</li>\n\t<li>The United States and Mexico are, respectively, Canada’s first- and third-largest merchandise trading partners in the world.</li>\n\t<li>Canada is respectively the second- and third-largest merchandise trading partner of the United States and Mexico, and the largest export market for the United States.</li>\n\t<li>In 2018, trilateral merchandise trade reached nearly USD $1.2 trillion – a four-fold increase since 1993.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">The new NAFTA</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/summary_outcomes-resume_resultats.aspx?lang=eng\">Backgrounder: Summary of outcomes</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/index.aspx?lang=eng\">Canada and the United States</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada and Mexico </a></li>\n</ul></div>\n      "
}