{
  "path": "/en/news/itineraries/2017/05/16/itinerary-wednesday-may-17-2017",
  "pageTitle": "Itinerary for Wednesday, May 17, 2017 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Itinerary for the Prime Minister, Justin Trudeau, for Wednesday, May 17, 2017:</p><p><b>Montréal, Quebec</b></p><p><strong>7:45 a.m.</strong> The Prime Minister and Ms. Grégoire Trudeau will be greeted at Montréal City Hall by the Mayor of Montréal, Denis Coderre, prior to a mass celebrating the 375<sup>th</sup>&nbsp;anniversary of the founding of Montréal.</p><p>Montréal City Hall<br>275 Notre-Dame Street East<br>Montréal, Quebec</p><p><b>Notes for media:</b></p><ul><li>Open coverage of arrival</li><li>Media should arrive no later than 7:15 a.m.</li></ul><p><strong>8:30 a.m.</strong> The Prime Minister and Ms. Grégoire Trudeau, accompanied by the Premier of Quebec, Philippe Couillard, Mayor Coderre and his spouse, Ms. Chantale Renaud, will depart City Hall for Notre-Dame Basilica by foot.</p><p>Main steps<br>Montréal City Hall<br>275 Notre-Dame Street East<br>Montréal, Quebec</p><p><b>Note for media:</b></p><ul><li>Open coverage</li></ul><p><strong>8:45 a.m.</strong> The Prime Minister, Ms. Grégoire Trudeau, the Premier of Quebec, Mayor Coderre and his spouse, Ms. Chantale Renaud, will be greeted by Mgr Christian Lépine, Archbishop of Montréal, at Notre-Dame Basilica.</p><p>Notre-Dame Basilica<br>110 Notre-Dame Street West<br>Montréal, Quebec</p><p><b>Note for media:</b></p><ul><li>Open coverage</li></ul><p><strong>9:00 a.m.</strong> The Prime Minister and Ms. Grégoire Trudeau will attend a mass marking the 375th anniversary of the founding of Montréal. The Prime Minister will deliver remarks.</p><p>Notre-Dame Basilica<br>110 Notre-Dame Street West<br>Montréal, Quebec</p><p><b>Notes for media:</b></p><ul><li>Pooled camera and photography coverage</li><li>Open coverage for journalists</li></ul><p><strong>10:30 a.m.</strong> The Prime Minister and Ms. Grégoire Trudeau will attend a&nbsp;ceremony commemorating the founders of Montréal. The Prime Minister will deliver remarks.</p><p>Place d’Armes<br>Montréal, Quebec</p><p><b>Note for media:</b></p><ul><li>Open coverage</li></ul><p><strong>12:00 p.m.</strong> The Prime Minister will depart for Redmond, Washington, United States of America.</p><p><b><br>Redmond, Washington, United States of America</b></p><p><strong>3:00 p.m.</strong> The Prime Minister will attend the Microsoft CEO Summit at the Microsoft Redmond campus.</p><p>Closed to media</p><p><strong>4:30 p.m.</strong> The Prime Minister will address the Microsoft CEO Summit at the Microsoft Redmond campus.</p><p>Closed to media.</p><p><strong><br>Media appearances</strong></p><p>A radio interview with the Prime Minister for <i>Le 15-18</i> with Annie Desrochers will air on Radio-Canada Première Montréal at 4:15 p.m. ET.<br>An interview with the Prime Minister for TVA will air throughout the day.</p><p><br>Note: all times local</p></div>\n      "
}