{
  "path": "/en/news/readouts/2020/02/18/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier John Horgan to discuss the impact of infrastructure disruptions caused by blockades across Canada.</p>\n\n<p>Prime Minister Trudeau and Premier Horgan reiterated their commitment to work closely together toward a resolution. They indicated that Minister of Crown-Indigenous Relations Carolyn Bennett and British Columbia Minister of Indigenous Relations and Reconciliation Scott Fraser are willing to meet with the Gitxsan Simgyget, the Wet’suwet’en Dini Ze’ and the Ts’ake ze at the earliest opportunity to engage in direct dialogue.</p>\n\n<p>The Prime Minister and the Premier agreed on the importance of resolving the infrastructure disruptions caused by blockades quickly and peacefully, and of continuing to address underlying issues in the spirit of reconciliation. Prime Minister Trudeau thanked Premier Horgan for his continued cooperation.</p>\n\n<p>This call builds on the Prime Minister's continued outreach to premiers across the country, where he is stressing the need for all orders of governments to be engaged to minimize the very real economic and personal impacts on Canadians across the country. The Prime Minister and ministers will continue to reach out to premiers and Indigenous leaders to bring this situation to a resolution as soon as possible.</p>\n\n<h2>Associated link:</h2>\n\n<ul>\n\t<li><a href=\"/en/news/readouts/2020/02/17/prime-minister-justin-trudeau-convenes-incident-response-group-address\">Prime Minister Justin Trudeau convenes the Incident Response Group to address infrastructure disruptions caused by blockades across Canada</a></li>\n</ul></div>\n      "
}