{
  "path": "/en/news/news-releases/2016/09/01/prime-minister-deepens-understanding-and-ties-between-canada-and",
  "pageTitle": "Prime Minister deepens understanding and ties between Canada and China during first days of his official visit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today successfully concluded the Beijing portion of his first official visit to China.</p>\n<p>The Government of Canada has made it a top priority to create a stronger, more stable and long-term relationship with China.</p>\n<p>In discussions with Chinese President Xi Jinping and Premier Li Keqiang, the Prime Minister explored ways to deepen the mutual understanding between both countries, increase connections between Canadian and Chinese communities, bolster our shared prosperity, and grow Canada’s middle class.</p>\n<p>Following successful meetings, the two countries announced several significant new initiatives spanning culture, tourism, environmental cooperation, trade and investment, and the rule of law.</p>\n<p>In keeping with the importance of renewing Canada-China relations, both countries agreed to hold an annual Leaders’ dialogue through which a broad range of issues, including sensitive topics, will be discussed on the basis of mutual respect. Prime Minister Trudeau and President Xi also agreed to work collaboratively to ensure a successful G20 Leaders’ Summit in Hangzhou, China, later in the week.</p>\n<p>A stronger Canada-China relationship will unlock the untapped potential in our two countries’ commercial ties, grow our middle class, and create new opportunities for Canadian businesses.</p>\n<p><strong>Quote</strong></p>\n<p>“When I met with political and business leaders in Beijing, I was received with a great deal of warmth and respect. I look forward to addressing all topics of interest – including good governance and the rule of law – as we pursue more regular and frank dialogue. I am encouraged by the discussions today, and know that they will go a long way in deepening understanding between our two countries and increasing opportunities for our middle class. I also made it clear to the leaders I met that Canada wants to increase engagement with a peaceful, stable, and prosperous China.”<br><em>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Discussions with Chinese leaders focussed on bilateral trade and investment, including in the areas of clean energy development and clean technology; closer collaboration on the environment; regional peace and security; building closer ties between Canadian and Chinese citizens; expanding tourism; and, good governance and the rule of law.</li>\n<li>While in Beijing, the Prime Minister also met with senior business leaders from the China Entrepreneur Club to promote investment into Canada.</li>\n<li>In addition to Beijing, the Prime Minister will travel to Shanghai, Hangzhou, and Hong Kong as part of his official visit to China.</li>\n<li>Minister of Foreign Affairs, the Honourable Stéphane Dion, Minister of International Trade, the Honourable Chrystia Freeland, and Minister of Finance, the Honourable Bill Morneau, accompanied Prime Minister Trudeau to China as part of the Canadian delegation.</li>\n<li>China is the world's second largest economy, and Canada's second-largest single-country trading partner.</li>\n<li>Canadians of Chinese descent make up approximately 4.5 per cent of Canada's population.</li>\n</ul>\n<p><strong><br>Associated Link</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/09/01/joint-press-release-between-canada-and-people’s-republic-china\">Joint Press Release between Canada and the People’s Republic of China</a></li>\n</ul></div>\n      "
}