{
  "path": "/en/news/news-releases/2018/05/10/alcoa-and-rio-tinto-announce-worlds-first-carbon-free-aluminum",
  "pageTitle": "Alcoa and Rio Tinto announce world’s first carbon-free aluminum smelting process | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2><em>$558 million investment project will create and maintain thousands of jobs in Canada</em></h2><p>Global aluminum industry leaders Alcoa Corporation and Rio Tinto Aluminum today announced a revolutionary process to make aluminum that produces oxygen and eliminates all greenhouse gas emissions from the traditional smelting process.</p><p>The announcement signals the most significant innovation in the aluminum industry in more than a century, and marks a decisive step forward in the fight against climate change.</p><p>To advance the larger scale development and commercialization of the new process, Alcoa and Rio Tinto have formed a joint venture, Elysis. The new joint venture will pursue a $558 million two-phased project.</p><p>The Prime Minister, Justin Trudeau, announced an investment of $60 million in support of Elysis. The Premier of Quebec, Philippe Couillard, announced that the Government of Quebec will contribute a matching investment, and become a limited partner in the company. Apple will also provide an investment of $13 million to the first phase of the project, and has agreed to provide technical support to Elysis.</p><p>This new company, which will be headquartered in Quebec, will directly employ 100 people, and has the potential to create more than 1,000 jobs by 2030, while securing 10,500 existing aluminum jobs in Canada.</p><p>Elysis will further develop the technology so it can be licensed for retrofit at existing smelters or used to design and build new facilities. Development to commercialize the process will take place in the Saguenay–Lac-Saint-Jean region of Quebec, where Elysis will establish a world-class facility.</p><p>Once fully developed and implemented, the ground-breaking technology will virtually eliminate the Canadian aluminum industry’s carbon footprint, and help strengthen the already well-integrated Canada-United States aluminum and manufacturing industry.</p><p>The technology has the potential to significantly reduce the country’s carbon footprint over the next decade, helping Canada reach its commitments under the Paris Agreement.</p><h2>Quotes</h2><blockquote><p>“Today’s announcement will create and maintain thousands of jobs for Canadians, significantly reduce Canada’s carbon footprint, and further strengthen the aluminum industry in North America. It is a truly historic day for the aluminum industry – and for all Canadian aluminum workers – who play such an important role in our economy and our country’s future.”<br>— <cite>The Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The aluminum industry is part of the DNA of Saguenay–Lac-Saint-Jean and all of Québec. It is why our government decided to become a partner in one of the most innovative and unique projects in the world. Throughout the project Québec expertise, knowhow and talent will shine here and throughout the world. Additionally, we have set ambitious targets in our Québec strategy to develop the aluminum sector in order to stimulate industrial expansion and strengthen its competitiveness in the world market. Together, we have provided the means to be hopeful for the future. Together, we are building a new Québec that is more prosperous, knowledgeable, equitable, green and mobile.”<br>— <cite>Philippe Couillard, Premier of Québec, Minister Responsible for the Saguenay–Lac-Saint-Jean Region, and Member of the National Assembly for Roberval</cite></p></blockquote><blockquote><p>“This discovery has been long sought in the aluminum industry, and this announcement is the culmination of the work from many dedicated Alcoa employees. Today, our history of innovation continues as we take aluminum’s sustainable advantage to a new level with the potential to improve the carbon footprint of a range of products from cars to consumer electronics.”<br>— <cite>Roy Harvey, Alcoa President and CEO</cite></p></blockquote><blockquote><p>“This is a revolutionary smelting process that can deliver a significant reduction in carbon emissions. It builds on the key role aluminum has to play in driving human progress, by making products infinitely recyclable, stronger, lighter and more fuel efficient. Rio Tinto is proud to work with Alcoa, Apple and the governments of Canada and Quebec, to drive an innovation that can transform the industry and our customers’ supply chains.”<br>— <cite>J-S Jacques, Rio Tinto Chief Executive</cite></p></blockquote><blockquote><p>“Apple is committed to advancing technologies that are good for the planet and help protect it for generations to come. We are proud to be part of this ambitious new project, and look forward to one day being able to use aluminum produced without direct greenhouse gas emissions in the manufacturing of our products.”<br>— <cite>Tim Cook, Apple CEO</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Elysis will directly employ 100 people, including in research and development, management and sales.</li><li>At the facility in Quebec, employees will work on the commercialization of the first ever zero-carbon aluminum smelting technology in the world – a testament to Canadian ingenuity and Canada’s commitment to developing green technologies that drive sustainable and responsible economic growth.</li><li>The technology has the potential to reduce annual greenhouse gas emissions by approximately 6.5 million metric tonnes in Canada, the equivalent of taking 1.8 million light vehicles off the road. It also can reduce production costs and improve productivity.</li><li>Apple is providing an investment of $13 million to the first phase of the project. The company helped facilitate the collaboration between Alcoa and Rio Tinto on the carbon-free smelting process, and has agreed to provide technical support to the joint venture partners.</li><li>Vincent Christ, an experienced leader with over 30 years’ experience at Rio Tinto, has been named Chief Executive Officer of Elysis.</li><li>Alcoa developed the patent-protected technology and is currently producing metal at the Alcoa Technical Center, outside Pittsburgh in the United States, where the process has been operating at different scales since 2009.</li><li>Elysis will license the technology and sell proprietary anode and cathode materials, which will last more than 30 times longer than traditional components.</li><li>The aluminum industry contributes $4.6 billion to Canada’s gross domestic product, and the industry exports $9.5 billion annually to the United States.</li><li>The Government of Canada’s investment comes from the Strategic Innovation Fund, a $1.26 billion program a program designed to attract and support high-quality business investments in Canada, grow the economy, and expand the role of Canadian firms in regional and global supply chains.</li><li>In addition to the Strategic Innovation Fund, the Government of Canada continues to invest in key programs and services to help businesses innovate, create jobs and grow Canada’s economy.</li></ul><h2>Associated Link</h2><ul><li>&nbsp;<a href=\"https://www.canada.ca/en/innovation-science-economic-development/programs/strategic-innovation-fund.html\">Strategic Innovation Fund</a></li></ul></div>\n      "
}