{
  "path": "/en/news/news-releases/2020/02/11/promoting-security-and-stability-prime-minister-visits-kuwait-and",
  "pageTitle": "Promoting security and stability: Prime Minister visits Kuwait and meets with members of the Canadian Armed Forces | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Kuwait, where he visited Canadian Armed Forces (CAF) members currently deployed to Kuwait, and met with Emir Sheikh Sabah Al-Ahmad AI-Jaber AI-Sabah.</p>\n\n<p>The Prime Minister, joined by the Chief of the Defence Staff, General Jonathan Vance, thanked the CAF members for their dedication and service to our country. The members are serving an important role on Operation IMPACT, part of Canada’s efforts to promote security and stability in the region.</p>\n\n<p>Prime Minister Trudeau and General Vance received an update on the status of the mission, and the impact of regional tensions on operations from the Commander of Operation IMPACT and Brigadier-General Michel-Henri St-Louis. They also discussed how best to continue supporting the Iraqi government train and professionalize its security forces.</p>\n\n<p>Under Operation IMPACT, the CAF provide training, advice, and assistance to the Iraqi security forces. They also provide capacity building capabilities to regional forces, conduct air operations, and support the Global Coalition with highly skilled personnel. There are up to 850 members deployed in four countries – Iraq, Jordan, Lebanon, and Kuwait.</p>\n\n<p>During the visit, the Prime Minister met with Emir Sheikh Sabah Al-Ahmad Al-Jaber Al-Sabah. He expressed his appreciation for the country hosting CAF members, and its continued support in the Global Coalition’s fight to degrade and ultimately defeat Daesh.</p>\n\n<p>In addition, he met with Prime Minister Sheikh Sabah Khalid Al-Hamad Al-Sabah, to discuss regional security issues and find new opportunities for increased collaboration on shared priorities in areas such as trade and investment, security, and human rights.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“It was an honour to meet with the women and men of the Canadian Armed Forces who are deployed in Kuwait, and to see firsthand the important work they are doing in the region. I thanked them on behalf of all Canadians for their service and for making our world more safe and secure. I look forward to continuing to work closely with the Kuwaiti leadership, to address the issues that matter most to Canadians and Kuwaitis. Together, we can chart a path forward that benefits the people and businesses at the heart of our prosperity.”&nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada established diplomatic relations with Kuwait in 1965, and our two countries share common views and interests in several areas, including peace and security, humanitarian affairs, trade and investment, and people-to-people ties.</li>\n\t<li>In 2018, Canadian merchandise exports to Kuwait reached a total of $200.9 million, while imports from Kuwait totaled $39.1 million.</li>\n\t<li>Today, more than 6,000 Canadians live in Kuwait and are employed in key areas such as the oil industry, academic institutions, government, health, financial services and engineering.</li>\n\t<li>Since 2011, Kuwait has hosted Canadian Armed Forces members who provide support for operations in the region. These operations include support of the Global Coalition’s efforts to dismantle and ultimately defeat Daesh, and work to counter violent extremism, restore stability, and promote regional security.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/02/11/canadian-armed-forces-operation-impact\">Canadian Armed Forces – Operation IMPACT</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kuwait-koweit/bilateral_relations_bilaterales/canada-kuwait.aspx?lang=eng&amp;_ga=2.258189514.194358354.1580772104-212419443.1569709158\">Canada – Kuwait relations </a>&nbsp;</li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-impact.html\">Operation IMPACT</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/mena-moan/strategy-strategie.aspx?lang=eng#a3\">Canada's Middle East engagement strategy</a></li>\n</ul></div>\n      "
}