{
  "path": "/en/news/news-releases/2020/03/31/prime-minister-announces-special-advisor-canadas-ongoing-response",
  "pageTitle": "The Prime Minister announces Special Advisor for Canada’s ongoing response to the Ukraine International Airlines tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>On January 8, Ukraine International Airlines Flight PS752 was shot down near Tehran by an Iranian surface-to-air missile, killing 176 people, including 55 Canadian citizens and 30 permanent residents.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Ralph Goodale as his Special Advisor for the Government of Canada’s ongoing response to the Ukraine International Airlines Flight PS752 tragedy.</p>\n\n<p>As Special Advisor, Mr. Goodale will examine lessons learned from the Ukraine International Airlines Flight PS752 and other air disasters, including Ethiopian Airlines Flight 302 and Air India Flight 182. He will develop a framework to guide Canada’s responses to international air disasters and provide recommendations on best practices, including advice on tools and mechanisms needed to prevent future events. He will support the Minister of Foreign Affairs and the Minister of Transport in this work.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p><strong>“</strong>The Ukraine International Airlines tragedy should never have occurred, and the families and loved ones of the victims deserve to know how and why it happened. While we work to get them the accountability, justice, and closure they deserve, we also need to develop a strategy on how to best respond to international air disasters. I am confident that Ralph Goodale has the experience to help us identify best practices, and support efforts to ensure that families are properly compensated. I also want to take this opportunity to thank Parliamentary Secretary Omar Alghabra for all his ongoing work on this.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The tragic downing of Ukraine International Airlines Flight PS752 demonstrated the importance of international collaboration and cooperation in the wake of international aviation tragedies. Through chairing the International Coordination and Response Group, Canada has demonstrated leadership in working together with the international community to ensure justice for the families of the victims. In the coming months, I will work with Ralph Goodale to identify other best practices and lessons from this tragedy to prevent such tragedies in the future.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada continues to grieve those who were lost in the Ukraine International Airlines Flight PS752 tragedy. Since this tragic event, Canada has led the efforts to create a framework of cooperation with other states whose passengers also perished, to provide closure, accountability, transparency, and justice for the families of the victims. Through our Safer Skies initiative, we are also looking toward a better future, where the international community can learn from this tragedy, so as to minimize the risk of accidents of this nature ever happening again.”</p>\n\n<footer class=\"default\">The Hon. Marc Garneau, Minister of Transport</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada, Ukraine, Sweden, Afghanistan and the United Kingdom have formed the International Coordination and Response Group to support families of victims of the Ukraine International Airlines Flight PS752 tragedy. The Group aims to ensure a full and transparent investigation into the causes of the fatal crash so that families and loved ones can get the answers they deserve.</li>\n</ul>\n\n<ul>\n\t<li>At the Munich Security Conference in February 2020, the Prime Minister announced that Canada is leading the development of a global Safer Skies Strategy, which will bring together partners to establish a common set of practices to better protect passengers from the risk of flying in or near foreign conflict zones.</li>\n</ul>\n\n<h2>Biographical note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/03/31/honourable-ralph-goodale\">Ralph Goodale</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/flight-vol-ps752.aspx?lang=eng\">Canada’s response to Ukraine International Airlines Flight PS752 tragedy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/02/14/building-more-secure-and-prosperous-future-prime-minister-attends\">Building a more secure and prosperous future: Prime Minister attends Munich Security Conference</a></li>\n</ul></div>\n      "
}