{
  "path": "/en/news/statements/2019/04/28/statement-prime-minister-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Mourning:</p>\n\n<p>“Every Canadian deserves to be able to provide for their family, knowing they will return home safely at the end of a hard day’s work.</p>\n\n<p>“On the <a href=\"https://www.ccohs.ca/events/mourning/\">National Day of Mourning</a>, we remember and honour Canadian workers who have died or suffered physical or mental injury or illness as a result of workplace accidents, hazards, or harassment.</p>\n\n<p>“Work-related tragedies are not limited to one type of work or one type of worker. Employees in all fields, from all backgrounds, and of all ages, can fall victim to an incident that prevents them from working and living to their fullest. These incidents can also take a toll on their families, friends, colleagues, and communities.</p>\n\n<p>“That is why the Government of Canada remains committed to working with partners to make workplaces healthy and safe spaces for all, and to giving Canadians confidence in the laws that protect them and prevent tragedies from taking place.</p>\n\n<p>“Last October, we passed new regulations to stop the use of new asbestos in Canada, to protect the health and safety of all Canadians. That same month, we passed legislation to protect employees in federal workplaces from harassment and violence, and to make sure they are better supported if an incident does happen. It will take more than legislation to eliminate workplace harassment and violence, but Bill C-65 is an essential part of a much-needed culture shift. We have also taken steps to modernize the <em>Canada Labour Code</em> so that there will be real financial and public consequences for violating safety standards.</p>\n\n<p>“The health and safety of all workers is a priority for the Government of Canada. Today, I encourage all Canadians to pause and remember workers who have lost their lives or suffered injury or illness in the workplace. Together, let us honour them by doing our part to build safer and healthier work environments for everyone.”</p></div>\n      "
}