{
  "path": "/en/news/readouts/2020/05/15/prime-minister-justin-trudeau-speaks-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, spoke with Prime Minister Boris Johnson of the United Kingdom to discuss the COVID-19 pandemic response.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson spoke of the 75th anniversary of Victory in Europe Day, an important moment to recall the courage and sacrifice of those who fought to defend our freedom and democracy. Prime Minister Johnson also offered his condolences on the loss of lives of Canadian Armed Forces members in the recent CH-148 Cyclone helicopter accident.</p>\n\n<p>The two leaders discussed the significant response by Canada and the United Kingdom to address the health, social, and economic impacts of the pandemic.</p>\n\n<p>The Prime Ministers also recognized the need for coordinated global action to beat a virus that knows no borders. Both Canada and the United Kingdom have made substantial contributions to global response efforts, including investing in the accelerated development of diagnostics, treatments, and vaccines as well as supporting more vulnerable countries. Prime Minister Trudeau and Prime Minister Johnson will continue to engage collaboratively in global initiatives on the COVID-19 response, and will work toward a strong and sustainable economic recovery.</p>\n\n<p>The two leaders shared their support for the work of Gavi, the Vaccine Alliance, and looked forward to the Global Vaccine Summit that the United Kingdom will host on June 4.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson discussed ongoing collaboration between Canada and the United Kingdom in various international organizations, and committed to continuing to work together on shared priorities such as combating climate change and promoting democratic values.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/05/minister-gould-announces-funding-for-global-vaccinations.html\">Minister Gould announces funding for global vaccinations</a></li>\n</ul></div>\n      "
}