{
  "path": "/en/news/statements/2021/06/24/statement-prime-minister-saint-jean-baptiste-day",
  "pageTitle": "Statement by the Prime Minister on Saint-Jean-Baptiste Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Saint-Jean-Baptiste Day:</p>\n\n<p>“On Saint-Jean-Baptiste Day, we celebrate not only Canada’s Francophonie, but also the nearly 8&nbsp;million Francophones across the country whose language, culture, and traditions are at the heart of Canada's heritage and identity.</p>\n\n<p>“From Vancouver Island – where the next Jeux de la&nbsp;francophonie canadienne are planned for 2022 – to the island of Newfoundland, Francophones and Francophiles traditionally celebrate Saint-Jean-Baptiste Day by holding community events, attending performances, or gathering with family and friends. This year, as we continue to fight COVID-19 and follow public health guidelines, we will find other ways of celebrating our history, our culture, and our beautiful French language.</p>\n\n<p>“Defending the rights of official language minority communities is a priority for the Government of Canada. That is why last week, we introduced Bill&nbsp;C-32, an Act for the Substantive Equality of French and English and the Strengthening of the&nbsp;<em>Official Languages Act</em>. This bill will not only increase the use of the French language, but also help it thrive across the country and around the world. In Budget&nbsp;2021, the government also proposed funding to help students achieve greater levels of bilingualism, to support early childhood to post-secondary minority-language education, and to help with the construction, renovation, and expansion of the educational and community spaces that serve official language minority communities. By making it more accessible to learn French and supporting institutions in Francophone minority communities, we are taking meaningful steps to better protect and promote the French language and Francophone culture – today and for future generations.</p>\n\n<p>“French language and culture have helped shape our values, our aspirations, and our Canadian identity – and these contributions continue today. I am confident that they will continue to strengthen our communities and play a fundamental role in building a better Canada.</p>\n\n<p>“On behalf of the Government of Canada, I would like to wish all Francophones and Francophiles from coast to coast to coast a happy Saint-Jean-Baptiste Day.”</p></div>\n      "
}