{
  "path": "/en/news/readouts/2020/04/29/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the European Commission, Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen, to discuss COVID-19.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen spoke about the importance of coordinating global efforts to address the COVID-19 crisis, a global pandemic that requires a global response.</p>\n\n<p>Prime Minister Trudeau welcomed the European Union’s leadership in hosting an international pledging effort as of May 4th to promote cooperation on urgent efforts to develop effective COVID-19 diagnostics, therapies, and vaccines. The Prime Minister and the President agreed on the need to support more vulnerable countries, as the virus knows no borders.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen looked forward to continued collaboration between Canada and the European Union, along with other international partners, to address the health and economic challenges of the COVID-19 crisis. The two leaders discussed the need to reduce economic vulnerabilities, and strengthen multilateralism to ensure a strong and sustainable recovery for the long term.<strong>&nbsp;</strong></p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng#a1\">Canada-EU Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n</ul></div>\n      "
}