{
  "path": "/en/news/news-releases/2020/12/10/prime-minister-hosts-first-ministers-meeting-fighting-covid-19-and",
  "pageTitle": "Prime Minister hosts First Ministers’ Meeting on fighting COVID-19 and strengthening health care | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The global COVID-19 pandemic is the most serious public health crisis Canada has ever faced. Protecting Canadians from the virus is our top priority, and beating it will take a collaborative effort.</p>\n\n<p>Since 2015, the Government of Canada has made historic investments to support health care for Canadians, including new targeted funding for provinces and territories. And now, throughout this crisis, the government continues to work with provinces, territories, municipalities, and Indigenous communities to support Canadians and keep them safe and healthy. The government has provided more than eight out of every 10 dollars spent in Canada to fight COVID-19 and support Canadians, and made over $24 billion in direct support available to provinces and territories. We have helped to scale up testing and tracing, secured the most extensive and diverse vaccine portfolio of any country in the world, and procured personal protective equipment to help our essential workers and protect the most vulnerable. And we will continue to work with our partners to do whatever it takes – for as long as it takes – until we get through this pandemic.</p>\n\n<p>At today’s special First Ministers’ Meeting on health care, Prime Minister Justin Trudeau announced that the Government of Canada will cover 100 per cent of the cost of procuring vaccines for all Canadians, and the supplies needed to administer them. As safe and effective vaccines are approved and made available, the government will work with the provinces and territories, as well as Indigenous and public health partners, to immunize Canadians through a process that is fair and well coordinated. First Ministers committed to cooperating on the vaccine rollout to enable as many Canadians as possible to be immunized as quickly as possible against COVID-19, while ensuring that high-risk, vulnerable people are prioritized.</p>\n\n<p>All Canadians deserve a strong, resilient public health care system, and they expect the very best services. At the First Ministers’ Meeting, the Prime Minister continued his ongoing work with premiers to strengthen health care for all Canadians. The Prime Minister proposed the following areas in which to begin work, supported by new federal investments: improving long-term care and health care delivery for people across the country, increasing mental health services, coordinating on digital platforms and information sharing between jurisdictions, and making progress on a national, universal pharmacare program while lowering the cost of drugs. On pharmacare and high-cost drugs, the Government of Canada, in collaboration with the provinces and territories, will create a new Canadian Drug Agency, and build on the recommendations of the Advisory Council on the Implementation of National Pharmacare.</p>\n\n<p>In the weeks and months to come, the Prime Minister and premiers will continue to meet regularly to collaborate on efforts to respond to the pandemic and discuss the lessons learned on public health, continue the conversation on new federal funding for health care, improve outcomes for people, and ensure the transparency and accountability that people expect. Federal, provincial, and territorial governments will also have their Finance officials work early in the new year on finding common ground about what has been spent, and where we currently are, with health care funding.</p>\n\n<p>Ending the COVID-19 pandemic remains the immediate priority for all orders of government and for Canadians. The Government of Canada will continue to work with provinces, territories, municipalities, and Indigenous communities to focus on Canadians’ needs now and in the immediate future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We need to work together to fight COVID-19 and to keep people healthy, safe, and supported. Working with the provinces and territories, the Government of Canada will do whatever it takes to support Canadians through this crisis and build back better once the virus is beaten. ”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, Prime Minister Trudeau confirmed for the premiers that the federal government will pay for 100 per cent of the cost of the vaccine. To help support Canadians, this also includes all logistics and transportation costs. The federal government remains committed to working collaboratively with the provinces and territories in the interests of all Canadians.” &nbsp;</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>To date, the Government of Canada’s total support during the pandemic includes $322 billion in direct measures to fight the virus and help people, and $85 billion in tax and duty deferrals.</li>\n\t<li>As part of the Fall Economic Statement, the government is proposing additional investments to strengthen Canada’s health care system, including:\n\t<ul>\n\t\t<li>$1.5 billion to continue to procure personal protective equipment (PPE) and provide warehousing and logistics support to rapidly deliver critical PPE and medical supplies to provinces, territories, and Indigenous communities, as well as to maintain the readiness of the National Emergency Strategic Stockpile.</li>\n\t\t<li>Up to $1 billion to establish a Safe Long-term Care Fund to help provinces and territories protect people in long-term care and support infection prevention and control.</li>\n\t\t<li>Over $900 million to support the continued health response in Indigenous communities and to help ensure that First Nations, Inuit, and Métis communities can manage and control the virus, as well as the influenza season.</li>\n\t</ul>\n\t</li>\n\t<li>The Fall Economic Statement also outlined the federal government’s proposals to modernize the Fiscal Stabilization Program to provide a more effective backstop to provinces that face an extraordinary drop in revenues. This is expected to result in billions in additional support to provinces for 2020-21, based on current revenue projections by provinces. Proposed investments include nearly tripling the maximum payment to $170 per person for 2019-20 and 2020-21 Stabilization claims and allowing the maximum payment to grow thereafter in line with Canadian economic growth per person.</li>\n\t<li>The Government of Canada has invested more than $1 billion in vaccine agreements, securing a domestic supply of up to 429 million doses, of seven promising vaccines – more than ten doses for every Canadian.\n\t<ul>\n\t\t<li>On December 9, 2020, Health Canada <a href=\"https://www.canada.ca/en/health-canada/news/2020/12/health-canada-authorizes-first-covid-19-vaccine.html\">authorized the Pfizer-BioNTech vaccine</a>.</li>\n\t</ul>\n\t</li>\n\t<li>In 2020-21, the Government of Canada will provide $41.9 billion in cash support to provinces and territories through the Canada Health Transfer (CHT). Over the next five years, CHT funding to provinces and territories is expected to total approximately $235 billion.</li>\n\t<li>In addition to the CHT, the Government of Canada made historic, new investments in health care through Budget 2017, which committed $11 billion over 10 years in targeted funding for provinces and territories to improve access to mental health and addiction services, as well as for home and community care.</li>\n\t<li>On July 16, 2020, the Prime Minister and Deputy Prime Minister <a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement\">announced an agreement</a> to safely restart the economy that involved over $19 billion in funding from the federal government. The Safe Restart Agreement focuses on measures over six to eight months to restart the economy while protecting the health of Canadians.</li>\n\t<li>On August 26, 2020, the Prime Minister <a href=\"https://pm.gc.ca/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school\">announced up to $2 billion in additional funding </a>to support provinces and territories in their efforts to ensure a safe return to school, through the Safe Return to Class Fund.</li>\n\t<li>Today’s meeting was the seventh First Ministers’ Meeting the Prime Minister has hosted since 2015. The Prime Minister has also held 22 calls with Canada’s provincial and territorial premiers to discuss their shared response to the COVID‑19 pandemic.</li>\n\t<li>In addition to the First Ministers’ Meetings, there have been at least 25 Health Ministers’ Meetings, and the Special Advisory Committee on COVID-19 has met at least 100 times.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/fes-eea/2020/home-accueil-en.html\">Supporting Canadians and Fighting COVID-19: Fall Economic Statement 2020</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/fes-eea/2020/themes/supporting-provinces-territories-appuyer-provinces-territoires-en.html\">A Team Canada Approach to Fighting COVID-19: Supporting Provinces, Territories, Municipalities and Indigenous Communities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canadaspremiers.ca/about/\">Canada’s Premiers</a></li>\n</ul></div>\n      "
}