{
  "path": "/en/news/news-releases/2018/12/07/first-ministers-meet-discuss-economic-growth-and-jobs-canadians",
  "pageTitle": "First Ministers meet to discuss economic growth and jobs for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s First Ministers met today to discuss ways to strengthen economic growth and create jobs for the middle class by diversifying Canada’s international trade, promoting clean growth, and strengthening trade between provinces and territories.</p><p>Following the meeting, First Ministers issued the following joint communiqué:</p><p>“Today First Ministers discussed ways to collaborate to help grow the economy and protect the environment, reduce red-tape, create opportunities for small and medium-sized business, and improve the everyday lives of Canadians.</p><p>First Ministers discussed the need to diversify trade and the importance of working together to strengthen alignment of federal, provincial and territorial measures to create jobs. First Ministers agreed to continue to work together to develop complementary initiatives to strengthen the competitiveness of the Canadian economy and to help businesses grow.</p><p>First Ministers discussed how the new North American Free Trade Agreement will create jobs, strengthen economic ties, and expand Canada’s trade in North America. First Ministers agreed on the need to resolve the question of softwood lumber and steel and aluminum tariffs, and to ensure that the federal government supports and fully compensates the supply managed sector.</p><p>As First Ministers, we have agreed to collaborate on ways to promote clean growth while growing the economy. As a next step, First Ministers agreed to lead a discussion on the development of a framework for a clean electric future, including hydroelectricity, aimed at using clean, reliable and affordable electricity and to promote access to domestic and international markets. First Ministers also agreed on the necessity to ensure all projects have social responsibility and are supported by a science-based process. First Ministers also agreed on the importance of getting remote communities off diesel.</p><p>First Ministers agreed that interested jurisdictions could explore opportunities for utility corridors in Canada.</p><p>First Ministers discussed the challenges facing Canada’s energy sector. They noted that the current price discount on energy products costs the Canadian economy tens of billions of dollars and therefore there should be a focus on addressing the problem. All governments support the goal of ensuring that every barrel of Canadian oil gets its full value and that we support jobs and families impacted by the price differential. First Ministers agree that the federal government needs to invest in short-term support for energy sectors impacted by the differential, medium-term efforts to get energy products to market, and long-term efforts to build energy infrastructure that will expand markets and that will reduce the cost of shipping.&nbsp;&nbsp;</p><p>A clean and healthy environment is an objective shared by all First Ministers. First Ministers expressed a difference of opinion on Canada’s approach to putting a price on pollution. First Ministers also agreed to share information and work collaboratively to ensure that the implementation of proposed changes to how major projects are assessed respect provincial, territorial and federal jurisdiction and strive for the goal of “one project, one review.” First Ministers also agreed that continued collaboration and meaningful engagement is important, including on supporting regulations and policies, to support business certainty and to ensure that good projects go forward in a clear, timely and transparent process.</p><p>First Ministers also agreed on the importance of strengthening trade between provinces and territories in order to foster economic growth and improve the everyday lives of Canadians. As First Ministers, we agreed to accelerate work to address domestic barriers to trade that increase business costs and impose needless burden on Canadian firms.</p><p>The Canadian Free Trade Agreement came into force in July 2017. Since that time, we have taken important steps to ensure that the Agreement reduces barriers to the free movement of persons, goods, services and investments within Canada. Today, we are committing to take bold steps to further strengthen Canada’s economic union.</p><p>Specifically, we have agreed to:</p><ul class=\"sm-spacing\"><li>Develop harmonized standards in the trucking sector, building on federal investments in the National Trade and Transportation Corridors initiative. Federal, provincial and territorial governments will work together on an accelerated basis to harmonize standards for wide base tires, electronic logging devices, and size and weight restrictions.</li><li>Take action to strengthen Canada’s agri-food sector, including clearer rules for organic products, and eliminating the duplication of food oversight and safety. The Government of Canada will also continue to work collaboratively with the territories to support their food industries and build food security.</li><li>Consult industry and consumers to develop ways to facilitate the sale of alcoholic beverages, taking into consideration social responsibility obligations. As a first step, Canada will consider amendments to the <i>Importation of Intoxicating Liquors Act </i>to remove the federal requirement that alcohol moving from one province to another be sold or consigned to a provincial liquor authority.</li><li>Accelerate work to strengthen the Canadian Free Trade Agreement, including a plan to reduce the number of exceptions and strengthen the dispute resolution provisions.</li></ul><p>Trade within Canada creates jobs, helps Canadian businesses expand, and increases economic growth across the country. We have the opportunity to protect Canada against the uncertainties of the global economy and work together to have a real and positive impact on the competitiveness of Canadian businesses and the everyday lives of Canadians.”</p></div>\n      "
}