{
  "path": "/en/news/news-releases/2018/06/01/world-leaders-coming-together-g7-summit-protect-our-oceans-seas-and",
  "pageTitle": "World leaders coming together at the G7 Summit to protect our oceans, seas and coastal communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Healthy oceans, seas and coasts are essential to our way of life. They are a vast source of food and energy, and form the economic bedrock of countless communities and entire countries. They drive growth, create jobs and sustain people’s livelihoods around the world.</p><p>The Prime Minister, Justin Trudeau, today announced that Canada will welcome several world leaders and heads of international organizations to the G7 Summit to take part in a special outreach session, which will focus on healthy oceans and resilient coastal communities. It will be held on June 9, 2018.</p><p>The following leaders and heads of international organizations have been invited to the Outreach Session of the G7 Summit:</p><ul><li>Mauricio Macri, President of Argentina and Chair of the G20</li><li>Sheikh Hasina, Prime Minister of Bangladesh</li><li>Jovenel Moïse, President of Haiti and Chair of the Caribbean Community (CARICOM)</li><li>Andrew Holness, Prime Minister of Jamaica</li><li>Uhuru Kenyatta, President of Kenya</li><li>Hilda Heine, President of the Marshall Islands</li><li>Erna Solberg, Prime Minister of Norway</li><li>Paul Kagame, President of Rwanda and Chair of the African Union</li><li>Macky Sall, President of Senegal</li><li>Danny Faure, President of Seychelles</li><li>Cyril Ramaphosa, President of South Africa</li><li>Nguyễn Xuân Phúc, Prime Minister of Vietnam</li><li>Christine Lagarde, Managing Director of the International Monetary Fund</li><li>José Ángel Gurría, Secretary-General of the Organisation for Economic Co-operation and Development</li><li>António Guterres, Secretary-General of the United Nations</li><li>Kristalina Georgieva, Chief Executive Officer of the World Bank</li></ul><p>These leaders and heads of international organizations will meet with G7 leaders to discuss how to build resilient coasts and communities, share ocean knowledge and science, and support sustainable oceans and fisheries. They will also explore how to best address pressing challenges, including plastics in our oceans and illegal, unreported and unregulated fishing.</p><p>Canada is committed to working with others in the G7 and beyond to strengthen resilience, fight climate change, and protect our oceans for generations to come. As with all work under Canada’s G7 presidency, these discussions will include a focus on gender equality and women’s empowerment.</p><h2>Quote</h2><blockquote><p>“Our oceans and coasts are under considerable threat – from increases in plastic pollution, more frequent and severe weather events, and illegal, unreported and unregulated fishing. Resilient coastal communities and healthy oceans are vital to growing economies that work for everyone and that is why we are committed to working with others to protect the world’s oceans.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>These leaders and heads of international organizations will also attend a dinner hosted by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, at the Citadelle of Québec.</li><li>Canada holds the G7 presidency for 2018. Part of this role includes setting the agenda for the year, as well as organizing and hosting the Leaders' Summit, ministerial meetings, and other associated events.</li><li>Canada is advancing domestic and international priorities framed under the following five key themes:<ul><li>Investing in growth that works for everyone</li><li>Preparing for jobs of the future</li><li>Advancing gender equality and women’s empowerment</li><li>Working together on climate change, oceans, and clean energy</li><li>Building a more peaceful and secure world</li></ul></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/g7/index.aspx?lang=eng\">Road to the 2018 G7 Summit in Charlevoix</a></li><li><a href=\"/en/news/news-releases/2017/05/27/canada-host-2018-g7-summit-charlevoix-quebec\">Canada to host 2018 G7 Summit in Charlevoix, Quebec</a></li><li><a href=\"/en/news/news-releases/2017/12/14/prime-minister-unveils-themes-canada’s-2018-g7-presidency\">Prime Minister unveils themes for Canada’s 2018 G7 Presidency</a></li></ul></div>\n      "
}