{
  "path": "/en/news/news-releases/2023/03/06/taking-further-action-foreign-interference-and-strengthening",
  "pageTitle": "Taking further action on foreign interference and strengthening confidence in our democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s democracy is among the strongest, most stable in the world. Since 2015, the Government of Canada has taken significant action to combat foreign interference, while strengthening our institutions and our democracy, including protecting our elections from foreign threats. Any attack, or attempted attack, on our democracy is unacceptable and something we take very seriously.</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, announced further action to combat foreign interference and uphold confidence in our democratic institutions:</p>\n\n<ul>\n\t<li>He has asked the National Security and Intelligence Committee of Parliamentarians (NSICOP) to complete a review to assess the state of foreign interference in federal electoral processes. The NSICOP is well placed to look at foreign interference attempts that occurred in the 43rd and 44th federal general elections, including potential effects on Canada’s democracy and institutions, and have their findings and recommendations reported to Parliament.</li>\n\t<li>He spoke to the Chair of the National Security and Intelligence Review Agency (NSIRA) about a review of how Canada’s national security agencies handled the threat of foreign interference during the 43rd and 44th federal general elections, specifically around the flow of information from national security agencies to decision makers. Given it is an external and independent body, the NSIRA will appropriately set its own mandate and scope of study in the coming days. Their findings will also be reported to Parliament.</li>\n</ul>\n\n<p>The Prime Minister also announced that in the coming days we will appoint an eminent Canadian to the position of Independent Special Rapporteur, who will have a wide mandate to make expert recommendations on protecting and enhancing Canadians’ faith in our democracy. In the coming weeks, the Independent Special Rapporteur will be responsible for informing the work of the NSIRA and the NSICOP and any other existing processes and investigations that may be carried out by independent bodies like Canada’s Commissioner of Elections and identify gaps that may still remain in the oversight and protection of our democracy. The Independent Special Rapporteur will make public recommendations, which could include a formal inquiry or some other independent review process, and the Government of Canada will abide by the recommendation.</p>\n\n<p>Together, these measures will give us a better understanding of what happened in the last two federal general elections: how foreign governments tried to interfere, how security agencies in Canada responded to the threat of interference, and how the information flowed across government.</p>\n\n<p>The Prime Minister today also announced a series of new measures to take immediate action to combat the threat of foreign interference. The Government of Canada is:</p>\n\n<ul>\n\t<li>Launching public consultations later this week to guide the creation of a Foreign Influence Transparency Registry in Canada to ensure transparency and accountability from people who advocate on behalf of a foreign government and ensure communities who are often targeted by attempts at foreign interference are protected.</li>\n\t<li>Establishing a new National Counter Foreign Interference Coordinator in Public Safety Canada to coordinate efforts to combat foreign interference.</li>\n\t<li>Developing a plan to address outstanding recommendations from the NSICOP, the independent assessment of the Protocol (Rosenberg Report), and other reviews on these matters, within the next 30 days.</li>\n\t<li>Investing $5.5&nbsp;million to strengthen the capacity of civil society partners to counter disinformation.</li>\n</ul>\n\n<p>Upholding and strengthening our democracy takes constant work. This work transcends any politician and any government because the institutions we put in place must outlive any of us. We will continue to work to strengthen our democratic institutions and ensure our elections remain free and fair for generations to come.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As a government, it’s our job to protect our institutions and everyone who calls Canada home. Today, we’re taking even further action to protect our democratic institutions, to defend their integrity, and to uphold and strengthen confidence in our democracy. We will always take foreign attempts at undermining our democracy very seriously.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2017, we introduced legislation to create the National Security and Intelligence Committee of Parliamentarians (NSICOP), made up of Members of Parliament from each party and Senators with top-secret security clearance to review national security and intelligence activities across the Government of Canada. It was modelled on similar approaches taken by our international partners and has since reviewed and provided recommendations on issues concerning national security, like cyber attacks. In 2019, the NSICOP completed a review of foreign interference in Canada and published it in their 2019 annual report.</li>\n\t<li>In 2019, we introduced legislation to create the National Security and Intelligence Review Agency (NSIRA), made up of top independent experts, to strengthen independent scrutiny and national security accountability in Canada. The NSIRA independently reviews all Government of Canada national security and intelligence activities to ensure are lawful, reasonable, and necessary, and provides recommendations to the Government of Canada.</li>\n\t<li>As part of the Plan to Protect our Democracy, starting with the 2019 election, we established the Critical Election Incident Public Protocol (the Protocol), which is administered by a panel of the most senior federal public servants who, working with national security agencies, are responsible for communicating with Canadians in the event of an incident or series of incidents that threaten the integrity of a federal election.</li>\n\t<li>In both the 2019 and 2021 federal general elections, the panel reported that while foreign inference attempts existed, the elections unfolded with integrity.</li>\n\t<li>The Protocol includes an independent assessment which, in both 2019 and 2021, reiterated the panel’s findings that these elections were free and fair.</li>\n\t<li>The government also created the Security and Intelligence Threats to Election (SITE) Task Force, composed of officials from the Communications Security Establishment, the Canadian Security Intelligence Service, the Royal Canadian Mounted Police, and Global Affairs Canada. The SITE Task Force works to identify and prevent covert, clandestine, or criminal activities from influencing or interfering with the electoral process in Canada.&nbsp;</li>\n\t<li>Canada established the Rapid Response Mechanism (RRM) at the G7 Summit in Charlevoix to help G7 countries identify and respond to diverse and evolving foreign threats to democracy.</li>\n\t<li>We have also taken a series of other measures to bolster our institutions:\n\t<ul class=\"bulletOutline\">\n\t\t<li>In 2018, we strengthened our elections financing laws to keep foreign money out of our elections;</li>\n\t\t<li>In 2019, we launched the Digital Citizen Initiative to help people better understand and identify online disinformation;</li>\n\t\t<li>We introduced new legislation to protect our cyber security.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://www.nsicop-cpsnr.ca/index-en.html\" target=\"_blank\" title=\"https://www.nsicop-cpsnr.ca/index-en.html\">National Security and Intelligence Committee of Parliamentarians</a></li>\n\t<li><a href=\"https://nsira-ossnr.gc.ca/\" target=\"_blank\" title=\"https://nsira-ossnr.gc.ca/\">National Security and Intelligence Review Agency</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\" target=\"_blank\" title=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Protecting democracy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy/security-task-force.html\" target=\"_blank\" title=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy/security-task-force.html\">Security and Intelligence Threats to Elections (SITE) Task Force</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/rapid-response-mechanism-mecanisme-reponse-rapide/index.aspx?lang=eng\" target=\"_blank\" title=\"https://www.international.gc.ca/transparency-transparence/rapid-response-mechanism-mecanisme-reponse-rapide/index.aspx?lang=eng\">Rapid Response Mechanism</a></li>\n</ul></div>\n      "
}