{
  "path": "/en/news/news-releases/2019/01/29/prime-minister-announces-changes-parliamentary-secretaries",
  "pageTitle": "Prime Minister announces changes to parliamentary secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the parliamentary secretaries.</p><p>The parliamentary secretaries included in today’s announcement are either newly appointed, or taking on new responsibilities. The appointments are effective immediately.</p><p>The changes to the <a href=\"/en/parliamentary-secretaries\">parliamentary secretaries</a> are as follows:</p><ul><li><a href=\"/en/parliamentary-secretaries/remi-masse\"><b>Rémi Massé</b></a> becomes Parliamentary Secretary to the Minister of Innovation, Science and Economic Development.</li><li><a href=\"/en/parliamentary-secretaries/marc-serre\"><b>Marc Serré</b></a> becomes Parliamentary Secretary to the Minister of Rural Economic Development.</li><li><a href=\"/en/parliamentary-secretaries/arif-virani\"><b>Arif Virani </b></a>remains Parliamentary Secretary to the Minister of Justice and Attorney General of Canada, and assumes additional responsibilities as Parliamentary Secretary to the Minister of Democratic Institutions.</li></ul><p>These parliamentary secretaries will bring a wealth of experience, skills, and perspectives to their new roles. They will support their respective cabinet ministers to strengthen the openness and fairness of Canada’s public institutions, improve quality of life in rural communities, and help businesses innovate and create economic growth and good, middle class jobs for Canadians.</p><h2>Related Products</h2><ul><li><a href=\"/en/parliamentary-secretaries\">Parliamentary Secretaries</a></li><li><a href=\"/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li></ul></div>\n      "
}