{
  "path": "/en/news/statements/2017/11/10/statement-prime-minister-100th-anniversary-end-battle-passchendaele",
  "pageTitle": "Statement by the Prime Minister on the 100th anniversary of the end of the Battle of Passchendaele | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 100<sup>th</sup> anniversary of the end of the Battle of Passchendaele:</p><p>“Today, we mark the 100<sup>th</sup> anniversary of the end of the Battle of Passchendaele. On this solemn anniversary, we honour the thousands of Canadians who fought and died there, and pay tribute to their great courage and sacrifice.</p><p>“The <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/fact_sheets/passchendaele\">Battle of Passchendaele</a> has come to be a symbol of the worst horrors of the First World War. It began in the summer of 1917, as Allied soldiers sought to open a path through Western Belgium to coastal enemy bases. For months, Allies and enemies alike fought in conditions many described as a living hell; a landscape already broken by years of warfare; mud that swallowed men and horses, but refused to bury the dead.</p><p>“The Canadians joined the battle in October of that year. For weeks, they endured incessant rain and shellfire – but by mid-November, they had taken the ridge.</p><p>“Our soldiers fought an impossible fight with perseverance, valour, and commitment to a greater cause. Nine Canadians would earn the Victoria Cross for their bravery. Yet the battle came at a devastating cost. 16,000 Canadians were killed or wounded – and thousands of families forever changed.</p><p>“On this solemn anniversary, we honour the great heroism and sacrifice of those who fought in the Battle of Passchendaele. Tomorrow, please pause to remember and honour those who have served, and continue to serve, so that we may live in peace.</p><p>“Lest we forget.”</p></div>\n      "
}