{
  "path": "/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect",
  "pageTitle": "Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we continue to address the challenges of today and the impacts of the global COVID-19 pandemic, the Government of Canada remains focused on meeting the tests of the future. Climate change is the biggest long-term threat of our generation, but it is also the greatest economic opportunity. By accelerating action to fight climate change and rebuilding a more sustainable and resilient economy, we can create new jobs and opportunities for Canadians, while also ensuring cleaner air and water for our kids and grandkids.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced Canada’s strengthened climate plan, <em>A Healthy Environment and a Healthy Economy</em>, which will help achieve our economic and environmental goals. The proposed plan, supported by an initial $15 billion in investments, will make life more affordable for Canadians, make communities more livable, and, at every turn, focus on creating jobs, growing the middle class, and supporting workers in a stronger and cleaner economy.</p>\n\n<p>The plan’s measures will:</p>\n\n<ul>\n\t<li><strong>Make the places we live and gather more affordable by cutting energy waste:</strong> We will cut pollution, make life more affordable, and create thousands of good new jobs by making it easier for Canadians to improve the energy efficiency of the places where they live and gather, including through investments in retrofits.</li>\n\t<li><strong>Make clean, affordable transportation and power available in every community: </strong>We will build cleaner communities and help Canadians get around in more affordable ways, by expanding the supply of clean electricity through investments and other measures to increase renewables and next-generation clean energy and technology.</li>\n\t<li><strong>Continue to ensure pollution isn’t free and households get more money back: </strong>We will give more money back to households in a way that leaves the majority of them better off, and reduce pollution, by continuing to put a rising price on pollution through to 2030.</li>\n\t<li><strong>Build Canada’s clean industrial advantage</strong>: We will create economic growth, cut pollution, and ensure Canadians continue to have good-paying and long lasting jobs by<strong> </strong>helping Canadian businesses reduce emissions and make low-carbon products that the world wants to buy now and into the future.</li>\n\t<li><strong>Embrace the power of nature to support healthier families and more resilient communities</strong>: We will cut pollution, clean the air we breathe, create jobs, and make our communities more resilient to extreme weather by planting two billion trees, supporting sustainable farming, and better managing, conserving, and restoring our nature.</li>\n</ul>\n\n<p>Canada’s strengthened climate plan builds on continuing work with provinces and territories through the Pan-Canadian Framework on Clean Growth and Climate Change (PCF), which was<em> </em>released in 2016. When coupled with the PCF, the strengthened plan will do more to cut pollution in a practical and affordable way than any other climate plan in Canada’s history. It means we can exceed our 2030 Paris Agreement emissions reduction target and establish the building blocks to get to net-zero by 2050. The proposed plan will also enable Canada to be an active and constructive player in the global fight against climate change.</p>\n\n<p>Climate change knows no borders. By continuing to work together on this urgent crisis, we will be able to avoid the worst effects of climate change and build a healthier and cleaner future, while also creating new jobs and economic growth for all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As we continue to address the impacts of COVID-19 and ensure our strong economic recovery, we must also continue to fight climate change for the good of Canadians, our economy, and our planet. Canadians don’t have to choose between clean air and good jobs. This strengthened climate plan will help us build a healthier, fairer, and more resilient future that we can be proud to pass on to our children and grandchildren.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is a plan that will help achieve both Canadians’ environmental goals and our economic hopes: clean air, clean water and long-term secure jobs. It means we will exceed Canada’s 2030 climate target while positioning Canadians to thrive in an increasingly low-carbon economy. It contains 64 strengthened and new federal policies, programs and investments to cut pollution and build a stronger, cleaner, more resilient and inclusive economy.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“This isn’t just a plan for climate action. It’s a plan for Canada’s economic competitiveness. By taking action now, we’re confronting the urgency of climate change and setting Canadian workers up for an economy in which they can thrive.”</p>\n\n<footer class=\"default\">The Hon. Seamus O’Regan, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>“Climate action is about good jobs, Canadian innovation, clean air and water, more inclusive communities and, most of all, a better future for our kids. If we take the same approach to the climate crisis as we are to the COVID-19 pandemic – urgency, science-based decisions, working together across borders and focusing on the planet we want for everyone – we will win the race against climate too.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“This plan for a cleaner and stronger economy sets the creation of well-paying, resilient jobs as a top priority. Our government’s investments mean companies in Canada will decarbonize faster and our clean-tech sector will scale-up faster, and in turn they will offer the world more of the low-carbon products that consumers and investors increasingly demand. Improving the global competitiveness of our industries means better job opportunities for Canadians today and for generations to come. This plan makes sure our children and grandchildren have a healthy environment and a healthy economy.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Climate change is the greatest threat of our time, but it is also our greatest opportunity. Today, we are giving ourselves the means to achieve our ambitions, allowing us to face the future with confidence. We are not going to leave our children and grandchildren an ecological debt, as the costs of inaction would be far greater. Just as we are listening to the science to fight the COVID-19 pandemic, so too are we listening to the science to fight climate change. We are building on our strengths and are including each and every one of us in the transition.”</p>\n\n<footer class=\"default\">The Hon. Steven Guilbeault, Minister of Canadian Heritage</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The estimated size of the global clean technology market is expected to range between $2.5 trillion and $6.4 trillion (USD) by 2022-23. This strengthened climate plan seizes that opportunity and positions Canadian workers and businesses to be among the leaders in the increasingly low-carbon global economy.</li>\n\t<li>In the recent&nbsp;<em>Fall Economic Statement</em><em>, </em>the Government of Canada proposed to support the economy’s clean and competitive transition by providing grants to help Canadians make their homes greener and more energy-efficient. It will provide additional funds for the installation of new charging and refueling stations for zero-emission vehicles, and more support for large-scale clean power transmission projects.</li>\n\t<li>The government also proposed in the <em>Fall Economic Statement</em> to invest in nature-based climate solutions, including to restore degraded ecosystems, protect wildlife, and establish a new Natural Climate Solutions for Agriculture Fund.</li>\n\t<li>While some of the proposed measures in this plan will take effect almost immediately, others will require work and collaboration with provinces and territories and through nation-to-nation, Inuit-Crown, and government-to-government relationships, as well as with many economic sectors, to ensure a strong, workable plan that we can deliver together.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/12/a-healthy-environment-and-a-healthy-economy.html\">Backgrounder: <em>A Healthy Environment and a Healthy Economy </em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview.html\">Strengthened Climate Plan: <em>A Healthy Environment and a Healthy Economy </em></a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2020/11/government-of-canada-charts-course-for-clean-growth-by-introducing-bill-to-legislate-net-zero-emissions-by-2050.html\">Government of Canada charts course for clean growth by introducing bill to legislate net-zero emissions by 2050</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/fes-eea/2020/report-rapport/toc-tdm-en.html\"><em>Supporting Canadians and Fighting COVID-19: Fall Economic Statement 2020</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/paris-agreement.html\">The Paris Agreement</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}