{
  "path": "/en/news/readouts/2022/03/18/prime-minister-justin-trudeau-speaks-taoiseach-ireland-micheal-martin",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Taoiseach of Ireland Micheál Martin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Taoiseach of Ireland, Micheál Martin, and wished him and the people of Ireland a happy Saint Patrick’s Day.</p>\n\n<p>The Prime Minister and Taoiseach strongly condemned Russia’s ongoing military aggression against Ukraine, and praised the courage and leadership of President Volodymyr&nbsp;Zelenskyy and the Ukrainian people. The two leaders discussed the work their governments and people are doing to support Ukrainians fleeing the war and help Ukraine defend itself. They agreed to further coordinate with partners and allies to restore Ukraine’s territorial integrity, sovereignty, and independence.</p>\n\n<p>Prime Minister Trudeau and Taoiseach Martin spoke of the current global challenges related to energy prices and food security, and the leaders agreed to further collaborate to secure reliable value chains as part of net-zero climate objectives. Both leaders underlined the strength and unity of democratic nations in response to Russia’s aggression, and Prime Minister Trudeau stressed to need to further counter disinformation globally.&nbsp;The Prime Minister and Taoiseach agreed to work together to further protect and promote democratic values, human rights, and the rules-based international system.</p>\n\n<p>Prime Minister Trudeau and Taoiseach Martin agreed to continue coordinating closely on efforts with allies and partners&nbsp;to put an end to Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ireland-irlande/relations.aspx?lang=eng\">Canada-Ireland relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/net-zero-emissions-2050.html\">Net-zero emissions by 2050</a></li>\n</ul></div>\n      "
}