{
  "path": "/en/news/statements/2023/03/24/prime-minister-trudeau-and-president-biden-joint-statement",
  "pageTitle": "Prime Minister Trudeau and President Biden Joint Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and the United States celebrate our progress under the Roadmap for a Renewed U.S.-Canada Partnership over the past two years and reaffirm our historic alliance, steadfast friendship, and commitment to overcome the daunting challenges of today and realize the full potential of the relationship in the future. Our enduring partnership is based on a mutual commitment to shared security, shared prosperity, and shared democratic values, including the importance of fighting climate change and an abiding respect for human rights and the rule of law. As the closest of friends and allies, we remain committed to making life better for people on both sides of our shared border and to building a more free, equitable, secure, and prosperous world.</p>\n\n<p>To that end, Canada and the United States will work together to:</p>\n\n<ol><li><strong>Catalyze Clean Energy and Create Good Jobs:&nbsp;</strong>Deepening economic integration, accelerating the deployment of clean technologies, and workforce development are essential to building a more sustainable and globally competitive economy for American and Canadian workers, including through continued implementation of the U.S.-Mexico-Canada Agreement.</li>\n</ol><ul><li>Prime Minister Trudeau and President Biden highlighted Canada’s Emissions Reduction Plan and the U.S. Inflation Reduction Act as foundational elements to leading the clean energy future through robust clean energy industrial policies that help mobilize technological innovation, bolster resilient supply chains, strengthen our respective economies and expand the middle class, while keeping our environment healthy for future generations.&nbsp;Canada is moving forward with an enhanced plan to support a clean economy future, including with a new investment tax credit for clean technology manufacturing in addition to tax measures that support clean hydrogen and clean technology adoption.&nbsp;As the implementation of these plans proceed, the United States and Canada will work together toward an integrated North American approach that benefits U.S. and Canadian workers, suppliers, and products.</li>\n\t<li>Canada and the United States launched a one-year <strong>Energy Transformation Task Force</strong> chaired by the U.S. Special Presidential Coordinator for Global Infrastructure and Canada’s Deputy Prime Minister to work across the spectrum of the clean economy.&nbsp;The task force will accelerate cooperation on critical clean energy opportunities and supply chains, including but not limited to, securing and strengthening renewable energy and electric vehicle supply chains, critical minerals and rare earths, grid integration and resilience, advanced and conventional nuclear energy and other areas that advance our collective energy security, and to avoid and reduce disruptions to our integrated and mutually supportive supply chains.</li>\n\t<li>Canada and the United States have built the world’s largest market-based energy trading relationship, which provides a firm foundation as we strive to reach net-zero greenhouse gas emissions.&nbsp; Both countries will work to harmonize charging standards and develop cross-border alternative fuel corridors, drawing on USD $7.5 billion in the U.S. Bipartisan Infrastructure Law and CAD $1.2 billion in Canadian funding to build a network of electric vehicle fast chargers and community charging options on both sides of the border.</li>\n\t<li>Building on Canadian and U.S. commitments to achieve net-zero power grids by 2035 and to accelerate efforts to phase down new, unabated coal power generation facilities, both&nbsp;countries intend to propose regulations before this fall that will reduce greenhouse gas emissions from their respective sectors.&nbsp;The United States and Canada also intend to work with other major energy importers and exporters to&nbsp;develop an internationally aligned approach to measurement, monitoring, reporting, and verification for lifecycle methane and CO2 emissions across the fossil energy value chain.</li>\n\t<li>Canada and the United States will work together to address the climate impact of goods, promote North American trade of low-emissions goods, including the promotion of common approaches for trade in low emissions goods, including green steel and aluminum.</li>\n\t<li>On civil nuclear engagement, Canada will join the Foundational Infrastructure for Responsible Use of Small Modular Reactor Technology (FIRST) program, providing funding and in-kind support.&nbsp;Canada and the United States will also coordinate efforts to develop secure and reliable North American nuclear fuel supply chains and build broader partnerships with longstanding allies and partners, both of which will help to ensure access to low enriched uranium, including High-Assay Low Enriched Uranium.</li>\n</ul><ol start=\"2\"><li><strong>Strengthen Resilience of Critical Mineral and Semiconductor Supply Chains:&nbsp;</strong>Canada and the United States will work together to create a strong, environmentally responsible, and resilient North American critical minerals supply chain.&nbsp;We are committed to identifying, securing, and developing critical minerals extraction, processing, manufacturing, and recycling opportunities in both countries to diversify supply chains essential to clean energy, electric vehicles, semiconductors, aerospace, and defense, among other sectors, that meet strong environmental, sustainability, worker, health and safety, Indigenous and Tribal consultation and partnership, and community engagement standards.</li>\n</ol><ul><li>Canada and the United States are taking a significant step toward the creation of reliable and sustainable critical mineral supply chains that are vital to our economic and national security and demonstrate the commitment of the United States to support Canadian companies in the energy economy.</li>\n\t<li>Last year, the United States announced USD $250 million of Defense Production Act Title III funding for U.S. and Canadian companies to mine and process critical minerals for electric vehicle and stationary storage batteries, with awards to U.S. and Canadian companies to be announced this spring.</li>\n\t<li>The Canadian Critical Minerals Infrastructure Fund will make CAD $1.5 billion available to support clean energy and transportation infrastructure projects necessary to accelerate critical minerals production and an additional CAD $1.5 billion through the Strategic Innovation Fund to support advanced manufacturing, processing, and recycling.</li>\n\t<li>With the passage of the CHIPS and Science Act, Canada and the United States will facilitate investment to promote secure and resilient semiconductor supply chains, creating jobs in both countries.&nbsp;Both countries will advance a cross-border packaging corridor, beginning with Canada and IBM providing a significant investment to develop new and expanded packaging and testing capabilities at its Bromont facility as part of a Memorandum of Understanding</li>\n\t<li>To strengthen advanced packaging for semiconductors and printed circuit boards in North America, the United States announced an additional USD $50 million in Defense Production Act funding for U.S. and Canadian companies to advance packaging for semiconductors and printed circuit boards, with Canada to provide up to CAD $250 million for semiconductor projects from the Strategic Innovation Fund in the near term.&nbsp;We are also establishing an Advanced Technology Data and Security Dialogue and intend to deepen our collaboration on shared priorities in quantum information science and technology.</li>\n</ul><ol start=\"3\"><li><strong>Protecting Our Shared Waters and the Arctic:&nbsp;</strong>Canada and the<strong> </strong>United States committed to fight climate change and build net-zero economies, conserve biodiversity, and protect fragile ecosystems, including in transboundary waters and the Arctic.&nbsp;</li>\n</ol><ul><li>Recognizing the vulnerability of the unique, shared Arctic ecosystem, Canada and the United States committed to advancing conservation, environmental protection and resilience in partnership and consultation with the Indigenous peoples and populations, and furthering work under agreements and treaties established around the movement of shared species.</li>\n\t<li>Canada and the United States further committed to initiating dialogue with other Arctic Nations and Indigenous peoples to advance conservation and sustainable economic development in the Central Arctic Ocean, and recognized the need to conserve and protect Arctic ecosystems and reduce localized emissions of carbon dioxide, methane, and black carbon in the Arctic to complement our global mitigation efforts.&nbsp;The two countries will collaborate to prepare for, prevent, and respond to oil spills and other environmental disasters in the Arctic.</li>\n\t<li>Canada and the United States announced a renewed commitment to preserving and restoring our shared national treasure, the Great Lakes.&nbsp;The United States welcomed Canada’s announcement of a new, historic investment of CAD $420 million over the next decade as part of this shared responsibility to protect and restore the world’s largest freshwater ecosystem.&nbsp;The U.S. Bipartisan Infrastructure Law provided the largest single investment in the Great Lakes in history, with USD $1 billion for cleanup and restoration activities.</li>\n\t<li>Canada and the United States will intensify their work over the coming months toward agreement on a modernized treaty regime that will support a healthy and prosperous Columbia River Basin.&nbsp;We will focus on flood risk management, power generation, and environmental benefits that are shared equitably by both countries and the Indigenous peoples and Tribal nations, communities, and stakeholders in this watershed.&nbsp;The Columbia River is a vital shared resource that underpins many lives and industries on both sides of the border and the watershed requires our attention and prompt coordination.</li>\n\t<li>Canada and the United States also intend to reach an agreement in principle by this summer to reduce and mitigate the impacts of water pollution in the Elk-Kootenay watershed, in partnership with Tribal Nations and Indigenous Peoples, and in order to protect the people and species that depend on this vital river system.</li>\n</ul><ol start=\"4\"><li><strong>Advancing Diversity and Inclusion: </strong>Recognizing the central importance of inclusion and equal opportunity to our democracies, Canada and the United States will continue to work toward fair and inclusive policies that benefit all citizens, regardless of sex, gender, or sexual orientation; race, ethnicity, or religion; age; disability; or geography.</li>\n</ol><ul><li>Building on previous bilateral and North American commitments, the Leaders reaffirmed their shared determination to promote equality and ensuring everyone lives free from discrimination, harassment, or violence. Canada and the United States remain committed to ensuring the full, equal, and meaningful participation of marginalized communities in our societies.</li>\n\t<li>The Leaders reaffirmed their shared commitment to promoting gender equality and empowering women and girls as essential for achieving a more peaceful, inclusive, and prosperous world.&nbsp;They underscored the importance of continued cooperation on the advancement of gender equity, including with respect to child benefits, early learning and childcare, pay equity, and women’s entrepreneurship, among other issues.</li>\n</ul><ol start=\"5\"><li><strong>Bolster Global Alliances: </strong>Canada and the United States are committed to the security of our treaty allies, including through the North Atlantic Treaty Organization (NATO), and to supporting our partners around the world.&nbsp;We are even stronger through our collaboration at and with the United Nations and other international organizations, alliances, and groups, including the G7, G20, the Five Eyes, and the Organization of American States.</li>\n</ol><ul><li>We condemn Russia for its illegal, unjustifiable, and unprovoked war against Ukraine, and will continue imposing economic costs on Russia, while maintaining our unwavering support for Ukraine for as long as it takes.</li>\n\t<li>Canada and the United States acknowledge the serious long-term challenge to the international order posed by the People’s Republic of China, including disruptive actions such as economic coercion, non-market policies and practices, and human rights abuses.&nbsp;While we will cooperate with China in areas of mutual interest, such as on climate change, we remain committed to ensuring our ability to compete effectively with China on a level playing field. Canada and the United States will also continue to cooperate on countering foreign interference in our societies in a manner that reflects our shared democratic values.</li>\n\t<li>We emphasize that our basic positions on Taiwan remain unchanged, and reiterate the importance of maintaining peace and stability across the Taiwan Strait as an indispensable element of security and prosperity in the international community.&nbsp;We encourage the peaceful resolution of cross-Strait issues.</li>\n\t<li>The Prime Minister and the President reaffirmed their commitment to the Americas Partnership for Economic Prosperity, and welcomed the first U.S.-Canada Indo-Pacific Strategic Dialogue on March 10 and will cooperate to promote a free, open, prosperous, secure, and resilient Indo-Pacific.</li>\n\t<li>Canada and the United States are working together to support countries around the world as they develop their economies to deliver inclusive and resilient growth, while fostering sustainable pathways to net zero emissions. Through the G7 Partnership for Global Infrastructure and Investment, we are collaborating to unlock public and private capital for quality infrastructure to create lasting positive impacts for low- and middle-income countries and support sustainable development, as well as benefit partners’ economic security and global supply chains. We are also advancing an ambitious agenda to evolve the multilateral development banks, starting with the World Bank, to better respond to global challenges, while also enhancing their work on poverty alleviation and meeting the Sustainable Development Goals.</li>\n\t<li>Canada and the United States also remain concerned about deteriorating security in Haiti, committed to increasing international support for the Haitian people, including through security and humanitarian assistance, enhanced support for the Haitian National Police, and by holding accountable those who undermine Haiti’s stability.</li>\n</ul><ol start=\"6\"><li><strong>Invest in Our Collective Defense and Security:&nbsp;</strong>Our highest priority is to protect our citizens and our sovereign territory.&nbsp;We will invest in the modernization of the North American Aerospace Defense Command (NORAD), including specifically:</li>\n</ol><ul><li>As part of a CAD $6.96 billion investment in surveillance system modernization, procuring and fielding two next generation Over-the-Horizon Radar (OTHR) systems covering the Arctic and Polar approaches, the first by 2028 to enhance early warning and domain awareness of North American approaches;</li>\n\t<li>CAD $7.3 billion in investments in the northern forward operating locations to support 5th generation aircraft and mobility/refueling assets, which capabilities should be in place prior to the arrival of the F-35 aircraft, including airfield improvements to accommodate aircraft personnel, fuel, and munitions, to ensure NORAD’s ability to deter and defend against emerging threats to our air and sea space and compete with China and Russia for years to come.</li>\n\t<li>The Prime Minister confirmed that the funding for these investments would come from Canada’s planned investments in defense infrastructure.&nbsp;These Canadian and U.S. efforts will bolster NORAD’s ability to detect threats earlier and more precisely and respond effectively.&nbsp;In the face of global threats, the Leaders acknowledged the importance of investment in modern, ready, and capable forces in line with their commitments to NATO under the 2014 Wales Summit Defence Investment Pledge.&nbsp;Such investments enable effective contributions to NATO, United Nations, and other global missions.</li>\n\t<li>The Leaders recognized the need to work in close collaboration to combat all criminal activity in our combined jurisdiction.&nbsp;The Cross-Border Crime Forum is key to the safety of both countries, by facilitating cooperation to reduce violent extremism, child sex exploitation, cross-border smuggling, and firearms violence on both sides of the border.</li>\n\t<li>Cyber threats can impact both Canadians and Americans, particularly when directed at cross-border systems on which we all rely.</li>\n\t<li>To better protect against these threats, we will deepen our cooperation on driving improvements to the cybersecurity and resiliency of our critical infrastructure.</li>\n\t<li>We will focus on two key sectors&nbsp;– pipelines and electricity – due&nbsp; to their criticality to our economies and their cross border nature.&nbsp;Further, we reiterate that in each of our countries, should an adversary choose to target critical infrastructure systems, we will both respond.</li>\n</ul><p>The opioid overdose crisis is having devastating health and economic consequences in our societies. We are united in our resolve to disrupt the illicit production and distribution of synthetic opioids like fentanyl and its precursor chemicals while augmenting our public health response.</p>\n\n<ul><li>Canada and the United States will expand multi-agency cooperation to improve intelligence sharing on cross-border fentanyl and precursor chemical trafficking to support interdictions and investigations, as part of our effort to bolster cooperation under U.S.-Canada Opioids Action Plan.</li>\n\t<li>Canada will join the United States as it builds a global coalition against synthetic drugs, underscoring Canadian and U.S. leadership in response to this shared security and public health challenge.&nbsp;Canada and the United States reaffirm their commitment from the tenth North American Leaders’ Summit to work with Mexico trilaterally to defeat the synthetic opioid crisis.</li>\n</ul><ol start=\"7\"><li><strong>Manage Migration Collaboratively:&nbsp;</strong>The Los Angeles Declaration on Migration and Protection enshrines our belief that irregular migration requires a regional approach centered on expanding legal pathways and humane border management and recognizes that we must address the underlying economic and security drivers of migration.&nbsp;Canada and the United States remain committed partners in advancing the principles of the Declaration.</li>\n</ol><ul><li>As part of its commitment to these principles, Canada will welcome an additional 15,000 migrants on a humanitarian basis from the Western Hemisphere over the course of the year to continue expanding safe, regular pathways offered throughout the hemisphere as an alternative to irregular migration, with a path to economic opportunities</li>\n\t<li>Additionally, Canadian and U.S. officials are now poised to implement an agreement to apply the terms of the Safe Third Country Agreement to asylum seekers who cross between ports of entry, which we anticipate will deter irregular migration at our shared border. We will remain in close coordination as we work to implement this new agreement.</li>\n</ul></div>\n      "
}