{
  "path": "/en/news/statements/2022/03/13/statement-prime-minister-closing-2022-paralympic-winter-games",
  "pageTitle": "Statement by the Prime Minister on the closing of the 2022 Paralympic Winter Games | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the closing of the 2022 Paralympic Winter Games:</p>\n\n<p>“Today, as the 2022 Paralympic Winter Games come to a close, we celebrate the great athletes who represented Canada during this year’s events. Over the past 10 days, our Paralympic athletes have inspired Canadians from coast to coast to coast.</p>\n\n<p>“As we watched them compete and follow their dreams, our Paralympians showed us why Canadians are some of the finest athletes in the world. Team Canada delivered stellar performances at this year’s Games, some of which resulted in incredible personal bests, Paralympic records, and podium finishes. As a country, we can all take pride in the 25 medals our athletes are bringing home. This is the second greatest performance by Team Canada at a winter Paralympics ever.</p>\n\n<p>“Brian McKeever took gold in the men’s visually impaired middle-distance cross country event, winning his 16th Paralympic gold medal and moving him into a tie for most titles won by a male winter Paralympian. Para alpine skier Mollie Jepsen won gold and silver medals at these games and lead Team Canada as the flag bearer at the closing ceremonies.</p>\n\n<p>“Our Paralympic athletes have met the unprecedented challenges presented by the COVID-19 pandemic with courage, integrity, and perseverance. They have shown Canadians everywhere what can be accomplished through hard work and determination.</p>\n\n<p>“On behalf of all Canadians, I congratulate our Paralympic athletes on their performances. Your achievements are a testament to our country’s diversity, strength, and resilience. Team Canada, you make us proud.”</p></div>\n      "
}