{
  "path": "/en/news/statements/2021/05/10/statement-prime-minister-national-nursing-week",
  "pageTitle": "Statement by the Prime Minister on National Nursing Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Nursing Week, which runs from May 10 to 16:</p>\n\n<p>“Today, as we mark the first day of <a href=\"https://www.cna-aiic.ca/en/news-room/events/national-nursing-week\">National Nursing Week</a>, we recognize these selfless professionals who undertake life-saving work every day.</p>\n\n<p>“Nurses are heroes of our health care system. They work tirelessly to deliver critical care to their patients and communities, and make Canada a better place to live. This year’s theme, ‘#WeAnswerTheCall’, highlights nurses’ courage and commitment, and reminds us of the many roles they play to keep our communities safe and healthy. Whether working in hospitals or medical centres, providing mental health services or caring for vulnerable seniors, including those in long-term care homes, nurses dedicate themselves to protecting our health and saving lives in a range of public health settings.</p>\n\n<p>“Since the start of the global COVID-19 pandemic, nurses across the country have been on the front lines, putting themselves in harm’s way, and undertaking physically and mentally exhausting work to keep their fellow Canadians safe. They have stepped up in our time of need, and the Government of Canada is doing everything it can to help protect them and other health care workers. Since the start of the pandemic, we have procured 2.7 billion pieces of personal protective equipment. We have also invested in additional health care support for provinces and territories through the Safe Restart Agreement, and a one-time top-up to the Canada Health Transfer, to help each jurisdiction address urgent health care needs.</p>\n\n<p>“Every day nurses are shouldering more responsibilities, and face significant strain to keep Canadians safe and bring us to the other side of the pandemic. But as the pandemic continues, we all have a role to play in keeping Canada’s nurses and other front-line health care workers safe and healthy. That means continuing to follow public health advice, including by keeping two metres apart and staying home as much as possible, wearing a mask, washing our hands regularly, and downloading and using the COVID Alert app. It also means getting your COVID-19 vaccine when it’s your turn to be vaccinated. All of the vaccines made available to Canadians have been approved by Health Canada, and are safe and effective. By getting yours, you will help keep your loved ones, our health care workers, and your entire community safe from this virus.</p>\n\n<p>“On this first day of National Nursing Week, I invite all Canadians to thank nurses for their selfless care and compassion, and to honour their sacrifices by continuing to follow public health guidelines. Nothing is more important than saving lives and keeping people safe and healthy. Today, I thank all nurses for their ongoing commitment and for taking such good care of us. Together, we will get through this.”</p></div>\n      "
}