{
  "path": "/en/news/statements/2022/09/15/statement-prime-minister-international-day-democracy",
  "pageTitle": "Statement by the Prime Minister on the International Day of Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Democracy:</p>\n\n<p>“Today, we join our allies and partners to mark the&nbsp;<a href=\"https://www.un.org/en/observances/democracy-day\">International Day of Democracy</a> and reiterate our unwavering commitment to upholding our democratic values and defending people’s inalienable rights and freedoms.</p>\n\n<p>“As the Ukrainian people bravely defend their country against Russia’s illegal and unjustifiable invasion, they are defending the values that define and unite democracies everywhere. Together, we must continue to support the people of Ukraine, counter authoritarianism, and help strengthen democracies across the globe.</p>\n\n<p>“There is a need to step up our efforts to make democracies around the world stronger and more resilient. Last March, we announced enhanced support for the G7 Rapid Response Mechanism which was initially established under Canada’s 2018 G7 Presidency to identify and respond to foreign threats to democracy, including disinformation. We are also increasing our support to expose and counter Russian state-sponsored disinformation around Ukraine – including with the creation of a dedicated unit at Global Affairs Canada to monitor and identify Russian disinformation.</p>\n\n<p>“Disinformation knows no borders. In Canada, our democratic institutions face growing threats from actors seeking to weaken them and undermine citizens’ trust in their own governments, including foreign interference and the spread of lies that seek to influence policy, public opinion, and undermine our democratic processes. That’s why we strengthened the <a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Plan to Protect Canada’s Democracy</a> and invested in projects that help Canadians become more resilient against disinformation through the Digital Citizen Initiative. We are also fortunate to have an independent, world-class electoral management body in Elections Canada, whose expertise in administering elections is critical to the health of our democracy.</p>\n\n<p>“Democracy can never be taken for granted. It requires constant, sustained work. It requires us to always deal in facts. And it requires us to fight the spread of lies. Today, we are reminded of our shared responsibility to do just that and protect our democracy now and for generations to come.”</p></div>\n      "
}