{
  "path": "/en/news/readouts/2021/10/30/prime-minister-justin-trudeau-meets-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Prime Minister Boris Johnson of the United Kingdom on the margins of the G20 Leaders’ Summit in Rome, Italy.</p>\n\n<p>Prime Minister Johnson congratulated Prime Minister Trudeau on his re-election.</p>\n\n<p>The two leaders discussed their expectations and shared priorities in advance of the COP26 summit taking place in Glasgow, United Kingdom, from October 31 to November 12.&nbsp;They agreed to work together to encourage greater leadership and ambition on climate change, particularly by large emitters.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson’s wide-ranging discussion touched on key foreign policy and global issues, including the need to push for inclusive governance and human rights in Afghanistan.</p>\n\n<p>The two leaders agreed to maintain close security cooperation and information sharing between Canada and the United Kingdom, and with other Five Eyes partners, and looked forward to working together to enhance engagement with the Indo-Pacific region.</p>\n\n<p>The prime ministers spoke about the deep ties that unite Canada and the United Kingdom, including a trade partnership that benefits workers and businesses on both sides of the Atlantic. Prime Minister Trudeau reiterated his support for the UK accession process to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, and the two leaders agreed to push forward with efforts to secure a comprehensive Free Trade Agreement between Canada and the UK.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson discussed other key issues on the G20 Leaders’ Summit agenda, including close cooperation on building back better from the pandemic through a range of health, economic, and climate initiatives. They also looked forward to continued dialogue on shared priorities in the Commonwealth.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-United Kingdom relations</a></li>\n\t<li><a href=\"https://www.g20.org/\">G20 Italy 2021</a></li>\n\t<li><a href=\"https://ukcop26.org/\">UK COP26 2021</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/ntnl-scrt/fv-cntry-mnstrl-en.aspx\">The Five Eyes</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n</ul></div>\n      "
}