{
  "path": "/en/news/news-releases/2017/09/23/prime-minister-helps-launch-invictus-games-toronto-2017",
  "pageTitle": "Prime Minister helps launch the Invictus Games Toronto 2017 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are committed to honouring the men and women of the Canadian Armed Forces and Veterans for their service and sacrifices. In this spirit, Canada is proud to host this year’s Invictus Games – the only international adaptive sporting event for wounded, injured, and ill active duty and Veteran service members.</p><p>The Prime Minister, Justin Trudeau, today helped launch the Invictus Games Toronto 2017. The Games were officially opened by His Excellency the Right Honourable David Johnston, Governor General and Commander-in-Chief of Canada. Earlier in the day, the Prime Minister met with the Canadian athletes to wish them well as they get ready to take on competitors from around the world.</p><p>The Invictus Games inspire recovery, support rehabilitation, and generate a wider understanding and respect of those who serve their country. They provide a unique opportunity for people to show support for ill, wounded, and injured soldiers, and their families.</p><p>The Invictus Games were created by His Royal Highness Prince Harry of Wales as a way to honour these heroes. Eight days of competitions will take place at state-of-the-art sport venues across Toronto. This year’s Invictus Games bring together 550&nbsp;competitors from 17 countries to compete in a dozen adaptive sports.</p><h2>Quote</h2><blockquote><p>“The Invictus Games are a unique and powerful way to honour those who have sacrificed so much on behalf of their country. They represent the best and deserve our gratitude forever. Over the next eight days, the Invictus Games will put the spotlight on the strength and resilience that characterized their service. Sophie and I wish every competitor the best of luck.”</p><p><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Invictus Games were created by Prince Harry after a visit to the U.S. Warrior Games in 2013. They were also inspired by his personal experiences during the Afghanistan War.</li><li>Team Canada comprises 90 competitors, of which approximately two thirds are Veterans with service related-physical or mental health injuries or illnesses.</li><li>Team Canada’s participation in the Games is made possible through the support of the Canadian Armed Forces’ Soldier On Program, in partnership with Invictus Games Toronto 2017.</li><li>Soldier On supports serving and former service personnel overcome physical or mental illness or injury through sport and physical activity. This re-introduction to an active lifestyle provides the member with opportunities to develop new skills, build confidence in their abilities, and meet peers with similar challenges.</li><li>Budget 2017 builds on the investments made in Budget 2016 with new measures that will recognize the important role of caregivers, help more families, support mental health, and pay for the education and training Veterans need to find the work they want in their post-military lives.</li><li>The Government of Canada has provided $17.5 million of funding to Invictus Games Toronto 2017. Veterans Affairs Canada has given $15 million for overarching support and Canadian Heritage has given $2.5 million for the opening and closing ceremonies.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.veterans.gc.ca/eng/about-us/department-officials/minister/budget/supporting-families\">Budget 2017 - Supporting the well-being of both Veterans and their families</a></li><li><a href=\"http://www.invictusgames2017.com/\">Invictus Games Toronto 2017</a></li><li><a href=\"https://www.cfmws.com/en/AboutUs/DCSM/Soldier_On/pages/default.aspx\">Soldier On</a></li></ul></div>\n      "
}