{
  "path": "/en/news/news-releases/2021/01/15/prime-minister-releases-supplementary-mandate-letters-ministers",
  "pageTitle": "Prime Minister releases supplementary mandate letters for ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The global COVID-19 pandemic is the most serious public health crisis Canada has ever faced. It has had devastating impacts on the lives and livelihoods of Canadians, and has exposed fundamental gaps in our society. The Government of Canada will keep doing whatever it takes, for as long as it takes, to have people’s backs during this difficult time. We will continue to support families and protect Canadians’ health and jobs as we work to build a stronger, more resilient country.</p>\n\n<p>To continue to support Canadians through the pandemic and build a healthier, cleaner, and fairer Canada, the Prime Minister, Justin Trudeau, today released supplementary mandate letters for Cabinet ministers.</p>\n\n<p>The supplementary mandate letters outline the government’s continued plan to address the challenges of today and prepare for the opportunities of the future. They reaffirm our top priorities, to keep Canadians safe and healthy and help people and businesses pay their bills through this continued crisis. They also outline our bold approach to build back better, which includes creating over one million new jobs, taking action to fight climate change, and ensuring everyone has an equal and fair chance at success.</p>\n\n<p>Since 2015, the Prime Minister has publicly released ministerial mandate letters to remain open, transparent, and accountable to Canadians. As we continue to battle this crisis, the government will deliver real results for all Canadians and take action to ensure everyone has the support they need.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The COVID-19 crisis has been difficult for all Canadians. As a team, we are committed to doing whatever it takes, for as long as it takes, to keep Canadians safe and supported. These mandate letters outline the actions that our government will continue to take to fight this pandemic, keep people safe, and build a Canada that is stronger, more resilient, and fairer for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The mandate letters released today add to the commitments laid out in the mandate letters released in December 2019. They outline further responsibilities and prioritize key areas of focus for the government to fight COVID-19 and ensure a strong economic recovery in Canada.</li>\n\t<li>Mandate letters outline the policy objectives that each minister will work to accomplish, as well as the pressing challenges they will address in their role. Mandate letters are not an exhaustive list of all files a minister will work on.</li>\n\t<li>Publicly available mandate letters help Canadians hold the government to account. They outline the Prime Minister’s expectations for each minister, and give Canadians a clear idea of how the government will deliver its agenda.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/mandate-letters\">Mandate letters</a></li>\n</ul></div>\n      "
}