{
  "path": "/en/news/statements/2019/05/08/statement-prime-minister-israel-independence-day",
  "pageTitle": "Statement by the Prime Minister on Israel Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom Ha’atzmaut, Israel Independence Day:</p>\n\n<p>“Tonight at sundown, we join Israelis, Jewish communities, and others in Canada and around the world to celebrate the 71st anniversary of the establishment of the State of Israel.</p>\n\n<p>“This year is special, as we also mark 70 years of diplomatic ties between Canada and Israel. Since 1949, our two countries have been close friends, steadfast allies, and partners in many international organizations. When the President of Israel, Reuven Rivlin, visited Canada just a few weeks ago, we had the opportunity to celebrate this important anniversary – and to make those ties even stronger.</p>\n\n<p>“Canada will continue to stand proudly with Israel, including through our strong support for Israel at the United Nations. That’s why, earlier this week, we condemned the rocket attacks by Hamas and other terrorist groups. And we will continue to condemn BDS and any movement that attacks our Israeli friends, Jewish Canadians, and the values we share.</p>\n\n<p>“Our close friendship is thanks in large part to Canada’s Jewish community, and the deep connections between people in our two countries. That’s just one of many examples of the major role Jewish Canadians play to help our country thrive.</p>\n\n<p>“For many Jewish communities, this year has been a difficult one, with recent brutal, antisemitic attacks fresh in our minds. Attacks against the Jewish community are attacks against all of us. We will always combat antisemitism and hatred in all its forms – and together, we’ll keep working to make our world a better one.</p>\n\n<p>“On behalf of the Government of Canada, I wish everyone celebrating this historic day a Yom Ha’atzmaut Sameach.”</p></div>\n      "
}