{
  "path": "/en/news/readouts/2022/05/12/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of France, Emmanuel Macron.</p>\n\n<p>The Prime Minister congratulated President Macron on his re-election, and looked forward to working together on the issues that matter most to people in Canada and France – from defending democracy, to fighting climate change, to creating good jobs and economic growth for the middle class. The Prime Minister and President discussed arranging an inaugural joint meeting of the Councils of Ministers in Canada. Noting the approaching anniversary of June 6, the leaders discussed the significance of Juno Beach to the history and people of both nations and committed to protecting the site so future generations will remember the sacrifice of Canadian soldiers who landed there in 1944.</p>\n\n<p>The Prime Minister and President condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and praised the courage and leadership of Ukrainian President Volodymyr Zelenskyy and the Ukrainian people. The two leaders called on Russia for&nbsp;an immediate ceasefire and withdrawal of troops and&nbsp;agreed on the need to further coordinate with partners and allies on continued support for Ukraine.</p>\n\n<p>Prime Minister Trudeau and President Macron discussed the global impacts of the war in Ukraine, notably for energy prices and food security. They agreed to further collaborate through bilateral and multilateral channels to deliver coordinated responses to these challenges in support of those most affected, notably in Africa and the Middle East. In discussing the work of the Organisation internationale de la Francophonie, the Prime Minister and President agreed on the importance of the organization’s work to promote democratic values and human rights.</p>\n\n<p>Prime Minister Trudeau and President Macron agreed to remain in close contact on these and other issues of shared interest in the near future.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/04/24/statement-prime-minister-result-frances-presidential-election\">Statement by the Prime Minister on the result of France’s presidential election</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/08/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/17/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron\">Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron</a></li>\n</ul></div>\n      "
}