{
  "path": "/en/news/news-releases/2021/06/22/prime-minister-announces-appointment-three-senators",
  "pageTitle": "The Prime Minister announces the appointment of three Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Administrator of the Government of Canada appointed Bernadette Clement, Hassan Yussuff, and James Quinn as independent Senators to fill vacancies for Ontario and New Brunswick.</p>\n\n<p>Ms. Clement is a lawyer, the Executive Director of the Roy McMurtry Legal Clinic, and current Mayor of Cornwall, who has devoted much of her life to the betterment of the city. Through various professional and volunteer leadership roles, she has served many members of her community, including newcomers, women fleeing violence, and people with developmental disabilities. She is also a tireless advocate for injured workers, and the first Black woman to serve as mayor in Ontario.</p>\n\n<p>Mr. Yussuff is one of Canada’s most experienced labour leaders, and the first person of colour to lead Canada’s union movement. He recently concluded his second term as the President of the Canadian Labour Congress. He is also the past President of the Trade Union Confederation of the Americas, an international organization that represents more than 55 million workers in 21 countries. Mr. Yussuff has received numerous leadership awards, as well as honorary doctorates from two universities.</p>\n\n<p>Mr. Quinn is a certified public and management accountant, and the current President and Chief Executive Officer of the Saint John Port Authority. He previously led an extensive and distinguished career in the public service, including as the Chief Financial Officer at the Canadian International Development Agency. He is the Honorary Lieutenant-Colonel for the 3rd Field Artillery Regiment (The Loyal Company), 5th Canadian Division. Mr. Quinn has received several awards for his financial leadership – most notably the inaugural Award of Excellence for Comptrollership in the Public Sector.</p>\n\n<p>These individuals were recommended by the Independent Advisory Board for Senate Appointments, and chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Ms. Clement, Mr. Yussuff, and Mr.&nbsp;Quinn are exemplary public servants and community leaders who have dedicated their careers to making a difference in the lives of others. I look forward to working with them, and all Senators, as we continue to fight the global COVID-19 pandemic, take steps toward our recovery, and build back a more resilient and inclusive Canada for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>There have been 55 independent appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. Until the next Governor General is installed, His Excellency the Right Honourable Richard Wagner, P.C., is fulfilling the role and responsibilities of the Governor General as the Administrator of the Government of Canada, including summoning individuals to the Senate.</li>\n\t<li>By convention, Senators are appointed on the advice of the Prime Minister.</li>\n\t<li>In 2016, the selection process for Senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n\t<li>The Board is guided by merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General or the Administrator, new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial or territorial, and minority interests – important functions in a modern democracy.</li>\n\t<li>The Senate is the Upper House in Canada’s parliamentary democracy. It unites a diverse group of accomplished Canadians in service of their country. Created to counterbalance representation by population in the House of Commons, the Senate has evolved from defending regional interests to creating space for the voices of historically underrepresented groups like Indigenous peoples, racialized communities, and women.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/22/bernadette-clement\">Bernadette Clement</a></li>\n\t<li><a href=\"/en/news/backgrounders/2021/06/22/hassan-yussuff\">Hassan Yussuff</a></li>\n\t<li><a href=\"/en/news/backgrounders/2021/06/22/james-quinn\">James Quinn</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.sencanada.ca/en\">Senate of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n</ul></div>\n      "
}