{
  "path": "/en/news/readouts/2020/09/02/prime-minister-justin-trudeau-speaks-prime-minister-japan-shinzo-abe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Japan Shinzo Abe | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Japan, Shinzo Abe.</p>\n\n<p>Prime Minister Trudeau expressed his appreciation for Prime Minister Abe’s leadership and vision during his tenure as Japan’s longest-serving Prime Minister. He thanked Prime Minister Abe for his critical role in securing the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which has created major opportunities for job growth and opened up new markets for Canadian businesses and entrepreneurs, and further strengthened the relationship between Canada and Japan. Prime Minister Trudeau also commended Prime Minister Abe’s efforts to promote a free and open Indo-Pacific region, which advances our shared values and commitment to multilateralism and a rules-based international order.</p>\n\n<p>The prime ministers discussed their close working relationship at several G7 and G20 summits, including the 2016 G7 Ise-Shima summit, the 2018 G7 summit in Charlevoix, and the 2019 G20 summit in Osaka. They also spoke of recent milestones in the bilateral relationship, including Prime Minister Abe’s official visit to Canada in April 2019. The leaders noted their countries’ ongoing cooperation in the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON.</p>\n\n<p>Prime Minister Trudeau thanked Prime Minister Abe for his personal commitment to further growing our partnership. Thanks to his efforts, the friendship between the two countries is as strong and vibrant as ever. Prime Minister Trudeau also praised Prime Minister Abe’s global leadership, which will leave a lasting mark on the world stage.</p>\n\n<p>Prime Minister Trudeau expressed his best wishes for Prime Minister Abe’s health and thanked him for his friendship.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2019/06/the-canadian-armed-forces-begin-new-operation-to-help-monitor-north-korea-sanctions.html\">Operation NEON</a></li>\n</ul></div>\n      "
}