{
  "path": "/en/news/news-releases/2020/02/01/prime-minister-travel-ethiopia-senegal-and-germany",
  "pageTitle": "Prime Minister to travel to Ethiopia, Senegal, and Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Ethiopia, Senegal, and Germany, from February 6 to 14, 2020.</p>\n\n<p>These visits will focus on economic opportunity and prosperity, climate change, democracy, and gender equality, as Canada deepens our relationships in the region and advances new partnerships that will benefit Canadians.</p>\n\n<p>The Prime Minister will travel first to Addis Ababa, Ethiopia, where he will meet with Prime Minister Abiy Ahmed and President Sahle-Work Zewde, as well as Ethiopian partners and stakeholders. Accompanied by the Minister of Small Business, Export Promotion and International Trade, Mary Ng, and her trade delegation, he will promote trade and investment opportunities between our two countries. He will also meet with world leaders attending the 33rd African Union Summit, and participate in side events focused on deepening our relationships with African countries, and advancing economic growth through the creation of jobs and opportunities for young people, innovative climate action, the promotion of democracy, and the empowerment of women and girls.</p>\n\n<p>The Prime Minister will then travel to Dakar, Senegal, where he will meet with the President of Senegal, Macky Sall. He will also participate in a series of events to further our two countries’ already strong ties through La Francophonie, by discussing and promoting other areas such as trade and investment, peacekeeping and democracy, gender equality, and climate change.</p>\n\n<p>Finally, Prime Minister Trudeau will attend the Munich Security Conference in Germany. There, he will meet with world leaders and international security experts to explore lasting solutions to major global security challenges.</p>\n\n<p>As we pursue our candidacy for election to the United Nations Security Council, we will continue to advance shared global interests, and unlock new opportunities for people and businesses in Canada and around the world. &nbsp;</p>\n\n<p>The Minister of Foreign Affairs, François-Philippe Champagne, and the Minister of Families, Children and Social Development, Ahmed Hussen, will also join the Prime Minister for certain portions of the visits.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“In a rapidly changing world, Canada needs to be a leader on the international stage and continue to build new relationships to advance the things most important to Canadians. We are ready to work with partners to fight climate change, create economic growth, advance gender equality, promote democracy, and find innovative ways to help Canadian people and businesses succeed. I look forward to meeting with other leaders so we can work together to build a more prosperous path forward for everyone.”</p>\n\n<footer class=\"default\"><em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The theme for the 33rd African Union Summit is “Silencing the Guns: Creating Conducive Conditions for Africa’s Development”.</li>\n\t<li>Canada established diplomatic relations with Ethiopia in 1965, and our two countries share goals based on regional security interests, growing commercial ties, and social, economic, and political development.</li>\n\t<li>Canada and Senegal established diplomatic relations in 1962. Our two countries cooperate to advance peace and security in the region, and are both active members of La Francophonie, a group of 88 member states and governments from five continents sharing French as a common language.</li>\n\t<li>Founded in 1963, the annual Munich Security Conference brings together world leaders, government ministers and officials, parliamentarians, senior military officers, academics, journalists and other leaders to discuss current and future security challenges.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/senegal/bilateral_relations_bilaterales/canada_senegal.aspx?lang=eng\">Canada-Senegal relations</a></li>\n\t<li><a href=\"https://securityconference.org/\">Munich Security Conference</a></li>\n</ul></div>\n      "
}