{
  "path": "/en/news/readouts/2023/04/25/prime-minister-justin-trudeau-speaks-african-union-commission-chairperson",
  "pageTitle": "Prime Minister Justin Trudeau speaks with African Union Commission Chairperson Moussa Faki Mahamat | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Chairperson of the African Union Commission, Moussa Faki Mahamat, regarding the situation in Sudan.</p>\n\n<p>Prime Minister Trudeau expressed his deep concern about the ongoing conflict, the impact on civilians – including vulnerable populations – and the risks to regional stability. He highlighted his concern that conflict jeopardized Sudan’s efforts to establish civilian rule.</p>\n\n<p>The two leaders discussed the ongoing mediation efforts. They urged all parties to cease hostilities, to participate in the mediation efforts supported by regional partners encouraging peaceful dialogue and lasting peace, and to return to the negotiation table to establish a civilian government.</p>\n\n<p>The Prime Minister thanked Chairperson Faki for his personal involvement in the efforts to end the violence. He underscored that Canada values the leadership of the African Union, the Intergovernmental Authority on Development in Eastern Africa (IGAD), and other players who seek to restore peace. He offered Canada’s support in pursuing a peaceful solution to the conflict.</p>\n\n<p>Prime Minister Trudeau and African Union Commission Chairperson Faki agreed to remain in contact.</p>\n\n<h2>Related Links</h2>\n\n<ul><li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/26/prime-minister-justin-trudeau-meets-african-union-commission-chairperson\">Prime Minister Justin Trudeau meets with African Union Commission Chairperson Moussa Faki Mahamat</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/sudan-soudan.aspx?lang=eng\">Canada’s response to the crisis in Sudan</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"https://au.int/en\">African Union</a></li>\n</ul></div>\n      "
}