{
  "path": "/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-national-chief-assembly",
  "pageTitle": "Statement by the Prime Minister, Justin Trudeau, and the National Chief of the Assembly of First Nations, Perry Bellegarde | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada and the National Chief of the Assembly of First Nations issued a joint statement today on the Pan-Canadian Framework on Clean Growth and Climate Change:</p>\n<p>“As referenced in the Elders’ Statement delivered today by Elmer Courchene: ‘With our spiritual laws, practices, experiences and relationships with our lands and territories, First Nations have a vital role in defending and healing Mother Earth. This is our obligation.’</p>\n<p>“Canada and the Assembly of First Nations (AFN) recognize that First Nations are climate leaders. First Nations have demonstrated great resiliency. They are among the most vulnerable to a rapidly changing environment due to significant social, cultural, ecological, and economic impacts and historic failure to respect First Nations rights. Together, Canada and First Nations will collaborate on climate change action to limit its impacts, and transition to a cleaner economy that will create more opportunities for First Nations throughout the country, including in remote, coastal and northern communities.&nbsp;</p>\n<p>“We agree to work together to ensure First Nations are full and effective partners in advancing clean growth and addressing climate change. This will be done through robust, ongoing and meaningful engagement based on recognition of rights, respect, cooperation and partnership, consistent with the United Nations Declaration on the Rights of Indigenous Peoples, including free, prior and informed consent.</p>\n<p>“The AFN, through the Advisory Committee on Climate Action and the Environment, will begin its discussions on a First Nations-led climate plan that prioritizes First Nations issues, rights and interests.</p>\n<p>“Therefore, in taking action on climate change and in moving forward on the implementation of the Pan-Canadian Framework on Clean Growth and Climate Change, a structured, collaborative approach for meaningful engagement will be pursued between the Government of Canada and First Nations. This will ensure that First Nations are full and effective partners in advancing clean growth and achieving climate change goals to mitigate and reduce emissions as a necessary precursor to the mitigation of climate impacts on First Nations.&nbsp;</p>\n<p>“The Framework builds on the Paris Agreement and reinforces that the rights of First Nations need to be recognized and respected when taking action to address climate change. Our partnership and engagement reflects our joint commitment to renewing the relationship between the Government of Canada and First Nations on a nation-to-nation basis.</p>\n<p>“First Nations across the country are demonstrating climate leadership, and are active drivers of positive change towards a cleaner environment to the benefit of all Canadians. Working together on climate change and the implementation of this Framework is another step toward reconciliation between Canada and First Nations, and will help build a more sustainable, prosperous and inclusive country for all.”</p>\n<p><strong><br>Related Products</strong></p>\n<ul>\n<li>S<a href=\"/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-president-métis-national\">tatement by the Prime Minister, Justin Trudeau, and the President of the Métis National Council, Clément Chartier</a></li>\n<li><a href=\"/en/news/statements/2016/12/09/commitment-action-prime-minister-canada-justin-trudeau-and-president\">Commitment to action by the Prime Minister of Canada, Justin Trudeau, and the President of Inuit Tapiriit Kanatami, Natan Obed</a></li>\n<li><a href=\"/en/news/backgrounders/2016/12/09/process-document-ongoing-engagement-pan-canadian-framework-clean\">Process Document for Ongoing Engagement on the Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}