{
  "path": "/en/news/news-releases/2019/11/17/his-majesty-king-abdullah-ii-jordan-visit-canada",
  "pageTitle": "His Majesty King Abdullah II of Jordan to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Majesty King Abdullah II of Jordan will visit Canada on November&nbsp;18.</p>\n\n<p>During the visit, the two leaders will hold a bilateral meeting to discuss further strengthening the partnership between Canada and Jordan, and their pledge to work together to promote diversity and counter violent extremism. They will also discuss peace and regional security in the Middle East.</p>\n\n<p><strong>Quote</strong></p>\n\n<blockquote>\n<p>“Our two countries are bound by deep and important ties, from the vibrant Jordanian-Canadian community, to the many Canadians living and working in Jordan. I look forward to welcome His Majesty King Abdullah II to Canada as we discuss shared priorities for Canadians and Jordanians alike.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<p><strong>Quick Facts</strong></p>\n\n<ul>\n\t<li>This will be His Majesty King Abdullah II’s fifth visit to Canada since his ascension to the throne in February 1999.</li>\n\t<li>Canada and Jordan are both founding supporters of the “Christchurch Call to Action to Eliminate Terrorist and Violent Extremist Content Online.”</li>\n\t<li>Canada also works closely with Jordan on the Aqaba Process, led by King Abdullah, which enhances coordination and cooperation among international stakeholders in countering terrorist and extremist ideologies.</li>\n\t<li>Canada has been an important trade and investment partner for Jordan since the implementation of the Canada-Jordan Free Trade Agreement.</li>\n\t<li>Through development and humanitarian assistance programs, Canada supports the Government of Jordan’s efforts to provide a safe haven for over 660,000 registered Syrian refugees who have taken sanctuary in the country.&nbsp;</li>\n\t<li>Canada also works closely with Jordan to help resettle people fleeing ongoing crises in the region.&nbsp;Jordan offers a safe environment from which families can be processed for resettlement in Canada.</li>\n</ul>\n\n<p><strong>Associated Links</strong></p>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/jordan-jordanie/relations.aspx?lang=eng\">Canada-Jordan Relations</a></li>\n\t<li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/jordan-jordanie/fta-ale/background-contexte.aspx?lang=eng\">Canada-Jordan Free Trade Agreement</a></li>\n\t<li><a href=\"http://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/where-ou/jordan-jordanie.aspx?lang=eng\">Canada’s international assistance in Jordan</a></li>\n\t<li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/middle_east-moyen_orient/index.aspx?lang=eng\">Canada's Middle East engagement strategy</a></li>\n\t<li><a href=\"http://theglobalcoalition.org/en/home/\">The Global Coalition against Daesh</a></li>\n</ul></div>\n      "
}