{
  "path": "/en/news/statements/2022/08/08/statement-prime-minister-death-honourable-bill-graham",
  "pageTitle": "Statement by the Prime Minister on the death of the Honourable Bill Graham | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of the Honourable Bill Graham:</p>\n\n<p>“It was with sadness that I learned of the passing of William ‘Bill’ Graham, an accomplished lawyer, academic, philanthropist, and former federal Cabinet minister and Leader of the Official Opposition.</p>\n\n<p>“Mr. Graham dedicated his life to the service of others and to our country. From promoting bilingualism and multiculturalism to affordable housing, and standing up for LGBTQ2 rights, his impact on the lives of Torontonians and all Canadians is extensive.</p>\n\n<p>“During his studies, Mr. Graham proudly served as a Sub-Lieutenant within the Naval Reserve of the Royal Canadian Navy. After receiving his Doctorate of Laws from the University of Paris, he practised law and taught at several universities. He was one of Canada’s foremost experts in international law and international trade law before becoming a long-serving Member of Parliament, representing the people of Toronto. He loved Toronto, and made time to speak with the people who called it home – in fact, he could often be spotted riding his bicycle to meet with his constituents.</p>\n\n<p>“As a parliamentarian, Mr. Graham held key Cabinet positions. He steered Canada’s foreign and defence policy during the turbulent times that followed the 9/11 attacks as Canada’s Minister of Foreign Affairs and later as Minister of National Defence. Mr.&nbsp;Graham will be remembered as a master negotiator and a skilled statesman who shared his love for Canada with the world.</p>\n\n<p>“Following his retirement from politics, Mr. Graham served in a number of important roles, including as Chair of the Atlantic Council of Canada (now the NATO Council of Canada), Co-Chair of the Canadian International Council, Honorary Colonel of the Governor General’s Horse Guards, and Chancellor of Trinity College in the University of Toronto. He also created, endowed, and served as Chair of the Bill Graham Centre for Contemporary and International History at the University of Toronto.</p>\n\n<p>“In recognition of his many accomplishments, Mr. Graham received honorary doctorates from several universities, and was made an Officer of the Order of Canada. A past President of the Alliance Française de Toronto, he was recognized for his contributions to advancing French and was granted several important recognitions, including Chevalier de la Légion d’honneur (France) and Chevalier de l’Ordre de la Pléiade (Organisation internationale de la francophonie).</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our condolences to Mr.&nbsp;Graham’s family, friends, and colleagues. He was a dedicated public servant, a strong leader, and a respected expert in his field. His accomplishments, dedication, and service will remain an inspiration to Canadians.”</p></div>\n      "
}