{
  "path": "/en/news/news-releases/2021/06/15/prime-minister-concludes-productive-canada-european-union-summit",
  "pageTitle": "Prime Minister concludes productive Canada-European Union Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the Canada-European Union (EU) Leaders’ Summit with the President of the European Council, Charles Michel, and the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>During the Summit, the leaders made a firm commitment to work together to end COVID-19 and build a global recovery that creates jobs and opportunities for our people, and grows the middle class. They also pledged to continue fighting climate change and protecting the environment, increasing collaboration on technology and innovation, and advancing international peace and security. The leaders renewed their commitment to promoting shared values such as democracy, human rights, gender equality, and the rule of law.</p>\n\n<p>The leaders announced a new strategic partnership on raw materials to help ensure the security of supply chains for the critical minerals and metals that are essential to the transition to a cleaner and digitized economy, including for use in electric vehicles and advanced battery storage. The new partnership will also advance collaboration on research and innovation in raw material extraction and processing, and create new trade opportunities and private and public investment for our businesses.</p>\n\n<p>The leaders also reaffirmed the strong trade ties between Canada and the EU under the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which is creating opportunities for businesses and good, middle-class jobs for workers on both sides of the Atlantic. To build on this relationship, the leaders advanced an Authorized Economic Operator Mutual Recognition Agreement that will simplify border procedures and speed up the flow of trade between Canada and the EU, while enhancing security measures to ensure the safety and security of Canadians. For Canadian businesses, this means more predictability at the border and fewer fees and delays.</p>\n\n<p>To support cooperation on pandemic prevention, preparedness, and response, the leaders agreed to launch a new bilateral Dialogue on Health. The dialogue will also enhance engagement between Canada and the EU on other priority health issues, such as mental health.</p>\n\n<p>The leaders announced the launch of several initiatives to coordinate action against climate change and biodiversity loss. This included a joint Ocean Partnership Forum to facilitate industry and other stakeholders in sharing their perspectives on how we can better protect and facilitate the sustainable use of our oceans. They also announced the launch of an action plan to help promote sustainability, environmental stewardship, and climate action in agriculture. Sustainable agriculture and food systems have an essential role to play in fighting climate change, and this initiative will include joint workshops with farmers, industry, and non-governmental organizations.</p>\n\n<p>To support the digital transition, make our economies more competitive, and create new middle-class jobs for our people, the leaders committed to expanding their cooperation under the Canada-EU Digital Dialogue and the Global Partnership on Artificial Intelligence. Canada and the EU will advance projects and workshops that support cross-border digital initiatives and solutions, which will help strengthen a post-pandemic recovery of businesses, while driving new investments and trade in digital technologies.</p>\n\n<p>The leaders agreed to take steps toward Canada becoming an associate member of Horizon Europe, the EU’s flagship research and innovation program. This would enable Canadian researchers to have the same access and privileges as EU researchers do.</p>\n\n<p>Prime Minister Trudeau also reaffirmed Canada’s role as a participant in an EU permanent structured cooperation project on military mobility. The project will enable free and fast movement of personnel and assets within the EU to better keep our people safe -- a first for a non-EU-country, alongside the US and Norway. It will also further reinforce cooperation between security and defence partners across the Atlantic.</p>\n\n<p>By working with our EU partners, we can better tackle the issues that Canadians and Europeans care about most. Together, we will create new middle-class jobs for our workers and new opportunities for businesses, finish the fight against COVID-19, take strong climate action, and build back better for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the EU have a long history of close cooperation. Over the past year, the challenges brought on by COVID-19 have demonstrated the importance of working together to end the pandemic and tackle global issues. By strengthening our relationship, we are able to keep our people safe and healthy, create good, middle class jobs, and build back better in a way that works for everyone. ”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The last in-person Canada-EU Leaders’ Summit took place in Montréal in July 2019, when Prime Minister Trudeau hosted former President of the European Council, Donald Tusk. A virtual leaders' meeting was held on October 29, 2020.</li>\n\t<li>Despite the challenges brought on by the COVID-19 pandemic, CETA has resulted in bilateral merchandise trade being 15 per cent higher in 2020 than it was in 2016.</li>\n\t<li>The Canada-EU Strategic Partnership Agreement was signed at the same time as CETA, and deepens the Canada-EU partnership when it comes to foreign policy, international peace and security, and development cooperation.</li>\n\t<li>The Ocean Partnership Declaration was signed at the Canada-EU Summit in Montréal on July 18, 2019. The declaration commits both parties to:\n\t<ul>\n\t\t<li>collaborate on ocean research and observation efforts.</li>\n\t\t<li>work together to combat illegal, unreported, and unregulated fishing.</li>\n\t\t<li>build on commitments made during the 2018 G7 Leader’s Summit, &nbsp;including the Charlevoix Blueprint for Healthy Oceans, Seas and Resilient Coastal Communities, and the Ocean Plastics Charter.</li>\n\t</ul>\n\t</li>\n\t<li>The Global Partnership on Artificial Intelligence (GPAI) was first announced by Prime Minister Trudeau and President Macron during Canada’s G7 presidency in 2018, and formally launched in June 2020. Canada will hand over the chairmanship of the GPAI to France in November 2021.&nbsp;</li>\n\t<li>Canada’s longstanding science and research collaboration with the EU has resulted in significant scientific, economic, and social benefits, including through Horizon Europe’s predecessor program, Horizon 2020.</li>\n\t<li>The World Circular Economy Forum will focus on issues and topics that are central to economic recovery and the transition to the circular economy, a new way of doing business that extracts as much value as possible from resources by recycling, repairing, reusing, repurposing, or refurbishing products and materials and thereby eliminating waste and greenhouse gas emissions.</li>\n\t<li>Prime Minister Trudeau also reiterated that Canada will host the World Circular Economy Forum from September 13 to 15, 2021 – the first time it will be hosted in North America.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/15/canada-european-union-summit-joint-statement\">Canada-European Union Summit – Joint Statement</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/spa-aps.aspx?lang=eng\">Strategic Partnership Agreement (SPA)</a></li>\n\t<li><a href=\"https://gpai.ai/\">The Global Partnership on Artificial Intelligence (GPAI)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/conservation/sustainability/circular-economy/world-forum-2021.html\">World Circular Economy Forum 2021</a></li>\n</ul></div>\n      "
}