{
  "path": "/en/news/news-releases/2020/04/08/changes-canada-summer-jobs-program-help-businesses-and-young",
  "pageTitle": "Changes to Canada Summer Jobs program to help businesses and young Canadians affected by COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking unprecedented action to support workers, businesses, and all Canadians impacted by the COVID-19 pandemic. Right now, young people are facing serious challenges finding work. To build the foundations of strong communities, we need a strong workforce that includes good job opportunities for youth. That is why the government is working to help employers adapt to the realities of COVID-19, and supporting young Canadians as they begin to look for summer employment. &nbsp;</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, announced temporary changes to the Canada Summer Jobs program that will help employers hire summer staff and provide young Canadians access to the jobs they need during this unprecedented time. This program will help create up to 70,000 jobs for youth between 15 and 30 years of age.</p>\n\n<p>Canada’s small businesses increasingly depend on the employment of young Canadians. The changes to the Canada Summer Jobs program will help small businesses hire and keep the workers they need so they can continue to deliver essential services.</p>\n\n<p>The temporary changes to the program for this year include:</p>\n\n<ul>\n\t<li>an increase to the wage subsidy, so that private and public sector employers can also receive up to 100 per cent of the provincial or territorial minimum hourly wage for each employee</li>\n\t<li>an extension to the end date for employment to February 28, 2021</li>\n\t<li>allowing employers to adapt their projects and job activities to support essential services</li>\n\t<li>allowing employers to hire staff on a part-time basis</li>\n</ul>\n\n<p>These changes will help youth stay connected to the labour market, save money for their future, and find quality jobs in safe, inclusive, and healthy work environments.</p>\n\n<p>Today’s announcement builds on the government’s action taken for young Canadians during this crisis. This includes a six-month, interest-free moratorium on Canada Student Loans, and a 75 per cent wage subsidy for businesses that will help more employers keep part-time employees and workers over the coming months. Despite these important steps, there is still more to do for students and young Canadians. The Government of Canada will continue to look for ways to support all Canadians, including students and young people, as we weather this pandemic together.</p>\n\n<p>The Canada Summer Jobs program provides opportunities for youth to develop and improve their skills within the not-for-profit, small business, and public sectors, and supports the delivery of key community services. By adapting the program this year, the Government of Canada is making sure that we have the resources needed to support Canadian workers, businesses, and communities dealing with the social and economic impacts of COVID-19.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Small businesses and community organizations are the backbone of our economy, and a critical lifeline for communities across this country. They are facing economic hardship and unprecedented service demands during the COVID-19 pandemic, and that is why we are taking action now to get them the financial help they need to keep their doors open and support their communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In these extraordinary times, we realize the impacts small businesses, not-for-profit organizations, and public sector employers have on our economy and our communities. Our role is to support them. This is why the Government of Canada has made changes to the Canada Summer Jobs program, so that we can help employers help their communities through good quality, safe job placements for youth.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The changes to the Canada Summer Jobs program complement the Government of Canada’s COVID-19 Economic Response Plan, which committed $107 billion in support to Canadians and businesses facing hardship as a result of COVID-19.</li>\n\t<li>The Canada Summer Jobs call for applications for the 2020 season closed on February 28, 2020. In response to the economic impacts created by the COVID-19 situation, we will work with Members of Parliament to identify organizations that provide essential services in the community and could provide youth jobs but did not apply for the Canada Summer Jobs program in 2020.</li>\n\t<li>The Government of Canada has earmarked $263 million in funding for the Canada Summer Jobs program in 2020. This funding will help create up to 70,000 jobs for youth between 15 and 30 years of age, and we will be working with employers to explore work options that reflect the latest public health advice.</li>\n\t<li>Job placements could begin as early as May 11, 2020, and end as late as February 28, 2021.</li>\n\t<li>Youth will be able to search for jobs available in their communities through the <a href=\"https://www.jobbank.gc.ca/home\">Job Bank website and app</a>.</li>\n\t<li>In previous years, private and public sector employers were only eligible to receive a wage subsidy of up to 50 per cent of the provincial or territorial minimum wage. The increase to the wage subsidy for private and public sector employers will be for this year only.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/funding/canada-summer-jobs.html\">Canada Summer Jobs</a></li>\n</ul></div>\n      "
}