{
  "path": "/en/news/news-releases/2020/04/14/prime-minister-announces-health-and-social-support-northern",
  "pageTitle": "Prime Minister announces health and social support for northern communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As the COVID-19 pandemic continues to evolve, it is more important than ever to make sure that all Canadians have access to the quality food and essential health care they need. That is why the Government of Canada is working with partners, including territorial governments, to address the unique needs of Northerners.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced additional support to address immediate health, economic, and transportation needs in the North. These measures will:</p>\n\n<ul>\n\t<li>transfer $72.6 million to the governments of Yukon, Northwest Territories, and Nunavut to support their COVID-19 health and social services preparations and response. This funding will help territories address the critical priorities they identified to minimize the spread of the virus.</li>\n\t<li>provide up to $17.3 million to the governments of Yukon, Northwest Territories, and Nunavut to support northern air carriers. This funding, in partnership with investments by the territorial governments, will ensure the continued supply of food, medical supplies, and other essential goods and services to remote and fly-in communities.</li>\n\t<li>make available $15 million in non-repayable support for businesses in the territories to help address the impacts of COVID-19. This support will assist businesses with operating costs not already covered by other Government of Canada measures.</li>\n\t<li>provide an additional $25 million to Nutrition North Canada to increase subsidies so families can afford much-needed nutritious food and personal hygiene products.</li>\n</ul>\n\n<p>Northerners are also receiving help through the Harvesters Support Grant, which was developed in direct collaboration with Indigenous partners. The grant helps to improve food security by increasing access to traditional foods and alleviating the high costs associated with traditional hunting and harvesting activities.</p>\n\n<p>The funding announced today builds on both the $500 million provided to provinces and territories, and the $305 million provided to Indigenous communities, as part of the Government of Canada’s response to COVID-19. The government will continue to work with all of our partners to keep Northerners and all Canadians safe and healthy. Together, we will provide all communities with the support they need to respond effectively to this crisis.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“No Canadian should ever have to worry about where to get their food or how to receive essential health care services. That is why we are working with the territories and Indigenous partners to address the unique needs of northern communities as they respond to COVID-19. Together, we will make sure that Northerners can access the food, supplies, health care, and services they need during this challenging time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government has been working with northern and Indigenous partners to address the unique and critical needs of Northerners. These supports will ensure that northern residents have the supports they need to prepare for and respond to the COVID-19 pandemic. From access to health services, to the continuation of the supply chain through air supports, and greater subsidies on essential items, we are taking actions to help Northerners when they need it most.”</p>\n\n<footer class=\"default\">The Hon. Daniel Vandal, Minister of Northern Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“We must all work together to take care of Canadians during this challenging time. Our northern and remote communities rely on air service to bring them food, medical supplies, mail, and other essential goods and services. Our government remains committed to maintaining a focused, safe, and reliable air transport network for these communities.”</p>\n\n<footer class=\"default\">The Hon. Marc Garneau, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“Northern communities, in particular those in remote and fly-in only parts of the country, are uniquely vulnerable during this crisis. Communities are incredibly resilient and full of solutions and innovative ideas, and I want to recognize their strength. These measures are the product of vital discussions with northern and Indigenous partners and will ensure access to food and to essential supplies. They will also ensure vital economic support during this pandemic. This is only the beginning. We will continue to work with Indigenous partners to identify and deliver on their specific needs and to make sure no one is left behind.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“In recognition of the unique challenges of the northern business community, the Canadian Northern Economic Development Agency will immediately make available $15 million in funding, including direct support for ongoing costs incurred by northern small- and medium-sized businesses, in order to help them continue to play their vital role in northern communities. CanNor’s strong relationships with territorial governments best position the Agency to ensure relief efforts are complementary and that funding gets to the businesses that need it the most.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Economic Development and Official Languages, and Minister responsible for the Canadian Northern Economic Development Agency</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada will provide funding to the governments of Yukon, Northwest Territories, and Nunavut as follows:\n\t<ul>\n\t\t<li>$18.4 million for Yukon and up to $3.6 million for air services</li>\n\t\t<li>$23.4 million for the Northwest Territories and up to $8.7 million for air services</li>\n\t\t<li>$30.8 million for Nunavut and up to $5 million for air services</li>\n\t</ul>\n\t</li>\n\t<li>To support critical air services to northern and remote communities, the territorial governments will manage contracts with air carriers so they can maintain a basic network of routes and services to provide access to critical goods to fly-in communities in the North.</li>\n\t<li>The Canadian Northern Economic Development Agency (CanNor) will make available $15 million in funding to support northern businesses. CanNor works with Northerners and Indigenous peoples, communities, businesses, organizations, federal departments, and other orders of government to help build diversified and dynamic economies that foster long-term sustainability and economic prosperity across the territories.</li>\n\t<li>Nutrition North Canada is a Government of Canada subsidy program that makes safe and nutritious food more affordable and accessible to isolated communities eligible for the program. It subsidizes a list of foods, as well as essential items such as cleaning and personal hygiene products, sold by registered retailers, suppliers, and food processors.</li>\n\t<li>The Government of Canada remains committed to ensuring ongoing support to improve food security in the North, including through the Harvesters Support Grant. This grant will increase access to traditional foods by alleviating the high costs associated with traditional hunting and harvesting activities.</li>\n\t<li>The Harvesters Support Grant is delivered through Nutrition North Canada. The grant provides $40 million over five years beginning in 2019-2020, and $8 million per year in ongoing funding. Funding for the first year of the grant program has been allocated to Indigenous partners, and the Government of Canada is working to deliver the next wave of money quickly.</li>\n\t<li>On March 18, 2020, the Government of Canada announced that it would provide $305 million for a new distinctions-based Indigenous Community Support Fund, to address immediate needs in First Nations, Inuit, and Métis communities. This complements the previously announced $82 billion in support that is available to all Canadians, including Indigenous peoples.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.cannor.gc.ca/eng/1351104567432/1351104589057\">Canadian Northern Economic Development Agency</a></li>\n\t<li><a href=\"https://www.nutritionnorthcanada.gc.ca/eng/1415385762263/1415385790537\">Nutrition North Canada</a></li>\n</ul></div>\n      "
}