{
  "path": "/en/news/statements/2023/02/17/statement-prime-minister-report-public-order-emergency-commission",
  "pageTitle": "Statement by the Prime Minister on the report of the Public Order Emergency Commission | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the report of the Public Order Emergency Commission:</p>\n\n<p>“When we invoked the <em>Emergencies Act</em>, we were clear that it included the launch of a public inquiry to look at how and why we got there, and ensure transparency and accountability.</p>\n\n<p>“Today, I welcome the report from the Honourable Paul S. Rouleau, Commissioner of the Public Order Emergency Commission, and I thank the Commission for its important, thoughtful work.</p>\n\n<p>“The report of the Public Order Emergency Commission states that the very high threshold to invoke the <em>Emergencies Act</em> was met. The Commissioner found that what we experienced last year was a national emergency that threatened the security of Canadians. Our job as a government is always to keep people safe, and invoking the <em>Emergencies Act</em> was the necessary thing to do to protect people.</p>\n\n<p>“In our country, everyone has a right to protest peacefully – that’s a fundamental right that our government will always defend. In Ottawa, people are used to political activity and protests on Parliament Hill, but as the Commissioner said, ‘Lawful protests descended into lawlessness culminating in a national emergency.’ Streets were blockaded in our capital for weeks, causing serious harm to families and small businesses. At the borders in many places across the country, the blockades were damaging our economy and endangering public safety. For example, the blockade at the Ambassador Bridge between Windsor, Ontario, and Detroit, Michigan, hurt trade with the United States, thousands of peoples’ jobs, and critical supply chains. And at Coutts, Alberta, guns were found at the blockade. There was a real risk that people promoting ideologically motivated violent extremism could act out, or that they could inspire lone wolves to act out against their fellow citizens.</p>\n\n<p>“The situation was volatile and out of control, and the federal government needed to step in to uphold the rule of law and protect people and our economy. We did not want to have to invoke the<em> Emergencies Act</em> – it is a measure of last resort. But there were real risks to personal safety, to livelihoods, and equally, the risk of losing faith in the rule of law that upholds our society and our freedoms. Responsible leadership required us to restore peace and order. The <em>Emergencies Act</em> provided us with more tools to safely bring the illegal blockades and occupations to an end.</p>\n\n<p>“The report provides an objective account of what happened last year, and recommendations to prevent this type of situation from ever arising again. We can all agree that it should never have come to this. And we should all agree that there are lessons here for everyone involved: law enforcement agencies, all orders of government, and elected officials. Within the next year, our government will issue a comprehensive, public response to the Commissioner’s recommendations.</p>\n\n<p>“There’s a reason why Canada is one of the most successful democracies in the world: we work at it. We recognize that democracy is the responsibility of all of us together.</p>\n\n<p>“Canadians have been through a lot over the past few years. Many have been stressed, faced real financial challenges, and lost loved ones. We need to pull together and focus on what lies ahead. As Canadians, let’s continue to be there for one another, let’s listen to and respect each other – even if we don’t agree – and let’s continue to build a better future for everyone.”</p></div>\n      "
}