{
  "path": "/en/news/statements/2022/11/19/2022-leaders-declaration",
  "pageTitle": "2022 Leaders’ Declaration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ol>\n\t<li>We, the Economic Leaders of APEC, met in-person for the first time in four years in Bangkok on 18-19 November 2022. We continue the implementation of the APEC Putrajaya Vision&nbsp;2040, including through the Aotearoa Plan of Action. This year, under the APEC theme “Open. Connect. Balance.”, we advance work through three priorities: to be open to all opportunities, connected in all dimensions, and balanced in all aspects, to advance long-term robust, innovative and inclusive economic growth as well as sustainability objectives in the Asia-Pacific region.</li>\n\t<li>We have been intensifying our efforts in responding to the COVID-19 pandemic and mitigating its impact on our people and economies to promote health and wellbeing, as well as improving the overall standard of living for all.</li>\n\t<li>This year, we have also witnessed the war in Ukraine further adversely impact the global economy. There was a discussion on the issue. We reiterated our positions as expressed in other fora, including the UN Security Council and the UN General Assembly, which, in Resolution No. ES-11/1 dated 2 March 2022, as adopted by majority vote (141 votes for, 5 against, 35 abstentions, 12 absent) deplores in the strongest terms the aggression by the Russian Federation against Ukraine and demands its complete and unconditional withdrawal from the territory of Ukraine. Most members strongly condemned the war in Ukraine and stressed it is causing immense human suffering and exacerbating existing fragilities in the global economy – constraining growth, increasing inflation, disrupting supply chains, heightening energy and food insecurity, and elevating financial stability risks. There were other views and different assessments of the situation and sanctions. Recognising that APEC is not the forum to resolve security issues, we acknowledge that security issues can have significant consequences for the global economy.</li>\n\t<li>We reaffirm our commitment to realise the APEC Putrajaya Vision of an open, dynamic, resilient and peaceful Asia-Pacific community by 2040, for the prosperity of all our people and future generations. We will continue to promote efforts to strengthen APEC’s leadership and standing as the premier economic forum of the Asia-Pacific, as well as a modern, efficient and effective incubator of ideas. APEC’s cooperation will contribute to practical solutions for common challenges and complement global efforts including the UN&nbsp;2030 Agenda for Sustainable Development. To that end, we resolve to build momentum of the work carried out in 2022 and coordinate our APEC-wide actions on sustainability through the Bangkok Goals on Bio-Circular-Green (BCG) Economy.</li>\n\t<li>Trade and investment play a critical and indispensable role in enhancing the prosperity of our people by assisting with global challenges and can open up opportunities that offer tangible benefits. We underscore the importance of international trade and the World Trade Organization (WTO) in facilitating global economic recovery, growth, prosperity, alleviation of poverty, the welfare of all people, sustainable development, and facilitating cooperation in relation to the protection and conservation of the environment. We reaffirm our determination to deliver a free, open, fair, non-discriminatory, transparent, inclusive and predictable trade and investment environment. We will continue to work to ensure a level playing field to foster a favourable trade and investment environment and reaffirm our commitment to keep markets open and to address supply chain disruptions.</li>\n\t<li>We welcome the successful outcomes of the Twelfth WTO Ministerial Conference (MC12) and are determined to uphold and further strengthen the rules-based multilateral trading system, with the WTO at its core. We look forward to the early and effective implementation of the MC12 outcomes. We will cooperate in the WTO to continue to support its necessary reform to improve all its functions, in order to ensure that it can better address existing and emerging global trade challenges. We commit to working together with a view to achieving meaningful progress by the Thirteenth WTO Ministerial Conference.</li>\n\t<li>Recognising the useful contributions of the Lima Declaration and the Beijing Roadmap on progressing the Free Trade Area of the Asia-Pacific (FTAAP) agenda, we welcome the advancement of this agenda this year through a refreshed conversation on the FTAAP in the COVID-19 pandemic and beyond. We will continue to build on this momentum towards high quality and comprehensive regional undertakings through the FTAAP Agenda Work Plan. We task officials to report progress in carrying out the Work Plan to the AMM in the following years. At the same time, we will further strengthen our engagement with stakeholders, including the APEC Business Advisory Council (ABAC) and increase public-private sector dialogues. We note with appreciation of ABAC’s recommendations in advancing the FTAAP Work Programs. We commend the public and private sector collaboration between the Ministers Responsible for Trade (MRT) and ABAC, which underscores APEC’s emphasis on advancing an inclusive economic development. We will also continue our efforts in capacity building to improve trade negotiation skills of economies.</li>\n\t<li>In order to achieve post-COVID-19 economic recovery, it is our priority to drive growth-focused structural reform that is designed to be inclusive, sustainable, and innovation-friendly. This includes fostering an enabling environment for businesses of all types, particularly micro, small and medium-sized enterprises (MSMEs) and start-ups, and collaborating to improve opportunities for them to be competitive, specialised, innovative, and expand into the international markets. We reaffirm our commitment to the Enhanced APEC Agenda for Structural Reform (EAASR) and endeavour to make collective and individual progress, including on the ease of doing business.</li>\n\t<li>Furthermore, we recognise the urgency of enhancing the competitiveness of the services sector, especially travel, transport, and other services that have been hit hardest by the COVID-19 pandemic. We reiterate our commitment to accelerate work in response to the APEC Services Competitiveness Roadmap (ASCR) Mid-Term Review, with the aim to fully implement the ASCR by 2025. By increasing APEC’s global share of trade in services, we will be able to inject dynamism in our economy and underpin APEC’s position as the world’s growth engine.</li>\n\t<li>Macroeconomic and structural policies are vital to tackling rising inflation, ushering in sustained economic recovery, and raising living standards in the region. We reaffirm the importance of sustainable financing, capacity building, and technical assistance for innovation and growth as well as for addressing all environmental challenges, including climate change. We will continue to advance digital tools to facilitate economic activities and the provision of public services, including the delivery of assistance and stimulus packages to the people, and to drive financial inclusion.</li>\n\t<li>We commend APEC’s work on safe passage, including under the Safe Passage Taskforce. We will further our cooperation to promote safe and seamless cross-border travel within our region as we emerge from the COVID-19 pandemic, including for essential workforces, including air and maritime crew, as well as improve infrastructure and tools, such as the interoperability of vaccination certificates and ensuring the APEC Business Travel Card (ABTC) is inclusive.</li>\n\t<li>We reaffirm our commitment to enhance an open and interconnected Asia-Pacific region, including through the implementation of the APEC Connectivity Blueprint (2015-2025). We will strengthen physical, institutional and people-to-people connectivity as well as take advantage of digital connectivity, and will intensify efforts to promote regional, sub-regional and remote area connectivity through quality infrastructure development and investment. We will promote regenerative tourism that is sustainable, inclusive and resilient, and to connect the entire tourism eco-system. We support efforts to foster open, secure and resilient supply chains, enhance supply chain connectivity and minimise supply chain disruptions. We encourage economies to continue efforts to remove barriers to logistics-related services. We welcome the endorsement of Phase&nbsp;Three of the Supply Chain Connectivity Framework Action Plan by the APEC Ministers.</li>\n\t<li>Digital technology and innovation have a greater role to play in advancing inclusive and sustainable growth, improving access to services as well as opportunities to generate income and better the livelihoods of our people, including by encouraging the transition of economic actors from the informal to the formal economy. We will deepen cooperation to bridge digital divides between and within economies, including on facilitating access to digital infrastructure and supporting development of digital skills and digital literacy. We will cooperate on facilitating the flow of data, and strengthening business and consumer trust in digital transactions.</li>\n\t<li>We recognise the power of digital transformation in facilitating and reducing barriers to trade and unlocking exponential growth, including through nurturing the interoperability of digital systems and tools across the region. We encourage APEC to incubate more cutting-edge and comprehensive cooperation initiatives on digital economy. We will, therefore, accelerate the implementation of the APEC Internet and Digital Economy Roadmap (AIDER) to harness new and emerging technologies and the full potential of our society as well as create an enabling, inclusive, open, fair and non-discriminatory digital ecosystem for businesses and consumers.</li>\n\t<li>We affirm our commitment to promote strong, balanced, secure, sustainable and inclusive growth. We recognise that more intensive efforts are needed to address today’s challenges, including climate change, extreme weather and natural disasters, food security, and sustainable energy transitions that reduce greenhouse gas emissions, while ensuring energy resilience, access and security in the region, including by facilitating investments in relevant activities. We recall our commitment to rationalise and phase out inefficient fossil fuel subsidies that encourage wasteful consumption, while recognising the importance of providing those in need with essential energy services. To reach this goal, we will continue our efforts in an accelerated manner. We will also continue to take concrete steps to implement the APEC Roadmap on Combatting Illegal, Unreported and Unregulated (IUU) Fishing and the APEC Roadmap on Marine Debris. To this end, we will expedite efforts to promote economic policies, cooperation and growth which support global actions to comprehensively address all environmental challenges and call for deepened collaboration with stakeholders to make substantive progress.</li>\n\t<li>We endorse the Bangkok Goals on the Bio-Circular-Green (BCG) Economy as a comprehensive framework to further APEC’s sustainability objectives. We will advance the Bangkok Goals in a bold, responsive and comprehensive manner, building upon existing commitments and workstreams as well as considering new aspirational ones. We also welcome the launch of the APEC BCG Award this year to recognise the achievements of sustainability in the region.</li>\n\t<li>We continue to mobilise our resources to combat the COVID-19 pandemic and reinforce our systems to prevent and prepare for, and respond to future health threats. We are determined to ensure extensive immunisation of our people against COVID-19 as a global public good. It is imperative that we further strengthen the public health workforce, acknowledging their tremendous contributions to protecting our people’s lives and safeguarding their health. We should continue our efforts to improve digital solutions and access to health services, and strengthen health systems with a view to achieving universal health coverage.</li>\n\t<li>We pledge to expedite and intensify our work to promote agricultural development, including in rural areas, and promote long-term food security by ensuring our agricultural and food systems are more resilient, productive, innovative and sustainable, strengthening global food supply chains, and reducing food loss and waste. We also reaffirm our commitment to work towards the sustainable resource management of agriculture, forestry and marine resources and fisheries. We welcome the Implementation Plan of the Food Security Roadmap Towards 2030 as a pathway to achieve sufficient, safe, nutritious, accessible and affordable food for all.</li>\n\t<li>Recognising that long-term economic growth can only be achieved through realising the full potential of our society, we welcome the continued efforts to use a gender mainstreaming approach in relevant APEC processes and accelerate the full implementation of the La Serena Roadmap for Women and Inclusive Growth (2019-2030). We are committed to building an environment where all, including MSMEs and women, are empowered to access economic opportunities and contribute to and benefit from our economy. Building on these initiatives, we encourage further efforts to expand APEC’s work with other groups with untapped economic potential, such as Indigenous Peoples as appropriate, people with disabilities, and those from remote and rural communities, while also promoting the role of youth in advancing inclusive and sustainable economic growth. We will place a special emphasis on human resource development, particularly access to resources, reskilling, upskilling, lifelong learning, and other support, to advance employment and decent work for all as well as enable our workforce to participate and lead in the digital and green economies.</li>\n\t<li>Recognising the detrimental impact of corruption on economic growth and development, we are committed to taking practical actions and a united approach, to jointly fight cross-border corruption and deny safe haven to corruption offenders and their illicit assets.</li>\n\t<li>We reiterate our commitment to expedite the realisation of the APEC Putrajaya Vision&nbsp;2040, including through the Aotearoa Plan of Action. In this endeavour, we will improve APEC’s governance and organisational structure, with a view to efficiently and effectively delivering upon all elements of the APEC Putrajaya Vision&nbsp;2040 and deepen engagement with stakeholders, including the ABAC, and international and regional organisations.</li>\n\t<li>We welcome the outcomes of the 2022 APEC Ministerial Meeting as well as the 2022 Sectoral Ministerial Meetings for Trade, Tourism, Health, Forestry, Food Security, Women and the Economy, Small and Medium Enterprises, and Finance.</li>\n\t<li>We thank Thailand for hosting APEC in 2022, and we look forward to APEC&nbsp;2023, which will be hosted by the United States of America. We also welcome Peru and the Republic of Korea as hosts of APEC&nbsp;2024 and 2025, respectively.</li>\n</ol></div>\n      "
}