{
  "path": "/en/news/news-releases/2021/04/28/investing-young-canadians",
  "pageTitle": "Investing in young Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Young Canadians have been among the most impacted by the global COVID-19 pandemic. They have experienced the highest job losses and the worst mental health decline of any age group. They have sacrificed a lot to protect their parents and grandparents, and they need our support to recover and rebuild from the pandemic. By making life more affordable, and by creating new opportunities and jobs for young Canadians today, the Government of Canada is investing in their future success and the long-term prosperity of our country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today spoke to young Canadians across the country and highlighted measures in Budget 2021 that will help them pursue and complete their education, make student debt easier to pay down, and create new training and work opportunities.</p>\n\n<p>The Government of Canada intends to invest $5.7 billion over five years in measures to support students and young Canadians. These include:</p>\n\n<ul>\n\t<li>Creating 215,000 new training and work opportunities for young Canadians, so they can gain valuable skills and experience in the workforce</li>\n\t<li>Waiving interest on student loans for an additional year, which would help about 1.5 million Canadians who are repaying student loans</li>\n\t<li>Providing more flexibility for the repayment of federal student loans, so no one has to make a payment they cannot afford</li>\n\t<li>Doubling the Canada Student Grants for two more years to help over 580,000 students cover the cost of their tuition, school supplies, and living expenses</li>\n\t<li>Expanding access to supports, grants, and repayment assistance for students with disabilities.</li>\n</ul>\n\n<p>Budget 2021 builds on the work we have been doing to support young Canadians through this crisis. This includes supporting close to 200,000 new work opportunities and experiences, providing income support to over 700,000 students through the Canada Emergency Student Benefit, creating a six-month moratorium on student loan payments, and doubling the Canada Student Grants for the 2020-21 school year.</p>\n\n<p>Together, these measures will create new opportunities for young Canadians, and help put them at the centre of our country’s recovery. This is part of the Government of Canada’s plan to make life more affordable for everyone, create jobs, strengthen our economy, and grow the middle class.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Young people have been greatly impacted by the pandemic, and we’re stepping up to support them so they can reach their full potential as we continue to recover and rebuild. We are taking steps to create new opportunities for young Canadians, and help them start their careers and their lives. An investment in young people today is an investment in our future success as a country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“One of the most striking aspects of the pandemic has been the historic sacrifice young Canadians have made to protect their parents and grandparents. Our youth have paid a high price to keep the rest of us safe. They need our support to launch their adult lives and careers in post-COVID Canada – and they will get it. We will make college and university more accessible and affordable. We will create job openings in skilled trades and high-tech industries. We will double the Canada Student Grant for two more years, while extending the waiver of interest on federal student loans through March 2023.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government recognizes that young people play a vital role as we recover from the pandemic, and as we look farther into the future. With a focus on providing quality job opportunities and increasing access to education, these investments are designed to support young Canadians – including those facing barriers – every step of the way toward achieving fulfilling careers.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the beginning of the pandemic, the Government of Canada has provided over $7.4 billion to support young Canadians.</li>\n\t<li>The government’s response to the crisis represents the largest investment in young Canadians in the history of our country – $13.1 billion over six years – and one of the largest youth support packages in the world.</li>\n\t<li>As part of the $5.7 billion over five years, Budget 2021 also proposes the following measure to support young Canadians:\n\t<ul>\n\t\t<li>$118.4 million over two years, starting in 2021-22, to conduct a two-year pilot expansion of federal investments in after-school programming under the Supports for Student Learning Program. These funds would support national and local after-school organizations who work to ensure that vulnerable children and young people can graduate high school and do not become marginalized further as a result of the pandemic.</li>\n\t</ul>\n\t</li>\n\t<li>In addition to these investments, Budget 2021 proposes $100 million over three years, starting in 2021-22, to support projects for innovative mental health interventions for populations disproportionately impacted by COVID-19, including young Canadians.</li>\n\t<li>In 2019, <a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada’s first-ever youth policy</a>&nbsp;was introduced. Developed with young Canadians, the policy reflects their values and priorities, and represents a whole-of-government approach aimed at improving outcomes for young people and involving them in federal decision-making.</li>\n\t<li>Created in 2016, the Prime Minister’s <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council/council.html\">Youth Council</a> is a group of young Canadians who provide non-partisan advice to the Prime Minister and the Government of Canada on issues of importance to them and to all Canadians.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget 2021</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\">Budget 2021: New Opportunities for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/young-canadians.html\">Budget 2021: Young Canadians</a></li>\n</ul></div>\n      "
}