{
  "path": "/en/news/news-releases/2017/06/13/prime-minister-announces-canada-host-women-deliver-conference",
  "pageTitle": "Prime Minister announces Canada to host Women Deliver Conference | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gender equality accelerates economic growth, and women’s participation in decision-making leads to more peaceful, secure and cohesive societies. We all need to do more in Canada and around the world to champion the rights of women and girls. With this understanding, the Prime Minister of Canada, Justin Trudeau, today announced that Canada will host the next Women Deliver Conference, which will be held from June 3 to 6, 2019, in Vancouver, British Columbia.</p><p>Canada will provide $20 million from 2017 to 2020 to support Women Deliver in their global advocacy. These contributions will support programs promoting the health, rights, and wellbeing of women and girls, with a focus on their sexual and reproductive health and rights.</p><p>Every three years, the Women Deliver Conference brings together world leaders, activists, government officials, parliamentarians, NGO representatives, and business people to discuss gender equality and sexual and reproductive health and rights.</p><h2>Quote</h2><blockquote><p>“Everyone benefits from a more gender equal world, but little progress on gender equality can be made without a strong focus on the health and wellbeing of women and girls, especially their sexual and reproductive health and rights. Organizations like Women Deliver understand this, which is why I’m so proud to announce that Canada will host their next conference in 2019.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li><span lang=\"EN\" xml:lang=\"EN\">The last Women Deliver conference, held in Copenhagen, Denmark, in 2016, was the largest gathering on girls’ and women’s health, rights, and wellbeing in the last decade, bringing together 6,000 participants. The conference focused on how to implement the UN Sustainable Development Goals in a way that most benefits girls and women.</span></li><li>As part of Canada’s new Feminist International Assistance Policy, launched on June 9, 2017, Canada announced the new Women’s Voice and Leadership Program, which will allocate $150 million over five years to respond to the needs of local women’s organizations in developing countries that are working to advance the rights of women and girls and promote gender equality.</li><li>In March 2017, Canada announced $650 million to be used around the world for sexual and reproductive health and rights over three years, which represents a doubling of our 2015 investments.</li><li>Canada’s support will focus specifically on providing comprehensive sexuality education, strengthening reproductive health services, and investing in family planning and contraceptives. Programs will also prevent and respond to sexual and gender-based violence, including child, early and forced marriage and female genital mutilation and cutting, and support the right to choose safe and legal abortion, as well as access to post-abortion care.</li><li>Canada was elected <span lang=\"EN\" xml:lang=\"EN\">to hold a seat on the UN Commission on the Status of Women for the 2017-2021 term and on the UN Commission on Population and Development for the 2017-2020 term. These leadership roles will provide Canada with a strategic opportunity to advance gender equality and the empowerment of women and girls, particularly their sexual and reproductive health and rights.</span></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/global-affairs/news/2017/03/canada_announcessupportforsexualandreproductivehealthandrights.html\">Canada announces support for sexual and reproductive health and rights</a></li><li><a href=\"http://international.gc.ca/world-monde/world_issues-enjeux-mondiaux/advancing_gender-batir_sexes.aspx?lang=eng\">Advancing Gender Equality</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2017/06/canada_launches_newfeministinternationalassistancepolicy.html\">Canada launches new Feminist International Assistance Policy</a></li><li><a href=\"/en/news/statements/2017/03/08/statement-prime-minister-canada-international-women’s-day\">Statement by the Prime Minister of Canada on International Women’s Day</a></li><li><a href=\"http://womendeliver.org/\">Women Deliver</a></li></ul></div>\n      "
}