{
  "path": "/en/news/news-releases/2015/11/28/prime-minister-announces-funding-increase-opportunities-youth-africa",
  "pageTitle": "Prime Minister announces funding to increase opportunities for youth in Africa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, announced today that Canada is contributing $15.3 million over four years (2015-2019) to improve the lives and futures of young people in Africa. This investment will help offer the training needed to find and keep good jobs, with a focus on reducing poverty and encouraging economic prosperity. The Prime Minister made the announcement while in Valletta, Malta, for the Commonwealth Heads of Government Meeting.</p>\n<p>The Government of Canada is partnering with Digital Opportunity Trust (DOT), a Canadian-based company headquartered in Ottawa, Ontario, on a project that will help young women and men develop job and entrepreneurial skills, including in the use of technology. The <em>Digital Livelihoods: Youth and the Future of Work at Scale</em> project is expected to benefit approximately 200,000&nbsp;youth in Ghana, Kenya, Malawi, Morocco, Rwanda, Senegal, Tanzania, and Zambia.</p>\n<p><strong>Quotes</strong></p>\n<p>“The Government of Canada is committed to helping young people across the country and around the world reach their full potential. We will invest to create more jobs and better opportunities for young people. Today’s initiative with the Digital Opportunity Trust will help young women and men in eight African countries develop the skills and technological know-how they need to get jobs and start businesses.”<br><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Two thirds of the population in sub-Saharan Africa (where seven of the eight countries for this project are located) is under 25.</li>\n<li>DOT is a leading international social enterprise with local operations around the world. The organization focuses on building global networks of talented young leaders who create real change by educating local communities in applying technology effectively.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/ss-africa-afrique-ss/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n<li><a href=\"https://chogm2015.mt\">CHOGM: Malta 2015</a>&nbsp;&nbsp;</li>\n<li><a href=\"https://www.dotrust.org/\">Digital Opportunity Trust</a></li>\n<li><a href=\"/en/news/backgrounders/2015/11/28/digital-livelihoods-youth-and-future-work-scale-project\">Digital Livelihoods: Youth and the Future of Work at Scale project</a></li>\n</ul></div>\n      "
}