{
  "path": "/en/news/news-releases/2021/07/27/canada-reaches-major-vaccine-campaign-milestone",
  "pageTitle": "Canada reaches major vaccine campaign milestone | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From the beginning of the COVID-19 pandemic, the Government of Canada made a commitment to protect the health and safety of all Canadians. That is why the government has worked hard to ensure that everyone across the country could access vaccines as soon as they were proven to be safe and effective. The government will continue to do everything that is necessary so that every eligible person in Canada who wants a vaccine can get one – because no one is safe until everyone is safe.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that with its most recent shipment, Canada has now received more than 66&nbsp;million doses of COVID-19 vaccines – enough to fully vaccinate every eligible person in Canada – two months ahead of the original goal of September.</p>\n\n<p>This milestone in the largest immunization campaign in Canada’s history is the result of a proactive procurement approach, focused on building a diverse vaccine portfolio. As vaccines were authorized by Health Canada, the government remained engaged with vaccine suppliers to speed up delivery schedules and get as many doses into the country as quickly as possible. Canada continues to be a world leader in vaccination rates, with over 80 per cent of eligible people in the country vaccinated with their first dose and approximately 64 per cent fully vaccinated.</p>\n\n<p>Delivering safe and effective vaccines for Canadians has been – and continues to be – a true Team Canada effort, from the cross-country collaboration on the rollout to the dedication of front-line health care workers. Today’s announcement would also not have been possible without the Public Health Agency of Canada in partnership with the Canadian Armed Forces in deploying vaccines across the country.</p>\n\n<p>As we continue our fight against COVID-19, the Government of Canada will keep working with our partners to ensure fair, equitable, and timely access to COVID-19 vaccines, and a recovery that benefits everyone. We have the supply, so we now need all eligible Canadians to do their part and get both doses of the COVID-19 vaccines. Only together, can we build a safer and healthier Canada – and finish the fight against this virus.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The best way to end this pandemic is for everyone to get their shots as soon as they can. Today’s milestone is a clear sign that we are getting closer to this goal. I urge Canadians to book their vaccine today, to protect themselves, their loved ones, and their communities. We will keep doing what is necessary to protect the health of Canadians, finish the fight against COVID-19, and ensure a strong economic recovery for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada has worked extremely hard to deliver vaccines to Canadians as fast as possible, and now has enough doses for every eligible person in Canada – two months ahead of our original projections. This milestone was made possible by a true Team Canada effort across government, working closely with a broad range of vaccine suppliers and the immense efforts of dedicated public servants, who have worked around the clock since day one in a relentless push to keep us protected.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“If you haven’t been vaccinated yet, please make a plan to do so. Our families, communities and small businesses are relying on us to take care of each other and stop the spread. We are regaining so many of the things we enjoy: seeing our families, visiting with friends and going out to eat. Let’s keep going together. Be safe, be sure. Get vaccinated today.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has committed over $9&nbsp;billion to procure vaccines and therapeutics and to provide international support.&nbsp;The Public Health Agency of Canada is responsible for the vaccine rollout in Canada, including the ongoing interaction with the provinces and territories. Canada has allocated the majority of that amount to secure up to 409&nbsp;million doses of vaccines and vaccine candidates for Canadians and for international support.</li>\n\t<li>Between December 2020 and the end of March 2021, Canada received more than 9&nbsp;million doses, surpassing the 6&nbsp;million doses expected in the first quarter. Between April 2021 and the end of June 2021, we received more than 50&nbsp;million doses.</li>\n\t<li>The Government of Canada is securing access to safe and effective COVID-19 vaccines now and into the future. Canada has secured COVID-19 vaccines from Pfizer for 2022 and 2023, with options to extend into 2024. In addition to providing booster vaccine doses, the agreement provides flexibility to procure new adaptations of the Pfizer-BioNTech COVID-19 vaccine, such as those to protect against mutations or variants of concern and vaccines developed for younger populations.</li>\n\t<li>The Government of Canada is a strong supporter of the COVID-19 Vaccine Global Access (COVAX) Facility, the global procurement mechanism that is helping develop and deliver safe, equitable, and accessible COVID-19 vaccines. On July 12, 2021, the government announced the donation of 17.7&nbsp;million doses of the AstraZeneca vaccine to COVAX to help meet international needs. This is in addition to the 13&nbsp;million doses that Canada committed to donate at the G7 Leaders’ Summit on June&nbsp;13, 2021.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">Coronavirus disease (COVID-19): Canada’s response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-services-procurement/services/procuring-vaccines-covid19.html\">Procuring vaccines for COVID-19</a></li>\n\t<li><a href=\"https://www.tpsgc-pwgsc.gc.ca/comm/aic-scr/ententes-agreements-strat-eng.html\">Canada’s vaccine agreements: A strategy to cover all bases</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/covid-19-military-response.html\">Military response to COVID-19</a></li>\n</ul></div>\n      "
}