{
  "path": "/en/news/readouts/2020/05/07/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with premiers to discuss the evolving COVID-19 situation. The leaders talked about coordinated actions being taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians, and to support workers and businesses.</p>\n\n<p>First Ministers discussed efforts to ensure an adequate supply of personal protective equipment for workers, and steps they are taking to gradually restart the economy, as guided by the principles, criteria, and measures identified in their joint statement on April 28. In particular, First Ministers acknowledged the importance of ensuring sufficient public health capacity to test, trace, and isolate all cases of COVID-19, in order to contain the spread of the virus and minimize the risk of another wave. First Ministers agreed to continue working together to ensure all jurisdictions have the tools they need to contain the spread of COVID-19.</p>\n\n<p>All First Ministers reaffirmed their commitment to addressing COVID-19 through a Team Canada effort. The Government of Canada continues to take a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}