{
  "path": "/en/news/readouts/2022/11/20/prime-minister-justin-trudeau-meets-president-switzerland-ignazio-cassis",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Switzerland Ignazio Cassis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of Switzerland, Ignazio Cassis, on the margins of the Eighteenth Summit of La Francophonie.</p>\n\n<p>Prime Minister Trudeau and President Cassis underlined their continued support for Ukraine and affirmed their commitment to remaining united in the face of Russian aggression. The two leaders spoke of the importance of the implementation of sanctions against Russia.&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Cassis highlighted La Francophonie’s role in promoting the French language and upholding democracy and good governance, as well as the need to strengthen these commitments. The two leaders underlined their desire to further facilitate the promotion of francophone content online.</p>\n\n<p>The leaders discussed the ongoing negotiations at COP 27 in Egypt and the upcoming COP 15 in Montréal, Canada, and agreed to further advance cooperation related to environmental and climate action.</p>\n\n<p>The two leaders agreed to continue working together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/switzerland-suisse/relations.aspx?lang=eng\">Canada-Switzerland relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}