{
  "path": "/en/news/news-releases/2021/04/18/additional-support-ontario-fight-covid-19-outbreak",
  "pageTitle": "Additional support for Ontario to fight the COVID-19 outbreak | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since the start of the global COVID-19 pandemic, the Government of Canada has been working to do whatever it takes – for as long as it takes – to protect and support Canadians. As the number of new cases in Ontario continues to escalate to unprecedented levels due to variants of concern, we are working with the Province to protect the health and safety of Ontarians and support the capacity of our health care system.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the federal government is working to provide additional, emergency support to fight the COVID-19 outbreak in Ontario.</p>\n\n<p>This includes:</p>\n\n<ul>\n\t<li>Sending federal health care staff and equipment to the front lines in Ontario to care for people across the province, particularly in areas that are most impacted.</li>\n\t<li>Boosting rapid testing to help stop the spread of the virus, and working with municipalities and businesses to deploy them to hot spots across Ontario, support contact tracing and isolation, and make workplaces safer.</li>\n\t<li>Investing $84.2 million to support voluntary safe isolation sites, including across Ontario. These sites have already helped 3,900 Ontarians isolate safely to prevent the spread of the virus.</li>\n\t<li>Signing a <a href=\"https://www.canada.ca/en/health-canada/corporate/transparency/health-agreements/bilateral-agreement-pan-canadian-virtual-care-priorities-covid-19/canada-ontario.html\">bilateral agreement</a> between the Government of Canada and the Government of Ontario to enhance virtual health services in the province. This agreement comes with $46 million in funding to expand Ontario’s efforts on virtual health care during the pandemic.</li>\n\t<li>Providing an additional supply of tocilizumab and other needed drugs for Ontario through reallocation from other provinces and territories. Tocilizumab is used to treat severe pneumonia in COVID-19 patients.</li>\n</ul>\n\n<p>These measures build on yesterday’s announcement that the federal government is providing a two-month extension on two Mobile Health Units (MHU), until June 30. These MHU were approved in January and are currently deployed in Toronto and Hamilton. The federal government also stands ready to deploy the Canadian Red Cross to help the province with its mobile vaccination teams, and the Canadian Armed Forces is working with partners to determine what additional support they can provide to Ontario.</p>\n\n<p>The Government of Canada is also working closely with provinces and territories to facilitate extra support for Ontario, including sending medical supplies and health care workers, and has offered to cover the costs.</p>\n\n<p>Eight of every ten dollars spent in Canada to respond to the pandemic have come from the federal government. This has included support through the purchase of vaccines, personal protective equipment, rapid testing, contact tracing, and funding to help make schools safer for students and teachers. We will continue to provide the provinces and territories support and take a Team Canada approach to beating this virus, so we can keep all Canadians safe and healthy.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada continues to face an incredibly serious situation, with COVID-19 case counts reaching record numbers in many communities across the country. We are committed to taking a Team Canada approach to beating this virus and keeping Canadians safe, healthy, and supported. I know this is a difficult and frightening situation for Ontarians and all Canadians, but we will continue to look out for one another in these difficult times. Together we will get through this.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On April 17, in response to the rapidly rising numbers of COVID-19 cases across Ontario, the Prime Minister spoke to the Honourable Andrew Furey, Premier of Newfoundland and Labrador, the Honourable Dennis King, Premier of Prince Edward Island, and the Honourable Iain Rankin, Premier of Nova Scotia. They spoke about how they can work together to help support Ontarians get through the current situation.</li>\n\t<li>The federal government’s support includes the deployment of essential biomedical equipment, including Cardiohelp systems, AirVo oxygen units, high flow nasal oxygen devices, and extracorporeal membrane oxygenation machines.</li>\n\t<li>On July 16, 2020, the Prime Minister and Deputy Prime Minister announced an agreement to safely restart the economy that involved over $19 billion in funding from the federal government. The Safe Restart Agreement focused on measures over six to eight months to restart the economy while protecting the health of Canadians.</li>\n\t<li>This funding has supported the provinces and territories in their response to COVID-19, including for the following priorities:\n\t<ul>\n\t\t<li>Testing, contact tracing, and data management</li>\n\t\t<li>Health care capacity, including mental health and substance use</li>\n\t\t<li>Protecting vulnerable populations, including seniors</li>\n\t\t<li>Securing personal protective equipment</li>\n\t</ul>\n\t</li>\n\t<li>On April 6, 2021, the government delivered the final instalment of $700 million through the Safe Restart Agreement to help provinces and territories to further increase their testing capacity.</li>\n\t<li>On March 25, 2021, the Deputy Prime Minister and Minister of Finance introduced Bill C-25, which would provide an additional $7.2 billion in support to provinces, territories, municipalities, and Indigenous communities for urgent health care needs, the COVID-19 vaccine rollout, and local infrastructure projects</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/04/government-of-canada-assists-ontario-with-covid-19-response-through-extension-of-mobile-health-units.html\">Government of Canada assists Ontario with COVID-19 response through extension of Mobile Health Units</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/support-provinces-territories.html\">COVID-19: Support to provinces and territories</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/06/support-testing-and-contact-tracing-through-safe-restart-agreement\">Support for testing and contact tracing through the Safe Restart Agreement</a></li>\n</ul></div>\n      "
}