{
  "path": "/en/news/news-releases/2019/03/21/budget-2019-doubles-support-municipal-infrastructure-priorities-year",
  "pageTitle": "Budget 2019 doubles support for municipal infrastructure priorities this year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In communities like Mississauga, people depend on every order of government to work together to deliver the infrastructure projects they need – from expanding highways, to improving public transit, to building new recreational centres.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Mississauga, Ontario, to highlight the Municipal Infrastructure Top-Up announced in Budget 2019. This top-up will double the amount of money that municipalities get through the gas tax transfer for 2018-19, and give much needed support for local priorities.</p>\n\n<p>Municipalities and First Nations communities will be able to use the funds to complete projects currently underway, create good, well-paying jobs, and make their communities better places to live. The funds will help address the short-term priorities of municipalities, including repairing roads, expanding bus fleets, and building water treatment facilities.</p>\n\n<p>With Budget 2019, the Government of Canada is taking steps to strengthen the communities Canadians call home, while making everyday life more affordable for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since 2016, we have invested in thousands of infrastructure projects that have helped improve the lives of people in communities across the country. With the Municipal Infrastructure Top-Up, we are taking real, concrete steps to directly provide cities and towns with more funding so they can invest it where people need it the most.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>\"I want to thank the federal government for recognizing the important role that cities play in powering the nation through this year's budget. The commitment to double the gas tax funding this year will significantly help cities like Mississauga maintain aging infrastructure and build new transit, roads, cycling infrastructure, and much more. The federal government recognizes that cities have the local expertise to deal with local matters, and we need direct funding and tools to ensure we can build stronger, more prosperous communities. City building is nation building.”</p>\n\n<footer class=\"default\">Bonnie Crombie, Mayor of Mississauga</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2019, <em>Investing in the Middle Class</em>, is the government’s plan to create more good well-paying jobs, put homeownership within reach of more Canadians, help working people get the training they need to succeed, support seniors, and lay the foundation for national pharmacare.</li>\n\t<li>With many municipalities across Canada facing serious infrastructure needs, Budget 2019 proposes a one-time transfer of $2.2 billion through the federal Gas Tax Fund to address short-term priorities in municipalities and First Nations communities.</li>\n\t<li>Projects under this fund can be used for the following:\n\t<ul>\n\t\t<li>Productivity and economic growth – including highways and local roads, public transit, and regional and local airports</li>\n\t\t<li>Clean environment – including drinking water, wastewater, and community energy systems</li>\n\t\t<li>Strong cities and communities – including sport and recreation, culture and tourism, and capacity building</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/plan/toc-tdm-en.html\">Budget 2019</a></li>\n</ul></div>\n      "
}