{
  "path": "/en/news/statements/2016/10/16/statement-prime-minister-canada-small-business-week",
  "pageTitle": "Statement by the Prime Minister of Canada on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Small Business Week, which runs from October 16 to 22, 2016:</p>\n<p>“Small business owners work incredibly hard to provide Canadians with quality goods and services while also creating job opportunities that strengthen communities across the country and grow the middle class.</p>\n<p>“In Canada there are over 1.16 million small and medium sized businesses. These businesses account for 99 per cent of all firms, and employ over 90 per cent of the labour force in the private sector. They are anything but ‘small’ in terms of their contribution to Canada’s economic growth, job creation, and innovation.</p>\n<p>“Small Business Week is important for many reasons. It allows Canadians to thank small business owners and entrepreneurs for their enormous contributions to our country’s prosperity. It is also a chance for current and future small business owners to participate in events across the country to learn, network, and share ideas about making their businesses as innovative, export-ready, and successful as possible.</p>\n<p>“Our government recognizes the importance of small businesses and the entrepreneurs that make them thrive. That is why we are investing in several programs that support innovation and skills training, including for women, Indigenous, and young entrepreneurs.</p>\n<p>“On behalf of the Government of Canada, Sophie and I invite all Canadians to celebrate our small business owners and entrepreneurs. We hope you will be able to take part in the events organized across Canada, learn, share ideas and do some networking, while recognizing the hard work, talent, ambition, and determination of small business owners and entrepreneurs.”</p></div>\n      "
}