{
  "path": "/en/news/statements/2019/02/03/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 3 to 9, 2019:</p><p>“Today, we mark the beginning of <a href=\"https://international.gc.ca/gac-amc/campaign-campagne/idw-sdi/index.aspx?lang=eng\">International Development Week</a>, and celebrate the hard work of international development workers, volunteers, and partners. From building schools and hospitals, to training others to provide much-needed services in their local communities, these dedicated people make a difference in the lives of the most vulnerable.</p><p>“This year’s theme – Together for Gender Equality – embodies Canada’s efforts to make gender equality a reality, and improve the lives of women and girls around the world. Women and girls are disproportionally affected by poverty, limited health care services, and a lack of resources and opportunities. But when their voices are heard, they have the power to transform their communities into thriving and healthy places to call home. For that reason, by 2021-22, Canada will devote no less than 95 per cent of its international assistance to initiatives that improve the lives of women and girls.</p><p>“Gender equality is a global responsibility, and one we need to work together to achieve. During the 2018 G7 Summit, Canada and partners announced $3.8 billion – the single largest investment of its kind – to support quality education for women and girls living in crisis and conflict areas. At the United Nations General Assembly a few months later, Canada welcomed an additional $527 million from partners to help developing countries give every child access to quality education and modern skills training.</p><p>“Building on this momentum, Canada will host the&nbsp;<a href=\"https://wd2019.org/\">Women Deliver 2019</a>&nbsp;conference – the world’s largest gathering on the health, rights, and well-being of women and girls – in Vancouver in June.</p><p>“During International Development Week, we also call attention to ongoing humanitarian crises around the world. Canada has a long history of carrying out critical humanitarian work. Most recently, we provided significant aid to Yemen, and took <a href=\"/en/news/news-releases/2018/05/23/canada’s-strategy-respond-rohingya-crisis\">decisive action</a> to respond to the grave humanitarian crisis in Myanmar. In addition, Canada will host the 10th ministerial meeting of the Lima Group, bringing elected officials from over a dozen countries together in Ottawa to discuss the political, economic, and humanitarian crisis in Venezuela. We will continue to work closely with the international community and the United Nations to protect human rights and meet the needs of those displaced and most vulnerable.</p><p>“On behalf of the Government of Canada, I encourage all Canadians to join me in thanking the many people who work hard every day to end poverty, promote peace and security, and ensure people everywhere share in a more just and equal future.”</p></div>\n      "
}