{
  "path": "/en/news/statements/2023/01/12/statement-prime-minister-findings-former-lebret-quappelle-residential",
  "pageTitle": "Statement by the Prime Minister on the findings at the former Lebret (Qu’Appelle) residential school | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, a National Residential School Crisis Line offers emotional support and crisis referral services for residential school Survivors and their families. Call the toll-free Crisis Line at 1-866-925-4419. This service is available 24 hours a day, 7 days a week. The Hope for Wellness Help Line also offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at </em><a href=\"http://www.hopeforwellness.ca\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>The Prime Minister, Justin Trudeau, today issued the following statement:</p>\n\n<p>“I am profoundly saddened and disturbed to learn of the findings of a child’s remains and potential unmarked graves at the former Lebret (Qu’Appelle) residential school in Saskatchewan, which operated from 1884 to 1998.</p>\n\n<p>“No child should ever have been stolen from their family. No child should ever have been robbed of their childhood, their culture, their community, or their language. No child should ever have faced the unthinkable abuse, loneliness, and fear they did at these so-called schools like the one in Qu'Appelle Valley. And no child should have ever spent their last moments suffering in a residential school and have their life stolen from them.</p>\n\n<p>“As the horrifying truths of what happened at residential schools across the country continue to be uncovered, the Government of Canada will continue to support Star Blanket Cree Nation and Indigenous communities across the country as they navigate the difficult work of finding their loved ones and beginning or continuing their healing journeys – work which will be guided by Survivors, Elders, knowledge keepers, and experts. This work will take many forms and will evolve as further discoveries and the truth Survivors have long known about their missing sisters, brothers, and friends come to light. We will be there every step of the way.</p>\n\n<p>“Residential schools are part of the historic and ongoing racism, discrimination, and injustice that Indigenous Peoples face. As Canadians, we all have a responsibility to learn from our past to build a better future. Our thoughts are with the people of Star Blanket Cree Nation at this difficult time. We are mourning with you.”</p></div>\n      "
}