{
  "path": "/en/news/statements/2022/02/15/statement-prime-minister-national-flag-canada-day",
  "pageTitle": "Statement by the Prime Minister on National Flag of Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark National Flag of Canada Day:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>“Today, I join Canadians across the country and around the world to celebrate the 57th anniversary of the National Flag of Canada.</p>\n\n<p>“On February 15, 1965, the National Flag of Canada was flown for the very first time on Parliament Hill. Ever since, the Maple Leaf, has been proudly raised in communities across the country – at schools, libraries, and hockey arenas – and at Canada’s diplomatic missions around the world.</p>\n\n<p>“Wherever the Maple Leaf flies, it is a symbol of the shared values that unite us as Canadians – freedom, peace, justice, equality, openness, diversity, and generosity. Despite our differences, we come together to have each others’ backs and support one another when we need it most.</p>\n\n<p>“Getting through the COVID-19 pandemic is a Team Canada effort. Canadians have been helping and relying on their families, friends, and neighbours to get through these challenging times. This is not the time to give up – we will remain united in our battle to get Canadians back to the things we love, and in support of our front-line health care providers and essential workers.</p>\n\n<p>“On this National Flag of Canada Day, we are also cheering for all Canadians wearing the Maple Leaf at the 2022 Olympic and Paralympic Winter Games. Hailing from across the country, these athletes are making us proud with their hard work and determination.</p>\n\n<p>“On behalf of the Government of Canada, I wish all Canadians a happy National Flag of Canada Day.”</p></div>\n      "
}