{
  "path": "/en/news/readouts/2020/10/29/prime-minister-justin-trudeau-speaks-mayor-edmonton-don-iveson",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Mayor of Edmonton Don Iveson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Mayor of Edmonton Don Iveson to discuss the COVID-19 pandemic.</p>\n\n<p>The Prime Minister and the Mayor spoke about the rising number of COVID-19 cases in Edmonton. Prime Minister Trudeau reiterated his commitment to helping municipalities, provinces, and territories respond to the global COVID-19 pandemic and ensuring economic recovery.</p>\n\n<p>Prime Minister Trudeau and Mayor Iveson discussed federal support programs, including the funding provided under the Safe Restart Agreement. They also discussed the homelessness situation in Edmonton and the Rapid Housing Initiative, which will help address urgent housing needs of vulnerable Canadians by rapidly creating new affordable housing.</p>\n\n<p>The Prime Minister and the Mayor agreed on the importance of continuing to take action on these issues and working together on the response to COVID-19, in order to protect the health and safety of the people of Edmonton, and all Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2020/canada-rapidly-create-affordable-housing-support-homeless\">Canada to rapidly create affordable housing and support the homeless</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/homelessness/notice-covid-19.html\">Reaching Home: Canada’s Homelessness Strategy – COVID-19</a></li>\n</ul></div>\n      "
}