{
  "path": "/en/news/news-releases/2017/03/29/prime-minister-announces-support-high-quality-affordable-child-care",
  "pageTitle": "Prime Minister announces support for high-quality, affordable child care across the country | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians deserve the opportunity to raise their families the way they want, but far too many do not have access to the high-quality, affordable child care they need. With increased support for early learning and child care, more Canadian parents can pursue new opportunities to work and learn, and build a better future for themselves and their children.</p><p>That’s why the Prime Minister, Justin Trudeau, today highlighted that Budget 2017 proposes $7 billion over 10 years, beginning in 2018-19, to support and create more high-quality, affordable child care spaces across the country. This funding is in addition to an initial investment of $500 million announced in Budget 2016 for this upcoming year, 2017-18.</p><p>These investments would help increase the number of affordable, high-quality child care spaces for low- and modest-income families, and would make it easier for more parents to work or return to school. Over the next three years, this funding could support up to 40,000 new subsidized child care spaces.</p><p>The government is working with the provinces and territories to develop a National Framework on Early Learning and Child Care, focusing on best practices and innovative approaches to best serve families. A distinct Indigenous Framework on Early Learning and Child Care will also be created in cooperation with Indigenous partners to reflect the unique cultures and needs of First Nations, Inuit, and Métis children across Canada.</p><p>With Budget 2017, the government will continue to deliver the things that matter most to Canadians: good jobs, healthy living, strong communities, and better opportunities for future generations.</p><h2>Quote</h2><blockquote><p>“The Canadian story is about the promise that, with optimism and hard work, a better life is possible for everyone. Access to affordable and quality child care is too often a barrier for many Canadians who struggle with the need to work or return to school. That is not right. High-quality, affordable child care is critical for helping parents who want to join the middle class. This investment would provide important relief to hard-working Canadian parents across the country.”&nbsp;<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Budget 2017 proposes to invest $7 billion over 10 years, starting in 2018-19, to support and create more high-quality, affordable child care spaces across the country.</li><li>This investment is part of $21.9 billion announced in Budget 2017 to support social infrastructure in Canadian communities.</li><li>A portion of this $7 billion investment will be dedicated to early learning and child care programs for Indigenous children.</li><li>This investment builds on measures from Budget 2016 that provided an initial $500 million in 2017-18 for early learning and child care.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/home-accueil-en.html\">Budget 2017</a></li><li><a href=\"http://www.budget.gc.ca/2017/docs/themes/infrastructure-en.html\">Budget 2017: Infrastructure</a></li></ul></div>\n      "
}