{
  "path": "/en/news/news-releases/2017/11/06/prime-minister-announces-new-national-security-and-intelligence",
  "pageTitle": "Prime Minister announces new National Security and Intelligence Committee of Parliamentarians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians have been clear that they want – and need – our national security and intelligence communities to continue to be responsible and fully respect the rights and freedoms guaranteed to all citizens.</p><p>That is why the Prime Minister, Justin Trudeau, today announced the establishment of the National Security and Intelligence Committee of Parliamentarians, a multi-party committee that includes representatives from both the House of Commons and the Senate. &nbsp;&nbsp;</p><p>The Committee – to be chaired by David McGuinty, Member of Parliament for Ottawa South – will have the authority to review national security and intelligence activities carried out across the Government of Canada. This includes activities undertaken by the Canadian Security Intelligence Service, the Communications Security Establishment, the Royal Canadian Mounted Police, and the Canada Border Services Agency, amongst many others. The Committee’s mandate allows an unprecedented level of review and promotes government-wide accountability.</p><p>The Committee will provide the Prime Minister with annual reports on its reviews – including any findings and recommendations – that will be tabled in both Houses of Parliament and referred to the appropriate Standing Committees. Special reports may also be issued as needed.</p><h2>Quote</h2><blockquote><p>“The creation of a strong, accountable, and multi-party committee of dedicated parliamentarians will help us ensure that our national security agencies continue to keep Canadians safe in a way that also safeguards our values, rights, and freedoms. This independent group will help strengthen the accountability of our national security and intelligence work. In our system of responsible government, there is no substitute for scrutiny by parliamentarians.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The members of the National Security and Intelligence Committee of Parliamentarians will include:<ul><li>Gordon Brown, Conservative</li><li>The Honourable Tony Clement, P.C., Conservative</li><li>The Honourable Percy E. Downe, Senate</li><li>Emmanuel Dubourg, Liberal</li><li>The Honourable Hedy Fry, P.C., Liberal</li><li>Gudie Hutchings, Liberal</li><li>The Honourable Frances Lankin, P.C., C.M., Senate</li><li>David J. McGuinty, Liberal (Chair)</li><li>Murray Rankin, NDP</li><li>Brenda Shanahan, Liberal</li><li>The Honourable Vernon White, Senate</li></ul></li><li>The Committee will be supported by an independent Secretariat that will be led by an Executive Director to be appointed in the near future.</li><li>The Prime Minister also intends to recommend to the Governor General the appointment of Mr. David McGuinty to the Queen’s Privy Council for Canada.</li><li>The Committee is created under the <i>National Security and Intelligence Committee of Parliamentarians Act</i>, which received Royal Assent on June 22, 2017.</li><li>The creation of a committee of parliamentarians to review government departments and agencies with national security responsibilities was also a commitment set out in the mandate letters of the Leader of the Government in the House of Commons and the Minister of Public Safety and Emergency Preparedness.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/leader-government-house-commons-mandate-letter\">Leader of the Government in the House of Commons mandate letter</a></li><li><a href=\"/en/minister-public-safety-and-emergency-preparedness-mandate-letter\">Minister of Public Safety and Emergency Preparedness mandate letter</a></li><li><a href=\"http://laws-lois.justice.gc.ca/eng/acts/N-16.6/index.html\"><i>National Security and Intelligence Committee of Parliamentarians Act</i></a></li></ul></div>\n      "
}