{
  "path": "/en/news/news-releases/2023/04/20/president-germany-frank-walter-steinmeier-visit-canada",
  "pageTitle": "President of Germany Frank-Walter Steinmeier to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of Germany, Frank-Walter Steinmeier, will visit Canada from April 23 to 26, 2023. He will be joined by Mrs. Elke Büdenbender. During their visit, the President and Mrs. Büdenbender will visit Ottawa, Ontario, Vancouver, British Columbia, and Yellowknife and Tuktoyaktuk, Northwest Territories. The President will be joined by ministers, Members of Parliament and business leaders.</p>\n\n<p>The Prime Minister and the President will meet to further advance joint efforts to build the resilience of our democracies, economies, and environment. They will step up our collaboration on shared priorities including our unwavering support for Ukraine in the face of Russia’s brutal and unjustifiable invasion and addressing the broader global impacts of Russia’s war, like food and energy insecurity. They will work together on ways the two countries can fight climate change and build up clean energy resources, including through secure access to clean hydrogen and critical minerals and strong policies like pollution pricing. The leaders will also highlight our strong trade ties, which are growing our economies and creating good, middle-class jobs in both countries, as well as the close ties between our peoples.</p>\n\n<p>This visit will build on the progress made during last year’s visit from Chancellor of Germany, Olaf Scholz, to strengthen the close relationship between Canada and Germany in areas including our support for Ukraine and advancing clean energy. At this critical time, when the world and our people are facing a series of challenges, ranging from a high cost of living to energy and food insecurity, our two countries remain united by our shared values. As likeminded friends and allies, we must keep working closely together – now and into the future.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Germany are close friends – united by our shared values and common interests like upholding democracy, defending human rights, fighting climate change, and making life better for people in our countries and beyond. I look forward to welcoming President Steinmeier to Canada to keep building on our close friendship and partnership.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>Prime Minister Trudeau and President Steinmeier last met during the Prime Minister’s bilateral visit with Chancellor Scholz in Berlin in March 2022.</li>\n\t<li>The visit of President Steinmeier follows the visits of the Prime Minister Trudeau and Chancellor Scholz to Germany and Canada respectively in 2022.</li>\n\t<li>In October 2021, Her&nbsp;Excellency The Right&nbsp;Honourable Mary&nbsp;Simon, Governor&nbsp;General of Canada, visited Germany on her first State Visit, where she led the official delegation under Canada’s “Guest of Honour” designation at the prestigious Frankfurt Book Fair.</li>\n\t<li>Canada and Germany benefit from their strong cultural connections and people-to-people ties. Almost 10 per cent of Canadians claim at least partial German ancestry and about 400,000 Canadians travel to Germany each year. A similar number of people travel from Germany to Canada each year.</li>\n\t<li>Every year, several thousand German students spend a term or full year at a Canadian college, university, or high school. Thousands more young Germans and Canadians travel in each direction for short-term study and research or work as part of the International Experience Canada program.</li>\n\t<li>Germany is one of Canada’s most important sources of innovative, research, and engineering-intensive investment, with over 820 affiliates operating in Canada, employing nearly 63,000 Canadians. Germany is the 7th largest source of foreign direct investments into Canada.</li>\n\t<li>In 2022, Germany was Canada’s largest merchandise export market in the European Union, and its seventh-largest trading partner globally, with two-way merchandise trade totalling $30 billion.</li>\n\t<li>In 2022, Canadian exports to Germany were $7.5&nbsp;billion, while Canada’s imports from Germany were $22.5&nbsp;billion. Sectors of interest include aerospace, advanced manufacturing, automotive, life sciences, information and communications technologies, and agri-food. Canada’s top merchandise exports include consumer goods, energy products, metal ores and non-metallic minerals, metal and non-metallic mineral products, and electrical and electronic machinery and equipment.</li>\n\t<li>Investments in Canada by companies like Volkswagen AG advance collaboration across the automotive, battery, and critical minerals sectors. With its subsidiary PowerCo, Volkswagen AG will build its first overseas electric vehicle battery manufacturing facility in St. Thomas, Ontario, which demonstrates the strong and growing potential for collaboration in the clean technology space.</li>\n\t<li>In March 2022, and again in May 2022, Prime Minister Trudeau and Chancellor Scholz agreed to work together to advance adoption and expansion of carbon pricing around the world through Canada’s Global Carbon Pricing Challenge and Germany’s Climate Club. In May 2022, both Germany and Canada signed onto the G7 Hydrogen Action Pact.</li>\n\t<li>Long-standing partners in the North Atlantic Treaty Organization (NATO), Canada and Germany cooperate closely on security and defence issues, and are also both members of the G7 and G20, the Organisation for Economic Co-operation and Development (OECD), and the World Trade Organization (WTO).</li>\n\t<li>Canada and Germany are doing their part to contribute to NATO activities along NATO’s eastern flank, in particular through their leadership of NATO enhanced Forward Presence battle groups in Latvia and Lithuania, respectively.</li>\n\t<li>Canada-Germany science, technology, and innovation cooperation is rich, diverse and spans all fields of science from formal cooperation among the academic and research actors to public and private sector. We share many of the same areas of interest such as clean energy and hydrogen, polar research and climate change, quantum and AI, and digital health. The desire and potential for future collaboration is high and will be discussed at the 27<sup>th</sup> biannual meeting of the Canada-Germany Joint Committee for Scientific and Technological Cooperation taking place on May 30 to 31 2023, in Ottawa.</li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"/en/news/news-releases/2022/08/23/prime-minister-concludes-successful-visit-german-chancellor-olaf\">Prime Minister concludes a successful visit by German Chancellor Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n</ul></div>\n      "
}