{
  "path": "/en/news/readouts/2022/03/07/prime-minister-justin-trudeau-meets-prime-minister-netherlands-mark-rutte",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of the Netherlands Mark Rutte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of the Netherlands, Mark Rutte, at the Royal Air Force Base in Northolt, United Kingdom.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte strongly condemned the ongoing military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine, and worked together to identify additional measures to hold all responsible stakeholders accountable. In doing so, the prime ministers reviewed the recent sanctions against Russia, including restrictive measures against the Russian Central Bank, financial institutions, companies, officials, oligarchs, and elites, as well as the removal of Russian banks from the SWIFT messaging system. They acknowledged measures taken by global credit card companies to block Russian financial institutions and agreed to support similar initiatives in the future.</p>\n\n<p>The prime ministers discussed the growing international consensus against Russian aggression, as demonstrated by the recent vote in the United Nations General Assembly, and decided to facilitate coalition building among countries providing military, financial, and humanitarian support to Ukraine. The two leaders also discussed the importance of tackling misinformation and disinformation, and protecting press freedom, and committed to further collaborating during their co-chairmanship of the Media Freedom Coalition. They reiterated their commitment to advancing gender equality, creating more trade and job opportunities in both countries, and collaborating further in the areas of science and technology. The leaders recognized the heroic efforts and sacrifices of the Ukrainian Armed Forces and Ukrainian people, and denounced in particular Russia’s attacks against Ukrainian civilians.</p>\n\n<p>The two leaders discussed bilateral cooperation in the context of the North Atlantic Treaty Organization (NATO), as well as transatlantic cooperation on matters of security and trade to preserve and protect the principles of peace, security, and democracy in Europe and globally.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-02-09-freedom-expression-media-liberte-expression-medias.aspx?lang=eng\">Global Conference for Media Freedom: Joint communiqué</a></li>\n</ul></div>\n      "
}