{
  "path": "/en/news/news-releases/2019/02/07/prime-minister-highlights-project-improve-public-transit-maple",
  "pageTitle": "Prime Minister highlights project to improve public transit in Maple | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In 2016, the Government of Canada launched the biggest infrastructure plan in Canadian history. Since then, we have invested in and approved thousands of infrastructure projects, including 650 public transit projects in Ontario alone.</p><p>As Canadian cities continue to grow, we need to make sure their public transit systems keep pace with current and future transportation needs. The Prime Minister, Justin Trudeau, today visited Maple, Ontario, where he highlighted an investment of over $1.8 billion from the Government of Canada to expand GO rail public transportation infrastructure, including between Barrie and Union Station in Toronto.</p><p>These improvements will be funded as part of the ongoing GO Expansion project – the single largest transit project the federal government has ever funded.</p><p>With construction soon to be under way, the project will continue to create good, middle class jobs. Once completed, it will cut traffic, reduce air pollution, grow transit ridership, and make it easier and safer for people to get around the Greater Golden Horseshoe area of Ontario.</p><h2>Quote</h2><blockquote><p>“Smart investments in public transit help connect communities, create good, middle class jobs, and protect our environment. They also make a real difference in people’s lives, helping them get to work on time in the mornings, and be home with their families in the evenings. We will continue to work with and listen to communities, and invest in the infrastructure they need – today and into the future.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Barrie Corridor project, which runs through Maple, includes the construction of approximately 51.2 km of new track between Union Station and Barrie, train layover facilities, and station upgrades.</li><li>The Government of Canada is contributing more than $1.8 billion to the Metrolinx GO Expansion project through the New Building Canada Fund’s Provincial-Territorial Infrastructure Component – National and Regional Projects.</li><li>The New Building Canada Fund’s Provincial-Territorial Infrastructure Component provides funding to support infrastructure projects of national and regional significance that contribute to economic growth, a clean environment, and stronger communities.</li><li>The Government of Canada is also contributing more than $1.4 billion under the Public Transit Infrastructure Fund for over 650 projects in Ontario to improve transit services across the province.</li><li>Budget 2017 invested $20.1 billion over 11 years through bilateral agreements with provinces and territories, and an additional $5 billion through the Canada Infrastructure Bank, to support communities across Canada as they build the new urban transit networks and service extensions that will transform the way Canadians move, work, and live.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.infrastructure.gc.ca/plan/pti-itc-eng.html\">Infrastructure Canada – Public Transit Infrastructure</a></li><li><a href=\"http://www.metrolinx.com/en/regionalplanning/rer/\">Metrolinx – GO Expansion project</a></li><li><a href=\"http://www.metrolinx.com/en/regionalplanning/rer/rer_barrie.aspx\">Metrolinx – Barrie Go Line</a></li></ul></div>\n      "
}