{
  "path": "/en/news/readouts/2022/12/16/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister expressed Canada’s solidarity with the Ukrainian people as they prepare for winter while Russia continues to attack Ukraine’s critical civilian infrastructure. Prime Minister Trudeau reaffirmed Canada’s determination to support Ukraine with military, humanitarian, financial, and other assistance for as long as necessary.</p>\n\n<p>President Zelenskyy thanked Canada for its ongoing contributions to Ukraine, including demining resources, winter gear for Ukraine’s armed forces, and financial support ‒ most recently through the Ukraine Sovereignty Bond. The President also welcomed Canada’s decision to revoke the temporary permit allowing for the repair and return of Siemens turbines for use in the Nord Stream 1 pipeline.</p>\n\n<p>The President also expressed gratitude for Canada’s $115 million contribution to support Ukraine’s energy infrastructure through the World Bank, announced at the December 13 <em>Standing With the Ukrainian People</em> conference in Paris, France.</p>\n\n<p>The two leaders discussed President Zelenskyy’s initiative for a just peace, and Prime Minister Trudeau affirmed Canada’s commitment to support Ukraine in working toward a sustainable peace that secures Ukraine’s free and democratic future, ensures its ability to defend itself, and deters future Russian aggression.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy also talked about how to support the Global South as it grapples with food and energy crises exacerbated by Russia’s war against Ukraine.</p>\n\n<p>The leaders agreed to remain in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/programs/financial-sector-policy/ukraine-sovereignty-bond.html\">Ukraine Sovereignty Bond</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/12/13/canada-provides-ukraine-115-million-russian-and-belarusian-tariff\">Canada provides Ukraine $115 million from Russian and Belarusian tariff revenues to repair Kyiv’s power grid</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/16/prime-minister-justin-trudeau-and-prime-minister-united-kingdom-rishi\">Prime Minister Justin Trudeau and Prime Minister of the United Kingdom Rishi Sunak speak with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}