{
  "path": "/en/news/statements/2022/03/27/statement-prime-minister-80th-anniversary-diplomatic-relations-between",
  "pageTitle": "Statement by the Prime Minister on the 80th anniversary of diplomatic relations between Canada and Poland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 80th anniversary of diplomatic relations between Canada and Poland:</p>\n\n<p>“Today, Canada and Poland mark the 80th anniversary of diplomatic relations. Over the past eight decades, our countries have enjoyed a longstanding relationship rooted in shared values and a rich history of military cooperation working to advance our shared commitments to peace, security, freedom and democracy.</p>\n\n<p>“On this day in 1942, as the Second World War raged, Wiktor Podoski presented his letters of credence as Polish envoy to Canada. Ever since, Poland has become a close friend, partner, and ally.</p>\n\n<p>“Today, our countries continue to deepen their ties and collaborate on shared priorities, including by remaining united in condemning Russia’s ongoing aggression against the territorial integrity, sovereignty, and independence of Ukraine, and closely collaborating on the international humanitarian response. Poland has played an important role in responding to the further Russian invasion of Ukraine. We thank Poland and the Polish people for their remarkable efforts in welcoming more than two million Ukrainians over the past month, a testament to the dedication, strength, and goodwill of the Polish people.</p>\n\n<p>“During my recent visit to Poland earlier this month, I met with President Andrzej Duda to discuss security challenges and regional defence in Eastern Europe and the need to continue increasing economic and diplomatic pressure on Russia. I reiterated Canada’s support to Poland as it grapples with significant humanitarian challenges due to the refugee crisis. We also explored opportunities to broaden the bilateral trade relationship for the benefit of people in both Canada and Poland.</p>\n\n<p>“Today, more than 1.1 million Canadians of Polish origin reside in Canada. On this important anniversary, we reflect on the successes and evolution of our relationship and take the opportunity to recognize the significant contributions Polish Canadians made – and continue to make – for Canada to be the strong, diverse, and inclusive country we know today.</p>\n\n<p>“Our two countries will continue to work closely together to advance our shared priorities including through a number of multilateral organizations, such as the North Atlantic Treaty Organization (NATO) and the United Nations. Canada was the first NATO country to approve Poland joining the Alliance and our countries continue to serve together, including on the Canada-led multinational NATO battle group in Latvia to ensure a peaceful and stable Europe.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to the people of Poland, Polish Canadians, and everyone celebrating. Together, we will continue to build a better future for everyone.”</p></div>\n      "
}