{
  "path": "/en/news/readouts/2017/07/08/joint-statement-prime-minister-and-president-european-commission-reaching",
  "pageTitle": "Joint Statement by the Prime Minister and the President of the European Commission on reaching a date for the provisional application of the Comprehensive Economic and Trade Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, and the President of the European Commission, Jean-Claude Juncker, today issued the following joint statement:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Comprehensive Economic and Trade Agreement marks a new chapter in the relationship between the European Union (EU) and Canada.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“It is by opening up to each other, by working closely with those who share the same values that we will shape and harness globalisation.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“It is important that our companies and citizens, the real winners with this agreement, start reaping its benefits without further ado.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Both at the EU level and in Canada, the necessary steps were taken to ratify the agreement.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Meeting at the G20 in Hamburg, reconfirming our joint commitment to the rules-based international trading system, we agreed to set the date of September 21, 2017 to start the provisional application of the agreement, thus allowing for all the necessary implementing measures to be taken before that date.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The agreement will now be provisionally applied and will enter definitively into force once the parliaments in all Member States of the EU ratify the text according to their respective domestic constitutional requirements.”<br> <br> </span></p></div>\n      "
}