{
  "path": "/en/news/news-releases/2016/05/13/prime-minister-travel-japan-official-working-visit-and-attend-g7",
  "pageTitle": "Prime Minister to travel to Japan for an official working visit and to attend the G7 Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Japan to participate in the G7 Leaders’ Summit on May 26 and 27 in Ise-Shima. Prior to the Leaders’ Summit, and at the invitation of Prime Minister Shinzo Abe, Prime Minister Trudeau will participate in an official working visit from May 23-25.&nbsp;&nbsp;&nbsp;</p>\n<p>While in Japan, Prime Minister Trudeau will have an audience with the Emperor and Empress of Japan, and will meet with Prime Minister Abe to reaffirm the close and growing ties between Canada and Japan across a broad range of areas of cooperation. The Prime Minister will also meet with leaders in the automotive sector to discuss ways to further promote trade and investment between Canada and Japan, all of this in an effort to create good-paying jobs for Canadians, strengthen the middle class, and work towards clean and sustainable economic growth.</p>\n<p>During the G7 Leaders’ Summit, Canada will reaffirm its new approach to global engagement. The Prime Minister will highlight Canada’s resolve to work with its G7 partners on a number of key global issues, including the economy, trade, climate change, peace and security, development and women’s empowerment, which will all contribute to advancing the government’s priorities.</p>\n<p><strong>Quotes</strong></p>\n<p>“Japan is a long-standing and important partner for Canada. I look forward to meeting the Emperor and Empress of Japan.&nbsp; During my meeting with Prime Minister Shinzo Abe, we will explore ways to deepen Canadian and Japanese ties on many levels, including trade, investment, peace and security, culture, education, environment, and science, technology and innovation.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“In this new era of Canada’s international engagement, I look forward to meeting my G7 counterparts to bolster collaboration on shared domestic and global priorities and challenges, including our work to build inclusive and sustainable economies and societies that support a strong middle-class.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}