{
  "path": "/en/news/readouts/2020/05/04/prime-minister-justin-trudeau-speaks-prime-minister-netherlands-mark-rutte",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Prime Minister of the Netherlands, Mark Rutte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the Netherlands, Mark Rutte.</p>\n\n<p>Prime Minister Rutte offered his sincere condolences following the shooting in Nova Scotia and the accident of the Canadian Armed Forces helicopter off the coast of Greece. Prime Minister Trudeau thanked Prime Minister Rutte for his thoughts.</p>\n\n<p>On the eve of the 75th anniversary of the Liberation of the Netherlands, Prime Minister Trudeau and Prime Minister Rutte spoke about the strong and lasting bonds between Canada and the Netherlands grounded in Canada’s role in the Liberation. The Prime Ministers paid tribute to the sacrifices and brave efforts of the Canadian service members who liberated the Dutch people and helped bring the Second World War to an end in Europe. The two leaders expressed their enduring commitment to honour the sacrifices of those who fought and gave their lives for freedom.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte discussed the COVID-19 crisis currently facing the world. They agreed on the importance of global solidarity, including through the Coronavirus Global Response initiative, which was launched today as a vital part of the global response and recovery process. They discussed taking steps toward gradually restarting economies safely, and building resilience to ensure a sustainable recovery.</p>\n\n<p>The Prime Ministers reaffirmed their support for the Safer Skies initiative, which will help find ways to better manage civil aviation in airspace above conflict zones.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte spoke about the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which is creating opportunities on both sides of the Atlantic.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherland relations</a></li>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/commemorative-events/netherlands-ve-day\">The 75<sup>th</sup>&nbsp;anniversary of the Liberation of the Netherlands and V-E Day</a></li>\n\t<li><a href=\"https://global-response.europa.eu/index_en\">Coronavirus Global Response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}