{
  "path": "/en/news/readouts/2023/04/24/prime-minister-meets-president-germany-frank-walter-steinmeier",
  "pageTitle": "Prime Minister meets with President of Germany Frank-Walter Steinmeier | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Germany, Frank-Walter Steinmeier.&nbsp;They were joined by the Minister of Foreign Affairs, Mélanie Joly, and the German Federal Minister of Education and Research, Bettina Stark-Watzinger.</p>\n\n<p>Prime Minister Trudeau welcomed President Steinmeier and his delegation to Canada. The Prime Minister and the President discussed the objectives of the visit and agreed, as allies, on the importance of advancing collaborations that strengthen the resilience of our economies, communities, democracies, and environment.</p>\n\n<p>The Prime Minister and the President emphasized the strength and importance of the relations between Canada and Germany in addressing global challenges such as&nbsp;the high cost of living, the transition toward low-carbon economies, and energy security. The two leaders welcomed the positive momentum created by Germany’s ratification of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) for bilateral trade and investment, and discussed the advancement made on joint collaborations since Chancellor Scholz’s visit in October 2022, including the announcement of Volkswagen’s first overseas electric vehicle battery plant in Canada. Building on Germany’s longstanding engagement in Arctic scientific research, the leaders also discussed potential avenues for deepened cooperation in that area.</p>\n\n<p>The two leaders expressed concern over the conflict in Sudan and agreed on the need for close collaboration, including with partners in the region. Prime Minister Trudeau and President Steinmeier strongly condemned Russia’s ongoing illegal, full-scale invasion of Ukraine and underlined their shared commitment to support Ukraine as long as it takes. Prime Minister Trudeau commended Germany’s leadership and unwavering support for Ukraine, including its considerable military assistance. The Prime Minister and President also discussed cooperation in the Indo-Pacific region and underscored the importance of ongoing transatlantic unity.</p>\n\n<p>Prime Minister Trudeau wished President Steinmeier a successful visit to Canada, including on his engagements in Vancouver, British Columbia, and Yellowknife and Tuktoyaktuk, Northwest Territories.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/04/21/volkswagens-new-electric-vehicle-battery-plant-will-create-thousands\">Volkswagen’s new electric vehicle battery plan will create thousands of new jobs</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/04/20/president-germany-frank-walter-steinmeier-visit-canada\">President of Germany Frank-Walter Steinmeier to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/23/prime-minister-concludes-successful-visit-german-chancellor-olaf\">Prime Minister concludes a successful visit by German Chancellor Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}