{
  "path": "/en/news/news-releases/2019/07/16/governor-general-canada-cheer-canadian-athletes-xviii-pan-american",
  "pageTitle": "Governor General of Canada to cheer on Canadian athletes at the XVIII Pan American Games in Lima | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Lima, Peru, from July 23 to 27, 2019.</p>\n\n<p>During the visit, the Governor General will attend a Team Canada Welcome Ceremony and the Opening Ceremony of the XVIII Pan American Games. Her Excellency will support Canadian athletes during the Games as they compete against the best in the Americas for a spot on the podium.</p>\n\n<p>The visit is also an opportunity for the Governor General to meet with the President of Peru, Martín Vizcarra, and deepen Canada’s warm relationship with Peru.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I join all Canadians in wishing our athletes the best of luck in Lima. They inspire us all, and represent the best of Canadian determination and drive. In Peru, the Governor General will be cheering them on for all of us.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Her Excellency’s first visit to Peru. The last Governor General to visit Peru was the Right Honourable David Johnston in 2012.</li>\n\t<li>The XVIII Pan American Games will take place from July 26 to August 11, 2019.</li>\n\t<li>Approximately 6,700 athletes will represent 41 countries from North America, South America, Central America, and the Caribbean.</li>\n\t<li>The Government of Canada is the largest single investor in Canada’s sport system, providing funding for initiatives that support our athletes and promote sport participation among all Canadians.</li>\n</ul></div>\n      "
}