{
  "path": "/en/news/readouts/2021/01/26/prime-minister-justin-trudeau-speaks-us-special-presidential-envoy-climate",
  "pageTitle": "Prime Minister Justin Trudeau speaks with U.S. Special Presidential Envoy for Climate John Kerry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with U.S. Special Presidential Envoy for Climate, John Kerry.</p>\n\n<p>The Prime Minister warmly welcomed the return of the United States to the Paris Agreement and committed to working together to drive progress in the fight against climate change.</p>\n\n<p>Prime Minister Trudeau and Special Presidential Envoy Kerry agreed that the climate crisis requires increased and bold ambition and coordinated action in the lead-up to the COP26 climate conference in November.&nbsp;They looked forward to cooperating on the global stage and in a bilateral context, and identified numerous opportunities for joint leadership on climate change and a clean economy, including on attaining net-zero emissions, clean energy transmission, zero-emissions vehicles, methane emissions, and the importance of securing reliable supply chains for critical minerals and the manufacturing of batteries.</p>\n\n<p>Prime Minister Trudeau welcomed President Biden’s plans to host a climate leaders’ summit on April 22 (Earth Day).</p>\n\n<p>They also discussed the benefits of the Canada-United States-Mexico Agreement (CUSMA) and opportunities for increased collaboration between Canada and the U.S. in fighting the COVID-19 pandemic, including on border measures.&nbsp;The Prime Minister noted the important energy security relationship between the two countries and the importance of the integrated auto, power, and supply chain markets between the two nations.&nbsp;&nbsp;&nbsp;</p>\n\n<p>The Prime Minister and Special Presidential Envoy Kerry looked forward to staying in touch and to close collaboration between their teams.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/22/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/22/prime-minister-concludes-virtual-g20-leaders-summit\">Prime Minister concludes virtual G20 Leaders’ Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n</ul></div>\n      "
}