{
  "path": "/en/news/statements/2018/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:</p><p>“On this day in 1985, Canadians awoke to news that defied belief, and left our country in a state of shock and suffering.</p><p>“Air India Flight 182, bound for London after picking up passengers in Toronto and Montréal, disappeared from radar off the coast of Ireland. A bomb – planted on the plane in Canada in an act of terror – exploded on board, killing 329 innocent people, including 280 Canadians.</p><p>“The Air India bombing remains the single worst terrorist attack in Canada’s history. This horrific act of malice and destruction left families and friends grieving the loss of loved ones, and brought pain that will never completely go away.</p><p>“Today, we remember every Canadian whose life has been cut short or forever changed by a terrorist act. We hold in our thoughts the two Canadians killed by a terrorist attack in Ouagadougou, and the Canadian who lost his life in the Barcelona van attack. Our hearts also go out to those closer to home, including the police officer and many others injured in last September’s attack in Edmonton, and the six worshippers killed during the shooting at the Centre culturel islamique de Québec.</p><p>“In times of tragedy and testing, Canadians have shown that the values which bring us together – inclusion, compassion, justice, and equality – are much stronger than the forces that try, and fail, to wedge us apart.</p><p>“Terrorists believe, through cowardly and violent acts, that they can make us question not only our safety, but the democratic institutions that keep us safe. They are wrong. Canadians are for facts and diversity, not fear and division. Our society thrives on inclusivity, and these acts only strengthen our resolve for unity.</p><p>“Canada condemns all forms of terrorism. We stand in solidarity with our allies, and the international community, in the ongoing fight to prevent radicalization and fight terrorism at home and abroad.</p><p>“On behalf of the Government of Canada, I extend my condolences to everyone everywhere who has lost loved ones to terrorism. We also thank and honour those who work each day to keep our citizens, communities, and country safe.”</p></div>\n      "
}