{
  "path": "/en/news/statements/2016/10/11/statement-prime-minister-canada-marking-international-day-girl",
  "pageTitle": "Statement by the Prime Minister of Canada marking International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking the International Day of the Girl:</p>\n<p>“The International Day of the Girl is an opportunity to celebrate the empowerment of girls and young women, at home and around the world, in every sphere locally and globally. It is also a day to draw attention to the unique challenges that girls still face.</p>\n<p>“While the international community has made important progress in improving the lives of girls and young women, there is still significant work to be done. Far too many girls and young women are still denied basic human rights, including education, health care and personal security. Far too many succumb to preventable diseases or are held back from pursuing their dreams.</p>\n<p>“The Government of Canada believes that every girl deserves an equal start in life, the chance to grow to her full potential, and every opportunity available to boys. I take this commitment to Canadians, to girls around the world, and to my own daughter very seriously. That is why we are investing in several programs – in Canada and beyond – that will directly benefit girls and young women, including those that promote gender equality, education and health care, and support efforts to prevent gender-based violence and stop human trafficking.</p>\n<p>“On this day, Sophie and I encourage all Canadians to join us in supporting girls and young women to realize their dreams and achieve their full potential. I also urge you to take part in the Government of Canada’s #BecauseOfHer campaign to honour the amazing girls and women who are making a difference in your community. To all Canadians, and especially to girls and young women: Happy International Day of the Girl.”</p></div>\n      "
}