{
  "path": "/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid",
  "pageTitle": "Prime Minister announces support for vulnerable Canadians affected by COVID‑19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>During the global COVID-19 outbreak, the Government of Canada is working hard to help Canadians, including our youth and seniors. Over the last week alone, we have announced major new supports for families, for workers, and for businesses. But even with this extra help, people are facing a tough situation. And, for people who were already struggling, it’s even harder now.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced measures to support vulnerable Canadians to help cope with the health, social, and economic impacts of the COVID‑19 pandemic.</p>\n\n<p>These measures will help provide young people with mental health supports and Canadian seniors with practical services. They will also help ensure some of the most vulnerable Canadians have a safe place to turn and a roof over their heads. The Government of Canada will:</p>\n\n<ul>\n\t<li>Increase support for Canadians experiencing homelessness, and provide help for women and children fleeing violence. As announced on March 18, 2020, the Government of Canada will provide an additional $157.5 million to address the needs of Canadians experiencing homelessness. The government will also provide up to $50 million to women’s shelters and sexual assault centres, including facilities in Indigenous communities, to help with their capacity to manage or prevent an outbreak.</li>\n\t<li>Provide support for counselling services to children and youth. As a result of school closures and reduced access to community resources, Kids Help Phone is experiencing increased demand for its 24/7 confidential online, telephone, and text counselling services across Canada. The Government of Canada will give $7.5 million in funding to Kids Help Phone to provide young people with the mental health support they need during this difficult time.</li>\n\t<li>Provide immediate essential services to Canadian seniors impacted by COVID-19. The Government of Canada will contribute $9 million through United Way Canada for local organizations to support practical services to Canadian seniors. These services could include the delivery of groceries, medications, or other needed items, or personal outreach to assess individuals’ needs and connect them to community supports.</li>\n</ul>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“While the COVID-19 pandemic affects all Canadians, some people and communities are more at risk to its impacts. That is why it is important to keep connected and make sure that everyone feels safe and supported in this uncertain time. Today’s announcement is about helping our most vulnerable Canadians and ensuring our community organizations have what they need to deliver critical services to those most at risk.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada strives to support the most vulnerable in our communities. This pandemic means that some of our fellow Canadians need help now, more than ever. That is why we are working with partners to increase the support to ensure organizations on the front lines of COVID-19 can continue to serve those Canadians who need it most.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“We owe a big thanks to Canada’s young people who are staying home from school or from work because they know it will take all of us to plank the curve. This is an unprecedented time. Canadians are anxious about what is happening here at home and around the world. Young Canadians are concerned too, and for those youth who don’t have someone to talk to, they can turn to Kids Help Phone. Today’s investment of $7.5 million will ensure that there are counsellors and trained volunteers ready to answer their call. Physical distancing does not mean you are alone – help is a phone call away.”</p>\n\n<footer class=\"default\">The Hon. Bardish Chagger, Minister of Diversity and Inclusion and Youth</footer>\n</blockquote>\n\n<blockquote>\n<p>“While physical distancing is essential to protecting seniors from COVID-19, it risks isolating them from their community. That is why the Government of Canada is proud to work with United Way Canada to help support the needs of seniors during this difficult time. By using local expertise, this funding will help provide support tailored to the unique, local needs of seniors across the country. As we work together to flatten the curve and slow the spread of the virus, the government is supporting Canadians every step of the way.”</p>\n\n<footer class=\"default\">The Hon. Deb Schulte, Minister of Seniors</footer>\n</blockquote>\n\n<blockquote>\n<p>“The changes happening to slow the spread of COVID-19 create disruptions in our lives. That is why helping everyone maintain good mental health during this time is a priority for our government, and this investment in Kids Help Phone – a leader in responding to the needs of young Canadians – is an important step towards that goal.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>If infected by COVID-19, Canadians aged 65 and over, and those with compromised immune systems or underlying medical conditions, are at an increased risk of more severe complications. If you are at risk for complications, you can <a href=\"https://www.canada.ca/en/public-health/services/publications/diseases-conditions/people-high-risk-for-severe-illness-covid-19.html\">take action to reduce your risk</a> of getting sick from COVID-19.</li>\n\t<li>Canadians who experience symptoms of COVID-19 should stay home and call their local public health authority to get advice on what they should do.</li>\n\t<li>Without additional support, COVID-19 will have a disproportionate impact on vulnerable populations who may be less able to deal with the health, social, and economic impacts of the pandemic. Risks of stress, hardship, and abuse are expected to rise as people become unable to access the social and community supports on which they rely in their everyday lives.</li>\n\t<li>United Way&nbsp;Canada is a charitable, not-for-profit organization that works to improve people’s lives and build strong communities across Canada. They provide services for vulnerable populations including seniors, people with disabilities, and Canadians experiencing homelessness.</li>\n\t<li>Kids Help Phone is a 24/7, national support service for children and youth. The organization offers professional counselling, information, and referrals, as well as volunteer-led, text-based support, to young people across the country in English and French. Their service is completely confidential.</li>\n\t<li>The funding for seniors will be delivered through the New Horizons for Seniors Program. The Program supports projects that help improve the well-being and quality of life of seniors, and fosters social inclusion and engagement of Canadian seniors in their communities.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update.html\">Helping Canadians with the economic impact of the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">Government of Canada takes action on COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/canada-outlines-measures-to-support-the-economy-and-the-financial-sector.html\">Canada outlines measures to support the economy and the financial sector</a></li>\n</ul></div>\n      "
}