{
  "path": "/en/news/news-releases/2019/02/21/investment-halifax-reduce-congestion-and-improve-road-safety",
  "pageTitle": "Investment in Halifax to reduce congestion and improve road safety | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Traffic is a common sight heading to and from Burnside, Nova Scotia, especially at rush hour. To ease traffic and cut down on congestion, the Prime Minister, Justin Trudeau, today announced an investment of up to $86.5 million to build the Sackville-Bedford-Burnside Connector.</p><p>The Sackville-Bedford-Burnside Connector will extend Highway 107, build a high-speed bypass, and connect highways 101, 102, and 118. During construction, the project will create 150 good, middle class jobs in the region.</p><p>Once completed by September 2023, the connector will provide an important link between Bedford and Burnside, and make getting around the Greater Halifax area safer and easier.</p><h2>Quotes</h2><blockquote><p>“Gridlock is a daily frustration for people from Burnside and Bedford. The Sackville-Bedford-Burnside Connector will go a long way in making their commutes shorter and safer. Our government will continue to make historic investments that help grow local economies and respond to the specific needs of communities.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The new Sackville-Bedford-Burnside Connector Highway will more directly connect Burnside Park and surrounding communities with our major provincial highway network including Highways 102, 107, and 118. This will result in improved safety, reduced travel times and the more efficient movement of people and goods through the provincial highway system. We are proud to be working in a close partnership with our federal partners to invest in important infrastructure projects that will contribute to long-term growth, create good jobs and build our economy and communities for the future.”<br>—<cite>The Honourable Lloyd Hines, Minister of Transportation and Infrastructure Renewal for Nova Scotia.</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In 2016, the Government of Canada launched the biggest infrastructure plan in Canadian history. Since then, the Government has invested in hundreds of infrastructure projects to expand highways, build new roads, and make traveling safer and easier for Canadians from coast to coast to coast.</li><li>This investment is provided through the New Building Canada Fund’s Provincial-Territorial Infrastructure Component – National and Regional Projects. In addition to the Government of Canada funding, the Province of Nova Scotia is providing up to $107 million in funding and the Halifax Regional Municipality is providing the remainder.</li><li>The Provincial-Territorial Infrastructure Component of the New Building Canada Fund provides funding to support infrastructure projects of national and regional significance that contribute to economic growth, a clean environment, and stronger communities.</li><li>Through the Investing in Canada Plan, the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li><li>More than $10 billion of this funding is supporting trade and transportation projects, including $5 billion available for investment through the Canada Infrastructure Bank.</li><li>In Nova Scotia, the Government of Canada is providing $828.5 million through an integrated bilateral agreement to support important infrastructure projects in the province.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.infrastructure.gc.ca/investments-2002-investissements/ns-eng.html\">Federal infrastructure investments in Nova Scotia</a></li><li><a href=\"https://www.infrastructure.gc.ca/site/alt-format/pdf/plan/icp-pic/IC-InvestingInCanadaPlan-ENG.pdf\">Investing in Canada: Canada’s Long-Term Infrastructure Plan</a></li><li><a href=\"https://www.infrastructure.gc.ca/site/alt-format/pdf/pdf-ptic/20190118-NBCF-PTIC-NRP-business-case-guide-eng.pdf\">New Building Canada Fund – Provincial-Territorial Infrastructure Component – National and Regional Projects Fund</a></li></ul></div>\n      "
}