{
  "path": "/en/news/news-releases/2016/01/21/prime-minister-trudeau-meets-extraordinary-young-people-world",
  "pageTitle": "Prime Minister Trudeau meets with extraordinary young people at World Economic Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, met today with the Global Shapers Community, a group of exceptional young people representing 38 countries from all regions of the world at the World Economic Forum (WEF). They discussed the importance of young leaders having a voice at international fora such as the WEF to shape the global agenda.</p>\n<p>They also spoke of how diversity is key to strengthening communities, the economy, and encouraging innovation. The Prime Minister underscored how Canada’s diversity is among its greatest assets and is vital to enhancing the prosperity of Canadians.</p>\n<p><strong>Quote</strong></p>\n<p>“Today, I had the privilege of discussing with progressive, energetic, and engaged community leaders and activists from around the world on how they influence the narrative on international diversity. By holding a meaningful dialogue, we are showing the world that these young people understand, as Canada does, that pluralism is the key to building resilient, confident nations around the world.”<br>- Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;</p>\n<p><strong>Quick Facts</strong>:</p>\n<ul>\n<li>The Global Shapers Community is represented at the World Economic Forum Annual Meeting 2016 in Davos-Klosters by 50 Global Shapers (with gender parity) representing 50 Hubs and 38 countries from all world regions.</li>\n<li>At the WEF Annual Meeting, Global Shapers engage in a variety of activities and interact&nbsp;with leaders across different stakeholder communities, to promote the voice of youth in shaping the agenda across national, regional and global issues.</li>\n<li>For the first time in the history of the Forum, the Annual Meeting is co-chaired by a Global Shaper – Amira Yahyaoui from the Tunis Hub, an activist focused on promoting human rights and advocating for transparency and accountability in Tunisia.</li>\n</ul></div>\n      "
}