{
  "path": "/en/news/statements/2020/04/19/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week:</p>\n\n<p>“Today is the first day of <a href=\"https://volunteer.ca/index.php?MenuItemID=407\">National Volunteer Week</a>, when we recognize the Canadians who devote their time and skills to making our country a better place.</p>\n\n<p>“This year’s theme, ‘It’s time to applaud this country’s volunteers’, underscores how volunteers work tirelessly and often behind the scenes. It highlights how our charities and non-profit organizations depend on their support to provide services to Canadians who need them most.</p>\n\n<p>“Across Canada, countless volunteers look beyond their circumstances to be there for others. And that hasn’t changed during the COVID-19 pandemic. In these difficult times, Canadians are still taking care of each other.</p>\n\n<p>“People are training as crisis responders for the Kids Help Phone, writing letters to isolated seniors, and spending hours in food banks to pack hampers with essential items for families in need. Let’s continue these acts of service because Canadians need to stick together during these tough times. We thank and continue to encourage Canadians to sign up for the <a href=\"https://emploisfp-psjobs.cfp-psc.gc.ca/psrs-srfp/applicant/page1800?toggleLanguage=en&amp;poster=1437722\">National COVID-19 Volunteer Recruitment Campaign</a>, and other organizations – because large or small, each act makes a difference as we work together to fight this pandemic.</p>\n\n<p>“To our volunteers, know that your fellow Canadians see you and appreciate your dedication to your communities and our country. We know how much you do, and we are grateful. On behalf of the Government of Canada, I thank all volunteers for showing us that we truly are stronger together.”</p></div>\n      "
}