{
  "path": "/en/news/statements/2020/08/17/statement-prime-minister-minister-bill-morneaus-resignation",
  "pageTitle": "Statement by the Prime Minister on Minister Bill Morneau’s resignation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Minister Bill Morneau’s resignation:</p>\n\n<p>“Today, I spoke with Bill Morneau and accepted his resignation. Since the day he was first elected and became Canada’s Finance Minister nearly five years ago, Bill has worked relentlessly to support all Canadians and create a resilient, fair economy that benefits everyone. Under his leadership, Canada developed a strong economy with one of the best balance sheets in the G7, created over one million jobs, achieved the lowest unemployment rate in recorded history, lifted over one million people out of poverty, and created a coherent plan to protect the environment while growing the economy. Bill played a central role in transformational projects like the enhancement of the Canada Pension Plan and the creation of the Canada Child Benefit, which are improving the lives of millions of Canadian families.</p>\n\n<p>“That focus and commitment to supporting families and businesses has served Canadians well since the outset of the global pandemic. Bill led the creation of the Canada Emergency Response Benefit and the Canada Emergency Wage Subsidy, along with many other emergency measures that millions of Canadians and thousands of businesses continue to rely on today. Every step of the way, Bill and I have worked closely together, along with our team of cabinet ministers and caucus members to help Canadians navigate this challenging time. Our number one priority has been supporting Canadian families and businesses the best and fastest way possible. Thanks to his unwavering leadership and commitment to service through the pandemic, our government has laid the groundwork for a strong economic recovery.</p>\n\n<p>“I want to thank Bill for everything he has done to improve the quality of life of Canadians and make our country a better and fairer place to live. I have counted on his leadership, advice, and close friendship over the years and I look forward to that continuing well into the future. Bill, you have my deepest gratitude and I know you will continue making great contributions to our country and for Canadians in the years to come.</p>\n\n<p>“Today, Bill has announced that he will put forward his name as a candidate to be the next Secretary General of the OECD. Canada will vigorously support his bid to lead this important global institution that will play a critical role in the global economic recovery.”</p></div>\n      "
}