{
  "path": "/en/news/news-releases/2018/04/20/prime-minister-concludes-successful-trip-london",
  "pageTitle": "Prime Minister concludes successful trip to London | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to London, United Kingdom (UK), where he attended the Commonwealth Heads of Government Meeting (CHOGM), and promoted progressive trade that creates economic growth for all, addressed climate change and ocean protection, and emphasized the importance of values like gender equality, inclusion, and respect for diversity.</p><p>During his visit, Prime Minister Trudeau met with the Prime Minister of the United Kingdom, Theresa May, to grow the already strong economic and trade partnership between our two countries. The two leaders restated their commitment to a seamless transition on free trade as the UK exits the European Union.</p><p>They later participated in a security meeting, alongside the Prime Minister of New Zealand, Jacinda Ardern, and the Prime Minister of Australia, Malcolm Turnbull, to discuss pressing international issues, including cybersecurity, the situation in Syria, and how we work together to keep our countries and communities safe.</p><p>While in London, the Prime Minister was received by Her Majesty Queen Elizabeth II at Buckingham Palace, where he thanked her personally for her continued dedication and service to Canada.</p><p>At an event hosted by the Mayor of London, Sadiq Aman Khan, and the Fawcett Society, Prime Minister Trudeau joined Mayor Khan, Prime Minister Ardern, and young people from across London to mark the 100<sup>th</sup>&nbsp;anniversary since the first women received the right to vote in the UK, and discuss the importance of gender equality.</p><p>At CHOGM, the Prime Minister underlined Canada’s commitment to address climate change, protect our oceans, and deliver economic growth that creates jobs and benefits everyone. He also reiterated the need to strengthen the Commonwealth’s role in protecting and promoting universal values of democracy, human rights – including LGBTQ2 rights – and the rule of law.</p><p>Commonwealth leaders endorsed the Commonwealth Blue Charter, which calls for ambitious and coordinated action to promote the sustainable use of coastal and ocean resources, and protect and preserve our world’s oceans. The Prime Minister announced that Canada will become a Commonwealth Blue Charter Champion on oceans observation, a fitting role as oceans protection is a key theme of Canada’s G7 Presidency.</p><p>On the margins of CHOGM, Canada committed to further support other Commonwealth nations to advance human rights and improve the lives of LGBTQ2 people. Canada will provide more than $300,000 to help Commonwealth small states more actively participate in multilateral human rights organizations, such as the United Nations Human Rights Council.</p><p>The Prime Minister also hosted a roundtable discussion with leaders of Commonwealth small islands and coastal states. Canada committed to provide $3.35&nbsp;million to promote economic and political participation for women in the Pacific Islands, and increase women’s presence in disaster preparedness and the fight against climate change.</p><p>Finally, the Prime Minister held bilateral meetings with other Commonwealth leaders, including Paul Kagame, President of Rwanda, Uhuru Kenyatta, President of Kenya, Filipe Nyusi, President of Mozambique, and Cyril Ramaphosa, President of South Africa, to further strengthen Canada’s relationship with African nations.</p><h2>Quotes</h2><blockquote><p>“The UK is among Canada’s closest friends and most important partners. We unite in our shared history, family ties, and unwavering commitment to democratic values. We will continue to set the stage for an even closer economic partnership, and create greater opportunities for citizens of Canada and the UK alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“CHOGM is a unique and valuable forum that brings leaders from every corner of the globe together. I thank my Commonwealth counterparts for the productive discussions over the last few days. Working together, we can play an important role in addressing the most pressing challenges of our time – like fighting climate change, eradicating poverty, and building a truly gender equal world.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The UK is one of Canada’s closest friends and allies. Beyond a shared heritage, the UK is one of Canada’s largest trading and investment partners, and a significant partner in diplomacy, development, defence cooperation, law enforcement, and intelligence. In 2017, two-way merchandise trade between Canada and the UK totaled more than $26.5&nbsp;billion, making the UK Canada’s fifth-largest merchandise trade partner.</li><li>Commonwealth heads of government meet every two years to review the implementation of previous mandates, and share practical strategies to address global challenges.</li><li>The four pillars of CHOGM 2018 are fairness, sustainability, prosperity, and security, which aim to benefit the more than 2.4&nbsp;billion people that make up the Commonwealth.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/04/04/prime-minister-travel-peru-france-and-united-kingdom\">Prime Minister to Travel to Peru, France, and the U.K.</a></li><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom</a></li><li><a href=\"https://www.chogm2018.org.uk/\">CHOGM London 2018</a></li><li><a href=\"http://thecommonwealth.org/\">The Commonwealth</a></li></ul></div>\n      "
}