{
  "path": "/en/news/news-releases/2021/05/27/prime-minister-announces-nomination-daniel-therrien-reappointment",
  "pageTitle": "Prime Minister announces nomination of Daniel Therrien for reappointment as Privacy Commissioner of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Daniel Therrien for reappointment as Privacy Commissioner of Canada for a one-year term.</p>\n\n<p>Mr. Therrien was appointed Privacy Commissioner of Canada on June 5, 2014, after three decades as a lawyer in the federal government focusing on issues of human rights, public safety, and national security.</p>\n\n<p>The Office of the Privacy Commissioner of Canada (OPC) was established in 1983 following the passage of the <em>Privacy Act</em>, which governs the personal information handling practices of federal departments and agencies. In 2001, the duties of the OPC were extended to include private sector businesses subject to the <em>Personal Information Protection and Electronic Documents Act</em>, Canada’s federal private-sector privacy law.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Over the past seven years, Mr. Therrien has been a champion for Canadians’ privacy rights and has led efforts to protect and promote them. I am confident that he would continue to serve Canadians well in delivering the mandate of the Office of the Privacy Commissioner.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Privacy Commissioner is an independent Agent of Parliament, appointed under the <em>Privacy Act</em> for a term of seven years. The Privacy Commissioner is eligible to be reappointed for further terms not exceeding seven years.</li>\n\t<li>The reappointment is made by the Governor in Council after consultation with the leader of every recognized party in the House of Commons and group in the Senate, and after approval by resolution of both chambers of Parliament.</li>\n\t<li>The Privacy Commissioner’s responsibilities include investigating complaints, conducting audits, and taking legal action when needed; publicly reporting on how public and private sector organizations handle personal information; and supporting research and promoting public awareness and understanding of privacy issues.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/05/27/daniel-therrien\">Daniel Therrien</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/topics/appointments/governor-council.html\">Governor in Council appointments</a></li>\n\t<li><a href=\"https://www.priv.gc.ca/en/\">Office of the Privacy Commissioner of Canada</a></li>\n</ul></div>\n      "
}