{
  "path": "/en/news/news-releases/2022/11/12/prime-ministers-announcements-asean-canada-commemorative-summit",
  "pageTitle": "Prime Minister’s Announcements at the ASEAN-Canada Commemorative Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>On November 12, Prime Minister Justin Trudeau announced the following measures during his speech at the ASEAN-Canada Commemorative Summit:</p>\n\n<h2>Strengthening Canada’s ties with ASEAN</h2>\n\n<p>The partnership between Canada and the Association of Southeast Asian Nations (ASEAN) is rooted in deep people-to-people, trade, and diplomatic ties. Canada is committed to further strengthening this partnership by advancing shared priorities, including peace, security, and stability, sustainable development, trade and investment, and prosperity in the Indo-Pacific.</p>\n\n<h3>ASEAN-Canada Plan of Action Trust Fund Top-Up</h3>\n\n<p><strong>Funding: </strong>$13.1&nbsp;million over five years</p>\n\n<p>Canada will increase cooperation with ASEAN through a contribution to the ASEAN-Canada Plan of Action Trust Fund. This contribution will help close development gaps, ensure strong regional engagement with ASEAN, and advance important trade negotiations, while strengthening our partnership. A part of the fund will support the participation of ASEAN’s Member Countries in negotiations toward a Canada-ASEAN Free Trade Agreement (FTA), which will create good jobs and new opportunities for people and businesses in Canada and in ASEAN Member States, while opening new markets for Canadians. This will support technical assistance and capacity building to enable ASEAN Member States to participate in FTA negotiations.</p>\n\n<h3>Women, Peace, and Security Dialogue Series</h3>\n\n<p>Canada will host a Jakarta-based series of Women, Peace, and Security (WPS) dialogues with ASEAN in 2023, in line with ASEAN’s Regional Plan of Action on Women, Peace, and Security in ASEAN. This builds on Canada’s 2021 flagship initiative “Empowering women for sustainable peace: preventing violence and promoting social cohesion in ASEAN,” which was designed to advance WPS priorities, such as ensuring women can participate equally with men in decision-making, including in matters of peace and security. The dialogue series will engage Canadian civil society and non-governmental organizations, and provide a platform for discussions on the implementation of the WPS agenda in ASEAN and other priorities, such as enhancing the role of women in political leadership. WPS is a shared priority for Canada and ASEAN, and is a core element of Canada’s Feminist Foreign Policy to achieve sustainable global peace, respect human rights and dignity, embrace evidence-based decision-making, and reduce inequality.</p>\n\n<h2>Expanding partnerships in the Indo-Pacific</h2>\n\n<p>As a Pacific nation, Canada is committed to strengthening our relation with the Indo-Pacific, which plays an essential role in our country’s economic growth, prosperity, and security. We will continue to work with our Indo-Pacific partners to make progress on shared priorities and enhance our engagement through Canada’s Indo-Pacific Strategy (IPS), which will be released soon. As announced by the Minister of Foreign Affairs, Mélanie Joly, on November 9, 2022, the IPS will focus on the following objectives:</p>\n\n<ul>\n\t<li>Strengthening Canada’s role as a reliable and engaged partner to the Indo-Pacific;</li>\n\t<li>Ensuring resilience, peace, and security;</li>\n\t<li>Expanding trade, investment, and supply chain resilience;</li>\n\t<li>Investing in and connecting people; and</li>\n\t<li>Building a sustainable and green future.</li>\n</ul>\n\n<h3>The Canadian Trade Gateway in Southeast Asia (IPS)</h3>\n\n<p><strong>Funding:</strong> $24.1&nbsp;million over five years</p>\n\n<p>This initiative will establish an enhanced Canadian hub in Southeast Asia, the Canadian Trade Gateway, to be designed and led by private sector partners. The Gateway will provide a modern, dynamic environment for Canadian business leaders to meet as a community, identify common interests, leverage strengths, and promote greater economic cooperation and innovation in the region. The Gateway will expand Canada’s business and investment networks, linking businesses to existing incubators and accelerators, and increasing their awareness of Indo-Pacific markets. This initiative will focus on sectors and solutions where Canadian innovation responds to regional demand. The Gateway will enhance opportunities for Canadian exporters and attract foreign investment to Canada, which will help diversify trade and create good middle-class jobs for Canadians.</p>\n\n<h3>Feminist International Assistance Policy Development Funding (IPS)</h3>\n\n<p><strong>Funding:</strong> $100&nbsp;million over five years</p>\n\n<p>This initiative will explore various strategies to support development in the Indo-Pacific and support ASEAN centrality for a free, open, and inclusive Indo-Pacific. This might include increasing bilateral international assistance to partner countries; leveraging Canadian expertise, including through the deployment of technical assistance experts; promoting inclusive governance through partnerships between Canadian and local CSOs; supporting regional partners’ resilience to risks associated with disasters; and supporting sustainable and climate resilient infrastructure in the region.</p>\n\n<h3>Shared Ocean Fund (IPS)</h3>\n\n<p><strong>Funding: </strong>$84.3&nbsp;million over five years</p>\n\n<p>A new Shared Ocean Fund will help increase maritime cooperation and create a healthy marine environment in the Indo-Pacific while supporting measures against illegal, unreported, and unregulated (IUU) fishing. Through this initiative, Canada will work to strengthen and enforce the rules-based order in the Indo-Pacific region in order to regulate fisheries and fishing activity, protect fish stocks, advance ecosystem conservation, reduce the use of plastic fish aggregating devices, and put in place strong monitoring, control, and surveillance rules with respect to IUU fishing.</p>\n\n<h3>Indo-Pacific Engagement Initiative (IPS)</h3>\n\n<p><strong>Funding: </strong>$40&nbsp;million over five years</p>\n\n<p>Through the Indo-Pacific Engagement Initiative (IPEI), Canada will provide new program support for the participation of Canadian civil society in the region and greater support for Government of Canada engagement in the Indo-Pacific. As a multi-component initiative, the IPEI will also provide new research and study opportunities for Canadians while supporting Canada’s public service with expanded professional development focussed on the Indo-Pacific. Specifically, funding for the IPEI will go toward:</p>\n\n<ul>\n\t<li>the government’s regional diplomacy and advocacy efforts;</li>\n\t<li>Canadian civil society and private sector engagement in the region;</li>\n\t<li>research to support policy-making;</li>\n\t<li>a new national scholarship and fellowship program; and</li>\n\t<li>a new capacity-building program to build expertise and knowledge on the Indo-Pacific across government.</li>\n</ul>\n\n<h3>Feminist International Assistance Canadian Civil Society Call for Proposals (IPS)</h3>\n\n<p><strong>Funding: </strong>$32.8&nbsp;million over five years</p>\n\n<p>Canada will provide new program support for the regional participation of Canadian civil society organizations (CSOs) with expertise in delivering development assistance in areas such as governance, diversity, and human rights to strengthen civil society, protect human rights, and advance gender equality in the Indo-Pacific. This initiative will help build and strengthen dynamic partnerships between Canadian CSOs and CSOs in the Indo-Pacific while advancing Canadian priorities, including the empowerment of women and girls. It will leverage Canadian expertise in promoting gender equality and ensuring the integration of intersecting identities which impact those most at risk of being left behind, including persons with disabilities, ethnic minority groups, 2SLGBTQI+ people, Indigenous Peoples, and other marginalized groups. In addition to ASEAN Member States, this initiative will also be open to Bangladesh, Sri Lanka, Mongolia, Myanmar, and Pacific Island countries.</p>\n\n<h3>Expansion of the Asia-Pacific Foundation of Canada (IPS)</h3>\n\n<p><strong>Funding:</strong> $24.5&nbsp;million over five years</p>\n\n<p>The Asia-Pacific Foundation of Canada (APFC) will establish a physical presence in the Indo-Pacific region. Reflecting Canada’s long-term commitment to engage and collaborate with partners in the region, this new APFC office will help build and strengthen relations with local partners, including in the areas of foreign policy, cultural diplomacy and academic ties. It will offer a convening working space for Canadians and local partners engaged in APFC-supported programs as well as other government departments engaging in the region.</p>\n\n<h3>Expanded SEED Scholarship (IPS)</h3>\n\n<p><strong>Funding:</strong> $14.2&nbsp;million over five years</p>\n\n<p>The Indo-Pacific region is home for most of Canada’s international students. Canada’s IPS will expand the successful Canada-ASEAN Scholarships and Educational Exchanges for Development (SEED) program, which to date has welcomed 325 ASEAN students to Canada. The enhanced program will allow Canada to reach developing Indo-Pacific countries, to encourage valuable exchanges and skills sharing, and to introduce more education and research in shared areas of interest.</p>\n\n<h3>Canada–Indo-Pacific Symposium: Post-Pandemic Border and Migration Management</h3>\n\n<p><strong>Funding:</strong> $85,000</p>\n\n<p>The Canada Border Services Agency will host a Canada–Indo-Pacific symposium on post-pandemic border and migration management in cooperation with the Cambodian General Department of Customs and Excise, from January 31 to February 2, 2023, in Phnom Penh, Cambodia. The symposium will be an opportunity for Canada to share knowledge and expertise in border management with ASEAN Member States and reinforce partnerships. It will allow Canada to share operational best practices and strategies in the areas of economic recovery and growth post-pandemic, border management and combatting transnational crime, and the protection of women’s rights and vulnerable people.</p></div>\n      "
}