{
  "path": "/en/news/statements/2021/11/11/statement-prime-minister-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Remembrance Day:</p>\n\n<p>“Today, we honour the women and men who served, and continue to serve our country, in times of war, conflict, and peace. We pause to remember their brave sacrifices, and acknowledge a debt we can never repay. We pay tribute to those who have lost their lives, and those who have been physically or mentally scarred by their service, as well as their family members and loved ones.</p>\n\n<p>“More than 2.3 million Canadians have served in uniform since Confederation, and more than 120,000 made the ultimate sacrifice. Thanks to their selflessness, dedication, and bravery, members of our military and police have been defending freedom, peace, and democracy – the values that we cherish deeply within our hearts. Canadians have also participated in international peacekeeping operations, during which approximately 130 gave their lives, and other military missions to protect the rights of others around the world, and our way of life – these heroes embody the very best of what it means to be Canadian.</p>\n\n<p>“This year also marks the 100th anniversary of the Remembrance Poppy in Canada. John McCrae’s poem ‘In Flanders Fields’ had inspired Madame Anna Guérin of France to adopt the distribution of the poppy on the anniversary of the Armistice agreement, which ended the First World War in 1918. This was her way to honour the war dead, and to help raise support funds for those who had been impacted by the conflict. In July&nbsp;1921, the Great War Veterans’ Association – the precursor to the Royal Canadian Legion – adopted the poppy as the flower of Remembrance. One hundred years later, Anna Guérin’s vision lives on – the poppy still honours its pledge as an unmistakable symbol of Remembrance.</p>\n\n<p>“The past year and a half has made life more difficult for many veterans. That is why, last year, the Government of Canada invested $20 million to create the <a href=\"https://www.veterans.gc.ca/eng/financial-support/emergency-funds/emergency-support-organizations\">Veterans Organizations Emergency Support Fund</a>, which helped over 40 organizations across the country support the well-being of veterans and their families during the COVID-19 pandemic.</p>\n\n<p>“As we continue to keep each other and our communities safe from COVID-19, I invite all Canadians to watch the national ceremony at the National War Memorial in Ottawa, which is being livestreamed on <a href=\"https://www.facebook.com/CanadaRemembers\">Facebook</a> today. I also encourage everyone to visit <a href=\"https://www.veterans.gc.ca/eng/remembrance\">online resources</a> to learn about Remembrance Day, stories of our fallen, and all the sacrifices they have made for Canadians and people around the world.</p>\n\n<p>“Today, at the eleventh hour of the eleventh day of the eleventh month, Canadians from coast to coast to coast will observe two minutes of silence to pay tribute to all who have fallen. We will be wearing red poppies close to our hearts, solemnly reflecting, and thinking about those who served so courageously to keep us safe, and gave their lives in service of a better Canada – they have our respect, thanks, and heartfelt gratitude.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}