{
  "path": "/en/news/statements/2023/02/15/statement-prime-minister-national-flag-canada-day",
  "pageTitle": "Statement by the Prime Minister on National Flag of Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Flag of Canada Day:</p>\n\n<p>“Today, I join Canadians across the country and around the world to celebrate the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-flag-canada-day.html\">National Flag of Canada</a>. On this day in 1965, one of our country’s most well-known symbols – the maple leaf – was raised on Parliament Hill for the first time.</p>\n\n<p>“The flag has since been launched into space and brought to the highest point on earth. For 58 years, it has flown at ports, airports, schools, and libraries across the country and at Canada’s diplomatic missions around the world. Wherever it flies, the Maple Leaf Flag stands for the values we embody as Canadians: peace, freedom, openness, generosity, and diversity.</p>\n\n<p>“The maple tree, with its vibrant autumn colours, is a prominent feature of the landscape in many parts of Canada. Long before the arrival of settlers, many First Nations used the maple tree for its sweet sap and its versatile wood. Over the years, the maple leaf became a symbol of Canada and in the 19th century, it became synonymous with Canadian identity. Whether depicted in books or songs, or carved on the headstones of the Canadian service men and women who gave their lives for their country, the maple leaf is a powerful symbol that unites us.</p>\n\n<p>“On this National Flag of Canada Day, we celebrate the promise the Maple Leaf Flag stands for: that as a people, Canadians strive for peace, unity that respects our diversity, and a better world where no one is left behind.”</p></div>\n      "
}