{
  "path": "/en/news/statements/2020/06/30/statement-deputy-prime-minister-entry-force-new-nafta",
  "pageTitle": "Statement by the Deputy Prime Minister on the entry-into-force of the new NAFTA | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Deputy Prime Minister, Chrystia Freeland, today issued the following statement on the entry-into-force of the new NAFTA:</p>\n\n<p>“On behalf of the Government of Canada, I welcome the entry-into-force of the new NAFTA on July 1. This agreement, the result of extensive negotiations over the past three and a half years, is an essential pillar in preserving free and fair trade in North America.</p>\n\n<p>“The new NAFTA protects jobs and prosperity for workers in all three NAFTA countries. It is good for Canada and good for Canadian workers. It will help ensure that North America emerges stronger from the COVID-19 pandemic.</p>\n\n<p>“To Canadians from across the country and all sectors of the economy and society who provided valuable input in the negotiations: thank you. This accomplishment belongs to all Canadians.</p>\n\n<p>“Our government is committed to working with our NAFTA partners to ensure this new agreement becomes a success for all three countries.”</p>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new NAFTA preserves the important benefits of NAFTA, modernizes the agreement, and makes it easier for Canadian companies to benefit from preferential access to the U.S and Mexican markets.</li>\n\t<li>In particular, the new agreement:\n\t<ul>\n\t\t<li>safeguards more than $2-billion a day in cross-border trade and tariff-free access for 99.9 per cent of Canada’s U.S.-bound exports. It will preserve tariff-free access to our largest trading partner, supporting hundreds of thousands of Canadian jobs, now and into the future.</li>\n\t\t<li>preserves crucial cross-border auto supply chains, and provides an incentive to produce vehicles in Canada.</li>\n\t\t<li>retains and strengthens fair and impartial dispute settlement process for trade remedies that forestry workers have long relied on to protect their livelihoods from unjust trade actions.</li>\n\t\t<li>preserves NAFTA’s cultural exception, which helps safeguard more than 650,000 jobs in cultural industries.</li>\n\t\t<li>contains ambitious and enforceable labour obligations to protect workers from discrimination in the workplace, in particular on the basis of gender. The enforceable labour chapter levels the playing field for Canadian workers.</li>\n\t\t<li>enshrines enforceable standards for clean air and marine pollution through a strengthened environment chapter.</li>\n\t\t<li>removes the investor-state dispute resolution system, which has allowed large corporations to sue the Canadian government for regulating in the public interest. Known as ISDS, this has cost Canadian taxpayers more than $275 million in penalties and legal fees.</li>\n\t\t<li>eliminates a proportionality clause that raised concerns for some Canadians regarding energy sovereignty and security. This&nbsp;provides additional security for Canada’s resource producers and workers that decisions on the future of their sector will be made by Canadians.</li>\n\t</ul>\n\t</li>\n</ul></div>\n      "
}