{
  "path": "/en/news/statements/2021/06/20/statement-prime-minister-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/refugee-day\">World Refugee Day</a>, we join the international community to recognize all those who have been forced to flee their homelands. We honour their strength and courage, acknowledge the profound hardships they have endured, and reaffirm our commitment to protect and support them.</p>\n\n<p>“In their search for a safe place to call home, refugees and other forcibly displaced people face immense loss, barriers, and trauma. While trying to rebuild their lives, they often suffer hunger, despair, and uncertainty. Many struggle to find a doctor when they are sick, a school for their children, or a space for them to play, make friends, and feel like they belong.</p>\n\n<p>“This year’s theme, ‘Together we heal, learn and shine,’ calls on us all to renew our support for refugees by improving their access to quality health care and education. Echoing the Global Compact on Refugees, this year’s theme also reminds us of the importance of inclusion, and ensuring that all people, including refugees from diverse backgrounds, have access to the spaces they need to learn and thrive. Canada recognizes the importance of inclusion and diversity, and has a long-standing tradition of promoting these values through our international assistance, resettlement, and integration efforts.</p>\n\n<p>“Canada has a proud humanitarian tradition of protecting the world’s most vulnerable people and, today, we continue to open our borders and our hearts to those seeking safety and refuge from persecution and violence. In 2019, Canada resettled more than 30,000 refugees and was the world’s top refugee resettlement country for the second year in a row. Last year, despite challenges and travel restrictions related to COVID-19, Canada resettled over 9,200 refugees from coast to coast to coast. This year, we will launch a dedicated refugee stream for human rights defenders at risk, which will enable Canada to become one of the first countries to offer dedicated protection spaces to this population of refugees. As announced earlier this year, to better support family reunification, we will also be resettling up to 250 extended family members of survivors of Daesh currently in Canada.</p>\n\n<p>“Guided by the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, we continue to place emphasis on the needs of women and girls, and to put forward concrete and timely initiatives to promote human rights, gender equality, dignity, and peace and security. In this spirit, Canada looks forward to becoming Chair of the Central America and Mexico Comprehensive Regional Protection and Solutions Framework (MIRPS) Support Platform next month. In that role, we will continue to champion the protection and meaningful participation of displaced women and girls on the international stage. We will also continue to work with the international community and the United Nations to provide international protection and assistance to refugees, and find lasting and dignified solutions for them and other forcibly displaced peoples.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me to commemorate World Refugee Day, and take time to reflect on the contributions refugees have made to Canada. Let us celebrate what we can accomplish as individuals, as communities, and as a country when we value compassion, openness, and diversity. Let these values motivate us to help those most vulnerable among us reach their true potential.”</p></div>\n      "
}