{
  "path": "/en/news/readouts/2020/03/23/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the&nbsp;Prime Minister of Ethiopia, Abiy Ahmed,&nbsp;to discuss COVID-19.</p>\n\n<p>Prime Minister Trudeau expressed solidarity with Prime Minister Abiy and all Ethiopians as they take the necessary measures to contain COVID‑19 and respond to its health, social, and economic impacts. &nbsp;Prime Minister Abiy also conveyed his best wishes to Sophie Gregoire Trudeau for a speedy recovery.</p>\n\n<p>The two leaders exchanged views on the strong measures being taken by Canada and Ethiopia to protect health and safety, and to address economic challenges in their respective countries. They spoke about the need for early and aggressive action domestically and for international coordination to change the trajectory of the disease in Sub-Saharan Africa. They also agreed on the importance of reinforcing health, financial, and economic systems in the region.</p>\n\n<p>The Prime Minister offered Canada’s support through advice and<strong> </strong>international assistance to help vulnerable countries respond to COVID-19’s devastating impacts.</p>\n\n<p>This call builds upon the strong relationship between Canada and Ethiopia, recently strengthened through Prime Minister Trudeau’s successful visit to Ethiopia and participation in the African Union Summit in February.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada – Ethiopia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul></div>\n      "
}