{
  "path": "/en/news/news-releases/2021/06/10/prime-minister-announces-reappointments-commissioner-northwest",
  "pageTitle": "Prime Minister announces the reappointments of the Commissioner of the Northwest Territories and the Administrator of Yukon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the reappointments of Margaret M. Thom as Commissioner of the Northwest Territories and Adeline Webber as Administrator of Yukon.</p>\n\n<p>Ms. Thom was first appointed as Commissioner of the Northwest Territories on June 14, 2017. She had previously served as Deputy Commissioner from June 2005 until October 2011. As a respected educator, councillor, facilitator, and volunteer, she dedicated her career to serving the people of the Northwest Territories, including as a Governor of the Aurora College board and Vice-Chair of the Nats’ejee Keh Treatment Centre. Ms. Thom’s reappointment is effective June 26, 2021, for a one-year term.</p>\n\n<p>Ms. Webber became Administrator of Yukon on March 9, 2018, after having spent most of her career in the federal public service, including as the Yukon District Director for the Public Service Commission of Canada. A proud member of the Teslin Tlingit Council, she has long been a champion of Yukoners and Indigenous peoples, and is dedicated to advancing gender equality, and implementing land claims and self-government agreements. Ms.&nbsp;Webber’s reappointment is effective today, for a three-year term.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Margaret M. Thom has represented the people of the Northwest Territories with pride and dedication over the past four years. I am pleased that she will continue as Commissioner for another year, and I know that her remarkable knowledge, experience, and service will continue to be a great benefit to the Northwest Territories and to our country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Adeline Webber has led an exceptional career in service of Yukoners. Her dedication to diversity and Indigenous rights has made her an important voice for her communities, and I am confident that her unique perspective, experience, and knowledge will serve her well as she continues in her role as Administrator of Yukon.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Territorial Commissioners and Administrators are&nbsp;Governor in Council&nbsp;appointments.</li>\n\t<li>Territorial Commissioners fulfill many of the same duties as the Lieutenant Governor of a province. Their responsibilities include swearing in Members of the Legislative Assembly and Members of the Executive Council, opening the Legislative Assembly, and providing assent for legislation passed by the Assembly.</li>\n\t<li>The Administrator of Yukon acts in the place of the Commissioner if the Commissioner is unable to fulfill his or her duties during an absence or illness or other situation, or when the office is vacant.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/10/margaret-m-thom\">Margaret M. Thom</a></li>\n\t<li><a href=\"/en/news/backgrounders/2021/06/10/adeline-webber\">Adeline Webber</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ntassembly.ca/about/commissioner-nwt\">Commissioner of the Northwest Territories</a></li>\n\t<li><a href=\"https://commissionerofyukon.ca/\">Commissioner of Yukon</a></li>\n</ul></div>\n      "
}