{
  "path": "/en/news/statements/2022/06/29/madrid-summit-declaration",
  "pageTitle": "Madrid Summit Declaration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Heads of State and Government of the North Atlantic Alliance, have gathered in Madrid as war has returned to the European continent.&nbsp; We face a critical time for our security and international peace and stability.&nbsp; We stand together in unity and solidarity and reaffirm the enduring transatlantic bond between our nations.&nbsp; NATO is a defensive Alliance and poses no threat to any country.&nbsp; NATO remains the foundation of our collective defence and the essential forum for security consultations and decisions among Allies.&nbsp; Our commitment to the Washington Treaty, including Article 5, is iron-clad.&nbsp; In this radically changed security environment, this Summit marks a milestone in strengthening our Alliance and accelerating its adaptation.</p>\n\n<p>We are united in our commitment to democracy, individual liberty, human rights, and the rule of law.&nbsp; We adhere to international law and to the purposes and principles of the Charter of the United Nations.&nbsp; We are committed to upholding the rules-based international order.</p>\n\n<p>We condemn Russia’s war of aggression against Ukraine in the strongest possible terms.&nbsp; It gravely undermines international security and stability.&nbsp; It is a blatant violation of international law.&nbsp; Russia’s appalling cruelty has caused immense human suffering and massive displacements, disproportionately affecting women and children.&nbsp; Russia bears full responsibility for this humanitarian catastrophe.&nbsp; Russia must enable safe, unhindered, and sustained humanitarian access.&nbsp; Allies are working with relevant stakeholders in the international community to hold accountable all those responsible for war crimes, including conflict-related sexual violence.&nbsp; Russia has also intentionally exacerbated a food and energy crisis, affecting billions of people around the world, including through its military actions.&nbsp; Allies are working closely to support international efforts to enable exports of Ukrainian grain and to alleviate the global food crisis.&nbsp; We will continue to counter Russia’s lies and reject its irresponsible rhetoric.&nbsp; Russia must immediately stop this war and withdraw from Ukraine.&nbsp; Belarus must end its complicity in this war.</p>\n\n<p>We warmly welcome President Zelenskyy’s participation in this Summit.&nbsp; We stand in full solidarity with the government and the people of Ukraine in the heroic defence of their country.&nbsp; We reiterate our unwavering support for Ukraine’s independence, sovereignty, and territorial integrity within its internationally recognised borders extending to its territorial waters.&nbsp; We fully support Ukraine’s inherent right to self-defence and to choose its own security arrangements.&nbsp; We welcome efforts of all Allies engaged in providing support to Ukraine.&nbsp; We will assist them adequately, recognising their specific situation.</p>\n\n<p>We continue to face distinct threats from all strategic directions.&nbsp; The Russian Federation is the most significant and direct threat to Allies’ security and to peace and stability in the Euro-Atlantic area.&nbsp; Terrorism, in all its forms and manifestations, continues to pose a direct threat to the security of our populations, and to international stability and prosperity.&nbsp; We categorically reject and condemn terrorism in the strongest possible terms.&nbsp; With determination, resolve, and in solidarity, Allies will continue to counter Russian threats and respond to its hostile actions and to fight terrorism, in a manner consistent with international law.</p>\n\n<p>We are confronted by cyber, space, and hybrid and other asymmetric threats, and by the malicious use of emerging and disruptive technologies.&nbsp; We face systemic competition from those, including the People’s Republic of China, who challenge our interests, security, and values and seek to undermine the rules-based international order.&nbsp; Instability beyond our borders is also contributing to irregular migration and human trafficking.</p>\n\n<p>Against this backdrop, we have taken the following decisions:</p>\n\n<p>We have endorsed a new Strategic Concept.&nbsp; It describes the security environment facing the Alliance, reaffirms our values, and spells out NATO’s key purpose and greatest responsibility of ensuring our collective defence based on a 360-degree approach.&nbsp; It further sets out NATO’s three core tasks of deterrence and defence; crisis prevention and management; and cooperative security.&nbsp; In the years to come, it will guide our work in the spirit of our transatlantic solidarity.</p>\n\n<p>We will continue and further step up political and practical support to our close partner Ukraine as it continues to defend its sovereignty and territorial integrity against Russian aggression.&nbsp; Jointly with Ukraine, we have decided on a strengthened package of support.&nbsp; This will accelerate the delivery of non-lethal defence equipment, improve Ukraine’s cyber defences and resilience, and support modernising its defence sector in its transition to strengthen long-term interoperability.&nbsp; In the longer term, we will assist Ukraine, and support efforts on its path of post-war reconstruction and reforms.</p>\n\n<p>We have set a new baseline for our deterrence and defence posture.&nbsp; NATO will continue to protect our populations and defend every inch of Allied territory at all times.&nbsp; We will build on our newly enhanced posture, and significantly strengthen our deterrence and defence for the long term to ensure the security and defence of all Allies.&nbsp; We will do so in line with our 360-degree approach, across the land, air, maritime, cyber, and space domains, and against all threats and challenges.&nbsp; NATO’s role in the fight against terrorism is an integral part of this approach.&nbsp; Allies have committed to deploy additional robust in-place combat-ready forces on our eastern flank, to be scaled up from the existing battlegroups to brigade-size units where and when required, underpinned by credible rapidly available reinforcements, prepositioned equipment, and enhanced command and control.&nbsp; We welcome the cooperation between Framework Nations and Host Nations in strengthening forces and command and control, including in establishing division-level structures.&nbsp; We welcome the initial offers by Allies to NATO’s new force model, which will strengthen and modernise the NATO Force Structure and will resource our new generation of military plans.&nbsp; We will enhance our collective defence exercises to be prepared for high intensity and multi-domain operations and ensure reinforcement of any Ally on short notice.&nbsp; All these steps will substantially strengthen NATO’s deterrence and forward defences.&nbsp; This will help to prevent any aggression against NATO territory by denying any potential adversary success in meeting its objectives.</p>\n\n<p>Resilience is a national responsibility and a collective commitment.&nbsp; We are enhancing our resilience, including through nationally-developed goals and implementation plans, guided by objectives developed by Allies together.&nbsp; We are also strengthening our energy security.&nbsp; We will ensure reliable energy supplies to our military forces.&nbsp; We will accelerate our adaptation in all domains, boosting our resilience to cyber and hybrid threats, and strengthening our interoperability.&nbsp; We will employ our political and military instruments in an integrated manner.&nbsp; We have endorsed a new chemical, biological, radiological and nuclear defence policy. We will significantly strengthen our cyber defences through enhanced civil-military cooperation.&nbsp; We will also expand partnership with industry.&nbsp; Allies have decided, on a voluntary basis and using national assets, to build and exercise a virtual rapid response cyber capability to respond to significant malicious cyber activities.</p>\n\n<p>We are establishing a Defence Innovation Accelerator and launching a multinational Innovation Fund to bring together governments, the private sector, and academia to bolster our technological edge.&nbsp; We have endorsed a strategy which will ensure the seamless delivery of the next generation Airborne Warning &amp; Control System (AWACS) and related capabilities.</p>\n\n<p>Climate change is a defining challenge of our time with a profound impact on Allied security.&nbsp; It is a threat multiplier.&nbsp; We have decided on a goal to significantly cut greenhouse gas emissions by the NATO political and military structures and facilities, while maintaining operational, military and cost effectiveness.&nbsp; We will integrate climate change considerations across all of NATO’s core tasks.</p>\n\n<p>We emphasise the centrality of human security and are ensuring that human security principles are integrated into our three core tasks.&nbsp; We are advancing a robust Women, Peace and Security agenda, and are incorporating gender perspectives across NATO.</p>\n\n<p>We have met here in Madrid with many of NATO’s partners.&nbsp; We had valuable exchanges with the Heads of State and Government of Australia, Finland, Georgia, Japan, the Republic of Korea, New Zealand, Sweden, and Ukraine, as well as the President of the European Council and the President of the European Commission.&nbsp; We welcomed the engagements with the Foreign Ministers of Jordan and Mauritania, as well as the Defence Minister of Bosnia and Herzegovina.</p>\n\n<p>Taking into account our unprecedented level of cooperation with the European Union, we will continue to further strengthen our strategic partnership in a spirit of full mutual openness, transparency, complementarity, and respect for the organisations’ different mandates, decision-making autonomy and institutional integrity, and as agreed by the two organisations.&nbsp; Our common resolve in responding to Russia’s war against Ukraine highlights the strength of this unique and essential partnership.&nbsp; The participation of our partners from the Asia-Pacific region, alongside other partners, demonstrated the value of our cooperation in tackling shared security challenges.</p>\n\n<p>We will further enhance our partnerships so that they continue to meet the interests of both Allies and partners.&nbsp; We will discuss common approaches to global security challenges where NATO’s interests are affected, share perspectives through deeper political engagement, and seek concrete areas for cooperation to address shared security concerns.&nbsp; We will now move ahead with strengthening our engagement with existing and potential new interlocutors beyond the Euro-Atlantic area.</p>\n\n<p>In light of the changed security environment in Europe, we have decided on new measures to step up tailored political and practical support to partners, including Bosnia and Herzegovina, Georgia, and the Republic of Moldova.&nbsp; We will work with them to build their integrity and resilience, develop capabilities, and uphold their political independence.&nbsp; We will also enhance our capacity-building support to partners from the South.</p>\n\n<p>We reaffirm our commitment to NATO’s Open Door Policy.&nbsp; Today, we have decided to invite Finland and Sweden to become members of NATO, and agreed to sign the Accession Protocols.&nbsp; In any accession to the Alliance, it is of vital importance that the legitimate security concerns of all Allies are properly addressed.&nbsp; We welcome the conclusion of the trilateral memorandum between Türkiye, Finland, and Sweden to that effect.&nbsp; The accession of Finland and Sweden will make them safer, NATO stronger, and the Euro-Atlantic area more secure.&nbsp; The security of Finland and Sweden is of direct importance to the Alliance, including during the accession process.</p>\n\n<p>We welcome the considerable progress on Allied defence spending since 2014.&nbsp; In line with our commitment in Article 3 of the Washington Treaty, we will further strengthen our individual and collective capacity to resist all forms of attack.&nbsp; We reaffirm our commitment to the Defence Investment Pledge in its entirety.&nbsp; We will build on that pledge and decide next year on subsequent commitments beyond 2024.&nbsp; We will ensure that our political decisions are adequately resourced.&nbsp; We will build on the progress made to ensure that increased national defence expenditures and NATO common funding will be commensurate with the challenges of a more contested security order. Investing in our defence and key capabilities is essential.</p>\n\n<p>We pay tribute to all women and men who continue to serve daily for our collective security, and honour all those who have sacrificed to keep us safe.</p>\n\n<p>We express our appreciation for the generous hospitality extended to us by the Kingdom of Spain, on the 40th anniversary of its accession to NATO.&nbsp; We look forward to meeting again, in Vilnius, in 2023.</p>\n\n<p>With our decisions today, we have firmly set the direction for the Alliance’s continued adaptation.&nbsp; NATO remains the strongest Alliance in history.&nbsp; Through our bond and our mutual commitment, we will continue to safeguard the freedom and security of all Allies, as well as our shared democratic values, now and for future generations.</p></div>\n      "
}