{
  "path": "/en/news/statements/2021/11/27/statement-prime-minister-holodomor-memorial-day",
  "pageTitle": "Statement by the Prime Minister on Holodomor Memorial Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Holodomor Memorial Day:</p>\n\n<p>“Today, we join Ukrainian communities in Canada and around the world to remember the millions of innocent victims who suffered or lost their lives during the Holodomor.</p>\n\n<p>“In 1932 and 1933, the Soviet regime of Joseph Stalin orchestrated a deliberate famine – a genocide against the Ukrainian people – to impose total control over Ukraine, destroy the will of the people, and erase their identity. During this horrific campaign, millions died from starvation, including children, and countless others were either deported, imprisoned, or executed.</p>\n\n<p>“Despite the brutality of the Holodomor, Ukrainians persevered. The resilience of the Ukrainian people and the survival of their culture, language, and identity is a testament to their courage and strength. After decades of Soviet control and oppression, Ukraine regained its independence in 1991.</p>\n\n<p>“For far too long, the atrocities of the Holodomor were hidden from the world and outright denied. Today, it falls to each and every one of us to ensure this dark chapter in history is not forgotten, and to continue to defend human rights and democracy when they come under threat.</p>\n\n<p>“On this solemn day, I encourage all Canadians to honour the victims of the Holodomor, and to reflect on the vast contributions Ukrainian Canadians have made – and continue to make – to shape a stronger country for all of us. I also reaffirm Canada’s steadfast commitment to support Ukraine’s sovereignty, security, and territorial integrity.</p>\n\n<p>“Vichna Yim Pamyat.”</p></div>\n      "
}