{
  "path": "/en/news/readouts/2022/11/09/prime-minister-justin-trudeau-convenes-third-meeting-incident-response",
  "pageTitle": "Prime Minister Justin Trudeau convenes a third meeting of the Incident Response Group to discuss the situation in Haiti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group with ministers and senior officials to discuss the evolving situation in Haiti. They were joined by the Ambassador and Permanent Representative of Canada to the United Nations in New York, Bob Rae, the Ambassador of Canada to the United States of America, Kirsten Hillman, and the Ambassador of Canada to Haiti, Sébastien Carrière.</p>\n\n<p>The group was briefed on the security and humanitarian situation in Haiti, which remains volatile following weeks of blockades and gang control over key installations and sites in Port-au-Prince. This has exacerbated a humanitarian crisis by limiting the flow of fuel, food, water, medicine, and other essential goods.</p>\n\n<p>The group was briefed on the improved situation in recent days, as the Haitian National Police have made progress against blockades, and political dialogue amongst Haiti’s political actors has resumed.</p>\n\n<p>The group discussed further assistance to&nbsp;the people of Haiti in this difficult time, including through coordination with the Caribbean Community (CARICOM), the United Nations, the United States of America, civil society organizations, and other partners.</p>\n\n<p>Prime Minister Trudeau directed officials to engage with international partners and explore efforts to facilitate access for the delivery of humanitarian assistance to those affected, solicit contributions for Haiti, and hold those responsible for the unrest to account through sanctions. The Prime Minister highlighted the need to support a Haitian-led solution to the current situation.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/03/prime-minister-justin-trudeau-convenes-second-meeting-incident-response\">Prime Minister Justin Trudeau convenes a second meeting of the Incident Response Group to discuss the situation in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-conducts-assessment-mission-in-haiti.html\">Canada conducts assessment mission in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-and-united-states-coordinate-delivery-of-haitian-national-police-equipment.html\">Canada and United States coordinate delivery of Haitian National Police equipment</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/20/prime-minister-justin-trudeau-speaks-members-caribbean-community-caricom\">Prime Minister Justin Trudeau speaks with members of the Caribbean Community (CARICOM)</a></li>\n</ul></div>\n      "
}