{
  "path": "/en/news/statements/2017/04/14/statement-prime-minister-canada-easter",
  "pageTitle": "Statement by the Prime Minister of Canada on Easter | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on Easter:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This weekend, millions of Canadians and people around the world will gather with friends and family to celebrate the Easter holiday. </span><span lang=\"EN-US\" xml:lang=\"EN-US\">This year is special, as Christians in both the Eastern and Western churches are celebrating Easter on the same day.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Easter, also known as Pascha, is a sacred time of year in the Christian tradition, and celebrates Jesus Christ’s resurrection and triumph over death. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Easter story reminds us of the sacrifices made for us, and of the forgiving power of compassion. It is also a call to hope, especially when hope feels most impossible.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, as we celebrate the 150<sup>th</sup> anniversary of Confederation, let us take the opportunity to honour the many cultures, traditions, and beliefs that make Canada such a wonderful place to live. Christian Canadians of all backgrounds help make Canada the strong, diverse, and inclusive country it is today.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“As we gather with those most important to us, let us </span><span lang=\"EN\" xml:lang=\"EN\">put into practice what it truly means to love our neighbours as ourselves</span><span lang=\"EN-US\" xml:lang=\"EN-US\">, and do what we can to make the world a more just, compassionate, and peaceful place for all.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of our family, Sophie and I wish all those celebrating a blessed and joyful Easter. We hope all Canadians, no matter their faith, find this a time of renewal and promise.”</span></p></div>\n      "
}