{
  "path": "/en/news/readouts/2017/10/03/first-ministers-meet-discuss-shared-priorities-canadians",
  "pageTitle": "First Ministers meet to discuss shared priorities for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today hosted a First Ministers’ Meeting with provincial and territorial Premiers.&nbsp;</p><p>First Ministers took stock of the economy and discussed measures to grow the economy and create well-paying jobs for the middle class and those working hard to join it. The discussion was informed by presentations by the Governor of the Bank of Canada, Stephen S. Poloz, and the Government of Canada’s Chief Statistician, Anil Anora, who gave updates to First Ministers on trends in the Canadian economy. The Prime Minister and Premiers emphasized their shared objective of promoting jobs and growth for Canadians and had a collaborative discussion on trade promotion and investment, interprovincial trade, innovation, supporting skills and labour market development, and increasing access to data and evidence-based decision making. &nbsp;Canada’s Finance Minister, the Honourable Bill Morneau, also spoke to Premiers about the Government’s plan to change a tax system where wealthy and high-income individuals can use their corporations to pay lower rates of taxation than hard-working middle class Canadians. Minister Morneau also noted that the Government has conducted consultations to listen to small business owners, professionals and experts to ensure a fair approach.</p><p>The Prime Minister and Premiers also had a discussion on Canada-U.S. relations, including the modernization of the North American Free Trade Agreement (NAFTA). Canada’s Minister of Foreign Affairs, the Honourable Chrystia Freeland, and Canada’s Ambassador to the United States, David MacNaughton, provided an update to First Ministers on the state of the trade negotiations and the Government of Canada’s collaboration with provinces and territories on broader issues concerning Canada-U.S. relations. The Prime Minister thanked the Premiers for their work on ensuring a coordinated approach to Canada-U.S. relations. First Ministers agreed to continue to work together to ensure that the message about the value of NAFTA and the trade relationship with Canada is understood by key U.S. decision makers.</p><p>First Ministers also discussed the federal government’s commitment to legalize and regulate access to cannabis, recognizing the federal government’s plan to implement these changes by July 2018. Bill Blair, Parliamentary Secretary to the Minister of Justice and Attorney General of Canada and to the Minister of Health, provided an update to Premiers on the federal government’s collaboration with provinces and territories to legalize, strictly regulate, and restrict access to cannabis.</p><p>Prior to the First Ministers’ Meeting, the Prime Minister met with national Indigenous leaders and Premiers to discuss the inclusion of Indigenous Peoples in an economic growth agenda.</p><p>This was the fourth First Ministers’ Meeting hosted by Prime Minister Justin Trudeau, which reflects the federal government’s collaborative approach to intergovernmental relations.</p></div>\n      "
}