{
  "path": "/en/news/news-releases/2020/10/23/prime-minister-announces-funding-advance-development-canadian-covid",
  "pageTitle": "Prime Minister announces funding to advance the development of Canadian COVID‑19 vaccine technologies | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we continue to address the health, social, and economic impacts of COVID-19, the Government of Canada is actively pursuing the purchase and development of vaccines, treatments, and related supplies to protect Canadians from the virus and support our recovery from the pandemic. This includes investing in Canadian projects, and strengthening our country’s biomanufacturing sector and capabilities to fight future pandemics through leading-edge vaccine technology.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of up to $173 million through the Strategic Innovation Fund (SIF) in Quebec City-based Medicago to support Canada’s response to COVID-19 and future preparedness. The project, valued at a total of $428 million, will advance Medicago’s virus-like particle vaccine, developed on the company’s unique plant-based production platform, through clinical trials. It will also establish a large-scale vaccine and antibody production facility to increase Canada’s domestic biomanufacturing capacity.</p>\n\n<p>The government has signed an agreement with Medicago to secure up to 76 million doses of their COVID-19 vaccine candidate, enough to vaccinate 38 million people. This is the first domestically developed vaccine candidate the Government of Canada has secured.</p>\n\n<p>The government will also invest up to $18.2 million in Vancouver-based biotechnology company Precision NanoSystems Incorporated (PNI) through the SIF. This investment will support a $24.27-million project to help advance the development of a COVID-19 vaccine candidate through pre-clinical studies and clinical trials. The government is also providing up to $23.2 million in funding through the National Research Council of Canada Industrial Research Assistance Program to advance six COVID-19 vaccine candidates in various stages of clinical trials.</p>\n\n<p>The Government of Canada has now signed agreements with Medicago, AstraZeneca, Sanofi and GlaxoSmithKline, Johnson &amp; Johnson, Novavax, Pfizer, and Moderna. Agreements signed to date will secure access to up to 358 million doses of their different COVID-19 vaccine candidates. At this time, there are three vaccine candidates currently under review and many others in clinical trials and in development.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is a testament to Canada’s commitment to evidence-based solutions to fight the global COVID-19 pandemic. As we continue to safely restart our economy, we will do whatever it takes to protect Canadians from COVID-19 and build a country that is healthier and safer for everyone. This is why we are supporting our biomanufacturing sector, through companies like Medicago and Precision NanoSystems, to develop a reliable, made-in-Canada vaccine.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Access to safe and effective vaccines is critical for Canada, and the government is doing its part to help support innovative Canadian companies in performing the research needed to demonstrate that their products meet Health Canada’s high safety, efficacy and quality standards.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is continuing to manage the impacts of the pandemic, while preparing for future waves. Today’s investment is helping Canadian companies PNI and Medicago advance Made-in-Canada vaccine candidates recommended by the COVID-19 Vaccine Task Force, and supporting the researchers and companies that are helping in the fight against this pandemic. This is all part of our government’s continued commitment to protect the health and safety of all Canadians.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“This agreement between the Government of Canada and Medicago ensures that Canadians will have access to another promising COVID-19 vaccine candidate. Medicago is working diligently right here in Canada to support the response to COVID-19 and protect the health and safety of Canadians.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In April, the Government of Canada announced more than $1 billion in support of the Plan to Mobilize Science to fight COVID-19, which includes vaccine development, treatment production, and virus tracking. It includes $600 million through the SIF to support COVID-19 vaccine and therapy clinical trials led by the private sector as well as Canadian biomanufacturing opportunities.</li>\n\t<li>In addition, the Government of Canada has allocated approximately $1 billion to secure access to vaccine candidates.</li>\n\t<li>The Government of Canada has signed agreements with the following companies to secure access to their COVID-19 vaccine candidates:\n\t<ul>\n\t\t<li>Medicago, which will supply up to 76 million doses of its virus-like particle vaccine candidate</li>\n\t\t<li>AstraZeneca, which will supply up to 20 million doses of its viral vector vaccine candidate AZD1222</li>\n\t\t<li>Sanofi and GlaxoSmithKline, which will supply up to 72 million doses of their protein subunit vaccine candidate</li>\n\t\t<li>Johnson &amp; Johnson, which will supply up to 38 million doses of its viral vector vaccine candidate Ad26.COV2.S</li>\n\t\t<li>Novavax, which will supply up to 76 million doses of its protein subunit vaccine candidate NVX-CoV2373</li>\n\t\t<li>Pfizer, which will supply a minimum of 20 million doses of its messenger RNA (mRNA) vaccine candidate, BNT162. The government is in the final stages of negotiation with the company to include options for obtaining additional doses.</li>\n\t\t<li>Moderna, which will supply up to 56 million doses of its mRNA vaccine candidate mRNA-1273</li>\n\t</ul>\n\t</li>\n\t<li>At this time, there are no vaccines authorized for the prevention of COVID-19. All vaccine candidates must go through pre-clinical and clinical trials. Health Canada will continue to review evidence of safety, efficacy, and manufacturing quality for each vaccine candidate as it becomes available to decide whether the product will be approved for use in Canada.</li>\n\t<li>Full payments to drug companies are contingent on the vaccines passing clinical trials and obtaining regulatory approval. All contracts the Government of Canada signs with vaccine developers contain off-ramps and exit provisions, should they be required.</li>\n\t<li>The SIF contributions to Medicago and PNI announced today will help create and maintain approximately 440 full-time jobs.</li>\n\t<li>The Plan to Mobilize Science also includes support for the Emerging Infectious Diseases Modelling initiative, which will strengthen the Government of Canada’s ability to manage pandemic threats. The initiative leverages the wealth of multi-disciplinary expertise within academic institutions to build capacity and improve the coordination of the infectious diseases modelling community across Canada.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en/corporate/covid-19-vaccine-task-force\">COVID-19 Vaccine Task Force</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en/support-technology-innovation\">National Research Council of Canada Industrial Research Assistance Program</a></li>\n\t<li><a href=\"https://www.medicago.com/en/\">Medicago</a></li>\n\t<li><a href=\"https://www.precisionnanosystems.com/\">Precision NanoSystems Inc.</a></li>\n\t<li><a href=\"https://www.astrazeneca.com/\">AstraZeneca</a></li>\n\t<li><a href=\"https://www.sanofi.com/\">Sanofi</a></li>\n\t<li><a href=\"https://www.gsk.com/en-gb/\">GlaxoSmithKline</a></li>\n\t<li><a href=\"https://www.jnj.com/\">Johnson &amp; Johnson</a></li>\n\t<li><a href=\"https://novavax.com/\">Novavax</a></li>\n\t<li><a href=\"https://www.pfizer.com/\">Pfizer</a></li>\n\t<li><a href=\"https://www.modernatx.com/\">Moderna</a></li>\n\t<li><a href=\"http://www.nserc-crsng.gc.ca/Media-Media/NewsDetail-DetailNouvelles_eng.asp?ID=1189\">Emerging Infectious Diseases Modelling initiative </a>&nbsp;</li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert.html\">Download COVID Alert</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/digital-tools-staying-healthy.html\">COVID-19: Digital tools and apps for staying healthy</a></li>\n</ul></div>\n      "
}