{
  "path": "/en/news/statements/2018/09/06/joint-statement-leaders-france-germany-united-states-canada-and-united",
  "pageTitle": "Joint Statement by the Leaders of France, Germany, the United States, Canada and the United Kingdom on the Salisbury Attack | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A joint statement by the leaders of France, Germany, the United States, Canada and the United Kingdom on the Salisbury attack:</p><p>“We, the leaders of France, Germany, the United States, Canada and the United Kingdom (UK), reiterate our outrage at the use of a chemical nerve agent, known as Novichok, in Salisbury on March 4, 2018. We welcome the progress made in the investigation into the poisoning of Sergei and Yulia Skripal, and take note of the attempted murder charges brought yesterday against two suspects. We commend the work of the UK Police and all those involved in this investigation.</p><p>“We also note the UK’s analysis, independently verified by the Organisation for the Prohibition of Chemical Weapons (OPCW), that the exact same chemical nerve agent was used in the poisoning of Dawn Sturgess and Charles Rowley as was used in the poisoning of the Skripals. We urge Russia to provide full disclosure of its Novichok programme to the OPCW. And we encourage those with information about the attack in Salisbury on 4 March, as well as the further poisoning in Amesbury, to come forward to the UK authorities.</p><p>“We have full confidence in the British assessment that the two suspects were officers from the Russian military intelligence service, also known as the GRU, and that this operation was almost certainly approved at a senior government level. We have already taken action together to disrupt the activities of the GRU through the largest ever collective expulsion of undeclared intelligence officers. Yesterday’s announcement further strengthens our intent to continue to disrupt together the hostile activities of foreign intelligence networks on our territories, uphold the prohibition of chemical weapons, protect our citizens and defend ourselves from all forms of malign state activity directed against us and our societies.”</p></div>\n      "
}