{
  "path": "/en/news/news-releases/2020/06/25/prime-minister-announces-support-students-serving-their-communities",
  "pageTitle": "Prime Minister announces support for students serving their communities and opportunities to gain paid work experience | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Post-secondary students and recent graduates are facing unique and unprecedented challenges because of COVID-19. There are fewer jobs, and many co-op, internship, and community service placements have been cancelled. At the same time, not-for-profits are seeing an increased demand for their services and thousands of Canadians who want to be a part of the solution, which opens up opportunities for students in their communities.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the launch of the Canada Student Service Grant (CSSG), which will support post-secondary students and recent graduates as they volunteer to serve in their communities’ COVID-19 response and gain valuable experience at the same time. The CSSG will provide these volunteers with a one-time payment of between $1,000 and $5,000 based on the number of hours they serve. To find not-for-profit organizations looking for help during the pandemic, post-secondary students and recent graduates can use the new <a href=\"https://www.jobbank.gc.ca/volunteer\">I Want to Help</a> platform, which also launched today.</p>\n\n<p>The Government of Canada is also helping young Canadians find paid work placements and get the skills they need to start their careers. These activities include:</p>\n\n<ul>\n\t<li>Supporting an additional 20,000 job placements for post-secondary students in high demand sectors. A new investment of $186 million in the Student Work Placement Program will help more post-secondary students across Canada get paid work experience related to their field of study. This funding is in addition to the $80 million that was announced on April 22, 2020.</li>\n\t<li>Creating 10,000 new job placements for young people between the ages of 15 and 30 through the Canada Summer Jobs program. New funding of over $60 million will help expand the current work placement target from 70,000 to 80,000, creating 10,000 more placements for young people aged 15 to 30. The program provides wage subsidies to employers so they can give quality work experience to young Canadians and help them develop the skills they need to transition into the labour market.</li>\n\t<li>Creating 5,000 new internships through Mitacs for college and university students across Canada with small and medium-sized businesses. Funding of $40 million will also help develop partnerships with new industries, and offer internships to students in more areas of study.</li>\n\t<li>Increasing funding to the Digital Skills for Youth (DS4Y) program by $40 million to help post-secondary graduates gain professional work experience. DS4Y provides wage subsidy opportunities to help connect young people with small and medium-sized businesses and not-for-profits.</li>\n\t<li>Creating over 3,500 new job placements and internships through the Youth Employment and Skills Strategy. New funding of $34 million, in addition to the over $153 million announced on April 22, will support programs serving high-demand sectors such as health, community services, and information technology, and help other sectors to recover.</li>\n\t<li>Providing $6.7 million for the Computers for Schools Plus (CFS+) program. The partnership-based program refurbishes donated surplus computers and electronic devices, and provides them to schools, libraries, not-for-profit organizations, Indigenous communities, and low-income Canadians. It also offers paid, practical work internships for young people, through which they can develop advanced digital skills as well as experience in project management, teamwork, and communications.</li>\n\t<li>Creating 5,000 to 10,000 more work-integrated learning opportunities through the Business + Higher Education Roundtable (BHER). The BHER will launch a national challenge for students to develop creative solutions in response to current and future sector needs as defined by Canadian industry. The national student challenge will help connect Canada’s small and medium-sized businesses with the next generation of talent in Canada.</li>\n</ul>\n\n<p>The Canada Student Service Grant and <a href=\"https://www.jobbank.gc.ca/volunteer\">I Want to Help</a> platform are part of the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/22/support-students-and-new-grads-affected-covid-19\">nearly $9 billion in support for post-secondary students and recent graduates</a> announced by the Government of Canada on April 22, 2020. The funding for Mitacs, DS4Y, CFS+, and the Business + Higher Education Roundtable also fall under this funding.</p>\n\n<p>As part of its COVID-19 Economic Response Plan, the Government of Canada is providing support for students who want to make a difference in their communities, while gaining the skills and supports needed for future success whether that be in their studies or in the job market. This support also includes the <a href=\"https://www.canada.ca/en/revenue-agency/services/benefits/emergency-student-benefit.html\">Canada Emergency Student Benefit</a>, and temporary changes to the <a href=\"https://www.canada.ca/en/employment-social-development/news/2020/01/backgrounder-canada-summer-jobs-2020.html\">Canada Summer Jobs</a> and <a href=\"https://www.canada.ca/en/services/benefits/education/student-aid/notice-covid-19.html\">Canada Student Grants and Loans</a> programs.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadian students are looking for ways to make a real difference in their communities. With these new investments, we are giving them the support and connections they need to have a positive impact during COVID-19 and gain the skills needed for future success.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Young people are powerful leaders of change and during these difficult times, we need them to help our communities. The Canada Student Service Grant is an innovative way to provide support, helping students gain valuable experience as they volunteer to serve and strengthen their communities. This will also ensure students are in a financial position to continue their studies or careers.”</p>\n\n<footer class=\"default\">The Honourable Bardish Chagger, Minister of Diversity and Inclusion and Youth</footer>\n</blockquote>\n\n<blockquote>\n<p>“Students are passionate, engaged, and ready to make a difference. They face serious challenges as a result of the global pandemic, and these unique circumstances call for unique action. The additional investments we are making will ensure that young people not only remain connected to the job market but also have the tools they need to keep their eye fixed on a future of their choosing.”</p>\n\n<footer class=\"default\">The Honourable Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government&nbsp;recognizes that&nbsp;digital skills,&nbsp;computer&nbsp;knowledge and work-integrated learning are&nbsp;huge contributors to the future of innovation and&nbsp;jobs in Canada. By providing&nbsp;youth&nbsp;with&nbsp;immediate support and connections to industry, we continue to&nbsp;drive&nbsp;Canada’s talent pipeline and sustain&nbsp;our innovation capacity&nbsp;to&nbsp;help&nbsp;mitigate the negative impacts of COVID-19 on&nbsp;sectors across the economy.”</p>\n\n<footer class=\"default\">The Honourable Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Mitacs is a not-for-profit organization that fosters growth and innovation in Canada by solving business challenges with research solutions from academic institutions.</li>\n\t<li>The Youth Employment and Skills Strategy (YESS) aims to provide flexible employment services and enhanced supports for young Canadians so they can develop the skills and gain the experience they need to successfully transition into the labour market.</li>\n\t<li>The $34 million in additional contributions funding for YESS will include:\n\t<ul>\n\t\t<li>$15 million to Employment and Social Development Canada to support up to 2,000 additional job placements for young people aged 15 to 30 in community services and high demand sectors.</li>\n\t\t<li>$4 million to Canada Mortgage and Housing Corporation to support 275 paid internships within the housing sector, for Indigenous youth.</li>\n\t\t<li>$15 million to Canadian Heritage to create up to 1,245 additional job placements and paid internships in various sectors and communities, including Official Language Minority Communities.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/06/25/canada-student-service-grant\">Canada Student Service Grant</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/22/support-students-and-new-grads-affected-covid-19\">Support for students and new grads affected by COVID-19</a></li>\n\t<li><a href=\"http://www.canada.ca/iwanttohelp\">I Want to Help platform</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/work-integrated-learning.html\">Student Work Placement Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/funding/canada-summer-jobs.html\">Canada Summer Jobs</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/122.nsf/eng/home\">Digital Skills for Youth Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/youth-employment-strategy.html\">About the Youth Employment and Skills Strategy Program</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/cfs-ope.nsf/eng/home\">Computers for Schools Plus</a></li>\n</ul></div>\n      "
}