{
  "path": "/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit",
  "pageTitle": "Prime Minister Trudeau to attend North American Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will travel to Washington, D.C., to participate in the North American Leaders' Summit taking place on November 18, 2021.</p>\n\n<p>The North American Leaders’ Summit is a trilateral meeting between the Prime Minister of Canada, the President of Mexico, and the President of the United States to discuss shared priorities and find North American solutions to the challenges of today and tomorrow. This year, priorities include finishing the fight against COVID-19, getting the job done on vaccines, tackling the climate crisis, creating new middle class jobs, building an economic recovery that works for everyone, and migration.</p>\n\n<p>At the meeting, the Prime Minister will build on the important work accomplished at the Group of 20 Summit and the 26th United Nations Climate Change Conference of the Parties (COP26) to strengthen supply chains, help keep our economy growing and competitive, and protect our environment.&nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Our countries are committed to providing a better future for our people, including creating more middle class jobs, building a cleaner economy and tackling climate change, and finishing the fight against COVID-19. I look forward to meeting with my counterparts to discuss a new path for our partnerships at a time when the world is facing complex global challenges.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be the first time that the three leaders will meet in person since Canada hosted the last Summit in June 2016.</li>\n\t<li>The Canada-United States-Mexico Agreement (CUSMA) has been in place since July 1, 2020. It reinforces North American supply chains and enables Canada, the U.S. and Mexico to compete as a regional bloc against international competitors.</li>\n\t<li>Canada and the United States share the largest trading relationships in the world. The two countries also share the longest and most secure border in the world, over which $2.5 billion worth of goods and services cross daily.</li>\n\t<li>Canada is the United States’ largest customer and buys more goods from the United States than China, Japan, and the United Kingdom combined. Canada is also the top trading partner for most U.S. states.</li>\n\t<li>Canadian trade and investment with Mexico is steadily growing, with over $36 billion in two-way merchandise trade in 2020.</li>\n\t<li>Mexico is one of Canada’s Top 10 export destinations and is Canada’s third largest single-country merchandise trading partner.</li>\n\t<li>Prior to the pandemic, hundreds of thousands of Canadians travelled to Mexico. Despite the pandemic, Mexico was the second largest source country of travellers to Canada in 2020.</li>\n\t<li>Over 300 MOUs between Canadian and Mexican higher education institutions facilitate academic exchanges, making Mexico Canada's second&nbsp;largest source country for international students in Latin American with over 12,000 Mexican students in Canada in 2019 and over 10,000 in 2020.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid\">COVID-19: Travel, testing and borders</a></li>\n</ul></div>\n      "
}