{
  "path": "/en/news/news-releases/2020/01/15/governor-general-canada-attend-fifth-world-holocaust-forum",
  "pageTitle": "Governor General of Canada to attend the Fifth World Holocaust Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Jerusalem, from January 22 to 24, 2020.</p>\n\n<p>The Governor General will join leaders from around the world to participate in the Fifth World Holocaust Forum at Yad Vashem, the World Holocaust Remembrance Center. The forum, “Remembering the Holocaust: Fighting Antisemitism,” will mark the 75th anniversary of the liberation of Auschwitz-Birkenau.</p>\n\n<p>While there, the Governor General will lay a wreath in honour of the more than six million Jews murdered during the Holocaust. 75 years after the end of the Second World War, at a time of rising antisemitism in Canada and around the world, education and remembrance of the horrors of the Holocaust are more important than ever.</p>\n\n<p>During her visit, the Governor General will meet with the President of Israel, Reuven&nbsp;Rivlin, to reinforce the enduring friendship between Canada and Israel. She will also attend a dinner hosted by President Rivlin, together with other Heads of State and government representatives.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For over 70 years, Canada and Israel have shared a special bond rooted in mutual respect, shared values, and strong people-to-people ties. The Governor General’s visit will help deepen our already close relationship, as she represents Canada and pays tribute to the strength and resilience of the Jewish people.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Governor General Julie Payette’s first official visit to Jerusalem. The last Governor General to visit was the Right Honourable David Johnston in 2016.</li>\n\t<li>A multipartisan group of Members of Parliament from the Canada-Israel Interparliamentary Group, including Chair Michael Levitt, will travel with the Governor General as part of the Canadian delegation.&nbsp;</li>\n\t<li>President Rivlin made a State visit to Canada from March 31 to April 2, 2019.</li>\n\t<li>There are close to 35,000 Canadians living in Israel, and the Canadian-Jewish community includes more than 390,000 people, the fourth largest Jewish community in the world.</li>\n\t<li>Approximately 40,000 Holocaust survivors resettled across Canada after the Second World War.</li>\n\t<li>Canada and Israel are active members of the International Holocaust Remembrance Alliance, an intergovernmental organization dedicated to strengthening, advancing, and promoting Holocaust education, research, and remembrance.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Israel Relations</a></li>\n\t<li><a href=\"https://worldholocaustforum.org/world-holocaust-forum-2020/\">Fifth World Holocaust Forum 2020</a></li>\n\t<li><a href=\"https://www.holocaustremembrance.com/\">International Holocaust Remembrance Alliance</a></li>\n</ul></div>\n      "
}