{
  "path": "/en/news/readouts/2022/09/25/prime-minister-justin-trudeau-convenes-second-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the second Incident Response Group meeting to discuss Hurricane Fiona | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau was joined by ministers and senior officials for a second meeting of the Incident Response Group to discuss the impacts of Hurricane Fiona, which is affecting hundreds of thousands of people across Atlantic Canada and Eastern Quebec.</p>\n\n<p>During the meeting, the group expressed concern over the devastating impacts of the hurricane. Despite efforts over the last 24 hours, thousands of Canadians remain without power, and many people in the most affected regions have lost homes and have been displaced due to flooding, extremely high winds, and storm surges. They also spoke of the hurricane’s significant impact on the local fishing industry.</p>\n\n<p>Officials briefed the group on the trajectory of the storm, which continues to weaken as it moves northward, noting that improving conditions should facilitate work to assess damage and initiate cleanup efforts. The Prime Minister and ministers acknowledged the modelling work of the Canadian Hurricane Centre, which helped provincial and municipal officials and Canadians prepare for and mitigate potential impacts of the storm.</p>\n\n<p>Ministers and senior officials provided an update on ongoing efforts across the federal government to engage with provincial counterparts, municipal partners, and local First Nations communities to provide support in areas affected by the hurricane. They also recognized the tireless work of first responders and emergency relief organizations, including the Canadian Red Cross, in providing support to impacted communities.</p>\n\n<p>The group was briefed on the work of Canadian Armed Forces (CAF) members, who have been deployed in Nova Scotia in response to a request by the province, to help assess the hurricane’s impacts, remove debris, and restore transportation routes. Officials also noted that Transport Canada’s National Aerial Surveillance Program is currently conducting reconnaissance over affected areas and providing data to support restoration efforts. The group noted the approval of Prince Edward Island’s request for assistance and potential requirements for assistance in Newfoundland and Labrador – a request from Newfoundland and Labrador has since been received and approved. CAF members and other federal personnel and equipment, including the Canadian Coast Guard, Royal Canadian Navy, and Royal Canadian Air Force, have been mobilized and are ready to help in affected areas.</p>\n\n<p>The Prime Minister and ministers discussed the severe damage from the hurricane to power and telecommunications infrastructure, and the ongoing work within provinces to restore these services. Ministers and officials continue to engage with their provincial counterparts and with industry and utility representatives to ensure that all necessary support is available and that services can be restored as quickly as possible.</p>\n\n<p>Recognizing the longer-term economic impact of the storm, the group spoke of the federal financial assistance available to impacted provinces through the Disaster Financial Assistance Arrangements to help with response and recovery costs. The group also discussed how the Canadian Red Cross and matching federal funds will be available to address more immediate requirements for support for affected Canadians and their families.</p>\n\n<p>The Prime Minister reiterated that the federal government stands ready to provide support to impacted provinces during this difficult time. He asked ministers and senior officials to continue working closely with provincial and local governments, affected First Nations communities, and emergency response organizations to respond to the needs of impacted people and communities. The Prime Minister urged Canadians to stay safe by following the advice from their local authorities and committed to visiting impacted areas as soon as it is possible and responsible to do so.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://weather.gc.ca/hurricane/track_e.html\">Hurricane Track</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/programs/national-aerial-surveillance-program\">National Aerial Surveillance Program</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/mrgnc-mngmnt/rcvr-dsstrs/dsstr-fnncl-ssstnc-rrngmnts/index-en.aspx\">Disaster Financial Assistance Arrangements (DFAA)</a></li>\n\t<li><a href=\"https://www.redcross.ca/how-we-help/current-emergency-responses/hurricane-fiona-2022\">Canadian Red Cross ‒ Hurricane Fiona&nbsp;2022</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/09/government-of-canada-and-canadian-red-cross-establish-donation-matching-program-to-support-canadians-impacted-by-hurricane-fiona.html\">Government of Canada and Canadian Red Cross establish donation-matching program to support Canadians impacted by Hurricane Fiona</a></li>\n</ul></div>\n      "
}