{
  "path": "/en/news/news-releases/2023/02/24/supporting-ukraine-long-it-takes",
  "pageTitle": "Supporting Ukraine for as long as it takes | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>One year ago today, Putin launched a brutal full-scale invasion of Ukraine. In the face of the immense human suffering, appalling human rights violations, and cruelty inflicted upon the people of an independent and sovereign nation, Ukraine still stands strong. The Ukrainian people have bravely stood up to the Russian regime, in defence of their sovereignty, territorial integrity, and independence – and our shared values of democracy and freedom. The Government of Canada will stand with the people of Ukraine for as long as it takes.</p>\n\n<p>Today, the Prime Minister announced new measures to continue supporting the people of Ukraine, including with new military equipment and additional sanctions.</p>\n\n<p>Prime Minister Trudeau announced that Canada will provide four additional Leopard&nbsp;2 main battle tanks to support the Armed Forces of Ukraine in defence of their country, growing our contribution to eight tanks in total. Canada will also provide an armoured recovery vehicle and over 5,000 rounds of 155&nbsp;mm ammunition. The four previously announced Leopard&nbsp;2 main battle tanks have been delivered to Poland and a Canadian Armed Forces team of trainers is currently training Ukrainian tank crews.</p>\n\n<p>To increase pressure on Putin’s regime, the Prime Minister announced that Canada is imposing new sanctions on individuals and entities complicit in Russia’s ongoing war against Ukraine. These new measures, which build on the sanctions we have already implemented the past year, include:</p>\n\n<ul>\n\t<li>Sanctioning 122 individuals and 13 entities, including members of the lower house of Russia’s parliament who have voted in favour of legislation related to the invasion and attempted annexation of four regions of Ukraine. Other sanctioned individuals include Russian Deputy Prime Ministers, Ministers, and others in the Office of the President of Russia and the Russian military, as well as family members of previously sanctioned individuals;</li>\n\t<li>Sanctioning seven Russian individuals and 50 defence entities involved in Russia’s defence industry, including the production of tanks, missiles, and weapons systems that Russia is using in Ukraine; and</li>\n\t<li>Prohibiting the export to Russia of certain chemical elements for use in electronics, and banning the import, purchase, or acquisition of Russian arms, ammunition, and other weapons, wherever situated or processed, from Russia or from any person in Russia.</li>\n</ul>\n\n<p>In addition, Canada is further combatting Russian and Belarusian deception by tackling their unfair trade practices. We are calling out those countries for intervening to artificially lower the price of their goods. This measure ensures that the Canada Border Services Agency has the tools it needs to protect Canadian producers from competing against unfair foreign government price distortions on imports, which have become increasingly evident since the invasion of Ukraine.</p>\n\n<p>Today, the Minister of Foreign Affairs, Mélanie Joly, announced more than $32 million in support of security and stabilization in the country. This includes contributions to demining and accountability efforts, as well as countering chemical, biological, radiological, and nuclear threats that jeopardize the safety of the entire region.</p>\n\n<p>As we mark one year since Russia launched its full-scale invasion of Ukraine, we pay tribute to the lives tragically lost to the brutality of Russia’s senseless war, and we honour the Ukrainians who continue to fight. We will always stand united and steadfast in solidarity with Ukraine and in the fight to protect their country, and freedom and democracy everywhere.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Putin thought his invasion would be a quick victory, but he was mistaken. Ukrainians have stood strong over the last 365 days and counting, and as Russia continues its brutal war against Ukraine, Canada and Canadians will stand by the Ukrainian people for as long as it takes.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In seeking to erase Ukraine from the map and its story from history, Putin is trying to show that tyranny can defeat democracy. Instead, the brave people of Ukraine, in their heroic resistance, are ensuring that Ukraine will survive, and democracy will prevail. Canada will stand by Ukraine’s side for as long as it takes, and we will continue to do everything we can to hold Putin and his regime accountable for their illegal and barbaric war.”</p>\n\n<footer class=\"default\">The Honourable Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“For one year, President Putin and his war machine have been trying to squash Ukrainian resolve through unrelenting attacks on their homeland. But Ukrainians continue to stand against tyranny and fight for what is rightfully theirs. Their spirit is unbreakable, and so is our support for them. Canada stands with Ukraine, and we will continue to do so for as long as it takes.”</p>\n\n<footer class=\"default\">The Honourable Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada is continuing to provide Ukraine with the comprehensive military aid it needs to defend its territory and people against ongoing Russian aggression. Canada has trained 35,000 Ukrainian personnel through Operation UNIFIER, we have donated over $1 billion in military aid, and our Canadian Armed Forces personnel have transported over seven million pounds of Ukraine-bound donations. Ukraine will win and Canada will be there until the end.”</p>\n\n<footer class=\"default\">The Honourable Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s illegal occupation and attempted annexation of Crimea in 2014, Canada has imposed sanctions on more than 2,400 individuals and entities. Many of these sanctions have been undertaken in coordination with Canada’s allies and partners.</li>\n\t<li>In 2022, Canada committed over $5&nbsp;billion in direct financial, military, humanitarian, and immigration assistance to Ukraine. This includes $2.5&nbsp;billion in direct economic support, all of which has been provided, including:\n\t<ul class=\"bulletOutline\">\n\t\t<li>$320 million in humanitarian assistance for emergency health services, protection, support to displaced populations and essential life-saving services such as shelter, water and sanitation, and food.</li>\n\t\t<li>$1.95&nbsp;billion in loan resources through the Administered Account for Ukraine at the International Monetary Fund (IMF) that Canada championed ($500&nbsp;million of which represents equivalent proceeds from the Ukraine Sovereignty Bond);</li>\n\t\t<li>$500&nbsp;million in direct bilateral loans; and</li>\n\t\t<li>A €36.5&nbsp;million (approximately $50&nbsp;million) European Bank for Reconstruction and Development loan guarantee to facilitate support to Ukraine’s Naftogaz.</li>\n\t</ul>\n\t</li>\n\t<li>As part of our overall contribution, Canada has also committed $115&nbsp;million to the World Bank Group’s Ukraine Relief, Recovery, Reconstruction and Reform Trust Fund (URTF) to help Ukraine repair its energy infrastructure. Canada has also temporarily removed trade tariffs on Ukrainian imports.</li>\n\t<li>Canadian Armed Forces members are supporting the Armed Forces of Ukraine in the United Kingdom and Poland under Operation UNIFIER, providing training on a range of military skills. Between 2015 and 2023, Canada trained more than 35,000 members of Ukraine’s security forces as part of Operation UNIFIER.</li>\n\t<li>The Canadian Armed Forces have been assisting with the delivery of military aid for Ukraine from Canada and on behalf of our allies and partners, having transported over seven million pounds of military donations since March 2022.</li>\n\t<li>Since February 2022, Canada has committed over $1 billion in military assistance to Ukraine. This includes four Leopard 2 main battle tanks, over 200 armoured personnel carriers, a National Advanced Surface-to-Air Missile System (NASAMS) with associated munitions, 39 armoured combat support vehicles, anti-tank weapons, small arms, M777 howitzers and associated ammunition, high-resolution drone cameras, winter clothing, and more.</li>\n\t<li>Canada is helping Ukrainian families find a safe, temporary home in Canada, and has put in place support services to help them after they arrive. This includes temporary financial assistance and access to federally funded settlement services, such as language training and employment-related services.</li>\n\t<li>Streamlining current visa and travel requirements, the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/ukraine-measures/cuaet.html\">Canada-Ukraine Authorization for Emergency Travel</a> program is the fastest, safest, and most efficient way for Ukrainians and their family members to come to Canada. As of February 16, 2023, close to 560,000 applications have been approved.&nbsp;</li>\n\t<li>The government has introduced legislative changes to the <em>Immigration and Refugee Protection Act</em> to ensure foreign nationals subject to sanctions under the <em>Special Economic Measures Act</em> are inadmissible to Canada, banning sanctioned Russians from entering the country. These changes will allow the Canada Border Services Agency to deny entry to, and remove, individuals subjected to sanctions, and will allow Immigration, Refugees and Citizenship Canada officials to deny visas.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/canadian-military-support-to-ukraine.html\">Canadian donations and military support to Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"/en/news/statements/2023/02/24/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2023/02/canada-to-increase-support-for-security-and-stabilization-efforts-in-ukraine.html\">Canada to increase support for security and stabilization efforts in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/28/prime-minister-announces-new-measures-support-ukraine\">Prime Minister announces new&nbsp;measures to support Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2023/02/minister-joly-travels-to-ukraine-to-discuss-ongoing-and-unwavering-canadian-support-for-ukraine.html\">Minister Joly travels to Ukraine to discuss ongoing and unwavering Canadian support for Ukraine</a></li>\n</ul></div>\n      "
}