{
  "path": "/en/news/statements/2020/06/24/statement-prime-minister-la-fete-nationale-du-quebec",
  "pageTitle": "Statement by the Prime Minister on la Fête nationale du Québec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on la Fête nationale du Québec:</p>\n\n<p>“Today, my family and I join millions of Quebecers to celebrate la Fête nationale du Québec and our Québécois pride. What makes us unique also contributes to making Canada a better and stronger country, every day.</p>\n\n<p>“Across Quebec, from Montréal to the Îles-de-la-Madeleine, and from Québec City to the Saguenay, we share a unique culture and heritage. And, at the heart of our culture and heritage, is the beautiful French language.</p>\n\n<p>“Quebecers have, and continue to make, vital contributions to Canada’s success. As a country, we would not be where we are today without the achievements of so many Quebecers throughout our history. Quebec has often been at the forefront in bringing about major changes across the country in areas like justice, equality, and democracy.</p>\n\n<p>“Today, we also recognize the resilience that Quebecers have shown time and time again, and which has been challenged in recent months. The COVID-19 pandemic has had significant impacts in Quebec, but, day after day, Quebecers have shown their solidarity and kept moving forward, together.</p>\n\n<p>“This year, because of COVID-19, we unfortunately cannot gather like we usually do at the Place des festivals in Montréal, on the Plains of Abraham in Québec City, or even at home with our family and friends. But we will still find other ways to celebrate our love for Quebec.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish everyone a wonderful Fête nationale du Québec. Today, let’s celebrate who we are and how far we have come.”</p></div>\n      "
}