{
  "path": "/en/news/readouts/2021/02/01/prime-minister-justin-trudeau-speaks-united-states-vice-president-kamala",
  "pageTitle": "Prime Minister Justin Trudeau speaks with United States Vice President Kamala Harris | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with United States Vice President Kamala Harris. The Prime Minister congratulated the Vice President on her historic election, and she recalled fondly her years spent in Montréal. The Prime Minister looked forward to working with the U.S. administration on shared priorities, including fighting the COVID-19 pandemic through close collaboration on borders and access to vaccines, and to building back better. He also looked forward to strengthening the bilateral trading relationship and Canada-U.S. supply chains, and avoiding the unintended consequences of Buy America policies, for the benefit of people in both countries. The Prime Minister and the Vice President welcomed opportunities for Canada-U.S. cooperation in leading global action to fight climate change. The Prime Minister also highlighted the importance of strengthening North American energy security.</p>\n\n<p>The Prime Minister and Vice President agreed on the centrality of democratic principles and respect for rule of law and justice as values that Canada and the U.S. share. They spoke of the need to increase trust in government through greater transparency and effective delivery of services. The Prime Minister and the Vice President discussed a wide range of issues, from promoting diversity and inclusion to the importance of mental health, as well as the need to address online hate, firearm trafficking, and gender-based violence.</p>\n\n<p>Prime Minister Trudeau thanked Vice President Harris for the United States’ ongoing support to free Canadians Michael Kovrig and Michael Spavor, who have been arbitrarily detained in China.</p>\n\n<p>Both the Prime Minister and Vice President looked forward to the upcoming bilateral meeting between Prime Minister Trudeau and President Biden.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-inauguration-joe-biden-president-united\">Statement by the Prime Minister of Canada on the inauguration of Joe Biden as President of the United States of America</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-united-states-decision-keystone-xl\">Statement by the Prime Minister of Canada on the United States’ decision on the Keystone XL project</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/11/07/statement-prime-minister-canada-result-us-presidential-election\">Statement by the Prime Minister of Canada on the result of the U.S. presidential election</a></li>\n\t<li><a href=\"https://www.cbsa-asfc.gc.ca/services/covid/menu-eng.html\">Coronavirus disease (COVID-19): Current border measures and requirements</a></li>\n</ul></div>\n      "
}