{
  "path": "/en/news/readouts/2022/09/18/prime-minister-justin-trudeau-meets-prime-minister-ukraine-denys-shmyhal",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Ukraine Denys Shmyhal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Ukraine, Denys Shmyhal.</p>\n\n<p>The Prime Ministers discussed Canada’s assistance to Ukraine and work with like-minded partners to address the impacts of Russia’s illegal and unjustifiable aggression of the country. They also discussed the importance of maintaining strong unity amongst allies and continuing to impose severe sanctions on Russia in the face of its invasion of Ukraine.</p>\n\n<p>Prime Minister Trudeau expressed his condolences to Prime Minister Shmyhal on behalf of Canadians to all Ukrainians regarding the horrifying and heartbreaking atrocities committed in Izyum.&nbsp;&nbsp;</p>\n\n<p>Prime Minister Trudeau commended the courage and heroism of the Ukrainian people in coming together to defend their country and freedoms against Russia’s ongoing attacks. Prime Minister Trudeau congratulated Ukraine on its recent military gains, and reiterated Canada’s strong ongoing support for Ukraine, including leadership on financial support through the International Monetary Fund. The leaders also discussed Ukraine’s financial situation, including its economic recovery and reconstruction. Prime Minister Shmyhal thanked Prime Minister Trudeau for Canada’s ongoing military, financial, and humanitarian aid to Ukraine.</p>\n\n<p>The leaders strongly condemned Russia’s increasingly persistent, indiscriminate, and horrific attacks on civilians and civilian infrastructure in Ukraine.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Shmyhal agreed to keep in close contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/15/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/23/prime-minister-announces-additional-support-ukraine\">Prime Minister announces additional support for Ukraine</a></li>\n</ul></div>\n      "
}