{
  "path": "/en/news/statements/2016/06/29/joint-statement-prime-minister-canada-and-president-united-states",
  "pageTitle": "Joint statement by the Prime Minister of Canada and the President of the United States on softwood lumber | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Given the great importance of the softwood lumber industry to the economies of the United States and Canada, on March 10, 2016, we instructed the United States Trade Representative and the Canadian Minister of International Trade to intensively explore all options and report back on the key features that would address the issue.</p>\n<p>In response to these instructions, our Ministers and their teams have been meeting diligently on softwood lumber over the past three months.&nbsp; These discussions have been challenging but productive.</p>\n<p><strong>A Vital Sector</strong></p>\n<p>The softwood lumber industry is a vital sector for both the United States and Canada, and bilateral trade and investment in softwood lumber is key to the competitiveness of our industries.&nbsp; The U.S. and Canadian federal governments have made significant advances in understanding our industries’ sensitivities and priorities since March.&nbsp; The United States and Canada are working together to find a path forward that reflects our shared goals and that results in durable and equitable solutions for softwood lumber producers from both countries.&nbsp;</p>\n<p>Canada has long been the largest source of imports of softwood lumber to the U.S. market and the United States is by far Canada’s most important customer.&nbsp; Extensive cross-border investment also exists, with U.S. firms operating lumber mills in Canada and Canadian firms making investments in the United States.&nbsp; Firms in both countries also have worked jointly and in parallel to develop markets for softwood lumber.</p>\n<p><strong>Common Goals for Pursuing a New and Durable Agreement</strong></p>\n<p>A new softwood lumber agreement will need to reflect the realities of Canadian timber management policies and the U.S. domestic market.&nbsp; A new agreement must be equitable and provide a predictable business environment that gives producers on both sides of our border the ability to react confidently to changing market conditions. &nbsp;Any agreement must deliver a durable and equitable solution and benefit softwood lumber producers from Canada and the United States, related industries and consumers, and support the overall economic well-being of both countries. &nbsp;On the basis of discussions to date, our governments are committed to working to achieve such an agreement.</p>\n<p><strong>Key Features </strong></p>\n<p>Efforts to achieve such an outcome will be facilitated by focussing on the following key features:&nbsp;</p>\n<ul>\n<li>an appropriate structure, designed to maintain Canadian exports at or below an agreed U.S. market share to be negotiated, with the stability, consistency and flexibility necessary to achieve the confidence of both industries;</li>\n</ul>\n<ul>\n<li>provisions for region or company exclusions if justified;</li>\n</ul>\n<ul>\n<li>provisions promoting regional policies that eliminate the underlying causes of trade frictions, including a regional exits process that is meaningful, effective and timely, recognizing that should an exit be granted, it would be reversible if the circumstances justifying the exit change;</li>\n</ul>\n<ul>\n<li>provisions to ensure information collection and exchange to create meaningful transparency;</li>\n</ul>\n<ul>\n<li>institutional arrangements to administer the agreement;</li>\n</ul>\n<ul>\n<li>effective enforcement tools that are neutral, transparent, binding, expeditious, and well-timed to address concerns as they arise;</li>\n</ul>\n<ul>\n<li>associated commitments regarding the use of trade remedies;</li>\n</ul>\n<ul>\n<li>provisions for appropriate duration and flexibility to anticipate and adapt to a range of market situations, industry innovations, and shifting demand patterns;</li>\n</ul>\n<ul>\n<li>provisions to address other issues, such as product scope, remanufacturers and joint market development.<strong></strong></li>\n</ul>\n<p><strong>Next Steps</strong></p>\n<p>The United States and Canada have made important progress in our negotiations, but significant differences remain regarding the parameters of the key features.&nbsp; Our governments will explore approaches to ensure effective management of the agreed market share. &nbsp;We are encouraged that both industries remain committed to working toward an agreement and will continue to consider ideas for achieving that objective.&nbsp; Our dialogue will continue and, building on the progress achieved to date, our Ministers will maintain an intensive pace of engagement with a view to achieving a mutually-acceptable agreement this fall, bearing in mind the expiration of standstill after October 12, 2016.</p></div>\n      "
}