{
  "path": "/en/news/news-releases/2018/09/20/prime-minister-lead-canadian-delegation-united-nations-general",
  "pageTitle": "Prime Minister to lead Canadian delegation to United Nations General Assembly in New York | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City, from September 24 to 26, 2018, to lead Canada’s delegation to the 73rd Session of the United Nations General Assembly.</p><p>During the General Assembly, the Prime Minister will reiterate Canada’s support of the UN. He will emphasize how countries need to come together more than ever to agree on goals and principles and face down shared challenges, in order to deliver economic growth that benefits everyone, fight climate change, and build a more peaceful and secure world. He will also underscore the importance of advancing gender equality, and creating more opportunities for women and girls to succeed, as Canada celebrates its first <a href=\"https://www.swc-cfc.gc.ca/commemoration/gew-ses/index-en.html\">Gender Equality Week</a>.</p><p>On the first day of the visit, the Prime Minister will take part in a panel discussion focused on how developed countries can facilitate long-term investment to support the Sustainable Development Goals.</p><p>That same day, Prime Minister Trudeau will deliver remarks at the Nelson Mandela Peace Summit held in honour of the centenary of Nelson Mandela’s birth. During his remarks, he will emphasize Canada’s enduring commitment to peace and stability, and the promotion of human rights, diversity, and inclusion.</p><p>In partnership with African leaders, the Prime Minister will bring together key private and public sector players to discuss how to create better economic opportunities and jobs for young people across Africa.</p><p>The Prime Minister, alongside Foreign Affairs Minister Chrystia Freeland and International Trade Diversification Minister Jim Carr, will participate in an event hosted by the Council on Foreign Relations for a discussion on Canada’s global outlook, economic growth, gender equality, and the importance of restoring confidence in our institutions.</p><p>Building on the momentum from the G7 Summit, Prime Minister Trudeau will join other leaders and key stakeholders in a discussion on girls’ education. He will also convene a leaders’ roundtable to discuss how to best take the historic commitment from Charlevoix that mobilized $3.8 billion in resources, and advance education for women and girls in fragile, conflict, and crisis situations.</p><p>Throughout the visit, Prime Minister Trudeau will work to mobilize ongoing international support of the central themes of Canada’s 2018 G7 Presidency, particularly investing in economic growth that benefits everyone, and working together on climate change, oceans, and clean energy.</p><h2>Quote</h2><blockquote><p>“Canada is strongly committed to the United Nations and the role it and its member states play to promote a more peaceful, equal, and stable world. We believe that we are stronger when we work together and focus on real, concrete solutions that benefit everyone. Canada will continue to promote and defend the international rules-based order as the best way to fight inequalities, create economic growth that benefits everyone, and leave a better, healthier planet for future generations.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Canadian delegation to the United Nations General Assembly will include:</li><ul><li>Minister of Foreign Affairs Chrystia Freeland</li><li>Minister of International Development Marie-Claude Bibeau</li><li>Minister of International Trade Diversification Jim Carr</li><li>Minister of Tourism, Official Languages and La Francophonie Mélanie Joly</li><li>Minister of Environment and Climate Change Catherine McKenna</li><li>Minister of Immigration, Refugees and Citizenship Ahmed Hussen</li><li>Minister of Health Ginette Petitpas Taylor</li></ul><li>Canada has been active at the United Nations since its creation in 1945, and played a key role in drafting the <a href=\"https://www.un.org/en/charter-united-nations/index.html\">UN Charter</a>, an international treaty that sets out basic principles of international relations.</li><li>Today, Canada continues to support the UN by actively participating in the organization's activities and providing financial support.</li><li>Canada is the fifth-largest donor to the UN system.</li></ul></div>\n      "
}