{
  "path": "/en/news/statements/2022/06/08/building-sustainable-resilient-and-equitable-future-through-sustainable",
  "pageTitle": "Building a Sustainable, Resilient, and Equitable Future through the Sustainable Development Goals | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and the Prime Minister of Barbados, Mia Mottley, today issued the following joint statement on building a sustainable, resilient, and equitable future through the Sustainable Development Goals:</p>\n\n<p>“The world has changed since the last time that we came together in Lima in 2018. The COVID-19 pandemic and ensuing economic and financial crises laid bare fissures and gaps in the system that we now need to address. Millions falling into poverty for the first time in nearly a quarter-century; worsening inequality within and between countries; devastating climatic events, limited progress on gender equality; rising conflict and instability around the globe; the slow pandemic of anti-microbial resistance; and the emerging food crisis all signal that business as usual is not an option.</p>\n\n<p>“As co-Chairs of the United Nations Secretary-General’s Sustainable Development Goals (SDGs) Advocates group, we believe that the 2030 Agenda for Sustainable Development offers us a path of hope for a better world that is more sustainable, more equitable and more prosperous. But achieving the 2030 Agenda will take more effort, a high level of resolve, and a renewed commitment to international solidarity. As champions for this Agenda, we see some areas where we as leaders in the Americas need to focus to accelerate progress and achieve our goal of sustainable development. We must deliver better public education and health care for more and create the policy space to do so.</p>\n\n<p>“We must provide greater space for the voices of youth, women and girls in all of their diversity, Indigenous peoples, persons with disabilities, and other historically marginalized groups to be heard and respected. We will not achieve the SDGs without them.</p>\n\n<p>“Strong democracies with resilient institutions that protect and respect human rights and fundamental freedoms and support strong civil societies are central to creating a better future for all.&nbsp; We call on leaders of the Americas to work together to empower parliamentarians, civil society, and community leaders to raise awareness and mobilize citizens to accelerate progress on the SDGs.</p>\n\n<p>“We must also ensure that our international institutions work for all of us, and in particular that they are responding to the needs of the most vulnerable and those most impacted by the new challenges of the climate crisis, and the debt overhang of the pandemic. As co-Chairs, we are committed to working alongside the United Nations, the IMF, World Bank, and other international and regional financial institutions to ensure that these specific vulnerabilities are reflected in the international response to the challenges we face.</p>\n\n<p>“Diversified partnerships are the cornerstone of sustainable development. We must do better to align all sources of finance to the SDGs, including from the multilateral development banks, the private sector, and philanthropic organizations.</p>\n\n<p>“For many of us in the Americas, we know the devastating impact of sea-level rise due to climate change and the catastrophic effects of tropical storms and adverse weather effects on our countries and peoples. The existential risk posed by climate change cannot be ignored. Financing greater resilience for those in our region on the frontline of the climate crisis is a new and critical priority. And we all need to work towards mitigation of the crisis through a greener future that balances economic and environmental considerations, transitions the world towards cleaner energy sources, preserves land, oceans, and biodiversity, and mobilizes private savings and new, environmentally sound technologies.</p>\n\n<p>“We support the ambitious fulfillment of the Paris Agreement and call on leaders to re-double efforts to find the missing ingredient so far: climate finance. We encourage our citizens and young people to hold us to account, including by promoting the adoption, expansion and regional integration of carbon pricing to accelerate climate mitigation efforts and help fund efforts to rebuild following climate related events.</p>\n\n<p>“The global challenges we face are complex and interrelated. In the response to the pandemic and the global financial crisis before, it is clear that we can be equal to major disasters. We must give greater priority to the even larger but more slow-onset challenges addressed by the SDGs. Bold, innovative action and long-term thinking is essential. The 5Ps of the 2030 Agenda express this succinctly: Investing in People, fostering Partnerships, and protecting the Planet will allow us to realize Peace and Prosperity. We call on you to bring your boldest ambition, brightest ideas, and best efforts to help us all realize the SDGs and a better world for all.”</p></div>\n      "
}