{
  "path": "/en/news/statements/2020/02/12/statement-prime-minister-international-day-against-use-child-soldiers",
  "pageTitle": "Statement by the Prime Minister on the International Day Against the Use of Child Soldiers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against the Use of Child Soldiers, also known as Red Hand Day:</p>\n\n<p>“Recruited by force or pushed to join because of economic and social pressures, child soldiers are isolated from their communities, and robbed of their childhoods and futures. Their wounds are physical, mental, emotional, developmental, and spiritual.</p>\n\n<p>“No child should ever be forced to bear arms. As Roméo Dallaire once said, ‘where you are born should not dictate your potential as a human being.’</p>\n\n<p>“Today, on the International Day Against the Use of Child Soldiers, we reaffirm our commitment to work with the international community to end the recruitment and use of children in armed conflicts. Every child around the world deserves to be protected from abuse and violence, and should be given a safe space to learn and grow. This is a human rights issue.</p>\n\n<p>“As a global community, we have a responsibility to help children reclaim their lives, rejoin their communities, and reach their full potential. Canada is working with its international partners to implement the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>. By supporting those principles, we are helping build a world that views the protection of children&nbsp;as essential to achieving peace and security.</p>\n\n<p>“Through education, prevention, and intervention, we can create a future where children are not used as weapons of war. Together, we can make sure children remain children, and build a safer world for everyone.”</p></div>\n      "
}