{
  "path": "/en/news/readouts/2022/01/11/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy<strong>, </strong>to discuss security concerns in Eastern Europe and other global issues.</p>\n\n<p>The Prime Minister and President discussed their shared concerns about the current buildup of Russian military forces in and around Ukraine, as well as Russia’s ongoing aggression and destabilization activities. Prime Minister Trudeau reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine and emphasized that any military incursion into Ukraine would have serious consequences, including coordinated sanctions. He emphasized the coordination underway between Ukraine’s partners in order to stand united in the face of Russian provocation.</p>\n\n<p>The two leaders discussed the importance of Ukraine’s economic and judicial reforms in ensuring peace and prosperity for the country. They expressed hope that the upcoming NATO-Russia Council meeting and other ongoing diplomatic efforts would contribute to de-escalation and promote further constructive dialogue.</p>\n\n<p>The Prime Minister and President discussed the downing of Ukraine International Airlines Flight&nbsp;752 and their commitment to continuing to pursue justice from Iran for the victims of this tragedy. Both leaders underscored the second anniversary of the downing on January 8 and the emotional impact of this tragedy on the victims’ families.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for the Canadian military training mission in Ukraine, Operation UNIFIER, and the two leaders discussed Canada’s strong, ongoing support and the future of its assistance.</p>\n\n<p>President Zelenskyy and Prime Minister Trudeau noted that January 27 marks the 30th anniversary of diplomatic relations between Canada and Ukraine. The two leaders looked forward to continued cooperation and working together on shared priorities, including security, prosperity, and the rules-based international order.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/12/g7-foreign-ministers-statement-on-russia-and-ukraine.html\">G7 Foreign Ministers’ Statement on Russia and Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/flight-vol-ps752.aspx?lang=eng\">Canada’s response to Ukraine International Airlines Flight&nbsp;752 tragedy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2022/01/08/prime-ministers-remarks-national-day-remembrance-victims-air-disasters\">Prime Minister’s remarks for the National Day of Remembrance for Victims of Air Disasters</a></li>\n</ul></div>\n      "
}