{
  "path": "/en/news/statements/2022/01/22/kihci-okimaw-o-wihtamakewin-nikotwasik-askiy-aspin-ohci-nipahtakewin",
  "pageTitle": "Kihci Okimaw Ô-Wîhtamâkêwin nikotwâsik askiy aspin ohci nipahtâkêwin pîhci La Loche, Kisiskâciwani-Sîpiy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kihci Okimaw, Justin Trudeau, anohc pakitinam ôma wîhtamâkêwin ta-kiskisi nikotwâsik askiy aspin ohci nipahtâkêwin pîhci La Loche, Kisiskâciwani-Sîpiy:</p>\n\n<p>“Nikotwâsik askiy anoch, La Loche mâmawâyâwinihk, Kisiskâciwani-Sîpiy, kî-kakwâtakihowak ôma mayinikewin ka-kî-ispayik êkota nêwo ayisiyiniwak kî-nipahâwak êkwa mîna têpakohp kotakak mitoni kî-mâyitotâkôwak.</p>\n\n<p>“Anoush ôma ka-kaskitêwinakwahk ka-kî-ispayik, nisîtoskâwâwak ayisiyiniwak Kisiskâciwani-Sîpiy ohci êkwa kahkiyaw Canadians ta-kiskisi mîna kistêyihcikâtêwin isi kwayaskwâtisiwin opimatisiwiniwaw ka-kî-wanihtacik. Nipakitinênân mitoni kitimâkinâtowin isi paspîwiyiniwak êkwa mîna kitimâhakan ô-wîtotîmâkana êkwa otôtêmimâwa ka-âhkami sîpihkêyihtahkik wîsakitêhêwin mîna kakwâtakêyimowin ka-ispayik ohci ôma môskîscikêwin.</p>\n\n<p>“Ka-mâmitonêyihtamahk ôma mâyahkamikisiwin, ninisitawêyinênân êkwânima itahto pimatisiwin ka-wanihtahk isi pâskisikan mayinikêwin êwako osâm mistahi. Pêyâhtakêyimowin mîna nâkatohkâcikâtêwin ohci kahkiyaw Canadians êwako okimânâhk kihvi nîkânêyihtâmwak, mîna na-âhkamêyihtênân ta-itocikâtêk kîkway ta-manâcihâyahkik mîna ta-wîcihâyahkik ta-osihcikâtêk pêyâhtak pisiskêyihcikêwin isi mâmawâyâwinihk. Kimasinahamiwânanik kahkiyaw kitimâhakanak êkwa paspîwiyiniwak ohci pâskisikan mayinikêwin pîhci Kânata mîna ô-wîtotîmâkana – ohci Kisiskâciwani-Sîpiy isi Quebec Ôtênâw, ohci Toronto isi Nova Scotia.</p>\n\n<p>“Kîhkâtêyihtâkwan ta-sîtoskâkêhk mâmawâyâwinihk tâpiskôc La Loche, ispîhk 2020, Kihci-Okimânâhk Kânata kî-wîhtamâkêw <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">nakinikâtêwin ohci ayiwâk iyikohk kihci-mitâtahtomitanaw niyânanwâw mitâtahtomitnaw kiskinowâpahtihiwêwina ohci mâyinikêwin itowahk paskisikana mîna têyihtâkosiwina</a>. Ispîhk 2021, niki wîhtamâkênân sôniyâwi kakêskwêwin kêkâc iyikohk $ nikotwâsikwâw-mitâtahtomitanaw mâwaci-kihci-mitâtahtomitanaw pâsci nisto askiy&nbsp;kiki nanâtohkî-nakiskamâkêwin isi pîkwêyihtamowin miyw-âyâwin kiki Nistam-Iyiniwak, Ayaskîmow, êkwa Âpihtawikosisânak. Ôma pimipayihtâwin ta-âhkami yahkipitam kâhcitinikatêwin isi mîna ta-sôhkêpayik pîkwêyihtamowin miyw-âyâwin isi Nêhiyaw Mâmawâyâwinihk – êkwa akami askiy. Ta-maskawisihtahk mâmawâyâwinihk-ohcipayiwin sîtoskâkêwin, ohci nakacihtamohiwêwin mêkwâc êkwa oskayi miyw-âyâwin otatoskêwak, ta-osihcikâtêk ayiwâk mâmawâyâwinihk pimipayihtâwin. Okimânâhk ta-âhkami atoskâtam nîsôhkamâkêwin asici Nêhiyaw, ôtênahk, okimânâhk, êkwa tipahaskanihk okimânâhk ta-kêhcinahow nawac katawa ati-nîkan kiki kahkiyaw Nêhiyaw oskayak.</p>\n\n<p>“Kihci-Okimânâhk Kânata âhkamêyihtam mîna ta-sîtoskahk nanâtawihiwêwin paminikêwin kiki êkwâniki ka-kakwâtakihtâcik ohci La Loche mâyahkamikisiwin, asic ta-maskawisihtahk sîtoskâkêwin kiki Nêhiyaw-nîkânîstamâkêwin, nêhiyawîhcikêwin, êkwa kakwâtakêyimowin-kiskêyihtamohiwêwin pîkwêyihtamowin miyw-âyâwin pimipayihtâwin kiki Nêhiyawak. Âyimipayiwin nakinikêwin sîtoskâkêwin êkwa pimipayihtâwin ihtakon kiki Nistam-Iyiniwak, Ayaskîmow êkwa Âpihtawikosisânak sâpô ôma Pakosêyimowin kiki Miyw-âyâwin Sêwêpicikan ita 1‑855‑242‑3310 ahpô cikâstêpayicikanisihk pîkiskwêwin ita <a href=\"https://www.hopeforwellness.ca/\">www.hopeforwellness.ca</a>. Kîmôci-ayi pîkwêyihtamowin maskawâtisiwin sîtoskâkêwi ihtakon tahto kîsikâw, mîna môsci-âpacihtawin kiki kahkiyaw Canadians sâpô ôma Mâmawi Miyw-âyâwin Kânata portal ita 1‑866‑585‑0445 ahpô cikâstêpayicikanisihk ita <a href=\"http://www.wellnesstogether.ca\">www.wellnesstogether.ca</a>. Na-âhkami paminênân isi pîkwêyihtamowin maskawâtisiwin pimipayihtâwin êkwa sîtoskâkêwin âkwânima ta-kî-kwêskinâkohtâw isi Nêhiyawak ô-pimatisiwiniwâw – êkwa kahkiyaw Canadians.</p>\n\n<p>“Isi opîkiskwêstamâkêw kiki Kihci-Okimânâhk Kânata, nisihkimaw kahkiyaw awiyak ta-kiskisit kitimâhakanak mîna paspîwiyiniwak ohci ôma mâyahkamikisiwin pîhci La Loche, âkwâniki ô-pimatisiwiniwâw mitoni kî-mêskocipayiw ispîhk Kisê-Pîsim 22, 2016. Ki wîcihitinân, mîna ka-ayânâwaw âhkamî sîtoskâkêwin.”</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"bb8b2655-90a7-4955-b781-ad4667676918\" href=\"/en/news/statements/2022/01/22/statement-prime-minister-sixth-anniversary-shootings-la-loche\">Statement by the Prime Minister on the sixth anniversary of the shootings in La Loche, Saskatchewan</a></li>\n</ul></div>\n      "
}