{
  "path": "/en/news/statements/2018/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p><p>“International Youth Day is a time to celebrate our young people and their limitless potential. They are leaders, change makers, and ambassadors for a brighter, more peaceful world. Together with their energy, creativity, and passion, they have the ability to transform our communities and our country for the better.</p><p>“This year’s theme, <a href=\"https://www.un.org/development/desa/youth/international-youth-day-2018.html\">Safe Spaces for Youth</a>, encourages the development of safe spaces where young people can come together and actively participate in our societies without fear or intimidation. When young people have access to safe and welcoming spaces, they are more engaged in their communities. They have greater opportunities to create change, make lasting connections, and find solutions to the challenges we face.</p><p>“It is vital we give young people the space to have their say and to take part in the decisions we make. Earlier this summer, I was proud to welcome the <a href=\"/en/news/news-releases/2018/06/13/prime-minister-welcomes-new-members-youth-council\">third cohort of members to my Youth Council</a> and recognize the hard work of the first cohort, as they assume new roles as alumni.</p><p>“Today, I am also launching a new recruitment campaign to find the next cohort of members to join my Youth Council. I encourage young Canadians to apply.</p><p>“As Minister of Youth, I believe everyone has a role to play in supporting Canada’s young people and empowering them to make our country an even better place to live. With new projects and initiatives such as the <a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html\">Canada Service Corps</a>, Canada’s first-ever <a href=\"/en/news/news-releases/2018/02/13/young-canadians-guide-country’s-first-youth-policy\">youth policy</a>, and <a href=\"/en/news/news-releases/2018/06/27/helping-40000-young-people-canada-gain-skills-and-find-jobs\">new job opportunities for youth</a>, we are ensuring more young Canadians get the skills and experience they need to succeed.</p><p>“On behalf of the Government of Canada, Sophie and I wish everyone celebrating a happy and inspiring International Youth Day.”</p></div>\n      "
}