{
  "path": "/en/news/statements/2020/12/10/statement-prime-minister-fifth-anniversary-operation-syrian-refugees",
  "pageTitle": "Statement by the Prime Minister on the fifth anniversary of Operation Syrian Refugees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fifth anniversary of Operation Syrian Refugees:</p>\n\n<p>“Five years ago today, Canadians prepared to welcome the first Syrian refugees to Canada as part of Operation Syrian Refugees. As a country, we opened our arms and our hearts to people and families fleeing conflict, insecurity, and persecution.</p>\n\n<p>“In the years since, the Government of Canada has worked closely with Canadians, the business community, and civil society to resettle nearly 73,000&nbsp;Syrian refugees in more than 350 communities across the country. And because of the generosity of others, these refugees found a safe place to call home, and a chance to create a better future for themselves and their families.</p>\n\n<p>“Five years ago, I was fortunate to personally greet a number of Syrian refugees as they arrived at Pearson International Airport in Toronto. Since then, many have learned English and French, some have become successful students, and others <a href=\"https://www.youtube.com/watch?v=nXIuOaswo5w&amp;feature=youtu.be\">are now Canadian citizens</a>. New business owners and entrepreneurs have emerged, and countless more are already giving back to their communities. As the conflict has persisted for close to a decade, the Government of Canada will continue to provide humanitarian support and international protection for people fleeing Syria, as well as assist them through resettlement.</p>\n\n<p>“Throughout the global COVID-19 pandemic, we have seen first-hand how critical the work of immigrants is to our country, especially in our health and long-term care systems. As we make every effort to ensure a robust economic recovery and protect Canadians’ health and safety, the Government of Canada will continue to welcome newcomers through immigration and refugee resettlement. To help accelerate the recovery of the Canadian economy, we recently announced responsible increases to immigration in our 2021-2023 Immigration Levels Plan. Immigration and welcoming newcomers has always been core to our economic growth, and we must remain committed to that and our humanitarian tradition of welcoming those who are forced to leave their homes – because it’s who we are as a country.</p>\n\n<p>“Together, with our international partners, we must also find ways to continue to protect refugees fleeing war or violence, and those persecuted for their faith, political affiliation, or sexual orientation. By working as a global community, we can create long-term solutions for the many challenges faced by displaced people and refugees throughout the world.</p>\n\n<p>“Canadians have always been guided by our commitment to diversity and inclusion. We believe in helping our neighbours, extending a hand to those who need it, and tackling the greatest challenges together. By welcoming tens of thousands of Syrian refugees since the start of Operation Syrian Refugees, we have all reaffirmed those fundamental values over the past five years – and going forward, we will continue to lead with compassion and do our part to build a safer, fairer, and more equal world.”</p></div>\n      "
}