{
  "path": "/en/news/statements/2021/03/21/statement-prime-minister-international-day-elimination-racial",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Racial Discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Racial Discrimination:</p>\n\n<p>“Far too many people here in Canada and around the world, continue to face discrimination, hate, and human rights violations simply because of the colour of their skin, their background, or their faith. Today, on the <a href=\"https://www.un.org/en/observances/end-racism-day\">International Day for the Elimination of Racial Discrimination</a>, we reaffirm our commitment to end racism and racial discrimination in all its forms, and we reflect on the work left to do to build a fairer and more equitable country.</p>\n\n<p>“This past year, thousands of Canadians across the country took to the streets to peacefully demand an end to anti-Black racism, systemic discrimination, and white supremacy. Their sadness, frustration, and anger were as clear as their calls for justice, equality, and accountability. The lingering COVID-19 pandemic has revealed and further exacerbated social, health, and economic disparities for Indigenous peoples, Black Canadians, and other racialized and religious minority Canadians and their communities. The pandemic has also propelled Anti-Asian hate and discrimination, both here at home and around the world. This crisis is a stark reminder that racism and systemic discrimination disrupt lives, undermine people’s health and wellbeing, and are key drivers of inequality. This is unacceptable and needs to stop. We know we must act now to address these complex and long-standing issues. &nbsp;</p>\n\n<p>“That is why we have renewed our commitment to building a more inclusive and equal country, where everyone’s rights and freedoms are respected. We are working with First Nations, Inuit, and the Métis to renew our relationship, based on the recognition of rights and treaties, respect, and collaboration. This includes working in partnership with provinces and territories, health system partners, and educational institutions to address anti-Indigenous racism in our health care systems. Cultural safety, recognizing Indigenous knowledge, and supporting Indigenous-led health services are three strategies the Government of Canada views as central to achieving the goal of eliminating anti-Indigenous racism in health care.</p>\n\n<p>“We introduced legislation to advance the implementation of the <a href=\"https://www.justice.gc.ca/eng/declaration/index.html\">United Nations Declaration on the Rights of Indigenous Peoples</a>. We are also responding to the recommendations from a number of key reports, including the Final Report of the Truth and Reconciliation Commission and the Final Report of the National Inquiry into Missing and Murdered Indigenous Women and Girls. Working in collaboration with partners, including Indigenous youth, will continue to be our priority as we move forward with this work.</p>\n\n<p>“As part of our commitment to end anti-Black racism and systemic discrimination, we are also working closely with Black-led organizations to advance equitable access to opportunities and supports. Last year, we launched Canada’s first-ever <a href=\"https://www.ic.gc.ca/eic/site/150.nsf/eng/home\">Black Entrepreneurship Program</a> to help ensure Black business owners and entrepreneurs receive access to financial support, while helping them recover from the pandemic and grow their businesses. Last month, in order to address the over-incarceration of Indigenous peoples and Black Canadians, we introduced legislation aimed at reforming sentencing practices and promoting diversion from the criminal justice system in cases where that can be done safely. We have also supported anti-racism programming and bolstered the collection of race-based data at Statistics Canada to better assist in making evidence-based decisions, which will help fight discrimination.</p>\n\n<p>“While we have made progress toward a more just and equal society, more still needs to be done, and the Government of Canada remains committed to this work. Through <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement.html\">Canada’s Anti-Racism Strategy</a> and with the support of the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, we will continue to work to eliminate systemic racism in Canada.&nbsp;</p>\n\n<p>On behalf of the Government of Canada, I encourage Canadians to stand up against racism, discrimination, and xenophobia, whenever and wherever they occur. By working together, we can build a fairer, more inclusive, and better Canada for everyone.”</p></div>\n      "
}