{
  "path": "/en/news/news-releases/2021/05/14/prime-minister-announces-apology-internment-italian-canadians-during",
  "pageTitle": "Prime Minister announces apology for the internment of Italian Canadians during the Second World War | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that on May 27, 2021, he will deliver a formal apology in the House of Commons for the internment of Italian Canadians during the Second World War.</p>\n\n<p>After Italy declared war against Canada in 1940, the Government of Canada interned hundreds of people of Italian heritage. In addition, tens of thousands of Italian Canadians were declared “enemy aliens”, and faced pain, hardship, and discrimination. The government’s policy went against the fundamental values Canada was fighting for during the Second World War.</p>\n\n<p>The Prime Minister shared the announcement during a virtual meeting with some of the family members of Italian Canadians who were interned during the war.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“For far too long, the Italian Canadian community has carried the weight of the unjust policy of internment during the Second World War. Later this month, I will deliver a formal apology to acknowledge the wrongs that were done to the Italian community in Canada during the Second World War, and honour the families of those who were interned and discriminated against as a result of this historical injustice. Canadians of Italian heritage have made, and continue to make, immense social, economic, and cultural contributions to our country. We cannot undo our past failures, but through this apology we hope to help bring closure to those who were harmed, and ensure the lessons we learned are never forgotten.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote></div>\n      "
}