{
  "path": "/en/news/news-releases/2022/04/20/making-housing-more-affordable-canadians",
  "pageTitle": "Making housing more affordable for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Making life more affordable for Canadian families starts with making housing more affordable. The Government of Canada recognizes that it is becoming increasingly challenging to find a safe and affordable place to live. That’s why Budget 2022 proposes a series of investments to build more houses, help people save for their first home, and curb speculation and unfair practices that drive up housing prices.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted key measures included in <em>Budget 2022: </em><em>A Plan to Grow Our Economy and Make Life More Affordable</em> to improve housing affordability for Canadians.</p>\n\n<p>The measures proposed in Budget 2022 include:</p>\n\n<ul>\n\t<li><strong>Putting Canada on the path to double housing construction over the next decade</strong>, including by investing $4 billion for the launch of a new Housing Accelerator Fund that will help create 100,000 new housing units over the next five years; and providing $1.5 billion to extend the Rapid Housing Initiative and create at least 6,000 additional affordable housing units across Canada.</li>\n\t<li><strong>Helping Canadians buy their first home</strong> by introducing the Tax-Free First Home Savings Account to allow first-time home buyers to save up to $40,000; doubling the First-Time Home Buyers’ Tax Credit to $10,000, providing up to $1,500 in direct support to home buyers; extending the First-Time Home Buyer Incentive to March 31, 2025, to allow first-time home buyers to lower their borrowing costs; and investing $200 million to help develop and scale up rent-to-own projects across Canada.</li>\n\t<li><strong>Curbing unfair practices that drive up the price of housing</strong> by imposing a two-year ban on foreign capital coming into Canada to buy residential real estate; and taking steps to make property flippers pay their fair share.</li>\n\t<li><strong>Protecting home buyers </strong>by working with provinces and territories to develop and implement a Home Buyers’ Bill of Rights and bring forward a national plan to end blind bidding.</li>\n</ul>\n\n<p>Budget 2022 proposes targeted and responsible investments to give all Canadians a safe and affordable place to call home. This is part of our plan to make life more affordable, create jobs and prosperity today, grow the middle class, and build a stronger economic future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Making life more affordable for Canadians starts with addressing housing affordability. All Canadians deserve a safe place to live, raise their families, and build their future. Budget 2022 will put home ownership in reach for more Canadians, while creating jobs and growing the economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Housing is a basic human need but it is also an economic imperative. Our economy is built by people, and people need homes in which to live. Our problem is simply this: Canada does not have enough homes. We need more of them, fast. This budget represents the most ambitious plan that Canada has ever had to solve that fundamental challenge.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Budget 2022 introduces a Multigenerational Home Renovation Tax Credit. This would provide up to $7,500 to Canadians for constructing a secondary suite for a senior or an adult with a disability to move in.</li>\n\t<li>To expand co-op housing in Canada by an estimated additional 6,000 units, Budget 2022 proposes to reallocate $500 million of funding from the National Housing Co-Investment Fund and reallocate an additional $1 billion in loans from the Rental Construction Financing Initiative to support co-op housing projects. This would make it the largest investment toward building new co-op housing in Canada in more than 30 years.</li>\n\t<li>Budget 2022 proposes $150 million over two years, starting in 2022-23, to support affordable housing and related infrastructure in the North.</li>\n\t<li>Budget 2022’s proposed housing measures build on the Government of Canada’s National Housing Strategy (NHS), a 10-year, $72+&nbsp;billion plan that will give more Canadians a place to call home.</li>\n\t<li>Since the creation of the NHS, the Government of Canada has committed over $24.2 billion to support the creation of over 91,000 units and the repair of over 209,000 units, and has provided a more affordable place to live to over 172,000 households. These measures prioritize those in greatest need, including seniors, Indigenous Peoples, people experiencing or at risk of homelessness, and women and children fleeing violence.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget 2022 Backgrounder: Making Housing More Affordable</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2022/home-accueil-en.html\">Budget 2022</a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/progress-on-the-national-housing-strategy\">Progress on the National Housing Strategy</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/consumers/home-buying/first-time-home-buyer-incentive\">First-Time Home Buyer Incentive</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/co-investment-fund\">National Housing Co-Investment Fund</a></li>\n</ul></div>\n      "
}