{
  "path": "/en/news/readouts/2021/11/23/prime-minister-justin-trudeau-meets-president-kosovo-vjosa-osmani-sadriu",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Kosovo Vjosa Osmani-Sadriu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Kosovo, Vjosa Osmani‑Sadriu, to discuss the relationship between their two countries and current global issues.</p>\n\n<p>Prime Minister Trudeau thanked President Osmani-Sadriu for her participation in the Halifax International Security Forum as well as for awarding the Canadian Armed Forces with the Presidential Military Medal for their more than two decades of service in Kosovo. The Prime Minister reaffirmed Canada’s strong commitment to Kosovo and support for its full Euro-Atlantic integration. He indicated that Canada continues to advocate for the recognition of Kosovo and its membership in international organizations.&nbsp;The President thanked Canada for its position and expressed hope for Kosovo’s future.</p>\n\n<p>The two leaders discussed their shared priorities, including women’s empowerment, environmental protection and climate change, and respect for diversity, rule of law, and democracy. President Osmani-Sadriu also discussed internal reforms in Kosovo, highlighting anti-corruption initiatives and economic growth as her key priorities. The two leaders agreed to explore mutually beneficial economic opportunities as both countries work to create green economies.</p>\n\n<p>The Prime Minister and President spoke about the stability of the Western Balkans that is currently threatened, and exchanged views on resolving local tensions through strategic dialogue and cooperation.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/croatia-croatie/bilateral_relations_bilaterales/canada_kosovo.aspx?lang=eng\">Canada-Kosovo Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2021/11/the-13th-annual-halifax-international-security-forum-concludes.html\">The 13th Annual Halifax International Security Forum Concludes</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-kobold.html\">Operation KOBOLD</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2021/10/defence-minister-sajjan-participates-in-nato-defence-ministers-meeting.html\">Defence Minister Sajjan participates in NATO Defence Ministers’ Meeting</a></li>\n</ul></div>\n      "
}