{
  "path": "/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island",
  "pageTitle": "$10 a day child care for families in Prince Edward Island | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every child deserves the best possible start in life, and all parents should have the ability to build both a family and career. Yet, too many families across Canada lack access to affordable, inclusive, and high-quality child care. The global COVID-19 pandemic has also made it clear that without access to child care, too many parents – especially women – cannot fully participate in the workforce.</p>\n\n<p>That is why the Government of Canada has laid out a plan to provide parents in Canada with, on average, $10 a day regulated child care spaces for children under age six by 2025-26. This plan to build a Canada-wide, community-based early learning and child care system will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.&nbsp;</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Prince Edward Island, Dennis King, today announced an agreement that will support an average of $10 a day early learning and child care in the province in three years. PEI is on track to meet this target by the end of 2024, significantly reducing the price of child care for families. Through the agreement, the governments of Canada and Prince Edward Island will work together to improve access to quality, affordable, flexible, and inclusive early learning and child care programs and services. This includes creating 452 new regulated early learning and child care spaces within two years to ensure all families&nbsp;of children under age six can access child care. The federal funding of nearly $121.3 million over the next five years also includes a one time investment of about $3.6 million in 2021-2022 to support the early childhood workforce.</p>\n\n<p>With this funding, Prince Edward Island will see a 50 per cent reduction in average parent fees for children under age 6 in regulated child care by the end of 2022. This agreement will fund critical services, grow a strong and skilled workforce of early childhood educators through initiatives that focus on recruitment, retention, and supporting professional development, and deepen the development of innovative, flexible-hours child care for Island families that work shifts or non-standard hours. The agreement will also support an early learning and child care system that is fully inclusive of children with disabilities and children needing enhanced or individual supports, and ensure all families have equitable access to high-quality, affordable programming.</p>\n\n<p>Since 2015, the government has been helping make life more affordable for families. This includes programs like the Canada Child Benefit, which was annually increased again last week to help families keep up with the costs of living and raising their children.</p>\n\n<p>The time for a Canada-wide early learning and child care system is now. The Government of Canada will continue to work with provinces, territories, and Indigenous partners across the country to make life easier and more affordable for families, grow the middle class, create jobs, help parents – especially mothers – return to the workforce, and give children across the country an equal chance to succeed.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to quality, affordable child care. That is why, from coast to coast to coast, we are laying the foundation for Canada’s first-ever Canada-wide early learning and child care system. Today’s agreement with Prince Edward Island is an important step forward to making $10 a day child care a reality, and delivering much-needed support to families and communities as we build back better from the pandemic.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As a province we are committed to providing affordable, accessible, high-quality early learning and child care opportunities for all Island families. Islanders can expect us to be bold and ambitious in meeting and exceeding the federal targets by achieving an average of $10 a day child care by the end of 2024. Prince Edward Island has been a national leader when it comes to early learning and child care, and this announcement marks an exciting milestone that shows that we will continue to lead the country by supporting Island families from tip to tip.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Dennis King, Premier of Prince Edward Island</footer>\n</blockquote>\n\n<blockquote>\n<p>“Ensuring all Canadians have access to high-quality and affordable early learning and child care is feminist economic policy and smart economic policy. It is critical social infrastructure, over 50 years in the making, which will drive jobs and growth. By working with the Government of Prince Edward Island on implementing the beginning of this historic investment, we will be giving every child in the province the best possible start in life, increasing women’s participation in the workforce, creating jobs, and making life more affordable for young families across Prince Edward Island.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every child deserves the best possible start in life. Our vision for early learning and child care is big and ambitious, but if we tell our own kids to dream big, we need to lead by example. Today’s historic agreement with Prince Edward Island is another important step on the path to ensuring all families have access to high-quality, affordable, and inclusive child care.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s historic investments will have an immediate impact on Island families and, in particular, women who not only make up the majority of our early learning and child care workforce, but also have taken on the primary caregiver role during this pandemic. Our plan for early learning and child care is focused on increasing affordability and accessibility, improving quality, and supporting the growing diversity of our province so that every child has the same opportunity and can have the best possible start in life. I look forward to continuing to work together with Island families, communities, the early childhood sector, and the Government of Canada to make this happen.”</p>\n\n<footer class=\"default\">The Hon. Natalie Jameson, Prince Edward Island’s Minister of Education and Lifelong Learning and Minister responsible for the Status of Women</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Within the next two years, Prince Edward Island will create 452 regulated early learning and child care spaces to ensure all families&nbsp;of children under six years old can access child care.</li>\n\t<li>In addition to the federal contribution, Prince Edward Island currently invests $31,385,010 in early learning and child care annually, including $2,935,000 for pre-kindergarten and over $28,450,010 for the early learning and child care sector.</li>\n\t<li>The governments of Canada and Prince Edward Island will create an Implementation Committee that will monitor progress on early learning and child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>Budget&nbsp;2021 provides new investments to build a high-quality, affordable, flexible, and inclusive early learning and child care system across Canada. These investments total up to $30&nbsp;billion over the next five years, and combined with previous investments announced since 2015, $9.2&nbsp;billion every year thereafter, permanently.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 950 in Prince Edward Island.</li>\n\t<li>In addition to these investments, the Government of Canada is directly supporting parents, no matter how they choose to care for their children, through the Canada Child Benefit (CCB).\n\t<ul>\n\t\t<li>For over five years, the CCB has provided about $25 billion in tax-free support per year to about 3.5 million families, and is now providing families with over $350 more per child than when the program began.</li>\n\t\t<li>In 2021, the government is providing additional temporary support for families with children under the age of six through the CCB young child supplement. This helps Canadian families who are struggling with a range of unpredictable expenses during the pandemic, including temporary child care arrangements.</li>\n\t</ul>\n\t</li>\n\t<li>Investments in early learning and child care will benefit all Canadians. Studies show that for every dollar invested&nbsp;in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n\t<li>To promote greater gender equality at home and in the workplace, the Government of Canada has also introduced the Parental Sharing Benefit. This new measure provides an additional five weeks of Employment Insurance parental benefits when parents – including adoptive and same-sex parents – agree to share parental benefits.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada child benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/news/2021/05/ccb-young-child-supplement-2021.html\">CCB young child supplement, 2021</a></li>\n</ul></div>\n      "
}