{
  "path": "/en/news/readouts/2022/05/12/prime-minister-justin-trudeau-meets-secretary-general-la-francophonie",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Secretary General of La Francophonie Louise Mushikiwabo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ul>\n</ul>\n\n<p>Yesterday, Prime Minister Justin Trudeau met with the Secretary General of La Francophonie, Louise Mushikiwabo, during her visit to Canada to formally establish the Représentation extérieure de l’Organisation internationale de la Francophonie (OIF) pour les Amériques.</p>\n\n<p>The Prime Minister reiterated Canada’s deep commitment to La Francophonie and welcomed the opening on May 10 in Quebec City of this new OIF office, which will contribute to the spread of the French language on our continent while promoting greater collaboration between Canada and the OIF.</p>\n\n<p>The Prime Minister and Secretary General discussed the OIF’s work to strengthen the development of a Francophonie dedicated to promoting the French language and our shared values. Prime Minister Trudeau commended Secretary General Mushikiwabo’s transformation and modernization efforts in order to improve the governance, sound management, transparency, and effectiveness of the OIF. He encouraged the Secretary General to continue with these reforms to ensure their completion.</p>\n\n<p>The two leaders discussed the war in Ukraine, which is an attack on international law, democracy, freedom, and human rights. They expressed concern for the broader global impacts of the war, including its effects on food and energy security, agricultural trade, and supply chains. The Prime Minister stressed the importance of ongoing collaboration with allies and international partners to support Ukrainians and hold Russia accountable for this unjustifiable and unprovoked war.</p>\n\n<p>The Prime Minister noted the growing number of crises occurring in the French-speaking world over the past two years and shared his deep concern over increasing instability and insecurity. In particular, the two leaders discussed the crisis in Haiti, and the Prime Minister stressed the importance of reaching a resolution to the crisis and an inclusive dialogue shaped by and for Haitians.</p>\n\n<p>The Prime Minister also emphasized the importance for the OIF to put its founding values back at the heart of its work, in the face of current geopolitical changes. The Prime Minister and Secretary General discussed the actions taken by the OIF to promote the principles of democracy, human rights, and gender equality. They agreed to continue working together to advance these principles and shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/minister-joly-meets-with-the-secretary-general-of-la-francophonie.html\">Minister Joly meets with the Secretary General of La Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}