{
  "path": "/en/news/readouts/2020/05/14/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their ninth First Ministers’ call&nbsp;with the premiers about the COVID-19 pandemic. The leaders spoke about coordinated actions being taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians and to support workers and businesses.</p>\n\n<p>First Ministers discussed the tremendous importance of testing and contact tracing for any successful restart of the economy, and how the federal government can support provinces and territories in this regard. First Ministers endorsed further federal, provincial, and territorial collaboration to ensure the necessary resources, technology and supplies are in place to expand testing and contact tracing.</p>\n\n<p>First Ministers discussed current restrictions at the Canada-United States border to protect the health of Canadians while allowing for the movement of essential goods and services. The Prime Minister highlighted ongoing close collaboration with the United States and committed to keeping premiers informed on border measures. First Ministers agreed on the need to maintain strong public health measures at the border, in particular&nbsp;as economies start to gradually restart.</p>\n\n<p>First Ministers also discussed personal protective equipment and the ongoing steps they are taking to gradually restart the economy, and confirmed that protecting the health and safety of all Canadians remains the top priority.&nbsp;The Prime Minister raised the importance of municipalities in the gradual reopening across the country.</p>\n\n<p>All First Ministers reaffirmed their commitment to addressing COVID-19 through a Team Canada effort. The Government of Canada continues to take a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states\">Prime Minister announces temporary border agreement with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n</ul></div>\n      "
}