{
  "path": "/en/news/news-releases/2022/11/04/putting-more-money-back-pockets-canadians-today",
  "pageTitle": "Putting more money back in the pockets of Canadians today | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are feeling the rising cost of living. Global inflation is driving up the price of necessities, like groceries and rent, and making it harder for families to make ends meet at the end of the month. Amid economic uncertainty around the world, the Government of Canada will continue to be there for people and build an economy that works for all Canadians. We will continue to support the middle class and people who need it most, when they need it most, by putting more money back in their pockets now.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canadians have started to receive their doubled Goods and Services Tax Credit (GSTC) payment. To help 11 million individuals and families with the rising cost of living, we doubled the GSTC for six months – couples with two children will receive up to an extra $467 and seniors will receive an extra $225 on average.</p>\n\n<p>This is a key part of our plan to make life more affordable for Canadians this year. We are also working to deliver a new Canada Dental Benefit, which would provide parents up to $1,300 per child under 12 over two years, and a one-time top-up to the Canada Housing Benefit of $500 for renters who need it most. From cutting regulated child care fees in half on average by the end of this year, to increasing the Canada Workers Benefit to provide up to an additional $2,400 for modest-income families, to putting an additional $800 in the pockets of full Old Age Security pensioners aged 75 and over, we are delivering real results that are helping Canadians now.</p>\n\n<p>Yesterday, the government released its <em>2022 Fall Economic Statement</em>, a plan to continue building an economy that works for all Canadians. It delivers targeted support to the middle class and people who need it most, moves forward on the government’s comprehensive plan to make housing more affordable, permanently eliminates interest on federal student and apprentice loans, and it lays out an ambitious plan to continue bringing billions of dollars in investment to Canada – in areas like clean power, electric vehicles, and battery manufacturing – to create good middle-class jobs and grow our clean economy.</p>\n\n<p>We will continue to work hard to put more money back in the pockets of people, build an economy that works for all Canadians, and deliver results for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today, we are putting more money back in the pockets of people. The extra money families received today will help them buy groceries, pay the bills, and save for the future. Amid global economic uncertainty, we will continue to be there for people as we build an economy that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, millions of Canadians are receiving their new inflation relief in the form of additional GST Credit payments – right at a time when it is needed. By doubling the GST Credit for six months, we’re delivering on our promise to help families who are struggling with increasing costs, like rising prices at the checkout counter.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Doubling the Goods and Services Tax Credit for six months is part of the Government of Canada’s <a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">plan</a> to make life more affordable for Canadians this year. &nbsp;</li>\n\t<li>As part of this plan, the government also <a href=\"https://www.parl.ca/legisinfo/en/bill/44-1/c-31\">introduced legislation</a> to:\n\t<ul>\n\t\t<li>Provide a Canada Dental Benefit to children under 12 who do not have access to dental insurance, starting this year. Direct payments totalling up to $1,300 per child over the next two years (up to $650 per year) would be provided for dental care services. This is the first stage of the government’s plan to deliver dental coverage for families with income under $90,000, and will allow children under 12 to get the dental care they need while we develop a comprehensive national dental care program.</li>\n\t\t<li>Provide a one-time top-up to the Canada Housing Benefit to deliver $500 to 1.8&nbsp;million Canadian renters who are struggling with the cost of housing. This more than doubles our Budget&nbsp;2022 commitment, reaching twice as many Canadians as initially promised. This new one-time federal benefit will be in addition to the Canada Housing Benefit currently co-funded and delivered by provinces and territories. The federal benefit will be available to applicants with an adjusted net income below $35,000 for families, or below $20,000 for individuals, who pay at least 30 per cent of their income on rent.</li>\n\t</ul>\n\t</li>\n\t<li>In addition, we are already putting more money back in the pockets of Canadians by:\n\t<ul>\n\t\t<li>Enhancing the Canada Workers Benefit to support workers this year, with a couple receiving up to $2,400 more this year, and single workers receiving up to $1,200 more. Most recipients first received this additional support through their 2021 tax refund.</li>\n\t\t<li>Cutting regulated child care fees in half on average for families in Canada by the end of this year.</li>\n\t\t<li>Increasing by 10 per cent the Old Age Security (OAS) pension for seniors 75 years and older, starting in July 2022, providing more than $800 in new support to full pensioners over the first year and increasing benefits for more than three million seniors.</li>\n\t\t<li>Providing more support for students by doubling the Canada Student Grant amount until July 2023 and by waiving interest on Canada Student Loans permanently. An average student loan borrower will save $410 per year as a result of their loan being interest-free.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/09/making-life-more-affordable-doubling-the-goods-and-services-tax-credit-for-sixmonths.html\">Backgrounder: Making Life More Affordable: Doubling the Goods and Services Tax Credit for Six Months</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/09/making-dental-care-more-affordable-the-canada-dental-benefit.html\">Backgrounder: Making Dental Care More Affordable: The Canada Dental Benefit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/09/making-housing-more-affordable-one-time-top-up-to-the-canada-housing-benefit-program.html\">Backgrounder: Making Housing More Affordable: One-time top-up to the Canada Housing Benefit program</a></li>\n\t<li><a href=\"https://can01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fbudget.gc.ca%2Ffes-eea%2F2022%2Fhome-accueil-en.html&amp;data=05%7C01%7CPaul.Parkman%40fin.gc.ca%7C158fa6e2657a42bf41d008dabc26d112%7Cc8d186b6faab43fb98c018a0dfa65ac1%7C0%7C0%7C638029172135310083%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=ZVfKUjpO6ZwqOkQnBiPadxVnJnUxEhr5p%2BTvSvLe%2FFI%3D&amp;reserved=0\"><em>2022 Fall Economic Statement</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/11/making-life-more-affordable.html\">Backgrounder: Making Life More Affordable</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/11/making-housing-more-affordable.html\">Backgrounder: Making Housing More Affordable</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/11/jobs-growth-and-an-economy-that-works-for-everyone.html\">Backgrounder: Jobs, Growth, and an Economy That Works for Everyone</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2022/home-accueil-en.html\"><em>Budget 2022: A Plan to Grow Our Economy and Make Life More Affordable</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/services/affordability-plan.html\">Affordability Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/13/making-life-more-affordable-canadians-year\">Making life more affordable for Canadians this year</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/09/government-of-canada-introduces-legislation-to-make-life-more-affordable-for-canadians.html\">Government of Canada introduces legislation to make life more affordable for Canadians</a></li>\n</ul></div>\n      "
}