{
  "path": "/en/news/statements/2017/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World AIDS Day:</p><p>“On <a href=\"https://www.worldaidsday.org/\">World AIDS Day</a>, we join people in Canada and around the world to show solidarity with people living with HIV, to remember those lost because of the virus, and to unite to end HIV/AIDS for good.</p><p>“Today is a chance to reflect on our global efforts to fight HIV/AIDS, and to celebrate the great strides we have made in prevention, testing, and treatment. It is also a time to honour the people who, over decades and all around the world, fought for the rights of people living with HIV/AIDS and pushed for education, compassion, and care. Now, we must continue to build on their work and end stigma, isolation, and HIV transmission – so that no one has to lose a loved one to this preventable, treatable condition.</p><p>“The first week of December is also Aboriginal AIDS Awareness Week. In Canada, Indigenous Peoples continue to be over-represented in the HIV epidemic, making up more than 10 per cent of all new infections. The Government of Canada is committed to working with Indigenous partners and communities to build supportive environments and culturally appropriate approaches to meeting the needs of Indigenous Peoples in addressing HIV/AIDS.</p><p>“We know that HIV disproportionately affects the world’s poorest and most vulnerable – especially women and girls. Advancing gender equality must be part of the solution. We pledged <a href=\"/en/news/news-releases/2016/09/17/prime-minister-hosts-successful-global-fund-replenishment-conference\">$804 million</a> during the Fifth Replenishment Conference of the Global Fund to fight AIDS, tuberculosis, and malaria. The Conference raised over $12.9 billion in pledges, which will be instrumental in ending this devastating epidemic by 2030. Together, we can make sure people living with HIV/AIDS have access to the treatment, care, and support they need.</p><p>“Together, let’s end it. Let’s unite to end stigma and discrimination, end isolation, and end HIV transmission. Today and every day, let’s stand with people living with HIV – and meet this global challenge together.”</p></div>\n      "
}