{
  "path": "/en/news/news-releases/2022/08/31/prime-minister-announces-changes-ministry",
  "pageTitle": "Prime Minister announces changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the Ministry. These changes follow Minister Filomena Tassi’s request to spend more time in Southern Ontario due to family reasons.</p>\n\n<p><strong>Filomena Tassi</strong>, currently Minister of Public Services and Procurement, becomes Minister responsible for the Federal Economic Development Agency for Southern Ontario (FedDev Ontario). Minister Tassi became Minister of Public Services and Procurement in 2021, after serving as Minister of Seniors, and then Minister of Labour. Under her leadership, Public Services and Procurement Canada played a central role in the government’s response to the pandemic, which continues to include the procurement of COVID-19 booster doses. The department also made progress on a number of important issues, among them modernizing the government’s procurement processes, advancing green procurement to help reach our climate goals, and increasing diversity in government contracts. In her new role, Minister Tassi will ensure the continued strength of FedDev Ontario, in turn, creating good middle-class jobs, driving clean economic growth in the region, and supporting small and medium-sized businesses for the benefit of everyone in Southern Ontario.</p>\n\n<p><strong>Helena Jaczek</strong>, currently Minister responsible for the Federal Economic Development Agency for Southern Ontario, becomes Minister of Public Services and Procurement. As Minister responsible for FedDev Ontario since 2021, Minister Jaczek helped create jobs and economic growth in southern Ontario by championing the delivery of regionally tailored programs and services. In her new role, she will leverage the government’s purchasing power to increase access to economic opportunity for more Canadians while ensuring federal procurement supports Canada’s transition to a clean economy. She will also ensure Canada continues to have all the critical supplies needed to respond to current and future pandemics, bringing experience acquired in the health sector and as a former Ontario Minister of Health and Long-Term Care.</p>\n\n<p>In addition, the Prime Minister announced that changes had been made to the membership of Cabinet committees to coincide with changes to the Ministry.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/cabinet\">Cabinet</a></li>\n\t<li><a href=\"/en/cabinet-committee-mandate-and-membership\">Cabinet Committee Mandate and Membership</a></li>\n</ul></div>\n      "
}