{
  "path": "/en/news/readouts/2022/09/20/prime-minister-justin-trudeau-meets-president-suriname-chandrikapersad",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Suriname Chandrikapersad Santokhi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Suriname, Chandrikapersad Santokhi, on the margins of the 77th Session of the United Nations (UN) General Assembly.</p>\n\n<p>The Prime Minister and the President recognized the need to build strong, resilient, and inclusive post-COVID economies. They also noted the growing ties between their countries in trade and investment, and the importance of responsible natural resource development and climate-smart agriculture.</p>\n\n<p>Prime Minister Trudeau congratulated President Santokhi on becoming Chair of the Caribbean Community (CARICOM). The two leaders discussed the President’s priorities in this role, including collaborating with regional partners to support Haiti’s stability and sustainable development. President Santokhi thanked Canada for bringing together CARICOM leaders and key stakeholders to advance a Haitian-led solution.</p>\n\n<p>The two leaders discussed how Russia’s unjustifiable invasion of Ukraine has undermined the rules-based international order and exacerbated the food and energy security crisis experienced around the world. Prime Minister Trudeau and President Santokhi discussed the importance of delivering principled support for Ukraine and building long-term resiliency to these pressing challenges.</p>\n\n<p>The Prime Minister and the President reaffirmed their shared commitment to advancing climate action and supporting the success of COP27 and COP15, which will take place in Sharm El-Sheikh (Egypt) in November and Montréal in December, respectively. The two leaders also expressed their support for broader access to concessional financing for the UN Sustainable Development Goals (SDGs), including on climate change.</p>\n\n<p>Prime Minister Trudeau and President Santokhi looked forward to making progress on shared priorities and meeting again soon.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/canada_suriname.aspx?lang=eng\">Canada-Suriname Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada-Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/17/prime-minister-attend-united-nations-general-assembly-new-york\">Prime Minister to attend United Nations General Assembly in New York</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN conference on biodiversity: COP15 in Montréal</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n</ul></div>\n      "
}