{
  "path": "/en/news/news-releases/2016/02/08/prime-minister-sets-new-course-address-crises-iraq-and-syria-and",
  "pageTitle": "Prime Minister sets new course to address crises in Iraq and Syria and impacts on the region | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau today announced Canada’s new policy to address the ongoing crises in Iraq and Syria and the impact they are having on the surrounding region. It will make a meaningful contribution to the Global Coalition’s fight against the Islamic State of Iraq and the Levant (ISIL), while strengthening the ability of regional governments and local authorities to defend themselves, and rebuild over the long-term.</p>\n<p>It is a whole of government approach that enlists several federal departments to work closely together to enhance security and stability, provide vital humanitarian assistance, and help partners deliver social services, rebuild infrastructure and good governance.</p>\n<p>On the security front, Canada looked at how the Canadian Armed Forces (CAF) could best contribute in the fight against ISIL in the region within the Global Coalition. In keeping with the mandate the government received from Canadians last fall, the government will focus on training and advising local security forces to take their fight directly to ISIL.</p>\n<p>To this end, additional military resources will be dedicated to supporting Coalition partners at various headquarters and to training, advising and assisting Iraqi security forces in their efforts to degrade and defeat ISIL. While Canada will cease air strike operations no later than February 22, 2016, aerial refueling and surveillance activities will continue. As well, stabilization and counter-terrorism measures and chemical, biological, radiological and nuclear security programming in the region will be enhanced</p>\n<p>To help address the protracted and tragic crises in the region, Canada will focus on meeting the basic needs of those most impacted by the conflicts in Iraq and Syria, including refugees who have fled to neighbouring countries. We will also work with international partners to build local capacity in communities and countries hosting large numbers of refugees, such as Lebanon and Jordan. Activities will include helping partners: provide education, healthcare and sanitation; maintain and repair infrastructure; promote employment and economic growth; and foster good governance.</p>\n<p>Canada must do more to help find a diplomatic solution to the crises in Syria and Iraq. An enhanced presence on the ground will allow Canada to increase its engagement with local and international partners and participate more actively in multilateral efforts to resolve the crises and restore stability in the region.</p>\n<p>The Government of Canada will contribute more than $1.6 billion over the next three years towards its new approach to security, stabilization, humanitarian and development assistance in response to the crises in Iraq and Syria, and their impact on Jordan and Lebanon.</p>\n<p><strong>Quotes</strong></p>\n<p>“Our new policy in Iraq, Syria and the surrounding region reflects what Canada is all about: defending our interests alongside our allies, and working constructively with local partners to build real solutions that will last. We will work with allies to defeat ISIL and the terrorist threat it represents. At the same time, we will help address the needs of millions of vulnerable people while helping lay the foundations for improved governance, economic growth and longer-term stability.”<br>- <em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Our new approach to Iraq, Syria and the surrounding region will be challenging and dangerous at times. There will be lessons learned as we adapt to changing circumstances on the ground. I am confident that we are up to these challenges and that we will show the world all that Canada can accomplish in a crisis situation.”<br>- <em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/02/08/addressing-crises-iraq-and-syria-and-impacts-region-helping-those\">Helping Those Most Affected</a></li>\n<li><a href=\"/en/news/backgrounders/2016/02/08/canada’s-new-approach-addressing-ongoing-crises-iraq-and-syria-and\">Promoting Security and Stability</a></li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/development-developpement/humanitarian_response-situations_crises/syria-syrie.aspx?lang=eng\">Canada’s Response to the Conflict in Syria</a></li>\n<li><a href=\"http://international.gc.ca/world-monde/security-securite/isis-eiis/index.aspx?lang=eng\">Countering ISIL</a></li>\n<li><a href=\"http://www.forces.gc.ca/en/operations-abroad-current/op-impact.page\">Operation IMPACT</a></li>\n</ul></div>\n      "
}