{
  "path": "/en/news/statements/2018/10/10/statement-prime-minister-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister for World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Mental Health Day:</p><p>“Mental health matters. <a href=\"http://www.who.int/mental_health/world-mental-health-day/2018/en/\">World Mental Health Day</a> is a chance to continue the conversation about the important role mental health plays in our lives. We can all make a difference, fight stigma, and help to make sure everyone has access to the care they need.</p><p>“Mental health challenges impact us all – whether in our own lives or those of our loved ones, in our workplaces or in our communities. There is no shame in struggling with a mental health issue – and by talking openly and honestly, we can help people around us reach out and seek the help they need.</p><p>“This year’s theme, ‘Young people and mental health in a changing world,’ shines a light on the experiences of young people in Canada and beyond. Global issues, social media and the internet, and a rapidly evolving world, have given rise to new challenges to young people’s mental health. Those who face discrimination – Indigenous young people, LGBTQ2 young people, and others – often deal with particular difficulties and greater obstacles to getting the care they need. We need to make sure young people have the right tools and resources to value themselves, find support, and be there for each other.</p><p>“The Government of Canada is working hard to make sure everyone can get quality support in a timely way. We are providing $11 billion over 10 years to provincial and territorial governments to support home and community care, as well as mental health and addictions services. We are also taking action through a compassionate and collaborative approach to addressing substance use, including the opioid crisis. That means helping communities respond to urgent public health needs, and working together to protect the health and safety of Canadians.</p><p>“Today, Canada is also taking part in the first ever Global Ministerial Mental Health Summit – a chance to share successes and lessons learned with others, as we work to address mental health challenges affecting people everywhere.</p><p>“As my mother, a proud advocate for mental health, once said, ‘It’s about taking steady baby steps toward being well.’ Today, and every day, I encourage Canadians to find small ways of being there for themselves and for the people around them. By coming together, we can break down stigma, help others feel supported, and build a healthier, more compassionate society for everyone.”</p></div>\n      "
}