{
  "path": "/en/news/news-releases/2017/06/27/prime-minister-announces-new-ambassador-climate-change",
  "pageTitle": "Prime Minister announces new Ambassador for Climate Change | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Strong action is needed now more than ever to tackle climate change, protect our environment and generate the long-term economic development that will grow the middle class and support a sustainable, clean growth economy.</p><p>The Prime Minister, Justin Trudeau, today announced that Jennifer MacIntyre has been appointed Canada’s new Ambassador for Climate Change, effective immediately. Ms. MacIntyre will work with international stakeholders to advance Canada’s clean growth and climate change priorities on the world stage, including the successful implementation of the Paris Agreement.</p><p>Ms. MacIntyre will provide advice to the Minister of the Environment, the Minister of Foreign Affairs, the Minister of International Development and the Minister of International Trade on mainstreaming climate change considerations in Canada's international priorities, and reinforcing Canada’s work with other countries on innovative climate solutions.</p><p>Building stronger international partnerships and global networks that support Canada’s clean technology sector are just two ways that Canada is taking a global leadership role on clean growth and climate change.</p><h2>Quote</h2><blockquote><p>“Climate change is everyone’s challenge, and our children’s future depends on how quickly and seriously we tackle it. Canada’s new Ambassador for Climate Change, Jennifer MacIntyre, is an outstanding candidate who will be at the forefront of the Government’s efforts to protect our clean air and water, curb greenhouse gas emissions, and build a cleaner, more innovative economy.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Ms. MacIntyre will be the first woman to serve as Canada’s Climate Change Ambassador. The Ambassador’s office is located at Environment and Climate Change Canada.</li><li>Canada has previously appointed four Climate Change Ambassadors, the most recent one in 2012.</li><li>In December 2016, Canada released the <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a> to reduce greenhouse gas emissions and enable sustainable economic growth.</li><li>In 2014, Canada's clean and sustainable technology industry employed over 55,600 people in almost 800 technology companies in all regions of the country. Most of these companies are small and medium-sized enterprises. Total revenues from this industry reached nearly $12 billion.</li><li>According to the World Bank, the Paris Agreement will help open up nearly $23&nbsp;trillion in new opportunities for climate-smart investments in emerging markets, between now and 2030.</li><li>Canada has committed $2.65 billion to international climate finance to support a wide range of programs and initiatives that will help developing countries mitigate and build resilience to the impacts of climate change, deploy clean energy technology, and manage natural resources sustainably.</li></ul><h2>Related product</h2><ul><li><a href=\"/en/news/backgrounders/2017/06/27/biographical-notes-–-jennifer-macintyre-–-canada’s-ambassador-climate\">Biographical Notes - Jennifer MacIntyre</a></li></ul></div>\n      "
}