{
  "path": "/en/news/readouts/2022/06/28/prime-minister-justin-trudeau-meets-prime-minister-india-narendra-modi",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of India Narendra Modi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of India, Narendra Modi, on the margins of the G7 Summit.</p>\n\n<p>The leaders welcomed the growing trade relationship between Canada and India, as well as the longstanding people-to-people ties between the two countries.&nbsp;The prime ministers also discussed cooperation on climate change and the environment, the development of renewable energy sources, the global response to the COVID-19 pandemic, and in the free, open, and inclusive Indo-Pacific region.</p>\n\n<p>Prime Minister Trudeau welcomed the opportunity to engage with Prime Minister Modi and the leaders of other G7 partner countries. The two leaders exchanged views on pressing issues discussed at the G7, including the pandemic response, resilient democracies, and food security. They also discussed Russia’s invasion of Ukraine.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Modi discussed opportunities for enhanced cooperation between Canada and India, both bilaterally and at the G20.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/india-inde/relations.aspx?lang=eng\">Canada-India relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2022/06/canada-and-india-sign-memorandum-of-understanding-to-establish-stronger-cooperation-on-environmental-protection-and-climate-action.html\">Canada and India sign Memorandum of Understanding to establish stronger cooperation on environmental protection and climate action</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}