{
  "path": "/en/news/statements/2021/12/26/statement-prime-minister-death-desmond-tutu",
  "pageTitle": "Statement by the Prime Minister on the death of Desmond Tutu | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Archbishop Emeritus Desmond Mpilo Tutu:</p>\n\n<p>“I was deeply saddened to learn of the death of Archbishop Desmond Tutu, one of the world’s leading human rights activists and strongest moral voices.</p>\n\n<p>“Throughout a remarkable life, Archbishop Tutu used his vision of interconnectedness, equality, and forgiveness to advocate for a better, more peaceful world. While he was best known for his non-violent opposition to apartheid in South Africa and work to heal divisions as the ‘Rainbow Nation’ moved toward democracy, his actions resonated everywhere, especially with oppressed peoples and their struggle for freedom and equality.</p>\n\n<p>“Archbishop Tutu worked to understand and combat HIV/AIDS and tuberculosis, and campaigned against homophobia and transphobia. He fought to eradicate poverty, child marriage and racism, and supported the right to die with dignity. He was a strong advocate for gender equality, championed action against climate change, and devoted much of his time encouraging young people to be more engaged in creating a peaceful world. Archbishop Tutu had also visited Canada as part of his efforts to support our country’s ongoing journey of truth and reconciliation with Indigenous peoples.</p>\n\n<p>“Over the years, he received numerous honorary doctorates and awards, including the Nobel Peace Prize in 1984 for his extraordinary contributions to ending apartheid. He was also awarded the Albert Schweitzer Prize for Humanitarianism in 1986, the Pacem in Terris Peace and Freedom Award in 1987, the Sydney Peace Prize in 1999, the Gandhi Peace Prize in 2007, and the Presidential Medal of Freedom in 2009.</p>\n\n<p>“On behalf of all Canadians, Sophie and I offer our deepest condolences to Archbishop Tutu’s family and friends, and the South African people. His unwavering optimism against great odds, along with his boundless faith in humanity, will continue to inspire us all.”</p></div>\n      "
}