{
  "path": "/en/news/statements/2019/07/15/statement-prime-minister-world-youth-skills-day",
  "pageTitle": "Statement by the Prime Minister on World Youth Skills Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Youth Skills Day:</p>\n\n<p>“Young people around the world are more engaged and connected than ever. They are standing up, taking action, and using their voices to challenge the status quo and push for positive change. From climate change to gender equality to unemployment, the issues that matter to them are the ones we need to act on to build a fairer, more sustainable world.</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/youthskillsday/index.shtml\">World Youth Skills Day</a>, we look at what must be done to improve access to education and skills training for young people so they can achieve their goals. Too many young people around the world – especially women and girls – face barriers to gaining the skills and experiences they need to make their vision of the future a reality.</p>\n\n<p>“The Government of Canada is working with international partners to break down these barriers. Together, we helped deliver a <a href=\"https://pm.gc.ca/eng/news/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and-girls-crisis\">historic investment</a> in education for women and girls in conflict and crisis situations, and welcomed <a href=\"https://pm.gc.ca/eng/news/2018/09/26/prime-minister-concludes-successful-week-united-nations-general-assembly\">additional contributions</a> to help developing countries give every child access to quality education and modern skills training.</p>\n\n<p>“Guided by young Canadians, we have also taken action here at home to make it easier for young people to reach their full potential. This year, we launched <a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada’s first-ever youth policy</a>, with a focus on innovation and skills. The policy is a government-wide approach that reflects the values and priorities of young people, gives them a voice in decision-making, and creates more opportunities for them to build a stronger and more inclusive Canada.</p>\n\n<p>“In Budget 2019, we increased funding for initiatives like the <a href=\"https://www.canada.ca/en/services/youth/canada-service-corps.html?utm_campaign=CanadaServiceCorps&amp;utm_source=SocialMedia_Print_Poster&amp;utm_medium=VanityUrl&amp;utm_term=en&amp;utm_content=canada-ca_canada-service-corps\">Canada Service Corps</a> and launched the modernized <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a> to help young Canadians gain the experience and skills they need to pursue the careers of their choice. Budget 2019 also includes support for programs like <a href=\"https://www.ic.gc.ca/eic/site/121.nsf/eng/home\">CanCode</a> and <a href=\"http://asc-csa.gc.ca/eng/resources-young/junior-astronauts/default.asp\">Junior Astronauts</a>, which will give students more chances to learn about STEM and get prepared for today’s ever-changing job market.</p>\n\n<p>“As Prime Minister and Minister of Youth, I have seen first-hand the passion, creativity, and determination that drives young people across this country and around the globe. They are the leaders of today. Our government will keep fighting for young people – and with young people – to build a better future.”</p></div>\n      "
}