{
  "path": "/en/news/readouts/2021/05/19/prime-minister-justin-trudeau-speaks-prime-minister-vietnam-pham-minh",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Vietnam Pham Minh Chinh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Vietnam, Pham Minh Chinh.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Chinh on becoming Vietnam’s Prime Minister and welcomed the growing strength and breadth of the relationship between the two countries. Both leaders looked forward to the 50th anniversary of diplomatic relations in 2023.</p>\n\n<p>The prime ministers discussed the important role that the Comprehensive and Progressive Agreement for Trans-Pacific Partnership has played in expanding trade. Prime Minister Trudeau thanked Vietnam for its support of deeper engagement between Canada and the Association of Southeast Asian Nations (ASEAN), including steps towards a Canada-ASEAN free trade agreement.</p>\n\n<p>The leaders discussed the experiences of the two countries in combatting the COVID-19 pandemic and the importance of equitable access to vaccines to ensure a speedy global recovery.</p>\n\n<p>On regional issues, the two prime ministers agreed on the importance of upholding international law and the need for strong multilateral leadership. Prime Minister Trudeau thanked Vietnam for its positive voice within ASEAN and as a non-permanent member of the United Nations Security Council.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/vietnam/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Vietnam Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new\">Prime Minister announces additional support for equitable access to new COVID-19 medical solutions</a></li>\n</ul></div>\n      "
}