{
  "path": "/en/news/statements/2015/12/12/statement-prime-minister-canada-successful-conclusion-paris-climate",
  "pageTitle": "Statement by the Prime Minister of Canada on successful conclusion of Paris Climate Conference | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on the successful conclusion of the Paris Climate Conference:</p>\n<p>“The world gathered in Paris to fight climate change and its devastating impacts on our earth, our health, our economy, and our very way of life. We also gathered with a common vision to leave a sustainable planet for our children and grand children.</p>\n<p>“I am very pleased that Canada and 194 other countries were able to reach a historic, ambitious, and balanced agreement to fight climate change. Together with our international partners, we agreed to strengthen the global response to limit global average temperature rise to well below 2 degrees Celsius as well as pursue efforts to limit the increase to 1.5 degrees.</p>\n<p>“Canadians can be proud of the strong and positive role we played during these very important international negotiations to address one of the biggest challenges of our generation. There is much tough work that still needs to be accomplished both at home and around the world to implement the agreement.</p>\n<p>“Here at home I will meet with the Premiers within the next 90 days to work on a plan to meet our international commitments in tackling climate change and transitioning to a low carbon economy. Along with the provinces and territories, we will work with a wide array of stakeholders – and all Canadians – to reduce greenhouse gas emissions, including through carbon pricing. We will move towards a climate resilient economy, and we will invest in public transit, green infrastructure and clean technologies to create new jobs and support our communities. Internationally, we will provide significant support to help developing countries reduce their emissions and deal with the impacts of climate change. &nbsp;</p>\n<p>“Years from now, today may very well be the day our children look back to as the beginning of an ambitious global effort to finally fight climate change. I am proud of the role Canada is playing in reaching this historic and balanced agreement, and I am confident that the world will rise to the challenge of addressing climate change.</p>\n<p>“We will be asking Canadians to take an active part in this critical global effort using their remarkable ingenuity, innovation, and networks. Let’s show the world what a positive forward-looking Canada can do and let’s work together with all countries to find the solutions the planet needs.”</p></div>\n      "
}