{
  "path": "/en/news/news-releases/2019/07/24/prime-minister-announces-members-new-national-security-and",
  "pageTitle": "Prime Minister announces members of the new National Security and Intelligence Review Agency | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Our security and intelligence communities must keep pace with evolving threats to the safety and security of Canadians, and they must do so in a way that safeguards our rights and freedoms and the people's trust in how the government works.</p>\n\n<p>That is why the Prime Minister, Justin Trudeau, today announced the members of the new National Security and Intelligence Review Agency (NSIRA).</p>\n\n<p>The NSIRA has the authority to review any activity carried out by the Canadian Security Intelligence Service or the Communications Security Establishment, and any national security or intelligence-related activity carried out by federal departments and agencies. To fulfill its expanded mandate, the NSIRA will have full access to all information held by the Government of Canada, including classified and sensitive information, with the sole exception of information that is subject to the confidence of the Queen’s Privy Council for Canada.</p>\n\n<p>The NSIRA will work to ensure that Canada's national security agencies are complying with the law and that their actions are reasonable and necessary. It will have full and independent authority to determine what government activities to review, and be able to hear public complaints related to the activities of Canada’s security and intelligence agencies.</p>\n\n<p>To promote transparency, the NSIRA will present annual reports to the Prime Minister on its activities, which will also be tabled in the House of Commons and the Senate.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We have modernized our security and intelligence agencies to ensure we continue to keep our country and all Canadians safe and secure. The members of the new National Security and Intelligence Review Agency will play an important role protecting Canadians and their rights and freedoms, while keeping our country’s national security and intelligence agencies accountable to the citizens they protect.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new members of the NSIRA, appointed on the advice of the Prime Minister, are:\n\t<ul>\n\t\t<li>Murray Rankin, Q.C. (Chair)</li>\n\t\t<li>Craig Forcese</li>\n\t</ul>\n\t</li>\n\t<li>The four remaining members are past members of the Security Intelligence Review Committee, who will continue to serve for the remainder of their original terms. These members are:\n\t<ul>\n\t\t<li>The Honourable Pierre Blais, P.C.</li>\n\t\t<li>The Honourable L. Yves Fortier, P.C., C.C., O.Q., Q.C.</li>\n\t\t<li>The Honourable Dr. Ian Holloway, P.C., C.D., Q.C.</li>\n\t\t<li>The Honourable Marie-Lucie Morin, P.C., C.M.</li>\n\t</ul>\n\t</li>\n\t<li>The NSIRA assumes the review and complaints functions of the Security Intelligence Review Committee and the former Office of the Communications Security Establishment Commissioner. The NSIRA will also hear certain complaints regarding the Royal Canadian Mounted Police.</li>\n\t<li>The NSIRA will complement the important work of the National Security and Intelligence Committee of Parliamentarians. Together, they will provide comprehensive scrutiny of Canada's national security and intelligence activities.</li>\n\t<li>The NSIRA was created under the <em>National Security and Intelligence Review Agency Act</em>, which received Royal Assent on June 21, 2019.</li>\n\t<li>The NSIRA will review activities undertaken by the Canadian Security Intelligence Service, the Communications Security Establishment, and national security or intelligence related activities of the Royal Canadian Mounted Police, the Canada Border Services Agency, the Department of National Defence, Global Affairs Canada, the Department of Justice, and others as needed.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/07/24/murray-rankin-qc\">Murray Rankin, Q.C.</a></li>\n\t<li><a href=\"/en/news/backgrounders/2019/07/24/craig-forcese\">Craig Forcese</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/services/defence/nationalsecurity/our-security-our-rights/nsira-01.html\">National Security and Intelligence Review Agency</a></li>\n</ul></div>\n      "
}