{
  "path": "/en/news/statements/2020/11/05/statement-prime-minister-veterans-week",
  "pageTitle": "Statement by the Prime Minister on Veterans’ Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Veterans’ Week, which runs from November 5 to 11, 2020:</p>\n\n<p>“Today, as we mark the beginning of <a href=\"https://www.veterans.gc.ca/eng/remembrance/get-involved/veterans-week\">Veterans’ Week</a>, we honour those who have served, and continue to serve, for our country. We thank the hundreds of thousands of Canadian veterans who have fought and risked everything to secure a better future for Canada and the world.</p>\n\n<p>“This year, we marked the 75th anniversary of the end of the Second World War. Over six years, more than one million brave Canadians and Newfoundlanders served in uniform around the world – from Normandy, to Amsterdam, to Sicily, to Hong Kong. More than 45,000 gave their lives, and another 55,000 were wounded, to protect our Allies and defend the values and freedoms we cherish.</p>\n\n<p>“In the decades that followed, Canadians continued to answer the call and prove their strength and resilience. They defended against enemy forces in Kapyong, protected civilians in Sarajevo, braved insurgent attacks in Kandahar, supported our Allies in Riga, and participated in peacekeeping missions in Port-au-Prince and Kigali.</p>\n\n<p>“This week is an opportunity to hear their stories, and offer our gratitude for their extraordinary service to our great country.</p>\n\n<p>“We will always be indebted to our veterans for all that they have sacrificed, and the Government of Canada will continue to be there for them. Since 2016, we have invested over $10 billion to improve the well-being of our veterans and their families, including improved benefits and services, more help with their transition to post-service life, and increased mental health supports.</p>\n\n<p>“This year, as we take steps to protect ourselves and our communities from the global COVID-19 pandemic, we will mark Veterans’ Week and Remembrance Day a bit differently. I encourage all Canadians to check out the <a href=\"https://www.facebook.com/CanadaRemembers\">online commemorations</a>, to share their stories, photos, and videos on social media using #CanadaRemembers, and to wear a poppy – along with a mask – when you do go out. To those who have sacrificed so we may be at peace: we are forever thankful.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}