{
  "path": "/en/news/news-releases/2016/09/13/prime-minister-lead-canadian-delegation-united-nations-general",
  "pageTitle": "Prime Minister to lead Canadian delegation to United Nations General Assembly in New York | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City, from September 19 to 20, to lead Canada’s delegation to the 71<sup>st</sup> Session of the United Nations General Assembly (UNGA).</p>\n<p>The Government of Canada is committed to redefining its place in the world and promoting core Canadian values like diversity and inclusion, gender equality, and respect for peace worldwide.</p>\n<p>At the UNGA, the Prime Minister will advocate for greater global leadership to address the refugee and migrant crisis, reiterate Canada’s intention to once more play a major role in peacekeeping and conflict prevention efforts, and encourage countries to follow through on the Paris Agreement on Climate Change.</p>\n<p>The Prime Minister will take part in the Refugee and Migration Summit, hosted by UN Secretary-General Ban Ki-moon, as well as co-host U.S. President Barack Obama’s Leaders’ Summit on Refugees.</p>\n<p>While in New York, the Prime Minister and the Canadian delegation will also promote diversity, human rights, the need for gender equality, and efforts to achieve the 2030 Agenda for Sustainable Development.</p>\n<p>Canada looks forward to working with the UN to build a safer, more prosperous world – one where the middle class, and those working hard to join it, have real and fair opportunities to get ahead.</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada is committed to making meaningful contributions to solving important global challenges, such as climate change, international peace and security, and refugees and migration. We are already doing more to help build a cleaner, safer, and more prosperous world. There will be a lot more leadership from Canada in the months and years to come.”<br>—<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“The UN and the essential work it does on behalf of all humanity is once more a priority for Canada, and we will build on our proud history with this vital organization.”<br>—<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Prime Minister will lead the Canadian delegation to UNGA, which will include the Minister of Foreign Affairs, Stéphane Dion, the Minister of International Development and La Francophonie, Marie-Claude Bibeau, the Minister of Environment and Climate Change, Catherine McKenna, and the Minister of Immigration, Refugees and Citizenship, John McCallum.</li>\n<li>At UNGA, Prime Minister Trudeau will address the General Assembly to outline Canada’s vision for a more peaceful, prosperous, and environmentally-friendly world. He will then participate in a high-level meeting, hosted by UN Secretary-General Ban Ki-moon, on addressing large movements of refugees and migrants.</li>\n<li>On the margins of the UNGA, the Prime Minister will also deliver a Keynote address to the 2016 United Nations Private Sector Forum, which will bring together governments, businesses, and civil society to focus on the role of business in advancing development and preventing global instability.</li>\n</ul>\n<p><strong><br>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/genev/mission/canada-UN_nu.aspx?lang=eng\">Canada and the United Nations</a></li>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Working together to flight climate change</a></li>\n</ul></div>\n      "
}