{
  "path": "/en/news/news-releases/2022/04/22/ji-ozhichigaadegin-ge-dedibaigaadegin-daawinan-ge-izhidaawaad",
  "pageTitle": "Ji-ozhichigaadegin ge-dediba’igaadegin daawinan ge-izhidaawaad anishinaabeg Wiinibiigong | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gakina awiya Gaanada Akiing odaa-ayaan ge-izhidaad ge-dediba’ang gaye ge-izhi-minodaad. Ji-mino-bimaadiziwaad gakina awiyag, Gaanada Ogimaa o-da-ozhitoonan giiyaabi niibiwa daawinan omaa akiing ji-dediba’amo-waad igi gaa-andawendamowaad maawach.</p>\n\n<p>Gichi-ogimaa Justin Trudeau o-gii-wiijigaabawitaagoon Manidooba Ogimaan Heather Stefansonan gaye Gichi-ogimaakaan Zhaawan ong Ogimaakaanag Gaa-maamawiiwaad (SCO) Jerry Daniels ji-dibaajimowaad $65 miniyan daswaabik da-miigiwem ji-ozhichigaa-degin gegaa 300 oshki-daawinan ge-dediba’igaade-gin ge-izhidaa-waad anishinaabeg gichi-ayaag gaye gikino’amawaaganag. $35 miniyan daswaabik gaye da-miigiwe Manidooba ogimaawiwin maamaw dash $100 miniyan ji-izhiseg ji-wiiji’iweng. Oshki-daawinan ge-dediba’igaadegin da-ayaawan imaa Hudson’s Bay Company (HBC) gete-gichi-adaawewigamig gaa-badakideg oodenaang Wiinibiigon gaa-gii-miinindwaa SCO owe ji-izichigeng.</p>\n\n<p>Owe izhichigewin “Weweni Bagakinaagon” izhinikaade, ewaabanjigaa deg anishinaabemong – da-ozhichigaade ge-dazhi-zhooniyaakeng gaye ge-izhi-minosewaad anishinaabe inendamoog igi SCO gaa-izhi-dibendaagoziwaad. Aanind ini daawinan da-izhichigaadewan ji-izhi-daawaad gichi-ayaag gaye inawemaaganag imaa gete-maamoochigewigamigong gaye anokiimaaganag imaa ge-anokiiwaad o-da-debinaanaawaa ge-dazhi-ganawenimindwaa oniijaanisiwaa megwaa anokiiwaad. Dagwaagig da-maajitaamagan owe izhichigewin nitam dash ge-izhidaawaad imaa dagwaagig 2025 da-biindigegoziwag.</p>\n\n<p>Ji-miinindwaa ge-izhi-daawaad Anishinaabeg maawach gichi-inendaagwan inendam Gichi-ogimaa Gaanada Akiing. Apii 2015 gii-izhiseg, nin-gii-asaanaan niibiwa zhooniyaa ji-ozhichi-gaadegin waakaa’iganan gaye ji-wawezhichigaadegin ishkoniganing miziwe omaa akiing. Gaye dash Zhooniiyaa 2022 ikidoomagan awashime $4 biniyan daswaabik oshki-zhooniyaa da-asaa ji-ayaagin ge-dediba’igaadegin daawinan ge-izhidaawaad Anishinaabeg. Giiyaabi nin-ga-wiidanokiimaanaanig anishinaabeg dazhiikewining omaa akiing ji-gashkitoowaad ji-debinamowaad ge-izhidaawaad ge-onizhishing weweni ji-bimaadiziwaad.</p>\n\n<h2>Ikidowinan</h2>\n\n<blockquote>\n<p>“Gakina awiya odaa-gashkitoon ji-dediba’ang daawin ge-izhidaad. Gii-aanjichigaadeg ge-inwaadeg iwe gete-maamoochigewigamig oodenaang omaa Wiinibiigong, Zhaawano-ogimaakaanag Maamawi-izhichigewin wiiji’iwewag ji-ganawenjigaadeg iwe gete-waakaa’igan gaye dash ji-ozhichigaadegin gegaa 300 daawinan ge-izhi-daawaad Anishinaabeg Zhaawanong Anishinaabeg Maanidooba gaa-onjiiwaad.”</p>\n\n<footer class=\"default\">Gichi-Ogimaa Gaanada Akiing Justin Trudeau</footer>\n</blockquote>\n\n<blockquote>\n<p>“Maanidooba ogimaawiwin gichi-inendamoog ewiijitwaawaad owe izhichigewin, e-wiidookawaawaad ini SCO gaye Gaanada Aki Anishinaabeg eniigaaniiwaad owe ji-ozhichigaadegin daawinan ge-daawaad Anishinaabeg. Owe gii-aanjichigaadeg iwe gete-maamoochigewigamig ji-ozhichigaadeg wenizhishing da-izhitamawaawag Anishinaabeg ge-danakiiwaad ge-izhidaawaad gaa-oniijaanisiwaad, gaye gichi-ayaag gaye gikino’amawaaganag. Owe da-onji-minosemagan oodenaang gaye ji-onji-minosewaad gakina gaa-ayaawaad omaa Maanidooba akiing.”</p>\n\n<footer class=\"default\">Manidooba Akiing ogimaa Heather Stefanson</footer>\n</blockquote>\n\n<blockquote>\n<p>“Noongom gidakokiimin niigaan ji-waaseyaag ani-akiiwang, amii gaa-gii-izhi-andawendamowaad gidinawemaaganinaanag. Owe izhichigewin izhi-minochigemagan gaye nindizhinaamin ji-ombinigaadeg oodenaang ji-onji-minosewaad gakina awiyag ji-zhooniyaakewaad awiyag gaye.”</p>\n\n<footer class=\"default\">Gichi-ogimaakaan Jerry Daniels, Zhaawanong Ogimaakaanan Maamawichigewin</footer>\n</blockquote>\n\n<blockquote>\n<p>“Gii-maajii-inendamaang aaniin ge-doojigaadeg iwe waakaa’igan, gii-gichi-inendaagwan ji-izhichigaadeg ge-bimaadag gaye ge-gichi-inenjigaadeg imaa oodenaang Wiinibiigong. HBC odinendaanaawaa ji-izhichigaaniwang ge-onjiimagaki imaa Debwewin gaye Maaminonendamowin ji-wiijiiwindwaa Anishinaabeg ani-akiiwang. Ndebwetaamin SCO maawach wiinawaa da-onizhishin ji-dibendamowaad owe waakaa’igan gaye ji-gashkichigaadeg maaminonendamowin.”</p>\n\n<footer class=\"default\">Richard Baker, Ogimaa gaye gaa-niigaaniid, Hudson’s Bay Company</footer>\n</blockquote>\n\n<h2>Gikendaasowinan</h2>\n\n<ul>\n\t<li>Ge-aanjichigaadeg HBC gete-maamoochigewigamig owe da-izhichigaade:\n\t<ul>\n\t\t<li>Daawinan ge-dediba’igaadegin gaye adaawewigamigoonsan gaye ge-gashkichigaadegin awenen igo ji-biindiged;</li>\n\t\t<li>Mashkikiiwigamig gaye ge-izhi-adaawaadegin mashkikiwan gaye ge-izhi-ayaagin anishinaabe mashkikiwan gaye wemitigoozhii-mashkikiwan;</li>\n\t\t<li>Da-ayaamagan gaye ge-izhi-ganawenjigaadegin gete-gegoonan, gaye ge-izhi-waabanda’iweng mazinichiganan, gaye niizh wiisiniiwigamigoon gaye adaaweweigamigoon;</li>\n\t\t<li>Da-izhichigaade gaawiin aapiji waasigan ji-aabadazinog 35% minik eta gaye 81% minik ge-izhiseg ishpimiing.</li>\n\t</ul>\n\t</li>\n\t<li>Manidooba ogimaa da-miigiwe $35 miniiyan daswaabik imaa HBC ji-aanjichigaadeg ji-dazhiikigaadegin niizh izhichigewinan. $10 miniyan daswaabik da-aabaji’aa ji-ozhichigaadegin ini daawinan. $25 miniyan daswaabik dasah imaa Maamoochigewin Waakaa’ige-win Zhooniyaa, Wiinibiig Zhooniyaakewin da-naagajichigemagan, ji-ganawenjigaadeg gaa-izhi-gete-izhinaagwak iwe HBC gete-adaawewigamig.</li>\n\t<li>Gaanada Ogimaa dash gaa-miigiwed zhooniiyaan imaa Gichi-ogim-aawiwin Waakaa’igewin (NHS) gaye Gichi-ogimaawiwin Waakaa’i-gewin Zhooniyaa Wiiji’iwewin (NHCF) owe minik $55 miniyan das-waabik da-awi’iwe gaye $10 miniyan da-awi’iwe zhooniyaan.</li>\n\t<li>Gaanada Aki Waakaa’igewin (NHS) 10 midaaso-biboon $72+ biniyan daswaabik da-aabadizi ji-miinindwaa Gaanada Akiing gaa-ayaawaad ge-izhidaawaad.</li>\n\t<li>Apii gii-ozhichigaadeg iwe NHS Gaanada Ogimaa o-gii-asaan awashime $24.2 biniiyan daswaabi j-ozhichigaadegin awashime 91,000 daawinan gaye ji-wawezhichigaadegin awashime 209,000 daawinan gaye 172,000 e-wiiji’indwaa odaawiniwaang. Wiiji’aawag maawach gaa-andawendamowaad ngoji ji-izhi-daawaad daabishkoo gichi-ayaag, Anishinaabeg, gaye gaa-gwenawi-izhi-daawaad gaye ikwewag gaye abinoojiiyag gaa-dabaziiwaad.</li>\n</ul>\n\n<h2>Gegaa Naasaab Izhichigewinan</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Zhooniyaa 2022 Wiindamaagem: Nawach ji-dediba’amang Daawin</a><a name=\"_Hlt101371373\" id=\"_Hlt101371373\"></a><a name=\"_Hlt101371372\" id=\"_Hlt101371372\"></a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/moving-forward-on-reconciliation.html\">Zhooniyaa 2022 Wiindamaagem: Ji-aaminonendamoyang nawach</a><a name=\"_Hlt101371400\" id=\"_Hlt101371400\"></a><a name=\"_Hlt101371401\" id=\"_Hlt101371401\"></a></li>\n</ul>\n\n<h2>Miinawaa Godak</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Zhooniyaa 2022</a><a name=\"_Hlt101371409\" id=\"_Hlt101371409\"></a><a name=\"_Hlt101371410\" id=\"_Hlt101371410\"></a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\">Gichi-ogimaa Waakaa’igewin Izhichigewin</a><a name=\"_Hlt101371416\" id=\"_Hlt101371416\"></a><a name=\"_Hlt101371417\" id=\"_Hlt101371417\"></a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/co-investment-fund\">Gichi-ogimaawiwin Waakaa’i-gewin Zhooniyaa Wiiji’iwewin</a><a name=\"_Hlt101371420\" id=\"_Hlt101371420\"></a><a name=\"_Hlt101371421\" id=\"_Hlt101371421\"></a></li>\n</ul></div>\n      "
}