{
  "path": "/en/news/readouts/2021/02/10/prime-minister-justin-trudeau-speaks-prime-minister-india-narendra-modi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of India Narendra Modi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of India, Narendra Modi.</p>\n\n<p>The two leaders had an exchange on their respective efforts to fight the COVID-19 pandemic, protect the health and safety of their people, and provide economic support for their citizens. Prime Minister Trudeau and Prime Minister Modi spoke about India's significant efforts in promoting vaccine production and supply, which have provided vital support to countries around the world. The two leaders agreed to work together on access to vaccines. The leaders also recognized the need for continued global coordination to respond to the pandemic and to promote recovery.</p>\n\n<p>The two prime ministers reaffirmed their common interests in a free and open Indo-Pacific, and the importance of working together on global challenges such as climate change, strengthening global trade, and reinforcing the rules-based international order.&nbsp;The leaders discussed Canada and India’s commitment to democratic principles, recent protests, and the importance of resolving issues through dialogue.&nbsp;They underlined the need to work collectively in rebuilding a more sustainable and resilient global economy.</p>\n\n<p>The leaders underscored the importance of the Canada-India strategic partnership anchored in shared values, strong people-to-people ties, and growing bilateral economic cooperation.&nbsp;The two leaders looked forward to working together at the G7, G20, and other international forums.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/india-inde/relations.aspx?lang=eng\">Canada-India Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-by-international-development-minister-on-appointment-to-the-covax-advance-market-commitment-engagement-group.html\">Statement by International Development Minister on Appointment to the COVAX Advance Market Commitment Engagement Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}