{
  "path": "/en/news/news-releases/2022/04/22/creating-affordable-homes-indigenous-peoples-winnipeg",
  "pageTitle": "Creating affordable homes for Indigenous Peoples in Winnipeg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone in Canada should have a safe and affordable place to call home. To build a better future for everyone, the Government of Canada is building more homes across the country and making housing more affordable for those who need it most.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Premier of Manitoba, Heather Stefanson, and the Grand Chief of the Southern Chiefs’ Organization (SCO), Jerry Daniels, to announce a new federal investment of $65&nbsp;million that will provide almost 300 new, affordable homes for members of local First Nations, including families, Elders, and post-secondary students. This initiative is also supported by a contribution of $35&nbsp;million from the Province of Manitoba, bringing the total support to $100&nbsp;million. The new affordable homes will be located in the Hudson’s Bay Company’s (HBC) historic building in downtown Winnipeg, which was gifted to SCO for this revitalization project.</p>\n\n<p>The project, which is tentatively called “Wehwehneh Bahgahkinahgohn” – meaning “it is visible” in Anishinaabemowin – will build a space for economic and social reconciliation, according to SCO. A portion of the units will be culturally safe assisted living units for First Nation Elders, and families living in the converted HBC building and employees working there will have access to high quality, licensed child care. The project is slated to start this fall, with the first residents moving in in fall&nbsp;2025.</p>\n\n<p>Closing housing gaps for Indigenous Peoples remains a top priority for the Government of Canada. Since 2015, we have committed billions of dollars to support the construction and repair of thousands of houses for Indigenous Peoples across the country. In addition, Budget&nbsp;2022 proposes more than $4&nbsp;billion in new funding to create access to safe and affordable housing for Indigenous families. We will continue to work with Indigenous communities across the country to help ensure that everyone has a safe and affordable place to call home.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Everyone deserves a safe and affordable place to call home. By reimagining the iconic Hudson’s Bay Company building in Winnipeg’s downtown core, the Southern Chiefs’ Organization is helping preserve this historic building, while creating almost 300 much-needed housing units for members of the Southern First Nations in Manitoba.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Manitoba government is proud to support this act of historic reconciliation, by partnering with SCO and Canada on this landmark, Indigenous-led housing and social opportunity for Indigenous Peoples. This unique partnership will see the iconic Hudson’s Bay building transform into a new, vibrant space that will provide Indigenous Peoples with a range of services, including affordable housing for families, Elders, and post-secondary students. This project will also have a positive impact on downtown Winnipeg and supports our commitment to build a brighter future for all Manitobans.”</p>\n\n<footer class=\"default\">The Hon. Heather Stefanson, Premier of Manitoba</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today can be another step forward to a brighter future, one that reflects what our ancestors dreamed of. This project is an act of reconciliation and is our vision to revitalize the heart of Winnipeg’s downtown, for the benefit of all, in line with our traditional, holistic approach to sustainable economic development.”</p>\n\n<footer class=\"default\">Grand Chief Jerry Daniels, Southern Chiefs’ Organization</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we considered the future for the Winnipeg building, it was important to ensure a sustainable plan for the site that also had meaningful purpose for the City of Winnipeg. HBC’s Truth and Reconciliation journey requires actions that demonstrate our commitment to moving forward together with Indigenous communities. We believe SCO is the right steward for this location and can create a new community landmark that will help advance reconciliation.”</p>\n\n<footer class=\"default\">Richard Baker, Governor and Executive Chairman, Hudson’s Bay Company</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The converted HBC building will feature:\n\t<ul>\n\t\t<li>Affordable rental units and market units, including a number of fully accessible ones;</li>\n\t\t<li>A health and healing centre including a pharmacy embracing both traditional and western medical practices;</li>\n\t\t<li>A First Nations museum, an art gallery, two restaurants, and stores;</li>\n\t\t<li>Energy-efficient features that will reduce the building’s energy consumption by 35 per cent and greenhouse gas emissions by 81 per cent.</li>\n\t</ul>\n\t</li>\n\t<li>The HBC conversion project is receiving $35&nbsp;million from the Government of Manitoba to support two initiatives. $10&nbsp;million is being allocated to support the affordable housing components of the redevelopment project. $25&nbsp;million is being made available through The Bay Building Fund, administered by The Winnipeg Foundation, to support the preservation of the heritage elements of the HBC building.</li>\n\t<li>The federal contribution is being provided through the National Housing Strategy’s (NHS) National Housing Co-investment Fund (NHCF), which will provide a $55&nbsp;million&nbsp;forgivable loan and a $10&nbsp;million low-cost loan.</li>\n\t<li>Canada’s National Housing Strategy (NHS) is a 10-year<strong>, </strong>$72+&nbsp;billion<strong> </strong>plan that will give more Canadians a place to call home.</li>\n\t<li>Since the creation of the NHS, the Government of Canada has committed over $24.2&nbsp;billion to support the creation of over 91,000 units and the repair of over 209,000 units, and has provided affordability support for over 172,000 households. These measures prioritize those in greatest need, including seniors, Indigenous Peoples, people experiencing or at risk of homelessness, and women and children fleeing violence.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget&nbsp;2022 Backgrounder: Making Housing More Affordable</a><a name=\"_Hlt101371372\" id=\"_Hlt101371372\"></a><a name=\"_Hlt101371373\" id=\"_Hlt101371373\"></a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/moving-forward-on-reconciliation.html\">Budget&nbsp;2022 Backgrounder: Moving Forward on Reconciliation</a><a name=\"_Hlt101371400\" id=\"_Hlt101371400\"></a><a name=\"_Hlt101371401\" id=\"_Hlt101371401\"></a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a><a name=\"_Hlt101371409\" id=\"_Hlt101371409\"></a><a name=\"_Hlt101371410\" id=\"_Hlt101371410\"></a></li>\n\t<li><a href=\"https://www.placetocallhome.ca/\">National Housing Strategy</a><a name=\"_Hlt101371416\" id=\"_Hlt101371416\"></a><a name=\"_Hlt101371417\" id=\"_Hlt101371417\"></a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/co-investment-fund\">National Housing Co-Investment Fund</a><a name=\"_Hlt101371420\" id=\"_Hlt101371420\"></a><a name=\"_Hlt101371421\" id=\"_Hlt101371421\"></a></li>\n</ul></div>\n      "
}