{
  "path": "/en/news/statements/2021/03/27/statement-prime-minister-results-provincial-election-newfoundland-and",
  "pageTitle": "Statement by the Prime Minister on the results of the provincial election in Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement on the results of the provincial election in Newfoundland and Labrador:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Newfoundlanders</span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"> and </span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Labradorians have chosen to elect a </span><span>majority </span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">government led by the Liberal Party of Newfoundland and Labrador.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On behalf of the Government of Canada, I congratulate Dr.&nbsp;Andrew Furey on his re-election.</span></span></span></p>\n\n<p><span><span><span><span>“Since he took office last year, Premier Furey’s</span></span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"> leadership and collaboration have been critical in the fight against COVID-19.</span><span><span> Together, we will continue to strengthen health care, </span></span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">protect Newfoundlanders and Labradorians from the virus, and support them throughout this global pandemic. Building on key initiatives like the Atlantic Growth Strategy and the Lower Churchill Projects, we will also work together to protect the environment, create good middle class jobs, and build a sustainable and clean energy future for the province and our country, including through the Atlantic Loop. </span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Through our continued partnership, we will keep moving forward on the issues that matter most to the people of Newfoundland and Labrador, and build back better for all Canadians.”</span></span></span></p></div>\n      "
}