{
  "path": "/en/news/news-releases/2022/08/17/prime-minister-welcomes-twenty-ninth-annual-report-public-service",
  "pageTitle": "Prime Minister welcomes the Twenty-Ninth Annual Report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Twenty-Ninth Annual Report on the Public Service of Canada, which was presented to him by the Clerk of the Privy Council and Secretary to the Cabinet and Head of the Federal Public Service, Janice Charette.</p>\n\n<p>The report outlines the work of public servants over the past year to address ongoing and emerging crises. Public servants secured and distributed vaccines, launched the whole-of-government effort in response to the security situation in Afghanistan and Russia’s illegal and unjustifiable invasion of Ukraine, and addressed the impacts of extreme weather events on communities across the country.</p>\n\n<p>In these challenging times, the report emphasizes the need to continue supporting mental health and well-being in the workplace and confronting systemic racism, while advancing equity, diversity, inclusion, and accessibility within the Public Service. This includes ongoing efforts to advance the Call to Action on Anti-Racism, Equity, and Inclusion, which calls on leaders in the Public Service to support Indigenous, Black, and other racialized employees and voices, and to establish a sense of belonging and trust for all public servants.</p>\n\n<p>The annual report also highlights some of the ways public servants have delivered for Canadians and references important opportunities for improvement moving forward. The agility, dedication, and creativity of public servants will continue to be critical in responding to the ever-evolving needs of Canadians.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“This past year, Canada’s public servants have worked to adapt programs and services to meet the evolving needs of Canadians while responding to crises as they emerged. I&nbsp;want to thank them for their service and dedication, and I look forward to continuing to work together to build a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Fact</h2>\n\n<ul>\n\t<li>The Government of Canada first introduced the Annual Report to the Prime Minister on the Public Service of Canada in 1992 – a requirement under section&nbsp;127 of the&nbsp;<em>Public Service Employment Act</em>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/corporate/transparency/annual-report-prime-minister-public-service/29th.html?utm_source=PM+NR&amp;utm_medium=NR&amp;utm_campaign=PM+NR_EN&amp;utm_id=29AR\">Twenty-Ninth Annual Report to the Prime Minister on the Public Service of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/corporate/clerk/call-to-action-anti-racism-equity-inclusion-federal-public-service.html\">Call to Action on Anti-Racism, Equity, and Inclusion</a></li>\n</ul></div>\n      "
}