{
  "path": "/en/news/news-releases/2018/08/22/prime-minister-announces-action-british-columbia-wildfires",
  "pageTitle": "Prime Minister announces action on British Columbia wildfires | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada stands with the people of British Columbia and will make every effort to support Canadians who are dealing with the devastating effects of wildfires in the province.</p><p>In addition to support provided by the Canadian Armed Forces, the Prime Minister, Justin Trudeau, today announced the creation of a new ad hoc Cabinet committee to coordinate federal efforts to help the many communities affected by the wildfires raging through British Columbia.</p><p>The Ad Hoc Cabinet Committee on the 2018 BC Wildfires will meet as required to consider and coordinate federal contributions and to support recovery and rebuilding efforts. The Committee will complement the on-the-ground efforts coordinated by the Government Operations Centre, and will work in partnership with Indigenous leaders to make sure affected Indigenous communities have the support they need.</p><p>British Columbians can count on the full support of the Government of Canada as they deal with the devastation caused by these wildfires and work to rebuild their communities.</p><h2>Quote</h2><blockquote><p>“Our thoughts are with everyone affected by the wildfires in British Columbia, and our government is determined to support British Columbians in the wake of this devastation. With this new committee, we will work to address the urgent and long-term impacts of the wildfires, and will collaborate closely with Premier Horgan and local authorities to support recovery and rebuilding efforts. I would especially like to thank first responders and all of those who are working hard and putting their lives at risk to help people affected by the wildfires.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Ad Hoc Cabinet Committee will comprise:<ul><li>The Hon. Carla Qualtrough, Minister of Public Services and Procurement and Accessibility (Chair)</li><li>The Hon. Harjit S. Sajjan, Minister of National Defence (Vice-Chair)</li><li>The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development</li><li>The Hon. Ralph Goodale, Minister of Public Safety and Emergency Preparedness</li><li>The Hon. Dominic LeBlanc, Minister of Intergovernmental and Northern Affairs and Internal Trade</li><li>The Hon. Jane Philpott, Minister of Indigenous Services</li><li>The Hon. Jody Wilson-Raybould, Minister of Justice and Attorney General of Canada</li><li>The Hon. Jonathan Wilkinson, Minister of Fisheries, Oceans and the Canadian Coast Guard</li></ul></li><li>The Canadian Armed Forces personnel and air assets deployed are part of the Government of Canada’s response to British Columbia’s request for federal assistance.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www2.gov.bc.ca/gov/content/safety/wildfire-status\">Wildfires in British Columbia</a></li><li><a href=\"http://www.redcross.ca/\">Canadian Red Cross</a></li></ul></div>\n      "
}