{
  "path": "/en/news/news-releases/2016/11/29/prime-minister-host-first-ministers-meeting-and-meet-national",
  "pageTitle": "Prime Minister to host First Ministers’ Meeting and meet with National Indigenous leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau announced today that he will host a First Ministers’ Meeting (FMM) and a meeting with First Nations, Inuit, and Métis leaders on December 9, 2016, in Ottawa, Ontario.</p><p>Since the last FMM on March 3, 2016, federal, provincial, and territorial governments have been working closely together to develop a pan-Canadian framework on clean growth and climate change to guide the country’s transition to a more resilient, low-carbon economy that creates good paying, long-term jobs for the middle class and those working hard to join it. At the FMM on December 9, First Ministers will work to finalize the framework and confirm the steps that need to be taken to implement it.</p><p>The meeting with National Chief Perry Bellegarde of the Assembly of First Nations, President Natan Obed of the Inuit Tapiriit Kanatami and President Clément Chartier of the Métis National Council will serve as an opportunity to discuss the framework and Indigenous perspectives in advance of the FMM. The discussion will inform further partnerships with Indigenous peoples as part of ongoing collaboration to protect Canada’s land, air, and water for future generations and to build our clean growth economy. Premiers are invited to take part in the meeting with the Indigenous leaders.</p><h2>Quotes</h2><blockquote><p>“I am pleased to be meeting again with Premiers – in a spirit of cooperation and collaboration – to discuss how we can work together now to build a greener, more secure, and more sustainable future for our children and grandchildren. Together, we can safeguard the environment and spur innovative economic growth that will lead to more well paid jobs for the middle class and more opportunities for all Canadians.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Indigenous voices and perspectives are of the utmost importance as our country works together to give our kids and grandkids a better, healthier, more prosperous, and more inclusive tomorrow. I look forward to working with Indigenous leaders to make real progress on the important issues affecting their communities and Canada.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Associated Links</h2><ul><li><a href=\"http://www.afn.ca/en\">Assembly of First Nations</a></li><li><a href=\"https://www.itk.ca/\">Inuit Tapiriit Kanatami</a></li><li><a href=\"http://www.metisnation.ca/\">Métis National Council</a></li><li><a href=\"http://canadaspremiers.ca/en/\">Canada’s Premiers</a></li></ul></div>\n      "
}