{
  "path": "/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-prime-minister-armenia-nikol-pashinyan",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Armenia Nikol Pashinyan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Armenia, Nikol Pashinyan, on the margins of the Eighteenth Summit of La Francophonie.</p>\n\n<p>Prime Minister Trudeau welcomed the continued ceasefire following the escalation of hostilities between Armenia and Azerbaijan in September, and expressed his support for ongoing meaningful dialogue between the two countries.</p>\n\n<p>Prime Minister Trudeau strongly condemned Russia’s illegal and unjustifiable aggression against Ukraine, and reiterated Canada’s intention to continue to support Ukraine and impose costs on Russia for its actions.</p>\n\n<p>Prime Minister Trudeau also reiterated Canada’s intention to strengthen bilateral ties and to increase support for Armenian democracy, including by opening a full embassy with a resident ambassador in Armenia as part of Canada’s diplomatic expansion in Central and Eastern Europe.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/armenia-armenie/relations.aspx?lang=eng\">Canada-Armenia relations</a></li>\n\t<li><a href=\"/en/news/statements/2022/09/21/statement-prime-minister-armenias-independence-day\">Statement by the Prime Minister on Armenia’s Independence Day</a></li>\n\t<li><a href=\"/en/news/readouts/2022/03/14/prime-minister-justin-trudeau-speaks-prime-minister-armenia-nikol\">Prime Minister Justin Trudeau speaks with Prime Minister of Armenia Nikol Pashinyan</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}