{
  "path": "/en/news/readouts/2020/11/19/prime-minister-justin-trudeau-participates-covid-19-briefing-opposition",
  "pageTitle": "Prime Minister Justin Trudeau participates in COVID-19 briefing with Opposition leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated in a COVID-19 briefing with Opposition leaders, led by Chief Public Health Officer of Canada Dr. Theresa Tam and Deputy Chief Public Health Officer of Canada Dr. Howard Njoo.</p>\n\n<p>Dr. Tam and Dr. Njoo provided an update on the spread of COVID-19 in Canada. The doctors highlighted the latest modelling data and projections, which they will release tomorrow, and answered questions from Opposition leaders. They noted that Canada is facing a continued rise in cases and that it is critical for Canadians to keep following all public health measures, including physical distancing, proper handwashing, and limiting close contacts. The doctors and the Opposition leaders also discussed vaccines, long-term care, schools, rapid testing, travel between provinces and territories, as well as international factors affecting Canada.</p>\n\n<p>The Prime Minister emphasized that the health and safety of all Canadians transcends political interests, and every party must work together to protect Canadians from COVID-19.</p>\n\n<p>The Prime Minister reaffirmed that the Government of Canada is committed to continuing to work with provinces, territories, municipalities, and Indigenous communities, as well as all parliamentarians, to respond to the pandemic and keep Canadians safe and healthy.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection.html\">Coronavirus disease (COVID-19): Outbreak update</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/measures-reduce-community.html\">Coronavirus disease (COVID-19): Measures to reduce COVID-19 in your community</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/digital-tools-staying-healthy.html\">COVID-19: Digital tools and apps for staying healthy</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}