{
  "path": "/en/news/readouts/2022/05/12/prime-minister-justin-trudeau-meets-nunavut-premier-pj-akeeagok",
  "pageTitle": "Prime Minister Justin Trudeau meets with Nunavut Premier P.J. Akeeagok | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Nunavut Premier P.J. Akeeagok to discuss shared priorities.</p>\n\n<p>The Prime Minister and Premier discussed Nunavut’s newly released Ktujjiluta Mandate and emphasized the important work undertaken to bring together the Government of Nunavut, Nunavut Tunngavik Incorporated, and Inuit organizations on priority items, especially on investing in housing in the North. The two leaders agreed on the importance of closing the housing gap and its strong link to other priorities, such as public health and elder care. The Prime Minister highlighted recent investments in Budget 2022 which proposes $60 million to the Government of Nunavut, and $845 million in dedicated funding to address the unique housing needs in Inuit communities.</p>\n\n<p>The Premier expressed support for Canada’s efforts and aid to Ukraine. They discussed Arctic security and related infrastructure needs across the territory and the importance of collaborating to deliver results that will improve the lives of Nunavummiut.&nbsp;</p>\n\n<p>The Prime Minister and Premier discussed devolution in Nunavut and the need to work closely together as the parties involved enter the final stages of negotiations. The leaders agreed on the critical importance of devolution for the territory and expressed optimism that an agreement can be reached.</p>\n\n<p>The two leaders reaffirmed their commitment to continued cooperation between their governments on these and other shared priorities, such as climate change and fostering economic diversification and growth for communities in the North.</p>\n\n<p>The Prime Minister and Premier looked forward to continued collaboration.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/04/prime-minister-justin-trudeau-speaks-northwest-territories-premier\">Prime Minister Justin Trudeau speaks with Northwest Territories Premier Caroline Cochrane, Nunavut Premier P.J. Akeeagok, and Yukon Premier Sandy Silver</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2022/04/minister-vandal-announces-budget-2022-housing-investments-in-nunavut1.html\">Minister Vandal announces Budget 2022 housing investments in Nunavut</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Canada’s Arctic and Northern Policy Framework</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1352471770723/1537900871295\">Nunavut devolution</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}