{
  "path": "/en/news/readouts/2020/04/16/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID‑19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with premiers to discuss the evolving COVID-19 situation. The leaders talked about collaborative efforts taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians, and to support workers and businesses during this uncertain time.</p>\n\n<p>The Prime Minister updated premiers on his call with G7 leaders earlier in the day as well as recent federal action to help more Canadians get the support they need through the Canada Emergency Response Benefit. They discussed ways to financially help low-income workers who provide essential services to Canadians and First Ministers agreed to work together to get money in the hands of Canadians who need it most.&nbsp;First Ministers also discussed the federal government’s intention to introduce a Canada Emergency Commercial Rent Assistance for small businesses, and other actions being taken by all orders of government to support Canadian businesses so they can keep their doors open and their employees on the job.</p>\n\n<p>First Ministers agreed that measures currently in place, including physical distancing, quarantining, and self-isolation, and the sharing of data are essential to slowing the spread of COVID-19, and ensuring the safety of front-line workers and the capacity of the health care system. They also agreed on the urgent need to ensure long-term care facilities have the resources they need to protect the health and well-being of their residents and workers.</p>\n\n<p>All First Ministers reaffirmed their commitment to addressing COVID-19 through a Team Canada effort. The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of all Canadians is our top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}