{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-meets-president-ghana-nana-addo-dankwa-akufo",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Ghana Nana Addo Dankwa Akufo-Addo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with the President of Ghana, Nana Addo Dankwa Akufo-Addo, on the margins of the Commonwealth Heads of Government Meeting.&nbsp;&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Akufo-Addo reaffirmed the importance of working together to advance shared priorities at a time of rising uncertainty around the world.</p>\n\n<p>The two leaders discussed Russia’s illegal invasion of Ukraine, which the Prime Minister condemned as an affront to fundamental principles of sovereignty, territorial integrity, and international law. They noted the need for countries in the Commonwealth to work together to defend democracy, peace and security, and human rights.</p>\n\n<p>Recognizing that Russia’s actions are driving up the cost of living across the Commonwealth, Prime Minister Trudeau and President Akufo-Addo agreed to work together to improve food security, support ambitious climate action, create opportunities for youth, and make life better and more affordable for people around the world.</p>\n\n<p>The leaders emphasized their shared commitment to the core values that must bring the countries of the Commonwealth together: free and democratic societies and the promotion of peace and prosperity to improve the lives of all people. They spoke about the importance of modernizing and renewing this important institution.</p>\n\n<p>The two leaders also spoke about the close bilateral partnership between Canada and Ghana and committed to strengthen trade and investment ties between the two countries. They also agreed to continue working together to advance inclusive democracy, and peace and security in West Africa.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ghana/bilateral_relations_bilaterales/canada_ghana.aspx?lang=eng\">Canada-Ghana Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/17/prime-minister-justin-trudeau-speaks-president-ghana-nana-addo-dankwa\">Prime Minister Justin Trudeau speaks with President of Ghana Nana Addo Dankwa Akufo-Addo</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}