{
  "path": "/en/news/news-releases/2021/01/12/prime-minister-announces-changes-ministry",
  "pageTitle": "Prime Minister announces changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the Ministry:</p>\n\n<p><strong>Marc Garneau</strong>, currently Minister of Transport, becomes Minister of Foreign Affairs. From his work as an astronaut to his time within government, Minister Garneau has always been a strong voice for Canada around the world. As Minister of Transport, Mr. Garneau made progress on a number of important issues that matter to Canadians, including the creation and advancement of the Ocean’s Protection Plan and Canada’s efforts on the Safer Skies Initiative to improve aviation security over conflict zones. Minister Garneau will bring experience acquired during his close work with international partners on the investigation into the Ukraine International Airlines Flight 752 tragedy and as chair of the Cabinet Committee on Canada-United States Relations to his new portfolio, and will continue to be a leader on the world stage. &nbsp;</p>\n\n<p><strong>Jim Carr</strong> joins the Ministry and will continue to serve as Special Representative for the Prairies. Mr. Carr will build on his past experience as Minister of Natural Resources and Minister of International Trade Diversification, where he created new jobs and economic growth for all Canadians and was a strong voice and advocate for the Prairies. Minister Carr will continue to actively engage Canadians across the Prairies, listen to their challenges, opportunities, and interests, and bring their perspectives to Cabinet discussions.</p>\n\n<p><strong>François-Philippe Champagne</strong>, currently Minister of Foreign Affairs, becomes Minister of Innovation, Science and Industry. As Minister of Foreign Affairs, Mr. Champagne showed leadership and stood up for Canadian values on the world stage while leading our international COVID-19 response, executing the largest repatriation operation in Canadian history, and effectively responding to a number of evolving and complex situations including the crisis in Lebanon. In his new role, Minister Champagne will rely on his extensive business experience in the fields of energy, engineering, and innovation to assist our economic recovery from the global COVID-19 pandemic, create new jobs for Canadians, and grow our middle class. He will also use his experience to help the government work with the manufacturing, natural resource, and energy sectors as they transition to meet a net-zero future. As the representative of a rural riding, he also deeply understands the needs and priorities of Canadians living in rural communities, including the importance of improving high-speed Internet access that will empower communities across the country and strengthen Canada’s competitiveness.</p>\n\n<p><strong>Omar Alghabra</strong>, currently Parliamentary Secretary to the Prime Minister (Public Service Renewal) and to the Deputy Prime Minister and Minister of Intergovernmental Affairs, becomes Minister of Transport. Mr. Alghabra brings extensive experience to the Cabinet table, from past work in NGOs and the energy sector to his training in engineering and business. With more than seven years’ experience as a Member of Parliament for one of Canada’s hubs for innovation and economic development, he recognizes how crucial the Government of Canada’s continued investments in transportation and public transit are to creating opportunities for Canadians and improving their quality of life. He will also continue to play a leadership role in the investigation into the Ukraine International Airlines Flight 752 tragedy.</p>\n\n<p>The Prime Minister thanked the Honourable Navdeep Bains for his friendship, support, and counsel over their many years working together in Parliament. He also thanked Mr. Bains for his dedication over the last five years as Minister of Innovation, Science and Industry and Minister of Innovation, Science and Economic Development. During this time, Mr. Bains launched a new national space strategy and created the Strategic Innovation Fund to attract and support business investments across all sectors of the economy. More recently, he played a central role in Canada’s response to the global COVID-19 pandemic by leading Canada’s Plan to Mobilize Industry to fight COVID-19, and overseeing the creation of the COVID-19 immunity, vaccine, and therapeutics task forces. Mr. Bains will continue to serve his community and all Canadians as the Member of Parliament for Mississauga—Malton.</p>\n\n<p>As Parliament resumes at the end of the month, Cabinet ministers will continue to work with all Parliamentarians, as well as provinces, territories, municipalities, and Indigenous communities, to deliver results that benefit all Canadians. By continuing to fight the global COVID-19 pandemic and supporting people, communities, and businesses through the crisis, we will build a stronger, more resilient Canada for everyone.</p>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet\">Biographies</a></li>\n</ul></div>\n      "
}