{
  "path": "/en/news/news-releases/2023/04/21/prime-minister-participate-global-citizen-now-summit",
  "pageTitle": "Prime Minister to participate in Global Citizen NOW summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will travel to New York City, United States of America to participate in the <a href=\"https://www.globalcitizen.org/en/content/global-citizen-now-everything-to-know-2023/\">Global Citizen NOW</a> summit to advance collective efforts in addressing some of the most pressing global challenges and building a better and more equal world for everyone. The Prime Minister will drive progress toward reaching the Sustainable Development Goals (SDGs) – a path forward for Canada and the world that leaves no one behind.</p>\n\n<p>At the summit, the Prime Minister will champion women’s rights, including sexual and reproductive health and rights and the empowerment of women everywhere. He will highlight the important work women’s rights organizations, human rights defenders, women peace builders, and young feminists are doing at this critical time when women’s rights are under attack in many places throughout the world.</p>\n\n<p>As co-chairs of the SDG Advocates, a group including academics, politicians, artists, musicians and more from around the world, Prime Minister Trudeau and the Prime Minister of Barbados, Mia Mottley, will convene a meeting of the group. They will take stock at the half-way point towards the 2030 goals and work together to raise ambition in the lead up to the SDG Summit in September 2023.</p>\n\n<p>Prime Minister Trudeau will also address the Council on Foreign Relations to build on the success of President Biden’s visit last month by emphasizing the importance of the Canada-United States bilateral relationship and our strong shared interest in building clean economies that benefit everyone on both sides of the border. Engaging with the private sector, investors, and financial leaders in New York, the Prime Minister will promote Canada’s economic outlook, commitment to developing the North American electric vehicle supply chain, and role as a reliable energy supplier and partner, while championing trade and investment opportunities with Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Building a future that is fair, equal, and peaceful, with clean air and clean water for everyone, is at the heart of the United Nations Sustainable Development Goals and reflects the vision of the Global Citizen NOW summit. In New York City, I look forward to advancing our shared progress and advocating for strong global commitments to support gender equality and the empowerment of women and girls everywhere.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>In 2015, Canada joined all United Nations (UN) Member States in adopting ambitious goals for sustainable development, as outlined in <a href=\"https://sdgs.un.org/2030agenda\">Transforming our world: the 2030 Agenda for Sustainable Development</a>. The 2030 Agenda centres on a set of 17 Sustainable Development Goals (SDGs), encompassing social, economic, and environmental dimensions. Taken together, the SDGs aim to improve the lives of all people, while protecting the planet.</li>\n\t<li>In February 2021, the Government of Canada released the <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy</a>, which aims to create and foster a whole-of-society approach to accelerate progress on the SDGs, in Canada and abroad. Canada continues to take a gender-responsive approach to the implementation of the 2030 Agenda through its Feminist Foreign Policy, including the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>.</li>\n\t<li>Last year, Prime Minister Justin Trudeau and the Prime Minister of Barbados, Mia Mottley, were invited by the United Nations Secretary-General, António Guterres, to co-chair the UN Sustainable Development Goals Advocates group to raise global awareness of the SDGs and accelerate action toward achieving these goals.</li>\n\t<li>The Global Citizen NOW summit will take place April 27 and 28, 2023, and will bring together government leaders, private sector executives, grassroots activists, cultural innovators, philanthropic experts, and leading journalists to set a global agenda for action on the most urgent issues facing humanity and the planet.</li>\n\t<li>Canada and the U.S. share a strong bilateral relationship built over the past 150 years and one of the largest trading relationships in the world, with over $1 trillion in bilateral trade in goods and services in 2021, making Canada the largest U.S. trading partner in goods and services.</li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://sdgs.un.org/\">United Nations - Sustainable Development</a></li>\n\t<li><a href=\"https://sdgs.un.org/2030agenda\">Transforming our world: the 2030 Agenda for Sustainable Development</a></li>\n\t<li><a href=\"https://www.unsdgadvocates.org/\">SDG Advocates</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}