{
  "path": "/en/news/news-releases/2020/08/10/prime-minister-announces-more-assistance-lebanon",
  "pageTitle": "Prime Minister announces more assistance for Lebanon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada continues to stand with the people of Lebanon as they begin to rebuild their lives and their city in the wake of the tragic explosion in Beirut.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canada is providing an additional $25 million, for a total of $30 million, in assistance for the people of Lebanon following the explosion. This funding will help trusted partners address immediate humanitarian needs and support efforts for early recovery. The Government of Canada will also continue to match donations from Canadians through the Lebanon Matching Fund, up to a new expanded maximum of $5 million.</p>\n\n<p>Support announced today adds to the $5 million in humanitarian assistance that Canada provided for Lebanon last week, including an initial $1.5 million given immediately to trusted humanitarian organizations such as the Lebanese Red Cross. Our contributions will help to support emergency medical services and provide shelter, food, and other essential items for people impacted by the blast.</p>\n\n<p>Canada and Lebanon have a close and longstanding friendship through our people-to-people ties. Canada is home to hundreds of thousands of Lebanese Canadians, who contribute to our communities across the country, every day. We will continue to monitor this tragic situation, and work closely with the international community and humanitarian partners to identify how we can continue to support the people of Lebanon and respond to their urgent needs.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I join Canadians across the country to mourn those who were lost in last Tuesday’s tragic explosion in Beirut, and to offer sincere condolences to their families and friends as they grieve this tragedy. I also encourage Canadians to donate to the Lebanon Matching Fund, and we will continue to match your generous donations. Together, we can support the people of Lebanon as they work to heal and rebuild.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians were shocked and saddened by the images of last week's deadly explosion in Beirut. Since then, we have seen an outpouring of generosity from people who want to help however they can. The Canadian government is pleased to match many of these generous donations and to offer additional financial assistance as the scale of the disaster becomes clear. Canada will be there every step of the way to help the people of Lebanon as they rebuild and to push for much-needed political and economic reforms.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is sending a clear message to the Lebanese people that we will not only be there for them for the immediate response to this tragedy, but also for the rebuilding efforts over the long-term. We are ready to do more and we will ensure that our investments go directly to communities affected. Canadians have shown incredible generosity, so we are also rising to the occasion by increasing the amount of donations we are ready to match. Please continue to be generous!”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of International Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canadians interested in supporting humanitarian action on the ground in Beirut through the Lebanon Matching Fund can donate to the <a href=\"https://www.humanitariancoalition.ca/crisis-in-lebanon\">Humanitarian Coalition</a> or one of its members by August 24, 2020.</li>\n\t<li>Canada’s Humanitarian Coalition brings together leading humanitarian organizations to provide Canadians with a simple and effective way to help during international humanitarian disasters.</li>\n\t<li>Canadians in Lebanon who need emergency consular assistance should contact the Embassy of Canada in Beirut at 961 (4) 726-700 or <a href=\"mailto:berut-cs@international.gc.ca\">berut-cs@international.gc.ca</a> or contact Global Affairs Canada’s Emergency Watch and Response Centre at +1 613-996-8885 or <a href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca.</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/lebanon-liban.aspx?lang=eng\">Canada’s response to the crisis in Lebanon</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/08/canada-providing-humanitarian-assistance-in-response-to-beirut-explosion.html\">Canada providing humanitarian assistance in response to Beirut explosion</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/08/canada-launches-matching-fund-to-respond-to-beirut-explosion.html\">Canada launches matching fund to respond to Beirut explosion</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/08/06/statement-prime-minister-fatal-explosion-lebanon\">Statement by the Prime Minister on the fatal explosion in Lebanon</a></li>\n</ul></div>\n      "
}