{
  "path": "/en/news/readouts/2022/02/09/prime-minister-justin-trudeau-speaks-prime-minister-japan-kishida-fumio",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Japan Kishida Fumio | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Japan, Kishida Fumio.</p>\n\n<p>The prime ministers reaffirmed the strategic partnership between Canada and Japan, including a shared vision for a free and open Indo-Pacific. They agreed to continue working closely together as Canada takes steps to deepen its engagement in the region through the development of a comprehensive Indo‑Pacific strategy.</p>\n\n<p>The leaders expressed concern at North Korea’s recent missile launches and recommitted to supporting international efforts to constrain the regime’s provocative actions. In this regard, they reaffirmed their commitment to the multinational effort to help monitor United Nations sanctions against North Korea, to which Canada is contributing through Operation NEON. Prime Minister Trudeau reiterated his support for Prime Minister Kishida’s efforts to secure the return of Japanese citizens abducted by North Korea.</p>\n\n<p>The prime ministers also discussed their concerns about China’s actions in the region, including in the South China Sea and Taiwan, and expressed their determination to enhance their cooperation to promote regional security.</p>\n\n<p>The two leaders shared their deep concerns over Russia’s destabilizing actions in and around Ukraine and reaffirmed their steadfast support for the sovereignty and territorial integrity of Ukraine. They agreed on the need for the G7 and like‑minded countries to be united in deterring Russian aggression and encouraging a diplomatic solution.</p>\n\n<p>The prime ministers discussed opportunities for Canada and Japan to enhance cooperation in addressing climate change and rebuilding a more sustainable and resilient global economy. Prime Minister Trudeau stressed the importance of putting a price on pollution around the world.</p>\n\n<p>The leaders discussed the vibrant trade and economic ties between Canada and Japan. They noted the importance of working together to strengthen supply chain resilience and economic security, and deepen cooperation on critical minerals and emerging technologies. The two leaders also discussed the Comprehensive and Progressive Agreement for Trans-Pacific Partnership and agreed on the need to ensure its high standards are maintained.</p>\n\n<p>The prime ministers agreed to work closely within the G7 and other international forums to uphold the rules-based international order, and advance security and prosperity.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/canada-condemns-north-koreas-ballistic-missiles-launches.html\">Canada condemns North Korea’s ballistic missiles launches</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-neon.html\">Operation NEON</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/10/31/statement-prime-minister-results-general-election-japan\">Statement by the Prime Minister on the results of the general election in Japan</a>&nbsp;</li>\n</ul></div>\n      "
}