{
  "path": "/en/news/statements/2023/01/27/statement-prime-minister-international-holocaust-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on International Holocaust Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Holocaust Remembrance Day:</p>\n\n<p>“Today, on <a href=\"https://www.unesco.org/en/days/holocaust-remembrance\">International Holocaust Remembrance Day</a>, I join Canadians in honouring the memory of the more than six million Jews who were murdered during the Holocaust. We remember the many Roma and Sinti, people with disabilities, 2SLGBTQI+ people, Black people, Slavic people, political opponents, and Jehovah’s Witnesses who were also persecuted and killed by the Nazis and their collaborators. We also honour the survivors and the people who gave their own lives to save the lives of others during the Holocaust.</p>\n\n<p>“Each January 27, on the anniversary of the liberation of the Auschwitz-Birkenau Concentration Camp in 1945, we come together to promise ‘never again.’ That day, and in the weeks that followed, the world saw the true scale of the mass murder, systemic starvation, and genocide that occurred. In 2023, the Holocaust seems increasingly distant, so listening to and learning from survivors’ stories is now more important than ever. With the disturbing rise of antisemitism in our communities, we must uphold our collective responsibility to speak up against hatred and discrimination – wherever and whenever it occurs.</p>\n\n<p>“Simply saying ‘never again’ is not enough. We must also take concrete action to combat the discrimination, hateful rhetoric, and racism that Jewish people and others continue to face. That’s why, last year, the Government of Canada criminalized the willful promotion of antisemitism by denying, condoning, or downplaying the Holocaust. We provided historic funding to strengthen Holocaust remembrance, including by supporting the construction of a new Holocaust museum in Montréal, the creation of the Toronto Holocaust Museum, and the Jewish Community Centre of Greater Vancouver’s redevelopment project, which will include a new home for the Vancouver Holocaust Education Centre. Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism, the Honourable Irwin Cotler, continues to advance our work on combatting antisemitism and all forms of racial discrimination and on preserving the memory of the Holocaust – both at home and abroad.</p>\n\n<p>“This year’s United Nations theme for International Holocaust Remembrance Day –&nbsp;<a href=\"https://www.un.org/en/outreach-programme-holocaust/2023\">Home and Belonging</a> – invites us to explore and reflect on how victims and survivors of the Holocaust were forced to adjust their idea of belonging. Many found a home in Canada and forged strong communities here which have helped shape Canada into the strong and diverse country we know today.</p>\n\n<p>“As we reflect on the atrocities of the Holocaust, we renew our commitment to honour the memory of the Shoah, and to continue to learn from the horrors of the past. Today, we say ‘never again,’ and we reaffirm our shared responsibility to do everything we can to combat hatred, antisemitism, and discrimination in all its forms.”</p></div>\n      "
}