{
  "path": "/en/news/news-releases/2022/09/19/prime-minister-honours-legacy-her-majesty-queen-elizabeth-ii",
  "pageTitle": "Prime Minister honours the legacy of Her Majesty Queen Elizabeth II | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today attended the State Funeral in London, United Kingdom, for Her Majesty Queen Elizabeth&nbsp;II.</p>\n\n<p>Prime Minister Trudeau expressed thanks on behalf of all Canadians for The Queen’s lifetime of service to the Commonwealth and its people. Her Late Majesty’s dedication to Canada and Canadians will forever remain an important part of our country’s history.</p>\n\n<p>To honour Her Majesty’s lifelong commitment to duty and service, Prime Minister Trudeau announced that Canada will donate $20 million to the Queen Elizabeth Scholars (QES) program, which provides funding for university exchange projects that give Canadian students the opportunity to study abroad and attract top talent and international research leaders to Canada. This gift will ensure the program’s continued operation into the future.</p>\n\n<p>In London, Prime Minister Trudeau travelled to Westminster Hall to pay his respects to Her Majesty The Queen during the late-Sovereign’s lying-in-state. He also signed the book of condolences.</p>\n\n<p>Prime Minister Trudeau also received an audience with His Majesty King Charles III, where he personally extended condolences to the Royal Family on behalf of Canadians and affirmed the Government of Canada’s loyalty as he commences his reign.</p>\n\n<p>The Prime Minister then attended the State Funeral service at Westminster Abbey and the committal ceremony for the interment of Her Late Majesty Queen Elizabeth II at St. George’s Chapel, Windsor Castle.</p>\n\n<p>During his visit, Prime Minister Trudeau also met with Prime Ministers where the Queen is Head of State, including the Prime Minister of the United Kingdom, Elizabeth Truss, and the Prime Minister of Australia, Anthony Albanese, to remember Her Late Majesty’s extraordinary service. He also met with the Prime Minister of Ukraine, Denys Shmyhal.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Queen’s legacy of service and steadfast leadership will live on in the countless lives that she touched and as an inspiration to us all. Her example inspired many young Canadians to dedicate their lives to service, give back to their communities, and become the leaders of today and tomorrow. I join Canadians in thanking Her Majesty Queen Elizabeth II for over 70 years of selfless service and honouring her extraordinary life marked by grace, dignity, and an unwavering sense of duty.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister was accompanied by Sophie Grégoire Trudeau and Their Excellencies the Right Honourable Mary Simon, Governor General of Canada, and Mr. Whit Fraser.</li>\n\t<li>Canada was the Commonwealth country most often visited by Her Majesty, with 22 official visits as Queen.</li>\n\t<li>Her Majesty made a point of visiting every Canadian province and territory. Her last visit of the country was in 2010.&nbsp;</li>\n\t<li>Her Majesty Queen Elizabeth II was the patron of more than 600 charities and organizations, including 36 in Canada, reflecting her interests such as education, health, science, the environment, and the arts.</li>\n\t<li>The QES program has awarded more than 2,200 scholarships since its inauguration in 2012.</li>\n\t<li>The Queen held a privileged relationship with the Canadian Armed Forces, well beyond her constitutional role as Commander-in-Chief of Canada’s military. She served as Colonel-in-Chief, Captain General, and Air Commodore-in-Chief for 16 regiments and units across Canada. Each of these units sent representatives to London, England to take part in the funeral of Her Majesty.</li>\n\t<li>Her Late Majesty was also the Commissioner-in-Chief of the Royal Canadian Mounted Police dating back to 2012. Previously, she had been Honorary Commissioner of the Royal Canadian Mounted Police from 1953-2012, making her the RCMP’s longest serving “member”.&nbsp;</li>\n\t<li>On the day of Her Majesty’s funeral in London, Canada will observe a National Day of Mourning and a national commemorative ceremony will take place in Ottawa at 1 p.m. (ET) and be broadcast live on television and social media. The ceremony will be preceded by a memorial parade and a 96-gun salute – one round for each year of Her Majesty’s life –&nbsp;and followed by a flypast, by Royal Canadian Air Force CF-18s.</li>\n\t<li>To commemorate Her Majesty and to highlight her important connection to Canada, many buildings and landmarks from coast to coast to coast visited by Her Majesty have been illuminated in a royal blue hue on the eve of the funeral.</li>\n\t<li>Canadians are invited to visit the <a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen.html\">commemorative website</a> and <a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/book.html\">sign the online book of condolences.</a></li>\n\t<li>The Prime Minister was accompanied by a delegation from Canada, which included:\n\t<ul>\n\t\t<li>The Right Honourable Michaëlle Jean</li>\n\t\t<li>The Right Honourable David Johnston</li>\n\t\t<li>The Right Honourable Kim Campbell</li>\n\t\t<li>The Right Honourable Jean Chrétien</li>\n\t\t<li>The Right Honourable Paul Martin</li>\n\t\t<li>The Right Honourable Stephen Harper.</li>\n\t\t<li>Assembly of First Nations National Chief RoseAnne Archibald</li>\n\t\t<li>President of Inuit Tapiriit Kanatami Natan Obed</li>\n\t\t<li>President of the Métis National Council Cassidy Caron</li>\n\t\t<li>Clerk of the Privy Council and Secretary to the Cabinet and former High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland, Janice Charette</li>\n\t\t<li>High Commissioner for Canada to the United Kingdom of Great Britain and Northern Ireland, the Honourable Ralph Goodale.</li>\n\t\t<li>Order of Canada recipients\n\t\t<ul>\n\t\t\t<li>Mark Tewksbury</li>\n\t\t\t<li>Sandra Oh</li>\n\t\t\t<li>Gregory Charles</li>\n\t\t</ul>\n\t\t</li>\n\t\t<li>Cross of Valour Recipient Leslie Arthur Palmer</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/15/prime-minister-announces-canadian-delegation-state-funeral-her\">Prime Minister announces Canadian delegation to the State Funeral of Her Majesty Queen Elizabeth II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/13/national-day-mourning-canada-honour-her-majesty-queen-elizabeth-ii\">National Day of Mourning in Canada to honour Her Majesty Queen Elizabeth II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/10/statement-prime-minister-proclamation-accession-his-majesty-king-charles\">Statement by the Prime Minister on the proclamation of the accession of His Majesty King Charles&nbsp;III</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://queenelizabethscholars.ca/\">The Queen Elizabeth Scholars Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen.html\">Commemoration for Her Majesty Queen Elizabeth II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/monarchy-crown.html\">Monarchy and the Crown</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom</a></li>\n</ul></div>\n      "
}