{
  "path": "/en/news/news-releases/2021/03/29/world-leaders-meet-strengthening-financial-measures-boost-efforts",
  "pageTitle": "World leaders to meet on strengthening financial measures to boost efforts to cope with COVID-19 fallout | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2>Calls for additional measures to reduce debt burden and increase liquidity in low and middle-income countries to ensure full recovery</h2>\n\n<p>With many countries continuing to struggle to overcome the human and economic devastation from COVID-19, UN Secretary-General António Guterres is convening a meeting of world leaders on Monday, 29 March from 10 a.m. to 1:00 p.m. EDT to urge the international community to take additional and urgent action to ensure a robust recovery.</p>\n\n<p>The high-level virtual meeting organized by the Secretary-General together with the Prime Minister of Canada Justin Trudeau and the Prime Minister of Jamaica Andrew Holness aims to underscore the urgency of the need for bolder and concrete action to provide liquidity and address debt vulnerability in developing countries.</p>\n\n<p>The meeting will follow-up on a series of meetings and roundtables held last year to mobilize action to assist the economic recovery from the pandemic that resulted in a series of measures by the international community, but still not sufficient to meet the continuing and deepening crisis that many countries face.</p>\n\n<p>“We are on the verge of a debt crisis. Six countries have already defaulted. One-third of emerging market economies are at high risk of fiscal crisis. And the situation is even worse for least-developed and low-income countries,” said United Nations Secretary-General António Guterres.</p>\n\n<p>“We need now, to allocate new special drawing rights and encourage countries with strong reserve positions to reallocate unused SDRs to countries that need it; extend the G20’s Debt Service Suspension Initiative into 2022; and expand it to include all highly indebted, vulnerable middle-income countries affected by the crisis. We also need to expand the Common Framework for Debt Treatment to other vulnerable countries and provide additional, targeted debt relief and to tackle long-standing weaknesses in the international debt architecture. Otherwise, we risk spiralling deeper into the worst recession since the Great Depression.”</p>\n\n<p>Prime Minister of Jamaica, the Most Honourable Andrew Holness, said, “It has now been over a year since the COVID-19 global health crisis began and it has wreaked tremendous havoc on lives, livelihoods, and the global economy.”</p>\n\n<p>“The COVID-19-induced contraction in economic activity,” he said, “is severely impacting debt sustainability, particularly in low and middle-income countries. In addition to providing critical debt relief and liquidity support, we must create a new international debt architecture that ensures sustainability and encourages the private sector to integrate sustainability into its investment decisions to ensure a faster, stronger and more resilient recovery.”</p>\n\n<p>Prime Minister Holness added, “With the availability of vaccines, we are now able to see a path towards global recovery even as we note that all countries must have sufficient amounts and capacity to vaccinate their populations if we are to achieve inclusive recovery. Let us continue through robust cooperation and coordination to take deliberate actions to reverse the devastating economic effects of the pandemic as we prepare for a future of sustainable growth and development.”</p>\n\n<p>“The world must come together to protect people, save lives, and defeat COVID-19,” said Prime Minister Justin Trudeau. “Our progress has been remarkable, but we know we can’t defeat this virus and build back better at home unless all countries have the resources to respond to and recover from this global challenge. Only through a coordinated global response, can we address the impacts of the pandemic and create jobs, economic growth, and new opportunity for our people and businesses.”</p>\n\n<h2>New United Nations policy brief on debt crisis</h2>\n\n<p>In a new policy brief issued today, “<em>Preventing Debt Crises in the Era of COVID-19 and Beyond: The Time to Act is Now</em>,” the Secretary-General says that while many steps taken to date have been significant, they have not been sufficient to help restore economic health. Risks remain high for more countries to tip into a debt crisis, especially if the COVID-19 shock is more protracted and deeper than forecast.</p>\n\n<p>The COVID-19 pandemic, which has resulted in more than 2.7 million deaths and more than 125 million confirmed cases worldwide, has gone beyond a health and humanitarian crisis to also become an unprecedented global development emergency.</p>\n\n<p>More than a year into the pandemic, the Secretary-General says the fiscal impacts of the crisis are triggering debt distress in a growing number of countries and is severely limiting the ability of many countries to invest in recovery and the Sustainable Development Goals, including urgently needed climate action.</p>\n\n<p>He said, “Unless we take decisive action on debt and liquidity, we risk another ‘lost decade’ for many developing countries, putting the SDGs definitively out of reach.”</p>\n\n<h2>COVID-19 highlights increasingly unequal world</h2>\n\n<p>The current economic situation has highlighted growing inequalities between and within countries that pose significant threats to global efforts to build back better.</p>\n\n<p>COVID-19-related economic shocks have already led credit rating agencies to downgrade the credit worthiness of 42 countries since the start of the pandemic, including six developed countries, 27 emerging market economies, and nine least developed and low-income countries.</p>\n\n<p>Unprecedented health, social and economic measures over the last year have helped control the spread of the deadly virus, save lives, and mitigate the socioeconomic impacts of the pandemic. These emergency policies succeeded in flattening the curve of contagion and saved lives, but they also resulted the first increase in extreme poverty since 1998, a 4.3% drop in global GDP and the loss of an equivalent of 144 million jobs in 2020 alone.</p>\n\n<p>Many countries responded with extraordinary fiscal support measures, taking advantage of low borrowing costs, with developed countries accounting for the overwhelming share, around US $18 trillion. The international community has mobilized a strong response including emergency financing from international financial institutions, support for humanitarian partners, and access to medical countermeasures such as vaccines. Many developing countries, and least developed countries, in particular, which suffered from high debt levels before the pandemic, seeing their fiscal and external financing position further deteriorate in the course of 2020, have not been able to provide much needed stimulus support in adequate measure.</p>\n\n<p>While some middle-income countries have returned to international bond markets since April 2020, only two countries in Sub-Saharan Africa have been able to access markets; and some countries, including least developed countries with very high refinancing needs in 2021, will not have access to financial markets at affordable rates. In addition, many of these countries have already seen access to foreign currency curtailed through non-resident capital flight, and contractions in trade, tourism, remittances and foreign direct investment.</p>\n\n<p>The rapid growth of financing needs and the collapse in revenues and GDP growth associated with the pandemic have exacerbated debt burden risks across the globe. More than half of the least developed and low-income countries that use the IMF World Bank Debt Sustainability Framework are now assessed at a high risk of debt distress or in debt distress and, according to some estimates, more than a third of emerging market economies are at high risk of fiscal crises.</p>\n\n<h2>Need for debt relief</h2>\n\n<p>Debt relief will be needed to create space for investments in recovery and for achieving the SDGs, including climate action. Even in cases of elevated debt, new borrowing can lead to improved creditworthiness if it finances productive investments. Debt relief can also free up resources, create conditions under which countries can return to voluntary market access, and may lower a country’s overall borrowing costs, with positive impacts across the whole economy.</p>\n\n<h2>Call for action on ODA, new financing and liquidity</h2>\n\n<p>The Secretary-General, in the new UN policy brief, calls on governments to provide fresh concessional financing for developing countries, especially LDCs and SIDS, recapitalize multilateral development banks and accelerate the timetable for replenishing the funds, meet ODA commitments and provide long-term financing to developing countries for investment in long-term growth and development.</p>\n\n<p>In support of recent endorsements from the G7, the brief also calls for a new general allocation of special drawing rights (SDRs) reiterating the need to combine a voluntary reallocation of SDRs from developed to developing countries.&nbsp; &nbsp;</p>\n\n<p>And the brief calls on the G20 to extend the World Bank’s Debt Service Suspension Initiative (DSSI) until the end of June 2022 and include middle-income countries, notably small island developing states that have been gravely affected by the crisis.</p>\n\n<p>The policy brief also calls on the G20 to extend the eligibility to debt relief under the Common Framework for Debt Treatment Beyond the DSSI to other vulnerable countries on a case-by-case basis; and consider other mechanisms that would allow countries to access the Common Framework without creating a stigma or compromising the credit rating of the beneficiaries, including funds and other instruments within existing institutions.&nbsp; Finally, the brief calls on countries and the international financial institutions to seize the moment to address long-standing weaknesses in the international debt architecture.&nbsp;&nbsp;</p>\n\n<h2>Participants at the High-level meeting&nbsp;</h2>\n\n<p>Moderated by BBC news anchor Laura Trevelyan, the meeting of Heads of State and Government will feature opening remarks by the UN Secretary-General and Prime Ministers Trudeau and Holness. It will also feature Heads of State and Government and include participation by IMF Managing Director Kristalina Georgieva, World Bank Group President David Malpass, OECD Secretary-General Ángel Gurría and WTO Director-General Ngozi Okonjo-Iweala.</p>\n\n<h2>About the High-level meeting</h2>\n\n<p>The high-level meeting will be webcast at:<strong> </strong><a href=\"http://webtv.un.org/\">http://webtv.un.org/</a></p>\n\n<p>The full list of speakers will be posted on the High-Level Event website, which can be found at: <a href=\"https://www.un.org/en/coronavirus/financing-development\">https://www.un.org/en/coronavirus/financing-development</a>.</p>\n\n<p>An embargoed copy of the Secretary-General’s Policy Brief can be found <a href=\"https://we.tl/t-qli1TpYORL\">here</a>.</p></div>\n      "
}