{
  "path": "/en/news/statements/2019/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p>\n\n<p>“On <a href=\"https://www.ohchr.org/EN/AboutUs/Pages/HumanRightsDay.aspx\">Human Rights Day</a>, we celebrate the universal values of equality, justice, and freedom, and reflect on how we can continue to make the vision of an equal and fair world a reality.</p>\n\n<p>“More than 70 years ago, the United Nations General Assembly adopted the <a href=\"http://www.un.org/en/universal-declaration-human-rights/\">Universal Declaration of Human Rights</a>. Drafted by representatives from around the world – including Canadian John Humphrey – this milestone document proclaimed that everyone is born free and equal in dignity and rights, no matter their identity, beliefs, or circumstances. This legacy – and that of the <em>Canadian Charter of Rights and Freedoms</em> – is the foundation of our work to prevent gender-based violence, fight racism, and end all forms of discrimination.</p>\n\n<p>“We cannot move forward without confronting the dark chapters of our past and taking meaningful action to advance reconciliation. We will continue to work in partnership to deliver on the distinct priorities of Indigenous peoples. This will include, among other things, action in the next year to implement the United Nations Declaration on the Rights of Indigenous Peoples.</p>\n\n<p>“Human rights are universal. We must be steadfast in our commitment and take action when injustices occur. That includes standing up for the fundamental rights of women and girls around the world. Canada is a global leader in the empowerment of women and girls, and we will continue to be a strong advocate for gender equality at home and abroad.</p>\n\n<p>“Protecting and defending human rights is a shared duty. Today, we honour all those who have dedicated their lives to uplifting others, and we commit to continuing their important work.</p>\n\n<p>“On behalf of the Government of Canada, I encourage Canadians to reflect on what we can all do to advance human rights — in our homes, workplaces, schools, digital spaces, and communities. Together, we can build a more equal, safer, and fairer world for generations to come.”</p></div>\n      "
}