{
  "path": "/en/news/news-releases/2019/04/17/prime-minister-announces-appointment-new-chief-justice-nova-scotia",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Michael J. Wood, a judge of the Supreme Court of Nova Scotia, to the position of Chief Justice of Nova Scotia.</p>\n\n<p>He replaces the Honourable J. Michael MacDonald, who retired effective February 1, 2019, after more than 24 years of distinguished service as a judge.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am happy to announce the appointment of Michael J. Wood as Chief Justice of Nova Scotia. Chief Justice Wood brings almost 30 years of experience practicing law in Halifax, and, more recently, nearly eight years as a judge on the province’s Supreme Court. I know his experience and expertise will be a great asset to the province’s Court of Appeal.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul type=\"disc\">\n\t<li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and on the recommendation of the Prime Minister.</li>\n\t<li>The Chief Justice of Nova Scotia is a judge of the Court of Appeal and exercises the duties of that office as part of a team of seven other regular judges and five supernumerary judges.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul type=\"disc\">\n\t<li><a href=\"/en/news/backgrounders/2019/04/17/honourable-justice-michael-j-wood\">The Honourable Michael J. Wood</a></li>\n</ul></div>\n      "
}