{
  "path": "/en/news/statements/2019/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/events/indigenousday/\">International Day of the World’s Indigenous Peoples</a>, we celebrate Indigenous peoples here in Canada and around the world.</p>\n\n<p>“First Nations, Inuit, and Métis peoples have shaped Canada’s history and identity. Their cultures have marked every aspect of our past and present, and today, to move forward as a country, Indigenous peoples must be able to thrive.</p>\n\n<p>“This year, we also mark the <a href=\"https://en.iyil2019.org/\">International Year of Indigenous Languages</a>. Languages play an essential role for Indigenous communities around the world. From sharing knowledge, to connecting communities, to passing culture and ways of life from one generation to the next, languages are fundamental to Indigenous identities and self-determination.</p>\n\n<p>“Yet in Canada and beyond, these languages are disappearing at an alarming rate. This loss threatens the cultures, traditions, self-determination, and survival of the Indigenous peoples who speak them. That is why our government has worked closely with Indigenous peoples to co-develop <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-indigenous-languages/legislation.html\">legislation to support the efforts of Indigenous peoples to reclaim, revitalize, maintain and strengthen Indigenous languages</a>.</p>\n\n<p>“Today, as we celebrate Indigenous cultures, we also recognize the injustices Indigenous peoples have faced in Canada and continue to face around the world. While we cannot change history, we are working to right persisting historic wrongs.</p>\n\n<p>“Working with Indigenous partners, the Government of Canada has taken steps to close the gaps in housing, health, education, and opportunity for Indigenous communities across the country. Since 2015, we’ve lifted 87 long-term drinking water advisories in First Nations communities. We’ve made important investments to make sure Métis Nation citizens have the housing they need. We’re also supporting Inuit-led approaches to eliminating tuberculosis across Inuit Nunangat by 2030. Together, we are building a better Canada, where everyone’s rights are recognized and respected.</p>\n\n<p>“In the spirit of reconciliation, we will continue to work with Indigenous peoples toward a renewed relationship based on the recognition of rights, respect, cooperation, and partnership. On behalf of the Government of Canada, I encourage everyone to learn more about the cultures and languages of Indigenous peoples, here in Canada and around the world.”</p></div>\n      "
}