{
  "path": "/en/news/statements/2020/05/03/statement-prime-minister-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Press Freedom Day:</p>\n\n<p>“Today, on World Press Freedom Day, we reflect on the crucial work of journalists in Canada and around the world. We also honour the dedicated journalists who have lost their liberty or their lives while in pursuit of the truth.</p>\n\n<p>“The theme of this year’s World Press Freedom Day is ‘<a href=\"https://www.un.org/en/observances/press-freedom-day\">Journalism without Fear or Favour</a>’. It reinforces the fact that press freedom cannot be achieved unless journalists can work safely, free from censorship, intimidation, and violence. When journalists and other media workers cannot investigate and report without interference, the public is deprived of reliable, accurate information and the foundation of our democracies starts to erode.</p>\n\n<p>“Freedom of expression and access to information are vitally important, even more so during the ongoing COVID-19 pandemic. Journalists are working tirelessly on the front lines, at home, and abroad to report on a rapidly evolving global health crisis. But they are doing much more than that: they are keeping us informed and helping us stay safe.</p>\n\n<p>“A free-thinking, independent, and respected media is the cornerstone of any democracy. One cannot exist without the other. That is why Canada continues to defend <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/freedom_expression_media-liberte_expression_medias.aspx?lang=eng\">press freedom</a> and condemn all attempts to stifle the press. It is also why, together with other members of the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/2020-04-06-media_freedom-liberte_medias.aspx?lang=eng\">Media Freedom Coalition</a>, Canada calls on all states to protect access to free media and support the free exchange of information during this pandemic.</p>\n\n<p>“Today, we recognize all the journalists and media workers who start conversations, shine light on stories that would otherwise not be told, expose injustices, and hold the powerful to account – often at great personal risk. They are a vital part of all healthy democracies and, through their work, they spur change and increased transparency that benefit all of us.”</p></div>\n      "
}