{
  "path": "/en/news/statements/2017/09/22/joint-statement-prime-minister-trudeau-and-president-poroshenko",
  "pageTitle": "Joint Statement by Prime Minister Trudeau and President Poroshenko | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, and the President of Ukraine, Petro Poroshenko, meeting today on the margins of the Invictus Games in Toronto, in which Ukrainian servicemen and women are participating for the first time, affirmed strong and enduring ties between Canada and Ukraine and their joint commitment to the continued deepening of bilateral relations.</p><p>“This year, as we celebrate the 25th anniversary of the establishment of diplomatic relations between Canada and Ukraine, we reflect on the important milestones achieved since we last met in Kyiv in July 2016.</p><h2>Expanding Economic Opportunities</h2><p>“The entry into force of the Canada-Ukraine Free Trade Agreement (CUFTA) represents a historic moment in our bilateral relations. We are committed to working closely together to ensure that Canadians and Ukrainians alike can take advantage of the benefits of CUFTA as soon as possible.</p><p>“Through the implementation of this agreement, we are looking forward to boosting bilateral trade between Ukraine and Canada in agriculture, information technology, energy and aerospace. Under CUFTA’s two-year review clause, we will examine the possibility of extending CUFTA’s coverage to additional areas, such as services and investment.</p><h2>Enhancing Security Cooperation</h2><p>“Canada is unequivocal in its support for Ukraine’s sovereignty and territorial integrity. Canada reiterates its non-recognition of Russia’s illegal annexation of Crimea and continues to condemn Russian military aggression in Donbas. Canada is committed to maintaining pressure on Russia to respect Ukraine’s sovereignty and territorial integrity and to implement fully its Minsk commitments, including through ongoing sanctions.</p><p>“Operation UNIFIER supports the important military training and capacity building efforts undertaken by Ukraine to maintain its sovereignty and security, while fostering a mutually-beneficial learning environment for both Canadian and Ukrainian Armed Forces.</p><p>“Canada will continue to support Ukraine’s progress towards Euro-Atlantic integration and to adopt and implement NATO standards through its ambitious agenda of reforms. Canada values Ukraine’s commitment to its relationship with NATO and its significant contributions to Allied operations. Against the backdrop of shared security challenges, we reaffirm our common interest in international peace through our bilateral Defence Cooperation Arrangement (DCA) and our shared commitment to advancing Ukraine’s defence reform agenda. Canada supports Ukraine’s goal of achieving NATO interoperability by 2020, providing both tactical training and strategic advice.</p><h2>Sharing Common Values</h2><p>“Canada shares&nbsp;a strong bond with Ukraine, rooted in generations of Ukrainian migration to Canada. We look forward to building on our strong people-to-people ties, including through the promotion of youth mobility, to forge new bonds between our countries for generations to come.</p><p>“We recognize the strong progress made in Ukraine’s reform efforts and the launch of Agenda 2020, as well as Canada’s contribution to that progress. Sustained effort will be critical to ensuring durable institutional transformation, unblocking obstacles to reform and unlocking Ukraine’s full potential. We are guided in our efforts and in our outlook by our shared commitment to the values of inclusivity and respect for diversity.”</p></div>\n      "
}