{
  "path": "/en/news/news-releases/2021/11/25/prime-minister-announces-appointment-chief-defence-staff",
  "pageTitle": "Prime Minister announces the appointment of the Chief of the Defence Staff | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that General Wayne Eyre has been appointed to the position of Chief of the Defence Staff.</p>\n\n<p>General Eyre spent the majority of his career in command or deputy command positions. He was previously deployed to Cyprus, Croatia, and Bosnia, and served in Afghanistan twice – first in the Canadian Operational Mentor and Liaison Team in Kandahar, then as the Commanding General of NATO Training Mission. As Deputy Commander of United Nations Command Korea, he became the most senior Canadian officer ever permanently stationed in the Asia-Pacific region. Here at home, he commanded various disaster relief operations, including the military response to both the 2015 Saskatchewan wildfires and the 2016 Fort McMurray evacuation. He was appointed Commander of the Canadian Army in August 2019 and was promoted to the rank of General in August 2021.</p>\n\n<p>As Chief of the Defence Staff, General Eyre will oversee the Canadian Armed Forces’ ongoing operations in Canada and around the world, including the emergency assistance currently being provided to individuals and communities impacted by the floods, landslides, and extreme weather conditions in British Columbia. He will also keep working toward the full implementation of our national defence policy, <a href=\"https://www.canada.ca/en/department-national-defence/corporate/policies-standards/canada-defence-policy.html?utm_source=dgpaapp&amp;utm_medium=referral&amp;utm_campaign=redirect\"><em>Strong, Secure, Engaged</em></a>, to deliver the standard of service and care Canadians in uniform deserve, and the modernization of the North American Aerospace Defence Command (NORAD).</p>\n\n<p>As Chief of the Defence Staff, General Eyre will continue the work to transform the culture of the Canadian Armed Forces to ensure&nbsp;zero tolerance for sexual misconduct and harassment while eliminating hateful conduct and systemic racism from the organization. Every person serving in our Armed Forces deserves a safe and respectful work environment, and eliminating all misconduct is the top priority of the Government of Canada and the Canadian Armed Forces.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Throughout his career, General Eyre has demonstrated dedicated service to his country and to Canadians. Over the past year, his lived experience has played a vital role in providing strong leadership, and helping Canadians across the country as they faced important and increasingly difficult challenges. General Eyre will continue working hard to build and oversee cultural change in the Canadian Armed Forces, and to gain trust and confidence of survivors of sexual misconduct.&nbsp;I know he will keep leading our Armed Forces with distinction and professionalism as they continue to protect Canadians and their values at home and abroad.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I sincerely congratulate General Wayne Eyre on his appointment as Chief of the Defence Staff.&nbsp;General Eyre and I will continue to work together to build a military where all members feel safe, protected, and respected, wherever they are, whatever they are doing.&nbsp;The Canadian Armed Forces form a crucial element of our nation’s fabric, and I look forward to working with&nbsp;General Eyre&nbsp;as we tackle the important issues facing&nbsp;Canada, now and in the future.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>General Eyre was appointed as Acting Chief of the Defence Staff in February&nbsp;2021.</li>\n\t<li>The Chief of the Defence Staff is responsible for the command, control, and administration of the Canadian Armed Forces, as well as military strategy, plans, and requirements.</li>\n\t<li>The Chief of the Defence Staff is appointed by the Governor in Council, on the recommendation of the Prime Minister. The Governor in Council is the Governor General acting on the advice of Cabinet. As commander-in-chief of Canada, the Governor General plays a major role in recognizing the importance of Canada’s military at home and abroad.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/11/25/general-wd-eyre-cmm-msc-cd\">General Wayne Eyre</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/corporate/organizational-structure/chief-defence-staff.html\">Chief of the Defence Staff</a></li>\n</ul></div>\n      "
}