{
  "path": "/en/news/news-releases/2019/01/14/prime-minister-announces-changes-ministry",
  "pageTitle": "Prime Minister announces changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the Ministry and welcomed new members to Cabinet:</p><ul><li><b>Jane Philpott</b>, currently Minister of Indigenous Services and Vice-Chair of the Treasury Board, becomes President of the Treasury Board and Minister of Digital Government.</li></ul><ul><li><b>Seamus O’Regan</b>, currently Minister of Veterans Affairs and Associate Minister of National Defence, becomes Minister of Indigenous Services.</li></ul><ul><li><b>Jody Wilson-Raybould</b>, currently Minister of Justice and Attorney General of Canada, becomes Minister of Veterans Affairs and Associate Minister of National Defence.</li></ul><ul><li><b>David Lametti</b>, currently Parliamentary Secretary to the Minister of Innovation, Science and Economic Development, becomes Minister of Justice and Attorney General of Canada.</li></ul><ul><li><b>Bernadette Jordan</b>, currently Parliamentary Secretary to the Minister of Democratic Institutions, becomes Minister of Rural Economic Development.</li></ul><p>Rural economies drive our success as a country. As Minister of Rural Economic Development, Minister Jordan will oversee the creation of a rural development strategy to spur economic growth and create good, middle class jobs in rural Canada. She will also take action to bring high-speed internet to more rural households and businesses, and work with municipalities, provinces, territories, and Indigenous partners to meet the unique and diverse infrastructure needs of rural communities.</p><p>Effective immediately, the Honourable Scott Brison has resigned from his position as President of the Treasury Board and Minister of Digital Government. The Prime Minister thanked Mr. Brison for his outstanding contributions as a member of Cabinet, and for his decades of service to Nova Scotians and all Canadians.</p><h2>Quick Facts</h2><ul><li>The Government of Canada has taken concrete measures to provide Canadians in rural and remote areas with access to voice services and broadband Internet access, including providing:<ul><li>$500 million by 2021 through the <a href=\"https://www.ic.gc.ca/eic/site/119.nsf/eng/home\">Connect to Innovate program</a> to support new and updated infrastructure and bring high-speed Internet to 300 rural and remote communities in Canada.</li><li>$750 million over five years through the <a href=\"https://www.canada.ca/en/radio-television-telecommunications/news/2018/09/crtc-announces-details-of-the-broadband-fund.html\">CRTC’s Broadband Fund</a> to support projects to build or upgrade infrastructure and provide fixed and mobile wireless broadband Internet service to underserved Canadians.</li><li>Canadian telecommunications businesses with the ability to more quickly write off a larger share of the cost of investments in broadband infrastructure through the new Accelerated Investment Incentive.</li></ul></li><li>Since November 2015, the Government of Canada has invested more than $5.85 billion in funding for local infrastructure projects in rural and northern communities.</li><li>Minister Jordan will be the first female minister to represent a federal riding in Nova Scotia in Canadian history.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li></ul></div>\n      "
}