{
  "path": "/en/news/news-releases/2017/07/29/prime-minister-announces-funding-complete-redevelopment-winnipegs",
  "pageTitle": "Prime Minister announces funding to complete redevelopment of Winnipeg’s Assiniboine Park | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s cultural and recreational industries make invaluable contributions to our society. They help grow our economy, reflect our creativity and diversity, and strengthen our understanding of what it means to be Canadian.</p><p>The Prime Minister, Justin Trudeau, today announced that the Government of Canada will provide up to $35 million in funding to build Canada’s Diversity Gardens at Assiniboine Park in Winnipeg. The Gardens will use living plants to showcase Canada’s biodiversity and multicultural heritage.</p><p>Visitors to the Gardens will have the chance to connect with nature through indoor biomes and outdoor natural areas, and to learn about relationships between people and plants throughout Canada’s past and present. The four cornerstone exhibits will include an Indigenous Peoples’ Garden, which will celebrate Canada’s Indigenous heritage.</p><p>The Gardens will not only help visitors reconnect with the natural world and their history; they will also generate good, well-paying jobs for the middle class and attract more tourists to Winnipeg. As part of Assiniboine Park, the Gardens will support local businesses and increase tourism revenue.</p><h2>Quote</h2><blockquote><p>“Canada’s cultural and recreational sites provide Canadians and their families with spaces to have fun and be active. The Diversity Gardens will soon join the host of world-class sites in Manitoba where residents and tourists can celebrate Canada’s biodiversity, our multicultural heritage, and the importance of nature in our lives. The project will also create good, well-paying jobs here in Winnipeg for the middle class and those working hard to join it.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Founded in 1904, Assiniboine Park is one of Manitoba’s most visited attractions, receiving over 4.5 million visitors a year.</li><li>In 2009, the Assiniboine Park Conservancy began a ten-year Master Development Plan. The first phase focused on renewal and investments in the park’s community-oriented spaces, such as the Children’s Garden and Nature Playground. The second phase involved the ongoing revitalization and modernization of the Assiniboine Park Zoo. Canada’s Diversity Gardens are the third and final phase of the $200 million Assiniboine Park and Zoo redevelopment plan. The Government of Canada provided $1 million in funding to the earlier phases of the plan.</li><li>The Government of Canada’s contribution will cover approximately 50 per cent of the cost of the Gardens. The Government of Manitoba will contribute $15 million and the City of Winnipeg will contribute $10 million to the Gardens, with private donors providing an additional $15 million.</li><li>The Government of Canada’s funding is provided under the Provincial-Territorial Infrastructure Component of the New Building Canada Fund.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://assiniboinepark.ca/park-landing/home/support-us/canadas-diversity-gardens\">Canada’s Diversity Gardens</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/nbcf-nfcc-eng.html\">New Building Canada Fund</a></li></ul></div>\n      "
}