{
  "path": "/en/news/news-releases/2018/04/27/prime-minister-travel-united-states",
  "pageTitle": "Prime Minister to travel to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to the United&nbsp;States from May 16 to 18, 2018.</p><p>During the visit – which includes stops in New York and Boston – the Prime Minister will highlight the strong economic partnership between the United States and Canada, and the importance of working together to find solutions to global challenges.</p><p>In New York City, the Prime Minister will speak to graduates at New York University’s 186th commencement ceremony and accept an honourary doctor of laws degree. The Prime Minister will also address the Economic Club of New&nbsp;York to promote Canada as one of the best places to invest, and to underscore how the Canada-U.S. partnership creates good, middle class jobs and economic opportunities on both sides of the border.</p><p>In Boston, the Prime Minister will participate in the Solve at MIT conference, a flagship event that brings together more than 300 leaders – from businesses, foundations, non-profit organizations, government, academia, and the media – to explore innovative solutions to the world’s most pressing challenges, including those related to health, education, infrastructure, energy, and food production.</p><h2>Quote</h2><blockquote><p>“We live in a time of tremendous change and face challenges global in scale. Finding solutions shaped across borders, involving every generation, is imperative. I look forward to visiting the United States to speak with graduates and those at the forefront of innovation to look at what we can – and must – do to build a better tomorrow for future generations.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau last visited the United States in February 2018.</li><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade in goods and services between the two countries was valued at more than $918&nbsp;billion in 2017, and Canada is the largest secure supplier of energy to the U.S.</li><li>The two countries share the longest secure border in the world, over which some 400,000 people and $2.4 billion worth of goods and services cross daily.</li><li>Canada buys more goods from the United States than China, Japan, and the UK combined.</li><li>Canada is the number one export destination for most American states, and cross-border trade and investment supports nearly nine millions jobs in the United States.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States Relations</a></li></ul></div>\n      "
}