{
  "path": "/en/news/statements/2023/05/01/statement-prime-minister-trudeau-mental-health-week",
  "pageTitle": "Statement by the Prime Minister on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p>\n\n<p>“Today, we mark the beginning of <a href=\"https://www.mentalhealthweek.ca/\">Mental Health Week</a>, a time to raise awareness about the importance of mental health and encourage Canadians to prioritize their mental well-being – because mental health is health. Just like our physical health, we all have to take care of our mental health, too.</p>\n\n<p>“For many Canadians, getting the right mental health care has been challenging. That is why, this week, the Government of Canada reaffirms its commitment to improving mental health supports from coast to coast to coast. For example, we are providing historic funding to provinces and territories to improve and increase the availability of mental health and addiction services. We also created the <a href=\"https://www.wellnesstogether.ca/en-CA\">Wellness Together Canada</a> portal, which provides 24-hour, free, and confidential mental health and substance use resources to all Canadians, in over 200 languages.</p>\n\n<p>“We still have work to do to improve mental health care in Canada. As part of our significant investment to increase health care funding by more than $198&nbsp;billion over the next 10 years, we are ensuring that provinces and territories make mental health care an integral part of our systems across the country. And by November 30, 2023, Canadians’ access to immediate suicide prevention and emotional distress support services will become much easier when the new three-digit&nbsp;988 number launches.</p>\n\n<p>“During this year’s Mental Health Week, I invite all Canadians to promote open and honest conversations about mental health so we can continue to end the stigma. This year’s theme “My Story” is about sharing stories and experiences with each other, and by doing that we can all make a difference and make sure no one has to fight their battle alone. Together, we can build a healthier future for all Canadians.”</p>\n\n<p>If you or someone you know is thinking about suicide, call Talk Suicide Canada at 1-833-456-4566 – lines are open 24/7/365. Additional resources can also be accessed through the&nbsp;<a href=\"https://www.wellnesstogether.ca/en-CA\">Wellness Together Canada&nbsp;</a>portal.</p></div>\n      "
}