{
  "path": "/en/news/statements/2022/10/11/statement-prime-minister-international-day-girl",
  "pageTitle": "Statement by the Prime Minister on the International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the Girl:</p>\n\n<p>“On the<sup> </sup>10th anniversary of the <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month/international-day-girl-child.html\">International Day of the Girl</a>, we celebrate the power of girls everywhere by championing their human rights here at home and around the world.</p>\n\n<p>“This year’s theme,&nbsp;‘<a href=\"https://www.un.org/en/observances/girl-child-day\">Our time is now – our rights, our future</a>’, is particularly timely as women, girls, and students in Iran bravely stand up to the oppressive Iranian regime. They have the right to live their lives, to make their own choices, and to express themselves peacefully. We are standing with them. That’s why, last week, Canada announced further measures against the Iranian regime and its so-called “morality police,” and we will continue to use every tool at our disposal to implement the most robust sanctions in the world.</p>\n\n<p>“Canada is a global leader and champion for advancing gender equality, human rights, and the empowerment of women and girls in all their diversity. That is why they are central to our efforts to implement the United Nations’ (UN) 2030 Agenda for Sustainable Development and at the heart of our <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance/commitment/feminist-international-assistance-policy.html\">Feminist International Assistance Policy</a>. Through this policy, we are working with our international partners to help reduce inequality, address the unique challenges faced by girls and women, and ensure their human rights are respected. This includes supporting targeted programming such as Girls Not Brides, UN agencies, and grassroots organizations in developing countries, to help adolescent girls stay in school, remain healthy, and decide their own future. Canada will continue to support and empower girls and women around the world so that they can be changemakers and drive progress in their communities toward a brighter future.</p>\n\n<p>“The International Day of the Girl takes place during <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a>, which is recognized each October across Canada. On this occasion, I encourage all Canadians to continue standing up for girls, now and into the future.”</p></div>\n      "
}