{
  "path": "/en/news/statements/2021/07/26/tshishe-utshimau-e-pitshitinak-utaiamun-tshetshi-pushukatakan-tshishe",
  "pageTitle": "Tshishe-Utshimau e pitshitinak utaiamun tshetshi pushukatakan tshishe-utshimashkueu tshishe-utshimau, e nishtinue-tshishe-utshimashkueuat Mary Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Tshishe-utshimau JustinTrudeau uitamupan umenu aiamunu tshetshi pushukatat Tshishe-utshimashkueu Mary Simon tshi uitshi-atussemat:</p>\n\n<p>« Nin e tatshitishkueuat Utaua- tshishe-utshimau, ni mishta ashinan kie niminueniten tshe pushukatukᵘ ue tshe nishtinue-tshishe-utshimahskkueuat tshe uitshi atussemat tshishe-utshimau.</p>\n\n<p>« Nete u Nunaviik utshiu nete tshiuetin, utshimashkueu nanitam atusseshtuepam uitshinimᵘ nete ushka e tat. Mishta-tshishpeuatam utipenitamun kie nenu e ishi-inniutau essimeuat, ussinitshishut, ussinitshishkuessa, akua e tutakan assu, kie mitshetui tshissinishtuakanipan utatusseuan. Kie ekuan ne essimeu-ishkueu ushkat e pimutaut utaimunnu mak e uauitak e ishi-inniunanut ute Canada.</p>\n\n<p>«&nbsp;Ishpish atusset mishta-ashtapam utatapaikan kie shutshenitamupan tshetshi nikanapanitat atusseuan nete innit miam mate auassat, e ishi- inniuananunit e ishi animinanunit, nete pikassun mak e tshishpeuatakan innu. Iat nene atusseshtamupan tshetshi nishtuapamakanit essimeuat ute Canada mak nutimᵘ e ishpitishkamikat assit. Nissenimau nenu e utinak atusseunnu tshetshi uitshi-atussemikuian tshet tshishpeuatak e ishi inniunanunit ute Canada, Ishpishanu utshissinenitamun kie ishpish nitau autsseu tshetshi nishtiapaminiuet Canada e ishi-inniunanunit kie kassinu aitshit e ishiniunanut tan ua ishi aimit ute Canada. Iat nin e tshishe-utshimau atusseian nete ashimakanishiu-atusseuan, tshika shutshiteieshkueu ashimakanishinit, anitshenat e mishta ashtat utitapaikanuau e tshishpeuatak kie akua e tutuatau innu ute Canada.</p>\n\n<p>« Ume anutshish e ishinakuat nika minu-tshissinuashtan, ushma ume mekuat e ishpin ute miam mate anitshenat innu-auassat ka mishkuanutshenit. Nitshissenimau umenu e utinak atusseunu ute Canada, ne utshimashkueu, tshika ushtishkapushtimᵘ mamu tshetshi atusseshtamat, tshetshi mamu nikanitanut minu-uitsheutunanut.</p>\n\n<p>«&nbsp;Anutshish kashikat, tshishe-utshimashkueu Elizabeth II, shash kutushtutunue-pupunna ashu peikushteu ishpish tshishe-utshimashkuuat, atusseshtamᵘ Commonwealth mak nenu iat nete mamu ka apitau. Ekuannu nen kutunnu ashu nisht e uinat ne tshishe-utshimashkuau tshetshi uitshi-atussemanan tshishe-utshimau, ishpish tsheshe utshimashkuaut 1952, pupunna.</p>\n\n<p>« Ninashkumanan utshimashkueu Mary Simon ka tshi utinak nenu atusseunu tshetshi uitshi-atussenimikuiat, kie ni mishta-pushukatanan. Kassini ute Canada innuat nuishaman tshetshi tshissinishuashtat kie tshetshi nashakuiat ne ua nikaniteiat. Kie kassinu nuishamanan tshetshi pushikatatau kie tshetshi pukushenimatau tshetshi minupanit nete utatusseunit ne anu uet tshishe-inniumikuat ute atusseun ute Canada.&nbsp;»</p>\n\n<h2>Nete katusseutshitapatakan</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Prime Minister announces The Queen’s approval of Canada’s next Governor General</a></li>\n</ul></div>\n      "
}