{
  "path": "/en/news/statements/2015/12/15/statement-prime-minister-release-final-report-truth-and-reconciliation",
  "pageTitle": "Statement by Prime Minister on release of the Final Report of the Truth and Reconciliation Commission | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement after receiving the Final Report of the Truth and Reconciliation Commission:</p>\n<p>“The Indian residential school system, one of the darkest chapters in Canadian history, has had a profoundly lasting and damaging impact on Indigenous culture, heritage, and language. As a father and a former teacher, I am overwhelmingly moved by these events.</p>\n<p>“Seven years ago the Government of Canada apologized for this abhorrent system. The apology is no less true, and no less timely, today. The Government of Canada ‘sincerely apologizes and asks forgiveness of the Aboriginal peoples of this country for failing them so profoundly’.</p>\n<p>“Today, on behalf of the Government of Canada, I have the honour of accepting the Commission’s Final Report. It is my deepest hope that this report and its findings will help heal some of the pain caused by the Indian residential school system and begin to restore the trust lost so long ago.</p>\n<p>“To the former Indian residential school students who came forward and shared your painful stories, I say: thank you for your extraordinary bravery and for your willingness to help Canadians understand what happened to you. As the previous government expressed so eloquently in its formal apology: your courage ‘is a testament to [your] resilience as individuals and to the strength of [your] cultures...The burden of this experience has been on your shoulders for far too long. The burden is properly ours as a government, and as a country’.</p>\n<p>“Moving forward, one of our goals is to help lift this burden from your shoulders, from those of your families, and from your communities. It is to accept fully our responsibilities – and our failings – as a government and as a nation.</p>\n<p>“This is a time of real and positive change. We know what is needed is a total renewal of the relationship between Canada and Indigenous peoples. We have a plan to move towards a nation-to-nation relationship based on recognition, rights, respect, cooperation and partnership, and we are already making it happen.</p>\n<p>“A national inquiry into missing and murdered Indigenous women and girls is now underway. Ministers are meeting with survivors, families, and loved ones to seek their input on how best to move forward. We have also reiterated our commitments to make significant investments in First Nations education, and to lift the two per cent cap on funding for First Nations programs.</p>\n<p>“And we will, in partnership with Indigenous communities, the provinces, territories, and other vital partners, fully implement the Calls to Action of the Truth and Reconciliation Commission, starting with the implementation of the United Nations Declaration on the Rights of Indigenous Peoples.</p>\n<p>“We recognize that true reconciliation goes beyond the scope of the Commission’s recommendations. I am therefore announcing that we will work with leaders of First Nations, Métis Nation, Inuit, provinces and territories, parties to the Indian Residential School Settlement Agreement, and other key partners, to design a national engagement strategy for developing and implementing a national reconciliation framework, informed by&nbsp; the Truth and Reconciliation Commission’s recommendations.</p>\n<p>“The Government of Canada is committed to walking a path of partnership and friendship with Indigenous peoples. Today’s Final Report marks a true milestone on that journey. Again I thank the survivors, their families, and communities for this monumental achievement towards healing and reconciliation. I also thank Commission Chair Justice Murray Sinclair, and Commissioners Chief Wilton Littlechild and Dr. Marie Wilson who worked tirelessly to bring to light the truth about residential schools in Canada.”</p>\n<p><strong>Related Product:</strong></p>\n<ul>\n<li>Backgrounder: <a href=\"/en/news/backgrounders/2015/12/15/final-report-truth-and-reconciliation-commission-canada\">Final Report of the Truth and Reconciliation Commission of Canada</a><a href=\"#_msocom_1\"></a></li>\n</ul></div>\n      "
}