{
  "path": "/en/news/readouts/2021/05/11/prime-minister-justin-trudeau-speaks-prime-minister-singapore-lee-hsien",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Singapore Lee Hsien Loong | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Singapore, Lee Hsien Loong.</p>\n\n<p>The leaders reaffirmed the close ties between Canada and Singapore and discussed ways to enhance bilateral economic relations in the areas of infrastructure development, clean tech, artificial intelligence, and aerospace as well as the prospects for a Canada-Association of Southeast Asian Nations (ASEAN) free trade agreement (FTA). The prime ministers welcomed positive momentum in trade relations as a result of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership and the growing substantive relationship between Canada and ASEAN, noting that launching the FTA discussions is an economic priority for ASEAN this year.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Lee welcomed progress towards the renewal of the bilateral cybersecurity Memorandum of Understanding (MoU), first signed during Prime Minister Trudeau’s visit to Singapore in 2018. Under the MoU, both countries share best practices and work together to build the cybersecurity capacity of regional countries. Prime Minister Trudeau also noted Canada’s interest in joining the Digital Economy Partnership Agreement and working together to support small and medium-sized enterprises to expand into new markets.</p>\n\n<p>The prime ministers discussed regional issues and the need for a cooperative global approach to issues like climate change and economic development. They also discussed the shared challenges in their respective efforts to contain the COVID-19 pandemic and the importance of international cooperation to ensure a speedy global recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/singapore-singapour/bilateral_relations_bilaterales/canada_singapore-singapour.aspx?lang=eng\">Canada-Singapore Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/minister-ng-leads-virtual-trade-mission-to-singapore-on-e-commerce.html\">Minister Ng leads virtual trade mission to Singapore on e-commerce</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/asean-anase/fta-ale/background-contexte.aspx?lang=eng\">Exploratory discussions for a possible Canada-ASEAN free trade agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new\">Prime Minister announces additional support for equitable access to new COVID-19 medical solutions</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}