{
  "path": "/en/news/statements/2022/04/07/statement-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</p>\n\n<p>“Today, we celebrate <a href=\"https://www.who.int/campaigns/world-health-day/2022\">World Health Day</a> and the founding of the <a href=\"https://www.who.int/en/\">World Health Organization</a> (WHO). This year’s theme – ‘Our planet, our health’ – reminds us that our health and well-being is fundamentally connected to the health of our planet. The crises of climate change and rapid biodiversity loss are health crises too.</p>\n\n<p>“Taking real action to confront the climate crisis and protect our environment will deliver clean air and clean water for Canadians – as well as their associated health benefits – now and into the future.</p>\n\n<p>“Canadians are seeing the impacts of climate change in their communities right across the country through wildfires, floods, drought and other extreme weather events. These disasters threaten our air quality, our supply of safe, clean water, and impact our food safety and security.</p>\n\n<p>“Climate change is also a driver of infectious disease spread, such as Lyme disease, which has become more prominent in Canada as blacklegged ticks move farther north as the climate warms. Climate-related disasters directly affect people’s mental health, particularly amidst the COVID-19 pandemic, and intensify the anxiety, grief, and trauma that they experience.</p>\n\n<p>“The Government of Canada is taking real action to confront the climate crisis and adapt to its impacts. Just last week, we released the <em>2030 Emissions Reduction Plan: Canada’s Next Steps to Clean Air and a Strong Economy,</em> an ambitious and achievable roadmap to reach our climate target of cutting emissions by at least 40 per cent below 2005 levels by 2030, and put us on track toward achieving net-zero emissions by 2050. By the end of the year, our government will deliver Canada’s first-ever <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/national-adaptation-strategy.html\">National Adaptation Strategy</a>, in collaboration with partners across the country – including provincial, territorial, and municipal governments and Indigenous Peoples. Together, these actions will fight climate change, protect Canadians and our communities from its impacts, and deliver better health outcomes for everyone.</p>\n\n<p>“As we have seen in recent years, global health crises like the pandemic and climate change affect us all. By continuing to take real action on climate change, we will deliver clean air, clean water, and a healthy environment for generations to come.”</p></div>\n      "
}