{
  "path": "/en/news/statements/2021/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p>\n\n<p>“Happy New Year, Canada!</p>\n\n<p>“After a second year marked by the COVID-19 pandemic, tonight will be a time for us to pause and reflect on the successes and challenges we have experienced as a country over the past 12 months, and to look forward to the road ahead with renewed hope and determination.</p>\n\n<p>“In 2021, the pandemic continued to have a significant impact on our lives. Everyone has had to make sacrifices to keep each other safe. We lost loved ones and members of our communities, while many lost their homes or livelihoods due to extreme weather conditions across the country. We were also confronted with the legacy of Canada’s historical wrongs as we witnessed the findings of unmarked graves and burial sites near former residential schools. But over the past 12 months, we have also seen Canadians come together, adapt to new realities, and do their part to help build a better tomorrow – with kindness, resilience, and hard work.</p>\n\n<p>“As everyone traded handshakes for elbow bumps and continued wearing their masks, together we rolled up our sleeves to get vaccinated so that we could get back to the things we love. With the threat of new variants, vaccination remains our best line of defence against COVID‑19, and we will need to keep working together in 2022 to put this pandemic behind us.</p>\n\n<p>“From the fall of 2020 to the fall of 2021, more than one million Canadians returned to work, and last month the unemployment rate was the lowest since the start of the pandemic. As we ring in the new year, the government remains committed to putting Canadians first and investing in their future, including by providing them with the support they need to get through this crisis. In 2022, we will keep taking meaningful steps to create jobs, put home ownership back in reach, and make life more affordable for the middle class and people working hard to join it. We will get the job done on delivering an average of $10-a-day child care for families, and we will take a Team Canada approach to build a more resilient health care system, strengthen long-term care, and improve access to mental health services. Much work remains to be done, but we will meet the moment and keep moving forward.</p>\n\n<p>“The record heat waves, wildfires, and floods that have affected so many Canadians over the past year are a stark reminder that climate change is real and that we need to address it head-on. In the coming year, we will be moving faster than ever to fight the climate crisis, create jobs and economic growth, and build a cleaner future.</p>\n\n<p>“This year has been particularly difficult for Indigenous Peoples in Canada – deep wounds were reopened as we were faced with the hard truths of our past and its ongoing, tragic legacy. We must continue to tell these truths, support the process of healing that leads to reconciliation, and work together to eliminate the injustices experienced by many Indigenous Peoples. In 2022, the Government of Canada will make further progress toward addressing the impacts of residential schools and the national tragedy of missing and murdered Indigenous women, girls, and 2SLGBTQQIA+ people, while continuing to respond to the Truth and Reconciliation Commission of Canada’s Calls to Action and implement the <em>United Nations Declaration on the Rights of Indigenous Peoples Act</em>. We will accelerate our work to close the gaps that far too many First Nations, Inuit, and Métis still face today, and we must continue to do this in partnership so that Indigenous Peoples can feel safe and respected, and have a fair and equitable chance at success.</p>\n\n<p>“I know that the incredible strength, determination, and compassion we have seen in our communities over the past year will keep inspiring and guiding us in the new year. Tonight, as we count down to midnight, let us celebrate all that unites us and recommit to looking out for one another. Drawing on the hard lessons of the past two years, we will finish the fight against this pandemic and rebuild a Canada that is stronger, fairer, and more equitable. On behalf of our family, Sophie and I wish you a wonderful night and a very happy New Year.”</p></div>\n      "
}