{
  "path": "/en/news/readouts/2022/11/17/prime-minister-justin-trudeau-meets-president-chile-gabriel-boric",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Chile Gabriel Boric | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Chile, Gabriel Boric, on the margins of the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting.</p>\n\n<p>The two leaders discussed the close cooperation between their countries on a wide range of regional and global issues, including holding Russia to account for its unjustifiable invasion of Ukraine, supporting Haiti during the evolving security and humanitarian situation, strengthening environmental and ocean protection, promoting gender equality, and advancing inclusive trade and economic growth. The two leaders also discussed the outcomes of the G20 Summit in Bali, Indonesia.</p>\n\n<p>The leaders emphasized the benefits of pollution pricing, and underscored the need for more countries to adopt this measure, with a goal of reducing 60 per cent of global emissions by 2030. Both leaders also agreed on the importance of ongoing efforts to halt biodiversity loss around the world.</p>\n\n<p>Prime Minister Trudeau and President Boric were also joined the signing of the Canada-Chile Joint Declaration on Investment Treaty Practice by Canada’s Minister of International Trade, Export Promotion, Small Business and Economic Development, Mary Ng, and Chile’s Undersecretary of International Economic Relations, José Miguel Ahumada.</p>\n\n<p>Prime Minister Trudeau and President Boric looked forward to staying in regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/chile-chili/relations.aspx?lang=eng\">Canada-Chile relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/30/prime-minister-justin-trudeau-speaks-president-chile-gabriel-boric\">Prime Minister Justin Trudeau speaks with President of Chile Gabriel Boric</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/06/canada-chile-announcement-carbon-pricing\">Canada-Chile announcement on carbon pricing</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}