{
  "path": "/en/news/readouts/2020/06/25/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their fifteenth weekly call&nbsp;with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic. As part of First Ministers’ ongoing commitment to combat systemic racism and discrimination in Canada, today First Ministers also issued a joint statement and this evening reiterated the importance of taking action to fight racism and discrimination in Canada.</p>\n\n<p>First Ministers discussed their ongoing efforts to safely restart the economy. They continued their discussions on an agreement to address critical needs across the country over the next six to eight months, with the support of a $14 billion contribution from the Government of Canada, to minimize the impact of future waves of COVID-19. The federal funding will provide paid sick leave to workers, assist efforts by provinces and territories to significantly ramp up testing and contact tracing, and secure a sufficient supply of personal protective equipment. It will also help ensure health care systems have the capacity to manage future outbreaks, help meet the needs of vulnerable populations, protect child care centres, and support essential municipal services. The Prime Minister also highlighted progress being made to procure personal protective equipment that will help ensure the safety and wellbeing of Canadians, and support reopening efforts.</p>\n\n<p>The Deputy Prime Minister updated premiers on Canada-United States trade issues, including aluminum trade and next week’s entry into force of the new NAFTA, and First Ministers discussed ongoing border measures.&nbsp;</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, and the need to closely coordinate their efforts moving forward.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/06/25/first-ministers-statement-anti-racism\">First Ministers’ statement on anti-racism</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/16/prime-minister-announces-extension-canada-emergency-response-benefit\">Prime Minister announces extension of the Canada Emergency Response Benefit</a></li>\n</ul></div>\n      "
}