{
  "path": "/en/news/news-releases/2016/10/17/prime-minister-announces-nomination-mr-justice-malcolm-rowe-supreme",
  "pageTitle": "Prime Minister announces nomination of Mr. Justice Malcolm Rowe to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of <a href=\"/en/news/backgrounders/2016/10/17/malcolm-rowe\">Mr. Justice Malcolm Rowe</a> for the Supreme Court of Canada.</p><p>First appointed as a trial judge in 1999, Mr. Justice Rowe has sat on the Court of Appeal of Newfoundland and Labrador since 2001. Throughout his distinguished career, working for the Federal Government, the Government of Newfoundland and Labrador, and in private law practice, he was involved in constitutional matters, foreign relations, the arbitration of maritime boundaries, and the negotiation of conventional law through the United Nations. Since being appointed to the bench, he has made a remarkable contribution to the area of sentencing law. Justice Rowe’s deep knowledge of criminal, constitutional, and public law has made him an ideal candidate to sit on Canada’s highest court.</p><p>This is the first nomination by the Government of Canada under its new Supreme Court selection process, which was established to promote greater openness, transparency, and accountability.</p><p>With today’s announcement, the members of the House of Commons’ Committee on Justice and Human Rights will be given a week to prepare for a special committee hearing, where the Minister of Justice and the Chair of the Independent Advisory Board will explain the process and why the nominee was selected.</p><p>To further meet our commitment to openness and transparency, members of the House’s Justice and Human Rights Committee and Senate’s Legal and Constitutional Affairs Committee – as well as representatives of the Bloc Québécois and Green Party – will be invited to take part in a Q&amp;A session with the nominee, moderated by a law professor, on October 25.</p><p>The new selection process is being used in this instance to fill the vacancy left by Justice Thomas Cromwell who retired from the Supreme Court of Canada on September 1, 2016.<br><br></p><h2>Quotes</h2><blockquote><p>“I am greatly excited to announce the nomination of Mr. Justice Malcolm Rowe, whose remarkable depth of legal experience in criminal, constitutional, and public law will complement the extensive knowledge of the other Supreme Court justices.”<br>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</p></blockquote><blockquote><p>“Today also highlights the value of our new Supreme Court Justice selection process; one that will help ensure that those chosen to render critical judgements for the good of our citizens are qualified, non-partisan, and reflective of Canadian society.”<br>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</p></blockquote><h2><strong><br></strong>Quick Facts</h2><ul><li>During the selection process, an independent and non-partisan advisory board identified suitable candidates. Once the Independent Advisory Board compiled a shortlist of candidates, the Minister of Justice consulted the Chief Justice of Canada, the applicable provincial and territorial attorneys general, some members of cabinet, members of the House’s Justice and Human Rights Committee and of the Senate’s Legal and Constitutional Affairs Committee, and the Opposition Justice critics.</li><li>The new selection process sought jurists of the highest caliber, who were functionally bilingual and representative of the diversity of this great country.</li><li>The process has allowed any Canadian lawyer or judge who fits the criteria to apply to the Supreme Court of Canada through the Office of the Commissioner for Federal Judicial Affairs.<br><br></li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2016/10/17/malcolm-rowe\">Biographical Notes – Malcolm Rowe</a></li><li><a href=\"/en/news/backgrounders/2016/10/17/frequently-asked-questions\">Frequently Asked Questions</a></li></ul><h2><strong><br></strong>Associated links</h2><ul><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/nominee-candidat-eng.html\">Candidate questionnaire filled out by Mr. Justice Malcolm Rowe</a></li><li><a href=\"/en/news/news-releases/2016/08/02/prime-minister-announces-new-supreme-court-canada-judicial\">Prime Minister announces new Supreme Court of Canada judicial appointments process</a></li><li><a href=\"/en/news/backgrounders/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">Backgrounder: New process for judicial appointments to the Supreme Court of Canada</a></li><li><a href=\"/en/news/backgrounders/2016/08/02/biographical-notes\">Biographical notes on members of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/mandate-mandat-eng.html\">Terms of Reference for the Advisory Board</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and assessment criteria</a></li><li><a href=\"/en/news/backgrounders/2016/08/04/mandate-letter-members-independent-advisory-board-supreme-court\">Mandate Letter (members) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li><li><a href=\"/en/news/backgrounders/2016/08/04/mandate-letter-chair-independent-advisory-board-supreme-court-canada\">Mandate Letter (Chair) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li></ul></div>\n      "
}