{
  "path": "/en/news/news-releases/2020/10/01/prime-minister-announces-appointment-new-chief-justice-supreme-court",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of the Supreme Court of Yukon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Suzanne Duncan, a Judge of the Supreme Court of Yukon, as the new Chief Justice of the Supreme Court of Yukon.</p>\n\n<p>Chief Justice Duncan replaces the Honourable Ronald S. Veale, who retired on July 25, 2020, after 20 years of distinguished service as a judge.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I want to thank the outgoing Chief Justice, the Honourable Ronald S. Veale for his service and dedication to the people of Yukon. Today, I am happy to announce the appointment of the Honourable Suzanne Duncan as the new Chief Justice of the Supreme Court of Yukon. Chief Justice Duncan brings almost 16 years of experience practising law in Yukon, and she will be the first woman to hold this position. I am confident that she will continue to serve Yukoners well in her new role.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n\t<li>The Supreme Court of Yukon is the highest trial court in the territory, with broad jurisdiction to try a wide range of civil and serious criminal matters.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/10/01/honourable-suzanne-duncan\">The Honourable Suzanne Duncan</a></li>\n</ul></div>\n      "
}