{
  "path": "/en/news/readouts/2022/07/01/prime-minister-justin-trudeau-meets-prime-minister-australia-anthony",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Australia Anthony Albanese | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of Australia, Anthony Albanese, on the margins of the NATO Summit in Madrid, Spain.</p>\n\n<p>The leaders reiterated their condemnation of Russia’s illegal and unjustifiable invasion of Ukraine. They agreed to continue their close cooperation on sanctions against Russia, and on providing economic, humanitarian, and military assistance to Ukraine.</p>\n\n<p>The prime ministers reaffirmed their shared commitment to combatting climate change and fostering sustainable economic growth that benefits everyone. Prime Minister Trudeau welcomed Australia’s recent decision to adopt more ambitious greenhouse gas emissions reduction targets. The leaders agreed to enhance cooperation on clean technologies, sustainable growth, and critical minerals.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Albanese discussed ongoing cooperation in the Indo-Pacific region. They reaffirmed their commitment to working closely together to promote regional stability and uphold the rules-based international order.</p>\n\n<p>The two leaders looked forward to further strengthening the partnership between Canada and Australia on shared priorities, including gender equality, growth that benefits everyone, and meaningful reconciliation with Indigenous Peoples.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/australia-australie/relations.aspx?lang=eng\">Canada-Australia relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/05/24/prime-minister-justin-trudeau-speaks-prime-minister-australia-anthony\">Prime Minister Justin Trudeau speaks with Prime Minister of Australia Anthony Albanese</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}