{
  "path": "/en/news/statements/2020/06/21/statement-prime-minister-national-indigenous-peoples-day",
  "pageTitle": "Statement by the Prime Minister on National Indigenous Peoples Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on National Indigenous Peoples Day:</p>\n\n<p>“On <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1100100013248/1534872397533\">National Indigenous Peoples Day</a> – and throughout <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1466616436543/1534874922512\">National Indigenous History Month</a> – we celebrate the unique heritage, cultures, art, and traditions of First Nations, Inuit, and Métis peoples.</p>\n\n<p>“On this day, we recognize the contributions of Indigenous peoples to our past, and the important role they will continue to play in building our future. One hundred and fifty years ago, Manitoba joined Confederation as Canada’s fifth province through the leadership of the Métis Nation and Louis Riel. This is one of the many examples of Indigenous peoples’ contributions to Canada. And as we look to the future, we know that we can only move forward together, with a relationship based on respect, partnership, and affirmation of rights. By doing so, we create stronger communities.</p>\n\n<p>“We have been working with Indigenous leaders and communities, and we know there is much more to do. Together, we must continue to address the systemic inequalities and discrimination that Indigenous peoples experience in Canada – issues that have been amplified by the social, health, and economic impacts of COVID-19. The latest tragic events and protests have also underscored how far we still have to go as a country, and the work we need to do to eliminate systemic racism from our society.</p>\n\n<p>“As we move forward on the path of reconciliation, and work to implement the Calls to Action from the Truth and Reconciliation Commission and the Calls for Justice from the National Inquiry into Missing and Murdered Indigenous Women and Girls, we must continue to listen to Indigenous peoples, partners, and communities. We must also work to implement Indigenous rights and address the unique challenges and disadvantages they face. Our government will continue to address them as we have done recently with co-developed Indigenous child and family services legislation to ensure that Indigenous children remain with their families and communities, and with legislation to protect Indigenous languages, which are fundamental to their cultures and heritage.</p>\n\n<p>“Today, I encourage all Canadians to take time to reflect on the cultures, traditions, languages, contributions, and heritage of First Nations, Inuit, and Métis peoples. Together, we can better recognize and right current and past wrongs, and build a brighter future.”</p></div>\n      "
}