{
  "path": "/en/news/news-releases/2018/10/23/government-canada-fighting-climate-change-price-pollution",
  "pageTitle": "Government of Canada fighting climate change with price on pollution | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians are seeing the costs of climate change first hand, from wildfires in the west to floods in the east, smoke that makes the air unsafe to breathe and heatwaves that endanger the young and the elderly. We need to act now to fight back against climate change, for our children and grandchildren.</p><p>The Government of Canada has a plan that protects the environment while growing the economy, and that plan is working – our emissions are down and the economy has grown by 500,000 full-time jobs. But we know we need to do more.</p><p>The Government of Canada worked with provinces and territories for two years, giving them the flexibility to design their own climate plans that included putting a price on carbon pollution. A price on pollution gives people the incentive to make cleaner choices and gives businesses incentives to find clean solutions. Alberta, British Columbia, Newfoundland and Labrador, Northwest Territories, Nova Scotia, Nunavut, Prince Edward Island, Quebec and Yukon have stepped up and shown leadership, either by developing their own systems or choosing to adopt the federal pollution pricing system. Other provinces have not recognized the cost of pollution.</p><p>The Prime Minister, Justin Trudeau, today announced that there will be a federal system in place in Ontario, New&nbsp;Brunswick, Manitoba, and Saskatchewan in 2019. This is the next step in the government’s plan to protect the environment and grow the economy. Any direct proceeds collected will go directly back to people in these provinces. Households will receive a Climate Action Incentive, which will give most families more than they pay under the new system. Funds will also be given to the provinces’ cities, schools, hospitals, businesses, and Indigenous communities to, for example, help them become more energy efficient and reduce emissions, helping Canadians save even more money, and improve our local economies.</p><p>Canadians know pollution isn’t free. And they know that carbon pollution doesn’t have boundaries. Old or young, rich or poor, urban or rural, living in the south or the north, we are all in this together. Applying practical solutions today will give all Canadians more economic opportunities and a safer and more prosperous future.</p><h2>Quotes</h2><blockquote><p>“The effects of climate change are everywhere, and they are a constant reminder of the need to act now. While climate change is the biggest challenge of this generation, it also provides the opportunity to do better while growing the economy. We are investing in Canadian companies that are on the forefront of clean technologies, and are working with provinces, territories, and municipalities to provide Canadians with more clean energy options. Protecting the environment is a responsibility we all share. That is why we are taking action to promote clean energy and growth in Canada. Together, and only together, we can make a real difference for our planet’s future.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canadians know that polluting isn’t free. We are all paying the cost of storms, floods, wildfires, and extreme heat. Our government is ensuring a price across Canada on what we don’t want, pollution, so we can get what we do want – lower emissions, cleaner air, opportunities for businesses with clean solutions, and more money in the pockets of Canadians. We have a plan for healthy environment and a stronger economy. Because, at the end of the day, it’s what we owe our kids.”<br>—<cite>The Hon. Catherine McKenna, Minister of Environment and Climate Change</cite></p></blockquote><blockquote><p>“The case is clear: Canada needs to cut greenhouse gas emissions that cause climate change, and the best way to do that is to put a price on carbon pollution. Pollution pricing encourages Canadians and businesses to innovate, invest in clean technologies, and take advantage of long-term growth opportunities. Our plan will cut pollution and grow the economy, for the benefit of all Canadians.”<br>—<cite>The Hon. Bill Morneau, Minister of Finance</cite></p></blockquote><blockquote><p>“Canadians are seeing the effects of climate change, and know that we need to take real action to reduce greenhouse gas emissions and drive innovation. I am proud of the provinces and territories who have acknowledged the need to address climate change and are implementing their own plans or choosing to adopt the federal system. Where provinces have not taken leadership, our government is taking action to combat climate change and grow the economy.”<br>—<cite>The Hon. Dominic LeBlanc, Minister of Intergovernmental and Northern Affairs and Internal Trade</cite></p></blockquote><h2>Quick facts</h2><ul><li>The three provinces that already have carbon pollution pricing systems – British Columbia, Alberta, and Quebec – were also among the top performers in GDP growth across Canada in 2017.</li><li>According to the World Bank, 70 jurisdictions – representing about half of the global economy – are putting a price on carbon pollution.</li><li>Investing in the clean economy presents an enormous economic opportunity. According to the Global Commission on the Economy and the Climate, the clean economy is expected to grow to $26 trillion and create 65 million jobs worldwide by 2030.</li><li>Climate change has already had financial impacts on Canada, and these costs will only continue to grow. In 2016, it was estimated that larger and more intense weather events will cost the federal Disaster Financial Assistance Arrangements program around $902 million each year. The health costs of extreme weather are estimated to be over $1.6 billion a year.</li><li>The cost of property damages from climate change averaged $405 million per year between 1983 and 2008, but have risen dramatically to $1.8 billion a year since 2009. That number is expected to grow as high as $43 billion by 2050.</li><li>Since 2015, the Government of Canada has invested more than $9 billion in public transit for more than 1200 projects across Canada.</li><li>The federal carbon pollution pricing system has two components: the fuel charge and the output-based pricing system (OBPS) for emissions-intensive trade-exposed industries. In the provinces in which the backstop applies, the OBPS will take effect on January 1, 2019, and the fuel charge will take effect in April 2019. In Nunavut and Yukon, both components of the backstop will come into effect no later than July 1, 2019, at the same time as Northwest Territories’ price on carbon pollution.&nbsp;</li><li>To address high costs of living and energy, a full exemption from carbon pollution pricing will be granted to diesel-fired electricity generation in remote communities, and for aviation fuel in the territories.</li><li>In addition, a full exemption for farmers and fishers from the fuel charge would be provided for eligible fishing and farming activities. Partial relief from the fuel charge would also be provided for eligible commercial greenhouse operators.</li><li>We will continue to work with Atlantic provinces to advance an interconnected and efficient clean electricity grid to support growth in the region.</li></ul><h2>Related products</h2><ul><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work.html\">Pricing pollution: how it will work</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/alberta.html\">Alberta’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/british-columbia.html\">British Columbia's Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/manitoba.html\">Manitoba’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/new-brunswick.html\">New Brunswick’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/newfoundland-labrador.html\">Newfoundland and Labrador’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/northwest-territories.html\">Northwest Territories’ Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/nova-scotia.html\">Nova Scotia’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/nunavut.html\">Nunavut’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/ontario.html\">Ontario’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/prince-edward-island.html\">Prince Edward Island’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/quebec.html\">Quebec’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/saskatchewan.html\">Saskatchewan’s Pollution Pricing System</a></li><li><a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/pricing-pollution-how-it-will-work/yukon.html\">Yukon’s Pollution Pricing System</a></li></ul><h2>Associated link</h2><ul><li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-action/pricing-carbon-pollution.html?utm_campaign=not-applicable&amp;&amp;utm_medium=vanity-url&amp;&amp;utm_source=canada-ca_climate-action\">Pricing carbon pollution for clean growth</a></li></ul></div>\n      "
}