{
  "path": "/en/news/statements/2019/06/03/prime-minister-welcomes-final-report-national-inquiry-missing-and",
  "pageTitle": "Prime Minister welcomes final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls:</p>\n\n<p>“Today, I received the final report at the closing ceremony of the National Inquiry into Missing and Murdered Indigenous Women and Girls, which was launched in 2016 to recommend concrete actions to address the systemic causes of violence against Indigenous women, girls, LGBTQ and two-spirit people and end this national tragedy.</p>\n\n<p>“I thank the Chief Commissioner, the Commissioners, Grandmothers, the National Family Advisory Circle, and the Commission’s staff for their work and dedication. I especially wish to acknowledge and thank First Nations, Inuit, and Métis families and survivors, as well as knowledge keepers and experts, who participated in the Inquiry hearings and courageously told their stories. The Inquiry is a result of the work of many individuals and organizations who advocated tirelessly for Indigenous women and girls, and Indigenous LGBTQ and two-spirit people – and continue to do so today. Facing the hardest of truths is a necessary step to addressing them – and moving forward together.</p>\n\n<p>“We will&nbsp;conduct a thorough review of this report, and we will develop and implement a National Action Plan to address violence against Indigenous women, girls, and LGBTQ and two-spirit people. We will work with Indigenous partners to determine next steps, and we will include the perspectives and full participation of Indigenous women and girls. We will also include the voices of LGBTQ&nbsp;and two-spirit&nbsp;people with lived experience, as well as the family members of victims, and survivors of violence.&nbsp;We will also continue to work with provinces, territories, and municipalities to encourage cooperation across all orders of government in responding to the report. Reducing the rates of violence against Indigenous women and girls, and Indigenous LGBTQ and two-spirit people, is a priority for the Government of Canada. Our government will turn the Inquiry’s Calls for Justice into real, meaningful, Indigenous-led action.</p>\n\n<p>“Since the Inquiry’s launch,&nbsp;<a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1559566331686/1559566355192\">we have taken steps</a>&nbsp;to address early recommendations, honour missing and murdered Indigenous women and girls, their families, and survivors, and take action on issues reflected in the Calls to Justice. We are working with Indigenous communities to improve health and wellness by investing in essential infrastructure, including housing, and eliminating boil water advisories. We are also working together to better support inherent jurisdiction of Indigenous peoples in areas like education, governance, and child and family services.</p>\n\n<p>“We also recently introduced legislation to protect, promote, and revitalize Indigenous languages, and we are working to reform the criminal justice system to make sure Indigenous women, girls and LGBTQ and two-spirit people receive the full benefit and protection of the law. Measures like these help tackle the systemic causes of violence that put Indigenous women and girls at risk, close the unacceptable gaps that exist between Indigenous and non-Indigenous peoples, and move us closer toward a Canada that is safer and more just for all.”</p></div>\n      "
}