{
  "path": "/en/news/news-releases/2019/07/18/new-investments-improve-public-transit-british-columbia",
  "pageTitle": "New investments to improve public transit for British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>British Columbians need efficient and affordable public transit to get them to work or school on time, and back home safely at the end of the day. By investing in public transit, we fight climate change, reduce commute times, strengthen the middle class, and build more sustainable communities.</p>\n\n<p>The Prime Minister, Justin Trudeau, Premier of British Columbia, John Horgan, and President and Chief Executive Officer for BC Transit, Erinn Pinkerton, today announced more than $79 million in joint funding to improve public transit in British Columbia. This funding includes $16 million in contributions from municipalities.</p>\n\n<p>These funds will be used to purchase 118 new buses for use in Victoria and communities across British Columbia. The new buses will help shorten daily commutes, reduce the number of cars on the road, and make the province a greener place to live.</p>\n\n<p>The new buses will replace others at the end of their life cycle or increase capacity in communities where ridership is growing. The investment includes funding for 10 long-range electric buses that will provide greener transportation options in Greater Victoria. The new buses will be more efficient, have improved accessibility and safety features, and will support BC Transit's new NextRide technology and closed-circuit television security cameras. By investing in zero-emission buses, the Government of Canada is also working towards fulfilling its Drive to Zero pledge, and is taking steps towards achieving a transition to zero-emission vehicles and a clean economy.</p>\n\n<p>This investment will help meet British Columbians’ transportation needs while cutting air pollution and making our communities better places to live. The Government of Canada will continue to invest in the future so that we can grow the middle class and help Canadian families thrive.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Many British Columbians depend on public transit to get where they need to go safely and efficiently. As communities in B.C. continue to grow, investments in public transit need to keep pace. By investing in reliable, efficient public transit, we are making a real difference in the lives of British Columbians, while protecting our environment, strengthening the middle class, and making our communities even better places to live.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Public transit infrastructure is vital to building strong, sustainable communities where all residents have access to essential services and opportunities, and businesses can thrive. This investment in modern, eco-friendly vehicles serving communities across British Columbia will ensure that public transit services can continue to provide convenient, accessible transportation options that will improve the quality of life for residents today and contribute to a greener future.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“A strong public transit system is essential to making B.C. communities more affordable for the people who live in them, and to greening our transportation systems. Through this investment, we can meet rising transit demand, attract new transit riders, and put public transit in B.C. on a solid road toward a green future.”</p>\n\n<footer class=\"default\">The Hon. John Horgan, Premier of British Columbia</footer>\n</blockquote>\n\n<blockquote>\n<p>“These valuable partnerships have enabled BC Transit to actively pursue and implement low carbon technologies as we strive towards a cleaner, greener transit fleet. We are incredibly grateful to the Government of Canada, the Province of B.C. and our local government partners for their contributions and continued collaboration.”</p>\n\n<footer class=\"default\">Erinn Pinkerton, President and Chief Executive Officer, BC Transit</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2016, the Government of Canada launched the biggest infrastructure plan in Canadian history. Since then, the Government has invested in thousands of infrastructure projects to expand highways, build new roads, and make traveling safer and easier for Canadians from coast to coast to coast.</li>\n\t<li>The Government of Canada and the Government of British Columbia are each contributing approximately $31 million towards the purchase of the new buses and municipalities are investing more than $16 million.</li>\n\t<li>In addition to the 106 new buses announced in November 2018, this investment will provide thousands of new seats to meet the growing public transit needs of British Columbia.</li>\n\t<li>The federal investment for this project is provided through the Public Transit Infrastructure Stream of the Investing in Canada Plan. Additional funding will be provided by British Columbia and municipalities.&nbsp;</li>\n\t<li>The Public Transit Infrastructure Stream is part of the Investing in Canada Plan, through which the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green and social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li>\n\t<li>Of this amount, $28.7 billion is for public transit projects, including $5 billion available for investments through the Canada Infrastructure Bank.</li>\n\t<li>Through its Investing in Canada Plan, the Government of Canada has invested over $2.4 billion in more than 40&nbsp;public transit projects in British Columbia.</li>\n\t<li>The transportation sector accounts for 25 per cent of Canada’s emissions. Investments in public transit help improve commuting, reduce air pollution, strengthen communities, and grow the Canadian economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/investments-2002-investissements/bc-eng.html\">Federal infrastructure investments in British Columbia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/office-infrastructure/news/2018/11/canada-and-british-columbia-support-transit-improvements-in-communities-across-bc.html\">Canada and British Columbia support transit improvements in communities across B.C.</a></li>\n</ul></div>\n      "
}