{
  "path": "/en/news/news-releases/2022/07/13/delivering-good-jobs-and-clean-air-new-electric-vehicle-battery",
  "pageTitle": "Delivering good jobs and clean air with a new electric vehicle battery components facility in Ontario | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since January, Canada has secured historic manufacturing deals for electric vehicles, batteries, and hybrids – deals that create and secure thousands of good, middle-class jobs. Today represents another major step forward.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Minister of Innovation, Science and Industry, François-Philippe Champagne, and Ontario’s Minister of Economic Development, Job Creation and Trade, Vic Fedeli, to bring a new world-leading facility to Ontario to produce essential components of electric vehicle batteries. Through the new partnership, Umicore plans to invest $1.5&nbsp;billion to establish a net-zero facility in Loyalist Township, Ontario, which will create 1,000 jobs during construction and hundreds of permanent positions.</p>\n\n<p>By the end of the decade, Umicore’s new facility will produce enough precursor cathode active materials (pCAM) and cathode active materials (CAM) – essential components in batteries – to supply one million electric vehicles annually. The company will supply car manufacturers and battery producers in Canada and the United States, and will play an important role in our domestic electric vehicle supply chain and a strengthened North American batteries ecosystem. Umicore’s new facility will help ensure Canada’s automotive sector remains strong and thrives well into the future.</p>\n\n<p>As we build a clean economy, the Government of Canada will continue to ensure the Canadian automotive industry and its workers remain competitive. Through the <em>2030 Emissions Reduction Plan</em> that was launched this spring and Canada’s Critical Minerals Strategy that is in development now, we will deliver clean air, good middle-class jobs, and a strong economy for Canadians now and into the future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is about creating jobs, cutting pollution, and building a stronger, cleaner economy for Canadians.&nbsp;Umicore’s intention to establish its new facility in Loyalist Township is another major step forward as we make Canada a global leader in producing electric vehicles – from minerals to manufacturing. With over 1,000 good jobs to build the plant, and hundreds of permanent positions once it is up and running, this new facility will play an important role in Canada’s clean automotive sector well into the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada is leading the world when it comes to the jobs of the future in the low carbon economy. Today’s announcement with Umicore builds on recent investments that our government has made to build a thriving EV battery supply chain in Canada. We’re ensuring a strong and resilient economy, while also creating tens of thousands of well-paying jobs right across the country.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“This important investment by Umicore will turn Ontario into a North American leader in this high-value segment of the EV supply chain and further connect Northern Ontario’s mineral sector to EV manufacturing in the south. With recent success attracting major investments to the province, our government is staking Ontario’s claim to developing and building the batteries that will power the vehicles of the future.”</p>\n\n<footer class=\"default\">The Hon. Vic Fedeli, Ontario’s Minister of Economic Development, Job Creation and Trade</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada and the province of Ontario have all it takes for Umicore to establish a full-fledged, sustainable supply chain for battery materials, all the way from the mine right to the end-market of electric vehicles. Once the key customer contracts are in place, this expansion in North America would complete our global rollout of regional supply chains for our automotive and battery cell customers to now three continents. Moreover, we are most grateful to the Canadian and Ontario governments for their support and for their readiness to co-fund this planned project. The facility will help Canada and Umicore in their shared objective of achieving a carbon-neutral battery supply chain.”</p>\n\n<footer class=\"default\">Mathias Miedreich, CEO of Umicore</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today’s announcement marks the signing of a Memorandum of Understanding by the Government of Canada and Umicore, and the start of negotiations toward an agreement for the creation of the new production facility in Loyalist Township, Ontario. The Government of Canada will continue negotiations with Umicore on federal support for this project.</li>\n\t<li>Headquartered in Brussels, Belgium, Umicore is a circular materials technology company working to reduce harmful emissions, power the vehicles and technologies of the future, and give new life to used metals through recycling. Its new facility in Loyalist Township, Ontario, will be the company’s largest in Canada.</li>\n\t<li>Canada’s auto sector supports nearly 500,000 workers, contributes $16&nbsp;billion annually to Canada’s gross domestic product, and is one of the country’s largest export industries.</li>\n\t<li>Earlier this year, the federal government released the&nbsp;<em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy,&nbsp;</em>an ambitious and achievable sector-by-sector approach for Canada to reach its new climate target of cutting emissions by at least 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n\t<li>To help meet its emissions reduction goals, the Government of Canada has committed to put in place a sales mandate that will ensure that 100 per cent of new light-duty vehicle sales are zero-emission by 2035.</li>\n\t<li>Budget&nbsp;2022 provided $1.7&nbsp;billion to extend the Incentives for Zero-Emission Vehicles program and broadened eligibility under the program to include more vehicle models. It also provided $900&nbsp;million to help add 50,000 zero-emission vehicle chargers to Canada’s network.</li>\n\t<li>The Government of Canada announced the new Incentives for Medium- and Heavy-Duty Zero Emissions Vehicles Program, providing up to $200,000 per vehicle to help businesses and other organizations electrify their fleet.</li>\n\t<li>Budget&nbsp;2022 also proposes $3.8&nbsp;billion in support to develop and implement Canada’s first-ever Critical Minerals Strategy.</li>\n\t<li>Today’s announcement was made during Electric Vehicle Week in Canada, which runs from July 11 to 15, 2022. During this week, Canadians are encouraged to promote #EVWeek on social media.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/clean-air-and-a-strong-economy.html\">Budget&nbsp;2022 Backgrounder: Clean Air and a Strong Economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.umicore.com/en/\">Umicore</a></li>\n\t<li><a href=\"https://www.umicore.com/en/newsroom/media-gallery/\">Umicore’s media gallery</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\"><em>2030 Emissions Reduction Plan: Clean Air, Strong Economy</em></a></li>\n</ul></div>\n      "
}