{
  "path": "/en/news/news-releases/2023/03/07/joint-press-release-occasion-visit-canada-european-commission-president-ursula-von-der-leyen",
  "pageTitle": "Joint press release on the occasion of the visit to Canada of European Commission President Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ol>\n\t<li>Prime Minister of Canada Justin Trudeau hosted European Commission President Ursula von der Leyen for a two-day visit to Canada from March 6 to 8. During the visit, the Leaders drove progress on shared and urgent priorities, including maintaining a robust response to Russia’s illegal war of aggression against Ukraine; fighting climate change and accelerating clean innovation; pursuing energy security and sustainable economic growth; and promoting women’s economic empowerment.</li>\n</ol>\n\n<h2>Ukraine</h2>\n\n<ol start=\"2\">\n\t<li>Noting the one-year anniversary of Ukraine’s successful defence against Russia’s illegal full-scale war of aggression, the Leaders reaffirmed their unwavering commitment to Ukraine’s sovereignty and territorial integrity. They condemned Russia’s egregious violations of the UN Charter and international humanitarian law, from the indiscriminate attacks on civilian infrastructure, to the forced deportation of Ukrainian children and torture of prisoners of war. The Leaders agreed on the need to ensure accountability for atrocities committed, including war crimes. They reiterated their support for international accountability efforts, including investigations by the Prosecutor of the International Criminal Court and the Commission of Inquiry established by the UN Human Rights Council.</li>\n\t<li>The Leaders affirmed the continued importance of timely military support for Ukraine, and highlighted the training provided to the Security Forces of Ukraine by both the European Union Military Assistance Mission Ukraine and Canada’s training mission, Operation UNIFIER. Prime Minister Trudeau announced during the visit that the engineering training component of the mission will be extended until October 2023 and that the Canadian Armed Forces (CAF) will now provide advanced combat medic training.&nbsp; Leaders also noted the broader cooperation between Canada and the EU on security and defence, including Canada’s ongoing participation in Permanent Structured Cooperation projects. The Leaders reaffirmed the continued importance of close collaboration between NATO Allies and the EU in the context of providing unwavering support to Ukraine. The leaders visited the Canadian Forces Base Kingston to meet with CAF personnel who have deployed to Central and Eastern Europe as part of Operation REASSURANCE to support humanitarian efforts for Ukrainian refugees through Task Force Poland.</li>\n\t<li>With Russia's attacks on civilian infrastructure causing substantial damage to Ukraine's electrical grid, the Leaders recognized the urgency of providing much-needed energy equipment. The Government of Canada has worked closely with Canadian industry through Electricity Canada to obtain items identified as priorities, including seven transformers that will be shipped shortly through the EU's civil protection operation (rescEU energy hub). Canada appreciates that the EU has given Canada access to this hub, which will also support the future delivery of a growing list of equipment for Ukraine. The EU also continues its substantial mobilisation of civil protection strategic rescEU reserves of generators and transformers for Ukraine.</li>\n\t<li>The leaders underscored their intention to continue to work together, along with G7 partners and many others, to increase coordination on sanctions, their enforcement, and export controls restrictions. The Leaders announced Canada’s designation as a Partner Country for EU’s sanctions regulations against Russia, resulting in better exchange of information and best practices to more effectively enforce existing and future sanctions.</li>\n\t<li>With the effects of Russia’s full-scale invasion felt around the world with rising inflation, increasing supply chain instability, and food and energy insecurity, the Leaders committed to find practical ways to mitigate impacts, especially for the most vulnerable.Building on close EU-Canada coordination in the response to Russia’s war against Ukraine, the Leaders welcomed the forthcoming signature of an administrative arrangement allowing closer cooperation on disaster response and emergency management, sharing best practices to enhance prevention, preparedness, and coordination on natural and human-induced disasters including in third countries.</li>\n\t<li>Russia's invasion of Ukraine has forced millions of people to flee. The European Commission and Canada will continue to coordinate further related support and provide assistance to Ukraine's most affected neighbours.</li>\n\t<li>The Leaders also reaffirmed their commitment to Ukraine’s recovery and reconstruction efforts. Ukraine, Canada, the EU and other partners have established the G7 Multi-Agency Donor Coordination Platform to address Ukraine’s immediate and long-term needs. Recognizing the importance of mine action for Ukraine’s recovery and reconstruction, Canada is joining the EU and committing an additional $3 million to support an initiative to clear land mines and unexploded ordnance in Ukraine, complementing the over $32 million that Canada is already providing to support mine action in Ukraine. The EU is providing 43 million euros for the same purpose. Additionally, Canada welcomed the EU’s June 2022 decision to grant candidate country status to Ukraine, opening a pathway for accession to the EU and serving as a key driver for advancing Ukraine’s reform agenda<em>.</em></li>\n</ol>\n\n<h2>Democracy and Disinformation</h2>\n\n<ol start=\"9\">\n\t<li>Recognizing that disinformation poses a fundamental threat to peace, security, and democracy, the Leaders agreed to further Canada-EU collaboration to counter foreign threats to democracy, including disinformation, through the G7 Rapid Response Mechanism. Canada and the EU will continue co-leading efforts towards developing a framework of operational principles to guide collective responses to foreign information manipulation and interference. Canada and the EU will also continue to support democratic governance globally, including through Canadian participation in EU Electoral Observation Missions (EOMs). The leaders reiterated their commitment to combat inequalities and discrimination by protecting human rights defenders and civil society organisations, and promoting human rights and fundamental freedoms.</li>\n</ol>\n\n<h2>Climate, Biodiversity, and Green Economies</h2>\n\n<ol start=\"10\">\n\t<li>The Leaders committed to accelerate work towards climate resilient, nature-positive, circular, net-zero emissions economies, and to create good jobs for workers on both sides of the Atlantic. Canada and the EU will continue working closely together to drive global progress on climate change at COP28, and to ensure an ambitious implementation of the landmark Kunming-Montreal Global Biodiversity Framework agreed at COP15 in Montreal, recognizing the importance of tackling the interlinked climate and biodiversity crises together. Acknowledging that trade, investment, and policy reform are the key drivers of sustainable development and a green economy, the Leaders highlighted the vital role that the EU-Canada Comprehensive Economic and Trade Agreement (CETA) and the Strategic Partnership Agreement (SPA) play in this regard.</li>\n\t<li>Prime Minister Trudeau also welcomed the European Commission’s intention to work towards participating in the Global Carbon Pricing Challenge, an initiative launched by the Prime Minister at the UN Climate Change Conference in Glasgow, which aims to triple the percentage of global emissions covered by carbon pollution pricing to 60 per cent by 2030.</li>\n\t<li>The Leaders committed to further deepen our climate, environmental, and energy engagement, working towards the establishment of a Green Alliance between the EU and Canada, in order to grow economies that are climate-neutral, circular and resource-efficient in the coming decades. They looked forward to the High Level Dialogue on Climate this year, which will be an important step towards forming the Alliance.</li>\n\t<li>The Leaders committed to exploring how Canada and the EU can improve collaboration in advancing low-carbon manufacturing, including of steel and aluminum, through bilateral and multilateral forums.</li>\n</ol>\n\n<h2>Reliable, affordable, and sustainable energy and raw materials</h2>\n\n<ol start=\"14\">\n\t<li>The Leaders reiterated their shared commitment to creating good jobs, delivering energy security, and leading on clean energy.</li>\n\t<li>The Leaders reiterated their commitment to ensuring the security of supply of critical minerals and related value chains, both essential to building a net-zero and digital economy. The EU and Canada have strong cooperation in this area, including through the Canada-EU Strategic Partnership on Raw Materials. This collaboration is helping to deliver new trade and investment opportunities, while supporting the highest environmental and social standards and building research and innovation partnerships.</li>\n\t<li>The Leaders visited Li-Cycle, a leading Canadian lithium-ion battery recycler that is creating a secondary supply of critical battery materials to meet increasing demand in North America and Europe.<em> </em>Together, Canada and the EU are building a stronger, strategic alignment on the full product cycle of clean technologies and other advanced manufacturing and recycling sectors.</li>\n\t<li>Energy security in Europe remains a common objective as Russia continues to use energy as a political and economic weapon. Recognizing the essential role that clean hydrogen will play in decarbonizing our economies and in meeting global energy needs, the Leaders agreed to work together to lay the foundation for the development of reliable hydrogen supply chain between Canada and the EU as well as to develop common approaches to standards and the certification of hydrogen. They also expressed their strong intention to collaborate further on hydrogen and announced an enhanced Canada-EU action plan to advance the commercialization of the hydrogen industry and develop transatlantic trade.</li>\n\t<li>The Leaders also committed to continuing to collaborate through the Canada-EU Working Group on Energy Transition and LNG that they announced in March 2022. This Working Group is developing sustainable medium-term solutions on key resources and energy that Canada can supply to the EU like hydrogen and critical minerals, as well as the global supply of resources like LNG.</li>\n\t<li>Acknowledging the need to ensure security of supply in the nuclear sector and diversify existing supplies away from unreliable partners, the Leaders agreed to work together to assess and secure the supply of uranium and of nuclear fuel services on both sides of the Atlantic.</li>\n\t<li>The Leaders also committed to continuing collaboration under the Canada-EU High Level Energy Dialogue to reduce methane emissions from the oil, gas and coal sectors, thus implementing the Global Methane Pledge and the Joint Declaration from Energy Importers and Exporters adopted at COP27.</li>\n</ol>\n\n<h2>Economy, Technology, and Research</h2>\n\n<ol start=\"21\">\n\t<li>The Leaders acknowledged the fifth anniversary of CETA in 2022, noting the comprehensive and inclusive free trade agreement’s positive impact in expanding economic growth and boosting job creation for both Canada and the EU. In 2022, bilateral trade in goods reached CAD 106 billion/EUR 77 billion, 66 per cent higher than pre-CETA levels in 2016. CETA is an example of Canada and the EU’s commitment to rules-based international trade and to reinforcing strategic industrial links at a moment of geopolitical instability. With this, the Leaders welcomed the recent ratifications of CETA by Germany and the Netherlands, and encouraged other Member States to ratify in the near future. The Leaders also spoke about how to continue collaborating on trade and sustainable development, including increasing trade involving small and medium-sized businesses and diverse communities. In support of this, the Leaders met with Canadian and European industry leaders, highlighting their contributions to the Canada-EU commercial relationship.</li>\n\t<li>The Leaders emphasized the role of the digital economy and emerging technologies in advancing sustainable economic growth. As part of their commitment to further digital cooperation, the Leaders committed to pursuing an EU-Canada Digital Partnership with a focus on, but not limited to, artificial intelligence, research and innovation on next-generation networks, as well as greater cooperation on international connectivity and cyber security. This Digital Partnership builds on the already strong foundation of cooperation under the Canada-EU Digital Dialogue, where Canada and the EU are collaborating on emerging digital priorities such as online platforms regulation and emerging technologies, including AI and Quantum.</li>\n\t<li>The Leaders also addressed the need for strong and sustained collaboration between researchers, institutions, industry, and governments to advance the frontiers of science and innovation. To that end, the Leaders looked forward to the conclusion of negotiations for Canada to become an associate member of Horizon Europe, the world’s largest collaborative science, technology, and innovation program.</li>\n</ol>\n\n<h2>Gender Equality and the Empowerment of Women and Girls</h2>\n\n<ol start=\"24\">\n\t<li>Recognizing that women and girls play an invaluable role in building a more peaceful and inclusive future, the Leaders reaffirmed their strong support to gender equality and the empowerment of women and girls in all their diversity.</li>\n\t<li>They committed to further Canada-EU collaboration in ensuring that the goals and targets on gender equality are effectively implemented. To that end, Prime Minister Trudeau announced that Canada will provide $7.5 million to the UNFPA-UNICEF Joint Programme on the Elimination of Female Genital Mutilation: Accelerating Change, and an additional $2 million to the UN Trust Fund to End Violence Against Women, which supports civil society and women-led solutions to gender-based violence. The EU has been supporting both initiatives with respectively EUR 19.5 million and EUR 24 million notably through the Spotlight Initiative.</li>\n\t<li>The Leaders also committed to take concrete steps supporting women’s rights organizations and their critical role in advancing gender equality, human rights, and democracy. Prime Minister Trudeau welcomed the EU’s intention to join the Alliance for Feminist Movements, a global alliance focused on increasing financial and political support for women’s rights organizations and feminist movements.</li>\n\t<li>Prime Minister Trudeau also welcomed the EU’s intention to become a member of the Equal by 30 Campaign, led by Canada, committing to work towards equal pay, equal leadership and equal opportunities for women in the energy sector by 2030.</li>\n\t<li>Finally, both Leaders highlighted the strengthened Canada-EU collaboration from increasing trade through CETA to promoting democracy and human rights around the world. Reflecting the strength our relationship, President von der Leyen addressed Parliament in the House of Commons to highlight the unique ties between Canada and the EU and to mark International Women’s Day, the following day on March 8. The Leaders look forward to deepening Canada-EU collaboration on these and other topics at the next Canada-EU Leaders’ Summit to be hosted by Canada in 2023.</li>\n</ol></div>\n      "
}