{
  "path": "/en/news/news-releases/2023/03/15/prime-minister-announces-independent-special-rapporteur-to-help-protect",
  "pageTitle": "Prime Minister announces Independent Special Rapporteur to help protect the integrity of Canada’s democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada takes any attempts at undermining our democracy very seriously and will continue to take action to protect our institutions and uphold Canadians’ confidence in our democracy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the federal government intends to appoint the Right Honourable David Johnston as Independent Special Rapporteur, a new role as part of a suite of measures to help combat foreign interference and strengthen confidence in our federal electoral process and democratic institutions. This follows consultations with all parties in the House of Commons.</p>\n\n<p>Mr.&nbsp;Johnston is an accomplished Canadian public servant and law professor. He served as the 28th Governor General of Canada from 2010 to 2017, an important role in Canada’s democracy.</p>\n\n<p>Prior to his installation as Governor General, Mr.&nbsp;Johnston was a professor of law for 45 years. He has spoken and written extensively on Canada’s democratic institutions and the value of trust. Mr.&nbsp;Johnston has chaired or served on many provincial and federal task forces and committees and has served on the boards of more than a dozen public companies. In 2007, Prime Minister Stephen Harper announced Mr.&nbsp;Johnston would serve as a special advisor, drafting the terms of reference for a&nbsp;public inquiry into the Airbus affair, which became the Oliphant Commission. He is currently serving as the Leaders’ Debates Commissioner, contributing actively to our democracy, a role from which he will step down to serve as Independent Special Rapporteur.</p>\n\n<p>In this new role, Mr.&nbsp;Johnston will have a wide mandate to look into foreign interference in the last two federal general elections and make expert recommendations on how to further protect our democracy and uphold Canadians’ confidence in it. The Government of Canada will comply with and implement his public recommendations, which could include a formal inquiry, a judicial review, or another independent review process. We will be working with Mr.&nbsp;Johnston to finalize his mandate in the coming days, and it will be made public.</p>\n\n<p>Building on the work of the National Security and Intelligence Review Agency (NSIRA) and the National Security and Intelligence Committee of Parliamentarians (NSICOP), both of which are also reviewing foreign interference in the last two elections, as well as other ongoing processes, Mr.&nbsp;Johnston will identify any remaining gaps or areas requiring further attention to protect the integrity of Canada’s democracy.</p>\n\n<p>The Government of Canada will continue to take action to strengthen and protect our democracy – one of the strongest and most stable in the world – and uphold Canadians’ confidence in our institutions.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians need to have confidence in our electoral system, and in our democracy. As Independent Special Rapporteur, David Johnston brings integrity and a wealth of experience and skills, and I am confident that he will conduct an impartial review to ensure all necessary steps are being taken to keep our democracy safe and uphold and strengthen confidence in it.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The announcement of an Independent Special Rapporteur was part of a series of measures announced by the Prime Minister on March 6, 2023, to take further action on foreign interference and strengthen Canadians’ confidence in our democracy. These also included:\n\t<ul class=\"bulletOutline\">\n\t\t<li>Asking the National Security and Intelligence Committee of Parliamentarians (NSICOP) to complete a review of the state of foreign interference in federal electoral processes;</li>\n\t\t<li>A review by the National Security and Intelligence Review Agency (NSIRA) of how Canada’s national security agencies handled the threat of foreign interference during the 43rd and 44th federal general elections;</li>\n\t\t<li>Launching public consultations to guide the creation of a Foreign Influence Transparency Registry in Canada to ensure transparency and accountability from people who advocate on behalf of a foreign government and ensure communities who are often targeted by attempts at foreign interference are protected;</li>\n\t\t<li>Establishing a new National Counter Foreign Interference Coordinator in Public Safety Canada to coordinate efforts to combat foreign interference;</li>\n\t\t<li>Developing a plan to address outstanding recommendations from the NSICOP, the independent assessment of the Critical Election Incident Public Protocol (Rosenberg Report), and other reviews on these matters, within 30 days; and</li>\n\t\t<li>Investing $5.5&nbsp;million in the Canadian Digital Media Research Network to strengthen the capacity of civil society partners to counter disinformation.</li>\n\t</ul>\n\t</li>\n\t<li>Since 2015, the Government of Canada has taken significant action to protect our democracy and our institutions from foreign interference. These actions include:\n\t<ul class=\"bulletOutline\">\n\t\t<li>Creating the National Security and Intelligence Committee of Parliamentarians (NSICOP), made up of Members of Parliament from each party and Senators with top-secret security clearance to review national security and intelligence activities across the Government of Canada;</li>\n\t\t<li>Creating the National Security and Intelligence Review Agency (NSIRA), made up of top independent experts, to strengthen independent scrutiny and accountability of national security agencies in Canada;</li>\n\t\t<li>Establishing the Critical Election Incident Public Protocol (the Protocol), which is administered by a panel of the most senior federal public servants who, working with national security agencies, are responsible for communicating with Canadians in the event of an incident or series of incidents that threaten the integrity of a federal election;</li>\n\t\t<li>Creating the Security and Intelligence Threats to Election (SITE) Task Force, composed of officials from the Communications Security Establishment, the Canadian Security Intelligence Service, the Royal Canadian Mounted Police, and Global Affairs Canada. The SITE Task Force works to identify and prevent covert, clandestine, or criminal activities from influencing or interfering with the electoral process in Canada; and</li>\n\t\t<li>Establishing the Rapid Response Mechanism (RRM) at the G7 Summit in Charlevoix to help G7 countries identify and respond to diverse and evolving foreign threats to democracy.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2023/03/15/right-honourable-david-johnston-cc\">The Right Honourable David Johnston, C.C.</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/06/taking-further-action-foreign-interference-and-strengthening\">Taking further action on foreign interference and strengthening confidence in our democracy</a></li>\n\t<li><a href=\"https://www.nsicop-cpsnr.ca/index-en.html\">National Security and Intelligence Committee of Parliamentarians</a></li>\n\t<li><a href=\"https://nsira-ossnr.gc.ca/\">National Security and Intelligence Review Agency</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Protecting democracy</a></li>\n</ul></div>\n      "
}