{
  "path": "/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response",
  "pageTitle": "Prime Minister outlines Canada’s COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world. We have worked closely with Canada’s trained public health and medical professionals to put in place the plans, infrastructure, and resources needed to protect the health and safety of all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today outlined Canada’s whole-of-government response to COVID-19, by establishing a more than $1 billion COVID-19 Response Fund. This comprehensive approach includes measures already underway to respond to the outbreak, as well as new investments to limit the spread of the virus in Canada and prepare for its possible broader impacts on our people, our economy, and our small businesses.</p>\n\n<p>In addition to continuing our work to ensure a coordinated response across the country, the Government of Canada is proposing new investments to respond in Canada and around the world. These investments will include actions to:</p>\n\n<ul>\n\t<li>Help Canadians make informed decisions and take action to protect their health and their communities by providing $50 million to support the Public Health Agency of Canada’s COVID-19 communications and public education efforts.</li>\n\t<li>Further support public health preparedness by providing $500 million to provinces and territories for critical health care system needs and to support mitigation efforts as needed. This could include help to support with access to testing, acquisition of equipment, and to enhance surveillance and monitoring. Financial considerations should not and will not be an obstacle to hospitals and health systems making the necessary preparations.</li>\n\t<li>Provide support to workers in quarantine or who have been directed to self-isolate who will claim Employment Insurance (EI) sickness benefits by waiving the mandatory one-week waiting period so they can be paid for the first week of their claim. We are exploring additional measures to support other affected Canadians, including income support for those who are not eligible for EI&nbsp;sickness benefits.</li>\n\t<li>Introduce enhancements to the Work-Sharing program to help support employers and their workers who are experiencing a downturn in business due to COVID-19. Work-sharing helps keep workers employed and able to receive income support even as their hours of work may be reduced. These enhancements will double the length of time that employers and workers are eligible to use work-share from 38 to 76 weeks, and streamline processes so help can be accessed as soon as possible.</li>\n\t<li>Support federal public health measures such as enhanced surveillance, increased testing at the National Microbiology Laboratory, and ongoing support for preparedness in First Nations and Inuit communities, by providing $100 million. This is in addition to an initial $50 million that was provided to support the immediate public health response.</li>\n\t<li>Enhance Canada’s capacity in research and development, including research on medical countermeasures, including antivirals, vaccine development and support for clinical trials, by providing $275 million in additional funding building on top of the recent $27 million announcement to fund coronavirus research in Canada.</li>\n\t<li>Ensure adequate supplies of personal protective equipment like surgical masks, face shields, and isolation gowns by providing $50 million to the Public Health Agency of Canada to support purchases for provinces and territories, as well as to address federal needs.</li>\n\t<li>Address the worldwide outbreak and help more vulnerable countries prepare for and respond to the virus by contributing an additional $50 million to support the efforts of the World Health Organization and other partners.</li>\n</ul>\n\n<p>To support businesses should the economy experience tightening credit conditions, the Government will act swiftly to stimulate the economy by strengthening investment in federal lending agencies such as the Business Development Bank of Canada and Export Development Canada. This partnership between Canada’s financial Crown corporations and private sector financial institutions, in response to credit conditions during the 2008-2009 financial crisis, provided $11 billion of additional credit support to 10,000 firms. In addition, flexible arrangements could be made for businesses trying to meet payment obligations to the Canada Revenue Agency.</p>\n\n<p>Through these and other measures, the Government of Canada will continue to protect the health and safety of all Canadians, ensure economic resilience, and contribute to the international response to COVID-19.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Our message to Canadians is clear: to every worker and business, in every province and territory, we have your back and we will get through this together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians have a history of coming together to confront big and serious challenges, whatever they may be. We have been working very closely with our provincial and territorial colleagues, and we will continue to do so. Today’s announcement is further proof of our commitment to keep Canadians safe and provide them with the help that is needed.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The resources announced today will help our hospitals and clinics across the country respond to any surge in demand. They will also increase our ability to educate Canadians about actions we can all take to limit the spread of COVID-19. I thank all health care workers and organizations working so hard to protect the health of Canadians. We stand by you and will ensure that you have the resources you need to continue your vital work.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>''The fundamentals of the Canadian economy are strong. But we know COVID-19 is having an impact on global economic activity, and our strong fiscal position means we are well positioned to respond to any challenges. This announcement demonstrates that the government is ready to act to protect Canadians and ensure that our economy remains strong.''</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since February 4, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/global-affairs/news/2020/02/canada-supports-chinas-ongoing-response-to-novel-coronavirus-outbreak.html\">has deployed approximately 16 tonnes of personal protective equipment to China</a>, to support its ongoing response to the outbreak.</li>\n\t<li>On February 11, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/global-affairs/news/2020/02/government-of-canada-repatriates-more-canadians-and-their-families-from-wuhan-china.html\">provided $2 million to the World Health Organization</a> to help vulnerable countries prepare and respond to coronavirus events.</li>\n\t<li>On March 5, 2020, the Prime Minister <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/04/prime-minister-creates-committee-covid-19\">created an ad hoc Cabinet Committee on the federal response to the coronavirus disease (COVID-19)</a>. Chaired by the Deputy Prime Minister and vice-chaired by the President of the Treasury Board, the committee comes together regularly to ensure whole-of-government leadership, coordination, engagement, and preparedness to limit the health, economic, and social impacts of the virus.</li>\n\t<li>On March 6, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/institutes-health-research/news/2020/03/government-of-canada-invests-27m-in-coronavirus-research.html\">announced an investment of $27 million to fund coronavirus research</a>. This will support 47 research teams from across Canada, with a focus on accelerating the development, testing, and implementation of measures to deal with the COVID-19 outbreak.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">The Government of Canada Takes Action on COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n</ul></div>\n      "
}