{
  "path": "/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic",
  "pageTitle": "Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in the Association of Southeast Asian Nations (ASEAN) Summit in Phnom Penh, Cambodia, the G20 Summit in Bali, Indonesia, the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting in Bangkok, Thailand, and the Eighteenth Summit of La Francophonie in Djerba, Tunisia.</p>\n\n<p>The Indo-Pacific region is a growing hub for trade and investment that fosters open markets, creates jobs, and drives economic growth. During his meetings in Asia, the Prime Minister will demonstrate Canada’s strong partnership in helping grow the global economy to benefit people on both sides of the Pacific. No region of the world will have more of an impact on Canada’s future in the next half-century than the Indo-Pacific.&nbsp;</p>\n\n<p>At ASEAN, from November 12 to 13, 2022, Prime Minister Trudeau will address regional and global challenges with his counterparts in the ASEAN and broader Indo-Pacific region. He will participate in the ASEAN-Canada Commemorative Summit to mark the 45th anniversary of ASEAN-Canada dialogue relations. Under the ASEAN Summit’s theme of “Addressing Challenges Together”, the Prime Minister will promote regional peace and stability, rules-based trade, economic growth that benefits everyone, and strong ties between our peoples.</p>\n\n<p>As people around the world feel the impacts of challenges like inflation, food insecurity, and supply chain shortages, we must work together to drive solutions and make life better and more affordable. At the G20 Summit, from November 15 to 16, 2022, the Prime Minister will work with partners to advance shared priorities under this year’s theme of \"Recover Together, Recover Stronger\", including solutions to food and energy insecurity, climate change, and health.</p>\n\n<p>At the APEC Economic Leaders’ Meeting, on November 18, 2022, under the theme of “Open. Connect. Balance.,” Prime Minister Trudeau will reaffirm Canada’s commitment to open economic cooperation and removal of trade barriers in the Indo-Pacific region to benefit people on both sides of the Pacific. He will also work with his counterparts to strengthen ties between our people and drive climate action and economic growth.</p>\n\n<p>The Prime Minister will then participate in the Eighteenth Summit of la Francophonie, from November 19 to 20, 2022. Under the Summit’s theme of “Connecting in Diversity”, he will reinforce the importance of protecting democracy and human rights, defend and promote French language, and continue to build strong ties with our Francophonie partners on all continents.</p>\n\n<p>During his trip, Prime Minister Trudeau will continue to defend peace, security, democracy and human rights, take ambitious climate action to accelerate the transition to a cleaner economy, address food and energy security, and work to make life better and more affordable for people. The Prime Minister will highlight the importance of continuing to work with allies and partners to support Ukraine, and other countries most affected by the impacts of the war, as well as remaining united in the face of Russian aggression. He will continue to denounce Russia’s sham referendums and attempted illegal annexations of occupied regions of Ukraine, which are blatant violations of international law, and are a further escalation of tactics used by Russia during its invasion of Ukraine.</p>\n\n<p>Canada will continue to work with our global partners and democracies around the world to address the challenges of today while rising to meet the opportunities of tomorrow.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“When the world works together on shared challenges, we make life better for people. I look forward to meeting with global leaders, including my counterparts from the Indo-Pacific region, to continue creating jobs and driving economic growth that benefits everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Association of Southeast Asian Nations (ASEAN) is a regional intergovernmental organization comprising 10 member states with the objective to accelerate economic growth, social progress and cultural development; promote regional peace and stability, respect for justice and the rule of law; and increase collaboration across a range of economic, social, cultural, technical, scientific and administrative spheres.</li>\n\t<li>PM Trudeau participated in the 40th Anniversary ASEAN-Canada Commemorative Summit in 2017, and also attended the 2018 ASEAN Summit.</li>\n\t<li>Canada is home to over one million people of Southeast Asian descent, who greatly contribute to our country’s economic, cultural, and social fabric. ASEAN member state economies represent Canada’s fourth-largest trading partner, with over $31 billion in bilateral trade in 2021.Close to 38,000 students from the ASEAN region currently study in Canada.</li>\n\t<li>The G20 is the primary forum for international economic cooperation among its members. G20 members are the world's major economies and represent all inhabited continents, 80 per cent of world GDP, 75 per cent of global trade and 60 per cent of the world's population.</li>\n\t<li>This is the 8th G20 Summit attended by Prime Minister Trudeau.</li>\n\t<li>This is the 7<sup>th</sup> time Prime Minister Justin Trudeau will participate in the APEC Economic Leaders’ Meeting.</li>\n\t<li>As of 2020, APEC’s 21 member economies are responsible for more than 60 per cent of global economic output, account for 48 per cent of world trade, and are home to 38 per cent of the world’s population.</li>\n\t<li>In 2021, APEC partners accounted for over 83 per cent of Canada’s total merchandise trade.</li>\n\t<li>This is the 3<sup>rd</sup> Summit of la Francophonie attended by Prime Minister Trudeau.</li>\n\t<li>Canada is one of the founding countries and an active member of the International Organisation of La Francophonie.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}