{
  "path": "/en/news/statements/2019/01/17/statement-prime-minister-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul&nbsp;Wallenberg Day:</p><p>“Today, we pay tribute to Raoul Wallenberg, a hero and humanitarian whose work saved tens of thousands of Hungarian Jews during the Holocaust.</p><p>“A Swedish diplomat in Budapest, Mr. Wallenberg put his own life on the line to protect people from deportation and death. He issued ‘protective passports,’ known as Schutz-Passes, to thousands of Hungarian Jews. These Swedish documents shielded their bearers from deportation to the death camps of the Nazi regime. Mr. Wallenberg went to great lengths to distribute these. One witness recounts that he once climbed onto the roof of a train departing for the death camps and handed out passports indiscriminately, allowing their holders off the train.</p><p>“Mr. Wallenberg also established safe havens to shelter Jewish people across the city, under the protection of the Swedish flag. This network of safehouses, soup kitchens, hospitals, and child care centres protected thousands more from deportation. Within months, Mr. Wallenberg saved more Jews from the Holocaust than any other individual, group, or government. His efforts also inspired other diplomats from neutral countries to do what was in their power to protect Budapest’s Jews.</p><p>“Near the end of the war, Mr. Wallenberg was taken into Soviet custody and tragically disappeared. Little is known of his fate, but his legacy endures. The stories of those he saved bear witness to his heroism, as do the many monuments and institutions that carry his name. In 1985, Canada made Mr. Wallenberg its first honorary citizen – a tribute to his courage and compassion in the service of others.</p><p>“Today, we must live up to his example, and stand up to a resurgence of hatred, racism, and anti-Semitism in our world. Events like those in Pittsburgh this past fall are an excruciating reminder that our work is not done. Together, we can do more, in our own communities and daily lives, to fight hate, teach openness, and cultivate love.</p><p>“Today, I encourage all Canadians to learn more about Mr. Wallenberg’s life and legacy. Raoul Wallenberg showed us what it means to be a hero: with bravery, ingenuity, and compassion, he put others before himself. All of us can carry his example forward, and find the courage to change the world.”</p></div>\n      "
}