{
  "path": "/en/news/readouts/2021/11/26/prime-minister-justin-trudeau-meets-mayor-montreal-valerie-plante",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Montréal Valérie Plante | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau, along with the Minister of Canadian Heritage and Quebec Lieutenant, Pablo Rodriguez, met with the Mayor of Montréal, Valérie Plante, who was accompanied by the Chair of the City of Montréal’s Executive Committee, Dominique Ollivier, to discuss shared priorities.</p>\n\n<p>The Prime Minister and the Mayor spoke about the importance of working together to ensure a robust economic recovery for Montréal’s downtown, as we all strive to finish the fight against COVID-19. They also discussed their respective measures to fight climate change.</p>\n\n<p>The Prime Minister and the Mayor agreed that the current situation surrounding gun violence in Montréal and across the country is unacceptable, and that it is imperative for different orders of government and various police forces to work together to ensure that communities are safe.</p>\n\n<p>The Prime Minister and the Mayor also discussed the various federal, provincial, and municipal affordable housing initiatives, including the National Housing Strategy. They reaffirmed their commitment to creating more social housing units so that every Canadian has a safe and affordable place to call home. They also discussed the importance of revitalizing Montréal’s east end and agreed to continue working together to improve all Montrealers’ quality of life.</p>\n\n<p>The Prime Minister and the Mayor looked forward to their continued collaboration on these priorities and other issues that are important to Montrealers and Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/09/prime-minister-justin-trudeau-speaks-mayors-quebec\">Prime Minister Justin Trudeau speaks with mayors of Quebec</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/02/prime-minister-trudeau-concludes-productive-united-nations-climate\">Prime Minister Trudeau concludes productive United Nations Climate Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/30/4500-more-homes-canadians\">4,500 more homes for Canadians</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n</ul></div>\n      "
}