{
  "path": "/en/news/readouts/2023/03/30/prime-minister-justin-trudeau-speaks-president-dominican-republic-luis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the Dominican Republic Luis Abinader | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the Dominican Republic, Luis Abinader.</p>\n\n<p>Prime Minister Trudeau and President Abinader underscored the need to help address the ongoing crisis in Haiti and expressed concern over the worsening security conditions in the country. Both leaders stressed the need to hold accountable those who cultivate violence, corruption, and instability in Haiti.</p>\n\n<p>Prime Minister Trudeau further reiterated the importance of a Haitian-led solution to the crisis and indicated that Canada is committed to supporting the Haitian National Police in its efforts to re-establish peace and security. The leaders expressed their desire for a return to stability in Haiti.</p>\n\n<p>Prime Minister Trudeau and President Abinader highlighted the importance of continued cooperation between Canada and the Dominican Republic and with the international community in support of Haiti.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/dominican_republic-republique_dominicaine/relations.aspx?lang=eng\">Canada-Dominican Republic relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n</ul></div>\n      "
}