{
  "path": "/en/news/statements/2018/02/12/statement-prime-minister-international-day-against-use-child-soldiers",
  "pageTitle": "Statement by the Prime Minister on the International Day Against the Use of Child Soldiers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against the Use of Child Soldiers:</p><p>“Child soldiers live lives no child should ever lead. The Government of Canada is committed to taking real steps towards ending the recruitment and use of child soldiers, and making sure children remain children and do not become weapons of war.</p><p>“On this <a href=\"https://childrenandarmedconflict.un.org/press-release/international-day-against-child-soldiers-2016/\">International Day Against the Use of Child Soldiers</a>, Canada reaffirms its commitment to stand as a leader and work with the United Nations and others in the international community to end the recruitment and use of child soldiers. Our goal is to promote global peace and security and protect children around the world from abuse and violence.</p><p>“Over the past year, we have taken strong actions to demonstrate this commitment.&nbsp; Canada set an important precedent with the development of a <a href=\"https://www.canada.ca/en/department-national-defence/news/2017/03/canadian_armed_forcessetsprecedentwithchildsoldierdoctrine.html\">Child Soldier Doctrine</a> to ensure our armed forces are prepared to face and prevent the use of child soldiers, and we signed the <a href=\"https://www.canada.ca/en/global-affairs/news/2017/02/canada_endorses_safeschoolsdeclaration.html\">Safe Schools Declaration</a> to protect schools, teachers, and students during armed conflict. During the UN Peacekeeping Defence Ministerial in Vancouver, we also introduced the <a href=\"/en/news/backgrounders/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a>, which has now been endorsed by 59 nations around the globe.</p><p>“The Government of Canada will continue to work with the Roméo Dallaire Child Soldiers Initiative to build a world that views the protection of boys and girls as essential to achieving peace and security. We <a href=\"https://www.canada.ca/en/global-affairs/news/2018/02/statement_on_internationaldayagainsttheuseofchildsoldiers.html\">announced today $3.1 million in funding</a> for a project with this Initiative to help end the recruitment of child soldiers in South Sudan.</p><p>“A future where children are no longer used as weapons of war is within our grasp—if we choose to make children a priority.&nbsp;Together, we can prevent the recruitment of children, and ensure they live in a safe world where their basic human rights are protected.”</p></div>\n      "
}