{
  "path": "/en/news/readouts/2022/01/27/prime-minister-justin-trudeau-speaks-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Barbados, Mia Mottley, to offer his congratulations&nbsp;on her re-election.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley recognized that without access to concessional financing, many countries cannot invest adequately in their own development. They noted how the COVID-19 pandemic is exacerbating these challenges, making it harder to meet the United Nations Sustainable Development Goals. The prime ministers discussed the need to engage key actors, such as international financial institutions and the private sector, in any efforts to mobilize development financing with a view to building a fairer, safer, and more inclusive post-pandemic world for everyone.</p>\n\n<p>In this respect, the two leaders spoke about Prime Minister Trudeau’s leadership alongside the Prime Minister of Jamaica, Andrew Holness, on the United Nations’ Financing for Development in the Era of COVID-19 and Beyond Initiative. Prime Minister Trudeau and Prime Minister Mottley looked forward to finding opportunities to work together on urgent issues, such as fighting climate change, advancing gender equality, and strengthening education.</p>\n\n<p>The prime ministers reaffirmed their commitment to addressing the unique challenges faced by small island states. They welcomed the continued strong engagement between their governments and in partnership with the Caribbean Community (CARICOM). The two leaders committed&nbsp;to speaking again in the coming months.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada-Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/world-leaders-focus-key-actions-assist-countries-battered-financial\">World leaders to focus on key actions to assist countries battered by the financial crisis caused by COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n</ul></div>\n      "
}