{
  "path": "/en/news/news-releases/2019/08/29/creating-clean-growth-and-jobs-british-columbias-energy-sector",
  "pageTitle": "Creating clean growth and jobs in British Columbia’s energy sector | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s natural resources drive our economy and support thousands of middle class jobs. Building modern infrastructure and clean technologies in the resource sector is part of the Government of Canada’s plan to get our resources to new markets, spark economic growth, and accelerate Canada’s clean energy transition.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of British Columbia, John Horgan, today announced a new Memorandum of Understanding to affirm their joint commitment to power British Columbia’s natural gas production and liquefied natural gas (LNG) sectors with clean electricity.</p>\n\n<p>The natural gas industry produces about 18 per cent of the province’s greenhouse gas emissions. By moving to clean power – a process referred to as electrification – we will avoid emissions and position Canada as a supplier of the world’s cleanest natural gas. It will also help British Columbia achieve its climate change commitments, and support projects that will create new jobs and opportunities in rural and Indigenous communities across the province.</p>\n\n<p>The Government of Canada is working to support infrastructure that brings clean electricity to Canadian businesses, and helps create good middle class jobs, a low-carbon economy, and greener communities.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>\"Canadians know that economic growth and environmental protection go hand-in-hand. Today, we are committing to work with British Columbia to help power the natural gas sector with clean electricity – reducing greenhouse gas emissions, creating good middle class jobs, and helping make the province a supplier of the cleanest natural gas in the world.\"</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>\"Canadians are strongest when we work together. Through this Memorandum of Understanding, we will enhance our collaboration with British Columbia to power the natural gas sector with clean electricity, and in the process, move toward renewable and sustainable sources of energy that grow our economy, generate local jobs, and enhance trade.\"</p>\n\n<footer class=\"default\">The Hon. Amarjeet Sohi, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>\"Our governments are working collaboratively to electrify industries and reduce emissions as we put B.C. on a path to a cleaner, better future. With this Memorandum of Understanding, we are taking an important step forward to build a more sustainable economy and protect our environment, while creating opportunities for people.\"</p>\n\n<footer class=\"default\">The Hon. John Horgan, Premier of British Columbia</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Minister of Natural Resources, Amarjeet Sohi, and British Columbia’s Minister of Energy, Mines and Petroleum Resources, Michelle Mungall signed the Memorandum of Understanding between the federal and provincial governments.</li>\n\t<li>A new Canada-British Columbia Clean Power Planning Committee, which includes representatives from the provincial and federal governments and BC Hydro, will work to advance projects that increase power transmission and electrification across the province.</li>\n\t<li>The Committee will build on past work including the Regional Electricity Cooperation and Strategic Infrastructure Initiative, which found that opportunities to electrify the natural gas sector in British Columbia are among the most cost-effective in Western Canada.</li>\n\t<li>The natural gas industry currently provides good middle class jobs and investments into Canada. Just last year, LNG Canada made a historic $40 billion investment – the largest private sector investment in the country’s history – to build a major LNG project in Kitimat, British Columbia. The project will create up to 10,000 jobs at the height of construction, lead to billions of dollars in direct government revenues, and include hundreds of millions of dollars in contracts for Indigenous businesses.</li>\n\t<li>This work is part of a broader effort to advance clean power in regions across Canada. Earlier this year, the Government of Canada, together with the Atlantic provinces, announced the creation of an Atlantic Clean Power Planning Committee to develop a Clean Power Roadmap for Atlantic Canada.</li>\n\t<li>In April 2019, the Government of Canada <a href=\"https://www.canada.ca/en/office-infrastructure/news/2019/04/canada-and-bc-to-bring-clean-energy-to-the-peace-region.html\">announced</a> up to $83.6 million toward the Peace Region Electricity Supply project through the Investing in Canada infrastructure plan. BC Hydro provided the remaining $205.4 million.</li>\n\t<li>In December 2018, the Government of British Columbia released CleanBC, its new provincial economic development, energy, and climate strategy, which prioritized electrification of the natural gas sector as a way to meet its climate change commitments.</li>\n\t<li>In 2016, the Government of Canada worked with provinces and territories, and engaged Indigenous peoples, to adopt Canada’s national climate plan, the Pan-Canadian Framework on Clean Growth and Climate Change. The plan contains over 50 specific measures to reduce carbon pollution, help Canadians adapt and become more resilient to the impacts of a changing climate, foster clean technology solutions, and create good jobs that contribute to a stronger economy.</li>\n\t<li>Investing in the clean economy presents an enormous economic opportunity. According to the Global Commission on the Economy and the Climate, the clean economy is expected to grow to $26 trillion and create 65 million jobs worldwide by 2030.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/08/29/memorandum-understanding-between-government-canada-and-government\">Memorandum of Understanding between the Government of Canada and the Government of British Columbia on the electrification of the natural gas sector</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://cleanbc.gov.bc.ca/\">CleanBC</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}