{
  "path": "/en/news/statements/2019/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World AIDS Day:</p>\n\n<p>“On <a href=\"https://www.who.int/news-room/events/detail/2019/12/01/default-calendar/world-aids-day-2019-communities-make-the-difference\">World AIDS Day</a>, we stand in solidarity with people in Canada, and around the globe, living with HIV and AIDS. Today, as we recommit ourselves to ending this epidemic, we also remember the friends and loved ones we have lost.</p>\n\n<p>“In recent years, there has been important progress in treatment, but there remains work to be done to end the stigma that too many people still face, and ensure that everyone gets the care they deserve.</p>\n\n<p>“This year’s theme, ‘<a href=\"https://www.unaids.org/en/resources/campaigns/WAD_2019\">Communities make the difference’</a>, reminds us of the importance of community, from providing supportive networks that ensure no one is left behind, to encouraging people to get tested and connecting them with treatment. Advocates and grassroots organizations change lives for the better, offering invaluable peer-to-peer education, while fighting for sustainable and reliable services for people living with HIV.</p>\n\n<p>“We know that ending this global epidemic means empowering communities. In August, Canada pledged over $930 million for the <a href=\"https://www.theglobalfund.org/en/\">Global Fund to fight AIDS, Tuberculosis, and Malaria</a>. These funds will support prevention, treatment, and care, while helping end the gender and social inequalities, including poverty, that drive the spread of these diseases. Canada remains steadfast in our commitment to comprehensive sexual and reproductive health and rights, especially for women, girls, and marginalized groups.</p>\n\n<p>“This year, we also made <a href=\"https://www.canada.ca/en/institutes-health-research/news/2019/06/government-of-canada-invests-close-to-23m-in-hivaids-research.html\">important investments in HIV and AIDS research</a> and launched the <a href=\"https://www.canada.ca/en/public-health/services/reports-publications/accelerating-our-response-five-year-action-plan-sexually-transmitted-blood-borne-infections.html\">Five-Year Action Plan on Sexually Transmitted and Blood-Borne Infections</a>. The plan supports community-based efforts to reach undiagnosed people, which helps improve access to treatment and care, prevents new cases, and reduces discrimination.</p>\n\n<p>“Today, I encourage everyone to raise awareness about HIV, and challenge the misconceptions that lead to stigma. Together, we can end this global epidemic, and ensure that everyone has the care and support they need to live full and healthy lives.”</p></div>\n      "
}