{
  "path": "/en/news/news-releases/2018/02/13/young-canadians-guide-countrys-first-youth-policy",
  "pageTitle": "Young Canadians to guide country’s first youth policy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister and Minister of Youth, Justin Trudeau, today announced several ways for young Canadians to take part in the development of Canada’s first youth policy.</p><p>Starting today, young Canadians can access an easy-to-use, interactive online platform – <a href=\"https://youthaction.ca/\">youthaction.ca</a> – where they can share their ideas and perspectives on what a youth policy should look like. Young Canadians will also be able to attend in-person sessions, which will be held across the country in the coming months. In addition, the Government of Canada has put together a toolkit that any young person can use to lead their own discussions.</p><p>Young Canadians already play an important role in shaping the Government’s priorities and decisions, including through the Prime Minister’s Youth Council and Constituency Youth Councils across the country. This initiative will help make sure young Canadians have a voice in matters important to them, and that their ideas and perspectives are incorporated in the Government’s actions and decision-making.</p><h2>Quote</h2><p>“This initiative is about making sure young Canadians from all walks of life, across the country, can have their say on what the Government’s priorities should be for youth. The youth policy for Canada – built for youth and by youth – will make sure that their important perspectives guide our way forward.”<br><cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p><h2>Quick facts</h2><ul><li>To guide the development of the youth policy for Canada, the youth-led dialogue will:<ul><li>Identify issues that are important to youth and have an impact on their daily lives and futures.</li><li>Examine the type of support that enable all youth – regardless of their background – to be the leaders of today and tomorrow.</li><li>Assess initiatives that are already in place – and identify new actions that can be taken – to improve the lives of young Canadians.</li></ul></li><li>The Government of Canada will work with youth-serving and youth-led organizations, as well as youth advocates, to ensure the participation of Indigenous youth, youth who live in rural or remote areas, and others who are often under-represented.</li><li>On January 16, the Prime Minister announced the design phase of <a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html?utm_campaign=CanadaServiceCorps&amp;utm_source=SocialMedia_Print_Poster&amp;utm_medium=VanityUrl&amp;utm_term=en&amp;utm_content=canada-ca_canada-service-corps\">Canada Service Corps</a>, Canada’s new service program for young Canadians. This $105 million initiative will encourage young Canadians to get involved in service to communities and gain valuable skills and experience that will benefit them in every aspect of life.</li><li>The Prime Minister’s Youth Council is a group of 26 young Canadians from across the country who provide non-partisan advice to the Prime Minister and the Government of Canada on issues of importance to all Canadians.</li></ul><h2>Associated links</h2><ul><li><a href=\"https://youthaction.ca/\">Building a Youth Policy for Canada</a></li><li><a href=\"/en/news/news-releases/2018/01/16/prime-minister-launches-canada-service-corps\">Prime Minister launches Canada Service Corps</a></li><li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li></ul></div>\n      "
}