{
  "path": "/en/news/statements/2021/06/02/statement-prime-minister-italys-75th-republic-day",
  "pageTitle": "Statement by the Prime Minister on Italy’s 75th Republic Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Italy’s 75th Republic Day:</p>\n\n<p>“Today, we join Italians in Canada and around the world as they celebrate Italy’s 75th Republic Day – known as La Festa della Repubblica.</p>\n\n<p>“This Italian national holiday marks the official formation of the Republic of Italy following the Second World War. The change ushered in a new era of freedom and collaboration by and for the Italian people, and demonstrated their newfound strength, resilience, and hope for a better future.</p>\n\n<p>“Canada and Italy have long enjoyed strong bilateral relations that are bolstered by common values and priorities. These shared values include fighting climate change, empowering women and girls, and strengthening trade and investment links for the benefit of Canadians and Italians. We work together on the world stage to promote these and other important issues, including through the G7 and NATO, as well as the G20, which Italy is hosting this year as the G20 President.</p>\n\n<p>“The longstanding friendship between our two countries is equally strengthened by our deep people-to-people ties. Approximately 1.6 million people of Italian heritage call Canada home – one of the largest Italian diasporas in the world.</p>\n\n<p>“Last week, I delivered a formal apology in the House of Commons for the internment of Italian Canadians during the Second World War. As we acknowledge these historical wrongs, we also recognize the courage, resilience, and commitment of the Italian Canadian community to Canada. Every day, they contribute to our collective economic, social, and cultural fabric to help shape a better, more inclusive country.</p>\n\n<p>“On behalf of the Government of Canada, I offer my best wishes to everyone celebrating La Festa della Repubblica.</p>\n\n<p>“Tanti auguri!”</p></div>\n      "
}