{
  "path": "/en/news/news-releases/2022/01/14/nova-scotia-families-save-hundreds-each-month-child-care-fees",
  "pageTitle": "Nova Scotia families to save hundreds each month in child care fees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Too many families across Canada lack access to affordable, inclusive, and high-quality child care. That is why the Government of Canada has laid out a plan to provide Canadian parents with, on average, $10‑a‑day child care spaces for children under six years old. This plan will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, virtually joined the Premier of Nova Scotia, Tim Houston, today to announce that child care fees for families in Nova Scotia will be reduced by 25&nbsp;per cent on average, saving them on average $200 per month. The fee decrease will begin as of April 1, 2022, and be retroactive to January 1, 2022. This will apply to parents with children up to six years old in regulated child care spaces that are part of the Canada‑wide early learning and child care system. Today’s announcement is an initial step in reducing child care fees for Nova Scotian families by 50 per cent by the end of 2022, and achieving an average of $10‑a‑day care by 2025-26.</p>\n\n<p>The Prime Minister and Premier also announced today that a minimum of 1,500 new regulated child care spaces will be available to Nova Scotia families beginning this fall. These spaces are part of the 9,500 new regulated child care spaces that the governments of Canada and Nova Scotia announced in July 2021.</p>\n\n<p>The time for a Canada-wide early learning and child care system is now. The Government of Canada will continue to work with provinces, territories, and Indigenous partners across the country to ensure that all families have access to affordable, inclusive, and high-quality early learning and child care no matter where they live.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to affordable child care. That is why we’re making $10‑a‑day child care a reality across the country. The reduction of fees announced today in Nova Scotia is an important step forward to delivering on our Canada-wide early learning and child care system, which will save families thousands of dollars each year, create jobs, grow the middle class, and give our kids the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Reducing the cost of child care by 25 per cent will make a real difference for families and caregivers of young children, and Nova Scotians thinking about starting a family. Cost can be a barrier to accessing quality child care and may prevent parents from joining or rejoining the workforce. Acting now to reduce fees will help provide relief as we move toward a 50 per cent, on average, reduction in fees by the end of the year.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Tim Houston, Premier of Nova Scotia</footer>\n</blockquote>\n\n<blockquote>\n<p>“Access to affordable and high-quality child care is both an economic and a social policy. It gives our children the best possible start in life, makes life more affordable for families with kids, and enables both mothers and fathers to work, thereby increasing the workforce. It also creates good, well-paying jobs for educators. Today’s 25 per cent fee reduction will deliver savings for thousands of families, and it will help strengthen the Nova Scotia and Canadian economies as we build $10-a-day child care.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada’s goal is to ensure that by the end of March 2026, all families in Canada, no matter where they live, will have access to regulated early learning and child care for an average of $10 a day. The reduction of fees announced today in Nova Scotia is a meaningful step toward achieving that goal and will make a real difference for families across the province. We will continue to work with Nova Scotia to help ensure that children have access to the high-quality, affordable, and inclusive early learning and child care they need to succeed.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Along with the huge benefit of affordable child care, participation in the Canada-wide agreement means increasing wages and benefits for hundreds of early childhood educators. We are creating hundreds of jobs and, at the same time, expanding child care spaces across the province. Better pay and benefits will help us keep the great early childhood educators we have and attract more people to the profession.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Becky Druhan, Nova Scotia’s Minister of Education and Early Childhood Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>To date, the Government of Canada has reached early learning and child care agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta\">Alberta</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/13/10-day-child-care-families-new-brunswick\">New Brunswick</a>, and the <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/15/10-day-child-care-families-northwest-territories\">Northwest Territories</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> to strengthen the early learning and child care system in the province.</li>\n\t<li>As part of the agreement with Nova Scotia, the Government of Canada is investing $605&nbsp;million over five years to help improve regulated early learning and child care for children under six years of age in the province.</li>\n\t<li>Today’s announcement is an important step as part of Nova Scotia’s commitment under the Canada-wide early learning and child care system to reduce fees for regulated child care spaces for children under six by 50 per cent by the end of 2022, with the goal of achieving an average of $10‑a‑day care by the end of fiscal year 2025-26.</li>\n\t<li>Nova Scotia is the fourth province to announce the implementation of child care fee reductions, working towards the commitment under the Canada‑wide early learning and child care system to reduce fees for parents with children in regulated child care spaces by 50 per cent on average by the end of 2022. Reduction of child care fees have already been announced in Saskatchewan, Prince Edward Island, and Alberta.</li>\n\t<li>By the end of March 2026, Nova Scotia will create 9,500 new full-time regulated early learning and child care spaces for children under the age of six.</li>\n\t<li>As part of Budget 2021, the Government of Canada made a transformative investment of over $27&nbsp;billion over five years to build a Canada-wide early learning and child care system with provinces and territories. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 2,000 in Nova Scotia.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotian families to benefit from early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada Child Benefit</a></li>\n</ul></div>\n      "
}