{
  "path": "/en/news/readouts/2021/01/27/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen discussed their respective efforts to fight the global COVID-19 pandemic and to deploy safe and effective vaccines to as many people as possible, as quickly as possible.&nbsp;They shared their concerns about recent delays in the production and supply of vaccines. President von der Leyen provided assurances that the proposed European Union vaccine export transparency mechanism is not intended to disrupt exports of vaccines to Canada. The leaders committed to having their officials stay in regular contact on any issues affecting exports.</p>\n\n<p>The two leaders emphasized the importance of global coordination, including through the ACT-Accelerator and COVAX, to ensure universal, equitable, and affordable access to vaccines, diagnostics, and therapeutics around the world, because no one is safe until everyone is safe.</p>\n\n<p>The Prime Minister and the President exchanged views on other global issues, including their condemnation of the arrest and detention of Alexei Navalny and violent suppression of protests in Russia.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen looked forward to continuing to work together, alongside global partners, to advance shared priorities, including in the G7, the G20, and other multilateral organizations.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/29/joint-press-release-eu-canada-leaders-virtual-meeting\">Joint press release: EU-Canada Leaders' Virtual Meeting</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/g7-foreign-ministers-statement-on-navalny.html\">G7 Foreign Ministers' Statement on Arrest and Detention of Alexei Navalny</a></li>\n</ul></div>\n      "
}