{
  "path": "/en/news/news-releases/2017/10/23/prime-minister-appoints-honourable-bob-rae-special-envoy-myanmar",
  "pageTitle": "Prime Minister appoints the Honourable Bob Rae as Special Envoy to Myanmar | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today named the Honourable Bob Rae as his Special Envoy to Myanmar. Mr. Rae will begin his work immediately, engaging in diplomatic efforts to address the crisis regarding the country’s Rakhine State.</p><p>As Special Envoy, Mr. Rae will reinforce the urgent need to resolve the humanitarian and security crisis in Myanmar and to address the situation affecting vulnerable populations, including the Rohingya Muslim community, other religious and ethnic minorities, and women and girls. He will also advise the Prime Minister on how Canada can best support efforts to respond to the needs of those affected and displaced by the recent violence.</p><p>Canada’s efforts in the region will continue to address both the immediate and long-term political, socio-economic and humanitarian challenges facing the people in Rakhine State and Myanmar. To help address these challenges, Prime Minister Trudeau also announced that Canada will provide an additional $12 million in humanitarian assistance to meet the needs of those affected by this crisis.&nbsp;</p><h2>Quote</h2><blockquote><p>“Canada is deeply concerned about the urgent humanitarian and security crisis in Myanmar’s Rakhine State, particularly the brutal persecution of the Rohingya Muslim people. I am confident that Bob Rae’s vast experience as a lawyer, advisor, negotiator, arbitrator and public servant will help Canada work more effectively with Myanmar and other international partners to chart a path towards lasting peace and reconciliation.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Myanmar established diplomatic relations when the Southeast Asian country became independent in 1948.</li><li>To date in 2017, Canada has provided more than $25 million in humanitarian assistance funding to partners in Myanmar and Bangladesh to meet the needs of crisis-affected people, including the Rohingya. This amount includes the additional $12 million announced today.</li><li>In June 2017, the Prime Minister met with Her Excellency Daw Aung San Suu Kyi, State Counsellor of the Republic of the Union of Myanmar. During the meeting, the Prime Minister highlighted the need for Myanmar to accelerate efforts to uphold human rights and protect ethnic and religious minorities, and reiterated Canada’s support for ongoing reforms in the country.</li><li>In September 2017, the Prime Minister spoke and wrote to Her Excellency Daw Aung San Suu Kyi to convey his deep concerns over the situation in Rakhine State for Rohingya Muslims and other ethnic minorities.</li></ul><h2>Biographical notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/10/23/biographical-notes-–-bob-rae\">Bob Rae</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/global-affairs/news/2017/10/canada_gravely_concernedwithdeterioratingsituationinmyanmar.html\">Canada gravely concerned with deteriorating situation in Myanmar</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2017/09/canada_calls_foractiononcriticalsituationinmyanmar.html\">Canada calls for action on critical situation in Myanmar</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/myanmar.aspx?lang=eng&amp;_ga=2.17376703.708859215.1508197961-456718634.1453848810\">Canada and the crisis in Myanmar’s Rakhine State</a></li><li><a href=\"/en/news/news-releases/2017/06/07/prime-minister-announces-support-peace-process-and-humanitarian\">Prime Minister announces support for peace process and humanitarian assistance in Myanmar</a></li><li><a href=\"/en/news/readouts/2017/09/13/prime-minister-justin-trudeau-speaks-state-counsellor-daw-aung-san-suu-kyi\">Prime Minister Justin Trudeau speaks with State Counsellor Daw Aung San Suu Kyi of Myanmar</a></li></ul></div>\n      "
}