{
  "path": "/en/news/statements/2023/04/21/statement-prime-minister-ridvan",
  "pageTitle": "Statement by the Prime Minister on Ridván | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ridván:</p>\n\n<p>“Today at sunset, Bahá’í communities in Canada and around the world will come together to celebrate Ridván, a 12-day festival and the holiest time of the Bahá’í calendar.</p>\n\n<p>“This year marks 160 years since the founder of the faith, Bahá’u’lláh, declared that he experienced divine revelation and that he was a Manifestation of God in the Garden of Ridván, which means paradise in Arabic, in Baghdad. The holiday commemorates the beginnings of the Bahá’í faith – one built around the principles of cooperation, reciprocity, service, and unity in diversity. To celebrate, Bahá’ís will gather to feast and honour fellowship, hold conventions, and elect local, national, and international administrative bodies.</p>\n\n<p>“Bahá’ís have a long history in Canada and, today, Bahá’ís in over a thousand communities across every province and territory continue to live out and practise their faith while upholding our shared values of respect, tolerance, and inclusion.</p>\n\n<p>“The Government of Canada is deeply concerned about the injustices endured by members of the faith in Iran, where the escalating campaign to suppress and persecute individuals denies their freedoms of expression, religion, and association and their right to education. We continue to stand up and call on the Iranian regime to end discrimination against minorities in Iran, including the Bahá’í community, one of the largest non-Muslim religious minorities in Iran. We have also helped to settle Bahá’í refugees in Canada, and will continue to call attention to the plight of the Bahá’í community in Iran.</p>\n\n<p>“On behalf of all Canadians, Sophie and I extend our best wishes for a joyful 12 days of Ridván to all those celebrating in Canada and around the world.”</p></div>\n      "
}