{
  "path": "/en/news/news-releases/2018/11/12/prime-minister-concludes-his-visit-france",
  "pageTitle": "Prime Minister concludes his visit to France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today concluded his visit to France, where he attended commemorative activities for the 100th anniversary of the First World War Armistice. During the visit, he also took part in the first ever Paris Peace Forum and the GovTech Summit.</p><p>To honour the 100th anniversary of the armistice that marked the end of the First World War, the Prime Minister participated in commemorative ceremonies in Paris and at the Canadian National Vimy Memorial. Together with the Minister of Veterans Affairs, Seamus&nbsp;O’Regan, Prime Minister Trudeau also met with Canadian veterans, taking the opportunity to thank them for their service and sacrifices.</p><p>The Prime Minister then attended the Paris Peace Forum, where political, economic and civil society leaders came together to discuss how to address pressing global challenges. During the Forum, Canada joined several other countries to support the International Declaration on Information and Democracy. In his remarks, the Prime Minister underscored that no real democracy can exist without freedom of the press. He highlighted the importance of working together internationally to defend the free press, protect journalists, and ensure freedom of expression.</p><p>On the last day of his visit, Prime Minister Trudeau was a featured speaker at the GovTech Summit. He stressed the importance of using new technologies to strengthen our economies and improve the lives of people around the world.</p><p>During the visit, Prime Minister Trudeau met with the President of France, Emmanuel Macron, to further strengthen the deep ties of friendship between Canada and France.</p><p>Prime Minister Trudeau will now travel to Singapore to attend events on the margins of the 33<sup>rd</sup> Summit of the Association of Southeast Asian Nations (ASEAN).</p><h2>Quotes</h2><blockquote><p>“It was an honour for me to pay tribute to the Canadians who fought and gave their lives in the First World War. The 100th anniversary of the Armistice reminds us that Canadians in uniform continue to be the strength and pride of our country. Thanks to their service, dedication, and sacrifice, we live in a safer, more peaceful world.”<br><cite>—The Right Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and France share a deep and longstanding friendship, based on our history, a shared language, and common values. At the first Paris Peace Forum, we built on these values to advance peace, security, and democracy around the world, including by defending freedom of the press. I look forward to continuing to work together to build a better future for all.”<br><cite>—</cite><cite>The Right Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>As a permanent member of the United Nations Security Council, NATO, the G7 and the G20, and as a founding country of the European Union and a major partner in the Francophonie, France is an important ally for Canada on the international stage.</li><li>Prime Minister Trudeau and President Macron both attended the United Nations General Assembly in New York from September 24 to 26, 2018.</li><li>Canada’s G7 presidency will end when France assumes the presidency on January 1, 2019.</li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/news-releases/2018/11/05/prime-minister-travel-france\">Prime Minister to travel to France</a></li><li><a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/last-hundred-days/100-anniversary\">Canada’s Hundred Days and the Armistice 100th anniversary</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li><li><a href=\"https://parispeaceforum.org/\">Paris Peace Forum</a></li></ul></div>\n      "
}