{
  "path": "/en/news/statements/2023/04/06/statement-prime-minister-fifth-anniversary-tragic-bus-crash-involving",
  "pageTitle": "Statement by the Prime Minister on the fifth anniversary of the tragic bus crash involving the Humboldt Broncos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fifth anniversary of the tragic bus crash involving the Humboldt Broncos in Saskatchewan:</p>\n\n<p>“Today marks the fifth anniversary of a tragic accident that shook Canadians from coast to coast to coast. On April 6, 2018, a bus carrying the Humboldt Broncos junior hockey team was involved in a collision with a transport truck, killing 16 team members and staff and injuring 13 others.</p>\n\n<p>“In the face of great tragedy, we pulled together as Canadians – just like we always do. To remember the lives lost and honour the victims, we held moments of silence in arenas all across the country, we wore the colours of the Humboldt jersey – white, yellow, and green – and raised money for one of the most successful online fundraising campaigns in history to support the families of victims, the survivors, and the community in their time of need. In the weeks following the tragedy, about 150,000 people across the country registered to become organ donors, inspired by Humboldt Bronco Logan Boulet, whose donated organs helped six people.</p>\n\n<p>“The Humboldt community is emblematic of what it means to be Canadian. They have shown enormous strength and resilience in the years since the tragedy, by creating scholarships and sponsorships for future generations and providing counselling services and support groups for those impacted. Today, as we remember the lives lost, we also look ahead with hope and optimism for the survivors, who now speak out about dealing with trauma, making our communities more accessible, and leading healthy lifestyles.</p>\n\n<p>“We owe it to them to work to ensure a tragedy like this never happens again. That’s why, in response, we worked with provinces and territories to develop a national standard for entry-level training for truck drivers and improve safety features on buses and other vehicles, including electronic logging devices in motor coaches and heavy commercial trucks to reduce the risk of fatigue-related collisions. Seatbelts are now also required on all new motor coaches.</p>\n\n<p>“On this day, we remember the lives that were cut short by this tragedy, honour the survivors, and stand with the families and the community of Humboldt, Saskatchewan. We continue to be inspired by their strength, their determination, and their compassion. They are forever Humboldt strong.”</p></div>\n      "
}