{
  "path": "/en/news/statements/2022/09/11/statement-prime-minister-nayrouz",
  "pageTitle": "Statement by the Prime Minister on Nayrouz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Nayrouz:</p>\n\n<p>“Today, Coptic Orthodox Christians in Canada and around the world will celebrate the Feast of Nayrouz – also known as the Feast of Rivers – and welcome the Coptic New Year.</p>\n\n<p>“Nayrouz marks the beginning of Thout, the first month of the Coptic calendar. On this day, many Coptic communities will come together to pray, exchange gifts, reflect, and celebrate the year to come.</p>\n\n<p>“Ancient Egyptians saw Nayrouz as a day of thanksgiving to welcome the rising waters of the Nile, which provided essential irrigation for crops. Nowadays, Nayrouz serves as a reminder of the persecution Copts endured under Roman rule. In the face of oppression, Coptic communities showed resilience and dedication to their faith. Today, they continue to serve as an example to Coptic Christians and many others around the world.</p>\n\n<p>“This year, the celebrations are marked with sadness and remembrance, following the tragic fire that occurred at the Coptic Abu Sifin church in Giza, Egypt, on August 14, which took the life of dozens of worshippers, including children.</p>\n\n<p>“On this day, I encourage all Canadians to learn more about the long and rich history of Coptic Christians and to recognize the many contributions they have made, and continue to make, to Canada. Today, we recommit ourselves to the values of peace, safety, and freedom of expression and religion or belief we share, which keep our country strong, open, and inclusive.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our best wishes to all those celebrating Nayrouz.”</p></div>\n      "
}