{
  "path": "/en/news/statements/2016/06/13/statement-prime-minister-canada-likely-death-robert-hall",
  "pageTitle": "Statement by the Prime Minister of Canada on the likely death of Robert Hall | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the likely death of Robert Hall:</p>\n<p>“It is with deep sadness that I have reason to believe that a Canadian citizen, Robert Hall, held hostage in the Philippines since September 21, 2015, has been killed by his captors.</p>\n<p>“While Canadian officials are working closely with authorities in the Philippines to formally confirm Mr. Hall’s death, we have compelling reason to believe that reports to this effect are, unfortunately, true. &nbsp;&nbsp;</p>\n<p>“The vicious and brutal actions of the hostage-takers have led to a needless death.</p>\n<p>“Canada holds the terrorist group who took him hostage fully responsible for this cold-blooded and senseless murder.</p>\n<p>“With the tragic loss of two Canadians, I want to reiterate that terrorist hostage-takings only fuel more violence and instability. Canada will not give into their fear mongering tactics and despicable attitude toward the suffering of others.</p>\n<p>“This is precisely why the Government of Canada will not and cannot pay ransoms for hostages to terrorists groups, as doing so would endanger the lives of more Canadians.</p>\n<p>“We are more committed than ever to working with the Government of the Philippines and international partners to pursue those responsible for these heinous acts and bring them to justice, however long it takes.</p>\n<p>“The Government’s top priority, and my own as Prime Minister, is the safety and security of Canadian citizens.</p>\n<p>“On behalf of the Government of Canada and all Canadians, I would like to express my heartfelt condolences to the family and friends of Mr. Hall.&nbsp;</p>\n<p>“They have suffered a terrible loss, and this is a devastating moment for them. Our thoughts are with them as they mourn this tragedy. I would ask that the media respect their privacy, and allow them time to come to terms with their loss.</p>\n<p>“Today marks yet another difficult day for Canada and for Canadians as we grieve as a nation for the loss of both John Ridsdel, who was killed on April 25, and Robert Hall.”</p></div>\n      "
}