{
  "path": "/en/news/news-releases/2018/07/18/prime-minister-announces-changes-ministry",
  "pageTitle": "Prime Minister announces changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the Ministry and welcomed new members to Cabinet.</p><p>The Government of Canada is focused on growing the economy, strengthening the middle class, and creating more opportunities for everyone. The new responsibilities of our team build on Canada’s strong economic foundations, further position our country for growth and success, and reflect changing realities in the global economy.</p><p>Canada is a trading nation whose economy relies on the hard work and innovation of its small businesses, entrepreneurs, and workers. The changes to the Ministry will place an even greater focus on diversifying international trade, supporting and growing small businesses, expanding tourism, promoting our exports, and improving trade within our own borders. Creating more jobs, opportunities, and prosperity for Canadians is the Government’s top priority.</p><p>The Government will build on its strong relationship with provinces, territories, and municipalities, working together to find solutions to pressing issues – from fighting climate change, to creating growth that benefits everyone, to breaking down barriers to interprovincial trade.</p><p>The Government will continue to maintain the integrity and security of our borders. We remain focused on effectively managing the arrival of irregular migrants, assessing asylum seekers, making our system more efficient, and preventing the flow of illegal drugs and firearms into our communities. The Government will further address gun violence and work to reduce organized crime to keep our communities safe and great places to live.</p><p>The changes to the Ministry are as follows:</p><ul class=\"sm-spacing\"><li><a href=\"/en/minister/honourable-dominic-leblanc\"><b>Dominic LeBlanc</b></a>, currently Minister of Fisheries, Oceans and the Canadian Coast Guard, becomes Minister of Intergovernmental and Northern Affairs and Internal Trade. Minister LeBlanc will also become President of the Queen’s Privy Council for Canada. He will focus on implementing national commitments and priorities that depend on strong relationships with other orders of government, creating more jobs, growing the economy, and improving interprovincial trade. In addition to co-leading the Atlantic Growth Strategy, he will also work to address the needs and priorities of Northerners, including devolution.</li><li><a href=\"/en/minister/honourable-james-gordon-carr\"><b>James Gordon Carr</b></a>, currently Minister of Natural Resources, becomes Minister of International Trade Diversification. Canada’s prosperity is tied to progressive trade and economic opportunities beyond our borders, and Minister Carr will work to help Canadian people and businesses compete and succeed around the world, and diversify our trading markets.</li><li><a href=\"/en/minister/honourable-melanie-joly\"><b>Mélanie Joly</b></a>, currently Minister of Canadian Heritage, becomes Minister of Tourism, Official Languages and La Francophonie. Minister Joly will work to increase tourism to and within Canada, and harness the full economic potential of this key sector of our economy. She will also ensure Canada’s strong and sustained engagement in the Organisation internationale de la Francophonie, while safeguarding and promoting our two official languages.</li><li><a href=\"/en/minister/honourable-amarjeet-sohi\"><b>Amarjeet Sohi</b></a>, currently Minister of Infrastructure and Communities, becomes Minister of Natural Resources. Minister Sohi will support Canada’s important resource industries and help them innovate to support long-term economic growth and export to new markets around the world. He will oversee important pipeline projects, including the completion of the Trans Mountain Expansion Project.</li><li><a href=\"/en/minister/honourable-carla-qualtrough\"><b>Carla Qualtrough</b></a>, currently Minister of Public Services and Procurement, becomes Minister of Public Services and Procurement and Accessibility. She will continue to work to ensure the Government of Canada’s services and procurement processes are modern and efficient, while taking on additional responsibilities focused on removing barriers that prevent Canadians from fully participating in our communities and workplaces.</li><li><a href=\"/en/minister/honourable-francois-philippe-champagne\"><b>François-Philippe Champagne</b></a>, currently Minister of International Trade, becomes Minister of Infrastructure and Communities. Minister Champagne will implement the Government of Canada’s historic plan to invest in infrastructure so that communities across the country have the tools they need to thrive, prosper, and innovate.</li><li><a href=\"/en/minister/honourable-pablo-rodriguez\"><b>Pablo Rodriguez</b></a>, currently Chief Government Whip, becomes Minister of Canadian Heritage and Multiculturalism. Minister Rodriguez will help ensure the vitality of Canadian arts, culture, and heritage, while promoting the diversity and inclusion that makes Canada stronger.</li><li><a href=\"/en/minister/honourable-bill-blair\"><b>Bill Blair</b></a>, currently Parliamentary Secretary to the Minister of Justice and Attorney General of Canada and to the Minister of Health, becomes Minister of Border Security and Organized Crime Reduction. He will work to ensure Canada’s borders are managed in a way that promotes legitimate travel and trade while keeping Canadians safe and treating everyone fairly and in accordance with our laws. He will play an important role in coordinating efforts to reduce gun violence and tackle organized crime. Minister Blair will also continue to lead the legalization and strict regulation of cannabis, and will be the minister responsible for irregular migration.</li><li><a href=\"/en/minister/honourable-mary-ng\"><b>Mary Ng</b></a> becomes Minister of Small Business and Export Promotion. She will help Canadian entrepreneurs and businesses grow, compete, and succeed, here in Canada and abroad. Minister&nbsp;Ng will also assume responsibility for the Business Development Bank of Canada.</li><li><a href=\"/en/minister/honourable-filomena-tassi\"><b>Filomena Tassi</b></a>, currently Deputy Government Whip, becomes Minister of Seniors. Minister Tassi will help the Government better understand the needs of Canadian seniors and ensure that programs and services are developed that respond to Canada's aging population. This will provide Canadian seniors and future retirees greater security and a better quality of life.</li><li><a href=\"/en/minister/honourable-jonathan-wilkinson\"><b>Jonathan Wilkinson</b></a>, currently Parliamentary Secretary to the Minister of Environment and Climate Change, becomes Minister of Fisheries, Oceans and the Canadian Coast Guard. Minister Wilkinson will work to protect and promote Canada’s oceans, coasts, waterways, and vital fisheries so they remain healthy for future generations, while providing important economic opportunities to people and coastal communities. Minister Wilkinson will work to implement the Government’s historic Oceans Protection Plan, and find new ways for our oceans and waterways to thrive.</li></ul><p>In addition to these changes, the following ministers will be named as follows:</p><ul class=\"sm-spacing\"><li><a href=\"/en/minister/honourable-carolyn-bennett\"><b>Carolyn Bennett</b></a> becomes Minister of Crown-Indigenous Relations. Minister&nbsp;Bennett will continue her important work to renew the nation-to-nation, Inuit-Crown and government-to-government relationship between Canada and Indigenous peoples.</li><li><a href=\"/en/minister/honourable-scott-brison\"><b>Scott Brison</b></a> becomes President of the Treasury Board and Minister of Digital Government. Minister Brison will continue his work to transform the Government’s digital services so they are designed for the people who actually use them and better serve Canadians.</li><li><a href=\"/en/minister/honourable-marie-claude-bibeau\"><b>Marie-Claude Bibeau</b></a> becomes Minister of International Development. Minister Bibeau will continue to position Canada as a leader in international development, while working to reduce poverty and inequality in the world, and advancing gender equality and empowering women and girls.</li><li><a href=\"/en/minister/honourable-kirsty-duncan\"><b>Kirsty Duncan</b></a><b>&nbsp;</b>becomes Minister of Science and Sport. Minister Duncan will continue to support Canada’s world-class science, research, and innovation ecosystem, while promoting Canadians’ health and well-being through sport and recreation.</li><li><a href=\"/en/minister/honourable-bardish-chagger\"><b>Bardish Chagger</b></a> becomes Leader of the Government in the House of Commons, a role in which she will continue to coordinate the Government’s day-to-day business in the House and manage its legislative agenda.</li></ul><h2>Related product</h2><ul><li><a href=\"/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li></ul></div>\n      "
}