{
  "path": "/en/news/news-releases/2018/05/18/prime-minister-concludes-visit-united-states",
  "pageTitle": "Prime Minister concludes visit to the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to the United States, which included stops in New York City and Boston.</p><p>During his visit, the Prime Minister met with several business leaders to underscore the importance of the Canada-U.S. partnership, promote Canada as one of the best places to invest, and create more jobs for Canada’s middle class.</p><p>In New York City, the Prime Minister addressed graduates at New York University’s 186th commencement ceremony. During his remarks, he encouraged graduates to embrace diversity, including diversity of opinion, and stressed that the leadership we need most today is leadership that brings people together. He also met with Canadian graduating students and was awarded an honourary Doctor of Laws degree.</p><p>At the Economic Club of New York, the Prime Minister participated in an armchair discussion and underscored how the Canada-U.S. partnership creates good, middle class jobs on both sides of the border, and that Canada is open for business and an outstanding place to invest.</p><p>In Boston, he took part in a roundtable discussion with members of the Canadian Technology Accelerator Boston-Cambridge, where research and innovation were at the forefront of discussions.</p><p>On the last day of his visit, the Prime Minister participated in the annual Solve at MIT meeting, an event that brings together hundreds of leaders and innovators from various fields, to explore groundbreaking solutions to global challenges. He then visited the MIT Media Lab and Innovation Exhibition for a first-hand account of the innovative research and technological advances that are defining the future.</p><h2>Quotes</h2><blockquote><p>\"Over the past few days, I have had the opportunity to meet with inspiring graduates and business leaders who are finding solutions to age-old problems and shaping our future in ways we couldn’t have imagined even five years ago. We talked about the importance of collaboration and how Canada and the United States can bring innovators together to create more opportunities for Canadians and Americans alike.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"Canada leads the G7 in economic growth, and has become a top destination for businesses to create jobs, invest, and grow. We will continue to make bold investments in innovation and skills training, and secure Canada’s place as a centre of global innovation, where the next generation of technologies and businesses thrive.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Prime Minister Trudeau last visited the United States in February 2018.</li><li>During the visit to New York City and Boston, the Prime Minister met with the senior corporate leadership of the following companies: Honeywell, AppNexus, PepsiCo, WeWork, Wayfair and Etsy.</li><li>Wayfair announced today that it will open its first Canadian warehouse, creating 200 jobs in Mississauga, Ontario.</li><li>Etsy announced on Thursday that it will open an artificial intelligence centre in Toronto, Ontario. This will be company’s third centre and first in Canada. The other two centres are located in San Francisco and at Etsy’s headquarters in Brooklyn.</li><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade in goods and services between the two countries was valued at more than $918&nbsp;billion in 2017, and Canada is the largest secure supplier of energy to the U.S.</li><li>Canada buys more goods from the United States than China, Japan, and the UK combined.</li><li>A total of 680,900 jobs in New York and 211,000 jobs in Massachusetts depend on Canada-U.S. trade and investment.</li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/news-releases/2018/04/27/prime-minister-travel-united-states\">Prime Minister to travel to the United States</a></li><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States relations</a></li></ul></div>\n      "
}