{
  "path": "/en/news/news-releases/2015/11/29/prime-minister-meets-first-time-president-francois-hollande",
  "pageTitle": "Prime Minister meets for the first time with President François Hollande | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, today had his first bilateral meeting with President François Hollande in Paris.</p>\n<p>During the meeting, the Prime Minister expressed his condolences and reiterated Canada’s solidarity with the people of France in the wake of the recent terrorist attacks. He restated the Government of Canada’s continuing commitment to coalition efforts to counter the Islamic State of Iraq and Syria and to making strong contributions to the fight against terrorism.</p>\n<p>The two leaders also discussed the warm and historic relationship the two countries enjoy and ways of deepening it, including through the implementation of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA). Pressing international issues, including the humanitarian and security situation in Iraq and Syria, the migration challenges facing Europe, and the situation in Ukraine, were also discussed.</p>\n<p>The Prime Minister welcomed France’s leadership in the Conference of the Parties (COP-21) process and underlined Canada’s solid commitment to fighting climate change with an effective and sustainable international agreement. The Prime Minister emphasized that&nbsp;Canada intends to work closely with its provinces, territories and international partners to reduce carbon emissions and grow a climate-resilient global economy.</p>\n<p><strong>Quotes</strong></p>\n<p>“Our hearts and prayers go out to our French cousins during this dark and terrible time. The recent terrorist attacks in Paris are not only an attack on the people of France – they are also an attack on our shared ideals. These crimes are an affront to our way of life and the fundamental values we share with our closest allies. Canadians continue to offer our help and support to the government and the people of France in this time of mourning.”</p>\n<p><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canada and France enjoy a close relationship, built on our shared history and strong cultural and economic ties that have fostered growth and cooperation. I look forward to working together with President Hollande to deepen our bilateral relationship. Together, we will focus on pressing international issues, including climate change, something for which the President has demonstrated real leadership.”</p>\n<p><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canada and France enjoy excellent and long-lasting bilateral relations based on shared history, culture, common values, and economic and military cooperation. For the past several years, collaboration between the two countries has continued to diversify and grow in importance at all levels.</li>\n<li>France has been a supporter of CETA, which will create new bilateral trade and investment opportunities between Canada and France.</li>\n<li>Once it enters into force, CETA will provide Canada with preferential market access to the largest and most lucrative integrated market in the world, a market of more than 500 million consumers that generates over $20 trillion in economic activity annually.</li>\n<li>The United Nations Framework Convention on Climate Change was adopted in 1992 at the Rio Earth Summit to coordinate international efforts to address climate change. Canada is one of 195 countries that are parties to this convention.</li>\n<li>COP 21 is the culmination of four years of international negotiations toward a new global climate change agreement, with the aim of keeping global warming below two degrees Celsius.</li>\n<li>Canada is committed to working closely with France, as the host of COP 21, and supports the active, inclusive agenda that brings both state and non-state actors together to accelerate cooperative climate change action.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union: Comprehensive Economic and Trade Agreement (CETA)</a></li>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://www.cop21paris.org/\">COP 21</a></li>\n<li><a href=\"http://unfccc.int/2860.php\">United Nations Framework Convention on Climate Change</a></li>\n</ul></div>\n      "
}