{
  "path": "/en/news/readouts/2022/03/17/prime-minister-justin-trudeau-speaks-president-kenya-uhuru-kenyatta",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Kenya Uhuru Kenyatta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Kenya, Uhuru Kenyatta.</p>\n\n<p>The Prime Minister denounced the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. He expressed his steadfast support for Ukraine and its people, and called for an immediate ceasefire and for the respect of international law. He thanked President Kenyatta for Kenya’s leadership at the United Nations and with African leaders in upholding the rules-based international system. Both leaders expressed their profound concerns about the unfolding humanitarian crisis, the human cost of Russia’s actions, and the impacts on food and energy security. They also discussed challenges faced by democracies and the importance of stepping up to defend democratic values. They expressed their firm commitment to multilateralism as a way to tackle these issues and promote peace and security.</p>\n\n<p>Prime Minister Trudeau thanked President Kenyatta for his leadership in hosting the recent United Nations Environment Assembly (UNEA-5.2) in Nairobi followed by a Special Session to celebrate the 50th anniversary of the United Nations Environment Programme (UNEP@50). Canada was represented by the Minister of Environment and Climate Change, Steven Guilbeault.</p>\n\n<p>Prime Minister Trudeau and President Kenyatta exchanged views on regional crises, including the ongoing conflict in northern Ethiopia. Prime Minister Trudeau expressed deep concern with the difficult humanitarian situation. He and President Kenyatta agreed on the need to continue supporting efforts to reach a peaceful resolution.</p>\n\n<p>The leaders reaffirmed their countries’ strong bilateral relationship, and committed to continue working together to advance shared priorities in the areas of trade, investment, climate action, and economic recovery from the COVID-19 pandemic.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_kenya.aspx?lang=eng\">Canada-Kenya Relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/environment-climate-change/news/2022/02/canada-supports-a-new-legally-binding-global-agreement-on-plastics-as-un-meeting-kicks-off-in-kenya.html\">Canada supports a new legally binding global agreement on plastics as UN meeting kicks off in Kenya</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2021/12/01/prime-minister-justin-trudeau-speaks-president-kenya-uhuru-kenyatta\">Prime Minister Justin Trudeau speaks with President of Kenya Uhuru Kenyatta</a></li>\n</ul></div>\n      "
}