{
  "path": "/en/news/news-releases/2017/11/29/prime-minister-announces-nomination-honourable-sheilah-l-martin",
  "pageTitle": "Prime Minister announces nomination of the Honourable Sheilah L. Martin to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of the Honourable Sheilah L. Martin to the Supreme Court of Canada.</p><p>First appointed as a judge in 2005, Justice Martin served on the Court of Queen’s Bench of Alberta in Calgary until June 2016 when she was appointed as a judge of the Courts of Appeal of Alberta, the Northwest Territories, and Nunavut. She has also served as a Deputy Judge for the Supreme Court of Yukon since 2009. Throughout her thirty-year career, she has maintained a strong focus on education, equality rights and increasing the number of under-represented groups in law schools and the legal profession, including Indigenous Peoples. For her service, Justice Martin has been recognized with many awards, including the Distinguished Service Award for Legal Scholarship, the Law Society of Alberta’s Certificate of Merit, and the YWCA’s Advancement of Women Award.</p><p>On December 4, 2017, the members of the House of Commons’ Standing Committee on Justice and Human Rights will participate in a special committee hearing during which the Minister of Justice and the Chair of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments (Advisory Board) will explain the selection process and the reasons Justice Martin was nominated.</p><p>As part of the government’s commitment to openness and transparency, members of the House’s Justice and Human Rights Committee and the Senate’s Legal and Constitutional Affairs Committee – as well as representatives of the Bloc Québécois and the Green Party – will be invited to take part in a questions and answers session with the nominee, which will be moderated by a law professor on December 5, 2017.</p><p>This nomination will fill the vacancy left following the retirement of Chief Justice Beverley McLachlin on December 15, 2017, and is the second nomination under the Government of Canada’s new Supreme Court selection process, which promotes greater openness, transparency, and accountability.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the nomination of Justice Sheilah L. Martin to the Supreme Court of Canada. I am confident that, with the wealth of experience she has gained over a distinguished thirty‑year career, she will be a valuable addition to the Supreme Court, an institution well respected in Canada and around the world for its strength, independence, and judicial excellence.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>During the selection process, a non-partisan Advisory Board identified suitable candidates. Once the Advisory Board compiled a shortlist of candidates, the Minister of Justice consulted:<ul><li>the Chief Justice of Canada;</li><li>applicable provincial and territorial attorneys general;</li><li>the Chairs of the House of Commons Standing Committee on Justice and Human Rights and the Senate Standing Committee on Legal and Constitutional Affairs; and</li><li>Opposition Justice critics.</li></ul></li><li>The selection process sought jurists of the highest caliber, who were functionally bilingual and representative of the diversity of this great country.</li><li>Any Canadian lawyer or judge who met the criteria could apply to the Supreme Court of Canada through the Office of the Commissioner for Federal Judicial Affairs.</li><li>The Prime Minister will announce the appointment of the next Chief Justice of Canada by mid-December 2017.</li></ul><h2>Related Products</h2><ul><li>Backgrounder:&nbsp;<a href=\"/en/news/backgrounders/2017/11/29/frequently-asked-questions-supreme-court-canada-appointment-process\">Frequently asked questions on the Supreme Court of Canada appointment process</a></li><li>Biographical Notes:&nbsp;<a href=\"/en/news/backgrounders/2017/11/29/honourable-sheilah-l-martin\">The Honourable Sheilah L. Martin</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/nominee-candidat-eng.html\">Candidate questionnaire filled out by Justice Sheilah L. Martin</a></li><li><a href=\"/en/news/news-releases/2017/07/14/prime-minister-opens-process-select-next-justice-supreme-court-canada\">Prime Minister opens the process to select the next justice of the Supreme Court of Canada</a></li><li><a href=\"/en/news/news-releases/2017/07/17/prime-minister-announces-advisory-board-select-next-supreme-court\">Prime Minister announces Advisory Board to select next Supreme Court Justice</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and Assessment Criteria for Supreme Court of Canada appointments</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/index-eng.html\">Supreme Court of Canada appointments process</a></li></ul></div>\n      "
}