{
  "path": "/en/news/statements/2021/10/11/statement-prime-minister-david-card-winning-nobel-prize-economic",
  "pageTitle": "Statement by the Prime Minister on David Card winning the Nobel Prize in Economic Sciences | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian economist Dr. David Card being awarded the 2021 Nobel Prize in Economic Sciences:</p>\n\n<p>“Today, I join Canadians and the international economic community in congratulating Dr. David Card on being awarded this year’s Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel, also known as the Nobel Prize in Economic Sciences, for his important contributions to labour economics.</p>\n\n<p>“Born in Guelph, Ontario, Dr. Card completed his undergraduate studies at Queen's University and obtained his PhD at Princeton University. He is currently a Professor of Economics at the University of California, Berkeley, where his research focuses on immigration, inequality, and gender and race in the labour market.</p>\n\n<p>“Dr. Card is being recognized for his pioneering work on minimum wages, immigration, and education, which have considerably improved our understanding of the labour market over the last few decades. His recent work studied the effects of increasing the minimum wage on employment and challenged conventional wisdom.</p>\n\n<p>“Dr. Card was awarded one half of the 2021 Nobel Prize in Economic Sciences, with the other half going jointly to Dr. Joshua D. Angrist and Dr. Guido W. Imbens. Together, they were recognized for using natural experiments to help answer key questions for society and revolutionizing research in economic sciences.</p>\n\n<p>“On behalf of all Canadians, I congratulate Dr. Card for this remarkable achievement, and thank him for helping us to better understand the economy, as we work to build a strong economic recovery that benefits everyone for a better future at home and around the world.”</p></div>\n      "
}