{
  "path": "/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and",
  "pageTitle": "Prime Minister announces new support for COVID-19 medical research and vaccine development | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>New information on COVID-19 emerges every day. Researchers and scientists in Canada and around the world are working hard to better understand the virus, and its impacts on people and communities. By keeping pace with this information, we can better protect the health of Canadians and set our country on the path to recovery.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced more than $1 billion in support of a national medical research strategy to fight COVID-19 that includes vaccine development, the production of treatments, and tracking of the virus. This new funding builds on the $275&nbsp;million investment for coronavirus research and medical countermeasures announced in March.</p>\n\n<p>The Government of Canada will invest in new medical countermeasures to better understand COVID-19, and develop the infrastructure needed to fight the virus here in Canada. This includes:</p>\n\n<ul>\n\t<li>The establishment of the COVID-19 Immunity Task Force that will operate under the direction of a leadership group, which will include Dr. David Naylor, Dr. Catherine Hankins, Dr. Tim Evans, Dr. Theresa Tam, and Dr. Mona Nemer. The task force will establish priorities and oversee the coordination of a series of country-wide blood test surveys that will tell us how widely the virus has spread in Canada and provide reliable estimates of potential immunity and vulnerabilities in Canadian populations.</li>\n\t<li>$40 million for the Canadian COVID-19 Genomics Network (CanCOGeN), led by Genome Canada, to coordinate a COVID-19 viral and host genome sequencing effort across Canada. This research will help track the virus, its different strains, and how it makes people sick in different ways, providing valuable information to public health authorities and decision-makers as they put in place measures to control the pandemic. The results of this work will be available to researchers globally to support additional research, including Canadian vaccine development efforts.</li>\n\t<li>$23 million for the Vaccine and Infectious Disease Organization-International Vaccine Centre (VIDO-InterVac) to accelerate development of a vaccine against COVID-19. This funding will support pre-clinical testing and clinical trials of a potential COVID-19 vaccine, essential steps to ensuring that vaccines are effective and safe for human use.</li>\n\t<li>$29 million for the National Research Council of Canada to begin the second phase of critical upgrades to its Human Health Therapeutics facility in Montréal. Building on ongoing work to ready the facility for the production of vaccines for clinical trials, this funding will support operations to maintain the facility, as well as provide infrastructure to prepare vials for individual doses as soon as a vaccine becomes available.</li>\n\t<li>$600 million, through the Strategic Innovation Fund, over two years to support COVID-19 vaccine and therapy clinical trials led by the private sector, and Canadian biomanufacturing opportunities.</li>\n\t<li>$10 million for a Canadian data monitoring initiative so we can coordinate and share pandemic-related data across the country to enhance Canada’s response to COVID-19.</li>\n\t<li>$10.3 million over two years, and $5 million ongoing, to support the Canadian Immunization Research Network in conducting vaccine-related research and clinical trials, and to enhance Canada’s capacity to monitor vaccine safety and effectiveness.</li>\n\t<li>$114.9 million through the Canadian Institutes of Health Research for research projects that will accelerate the development, testing, and implementation of medical and social countermeasures to mitigate the rapid spread of COVID-19, as well as its social and health impacts.</li>\n</ul>\n\n<p>Separately, the Government of Canada is providing over $675,000 through the Stem Cell Network to support two new research projects and one clinical trial. The clinical trial will evaluate the safety of a potential cell therapy to reduce the impacts and severity of acute respiratory distress associated with COVID-19, and the two projects will generate critical information about how cells in the airway and brain are affected by the virus.</p>\n\n<p>By supporting COVID-19 research, the critical work being done by our country’s scientists, and vaccination efforts, we will be able to better protect the health and safety of Canadians and vulnerable populations around the world.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since the beginning of the COVID-19 pandemic, we have been working closely with Canada’s health experts and researchers, who are some of the most skilled and brightest in the world. We are making sure that Canada remains at the forefront of scientific research to help us make smart and effective decisions on the path to recovery.” &nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The investment Canada is making now in research will result in our country being better equipped to plan for the coming months. Some of the best health experts and health researchers in Canada will help us implement the right next public health measures to respond to COVID-19. They will also help us put in place strategies to support essential workers – based on evidence and on what we know about who has been exposed – and plan for the use of a vaccine.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know that science is fundamental to beating COVID-19 and Canada is benefiting from the impressive and innovative power of Canadian researchers in our coordinated national approach to fight COVID-19. Together, we are rapidly scaling up our research capacity to harness genomic sequencing data to inform public health interventions and to advance a vaccine against COVID-19 to protect Canadians and end the crisis.”</p>\n\n<p>The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The COVID-19 Immunity Task Force will operate under the direction of a leadership group with a mandate to establish priorities and oversee the coordination of a series of serological surveys. An external, dedicated secretariat will help maximize the efficiency of the task force’s work, and ensure rapid reporting of results to governments and Canadians. The Government of Canada has worked with provinces and territories on the creation of this task force.</li>\n\t<li>The task force will provide data to decision-makers, including disaggregated data that will help us understand the impact of COVID-19 on vulnerable populations, while also leveraging new and existing lab capacity for research. The better we understand the virus, its spread, and its unique impact on different groups, the better we can fight it, and eventually defeat it.</li>\n\t<li>A serological test is a blood test. This test detects the presence of virus-specific antibodies in blood samples so that previous exposure to the COVID-19 virus can be detected.&nbsp;</li>\n\t<li>At least one million samples will be collected and tested over the next two years as we track the virus in the general population and in specific groups at greater risk of having been infected, including health care workers and the elderly. The leadership group will include:\n\t<ul>\n\t\t<li>Dr. David Naylor, co-chair, who is well known for his scientific leadership and influence in advancing healthcare innovation. From establishing successful institutions that fill gaps in evidence to his role as President of the University of Toronto, Dr. Naylor is a thought leader who continues to seek better outcomes for the health of Canadians;</li>\n\t\t<li>Dr. Catherine Hankins, co-chair, a Professor of Public and Population Health at McGill University. Dr. Hankins’ leadership role in developing good participatory practice guidelines for trials for HIV and emerging pathogens has influenced research design and conduct to ensure research benefits communities. Her leadership role as Chief Scientific Advisor to UNAIDS brings international public health experience in knowledge translation and networks to the task force</li>\n\t\t<li>Dr. Tim Evans, the Director of the School of Population and Global Health at McGill University. Dr. Evans will be the executive director of the task force and external secretariat. He brings strong international health experience through his former positions as Assistant Director General of the World Health Organization and Senior Director at the World Bank. His experience leading complex initiatives provides a foundation for his role as the task force lead.&nbsp;&nbsp;</li>\n\t\t<li>Dr. Theresa Tam, Canada’s Chief Public Health Officer. In addition to being the federal government’s lead health professional, Dr. Tam is a physician with expertise in immunization, infectious disease, emergency preparedness and global health security. She brings a wealth of leadership experience in Canada's response to public health emergencies including severe acute respiratory syndrome (SARS), pandemic influenza H1N1 and Ebola.</li>\n\t\t<li>Dr. Mona Nemer, the Chief Science Advisor to Canada’s Prime Minister, Minister of Science, and Cabinet. In her current role, Dr. Nemer regularly provides advice on issues related to science and government policies that support it. Before becoming the Chief Science Advisor, she was Professor and Vice-President of Research at the University of Ottawa and Director of the school’s Molecular Genetics and Cardiac Regeneration Laboratory.</li>\n\t</ul>\n\t</li>\n\t<li>The members of the leadership group will be appointed in the coming days and will be include leading scientists in the fields of virology, immunology, public health, and health care.</li>\n\t<li>On March 11, 2020, the Government of Canada <a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">announced a $1 billion package to help Canadians cope with the COVID-19 outbreak</a>, which included $275&nbsp;million for coronavirus research and medical countermeasures, and $50&nbsp;million to ensure adequate supplies of personal protective equipment. This was in addition to the <a href=\"https://www.canada.ca/en/institutes-health-research/news/2020/03/government-of-canada-invests-27m-in-coronavirus-research.html\">investment of $27 million to fund coronavirus research</a> announced on March 6, 2020.</li>\n\t<li>On March 23, 2020, as part of the $275 million for coronavirus research and medical countermeasures, the Government of Canada announced:\n\t<ul>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">$12 million for VIDO-InterVac</a> to develop a vaccine manufacturing facility to meet the good manufacturing practice (GMP) standards necessary for human vaccines. This complemented an $11 million investment by the Canada Foundation for Innovation to support VIDO-InterVac’s ongoing operating costs through to March 2023.</li>\n\t\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">$15 million for the National Research Council of Canada</a> to upgrade its Human Health Therapeutics facility for GMP compliance to develop, test, and scale up promising vaccine candidates to be ready for industrial production.</li>\n\t</ul>\n\t</li>\n\t<li>On April 2, 2020, <a href=\"https://www.genomecanada.ca/en/news/genome-canada-launches-additional-rapid-response-funding-covid-19-research\">Genome Canada launched additional rapid response funding</a> for COVID-19 research in the six regional Genome Centres across the country. That $1.5 million in funding aims to leverage other funding and support genomics-informed solutions to COVID-19 at local, provincial and national levels through collaborations between academia, industry, not-for-profit and public sectors.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n</ul></div>\n      "
}