{
  "path": "/en/news/news-releases/2021/10/26/prime-minister-welcomes-new-cabinet",
  "pageTitle": "Prime Minister welcomes new Cabinet | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the members of Cabinet following this fall’s election, when Canadians chose to keep Canada moving forward. This diverse team will continue to find real solutions to the challenges that Canadians face, and deliver on a progressive agenda, as we finish the fight against COVID-19 and build a better future for everyone.</p>\n\n<p>The past year and a half has been difficult for Canadians. We have all made sacrifices to keep each other and our communities safe from COVID-19, and the Government of Canada has had people’s backs every step of the way. As we continue to take strong action to beat the pandemic and get the job done on the vaccine rollout, the government will keep putting Canadians first and delivering on their priorities. We will create new jobs and grow the middle class, put home ownership back in reach for Canadians, accelerate our fight against climate change, deliver on $10-a-day child care, and walk the shared path of reconciliation. Together, we will continue to move Canada forward for everyone.</p>\n\n<p>The new Cabinet is appointed as follows:</p>\n\n<ul>\n\t<li><strong>Chrystia Freeland </strong>remains Deputy Prime Minister and Minister of Finance</li>\n\t<li><strong>Omar Alghabra</strong> remains Minister of Transport</li>\n\t<li><strong>Anita Anand </strong>becomes Minister of National Defence</li>\n\t<li><strong>Carolyn Bennett</strong> becomes Minister of Mental Health and Addictions and Associate Minister of Health</li>\n\t<li><strong>Marie-Claude Bibeau </strong>remains Minister of Agriculture and Agri-Food</li>\n\t<li><strong>Bill Blair </strong>becomes President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness</li>\n\t<li><strong>Randy Boissonnault</strong> becomes Minister of Tourism and Associate Minister of Finance</li>\n\t<li><strong>François-Philippe Champagne</strong> remains Minister of Innovation, Science and Industry</li>\n\t<li><strong>Jean-Yves Duclos</strong> becomes Minister of Health</li>\n\t<li><strong>Mona Fortier</strong> becomes President of the Treasury Board</li>\n\t<li><strong>Sean Fraser </strong>becomes Minister of Immigration, Refugees and Citizenship</li>\n\t<li><strong>Karina Gould </strong>becomes Minister of Families, Children and Social Development</li>\n\t<li><strong>Steven Guilbeault</strong> becomes Minister of Environment and Climate Change</li>\n\t<li><strong>Patty Hajdu</strong> becomes Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario</li>\n\t<li><strong>Mark Holland</strong> becomes Leader of the Government in the House of Commons</li>\n\t<li><strong>Ahmed Hussen</strong> becomes Minister of Housing and Diversity and Inclusion</li>\n\t<li><strong>Gudie Hutchings</strong> becomes Minister of Rural Economic Development</li>\n\t<li><strong>Marci Ien</strong> becomes Minister for Women and Gender Equality and Youth</li>\n\t<li><strong>Helena Jaczek</strong> becomes Minister responsible for the Federal Economic Development Agency for Southern Ontario</li>\n\t<li><strong>Mélanie Joly</strong> becomes Minister of Foreign Affairs</li>\n\t<li><strong>Kamal Khera</strong> becomes Minister of Seniors</li>\n\t<li><strong>David Lametti</strong> remains Minister of Justice and Attorney General of Canada</li>\n\t<li><strong>Dominic LeBlanc</strong> becomes Minister of Intergovernmental Affairs, Infrastructure and Communities</li>\n\t<li><strong>Diane Lebouthillier</strong> remains Minister of National Revenue</li>\n\t<li><strong>Lawrence MacAulay</strong> remains Minister of Veterans Affairs and Associate Minister of National Defence</li>\n\t<li><strong>Marco E. L. Mendicino </strong>becomes Minister of Public Safety</li>\n\t<li><strong>Marc Miller </strong>becomes Minister of Crown-Indigenous Relations</li>\n\t<li><strong>Joyce Murray </strong>becomes Minister of Fisheries, Oceans and the Canadian Coast Guard</li>\n\t<li><strong>Mary Ng</strong> becomes Minister of International Trade, Export Promotion, Small Business and Economic Development</li>\n\t<li><strong>Seamus O’Regan Jr. </strong>becomes Minister of Labour</li>\n\t<li><strong>Ginette Petitpas Taylor </strong>becomes Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency</li>\n\t<li><strong>Carla Qualtrough</strong> remains Minister of Employment, Workforce Development and Disability Inclusion</li>\n\t<li><strong>Pablo Rodriguez</strong> becomes Minister of Canadian Heritage and remains Quebec Lieutenant<strong> </strong></li>\n\t<li><strong>Harjit S. Sajjan </strong>becomes Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada</li>\n\t<li><strong>Pascale St-Onge</strong> becomes Minister of Sport and Minister responsible for the Economic Development Agency of Canada for the Regions of Quebec</li>\n\t<li><strong>Filomena Tassi</strong> becomes Minister of Public Services and Procurement</li>\n\t<li><strong>Dan Vandal</strong> becomes Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada, and Minister responsible for the Canadian Northern Economic Development Agency</li>\n\t<li><strong>Jonathan Wilkinson </strong>becomes Minister of Natural Resources</li>\n</ul>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians need a strong and diverse Cabinet to deliver on their priorities and keep Canada moving forward for everyone. This team will finish the fight against COVID‑19, deliver on $10-a-day child care, help Canadians find a home of their own, tackle the climate crisis, and continue to advance reconciliation with Indigenous peoples. Together, we will work tirelessly to build a better future for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new Cabinet consists of the Prime Minister and 38 ministers. In keeping with the precedent set in 2015, there is an equal number of women and men.</li>\n\t<li>The Government of Canada will provide support to the new portfolios as follows:\n\t<ul>\n\t\t<li>The Minister of Intergovernmental Affairs, Infrastructure and Communities will be supported by the Privy Council Office and Infrastructure Canada.</li>\n\t\t<li>The Minister for Women, Gender Equality and Youth will be supported by Women and Gender Equality Canada, with additional support from Canadian Heritage and Employment and Social Development Canada.</li>\n\t\t<li>The President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness will be supported by the Privy Council Office and Public Safety Canada.</li>\n\t\t<li>The Minister of International Trade, Export Promotion, Small Business and Economic Development will be supported by Global Affairs Canada, with additional support from Innovation, Science and Economic Development Canada.</li>\n\t\t<li>The Minister of Housing and Diversity and Inclusion will be supported by Canadian Heritage, Women and Gender Equality Canada, and Infrastructure Canada.</li>\n\t\t<li>The Minister of Rural Economic Development will be supported by Innovation, Science and Economic Development Canada.</li>\n\t\t<li>The Minister of Tourism and Associate Minister of Finance will be supported by the Department of Finance Canada with additional support from Innovation, Science and Economic Development Canada.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet\">Cabinet</a></li>\n</ul></div>\n      "
}