{
  "path": "/en/news/statements/2022/09/04/statement-prime-minister-attacks-saskatchewan",
  "pageTitle": "Statement by the Prime Minister on the attacks in Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>These events are far reaching and deeply impactful. If you need someone to talk to, the Hope for Wellness Helpline offers support to all Indigenous Peoples. Counsellors are available by phone or online chat. This service is available in English and French, and, upon request, in Cree, Ojibway, and Inuktitut. Call the toll-free Help Line at 1-855-242-3310 or connect to the online chat at&nbsp;</em><a href=\"http://www.hopeforwellness.ca/\"><em>www.hopeforwellness.ca</em></a><em>.</em></p>\n\n<p>The Prime Minister, Justin Trudeau, today issued the following statement on the attacks in Saskatchewan:</p>\n\n<p>“I am shocked and devastated by the horrific attacks today in James Smith Cree Nation and Weldon, Saskatchewan, that claimed the lives of 10 people and injured many more.</p>\n\n<p>“As Canadians, we mourn with everyone affected by this tragic violence, and with the people of Saskatchewan. We also wish a full and quick recovery to those injured.</p>\n\n<p>“As this is an unfolding situation, I encourage everyone in the area to listen to the advice of law enforcement to take shelter and follow the proper precautions. If you have any information or tips for the police, please call 9-1-1. The RCMP in Saskatchewan are posting all their latest updates on their <a href=\"https://www.rcmp-grc.gc.ca/en/news/2022/update-2-dangerous-person-alert-issued-melfort-rcmp\">website</a>.</p>\n\n<p>“I thank the first responders for their hard work to apprehend the suspects, protect people, and treat the injured. The Government of Canada has been in direct communication with the James Smith Cree Nation community leadership and we are ready to assist in any way we can. Those responsible for today’s abhorrent attacks must be fully brought to justice.</p>\n\n<p>“To James Smith Cree Nation and the people of Saskatchewan: You are in our thoughts. We are here to support you during this difficult time.”</p></div>\n      "
}