{
  "path": "/en/news/news-releases/2018/06/07/prime-minister-releases-report-common-challenges-faced-g7-countries",
  "pageTitle": "Prime Minister releases report on common challenges faced by G7 countries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>All G7 countries face a common challenge that goes to the heart of how citizens measure progress in their daily lives – namely, whether the benefits of economic growth are fairly shared.</p><p>As G7 President, Canada is seized with this economic problem, and has set the goal of achieving growth that works for everyone at the centre of this year’s G7 agenda.</p><p>The Prime Minister, Justin Trudeau, today released a short report – <a href=\"https://g7.gc.ca/en/official-documents/achieving-growth-works-everyone/\"><i>Achieving Growth that Works for Everyone </i></a>– to highlight this common challenge and identify ways we can work together to address it. Canada believes the best path forward is to focus on the following priorities:</p><ul><li>Helping workers adapt to the changing world of work;</li><li>Delivering strong growth by investing in people;</li><li>Building strong communities and economies;</li><li>Ensuring that everyone pays their fair share by tackling international tax avoidance and evasion; and,</li><li>Better measuring growth that works for everyone.</li></ul><p>No one country has all the answers, and no one country can solve these challenges alone. By sharing ideas and working together, we can make meaningful progress.</p><p>These challenges will play a central role in G7 leaders’ discussions – discussions which must continue beyond Charlevoix as we work together to create economic growth that benefits everyone, and leave our citizens with a better, more hopeful future.</p><h2>Quote</h2><blockquote><p>“In Charlevoix, we will focus on fighting inequality and creating growth that works for everyone. If we meet these challenges head-on, I am confident we can strengthen the middle class and offer real help to people working hard to join it.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote></div>\n      "
}