{
  "path": "/en/news/readouts/2020/06/24/prime-minister-justin-trudeau-speaks-president-egypt-abdel-fattah-el-sisi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Egypt Abdel Fattah el-Sisi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Egypt, Abdel Fattah el-Sisi.</p>\n\n<p>The Prime Minister and the President discussed COVID-19 and its health, social, and economic impacts. They noted the importance of international collaboration to ensure a successful recovery from COVID-19 and to address the longer term issues arising from the pandemic. President el-Sisi thanked the Prime Minister for the help Canada provided to Egypt in its efforts to repatriate Egyptian citizens stranded in Canada.&nbsp;</p>\n\n<p>President el-Sisi recalled his meeting with the Prime Minister on the margins of the African Union Summit in February, and discussed ways to strengthen cultural, social and economic ties between Canada and Egypt.&nbsp; The two leaders also discussed bilateral consular issues and efforts towards their positive resolution.</p>\n\n<p>Both leaders looked forward to continuing to strengthen the Canada–Egypt relationship, building on enduring people-to-people ties and growing commercial links in areas like higher education and advanced transportation infrastructure for Egypt’s New Administrative Capital. The two leaders welcomed the steps taken to deepen cooperation between the two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/egypt-egypte/relations.aspx?lang=eng\">Canada-Egypt relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}