{
  "path": "/en/news/news-releases/2017/06/28/governments-canada-ontario-and-toronto-announce-funding-protect-and",
  "pageTitle": "Governments of Canada, Ontario and Toronto announce funding to protect and transform Toronto’s Port Lands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The governments of Canada, Ontario and Toronto are committed to protecting our communities and Canadians from the risks associated with climate change. Investing in projects like the Toronto Port Lands Flood Protection Project not only supports climate resilience – it also supports economic growth, spurs innovation, and creates good, well-paying jobs for the middle class.</p><p>Today, the Prime Minister, Justin Trudeau, the Premier of Ontario, Kathleen Wynne, and Mayor of the City of Toronto, John Tory, joined Waterfront Toronto CEO Will Fleissig to announce joint funding of $1.185 billion for Waterfront Toronto. The Government of Canada will contribute up to $384 million to this project, and the Government of Ontario and the City of Toronto will each contribute over $400 million.</p><p>These investments will help protect Toronto’s Port Lands from flooding and lay the groundwork to transform the underused industrial area into a vibrant and resilient downtown neighbourhood.</p><p>In the last decade, global warming has resulted in increased flooding in urban areas. The Project will provide critical flood protection through the creation of a naturalized mouth for the Don River. It will also help clean up contaminated soil, unlock land ripe for development, and establish new aquatic habitats and wetlands that support native species.</p><p>These efforts will help support the long-term transformation of the Port Lands into beautiful new mixed-use communities with residential and commercial development – including affordable housing – surrounded by parks and green space.</p><p>These investments will help safeguard the health and well-being of residents, and increase the resiliency of nearby communities and their capacity to adapt to the impacts of climate change.</p><h2>Quotes</h2><blockquote><p>“Canada’s waterfronts are a resource to be enjoyed by all Canadians, today and tomorrow. This project will help residents of Canada’s largest city adapt to the impacts of a changing climate while spurring local economic growth. With local and provincial partners, we are taking action today to protect our environment and leave a cleaner, more prosperous economy for generations to come.”<br>— <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Government of Canada recognizes that remediation and flood protection infrastructure is essential to creating better, more resilient and sustainable communities and a safe and healthy environment. We are working with our partners to make sure they have the support they need to build these communities. It’s through initiatives like the Port Lands Flood Protection project that we will build the Canada of the 21st century and ensure a high quality of life for generations to come.”<br>— <cite>The Honourable Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><blockquote><p>“This is a major milestone in the revitalization of an important piece of Ontario’s waterfront and we are pleased that all three levels of government are coming together to move forward with this work. Using a model proven successful in other waterfront communities, we are on our way to building a new neighbourhood that will be a vibrant place to live – a hub for good jobs and economic growth, and a mixed-use community that can be accessed and enjoyed by all. I am thrilled that we're unlocking the incredible potential of these lands for people in Toronto and across Ontario.”<br>— <cite>The Honourable Kathleen Wynne, Premier of Ontario</cite></p></blockquote><blockquote><p>“Port Lands Flood Protection is a key Council priority and part of the City’s vision for a vibrant, clean Toronto waterfront. The major investment that all three orders of government are announcing today will unlock the potential of underutilized waterfront lands, protect the area from flooding and support Toronto’s long-term growth by creating new parks, natural areas, and mixed-use neighbourhoods – new places to live, work and play. Toronto is unique among North American cities to have such an asset on the doorstep of its downtown.”<br>— <cite>John Tory, Mayor of the City of Toronto</cite></p></blockquote><h2>Quick facts</h2><ul><li>The Port Lands Flood Protection project will take approximately seven years to complete and will be delivered by Waterfront Toronto, a public development corporation, established in 2001 by the federal, provincial and municipal governments to lead the revitalization of Toronto’s waterfront.</li><li>On September 14, 2016, the governments of Canada and Ontario and the City of Toronto announced $65 million in infrastructure funding under the Clean Water and Wastewater Fund for the Cherry Street Storm Water and Lakefilling project. This amount is included in total $1.25 billion costs for the Port Lands Flood Protection project.</li><li>Over the next 12 years, the Government of Canada will provide more than $180 billion in funding for public transit, green infrastructure, social infrastructure, transportation that supports trade, and rural and northern community infrastructure. This includes $21.9 billion proposed in Budget 2017 for green infrastructure, $5 billion of which will be available for investment through the Canada Infrastructure Bank.</li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/06/28/investment-protect-and-transform-toronto’s-port-lands\">Investment to protect and transform Toronto’s Port Lands</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-02-en.html\">Government of Canada’s $180-billion+ infrastructure plan in Budget 2017</a></li><li><a href=\"http://www.infrastructure.gc.ca/twri-irrt-eng.html\">Infrastructure Canada and the Toronto Waterfront Revitalization Initiative</a></li><li><a href=\"https://www.ontario.ca/page/buildon-2017-infrastructure-update\">Build ON 2017 Infrastructure Update</a></li><li><a href=\"http://www.waterfrontoronto.ca/nbe/portal/waterfront/Home\">Waterfront Toronto</a></li><li><a href=\"http://www.waterfrontoronto.ca/nbe/portal/waterfront/Home/waterfronthome/projects/don+mouth+naturalization+and+port+lands+flood+protection\">Waterfront Toronto – Port Lands Flood Protection</a></li></ul></div>\n      "
}