{
  "path": "/en/news/news-releases/2020/01/24/prime-minister-announces-new-government-representative-senate",
  "pageTitle": "The Prime Minister announces new Government Representative in the Senate | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Marc Gold as Government Representative in the Senate.</p>\n\n<p>Senator Gold is an accomplished lawyer, legal scholar, and community leader. Early in his career, he trained federally appointed judges on constitutional law and the <em>Canadian Charter of Rights and Freedoms</em>. Prior to his appointment to the Senate, he also served in local, national, and international leadership roles in the Jewish community, including as Chair of the Jewish Federations of Canada.</p>\n\n<p>Senator Gold replaces the Honourable Peter Harder, who stepped down from the role after leading Senate modernization efforts during the 42nd Parliament. Senator Gold will continue these efforts, and work with other Parliamentarians to advance the government’s legislative agenda in the Senate, including making life more affordable for Canadians, protecting the environment, keeping communities safe, and moving forward on reconciliation with Indigenous peoples.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Senator Gold’s long record of personal and professional achievement, together with his commitment to promoting human rights and Canada’s regional diversity, will help us find common ground in the Senate as we invest in and protect our communities, create good middle class jobs, and fight climate change. I look forward to working with him to build a better Canada for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Senator Gold was appointed to the Senate on November 25, 2016, under the merit-based selection process. He represents Quebec, and is a member of the Independent Senators Group.</li>\n\t<li>In addition to serving as the Government Representative in the Senate, the Prime Minister will recommend that Senator Gold be sworn in as a Privy Councillor.</li>\n\t<li>The Government Representative in the Senate is the first point of contact between the Government and the Senate, working to move government bills through the Upper House and champion renewal of the institution.</li>\n\t<li>The Government Representative in the Senate is an ex officio member of all committees except for the Standing Committee on Ethics and Conflict of Interest for Senators and the joint committees.</li>\n\t<li>In 2016, the selection process for Senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/01/23/marc-gold\">Biographical notes</a></li>\n</ul></div>\n      "
}