{
  "path": "/en/news/readouts/2020/03/19/prime-minister-justin-trudeau-speaks-ontario-premier-doug-ford",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with Ontario Premier Doug Ford to discuss the evolution of COVID-19.</p>\n\n<p>The two leaders reaffirmed their commitment to continued collaboration and coordination between their respective governments to respond to COVID-19. They discussed the measures announced yesterday by the Government of Canada to support workers and businesses through Canada’s COVID-19 Economic Response Plan. They also talked about the joint actions taken by the Government of Canada and the U.S. administration to close the border to non-essential travelers, while continuing to ensure the flow of people and goods and keeping the supply chain intact. They highlighted the need to ensure the safety of remote and Indigenous communities.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of Ontarians and all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/13/first-ministers-discuss-collective-efforts-address-impact-covid-19\">First Ministers discuss collective efforts to address the impact of COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul></div>\n      "
}