{
  "path": "/en/news/news-releases/2019/08/12/increased-legal-support-help-reduce-delays-asylum-claims",
  "pageTitle": "Increased legal support to help reduce delays for asylum claims | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every year, thousands of people are driven from their homes because of war, insecurity, and persecution. Many seek refuge in Canada, a place where they can live in peace and build a better future for themselves and their families. Before they can do that, they have to navigate a legal process to determine their status in Canada. As asylum claims increase, we need to make sure our legal system can keep pace with the increased demand.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the federal government will provide a one-time investment of $26.8 million for immigration and refugee legal aid for 2019-2020. In Ontario, this funding is crucial at a time when provincial cuts have jeopardized these vital services. This investment will bring participating provinces up to 100 per cent funding for this year as we work on the long-term sustainability of legal aid. It will also help address an increase in asylum claims, so that claims for refugee protection continue to be determined fairly, efficiently, and in accordance with the law.</p>\n\n<p>How we treat the most vulnerable among us defines who we are. The Government of Canada takes access to justice seriously, and is working to help reduce uncertainty so that those seeking asylum can focus instead on rebuilding their lives and raising their families.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“People seeking asylum in Canada often rely on legal aid to make sure their claims are processed fairly and efficiently. But in Ontario, provincial cuts have thrown these vital services into jeopardy. With today’s announcement, the federal government is stepping in. We’re standing up for people in Ontario, and making sure those seeking asylum have access to the legal services they need.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada contributes to legal aid for immigration and refugee matters and criminal cases across the country.</li>\n\t<li>Today’s announcement includes a one-time investment of $26.8 million for immigration and refugee legal aid services in Ontario ($25.7 million), British Columbia ($1.16 million), and Manitoba ($0.02 million).</li>\n\t<li>In Budget 2019, we invested $49.6 million over three years for immigration and refugee legal aid.</li>\n\t<li>Individuals can make an asylum claim in Canada at a port of entry, at a Canada Border Services Agency inland office, or an Immigration, Refugees and Citizenship Canada inland office. Canada Border Services Agency or Immigration, Refugees and Citizenship Canada officials then determine if an individual is eligible to make an asylum claim in Canada.</li>\n\t<li>Once an individual has been determined to be eligible to make a claim in Canada, they may have access to social assistance, education, health services, emergency housing and legal aid while a decision is pending on their claim.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/refugees/canada-role.html\">How Canada’s refugee system works</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/refugees/asylum-claims/asylum-claims-2019.html\">Key Figures on Asylum Claims</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}