{
  "path": "/en/news/statements/2022/07/08/statement-prime-minister-eid-al-adha",
  "pageTitle": "Statement by the Prime Minister on Eid al-Adha | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Eid al-Adha:</p>\n\n<p>“Today, Muslims in Canada and around the world mark the end of the annual Hajj (pilgrimage) to Mecca, one of the five pillars of Islam, and celebrate Eid al-Adha.</p>\n\n<p>“Eid al-Adha, also known as the Feast of Sacrifice, is symbolic of the lessons of sacrifice, devotion, and willingness as told by the story of Prophet Ibrahim. As one of the most important holidays in Islam, every year, Muslims celebrate by gathering with family and loved ones to pray, showing gratitude for life’s blessings, sharing festive meals, and providing food to those in need.</p>\n\n<p>“The holiday is also an important time to reflect on the values of compassion, charity, and community service – values we hold dear as Canadians. Muslims across Canada have always embodied these values. From coast to coast to coast, they help the most vulnerable, volunteer with local organizations in our communities, and care for neighbours and newcomers. Today, we also take the time to recognize the invaluable contributions Canadian Muslims have made, and continue to make, to our country.</p>\n\n<p>“Today and every day, we recommit ourselves to building a better Canada where everyone can feel welcome, safe, and respected. There is no place for discrimination in any form in our country. That is why the Government of Canada will continue to fight Islamophobia, including by appointing the country’s first Special Representative on Combatting Islamophobia.</p>\n\n<p>“On behalf of our family, Sophie and I wish all those celebrating a blissful Eid al-Adha.</p>\n\n<p>\"!عيد مبارك</p>\n\n<p>“Eid Mubarak!”</p></div>\n      "
}