{
  "path": "/en/news/news-releases/2022/06/27/prime-minister-announces-additional-sanctions-support-ukraine",
  "pageTitle": "Prime Minister announces additional sanctions in support of Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is committed to standing in unity to support the government and people of Ukraine in their fight for a peaceful, prosperous, and democratic future. We will continue to stand shoulder-to-shoulder with Ukraine as it seeks to defend itself from Russian aggression.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canada will be imposing additional sanctions under the <em>Special Economic Measures (Russia) Regulations, Special Economic Measures (Belarus) Regulations,</em> and the <em>Special Economic Measures (Ukraine) Regulations.</em> These new actions, which build on the Government of Canada’s already extensive sanctions regime, include:</p>\n\n<ul>\n\t<li>Imposing restrictions on six individuals and 46 entities linked to the Russian defence sectors,</li>\n\t<li>Sanctioning 15 Ukrainian individuals supporting the Russian occupation of Ukraine, and</li>\n\t<li>Sanctioning 13 government and defence individuals and two entities in Belarus.</li>\n</ul>\n\n<p>The Prime Minister also announced Canada’s intention to introduce sanctions against state-sponsored disinformation and propaganda agents and entities controlled by senior Russian government officials, to counter the Kremlin’s disinformation, which it has used to attempt to excuse its unjustifiable and unprovoked war in Ukraine</p>\n\n<p>Canada will also take additional and immediate measures to ban the export of certain advanced technologies that could improve Russia’s domestic defence manufacturing capability, including quantum computers and advanced manufacturing equipment, associated components, materials, software, and technology.</p>\n\n<p>Canada has also banned the export of advanced technologies and goods that could be used in the manufacturing of weapons to Belarus, as well as the import and export of a broad range of luxury goods between Canada and Belarus.</p>\n\n<p>Finally, in coordination with the United States, United Kingdom, and Japan, the Prime Minister announced Canada’s intent to impose a ban on the import of certain gold goods from Russia, shutting the commodity out of formal international markets and further isolating Russia from the international financial system.&nbsp;&nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada is unwavering in the belief that Ukrainians deserve to live in peace.&nbsp; Vladimir Putin and his regime have caused untold pain and suffering in Ukraine and across the world. Together, with our G7 counterparts, Canada is stepping up our continuous and coordinated pressure to bring about the end of Vladimir Putin’s war of choice.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s illegal occupation and attempted annexation of Crimea in 2014, Canada has imposed sanctions on more than 1,500 individuals and entities. Many of these sanctions have been undertaken in coordination with Canada’s allies and partners.</li>\n\t<li>Since Russia’s further invasion of Ukraine on February 24, 2022, Canada has imposed sanctions on more than 1,070 individuals and entities from and in Russia, Ukraine and Belarus.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/belarus.aspx?lang=eng\">Canadian Sanctions Related to Belarus</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/ukraine.aspx?lang=eng\">Canadian Sanctions Related to Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}