{
  "path": "/en/news/news-releases/2021/12/03/prime-minister-announces-changes-cabinet-committees",
  "pageTitle": "Prime Minister announces changes to Cabinet committees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the structure and mandate of Cabinet committees to reflect recent changes to the Ministry. The changes reflect the Government of Canada’s priorities, including finishing the fight against COVID-19, creating jobs and growing the middle class, walking the shared path of reconciliation, putting home ownership back in reach for everyone, and tackling climate change.</p>\n\n<p>The new list of Cabinet committees is as follows:</p>\n\n<ul>\n\t<li>Cabinet Committee on Agenda, Results and Communications</li>\n\t<li>Cabinet Committee on Canada and the World</li>\n\t<li>Cabinet Committee on Economy, Inclusion and Climate “A”</li>\n\t<li>Cabinet Committee on Economy, Inclusion and Climate “B”</li>\n\t<li>Cabinet Committee on Operations</li>\n\t<li>Cabinet Committee on Reconciliation</li>\n\t<li>Cabinet Committee on Safety, Security and Emergencies</li>\n\t<li>Treasury Board</li>\n</ul>\n\n<p>There will also be sub-committees on Intergovernmental Coordination, Litigation Management and on the federal response to the Coronavirus disease (COVID-19).</p>\n\n<p>The Incident Response Group will also continue to be convened, as needed, to respond to immediate crises.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Government of Canada has an ambitious, progressive plan to finish the fight against COVID-19, create jobs and middle class growth, tackle climate change, walk the shared path of reconciliation, and put housing back in reach for Canadians. The changes to Cabinet committees will help us move forward on these priorities and build a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Cabinet consists of the Prime Minister and 38 ministers. Cabinet committees carry out most of the day-to-day work of the Cabinet. Committees have their own members and areas of responsibility, which are set by the Prime Minister. The Treasury Board is the exception, as its mandate and membership are established in law.</li>\n\t<li>Cabinet is the central decision-making forum in government, and the only committee that brings all Ministers together. It is essential that it operates effectively to support the implementation of the government’s agenda and priorities.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet\">Cabinet</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet-committee-mandate-and-membership\">Cabinet Committee Mandate and Membership</a></li>\n</ul></div>\n      "
}