{
  "path": "/en/news/readouts/2022/05/26/prime-minister-justin-trudeau-speaks-president-united-arab-emirates-his",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the United Arab Emirates His Highness Sheikh Mohamed bin Zayed Al Nahyan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United Arab Emirates (UAE) and Ruler of Abu Dhabi, His Highness Sheikh Mohamed bin Zayed Al Nahyan.</p>\n\n<p>Prime Minister Trudeau expressed his deepest condolences on the passing of the former United Arab Emirates President and Ruler of Abu Dhabi, His Highness Sheikh Khalifa bin Zayed Al Nahyan. He noted the profound legacy Sheikh Khalifa left behind for the people of the UAE and his influence on the world.</p>\n\n<p>Prime Minister Trudeau recognized the strong leadership of Sheik Mohamed in the past and congratulated him on becoming the President of the United Arab Emirates and Ruler of Abu Dhabi. The Prime Minister and the President affirmed their commitment to deepening the strategic partnership between Canada and the United Arab Emirates.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/uae-eau/relations.aspx?lang=eng\">Canada-United Arab Emirates relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/16/statement-prime-minister-election-his-highness-sheikh-mohamed-bin-zayed\">Statement by the Prime Minister on the election of His Highness Sheikh Mohamed bin Zayed Al Nahyan as President of the United Arab Emirates</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/05/prime-minister-justin-trudeau-speaks-crown-prince-abu-dhabi-his-highness\">Prime Minister Justin Trudeau speaks with Crown Prince of Abu Dhabi His Highness Sheikh Mohamed bin Zayed Al Nahyan</a></li>\n\t<li><a href=\"https://www.gg.ca/en/media/news/2022/governor-general-ends-successful-visit-middle-east\">Governor General ends successful visit to the Middle East</a></li>\n</ul></div>\n      "
}