{
  "path": "/en/news/statements/2017/11/13/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Global Entrepreneurship Week, which runs from November 13 to 19, 2017:</p><p>“This week, we celebrate <a href=\"https://genglobal.org/gew\">Global Entrepreneurship Week</a>, a time for entrepreneurs, innovators, investors, and collaborators from around the world to connect, share ideas, and get inspired.</p><p>“Entrepreneurs grow our economy, build a strong middle class, and create good, well-paying jobs for people across Canada and around the world. On Global Entrepreneurship Week, we celebrate their creativity, hard work, and vital contributions to our communities and economy. Canada’s innovators are people of every gender, age, and background. They drive progress and prosperity in every sector and industry, and shape a better future for all of us.</p><p>“The Government is working hard to help Canadian entrepreneurs turn their ideas into thriving businesses and create good jobs. We know that a skilled and entrepreneurial workforce is critical to drive economic growth in Canada. With Budget 2017, we made important investments in innovation, young entrepreneurs, and skills training to help both workers and businesses succeed in a changing economy.</p><p>“Last month, we announced that we intend to lower the small business tax rate to ten per cent in 2018 and to nine per cent in 2019. These tax cuts will help small business owners keep more of their hard-earned money to invest back into their businesses, their employees, and their communities. With our plan to promote a creative Canada, we are also making important investments to support Canada’s cultural entrepreneurs – and our progressive trade agreements are helping to support innovation, open new markets, and create opportunities for Canada’s entrepreneurs.</p><p>“We are also working hard to help women entrepreneurs succeed, both in Canada and abroad. The Business Development Bank of Canada (BDC) has made major investments to support women-owned businesses, recently surpassing targets with over $800 million in loans for women entrepreneurs over 30 months. As part of its efforts, the BDC has also invested $50 million in women-led technology firms. To help make sure women entrepreneurs in every part of the world have the tools they need to innovate and prosper, Canada has also pledged $20 million to the <a href=\"http://www.worldbank.org/en/programs/women-entrepreneurs\">Women Entrepreneurs Finance Initiative</a>. We know that women entrepreneurs create jobs, advance gender equality, and help build economies that work for everyone.</p><p>“On behalf of the Government of Canada, I invite all Canadians to celebrate Canada’s innovators and entrepreneurs. Their hard work and bold ideas have driven prosperity throughout our country’s history, and have helped to grow the strong middle class at the heart of Canada’s success. Today, we thank them for helping to build a stronger economy and a better country. I also thank <a href=\"http://www.futurpreneur.ca/en/initiatives/gew-canada/\">Futurpreneur Canada</a>, the official host of Global Entrepreneurship Week in Canada. Futurpreneur Canada has helped nearly 10,000 young people launch and grow businesses of every kind in every part of Canada, creating roughly 40,000 Canadian jobs over the years. I wish them every success with this year’s activities.”</p></div>\n      "
}