{
  "path": "/en/news/news-releases/2020/05/11/prime-minister-announces-additional-support-businesses-help-save",
  "pageTitle": "Prime Minister announces additional support for businesses to help save Canadian jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 has altered the way we live our lives and, every day, Canadians are facing new challenges during this crisis. As more people worry about paying their bills and caring for their loved ones, the Government of Canada is continuing to take unprecedented action to help protect middle class jobs, and the health and safety of all Canadians. &nbsp;</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new measures to support businesses so they can keep their workers on the payroll and weather this pandemic.</p>\n\n<p>Millions of Canadians pay their bills and feed their families by working for large and medium-sized businesses. The government will offer support to those businesses affected by COVID-19 based on a number of conditions. To help protect Canadian middle class jobs, and safeguard our economy, the Government of Canada will :</p>\n\n<ul>\n\t<li>Establish a Large Employer Emergency Financing Facility (LEEFF) to provide bridge financing to Canada’s largest employers, whose needs during the pandemic are not being met through conventional financing, in order to keep their operations going. The objective of this support is to help protect Canadian jobs, help Canadian businesses weather the current economic downturn, and avoid bankruptcies of otherwise viable firms where possible. This support will not be used to resolve insolvencies or restructure firms, nor will it provide financing to companies that otherwise have the capacity to manage through the crisis. The additional liquidity provided through LEEFF will allow Canada’s largest businesses and their suppliers to remain active during this difficult time, and position them for a rapid economic recovery.</li>\n\t<li>Use key guiding principles in providing support through the LEEFF, including:\n\t<ul>\n\t\t<li>Protection of taxpayers and workers: Companies seeking support must demonstrate how they intend to preserve employment and maintain investment activities. Recipients will need to commit to respect collective bargaining agreements and protect workers’ pensions. The LEEFF program will require strict limits to dividends, share buy-backs, and executive pay. In considering a company’s eligibility to assistance under the LEEFF program, an assessment may be made of its employment, tax, and economic activity in Canada, as well as its international organizational structure and financing arrangements. The program will not be available to companies that have been convicted of tax evasion. In addition, recipient companies would be required to commit to publish annual climate-related disclosure reports consistent with the Financial Stability Board’s Task Force on Climate-related Financial Disclosures, including how their future operations will support environmental sustainability and national climate goals.</li>\n\t\t<li>Fairness: To ensure support across the Canadian economy, the financing is intended to be applicable to all eligible sectors in a consistent manner.</li>\n\t\t<li>Timeliness: To ensure timely support, the LEEFF program will apply a standard set of economic terms and conditions.</li>\n\t</ul>\n\t</li>\n\t<li>Expand the Business Credit Availability Program (BCAP) to mid-sized companies with larger financing needs. Support for mid-market businesses will include loans of up to $60 million per company, and guarantees of up to $80 million. Through the BCAP, Export Development Canada (EDC) and the Business Development Bank of Canada (BDC) will work with private sector lenders to support access to capital for Canadian businesses in all sectors and regions.</li>\n\t<li>Continue to provide financing to businesses through Farm Credit Canada, the BDC, and EDC, including through the Canada Account. This will ensure the government is able to respond to a wide range of financing needs, including for some large employers facing higher risks, with stricter terms in order to adequately protect taxpayers.</li>\n</ul>\n\n<p>These measures are part of the Government of Canada’s COVID-19 Economic Response Plan, which has helped protect Canadian jobs, and committed billions in support to Canadians and businesses facing hardship as a result of the pandemic. This includes an extension on the Canada Emergency Wage Subsidy, which allows businesses to keep workers on the payroll. The government will continue to monitor and respond to the wide-ranging impacts of COVID-19, and take additional actions as needed to protect the health and safety of Canadians and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>&nbsp;“We know that times have been tough, and Canadians are concerned about their jobs, and the health and safety of their families. We promised that we would be here to support all Canadians, and that is why we are announcing new measures that will help save middle class jobs, safeguard workers' benefits, and protect our economy. This will help businesses keep workers on the payroll, and put more Canadians in a position to recover quickly once we make it through these uncertain times.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Employers, large and small, are facing challenges due to the COVID-19 global pandemic. Our government has their backs. We know that many businesses of all sizes need our help in order to keep their many employees on the payroll and their suppliers paid until the economy recovers. That is why today’s measures will help both large and mid-sized employers to get access to the financing they need to make it through this extraordinarily challenging time.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know that Canadian workers and companies of all sizes are facing economic hardship and uncertainty during the COVID-19 pandemic. We continue to analyse the specific pain points that COVID-19 is putting on all our industrial sectors as they grapple with unprecedented financial difficulties during this crisis. The measures we are announcing today will add to the supports currently available to large employers in Canada to help them weather the storm during this difficult time.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The composition of the mid-market segment may be varied, but the needs of its companies are similar, especially at a time when demand in many sectors has suffered. Mid-market businesspeople are looking for ways to access sufficient liquidity to bridge current uncertainties and to recover.</li>\n\t<li>The expanded BCAP will allow mid-market companies to leverage the Crown’s mandate for support, as well as their expertise and relationships with the country’s financial institutions, in order to access the best complementary solutions that address their financing gaps.</li>\n\t<li>The government’s support for large companies through LEEFF will be delivered by the Canada Development Investment Corporation (CDEV), in cooperation with Innovation, Science and Economic Development Canada (ISED) and the Department of Finance. The LEEFF program will be open to large for-profit businesses – with the exception of those in the financial sector – as well as certain not-for-profit businesses, such as airports, with annual revenues generally in the order of $300 million or higher. To qualify for LEEFF support, eligible businesses must be seeking financing of about $60 million or more, have significant operations or workforce in Canada, and not be involved in active insolvency proceedings. Broader sectoral dynamics for LEEFF applicants will be considered through processes led by ISED.</li>\n\t<li>The LEEFF program will be designed to protect the interests of taxpayers and will require the cooperation of applicants’ private sector lenders, to ensure government financing is focused on sustaining operations.</li>\n\t<li>The government is in the final stages of establishing the program and further information about the application process will be provided shortly.</li>\n\t<li>The government is also supporting Canadian businesses through the COVID-19 outbreak with targeted initiatives that:\n\t<ul>\n\t\t<li>Provide effective support to those eligible employers that are hardest hit by the COVID-19 pandemic through the Canada Emergency Wage Subsidy (CEWS). The CEWS applies at a rate of 75 per cent of the first $58,700 normally earned by employees – representing a benefit of up to $847 per week, per employee. Employers of all sizes from across the economy are eligible, with certain exceptions including public sector entities.</li>\n\t\t<li>Allow businesses, including self-employed individuals, to defer all Goods and Services Tax/Harmonized Sales Tax (GST/HST) payments, as well as customs duty payments owed for imports, until June. This measure is the equivalent of providing up to $30 billion in interest-free loans to Canadian businesses. It will help businesses continue to pay their employees and their bills, and help ease cash-flow challenges across the country.</li>\n\t\t<li>Defer the payment of income taxes. The government is allowing all taxpayers to defer, until after August 31, 2020, the payment of income tax amounts that become owing on or after March 18, 2020. This relief, amounting to $55 billion in liquidity support, would apply to new balances due, as well as instalments, under Part I of the <em>Income Tax Act</em>. No interest or penalties will accumulate on these amounts during this period.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/17/prime-minister-announces-new-support-protect-canadian-jobs\">Prime Minister announces new support to protect Canadian jobs</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/prime-minister-announces-support-farmers-and-agri-food-businesses\">Prime Minister announces support for farmers and agri-food businesses under Canada’s response to COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}