{
  "path": "/en/news/readouts/2022/12/03/prime-minister-justin-trudeau-meets-british-columbia-premier-david-eby",
  "pageTitle": "Prime Minister Justin Trudeau meets with British Columbia Premier David Eby | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau had his first meeting with British Columbia Premier David Eby.</p>\n\n<p>The Prime Minister congratulated Premier Eby on being sworn in as premier, and said he looked forward to building on the strong collaboration between the federal and British Columbia governments in recent years.&nbsp;</p>\n\n<p>The two leaders discussed health care, and agreed to continue working together so all British Columbians and Canadians have a health care system that meets their needs. They also discussed public safety, supporting mental health and addictions services for vulnerable people, and the work they are doing to make sure British Columbians feel safe in their communities.</p>\n\n<p>On housing affordability, the two leaders agreed to work on the challenges in British Columbia with the goal of making life more affordable for British Columbians and building an economy that works for everyone. As well, they agreed to build on the significant efforts both governments have made toward reconciliation with Indigenous Peoples. Premier Eby also welcomed the Government of Canada’s new 2023-2025 Immigration Levels Plan, and the Prime Minister and Premier Eby agreed to collaborate on foreign credential recognition.</p>\n\n<p>The Prime Minister and Premier Eby agreed to remain in close contact and to continue working together on these and other shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/10/21/statement-prime-minister-selection-next-premier-british-columbia\">Statement by the Prime Minister on the selection of the next premier of British Columbia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/27/prime-minister-justin-trudeau-speaks-british-columbia-premier-designate\">Prime Minister Justin Trudeau speaks with British Columbia Premier-designate David Eby</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2022/12/reducing-licensed-child-care-fees-for-british-columbia-families-by-50.html\">Reducing licensed child care fees for British Columbia families by 50%</a></li>\n</ul></div>\n      "
}