{
  "path": "/en/news/statements/2015/11/04/prime-minister-justin-trudeaus-open-letter-canadians",
  "pageTitle": "Prime Minister Justin Trudeau’s open letter to Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>For immediate release</p><p>My dear friends, <br><br>Today, I had the pleasure of introducing our team of extraordinary Canadians who will serve as Ministers in your new government. As a Canadian, you expect to see your values and priorities reflected in your government – and we have listened closely. Our strong, diverse, and experienced team will serve all Canadians, and – for the first time in our country’s history – there will be an equal number of women and men around the Cabinet table.<br><br>Over the course of the campaign, we promised you a government that will bring real change – in both the things we do and the way we do them. We will immediately start implementing our plan for a strong and growing middle class. On Election Day, you sent a clear message, and you rightly expect us to fulfill our promises. <br><br>I am writing to you, today, to reaffirm my commitment to spend the next four years working hard to deliver on those promises. It is time for leadership that never seeks to divide Canadians, but takes every single opportunity to bring us together, including in Parliament.<br><br>We made a commitment to invest in growing our economy, strengthening our middle class, and helping those working hard to join it. We committed to fighting climate change and protecting our environment. We made a commitment to provide more direct help to those who need it by giving less to those who do not. We committed to public investment as the best way to spur growth, job creation, and economic prosperity. And we committed to a responsible, transparent fiscal plan for challenging economic times. We expect you to hold the government accountable for delivering these commitments.<br><br>Our country faces many real and immediate challenges – from a struggling middle class to the threat of climate change. If we are to overcome these obstacles, Canadians need to have faith in their government’s honesty and willingness to listen. That is why we committed to set a higher bar for openness and transparency in Ottawa. Government and its information must be open by default. Simply put, it is time to shine more light on government to make sure it remains focused on the people it was created to serve – you. <br><br>But in order for you to trust your government, you need a government that will trust you. When we make a mistake – as all governments do – it is important that we acknowledge that mistake and learn from it. We know that you do not expect us to be perfect – but you expect us to work tirelessly, and to be honest, open, and sincere in our efforts to serve the public interest. <br><br>Before the election, we also made a commitment to bring new leadership and a new tone to Ottawa. Moving forward, we will pursue our goals and objectives with a renewed sense of collaboration. We fully understand and appreciate that partnerships with provincial, territorial, and municipal governments are vital to deliver the real, positive change that we promised you. <br><br>It is also time for a renewed, Nation-to-Nation relationship with Indigenous Peoples, one based on a recognition of rights, respect, co-operation, and partnership. Not only is this the right thing to do, but it is also a sure path to economic growth. <br><br>To close, I am deeply grateful to have this opportunity to serve you – and every Canadian across our great country. I am committed to leading an open, honest government that is accountable to Canadians, lives up to the highest ethical standards, brings our country together, and applies the utmost care and prudence in the handling of public funds. <br><br>Thank you for having faith in me. Thank you for putting your trust in our team. <br><br>We will not let you down.<br><br>Rt. Hon. Justin Trudeau, P.C, M.P.<br>Prime Minister of Canada<br><br></p></div>\n      "
}