{
  "path": "/en/news/statements/2021/10/01/statement-prime-minister-womens-history-month",
  "pageTitle": "Statement by the Prime Minister on Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Women’s History Month:</p>\n\n<p>“Women have long been trailblazers in creating a better, more inclusive, and equal Canada. During <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a>, we celebrate Canadian women’s contributions to building the country we know today.</p>\n\n<p>“This year’s theme – Women Making History Now – recognizes the women who are making a lasting impact for our country today, including in addressing the impacts of the COVID-19 pandemic and moving us forward on the path of reconciliation. From mental health care providers, nurses, and doctors, to teachers, scientists, and members of the Canadian Armed Forces, women of all backgrounds continue to act as powerful agents of change and inspire future generations to fight for an equal world. This summer, Canadians also watched proudly as our women Paralympians and Olympians made history with their many athletic accomplishments in Tokyo.</p>\n\n<p>“Over the past year and a half, the pandemic threatened to stall some of the progress women have made over the past few decades. Many women have faced job losses and reduced hours of work. In communities across the country, an increase in unpaid care work at home has weighed heavily on women, leading some to leave their jobs to look after their families. This resulted in a she-cession, which exacerbated the inequalities and injustices faced by women in our society, particularly among marginalized individuals and groups. We must take lessons learned from this pandemic and work together toward a more robust and inclusive recovery.</p>\n\n<p>“The Government of Canada is deeply committed to making our economy and labour market more resilient and protecting parents – especially mothers – from these effects in the future. We are investing up to $30 billion over the next five years to help families access affordable child care through the <a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Canada-wide Early Learning and Child Care Plan</a>. This plan offers women the opportunity to jump back into the workforce while being assured that their children are receiving high-quality care. We are also addressing issues of gender equality through the <a href=\"https://www.canada.ca/en/department-finance/task-force-women-economy.html\">Task Force on Women in the Economy</a>. This diverse group of Canadian women provides advice on the tangible ways the Government of Canada can better support women’s participation in the economy. Their ideas and expertise are helping us to address systemic barriers and inequities faced by women in the job market.</p>\n\n<p>“On the international stage, Canada continues to champion gender equality and women’s empowerment through our <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>. Earlier this year, we announced <a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/30/prime-minister-announces-measures-advance-gender-equality-worldwide\">new commitments and funding</a> to tackle persistent barriers to gender equality around the world. This includes addressing inequalities in unpaid and paid care work in low- and middle-income countries, to help increase women’s ability to more fully participate in the economy, education, and public life. We will continue to support and advance initiatives that promote gender equality and the empowerment of women and girls worldwide.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I invite Canadians to use the hashtag #WomensHistoryMonth to learn more about and celebrate the significant contributions that women have made, and continue to make, in shaping our society. Let us continue to work together to make Canada a better, fairer, and more diverse place to live.”</p></div>\n      "
}