{
  "path": "/en/news/statements/2015/11/28/statement-prime-minister-canada-holodomor-memorial-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Holodomor Memorial Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on Holodomor Memorial Day:</p>\n<p>“One of the darkest chapters of human history, the Holodomor, occurred over eighty years ago between 1932 and 1933. The Holodomor was the systemic and horrific genocide of millions of Ukrainians by a totalitarian Soviet regime. Children, women, and men were starved and executed for nothing more than trying to speak their language, maintain their culture, keep their land, and live in peace.</p>\n<p>“While the Holodomor tried to break the Ukrainian people, they endured, persevered, and ultimately won their independence. Their descendants continue to make immeasurable contributions in countries around the world – including right here in Canada.</p>\n<p>“Today, we stand with Ukrainians in denouncing the historical atrocities committed against them, and in support of their enduring right to self-determination, freedom, and democracy. To this end, the Government of Canada stands firmly against Russia’s ongoing military aggression in Ukraine. We believe that, along with the international community, Canada can play an important part in bringing this conflict to an end. As a country, we also remain committed to helping rebuild the democratic, economic, and security institutions that will help Ukraine flourish once more.</p>\n<p>“On this sombre anniversary, we pause to remember the victims, families, and communities who suffered as a result of the Holodomor, and we strengthen our resolve to continue promoting and upholding basic freedoms, rights, and dignity to help ensure that atrocities like this never happen again.”</p></div>\n      "
}