{
  "path": "/en/news/statements/2020/05/23/statement-prime-minister-anniversary-komagata-maru-incident",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the Komagata Maru incident | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the Komagata Maru incident:</p>\n\n<p>“More than a century ago today, 376 passengers aboard the Komagata Maru steamship arrived in Vancouver. Like millions of immigrants coming to Canada before and since, these passengers came seeking better lives for their families.</p>\n\n<p>“After a long journey from India, the majority of the passengers—who were Sikhs, Muslims, and Hindus of South Asian origin—were told they could not set foot on Canadian soil, due to the discriminatory laws of the time. They were refused entry and, for two months, were confined to the ship and denied regular access to food and water.</p>\n\n<p>“Despite the efforts of local South Asian communities, the Canadian government of the day only allowed a few passengers into Canada and the rest were forced to return to India, where some were later killed and many others imprisoned.</p>\n\n<p>“Four years ago, I stood in the House of Commons to apologize on behalf of the Government of Canada to all those whose lives were changed by this tragic event. While no words can fully erase their pain and suffering, we must learn from the mistakes of our past and make sure to never repeat them. The Komagata Maru incident continues to resonate in our history as a reminder to treat each other with respect, champion the rights of all, and embrace inclusion and respect for diversity as a great strength.</p>\n\n<p>“Today, we remember the victims of this incident, and reflect on how much Canada has benefitted from the contributions of our South Asian communities and others who have come to this country and offered the best of who they are. We will always be proud of Canada’s diversity—we are strong not in spite of our differences, but because of them.”</p></div>\n      "
}