{
  "path": "/en/news/readouts/2021/04/21/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden.</p>\n\n<p>The Prime Minister looked forward to participating in the upcoming Leaders Summit on Climate hosted by the President, and highlighted the importance of increased global ambition in the fight against climate change.</p>\n\n<p>The two leaders discussed vaccination efforts in both countries, and the urgency of getting people everywhere vaccinated as quickly as possible to end the global COVID-19 pandemic. The Prime Minister and the President discussed the recent exchange of AstraZeneca vaccines manufactured in the United States.</p>\n\n<p>The Prime Minister thanked the President for the United States’ support in the cases of Canadian citizens Michael Spavor and Michael Kovrig, who have been arbitrarily detained in China.</p>\n\n<p>The two leaders also discussed their shared commitment to a strong&nbsp;economic recovery that grows the middle class,&nbsp;including this week’s Budget as well as the President’s jobs plan.</p>\n\n<p>The Prime Minister and President agreed on the important role of the G7 in protecting shared values, including human rights and democracy.</p>\n\n<p>The two leaders agreed to stay in close contact over the coming days and weeks.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/23/prime-minister-canada-welcomes-plan-revitalize-and-expand-ties-united\">Prime Minister of Canada welcomes plan to revitalize and expand ties with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/17/prime-minister-trudeau-participate-leaders-summit-climate\">Prime Minister Trudeau to participate in Leaders Summit on Climate</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/vaccines.html\">Vaccines for COVID-19</a></li>\n</ul></div>\n      "
}