{
  "path": "/en/news/news-releases/2019/01/14/prime-minister-attends-canada-assembly-first-nations-leaders-meeting",
  "pageTitle": "The Prime Minister attends the Canada-Assembly of First Nations Leaders Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is committed to a renewed relationship with Indigenous peoples, based on recognition of rights, respect, cooperation, and partnership.</p><p>The Prime Minister, Justin Trudeau, today attended the Canada-Assembly of First Nations (AFN) Leaders Meeting with National Chief Perry Bellegarde and members of the AFN Executive. The meeting built on the Memorandum of Understanding signed between the AFN and the Government of Canada in June 2017, which underlines shared priorities and guides work to advance the goals and interests of First Nations. The Prime Minister, the National Chief, and other leaders from Canada and the AFN discussed progress made on joint priorities outlined in the memorandum, and ongoing work to create a stronger nation-to-nation relationship between Canada and First Nations.</p><p>During the meeting, the leaders highlighted significant strides made to close gaps in education and First Nations child and family services, and additional support offered under Jordan’s Principle to make sure all Indigenous children have the resources they need to thrive. They also noted ongoing work to co-develop new legislation to improve Indigenous child and family services, and to preserve, protect, and revitalize Indigenous languages.</p><p>In discussions, the leaders emphasized progress made on lifting long-term drinking water advisories on public systems on reserve, reiterating the Government of Canada’s commitment to end all advisories by March 2021. They also underscored their commitment to work together to replace outdated policies, including the Comprehensive Land Claims Policy and Inherent Right of Self-Government Policy as part of the ongoing federal law and policy review.</p><p>Today’s meeting is part of the permanent bilateral mechanism process that Prime Minister Trudeau committed to in December 2016. The mechanism helps establish shared priorities and track progress on renewing Canada’s relationship with Indigenous peoples.</p><h2>Quote</h2><blockquote><p>“Canada cannot move forward if Indigenous peoples continue to be held back. Together with Indigenous partners, the Government of Canada is working hard to move the dial on reconciliation, and today’s meeting with the AFN was an important step. By having open conversations and taking concrete action, we can make real and lasting change for Indigenous peoples and all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In June 2017, the Prime Minister, Justin Trudeau, and the National Chief of the AFN, Perry Bellegarde, signed a memorandum of understanding on shared priorities during the first AFN-Crown meeting under the new permanent bilateral mechanism process.</li><li>Combined, Budget 2016, Budget 2017, and Budget 2018 have allocated $17&nbsp;billion for a whole range of Indigenous projects and initiatives, including 213 health centre and education projects on reserve.</li><li>On November 30, 2018, Minister Philpott, together with AFN National Chief Perry Bellegarde, Inuit Tapiriit Kanatami President Natan Obed, and Métis National Council President Clément Chartier, announced that the Government of Canada will introduce co-developed federal legislation on Indigenous child and family services in early 2019. This broad-based legislation will be inclusive of all Indigenous peoples while respecting a distinctions-based approach.</li><li>Between July 2016 and November 2018, the Government of Canada has approved more than 177,000 requests through Jordan’s Principle to make sure that First Nations children have the support they need – including educational and mental health support, medical equipment, and speech therapy.</li><li>In 2018, the Government of Canada held over 50 distinct First Nations, Inuit, and Métis engagement sessions across the country for the co-development of legislation on Indigenous languages.</li><li>Since November 2015, the Government of Canada has lifted 78 long-term drinking water advisories.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.sac-isc.gc.ca/eng/1541187352297/1541187392851\">Reducing the number of Indigenous children in care</a></li><li><a href=\"https://www.canada.ca/en/indigenous-services-canada/services/jordans-principle.html\"><span lang=\"FR-CA\" xml:lang=\"FR-CA\">Indigenous Services Canada - Jordan’s Principle</span></a></li><li><a href=\"https://www.sac-isc.gc.ca/eng/1506514143353/1533317130660\">Ending long-term drinking water advisories</a></li><li><a href=\"https://www.sac-isc.gc.ca/eng/1100100033601/1521124611239\">Indigenous Services Canada - Education</a></li><li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/indigenous-languages-legislation.html\">Co-development of a National First Nations, Inuit and Métis Languages Act</a></li><li><a href=\"/en/news/news-releases/2017/06/12/prime-minister-and-national-chief-assembly-first-nations-sign\">The Prime Minister and the National Chief of the Assembly of First Nations sign Memorandum of Understanding on shared priorities</a></li><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous peoples</a></li></ul><p>&nbsp;</p></div>\n      "
}