{
  "path": "/en/news/statements/2021/10/10/statement-prime-minister-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister for World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Mental Health Day:</p>\n\n<p>“Good health must include good mental health. That means taking care of our mental health just as we would our physical health. That’s why today, on <a href=\"https://www.who.int/campaigns/world-mental-health-day/2021\">World Mental Health Day</a>, I encourage everyone to take good care of themselves and one another. We all have a role to play in making a difference, fighting the stigma around mental illness, and helping ensure everyone has access to the quality care they need.</p>\n\n<p>“Kindness, compassion, and understanding are key for creating a culture where we can all talk openly about mental health and challenge attitudes that perpetuate stigma and judgment.</p>\n\n<p>“The COVID-19 pandemic has been a significant source of stress for most Canadians, and our mental health has suffered. Business owners have struggled to stay afloat. Many workers have faced unemployment. Parents have had to adjust to working from home. Students have had to adapt to online learning. Front-line health care workers bravely continued providing care, faced with extremely stressful working conditions and the worry of bringing home the COVID-19 virus. We’ve all made sacrifices to keep each other and our communities safe.</p>\n\n<p>“This year’s theme, ‘Mental health care for all: let’s make it a reality’, reminds us that events at home and abroad can have compounding effects on our mental health. We have collectively witnessed the tragedy of the unmarked and undocumented graves and burial sites located near former residential schools. Many Canadians lost their homes because of the devastating wildfires across the country. People continue to be victims of racism, discrimination, and intolerance. Violence and atrocities around the world have also shaken us to our core.</p>\n\n<p>“That’s why the Government of Canada is working to ensure that mental health is treated as a full and equal part of Canada’s universal public health care system. Last year, we launched the <a href=\"https://wellnesstogether.ca/en-CA\">Wellness Together Canada</a> portal, which has been accessed by over 1.7 million Canadians, providing free and confidential access to live support, direct crisis counselling, and helpful mental health and substance use resources. We are also working hard to address the root causes affecting one’s mental health by righting some of the inequities in our country. This includes creating safe and supportive communities by investing in charities and community organizations, supporting seniors at home, fighting homelessness, and addressing systemic racism.</p>\n\n<p>“On behalf of the Government of Canada, I want to thank those who have contributed to an open discussion on mental health. Thank you also to all those who have provided services in support of quality mental health care. All Canadians should have the care they need, when they need it. We will all be stronger for it.”</p>\n\n<p><em>In addition to the <a href=\"https://wellnesstogether.ca/en-CA\">Wellness Together Canada</a></em> <em>portal, if you or someone you know is thinking about suicide, call the Canada Suicide Prevention Service at 1-833-456-4566.</em></p></div>\n      "
}