{
  "path": "/en/news/news-releases/2018/09/05/prime-minister-inaugurates-new-facility-edmonton-expand-research-and",
  "pageTitle": "Prime Minister inaugurates new facility in Edmonton to expand research and foster innovation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian innovators create quality jobs across the country, keep our industries competitive on the world stage, and find solutions to pressing issues – from building a more sustainable future to creating economies that benefit everyone.</p><p>The Government of Canada continues to make ambitious investments in research, infrastructure, and education to support Canadian innovators, create state-of-the-art spaces for collaboration, and prepare our next generation of problem solvers.</p><p>The Prime Minister, Justin Trudeau, today attended the unveiling of the new LEED‑certified Productivity and Innovation Centre at the Northern Alberta Institute of Technology. The Government of Canada invested over $34 million in the new Centre, which will support businesses to find ways to be more efficient and effective in today’s globally competitive environment, and to develop and adopt technologies that will increase their productivity.</p><p>Thanks to this funding, students, professors, and researchers will work in state-of-the-art facilities to advance research and innovation in Canada. Working together, they will be able to turn their discoveries into viable products and services, and train for – and create – the jobs of the future.</p><p>The Centre will also host the Northern Alberta Institute of Technology’s Centre for Oil Sands Sustainability and the Centre for Sensors and System Integration, and provide future space for applied research focused on construction, water technologies, and distributed energy.</p><h2>Quotes</h2><blockquote><p>“Research is the foundation for the positive change that we’re going to see in the months and years to come – whether it’s technology we won’t be able to imagine our days without, or jobs for our young people. We will continue to invest in state-of-the-art facilities and learning spaces – like the Productivity and Innovation Centre – to not only create jobs today, but to prepare Canadians for the good, middle class jobs of tomorrow.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The completion of the Productivity and Innovation Centre marks an exciting moment for its students and the local community. We are proud to invest in infrastructure improvement at post-secondary institutions across Canada to help students turn ideas into solutions, science into technologies, skills into middle-class jobs, and start-up companies into global successes.”<br>—<cite>The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development</cite></p></blockquote><blockquote><p>“Encouraging scientific awareness in Edmonton and throughout Canada depends on supporting our world-class scientists and researchers. Through investments such as those under the Post-Secondary Institutions Strategic Investment Fund, we are continuing to lay the groundwork for making Canada a global leader in scientific excellence.”<br>—<cite>The Hon. Kirsty Duncan, Minister of Science and Sport</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada contributed $34.9&nbsp;million towards this $83.4&nbsp;million project through the Post-Secondary Institutions Strategic Investment Fund. The Northern Alberta Institute of Technology provided an additional $48.5 million for the project.</li><li>The Government of Canada’s Innovation and Skills Plan aims to make Canada a global centre for innovation – one that creates good middle-class jobs, drives growth across all industries, and improves the lives of all Canadians.</li><li>To support the Plan, the Post-Secondary Institutions Strategic Investment Fund helps jump-start a virtuous circle of innovation and create the right conditions for long-term growth.</li><li>The Government of Canada has invested $2 billion for projects across the country through the Post-Secondary Institutions Strategic Investment Fund, which is going to make a difference for Canadians from coast to coast to coast.</li><li>The targeted investments under the Fund promote economic activity across Canada and help Canada’s universities and colleges act as engines of discovery, develop highly skilled workers, and collaborate on innovations that help Canadian companies compete and grow internationally.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.ic.gc.ca/eic/site/062.nsf/eng/home\">Innovation and Skills Plan</a></li><li><a href=\"http://www.ic.gc.ca/eic/site/051.nsf/eng/home\">Post-Secondary Institutions Strategic Investment Fund</a></li><li><a href=\"http://www.nait.ca/\">Northern Alberta Institute of Technology</a></li></ul></div>\n      "
}