{
  "path": "/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor",
  "pageTitle": "Prime Minister announces The Queen’s approval of Canada’s next Governor General | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that on his recommendation, Her Majesty Queen Elizabeth II has approved the appointment of Mary Simon as the next Governor General of Canada.</p>\n\n<p>As Governor General, Ms.&nbsp;Simon will be the representative of Her Majesty The Queen in Canada. She will be Canada’s 30th Governor General since Confederation, and the 13th Governor General appointed by Her Majesty during her 69 years on the throne.</p>\n\n<p>Throughout her distinguished career, Ms.&nbsp;Simon has been a tireless advocate for Inuit rights and culture, and the rights of all Indigenous peoples. Over four decades, she has held various senior leadership positions, including President of Makivik Corporation, where she helped to protect and promote Inuit rights through the implementation of the James Bay and Northern Quebec Agreement. She also served two terms as President of the Inuit Circumpolar Conference, now known as the Inuit Circumpolar Council, and as President of Inuit Tapiriit Kanatami.</p>\n\n<p>As the first Canadian Ambassador for Circumpolar Affairs, Ms.&nbsp;Simon played a leading role in strengthening the ties between the people of the Arctic regions nationally and internationally, including through the creation of the Arctic Council. She is also the founder of the Arctic Children and Youth Foundation, and has served as the Ambassador of Canada to Denmark.</p>\n\n<p>The selection was informed through the advice of the Advisory Group on the Selection of the Next Governor General. The group was mandated to deliberate and submit a shortlist of outstanding Canadians for the Prime Minister’s consideration to fill the office.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am very pleased to announce that Her Majesty The Queen has graciously approved the appointment of Mary Simon as the next Governor General of Canada. Ms.&nbsp;Simon has dedicated her life to advancing social, economic, and human rights issues for Canadian Inuit and Indigenous peoples, and I am confident that she will serve Canadians and promote our shared values with dedication and integrity. Through this appointment, we are ensuring that Canada is represented by someone who exemplifies the very best of our country. I also join Canadians in thanking His Excellency the Rt. Hon.&nbsp;Richard Wagner, for serving as the Administrator of the Government of Canada the past few months.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As a constitutional monarchy with a parliament comprised of the Sovereign, the Senate, and the House of Commons, Canada’s form of government is among the most stable and enduring in the world. With an evolving role that predates Confederation, the Governor General acts on behalf of the Sovereign, Canada’s Head of State.</li>\n\t<li>The Governor General’s responsibilities include carrying out constitutional duties, serving as commander-in-chief, representing Canada at home and abroad, encouraging excellence, and bringing Canadians together.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2021/07/06/mary-simon-oc-oq\">Biographical notes</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en\">The Governor General of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2021/03/minister-leblanc-announces-advisory-group-to-assist-with-the-selection-of-the-next-governor-general.html\">Minister LeBlanc announces advisory group to assist with the selection of the next Governor General</a></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>Also available in <a href=\"/en/news/news-releases/2021/07/06/kanataup-sivuliuqtinga-angajuqkaammaringa-tusartittivuq-kuing\">Inuktitut</a> and <a href=\"/en/news/news-releases/2021/07/06/kanataup-sivuliuqtinga-agajuqaamariga-tusaqtitijuq-taapsuma-queen\">Inuktut Qaliujaaqpait</a>.</p></div>\n      "
}