{
  "path": "/en/news/statements/2021/12/06/statement-prime-minister-100th-anniversary-election-first-woman-member",
  "pageTitle": "Statement by the Prime Minister on the 100th anniversary of the election of the first woman Member of Parliament | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 100th anniversary of the election of the first woman Member of Parliament:</p>\n\n<p>“One hundred years ago today, in the first federal election in which some women had the right to vote and run as candidates, Agnes Macphail became the first woman elected to the House of Commons. This election would help pave the way for future generations of women wishing to enter political life, represent their fellow citizens, and make an impact on the lives of Canadians.</p>\n\n<p>“In the House of Commons, Ms. Macphail was a champion for the working class and her rural constituents. She was a trailblazer who helped advance gender equality in Canada. A self‑proclaimed feminist, she spoke publicly about the role of women in politics, encouraged other women to enter public life, pushed for equal pay for work of equal value, and helped with provincial suffrage movements across the country. While Ms. Macphail held some viewpoints which we would not support today, she also continued to face opposition from her fellow Parliamentarians simply because she was a woman. She would serve in the House of Commons until 1940, playing an important role in helping diversify Canada’s Parliament.</p>\n\n<p>“Since Ms. Macphail’s election, Canada has made great progress in increasing the representation of women in political office. In 1988, Ethel Blondin-Andrew became the first Indigenous woman elected to the House of Commons. Five years after that, Jean Augustine took her seat in Parliament as the first Black Canadian woman to ever be elected, in the same year that Canada saw its first woman Prime Minister, Kim Campbell. In 2021, 100 years after the election of the first woman Member of Parliament, Canadians elected over 100 women to Parliament, marking the highest number of women ever to sit in the House of Commons. These women represent communities from diverse backgrounds and ethnicities across our country in Ottawa, and many serve in a gender-balanced federal Cabinet.</p>\n\n<p>“Together, we’ve made progress over the past 100 years in the advancement of women and girls within the workplace and in public life, but we know that there’s so much more to do to build a Canada that is more equal and fairer for everyone. That’s why the Government of Canada continues to work hard to address the obstacles women and girls face, including by taking steps to promote and increase women’s participation in the workforce, reduce the gender wage gap, and fight gender-based violence. We will continue to make advancements in these areas and ensure everyone has an equal chance at success.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to pay tribute to Agnes Macphail and all women throughout our history who have raised their hands to serve their communities. Their dedication to the advancement of gender equality, work to break down barriers and fight for equal rights, and courage to create a more equal and just democracy has helped shape a better country for everyone.”</p></div>\n      "
}