{
  "path": "/en/news/readouts/2020/09/30/prime-minister-justin-trudeau-speaks-prime-minister-japan-suga-yoshihide",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Japan Suga Yoshihide | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Japan, Suga Yoshihide.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Suga and wished him success in his new role.</p>\n\n<p>The prime ministers discussed ongoing efforts in Canada, Japan, and around the world to address the impacts of COVID-19. They agreed on the importance of global cooperation to fight the pandemic and develop a vaccine.</p>\n\n<p>The leaders reaffirmed their commitment to the Canada-Japan strategic partnership. They agreed to work together bilaterally and in fora such as the G7 and G20 to uphold our shared values, promote economic cooperation and trade, and defend a rules-based international order.</p>\n\n<p>The prime ministers welcomed collaboration between Canada and Japan to promote a free and open Indo-Pacific region. They discussed ongoing efforts to promote peace and security in the region, including the multinational effort to help monitor United Nations sanctions against North Korea to which Canada is contributing through Operation NEON. The leaders also discussed relations with China, including the arbitrary detention of two Canadian citizens.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Suga looked forward to continued cooperation between Canada and Japan to advance shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-neon.html\">Operation NEON</a></li>\n</ul></div>\n      "
}