{
  "path": "/en/news/statements/2020/11/20/27th-apec-economic-leaders-meeting-2020-kuala-lumpur-declaration",
  "pageTitle": "The 27th APEC Economic Leaders’ Meeting 2020 Kuala Lumpur Declaration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Economic Leaders of APEC, stand united in our determination to enable the Asia-Pacific region to successfully recover from the COVID-19 pandemic and its economic impacts.&nbsp; We are committed to protecting our people’s lives and safeguarding their health.&nbsp;&nbsp; We resolve to further navigate the region towards recovery along the path of strong, balanced, inclusive, sustainable, innovative and secure economic growth.&nbsp; Our coordinated action and cooperation are more important than ever to overcome the challenges of COVID-19 and realise new and emerging opportunities for prosperity for all.&nbsp;</p>\n\n<p>COVID-19 is one of the most challenging health and economic crises of our times.&nbsp; We express our deepest condolences to those who have suffered and lost loved ones.&nbsp; We are saddened by the devastation to jobs and livelihoods as a result of widespread economic disruption and we are grateful to those serving on the frontline.</p>\n\n<p>We are meeting virtually for the first time in our history under the APEC 2020 theme of <em>Optimising Human Potential towards a Resilient Future of Shared Prosperity. Pivot. Prioritise. Progress.&nbsp; </em>We have aligned our efforts along the priorities of: <em>Improving the Narrative of Trade and Investment</em>; <em>Inclusive Economic Participation through Digital Economy and Technology</em>; and <em>Driving Innovative Sustainability</em>.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<h2>Combatting and Mitigating the Impacts of COVID-19</h2>\n\n<p>We will continue to work together to use all available policy tools to support an inclusive, effective and sustained response to COVID-19, minimising its impact on people’s livelihoods.&nbsp; We recognise the need to enhance stimulus measures that facilitate economic recovery and job creation.&nbsp; In facilitating economic recovery, we underscore the importance of improving fiscal sustainability and transparency to support long-term resilient economic growth and future financing needs.&nbsp; We acknowledge the need to support developing economies in combatting COVID-19.&nbsp; We also welcome the recent establishment of a digital platform for coordinated information sharing on policy responses related to COVID-19. We commend the varied and continued efforts as well as the contribution of additional resources across APEC to combat the pandemic and support workers and sectors through the economic recovery process.</p>\n\n<p>We will cooperate to facilitate the movement of essential goods and services, as well as the essential movement of people in a safe manner, identifying and resolving unnecessary barriers to trade and strengthening the resilience of our supply chains. We recognise the importance of working together to ensure trade and investment can continue to flow in these trying times.&nbsp; We are encouraged by the implementation of measures that facilitate trade and urge Economies to ensure emergency trade measures designed to tackle COVID-19 are consistent with World Trade Organisation (WTO) rules.</p>\n\n<p>We recognise that science, technology and innovation are important to the region’s post-COVID-19 recovery.&nbsp; We reaffirm the need to cooperate constructively on COVID-19 including the research and development, production, manufacturing and distribution of diagnostic tests, essential medical products and services, therapeutics and vaccines. We highlight the importance of facilitating equitable access to safe, quality, effective and affordable vaccines and other medical countermeasures that are vital to safeguard people’s health and well-being, while incentivising innovation. We acknowledge that the role of extensive immunisation against COVID-19 is critical in order to bring the pandemic to an end.</p>\n\n<p>We recognise the importance of the development and contribution of digital technologies in safeguarding people’s health and protecting the region from health threats, and enhancing resilience, scalability and sustainability of health systems, thereby moving towards universal health coverage.</p>\n\n<h2>APEC Putrajaya Vision 2040</h2>\n\n<p>We proclaim the APEC Putrajaya Vision 2040, a new vision that primarily charts the future of our region.&nbsp; Our Vision is an open, dynamic, resilient and peaceful Asia-Pacific community by 2040, for the prosperity of all our people and future generations.&nbsp; We task our Senior Officials to complete a comprehensive implementation plan for our consideration in 2021.</p>\n\n<h2>Improving the Narrative of Trade and Investment</h2>\n\n<p>We welcome the significant progress made under the Bogor Goals, including the final review of APEC’s Progress towards the Bogor Goals, in facilitating trade and investment, and recognise more needs to be done in fostering an enabling environment for trade and investment in the Asia-Pacific region.</p>\n\n<p>We recognise the importance of a free, open, fair, non-discriminatory, transparent and predictable trade and investment environment to drive economic recovery at such a challenging time. In this regard, we reaffirm our support for agreed-upon rules of the WTO in promoting the stability and predictability of international trade flows. We take note of the call of the APEC Business Advisory Council (ABAC) for APEC to continue supporting the multilateral trading system.&nbsp;</p>\n\n<p>We will continue to support the on-going work at the WTO, including through its necessary reform aimed to improve its functioning, and will continue to work on appropriate capacity building initiatives to implement WTO agreements. We call for expedited progress in the on-going WTO negotiations on fisheries subsidies.&nbsp; APEC member participants in Joint Statement Initiatives (JSI) call for progress in the lead-up to the 12th WTO Ministerial Conference (MC12), recognising the e-commerce initiative is particularly important in supporting COVID-19 recovery.</p>\n\n<p>We will further advance the economic integration in the region, in a manner that is market-driven, including through the work on the Free Trade Area of the Asia-Pacific (FTAAP) agenda, which will contribute to high quality and comprehensive regional undertakings. We underscore the importance of improving regional connectivity through quality infrastructure development and investment based upon relevant APEC work.</p>\n\n<h2>Inclusive Economic Participation through Digital Economy and Technology</h2>\n\n<p>Innovation and digitalisation enable governments, businesses and people to carry out their activities and empower inclusive economic participation by all.&nbsp; We will foster an enabling environment for the development of the digital economy, including to open new opportunities for Micro, Small and Medium Enterprises (MSMEs). We aim to promote innovative technologies and foster a reliable, interoperable, open, accessible and secure ICT environment, narrow the existing digital, skills and regulatory gaps, and encourage development in digital infrastructure and transformation. We acknowledge the importance of cooperation in facilitating the flow of data and strengthening consumer and business trust in digital transactions.</p>\n\n<p>We recognise the disproportionate impacts of COVID-19 on MSMEs, women and others with untapped economic potential.&nbsp; We intend to pursue inclusive economic policies that support their recovery and growth through effective and equal participation in economic activities and opportunities to contribute to economic recovery efforts.&nbsp; We support and welcome the implementation of the La Serena Roadmap for Women and Inclusive Growth.</p>\n\n<p>COVID-19 has transformed the way we work and accelerated the transitions to the future of work setting.&nbsp; We recognise the need for continued structural reforms to improve the ways of doing business and unleash economic prosperity for our people, including accelerating cooperation on digital literacy and skills development to harness technological transformation, and encouraging the use of digital technology to resolve cross-border business-to-business disputes.&nbsp; We aim to advance efforts to promote human resource development, and strengthen economic and technical cooperation, to ensure all affected economic sectors and workers are afforded appropriate support in expediting their economic recovery.&nbsp; We are encouraged by the broader on-going efforts on economic, financial and social inclusion that contribute to narrowing the gap in economic development, and advance the well-being for all, in support of global efforts, including the 2030 Agenda for Sustainable Development.</p>\n\n<h2>Driving Innovative and Inclusive Sustainability</h2>\n\n<p>We will foster comprehensive quality growth and advance work to this effect, including on the APEC’s human security agenda, in order to recover from COVID-19. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>We reaffirm our support for economic and technical cooperation, as well as structural reforms, that drive innovation, productivity and sustainable growth.&nbsp; We encourage inclusive recovery from COVID-19 that increases employment and economic activity.&nbsp; Recognising the impact of COVID-19 on global food supply chains, we will work to ensure food security through sufficient, safe, and nutritious food that continues to be available and accessible to people across the region, while reducing food loss and waste.&nbsp;</p>\n\n<p>We will collaborate to facilitate access to affordable energy, enhance energy resilience and energy security using the widest variety of fuels and technologies to support sustainable economic growth and promote transitions to cleaner energy as part of a strong and inclusive economic recovery.</p>\n\n<p>We are hopeful that new technologies are available and accessible to allow us to handle resources and waste more sustainably, and in a holistic manner.&nbsp; We will promote economic policies and growth that support global efforts to tackle climate change, extreme weather and natural disasters, and strengthen emergency preparedness.</p>\n\n<h2>Strengthening Stakeholder Engagement</h2>\n\n<p>We note the recommendations from ABAC and welcome partnership with the private sector to support efforts towards economic recovery.&nbsp; We also welcome the contributions of the Pacific Economic Cooperation Council, and the value that the ASEAN Secretariat, Pacific Islands Forum, stakeholders, and other international and regional organisations bring to APEC.</p>\n\n<p>We welcome the outcomes of the APEC Ministerial Meeting as well as Sectoral Ministerial Meetings for Trade, Health, Finance, Women and the Economy, Small and Medium Enterprises, and Food Security.</p>\n\n<p>We thank Malaysia for its able leadership in this particularly challenging year.&nbsp; We look forward to New Zealand’s chairing in 2021.&nbsp;&nbsp;</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/11/20/apec-putrajaya-vision-2040\">APEC Putrajaya Vision 2040</a></li>\n</ul></div>\n      "
}