{
  "path": "/en/news/statements/2019/04/07/statement-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</p>\n\n<p>“Today, as we celebrate <a href=\"https://www.who.int/\">World Health Day</a> and the founding of the World Health Organization, we are reminded of our shared responsibility to promote and advocate for better health care access around the world.</p>\n\n<p>“Since its creation in 1948, the World Health Organization has played a crucial role in supporting global health initiatives and raising awareness of international health concerns. This year, they continue to focus on universal health coverage, recognizing that everyone has the right to access essential health services without discrimination or financial hardship.</p>\n\n<p>“We have made great strides as a global community, but there is still more to be done to make sure everyone has access to the health services they need.</p>\n\n<p>“Here at home, Canadians are proud of our health care system, which provides care based on need and not the ability to pay. The Government of Canada is working hard to find new ways to improve our system, respond quickly to new and emerging health concerns, and address disparities in access to health services – particularly those facing Indigenous peoples – across the country.</p>\n\n<p>“With Budget 2019, the Government of Canada, in partnership with provinces, territories, Indigenous peoples, and stakeholders, is taking important first steps to implement national pharmacare. These steps – creating a Canadian Drug Agency, developing a national formulary, and establishing a strategy for high-cost drugs for rare diseases – will go a long way to make prescription drugs more affordable and accessible for more Canadians.</p>\n\n<p>“The Government of Canada will continue to take action to help all Canadians get the medicine and support they need when they need it. Advocating for universal health coverage is not only an investment in people, but also in the future of Canada. When everyone has access to affordable health care, we have healthier families, stronger communities, and a thriving country for generations to come.”</p></div>\n      "
}