{
  "path": "/en/news/statements/2022/10/25/statement-prime-minister-welcoming-new-prime-minister-united-kingdom",
  "pageTitle": "Statement by the Prime Minister welcoming new Prime Minister of the United Kingdom Rishi Sunak | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the new Prime Minister of the United Kingdom, Rishi Sunak:</p>\n\n<p>“On behalf of the Government of Canada, I extend my congratulations to the United Kingdom’s new Prime Minister, Rishi Sunak.</p>\n\n<p>“Canada’s partnership with the United Kingdom, one of the strongest relationships between any two countries in the world, is defined by our rich shared history, our close friendship, and an unwavering commitment to human rights, democracy, and the rules-based international order. This includes our close partnership through the United Nations, international financial institutions, and other multilateral organizations. We are the only two countries to be members of the Commonwealth, North Atlantic Treaty Organization, G7, and G20.</p>\n\n<p>“I look forward to working with Prime Minister Sunak to strengthen this relationship as we continue to address ongoing global concerns, including Russia’s illegal and unjustifiable invasion of Ukraine, economic uncertainty, and climate change. I also look forward to collaborating with Prime Minister Sunak to bolster our important economic relationship as we negotiate a comprehensive, ambitious, and inclusive Canada-United Kingdom Free Trade Agreement, as well the U.K.’s accession to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership. Together, we will remain focused on creating good middle-class jobs and opportunities for businesses on both sides of the Atlantic, while driving economic growth that benefits everyone.</p>\n\n<p>“I wish Prime Minister Elizabeth Truss all the best in her future endeavours.”</p></div>\n      "
}