{
  "path": "/en/news/news-releases/2018/03/29/inuit-gavamakkut-piliriqatigiinninginnut-katimajiralaangujut",
  "pageTitle": "ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᑲᔪᓯᑦᑎᐊᖅᑎᑦᑎᔪᑦ ᓯᕗᓪᓕᐅᑎᖃᑎᒌᒃᑕᒥᓂᒃ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ, ᔭᔅᑎᓐ ᑐᕈᑑ, ᐅᓪᓗᒥ ᑲᑎᒪᖃᑎᒋᖅᑲᐅᕙᖏᑦ ᐃᓚᒋᔭᐅᔪᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᐊᖃᖃᑎᒌᖕᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᕿᒥᕐᕈᓂᕐᒧᑦ ᑲᔪᓯᑦᑎᐊᕐᓂᕆᔭᐅᔪᓂᒃ ᑕᐃᒪᙵᓂᑦ ᑲᑎᒪᔨᕋᓛᖅᑕᖃᓕᓚᐅᖅᑎᓪᓗᒍ ᐊᕐᕌᓂ ᐅᖃᓪᓚᖃᑎᒌᖕᓂᕐᒧᓪᓗ ᖃᓄᐃᓕᐅᖅᑐᖃᕆᐊᖃᕐᒪᖔᑦ ᓯᕗᒻᒧᒃᐹᓪᓕᕐᓂᖓᓄᑦ ᐋᖅᑭᐅᒪᖃᑎᒌᒃᐸᓪᓕᐊᓂᐊᕐᓂᕆᔭᑦᑎᓐᓄᑦ.</p><p>ᑲᑎᒪᑎᓪᓗᒋᑦ, ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ ᐃᓄᐃᓪᓗ ᓯᕗᓕᖅᑏᑦ ᐃᓱᒪᒃᓴᖅᓯᐅᕈᑎᒋᔭᖃᓚᐅᖅᐳᑦ ᐱᒻᒪᕆᐅᓪᓗᑎᒃ ᑲᔪᓯᑦᑎᐊᕐᓂᕆᔭᐅᔪᓂᒃ ᓴᙱᒃᑎᒋᐊᖅᑎᑕᐅᓂᖓᓄᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᖕᓂᖏᓐᓄᑦ ᐊᒻᒪᓗ ᑐᕌᕆᔭᐅᓂᖏᓐᓄᑦ ᐱᒻᒪᕆᐅᓪᓗᑎᒃ ᐃᓅᖃᑎᒌᖕᓂᕐᒧᑦ, ᑮᓇᐅᔭᓕᐅᕈᓐᓇᕐᓂᕐᒧᑦ, ᐃᓕᖅᑯᓯᓕᕆᓂᕐᒧᑦ ᐊᕙᑎᓕᕆᓂᕐᒧᓪᓗ ᐱᔾᔪᑕᐅᔪᑦ. ᑖᒃᑯᓇᙵᑦ ᑎᑭᐅᑎᔭᐅᑦᑎᐊᖅᑐᓄᑦ ᐃᓚᒋᔭᐅᕗᑦ:</p><ul><li>ᐊᑯᓂᐅᔪᒧᑦ ᑮᓇᐅᔭᖅᑖᖅᑎᑦᑎᖃᑦᑕᕐᓂᖅ ᐃᑲᔪᖅᓱᖅᑕᐅᓂᖓᓄᑦ ᓄᓇᕗᒻᒥᐊᒻᒪᓗ ᐃᓄᖕᓄᑦ ᑐᑭᒧᐊᒃᑎᑕᐅᔪᒥᒃ ᐃᒡᓗᓕᕆᓂᕐᒧᑦ ᐸᕐᓇᐅᑎ ᐃᓄᐃᑦ ᓄᓇᖏᓐᓄᑦ ᓄᓇᕕᖕᒥ, ᓄᓇᑦᓯᐊᕙᒻᒥ, ᐊᒻᒪᓗ ᐃᓄᕕᐊᓗᐃᑦ ᓄᓇᖏᓐᓄᑦ.</li><li>ᐳᕙᒡᓗᖕᓂᖅ ᐱᑕᖃᕈᓐᓃᖅᑎᑕᐅᓂᐊᕐᓂᕋᖅᑕᐅᓂᖓ ᐃᓄᐃᑦ ᓄᓇᖏᓐᓂ ᐊᕐᕌᒍᖓ 2030 ᑎᑭᓚᐅᖅᑎᓐᓇᒍ, ᑲᑦᑐᖅᓯᒋᐊᖅᑎᑕᐅᓛᕐᓂᕋᖅᑕᐅᓂᖓᓗ ᐳᕙᒡᓗᖕᓂᖅ ᐊᒃᓱᓪᓘᓐᓃᑦ ᓇᑉᐸᓪᓗᐊᖏᓐᓂᒃ ᐊᕐᕌᒍᖓ ᑎᑭᓚᐅᖅᑎᓐᓇᒍ 2025.</li><li>ᑲᔪᓯᑦᑎᐊᕐᓂᖓ ᐃᓄᐃᑦ ᓄᑕᖅᑲᑦ ᐃᓕᑦᑎᓂᕐᒧᑦ ᐸᐃᕆᔭᐅᓂᖏᓐᓄᑦ ᐸᕐᓇᐅᑎ, ᓴᖅᑭᔮᖅᑎᑦᑎᓇᔭᖅᖢᓂ ᐊᔾᔨᐅᙱᑦᑐᑦ ᐱᔭᕆᐊᓕᖏᑦ ᐊᒻᒪᓗ ᓯᕗᓪᓕᖅᐸᐅᑎᔭᐅᔭᕆᐊᓖᑦ ᐃᓄᐃᑦ ᓄᑕᖅᑲᖏᓐᓄᑦ ᐃᓚᔮᕇᓄᓪᓗ.</li><li>ᑲᔪᓯᑦᑎᐊᕐᓂᖓ ᓄᑖᖑᔪᖅ ᐅᑭᐅᖅᑕᖅᑑᑉ ᐊᑐᐊᒐᒃᓴᖓᓄᑦ ᐋᖅᑭᐅᒪᔪᖅ, ᐃᓚᐅᑉᓗᓂ ᐱᖁᑎᓂᒃ ᑕᒪᒃᑯᓄᙵᓗ ᐱᔭᕆᐊᖃᖅᑐᑦ, ᐃᓄᐃᑦ ᓄᓇᖓᓐᓂᕐᒥᐅᑕᐃᑦ ᐊᒻᒪᓗ ᒐᕙᒪᐅᔪᓂᑦ ᐃᓱᒪᓕᐅᖅᑲᐅᑕᐅᔭᕆᐊᖃᖅᑐᒦᓐᓂᖓᓐᓄᑦ ᓯᕗᓂᒃᓴᖓᑕ ᓄᓇᖓᓐᓄᑦ.</li></ul><p>ᓯᕗᓕᐅᖅᑏᑦ ᐅᖃᐅᓯᖃᓚᐅᖅᑐᑦ ᖃᓄᖅ ᐱᕈᐃᑎᑦᑎᓂᕐᒥᒃ ᐊᕐᕌᓂ ᐱᒋᐊᕐᓂᕆᓚᐅᖅᑕᖓᑦ ᑲᔪᓯᑎᓪᓗᒍ ᓯᕗᒻᒧᒋᐊᖅᑎᒃᑲᓐᓂᕐᓗᒋᑦ ᐱᒻᒪᕆᐅᔪᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᔭᐅᔭᕆᐊᖃᖅᑐᑦ ᐊᒻᒪᓗ ᐊᑐᐊᒐᐃᑦ. ᑲᑎᒪᔨᕋᓛᒃᑯᑦ ᐊᖏᕈᑎᖃᓚᐅᖅᑐᑦ ᐱᓕᕆᐊᕆᓗᒋᑦ 7-ᖑᔪᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᔭᐅᔪᒪᔪᑦ ᓴᖅᑭᑕᐅᓚᐅᖅᑐᑦ ᐊᕐᕌᓂ ᐊᒻᒪᓗ ᐃᓚᓯᓗᓂ ᐊᕙᑎᓕᕆᓂᕐᒧᑦ ᐊᒻᒪᓗ ᓯᓚᐅᑉ ᐊᓯᔾᔨᖅᐸᓪᓕᐊᓂᖓᓅᖓᔪᓂᒃ ᑖᒻᓇ ᓄᑖᖑᓗᓂ. ᑕᐅᑐᒐᐅᔪᖅ ᓄᑖᒧᑦ ᓯᕗᓪᓕᖅᐸᐅᑎᔭᐅᖅᑲᐅᑕᐅᔪᒪᔪᓄᑦ ᓄᓇᖃᖅᑲᖅᑐᑦ ᒥᐊᓂᕆᔭᐅᓂᖓᓃᓐᓂᐊᖅᑐᖅ ᐊᒻᒪᓗ ᐊᓯᐅᔨᑦᑕᐃᓕᔭᐅᔪᓂᑦ, ᓄᓇᖃᖅᑳᖅᑐᑦ ᒥᐊᓂᖅᓯᓂᕐᒧᑦ ᑐᕌᒐᖅ, ᐊᒻᒪᓗ ᖃᓄᐃᓕᐅᕆᐊᕐᓗᑎᒃ ᓯᓚᐅᑉ ᐊᓯᔾᔨᖅᐸᓪᓕᐊᓂᖓᓄᑦ. ᓯᕗᓕᐅᖅᑏᑦ ᓇᓗᓇᐃᓚᐅᕐᒥᔪᑦ ᐊᑐᓕᖅᑎᑕᐅᓗᒃᑖᕐᓂᖓᓄᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᓄᓇᑖᕐᓂᕐᒧᑦ ᐊᖏᖃᑎᒌᒍᑏᑦ ᐊᒻᒪᓗ ᓄᓇᕐᔪᐊᕐᒧᑦ ᑲᑐᔾᔨᖃᑎᒌᑦ ᐅᖃᕐᓂᕋᐅᑎᖓᑦ ᐱᔪᖕᓇᐅᑎᖃᕐᓂᖓᓄᑦ ᓄᓇᖃᖅᑳᖅᑐᐃᑦ ᐃᓚᒋᔭᐅᔭᕆᐊᖃᕐᒪᑕ ᐋᖅᑭᖃᑎᒌᖕᓂᕐᒧᑦ. ᐊᒻᒪᓗ ᓯᕗᓕᐅᖅᑏᑦ ᑲᔪᓯᑎᓐᓂᐊᖅᑕᖓᑦ ᓯᕗᒻᒧᒃᑎᓪᓗᒍ ᐅᖃᐅᓯᐅᑉ ᒥᒃᓵᓄᑦ ᐱᔪᖕᓇᐅᑎᖏᑦ ᐃᓄᐃᑦ ᐊᓯᐊᖑᓗᓂ ᐱᔭᕆᐊᖃᒻᒪᕆᒃᑐᖅ ᐃᓚᒋᔭᐅᓗᓂ ᐋᕿᖃᑎᒌᖕᓂᕐᒧᑦ.</p><p>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᐱᓕᕆᖃᑦᑕᖅᓯᒪᓂᕆᔭᖏᑦ ᓴᖅᑭᔮᖅᑎᑦᑎᔪᑦ ᓄᑖᙳᖅᑎᑕᐅᔪᖅ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᖕᓂᖏᓐᓄᑦ ᐊᒻᒪᓗ ᐋᖅᑭᖃᑎᒌᖕᓂᐊᕐᓗᑎᒃ ᐊᑐᕐᓗᒋᑦ ᐃᓕᑕᕆᔭᐅᓂᖏᑦ ᐊᒻᒪᓗ ᐃᒃᐱᒍᓱᖕᓂᕆᔭᐅᔪᑦ ᐃᓄᖕᓄᑦ ᓯᕗᓪᓕᖅᐸᐅᑉᓗᑎᒃ ᑲᓇᑕᒥᐅᑕᐃᑦ, ᑲᓇᑕᒥᐅᑕᐃᑦ ᓯᕗᓪᓕᖅᐹᒥᑦ.</p><h2>ᐅᖃᖅᑕᐅᓯᒪᔪᑦ</h2><blockquote><p>“ᐅᓪᓗᒥ ᑲᑎᒪᖃᑎᒋᔭᐅᖅᑲᐅᓂᖏᑦ ᐃᓄᐃᑦ ᓯᕗᓕᖅᑏᑦ ᐱᓕᕆᑦᑎᐊᕐᓇᖅᑲᐅᕗᖅ ᑲᔪᖏᕐᓇᖅᑲᐅᓪᓗᓂᓗ. ᑲᔾᔮᕐᓇᖅᑐᐊᓘᕗᖅ ᑕᑯᓪᓗᓂ ᐱᓕᕆᐊᕆᔭᐅᓯᒪᓚᐅᖅᑐᓂᒃ ᐊᕐᕌᒎᓚᐅᖅᑐᒥᒃ ᐃᓱᒪᒃᓴᖅᓯᐅᑦᑎᐊᕈᑕᐅᓪᓗᑎᒃ ᑐᑭᖃᑦᑎᐊᖅᖢᑎᒡᓗ ᐋᖅᑭᒋᐊᕈᑎᒃᓴᖅᓯᐅᕐᓂᕐᒧᑦ ᐊᔾᔨᐅᙱᑦᑐᓄᑦ ᐱᔾᔪᑕᐅᕙᒃᑐᓄᑦ ᐃᓄᖕᓄᑦ. ᑲᑎᙵᓗᑕ, ᐱᔭᕆᐊᖃᖅᑕᑦᑎᓐᓂᒃ ᐊᓯᔾᔨᖅᑎᑦᑎᔪᓐᓇᕐᓂᕆᔭᑦᑎᓐᓄᑦ ᐊᓯᔾᔨᖅᑎᑦᑎᓪᓚᑦᑖᕐᓂᐊᕋᑦᑕ ᐃᓄᖕᓄᑦ, ᑲᓇᑕᒥᐅᑕᓗᒃᑖᕐᓂᒃ ᐃᑲᔪᕋᔭᖅᖢᓂ.”<br> — <cite>ᐅᐱᓐᓇᖅᑐᖅ ᔭᔅᑎᓐ ᑐᕈᑑ, ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ</cite></p></blockquote><blockquote><p>“ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᖕᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᑲᑎᑎᑦᑎᖃᑦᑕᖅᑐᑦ ᐃᓅᔪᓂᒃ ᓯᕗᓕᐅᖅᑎᓂᒃ ᐊᒻᒪᓗ ᑲᓇᑕᐅ ᒐᕙᒪᒃᑯᖏᓐᓂᒃ ᐱᒋᐊᕐᓂᐊᕐᓗᑎᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᔭᐅᔭᕆᐊᖃᖅᑐᓂᒃ ᐱᐅᓯᒋᐊᖅᓯᓂᐊᖅᑐᓂᒃ ᐃᓅᓯᖏᓐᓄᑦ ᐃᓅᔪᑦ. ᐱᕙᓪᓕᐊᓂᖃᑦᑎᐊᖅᓯᒪᔪᒍᑦ ᓯᕗᓪᓕᖅᐹᖅ ᐅᑭᐅᖑᔪᒥᑦ ᐊᒻᒪᓗ ᑲᔪᓯᑉᓗᓂ ᐱᕈᐃᑎᓐᓂᖓ ᐊᒻᒪᓗ ᐱᐅᓯᒋᐊᕐᓂᖓ ᑖᑉᓱᒪ ᐱᓕᕆᖃᑎᒌᖕᓂᐅᔫᑉ ᐱᐅᓛᒃᑯᑦ ᓯᕗᒻᒧᒃᓯᒪᔪᒧᑦ ᐃᓅᔪᑦ ᐱᔪᖕᓇᐅᑎᖏᓐᓄᑦ ᐊᒻᒪᓗ ᓴᖅᑭᑦᑎᓗᑕ ᐱᐅᓂᖅᓴᐅᔪᒥᒃ ᑲᓇᑕᒥᒃ ᓇᐅᒃᑯᓗᒃᑖᖅ.”<br>— <cite>ᐊᖓᔪᖅᑳᖅ ᓇᑖᓐ ᐅᐱᑦ, ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ</cite></p></blockquote><h2>ᓇᐃᑦᑐᑦ ᓱᓕᔪᑦ</h2><ul><li>ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ ᐱᑕᖃᓕᖅᑎᑕᐅᓚᐅᖅᑐᑦ ᕕᕗᐊᕆ 2017ᒥ ᑐᙵᕕᖃᖅᑎᑕᐅᓚᐅᖅᖢᓂᓗ ᐅᒃᐱᕆᔭᐅᔪᒥᒃ ᓇᓕᒧᒌᒃᑐᒥᒃ ᐱᓕᕆᖃᑎᒌᑦᑎᐊᖃᑦᑕᕐᓂᖏᑦ ᐃᓄᐃᓪᓗ ᒐᕙᒪᒃᑯᓪᓗ ᐱᑕᖃᕆᐊᖃᕐᓂᖓᓂᒃ ᐋᖅᑭᐅᒪᖃᑎᒌᒃᐸᓪᓕᐊᓂᕐᒧᑦ.</li><li>ᑲᑎᒪᔨᕋᓛᖑᔪᓄᑦ ᐃᓚᒋᔭᐅᕗᑦ ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ ᐊᒥᓱᓪᓗ ᒐᕙᒪᑐᖃᒃᑯᓐᓂ ᒥᓂᔅᑕᒋᔭᐅᔪᑦ, ᐊᖓᔪᖅᑳᖅ ᓇᑖᓐ ᐅᐱᑦ ᐱᔾᔪᔾᔨᓪᓗᓂᒋᑦ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ, ᐃᒃᓯᕙᐅᑕᖅ/CEO ᑐᐃᓐ ᔅᒥᑦ ᐱᔾᔪᔾᔨᓪᓗᓂᒋᑦ ᐃᓄᕕᐊᓗᐃᑦ ᐊᕕᒃᓯᒪᔪᒧᑦ ᑯᐊᐸᕇᓴᖓ, ᐊᖓᔪᖅᑳᖅ ᐊᓗᑭ ᑰᑦᑎᖅ ᐱᔾᔪᔾᔨᓪᓗᓂ ᓄᓇᕗᑦ ᑐᙵᕕᒃᑯᓐᓂᒃ, ᐊᖓᔪᖅᑳᖅ ᓵᓕ ᐅᐊᑦ ᐱᔾᔪᔾᔨᓪᓗᓂ ᒪᑭᕕᒃ ᑯᐊᐸᕇᓴᒃᑯᓐᓂᒃ, ᐊᒻᒪᓗ ᐊᖓᔪᖅᑳᖅ ᔪᕼᐋᓇᔅ ᓛᒻᑉ ᐱᔾᔪᔾᔨᓪᓗᓂ ᓄᓇᑦᓯᐊᕗᑦ ᒐᕙᒪᖓᓂᒃ.</li><li>ᑲᑎᒪᔨᕌᓛᓄᑦ ᐃᓚᒋᔭᐅᕗᑦ ᐊᖓᔪᖅᑳᖏᑕ ᑲᓇᑕᒥ ᐃᓄᐃᑦ ᒪᒃᑯᒃᑐᑦ ᑲᑎᒪᔨᕋᓛᓄᑦ, ᐸᐅᒃᑑᑎᑦ ᐃᓄᖕᓄᑦ ᐊᕐᓇᓄᑦ ᑲᓇᑕᒥ, ᐊᒻᒪᓗ ᐃᓄᐃᑦ ᐅᑭᐅᖅᑕᖅᑐᕐᒥᐅᑦ ᑲᑎᒪᔨᕐᔪᐊᖏᓐᓄᑦ ᑲᓇᑕᒥ ᖁᙱᐊᖅᑎᐅᓪᓗᑎᒃ.</li></ul><h2>ᐊᒃᑐᐊᔪᑦ ᑲᓱᕐᕖᑦ</h2><ul><li><a href=\"/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ ᐊᒻᒪᓗ ᐊᖓᔪᖅᑳᖓᑕ ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ ᓂᓪᓕᐅᑎᒋᕚ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ </a></li><li><a href=\"/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">ᐃᓄᐃᑦ ᓄᓇᖓᑦ-ᑯᑦ ᐅᖃᕐᓂᕋᐅᑎᖓ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ</a></li><li><a href=\"https://itk.ca/inuit-crown-partnership-committee-advances-agenda/\">ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᖕᓂᕐᒧᑦ ᑲᑎᒪᔨᕋᓛᒃᑯᑦ ᓯᕗᒻᒧᒃᓯᒪᓂᖓᓐᓄᑦ ᑲᑎᒪᔾᔪᑎᒃᓴᖅ</a></li><li><a href=\"https://www.pc.gc.ca/en/culture/autochtones-indigenous/gardiens-guardians\">ᓄᓇᖃᖅᑳᖅᑐᑦ ᒥᐊᓂᖅᓯᓂᕐᒧᑦ ᑐᕌᖓᔪᑦ</a></li></ul></div>\n      "
}