{
  "path": "/en/news/statements/2022/07/23/statement-prime-minister-39th-anniversary-black-july",
  "pageTitle": "Statement by the Prime Minister on the 39th anniversary of Black July | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 39th anniversary of Black July:</p>\n\n<p>“Today, we remember those who lost their lives or were displaced during the horrific and violent events of Black July.</p>\n\n<p>“In July 1983, anti-Tamil pogroms erupted in Colombo, following decades of unrest and rising tensions across the country. Known as Black July, these deadly events triggered an armed conflict that lasted 26 years, cost tens of thousands of lives, destroyed homes and businesses owned by Tamils, and sent hundreds of thousands into exile.</p>\n\n<p>“In the months that followed the events of Black July, the Government of Canada implemented a Special Measures program to respond to the violence in Sri Lanka, which helped more than 1,800 Tamils resettle in Canada. I have had the privilege of meeting many Tamil Canadian survivors of Black July and have been moved by their harrowing experiences of loss, displacement, and resilience. Canada is now home to one of the largest Tamil diasporas in the world, and we thank Tamil Canadians for contributing so greatly to making Canada the strong, vibrant, and inclusive place it is today.</p>\n\n<p>“Today, we acknowledge the people of Sri Lanka, who are suffering during this current economic and political crisis. Following the recent election of the new president, Ranil Wickremesinghe, by the Sri Lankan parliament, Canada strongly encourages Sri Lanka’s government to promote democracy and human rights and maintain the rule of law as it works to address this crisis, and undertake the necessary reforms for a peaceful, prosperous, and reconciled Sri Lanka. Canada also reiterates the need to ensure that the rights to protest and a free press are protected during these difficult times.</p>\n\n<p>“On this day, our thoughts are with all those who suffered and lost family, friends, and neighbours during Black July and the conflict that followed. We are committed to working together to help build a better future for everyone.”</p></div>\n      "
}