{
  "path": "/en/news/news-releases/2017/07/14/prime-minister-announces-action-british-columbia-wildfires",
  "pageTitle": "Prime Minister announces action on British Columbia wildfires | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada will do its utmost to help the people of British Columbia facing the immediate and long-term impacts of destructive wildfires.</p><p>That is why the Prime Minister, Justin Trudeau, today announced the creation of a new ad hoc Cabinet committee to coordinate federal efforts to help the many communities affected by the wildfires raging through British Columbia.</p><p>The Ad Hoc Cabinet Committee on Federal Recovery Efforts for 2017 BC Wildfires will meet as required to advise on the Government of Canada’s role in mitigation, recovery, and rebuilding efforts in response to the wildfires. The Committee will complement the on-the-ground efforts coordinated by the Government Operations Centre.</p><p>The Government of Canada will stand with British Columbians every step of the way as they deal with the devastation caused by these wildfires, and start to rebuild their communities.</p><h2>Quote</h2><blockquote><p>“Our thoughts are with all British Columbians dealing with the devastating impacts of these wildfires. Our new Cabinet committee will work hard to address both the immediate and long-term needs of all the families, communities and businesses affected. I would like to thank the first responders, members of the Canadian Armed Forces, and all those working around the clock to help those affected by the wildfires. You represent the best of Canada.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Fact</h2><ul><li>The ad hoc Cabinet Committee will comprise:<ul><li>The Hon. Carla Qualtrough, Minister of Sports and Persons with Disabilities (Chair)</li><li>The Hon. Karina Gould, Minister of Democratic Institutions (Vice-Chair)</li><li>The Hon. Carolyn Bennett,&nbsp; Minister of Indigenous and Northern Affairs</li><li>The Hon. Jean-Yves Duclos, Minister of Families, Children and Social Development</li><li>The Hon. Ralph Goodale, Minister of Public Safety and Emergency Preparedness</li><li>The Hon. Kent Hehr, Minister Veterans Affairs and Associate Minister of National Defence</li><li>The Hon. Harjit S. Sajjan, Minister of National Defence</li><li>The Hon. Jody Wilson-Raybould, Minister of Justice and Attorney General of Canada</li></ul></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/wildfires-in-british-columbia.html\">Wildfires in British Columbia</a></li><li><a href=\"http://www.redcross.ca/\">Canadian Red Cross</a></li></ul></div>\n      "
}