{
  "path": "/en/news/news-releases/2019/04/19/prime-minister-japan-shinzo-abe-visit-canada",
  "pageTitle": "Prime Minister of Japan Shinzo Abe to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that the Prime Minister of Japan, Shinzo Abe, will visit Canada from April&nbsp;27&nbsp;to 28, 2019.</p>\n\n<p>During the visit, Prime Minister Trudeau and Prime Minister Abe will meet to deepen the strong and historic bonds between our two countries. Their discussions will focus on the upcoming G20 Summit in Osaka, and finding ways to strengthen the Canada-Japan relationship. They will also discuss the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which is already creating new opportunities and jobs for people on both sides of the Pacific.</p>\n\n<p>In addition, the two leaders will explore how our countries can work more closely together to create economic growth that benefits everyone and promote democracy and the rule of law around the world.</p>\n\n<p>The two leaders will hold a bilateral meeting followed by a joint media availability.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Japan are close friends and allies who share not only many common values, but many common priorities. Our commitment to progressive trade is already delivering benefits for Canadians and Japanese people alike, with the CPTPP now in force between our two countries. Prime Minister Abe’s visit is a chance to further strengthen our economic ties, and create even more opportunities for people on both sides of the Pacific.”<br>\n—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau most recently met with Prime Minister Abe at the Asia-Pacific Economic Cooperation Leaders’ Meeting held in Papua New Guinea from November 17 to November 18, 2018.</li>\n\t<li>Japan is Canada’s fourth-largest partner in two-way merchandise trade and Canada’s largest source of bilateral foreign direct investment from Asia.</li>\n\t<li>Trade and economic relations between Canada and Japan have been steadily expanding. Japan is the world’s third-largest national economy with a gross domestic product of $6.4 trillion.</li>\n\t<li>Canada and Japan are partners in the CPTPP. The CPTPP entered into force for the first six countries to ratify the Agreement, including Canada and Japan, on December 30, 2018.</li>\n\t<li>Canada and Japan are members of the G7, the G20, the Asia-Pacific Economic Cooperation forum, the Asian Development Bank, the International Monetary Fund, and the Organisation for Economic Co-operation and Development.</li>\n\t<li>Canada and Japan are strong allies in supporting the rules-based multilateral system and are key partners in ongoing World Trade Organization reform efforts, including through the Ottawa Group.</li>\n\t<li>On May 1, 2019, when Emperor Akihito's eldest son, Naruhito, is expected to ascend to the throne as the 126th Emperor of Japan, the country will enter a new Imperial era named Reiwa, signifying “beautiful harmony”.</li>\n\t<li>In 2017, the stock of Japanese direct investment in Canada stood at $29.6 billion.</li>\n\t<li>There are over 120,000 people of Japanese origin residing in Canada and approximately 300,000 Japanese and Canadians travel to each other’s country annually.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n</ul></div>\n      "
}