{
  "path": "/en/news/statements/2021/12/03/g7-leaders-statement-partnership-infrastructure-and-investment",
  "pageTitle": "G7 Leaders Statement Partnership for Infrastructure and Investment | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>At the Carbis Bay Summit in June 2021, we, the Leaders of the Group of Seven, committed to an ambitious agenda to<strong> build back better for the world and urgently narrow the infrastructure investment gap</strong> in developing countries, by <strong>delivering a step change in our approach to financing</strong> quality and sustainable infrastructure that ensures a strong recovery from the pandemic and rapid progress towards the Sustainable Development Goals and international climate and environment commitments, including those recently made at COP26.</p>\n\n<p>Low- and middle-income countries need to expand infrastructure investment to address climate change and support their transition to <strong>net zero emissions,<a href=\"#_ftn1\" name=\"_ftnref1\" title=\"\" id=\"_ftnref1\"><sup><strong><sup>[1]</sup></strong></sup></a> </strong>and for<strong> health and health security</strong> infrastructure; <strong>digital, transport and energy </strong>connectivity; <strong>education </strong>infrastructure; and advancing <strong>gender equity</strong> and the fight against<strong> </strong>inequality. To help overcome this global challenge, we will scale up our collective action to<strong> mobilise private sector capital and expertise</strong>, using every tool in our respective development and economic toolboxes, and <strong>strengthen our partnerships </strong>with developing countries.</p>\n\n<p><strong>Our shared ambition is to drive global prosperity, sustainable development, connectivity and the transition to net zero </strong>by better leveraging our economies, capital markets, expertise, technology and innovation capabilities.</p>\n\n<p>Through a wide range of programmes and initiatives, as illustrated in the <a href=\"https://www.g7uk.org/wp-content/uploads/2021/12/ANNEX-TO-G7-LEADERS-STATEMENT-PARTNERSHIP-FOR-INFRASTRUCTURE-AND-INVESTMENT-FINAL-3-DECEMBER.pdf\">annex</a> to this statement, we are <strong>already supporting sustainable, resilient and quality infrastructure</strong> in developing countries, and will build on this to deliver on our ambition. Collectively we have invested substantial resources - in 2019 and 2020 combined, the G7 members provided over US$265 billion in official development assistance,<a href=\"#_ftn2\" name=\"_ftnref2\" title=\"\" id=\"_ftnref2\"><sup><sup>[2]</sup></sup></a><em> </em>including for infrastructure. G7 members also provide substantial amounts of additional finance for infrastructure in developing countries through Multilateral Development Banks (MDBs) and their development finance institutions.</p>\n\n<p>But narrowing the connectivity and infrastructure investment gap requires a significant shift in how the international system works together. This is a <strong>long-term agenda</strong>, where we will adopt a common strategic approach, underpinned by the following five principles:</p>\n\n<ul>\n\t<li><strong>Sustaining a step change in our ambition </strong>- partnering with developing countries on their infrastructure investment plans as a standing priority, together with increased cooperation, coordination and collaboration between us to ensure we are greater than the sum of our parts.</li>\n\t<li><strong>Strengthening regional and country-led partnerships </strong>-<strong> </strong>building on existing initiatives, driven by country ownership and grounded in the needs of partner countries, reinforced by G7 coordination on international engagement through the G20, multilateral organisations, and more widely.</li>\n\t<li><strong>A values-based approach, underpinned by strong standards</strong> - driving a race to the top based on shared values and benefits for partner developing countries, by calling on all actors to adhere to internationally recognised rules and standards, including those for lending and investment.</li>\n\t<li><strong>Scaling up finance </strong>-<strong> </strong>mobilising both public and private sector finance and expertise, including by leveraging public finance to catalytically crowd in the private sector; and by supporting access to sustainable finance from G7 capital markets.</li>\n\t<li><strong>Ensuring that finance reaches where it is needed, and supporting a more coherent system overall</strong> - advancing regional and country-owned platforms as mechanisms to promote coherence; supporting developing and emerging market economies to develop and deliver their pandemic recovery, sustainable development and climate plans; and matching finance to these plans, backed by our coordinated support.</li>\n</ul>\n\n<p>We are firmly committed to this agenda and to working with partners to take it forward. To deliver against these principles and the ambition we have set ourselves, we will initially take the steps below:</p>\n\n<p><strong>To sustain focus, we will: </strong></p>\n\n<ul>\n\t<li>Build on the taskforce we established at Carbis Bay through ongoing G7 engagement, to oversee our cooperation, steer our international coordination, and identify opportunities for collaboration.&nbsp;</li>\n</ul>\n\n<p><strong>To drive a race to the top on standards, we will:</strong></p>\n\n<ul>\n\t<li>Work within the G20 to support the implementation of existing international principles and standards, building off existing frameworks and the work of the MDBs and other International Financial Institutions (IFIs), such as the G20 Principles for Quality Infrastructure Investment; and continue work to ensure enhanced debt transparency, mutual accountability and comparability of debt treatment.</li>\n\t<li>Champion a shared set of existing best in class social, gender-sensitive, environmental, resilience, transparent, open, economically efficient and financial standards, including debt sustainability, and support countries to implement them.</li>\n\t<li>Engage in efforts with a view to the possible adherence of all G20 countries to the OECD Anti-Bribery Convention.</li>\n\t<li>Work with the MDBs and through our development finance institutions to widen adherence to standards by building capacity to implement them at country and project level, with particular regard to providing confidence for public accountability and private finance.</li>\n</ul>\n\n<p><strong>To support our ambition to scale up from billions to trillions in finance from our economies, we will:</strong></p>\n\n<ul>\n\t<li>Cooperate<em> </em>with MDBs and other IFIs to assess and set best conditions for mobilising private finance, aligned with the objectives of the Paris Agreement.</li>\n\t<li>Coordinate together as the G7, with other shareholders and with the MDBs, on measures to increase their capacity to leverage private finance, including supporting the implementation of the G20 Sustainable Finance Roadmap.</li>\n\t<li>Collaborate with other partners to deliver the global ambition agreed by Leaders in Carbis Bay, and endorsed by G20 Leaders in Rome, to mobilise US$100 billion, including through voluntary channelling of Special Drawing Rights. To this end, we support the call to establish a new Resilience and Sustainability Trust within the International Monetary Fund.</li>\n\t<li>Review and further modernise our toolkits to drive innovations to help developing countries access sustainable finance from capital markets as well as public institutions, and identify specific regional and country plans, programmes and projects on which the G7 can collaborate.</li>\n</ul>\n\n<p><strong>To reinforce our regional and country-led partnership approach and promote coherence, we will:</strong></p>\n\n<ul>\n\t<li>Work within the G20 to operationalise country platforms, including by enhancing support for the existing framework and principles and their implementation, and by building on existing initiatives such as the G20 Compact with Africa and Global Infrastructure Facility to strengthen and coordinate partnerships, planning and programming.</li>\n\t<li>Participate in pilot platform projects to develop and improve best practice.</li>\n\t<li>Strengthen technical assistance and capacity building, in collaboration with<strong> </strong>MDBs and the private sector, to support countries to develop their plans and pipelines of high-quality sustainable projects.</li>\n</ul>\n\n<p>These commitments are the first steps in a long-term partnership, and we welcome and invite others to join and work with us, to better coordinate globally in order to narrow the infrastructure financing gap, improve the quality, sustainability and resilience of infrastructure, address climate change, protect biodiversity, and drive the transition to net zero. We welcome the work of the G7 taskforce on development finance, which has informed these principles, and the forthcoming discussion of these issues by G7 Foreign and Development Ministers. We look forward to reflecting on the progress of this initiative under the German Presidency.</p>\n\n<div>&nbsp;\n<hr>\n<div id=\"ftn1\">\n<p><a href=\"#_ftnref1\" name=\"_ftn1\" title=\"\" id=\"_ftn1\"><sup><sup>[1]</sup></sup></a> According to some estimates low- and middle-income countries need to expand infrastructure investment seven-fold, to over US$1 trillion per year, just to address climate change: International Energy Agency, World Bank and World Economic Forum Special&nbsp; Report (2021):&nbsp;<a href=\"https://iea.blob.core.windows.net/assets/6756ccd2-0772-4ffd-85e4-b73428ff9c72/FinancingCleanEnergyTransitionsinEMDEs_WorldEnergyInvestment2021SpecialReport.pdf\">Financing Clean Energy Transitions in Emerging and Developing Economies</a>, p14 and 26</p>\n</div>\n\n<div id=\"ftn2\">\n<p><a href=\"#_ftnref2\" name=\"_ftn2\" title=\"\" id=\"_ftn2\"><sup><sup>[2]</sup></sup></a> OECD,&nbsp;<a href=\"https://www.oecd.org/dac/financing-sustainable-development/development-finance-data/\">official development assistance data</a>, 2019 and 2020 (preliminary); accessed November 2021</p>\n</div>\n</div></div>\n      "
}