{
  "path": "/en/news/readouts/2020/07/31/prime-minister-justin-trudeau-speaks-president-colombia-ivan-duque-marquez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Colombia Iván Duque Márquez | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Colombia, Iván Duque Márquez.</p>\n\n<p>Prime Minister Trudeau expressed sincere condolences for the July 20 helicopter accident in Guaviare, Colombia, in which nine members of Colombia’s National Army lost their lives.</p>\n\n<p>The two leaders discussed the COVID-19 pandemic and the significant efforts in Canada and Colombia to address its health, social, and economic impacts. They spoke about their common desire to work towards a sustainable and green recovery in their respective countries and in the Americas.</p>\n\n<p>The Prime Minister and the President also discussed the crisis in Venezuela and its humanitarian impact in the region. They expressed concern about the health outcomes for Venezuelans impacted by the pandemic. The two leaders agreed on the need for concerted international action to help Venezuelans restore democracy in the country.</p>\n\n<p>The two leaders spoke about the warm friendship between their countries and highlighted their trade and commercial ties, including the Canada-Colombia Free Trade Agreement. They looked forward to finding opportunities to strengthen bilateral relations across a range of common priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/colombia-colombie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada - Colombia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/2020-06-16-lima_group-groupe_lima.aspx?lang=eng\">Lima Group statement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}