{
  "path": "/en/news/statements/2017/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p><p>“Violence against women is a violation of human rights – and an issue that affects all of us. We are all harmed when people in our communities and society experience violence – and all of us share a responsibility to make sure women and girls have the respect, protection, and freedom that is their right.</p><p>“Men must hold themselves and each other accountable and be part of the solution. From speaking up about the rights of women and girls, to promoting women’s leadership in every aspect of our society, to standing against violence whenever it occurs, men have a vital role to play in eliminating gender-based violence.</p><p>“Ending gender-based violence means transforming a culture that devalues women and dismisses their voices. Together, we must challenge the prejudices and inequalities that allow this violence to persist. We know gender-based violence differently and disproportionately affects those most vulnerable – including trans women, Indigenous women, women of colour, low-income women, refugees and displaced women, and others. To change this reality, we must actively seek out and listen to the voices and needs of women, especially those cast furthest to the margins.</p><p>“That is why the Government of Canada has adopted <a href=\"http://www.swc-cfc.gc.ca/violence/strategy-strategie/index-en.html\">It’s Time: Canada’s Strategy to Prevent and Address Gender-Based Violence</a> based on prevention, support for survivors and their families, and the promotion of responsive legal and justice systems. It is also why the Government remains determined to seek justice for missing and murdered Indigenous women and girls and to prevent these tragedies from continuing to occur.</p><p>“Together with people across Canada and around the world, the Government is working tirelessly to eliminate violence against women and girls – but so much remains to be done.</p><p>“Today and throughout the <a href=\"http://www.swc-cfc.gc.ca/commemoration/vaw-vff/index-en.html\">16&nbsp;Days of Activism Against Gender-Based Violence</a>, I encourage all Canadians to join the #MYActionsMatter campaign and find your way to combat violence against women.We are interdependent and interconnected, and we are stronger when everyone’s rights are protected. Working together – as communities, businesses, governments, and individuals – I know we can build a world free from violence for women and girls everywhere.”</p></div>\n      "
}