{
  "path": "/en/news/statements/2016/07/27/statement-prime-minister-canada-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p>\n<p>“On June 25, 1950, Communist armies from the North charged across the 38th Parallel and invaded South Korea. Over the next several years, more than 26,000 Canadians – many veterans of the Second&nbsp;World War, and some still teenagers – left behind their loved ones to defend a country half a world away.</p>\n<p>“The Korean War would become one of the dirtiest, bloodiest, and deadliest conflicts in Canadian history. The brutal combat was reminiscent of the First World War: soldiers dug out trenches by hand, and lived between four walls of dirt for weeks – sometimes months – on end. The harshest battle was often not against enemy forces, but unforgiving weather: frigid winds and bitter cold that turned food into ice, and relentless rains that dissolved land into mud and muck.&nbsp;</p>\n<p>“Sixty-three years ago today, the combat phase of the Korean War ended in&nbsp;armistice. The cost of the war was heavy, with two and&nbsp;half&nbsp;million victims. 516 Canadians made the ultimate sacrifice.&nbsp;Many&nbsp;more came home bearing the scars of war. Approximately 7,000 Canadians continued to serve in the tense theatre of operations between the signing of the Armistice and the end of 1955.</p>\n<p>“We are proud of the role Canada played, along with our United Nations allies, to defend the sovereignty of South Korea. Because of our Korean War Veterans, fifty million South Koreans now live in a peaceful and prosperous nation. Their courage and sacrifice helped to change the course of history.</p>\n<p>“Today, I urge all Canadians to learn more about Canada’s role in resolving the combat phase of the Korean War. I also call on all citizens to join me in expressing our heartfelt gratitude to all those from our military, and their families who support them, who have fought, and continue to fight, so courageously to defend the principles of peace, freedom, and democracy around the world.”</p></div>\n      "
}