{
  "path": "/en/news/statements/2019/01/08/statement-prime-minister-meeting-modern-treaty-and-self-governing-first",
  "pageTitle": "Statement by the Prime Minister on meeting with Modern Treaty and Self-Governing First Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today after meeting with Modern Treaty and Self-Governing First Nations:</p><p>“Today, I had the honour to meet with leaders of Modern Treaty and Self-Governing First Nations for a second time to strengthen our unique and enduring relationship.</p><p>“We talked about last year’s accomplishments toward self-determination, including the new fiscal policy we drafted together with Self-Governing First Nations. This new policy is just one example of our commitment to do things differently and redefine our relationship—working nation-to-nation to meet the actual needs and priorities of Indigenous peoples.</p><p>“These reforms are also about more than just funding—they are about Canada living up to its promises and obligations under treaties and self-government agreements, and Indigenous communities continuing to demonstrate the success that comes from self-governance.</p><p>“In the past year, we have also worked together toward reforming child and family services so that kids stay with their parents and communities. Later this year, we will introduce new legislation to help preserve, promote, and revitalize Indigenous languages.</p><p>“While we have achieved a lot together, we have a lot more to do. That is why meetings like the one today are critical, and why we have made it a priority to meet every year. Today, we identified how we can best advance key priorities to strengthen the implementation of modern treaties and self-government agreements. We also talked about the Modern Treaty and Self-Governing First Nations’ other priorities for action on reconciliation.</p><p>“There is no relationship more important to the Government of Canada than the one we have with Indigenous peoples. I thank our partners from Modern Treaty and Self-Governing First Nations for meeting today and sharing a desire to build a better future for generations to come. I am confident that today’s discussions will bring even greater progress and create positive and lasting results for Modern Treaty and Self-Governing First Nations.</p><p>“We recognize that when our relationships are based on the recognition of rights, respect, cooperation, and partnership, we deliver better results for everyone—stronger communities, healthier citizens, thriving cultures, and greater economic success. Modern treaties and self-government agreements are true examples of reconciliation in action.”</p></div>\n      "
}