{
  "path": "/en/news/statements/2017/10/01/statement-prime-minister-after-terrorist-attack-edmonton",
  "pageTitle": "Statement by the Prime Minister after a terrorist attack in Edmonton | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after a terrorist attack in Edmonton:</p><p>“The Government of Canada and Canadians stand with the people of Edmonton after the terrorist attack on Saturday that sent an Edmonton Police Service officer to hospital and injured a number of innocent people who were out to cheer on their football team and to enjoy an evening in their city. I am deeply concerned and outraged by this tragedy.</p><p>\"Our thoughts are with those injured, their family and friends, and all those affected by this senseless act of violence. I am also grateful for the first responders who were there on the scene, and the enforcement authorities who have been working through the night to make sure that everybody in Edmonton and Alberta is safe and secure. Police officers put themselves at great personal risk every single day on our behalf, and this attack is a stark reminder of the sacrifices they make for the public good.</p><p>“While the investigation continues, early reports indicate that this is another example of the hate that we must remain ever vigilant against. The RCMP and the Edmonton Police Service, through the Integrated National Enforcement Team, are working closely together to bring those involved to justice.</p><p>“We cannot – and will not – let violent extremism take root in our communities. We know that Canada’s strength comes from our diversity, and we will not be cowed by those who seek to divide us or promote fear. Edmonton is a strong and resilient city, and I am confident that its citizens will support one another to overcome this tragic event.”</p></div>\n      "
}