{
  "path": "/en/news/news-releases/2022/10/11/governor-general-travel-iceland-arctic-circle-assembly",
  "pageTitle": "Governor General to travel to Iceland for the Arctic Circle Assembly | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General of Canada, Her Excellency the Right Honourable Mary Simon, will travel to Reykjavík, Iceland, from October 12 to 15, 2022, where she will attend the Arctic Circle Assembly and deliver a keynote address.</p>\n\n<p>During Her Excellency’s visit to Iceland, which comes as Canada and Iceland celebrate their 75th year of diplomatic relations, the Governor General will engage with local, international, and Arctic leaders on Canada’s approach to issues of diplomacy, environmental change, and reconciliation within the northern circumpolar region.</p>\n\n<p>In Reykjavík, the Governor General will meet with over 115 Canadian delegates attending the Arctic Circle Assembly, and will participate in a panel discussion on gender equality and diversity in Arctic leadership. Her Excellency will also meet with other world leaders participating in the Assembly, including the President of Iceland, Guðni Thorlacius Jóhannesson, and the President of Estonia, Alar Karis.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Governor General’s participation at the Arctic Circle Assembly is a valuable opportunity for Canada to engage with Icelandic leaders and other international partners on shared priorities, including addressing climate change, advancing reconciliation, and ensuring sustainable economic development throughout the Arctic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and Iceland’s bilateral relationship is founded on longstanding Arctic cooperation; sustainable, inclusive, and rules-based trade; and people-to-people ties. Over 100,000 people of Icelandic descent live in Canada, comprising the largest Icelandic diaspora in the world.</li>\n\t<li>Established in 2013 in Iceland, the Arctic Circle Assembly is the largest annual international gathering on the Arctic. Participants include governments, Indigenous organizations, universities, and environmental associations.</li>\n\t<li>Canada is represented in Iceland through an embassy in Reykjavík. In Canada, Iceland maintains an embassy in Ottawa, and consulates general in Toronto, Vancouver, and Winnipeg.</li>\n\t<li>The Governor General travels abroad at the request of the Prime Minister. This is Her Excellency’s third international visit and the first to an Arctic state since her installation in July 2021. She has previously visited Germany and the Middle East.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/iceland-islande/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Iceland Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/arctic-arctique/index.aspx?lang=eng\">Canada and the Circumpolar Regions</a></li>\n\t<li><a href=\"https://www.arcticcircle.org/assemblies/2022-arctic-circle-assembly\">2022 Arctic Circle Assembly</a></li>\n</ul></div>\n      "
}