{
  "path": "/en/news/news-releases/2017/12/08/prime-minister-nominates-next-senate-ethics-officer",
  "pageTitle": "Prime Minister nominates the next Senate Ethics Officer | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Pierre&nbsp;Legault as the next Senate Ethics Officer.&nbsp;</p><p>Mr. Legault’s career as a lawyer, decision-maker, and senior leader with the federal government spanned more than 34 years. From 2012 until his retirement in 2016, he served as the Associate Deputy Minister of Justice, the highest ranked civil lawyer position in the Government. Since July 2017, he has been serving as interim Senate Ethics Officer.</p><p>The Senate Ethics Officer is responsible for administering, interpreting, and applying the&nbsp;<em>Ethics and Conflict of Interest Code for Senators.</em></p><p>Under the <i>Parliament of Canada Act</i>, this nomination must be approved by the Senate.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the nomination of Pierre Legault as the next Senate Ethics Officer. With his extensive background as a lawyer in the federal government and his most recent experience as interim Senate Ethics Officer, I trust that Mr.&nbsp;Legault will help maintain and increase the public trust and confidence in the Senate of Canada.”<br><cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Mr. Legault was chosen as the nominee for the position of Senate Ethics Officer through the Government’s open, transparent, and merit-based appointment process.</li><li>The Senate Ethics Officer is an independent Officer of the Senate, appointed under the <em>Parliament of Canada Act</em> for a term of seven years<i>.</i> &nbsp;</li><li>The appointment is considered by the Governor in Council after consultation with the leader of every recognized party and group in the Senate and after approval of the appointment by resolution of the Senate.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/12/08/pierre-legault\">Pierre Legault</a></li></ul></div>\n      "
}