{
  "path": "/en/news/news-releases/2018/11/18/prime-minister-concludes-productive-apec-leaders-meeting",
  "pageTitle": "Prime Minister concludes productive APEC Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the Asia-Pacific Economic Cooperation (APEC) Leaders’ Meeting hosted by Papua New Guinea.</p><p>During the meeting, the Prime Minister reaffirmed Canada’s commitment to expand trade and investment with the Asia-Pacific region, attract global investment, and create new economic opportunities and good, middle class jobs at home.</p><p>He highlighted how Canada was among the first countries to ratify the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which will unlock unprecedented opportunities for Canadians and deepen trade and investment ties with APEC partners.</p><p>The Prime Minister took part in the APEC Business Advisory Council dialogue to discuss ways businesses and APEC members can work together to create good, middle class jobs and build economies that work for all people. The discussion focused on the importance of open trade and multilateral trade agreements that benefit everyone and the use of digital technologies to better connect people and businesses around the world.</p><p>The Prime Minister also participated in the APEC Leaders’ Dialogue with Pacific Island countries leaders to explore how we can increase collaboration so more people share in the benefits of economic growth. The leaders talked about building awareness on digital issues and working together to set the foundation for a digital economy that works for everyone.</p><p>The Prime Minister hosted a roundtable with Pacific Islands Forum leaders where he reaffirmed Canada’s commitment to fight climate change and help them adapt to the changing climate. He also announced $20 million in new funding for increased technical assistance and capacity development in Small Island Developing States, including in the areas of public financial management, financial sector supervisory capacity, and fostering inclusive growth. He also announced $10&nbsp;million to the Pacific Initiative for Biodiversity, Climate Change and Resilience that will assist the Pacific region to adapt to climate change, protect biodiversity, and improve ocean and fisheries health.</p><p>Canada will join the InsuResilience Global Partnership for Climate and Disaster Risk Finance and Insurance Solutions, launched at the 2017 UN Climate Change Conference in Bonn, Germany, to strengthen disaster preparedness, response, and recovery in developing countries.</p><p>During his visit, the Prime Minister met with five Canadian youth delegates from the APEC “Voices of the Future” program, and held bilateral meetings with leaders from Australia, Japan and Malaysia.</p><h2>Quote</h2><blockquote><p>“I thank Prime Minister Peter&nbsp;O’Neill for hosting this year’s APEC Leaders’ Meeting. There is enormous untapped potential for growth and prosperity in the Asia-Pacific region and beyond. With the CPTPP coming into force, I look forward to continue working with our Asia-Pacific partners to expand and diversify Canada’s trade and create new opportunities and good, middle class jobs for Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada is a founding member of APEC. This forum provides Canada with an opportunity to further strengthen trade and economic ties with some of the Asia-Pacific region’s most dynamic economies.</li><li>In 2017, APEC partners accounted for nearly 84 per&nbsp;cent of Canada's total merchandise trade.</li><li>In 2017, foreign direct investment from APEC economies in Canada was $481&nbsp;billion.</li><li>Four of Canada’s top five trading partners are APEC members (United States, China, Mexico, and Japan).</li><li>The APEC Business Advisory Council provides advice on business sector issues. It is composed of up to three business representatives from each of the 21 member economies appointed by APEC leaders.</li><li>This is Canada’s first leader to leader engagement with the Pacific Islands Forum. The Pacific Islands Forum is comprised of 18 members from Pacific Island countries including Australia, Cook Islands, Federated States of Micronesia, Fiji, French Polynesia, Kiribati, Nauru, New Caledonia, New Zealand, Niue, Palau, Papua New Guinea, Republic of Marshall Islands, Samoa, Solomon Islands, Tonga, Tuvalu, and Vanuatu.</li><li>The contributions announced at the Pacific Islands Forum leader roundtable complement the $162&nbsp;million announced at the G7 Summit in Charlevoix to build stronger and more resilient coasts and coastal communities. This funding includes:<ul><li>$100 million to support the expansion of Climate Risk Insurance coverage in climate-vulnerable countries, including Caribbean and Pacific Island countries;</li><li>$60 million to promote clean and renewable energy and infrastructure and provide training and employment opportunities for women in non-traditional, sustainable technology sectors;</li><li>and $2 million to support efforts by developing countries to adapt to the impacts of climate change.</li></ul></li><li>At the G7 Ministers of Environment, Oceans and Energy meeting, Canada announced up to $11.6 million to combat illegal, unreported and unregulated fishing throughout the world. Up to $1.6 million of this funding will help western and central pacific countries.</li><li>In 2012, Canada established a technical assistance sub-account at the International Monetary Fund that supports technical assistance to developing country governments to build their capacity to address public debt, balance of payment problems and financial sector crises.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li><li><a href=\"/en/news/backgrounders/2018/06/10/working-together-climate-change-oceans-and-clean-energy\">Working together on climate change, oceans, and clean energy</a></li></ul></div>\n      "
}