{
  "path": "/en/news/news-releases/2016/07/25/governor-general-be-canadas-official-representative-rio-2016-olympic",
  "pageTitle": "Governor General to be Canada’s official representative at Rio 2016 Olympic Games | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Excellency the Right Honourable David Johnston, Governor General of Canada and patron of the Canadian Olympic Committee, will travel to Rio de Janeiro, Brazil from August 3 to 8, 2016 as Canada’s official representative at the Rio 2016 Olympic Games.</p>\n<p>The Rio 2016 Olympic Games—the first Olympic Games to be held in South America—will be an opportunity for Canadian athletes to write another chapter in our country’s rich sports history. Our athletes, as well as their coaches and support staff, have demonstrated tremendous dedication and commitment to rise to a level where they are competing against the best in the world.</p>\n<p>The Government of Canada is proud of its role in helping Canadian athletes realize their Olympic dreams. It is the largest single investor in Canada’s sport system, providing funding for initiatives that support our high-performance athletes and that promote sport participation among all Canadians.</p>\n<p><strong>Quote</strong>&nbsp;</p>\n<p>“Canada is extremely proud of each and every one of the athletes who will represent our country at the Rio 2016 Olympic Games. We know of the incredible drive, determination and sacrifice it takes for athletes to compete at this level, and we want them to know that Team Canada—all 35 million people back home—will be watching and cheering them on.”</p>\n<p>-&nbsp;<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canada has prepared one of its largest teams ever for an Olympic Summer Games with more than 315 athletes qualifying for Rio. For the first time, Canada has qualified in five team sports at the Olympic Summer Games.</li>\n<li>Thanks to the leadership of the Government of Canada, in partnership with the Canadian Olympic Committee, the Canadian Paralympic Committee, and our country’s national and multisport organizations, Canada's summer Olympic athletes will have the largest financial backing ever in the final fiscal year leading to Olympic and Paralympic Games.</li>\n<li>Through the Athlete Assistance Program, the Government provides approximately $28 million per year in direct monthly support to more than 1,900 of Canada's top able-bodied and parasport athletes. This funding assists our top athletes with their living, training and education expenses so they can focus on the day-in-day-out commitment that is required to push for the podium whenever and wherever they compete. This is just one of a number of investments our Government is making to support our high-performance athletes as we know the impact they have in inspiring Canadians, especially our young people, to chase their own dreams.</li>\n<li>The Rio 2016 Olympic Games will take place from August 5 to 21, 2016, and will include 10,500 athletes from 205 countries.</li>\n</ul></div>\n      "
}