{
  "path": "/en/news/statements/2021/10/01/statement-prime-minister-national-seniors-day",
  "pageTitle": "Statement by the Prime Minister on National Seniors Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Seniors Day:</p>\n\n<p>“Canada’s seniors have helped shape this country, and raised, mentored, and invested in generations of Canadians. As parents, grandparents, friends, neighbours, workers, and volunteers, they continue to contribute to our families, communities, and society in countless ways.</p>\n\n<p>“It has been a difficult pandemic for seniors in Canada, with many facing isolation, loneliness, and stress. We need to continue to be there for them, as they have been for us and our country.</p>\n\n<p>“The Government of Canada has taken important steps to improve seniors’ quality of life and help them retire in dignity. We have increased the Guaranteed Income Supplement for hundreds of thousands of low-income single seniors and enhanced its earnings exemption. Through these and other measures, we have helped lift 45,000 seniors out of poverty across the country between 2015 and 2019. Budget&nbsp;2021 increased support for seniors, to help them with <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/05/backgrounder-increased-costs-for-older-seniors.html\">higher costs later in life</a>. Seniors eligible for the Old Age Security (OAS) pension and who will be 75&nbsp;or over as of June 30, 2022 received immediate support in August with a one‑time payment of $500. In July 2022, the OAS pension will increase by 10 per cent for seniors 75&nbsp;and over.</p>\n\n<p>“The government is also taking steps to ensure that seniors can stay at home as long as possible. We recently created the Age Well at Home initiative to assist community‑based organizations in providing support to low-income and vulnerable seniors, such as matching seniors with volunteers who can help with meal preparations, home maintenance, daily errands, and transportation. To improve the safety and availability of care in long-term care homes, the government is also investing $3 billion over five years, starting in 2022-23, to support provinces and territories in ensuring better standards are applied in long-term care so that seniors can live in safe and dignified conditions.</p>\n\n<p>“We know that the pandemic has tragically highlighted the serious and long-standing challenges in long-term care homes in our country. Together, we will ensure better, safer care for seniors.</p>\n\n<p>“On National Seniors Day, I invite all Canadians to reach out to the seniors in their lives. We thank them for everything they have done for us and our country, and for laying the foundations of a better future for us all.”</p></div>\n      "
}