{
  "path": "/en/news/statements/2018/09/11/statement-prime-minister-anniversary-911-and-national-day-service",
  "pageTitle": "Statement by the Prime Minister on the anniversary of 9/11 and the National Day of Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the terrorist attacks of September 11th, 2001, and on the National Day of Service:</p><p>“The events of 9/11 – the deadliest terrorist attack in the history of the United States – will remain ingrained in our memories for generations.</p><p>“Today, on the 17th anniversary of this tragedy, we remember its nearly 3,000 innocent victims, including 24 Canadians.</p><p>“Hundreds of first responders lost their lives. We offer our deepest condolences to all those who lost loved ones, and live with pain and grief that will never completely go away.&nbsp;</p><p>“We recognize the incredible bravery of first responders who risked everything so others might live. They raced into smoke and flames, braved falling rubble, and charged up the stairs of the collapsing towers. They were firefighters, police officers, military personnel, and ordinary people – all heroes, extraordinary in their service and sacrifice.&nbsp;</p><p>“On this National Day of Service, we honour those first responders, and all those who have sacrificed so much – before and since – in service to their neighbours and country.</p><p>“Communities across Canada banded together to help a country – a neighbour and friend – stricken by grief. Canadians opened their arms and homes to stranded airline passengers, joining an outpouring of generosity across North America that, to this day, reminds us to keep faith in the darkest hours – and know the best of us will always shine through.</p><p>“On behalf of the Government of Canada, I encourage Canadians to take part in acts of service today to remember those who lost their lives, and to honour the selflessness shown by so many on 9/11.”</p></div>\n      "
}