{
  "path": "/en/news/readouts/2021/03/25/prime-minister-justin-trudeau-speaks-president-world-bank-group-david",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the World Bank Group David Malpass | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span>Today, Prime Minister Justin Trudeau spoke with the President of the World Bank Group, David Malpass, about the ongoing global economic recovery from the impacts of the COVID-19 pandemic.</span></span><span><span>&nbsp;</span></span></p>\n\n<p><span><span>They spoke about the importance of building back better to ensure a strong economic recovery that benefits everyone. They discussed the pandemic’s devastating impacts on economies around the world, particularly the fragile economies of developing countries and small island states.</span></span><span><span>&nbsp;</span></span></p>\n\n<p><span><span>Prime Minister Trudeau thanked President Malpass for his strong leadership in response to the pandemic. They committed to continue working together to meet the unique challenges of countries highly vulnerable to the pandemic’s health, economic, and social impacts as well as to the ongoing impacts of climate change.</span></span><span><span>&nbsp;</span></span></p>\n\n<p><span><span><span>The two leaders discussed the importance of transparency in sovereign lending, and the need to ensure eligibility criteria for development financing respond to the current economic crisis. They also agreed on the need for enhanced international collaboration to address debt and liquidity challenges associated with the economic impacts of COVID-19, including through the upcoming high-level meeting on International Debt Architecture and Liquidity at the United Nations on March 29.</span></span></span></p>\n\n<h2><span><span>Associated links</span></span></h2>\n\n<ul>\n\t<li><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/world_bank-banque_mondiale.aspx?lang=eng\">Canada and the World Bank</a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://www.worldbank.org/en/country/canada\">The World Bank in Canada</a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></span></span></span></li>\n\t<li><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></span></span></span></li>\n</ul></div>\n      "
}