{
  "path": "/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-president-poland-andrzej-duda",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Poland Andrzej Duda | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Poland, Andrzej Duda, in Warsaw, Poland.</p>\n\n<p>Prime Minister Trudeau and President Duda strongly condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine. Both leaders agreed that the invasion represents a direct attack on democracy worldwide and is a threat to regional security. Prime Minister Trudeau reiterated Canada’s decision to renew its commitment to a military presence in Central and Eastern Europe through Operation REASSURANCE, and underscored the North Atlantic Treaty Organization’s (NATO) unity in response to Russia’s continued aggression.</p>\n\n<p>The leaders called for Russia’s immediate withdrawal of military forces from Ukraine, and the urgent need to allow for the distribution of humanitarian assistance.</p>\n\n<p>Prime Minister Trudeau commended the remarkable efforts by the Polish government and people, who have welcomed over one million refugees fleeing from Ukraine seeking shelter from further Russian aggression.&nbsp;He also thanked President Duda for facilitating the relocation of over 200 Canadian soldiers, serving in Ukraine under Operation UNIFIER, to Poland.</p>\n\n<p>The two leaders agreed on the need to continue increasing economic and diplomatic pressure on Russia while providing full support to the Ukrainian government and people. They welcomed the growing international consensus against Russia’s unjustifiable and unprovoked invasion of Ukraine, as demonstrated by the recent vote denouncing Russia at the United Nations General Assembly.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland relations</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n</ul></div>\n      "
}