{
  "path": "/en/news/readouts/2022/06/27/prime-minister-justin-trudeau-meets-chancellor-germany-olaf-scholz",
  "pageTitle": "Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Chancellor of Germany, Olaf Scholz, on the margins of the G7 Summit in Elmau, Germany.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz discussed Russia’s illegal and unjustifiable invasion of Ukraine and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people. Prime Minister Trudeau underlined Canada’s strong and enduring commitment to work together with Germany to support Ukraine’s sovereignty and reconstruction efforts.</p>\n\n<p>Prime Minister Trudeau commended Germany’s leadership during its presidency of the G7 and in coordinating the group’s response during a year presenting significant challenges. The leaders expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, notably for the Global South, through shortages and rising prices of food, fuel, and fertilizer. They committed to working together with like-minded partners to find practical ways to mitigate these impacts, particularly for the most vulnerable.</p>\n\n<p>The Prime Minister welcomed Chancellor Scholz’s commitment to move forward with the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) ratification process, which the leaders identified as key in facilitating bilateral trade and job creation in both Canada and Germany. They spoke of the urgency of accelerating efforts to address climate change and agreed to collaborate to further promote pollution pricing internationally. The two leaders confirmed Chancellor Scholz’s visit to Canada in August to secure key partnerships on energy security, critical minerals and clean technology, and accelerate both countries’ transition toward green and sustainable economies.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}