{
  "path": "/en/news/news-releases/2020/05/16/prime-minister-announces-support-canadian-red-cross",
  "pageTitle": "Prime Minister announces support for the Canadian Red Cross | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Canadian Red Cross is playing a critical role in Canada’s response to COVID-19. The organization is helping Canadians at quarantine sites, in long-term care facilities, and through its mobile field hospital. And now it needs our support to continue providing the expertise, services, and relief efforts that we rely on during emergencies.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $100 million in funding to help the Red Cross meet increased demand due to COVID-19, and to support future floods and wildfire relief efforts.</p>\n\n<p>This funding includes up to $41 million to address immediate COVID-19 needs, with over $15 million committed to enhance the Red Cross’ response capacity and $25 million to support public health efforts. With this funding, the Red Cross will:</p>\n\n<ul>\n\t<li>recruit and train volunteers and staff</li>\n\t<li>adapt its operations to the COVID-19 context</li>\n\t<li>support quarantine and isolation sites</li>\n\t<li>acquire personal protective equipment for its personnel and volunteers</li>\n\t<li>provide training to the health care sector and other essential workers on using personal protective equipment, and maintaining infection prevention and control measures within facilities</li>\n\t<li>expand their roster of public health and infection prevention and control specialists</li>\n\t<li>procure and deploy, as necessary, emergency health supplies and equipment, including a mobile field hospital, to prepare for future waves and outbreaks of COVID-19</li>\n</ul>\n\n<p>In addition, up to $59 million of this funding will be available to support additional relief and recovery efforts this year related to COVID-19, as well as for future floods and wildfires. This will help ensure that the Red Cross can continue to support Canadians as the situation evolves and new needs emerge, including by providing assistance to those who are evacuated from their homes because of floods or wildfires.</p>\n\n<p>Organizations like the Canadian Red Cross are working hard to adapt to the emerging needs of people, families, and communities, and to modify their existing services so they can continue to deliver the services Canadians rely on. The Government of Canada will continue to be there to support them as they help Canadians get through this difficult time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Across Canada, national and community organizations are stepping up to support the most vulnerable in our fight against COVID-19. They are being asked to deliver the same services and support that we have always depended on, in much more challenging circumstances. It takes resources to do that, and that is why it is important that we support organizations like the Canadian Red Cross. They are there for Canadians, so we need to be there for them.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians are grateful to the Canadian Red Cross for their dedicated work—in cooperation with all orders of government and community organizations―to support urgent and ongoing relief efforts related to COVID-19. The Canadian Red Cross is a key partner whose national reach and ability to respond rapidly is invaluable to Canadians and all involved in the emergency response community. We continue to do everything we can to ensure the health and safety of Canadians through this incredibly challenging time.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, Minister of Public Safety and Emergency Preparedness</footer>\n</blockquote>\n\n<blockquote>\n<p>“I want to thank the Canadian Red Cross for the crucial role it’s playing in the response to COVID-19. From helping Canadians in quarantine sites to supporting health care professionals who are serving on the frontlines every day, the Canadian Red Cross has been a key partner during this unprecedented time.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canadian Red Cross is thankful for the funding announced today by the Government of Canada. COVID-19 has impacted Canadians in unprecedented ways, and the Red Cross is committed to assisting people as needs continue to emerge. This contribution is a key investment that will enable the Red Cross to adapt to the challenges presented by COVID-19, as well as help to assist Canadians by equipping, recruiting and training people to be better prepared for events that occur during this pandemic and beyond.”&nbsp;&nbsp; &nbsp;</p>\n\n<footer class=\"default\">Conrad Sauvé, President and CEO, Canadian Red Cross</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Through relationships with government agencies and widespread community partnerships, the Canadian Red Cross is meeting emerging needs to assist the country’s most vulnerable as the COVID-19 epidemic evolves.</li>\n\t<li>Here are some examples of how the Red Cross is helping or has helped so far. These efforts will be supported by the funding announced today:\n\t<ul>\n\t\t<li>Supporting volunteer training with health officials, as they work to boost assistance in long-term care homes for seniors hit hard by COVID-19</li>\n\t\t<li>Operating call centres to ensure that vulnerable individuals in isolation have a mechanism for receiving food. Food hampers are then delivered to those in need of assistance</li>\n\t\t<li>Providing supplies, including cots, blankets, and clean-up kits upon request by local authorities to various locations across the country to help support vulnerable populations</li>\n\t\t<li>Distributing additional equipment through the Health Equipment Loan Program (HELP) to assist Canadians recovering at home from surgery or illnesses. The need has increased for equipment such as wheelchairs, walkers, commodes, hospital beds, and IV poles to support people in their recovery at home.</li>\n\t</ul>\n\t</li>\n\t<li>The Government of Canada and the Red Cross are adjusting emergency plans for events like wildfires and floods as necessary to align with the latest advice from public health officials on COVID-19, and are taking all possible steps to ensure readiness.</li>\n\t<li>This funding is in addition to the funding being provided to the Red Cross through the Emergency Community Support Fund announced on April 21, 2020.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.redcross.ca/\">Canadian Red Cross</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need\">Prime Minister announces further support to help Canadians in need</a></li>\n</ul></div>\n      "
}