{
  "path": "/en/news/news-releases/2020/08/18/prime-minister-announces-changes-ministry",
  "pageTitle": "Prime Minister announces changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the Ministry:</p>\n\n<ul>\n\t<li><strong>Chrystia Freeland</strong>, currently Deputy Prime Minister and Minister of Intergovernmental Affairs, becomes Minister of Finance. She will also remain Deputy Prime Minister.</li>\n</ul>\n\n<p class=\"Indent1\">Minister Freeland had a long career working for major publications such as the <em>Financial Times</em> and <em>The Economist</em>. For five years, she has been at the heart of economic issues, including the renegotiation of the North American Free Trade Agreement (NAFTA). Recently, she played a crucial role in the Team Canada response to COVID-19. As the new Minister of Finance, she will lead the safe restart and recovery of our economy.</p>\n\n<ul>\n\t<li><strong>Dominic LeBlanc</strong>, currently President of the Queen's Privy Council for Canada, becomes Minister of Intergovernmental Affairs. He will also remain President of the Queen's Privy Council for Canada.</li>\n</ul>\n\n<p class=\"Indent1\">Mr. LeBlanc is familiar with his new portfolio, having served as Minister of Intergovernmental Affairs from 2018 to 2019. Minister LeBlanc will continue to work with provinces and territories to ensure the well-being, health, and safety of Canadians from coast to coast to coast.</p>\n\n<p>The Prime Minister once again thanks Bill Morneau for his important work as the Minister of Finance over the past five years. Mr. Morneau has helped build a strong and resilient economy. He also implemented measures that will continue to have a real impact for future generations of Canadians.</p>\n\n<p>Finally, earlier today, the Prime Minister asked Her Excellency the Right Honourable Julie Payette, Governor General of Canada, to prorogue Parliament. This will provide an opportunity to present a Speech from the Throne on Wednesday, September 23, 2020, the same week the House of Commons was previously scheduled to return. This speech will present the government's detailed vision for the future, and will provide the opportunity for a vote of confidence on this new plan.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li>\n</ul></div>\n      "
}