{
  "path": "/en/news/news-releases/2018/11/20/prime-minister-host-first-ministers-meeting-and-meeting-national",
  "pageTitle": "Prime Minister to host First Ministers’ Meeting and meeting with national Indigenous leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the upcoming First Ministers’ Meeting (FMM) will take place in Montréal on December 7, 2018. The Prime Minister will be joined by Minister of Intergovernmental and Northern Affairs and Internal Trade Dominic LeBlanc.</p><p>At the FMM, First Ministers will discuss the new United States-Mexico-Canada Agreement, and how to diversify international trade while improving trade within our own borders. The Prime Minister and Minister LeBlanc will lead a discussion with First Ministers to explore eliminating barriers to trade between provinces and territories, and work toward a stronger, more interconnected Canadian economy that creates good jobs and growth for the middle class.</p><p>First Ministers will also meet with leaders of the Assembly of First Nations, the Inuit Tapiriit Kanatami, and the Métis National Council to discuss how all governments can contribute to continued economic growth and prosperity for Indigenous peoples.</p><h2>Quotes</h2><blockquote><p>“Our government is committed to working with provincial and territorial governments to increase opportunities for Canadians and make our communities stronger and more prosperous. I look forward to sitting down with Premiers to strengthen our partnerships, find ways to eliminate barriers to trade between provinces and territories, and create good, middle class jobs across the country.<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Our relationships with First Nations, Inuit, and Métis peoples in Canada continue to grow, built on a foundation of respect, cooperation, partnership, and trust. I look forward to meeting with Indigenous leaders and continue working together to ensure Indigenous peoples can fully participate in the economy and strengthen their communities.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Action by federal, provincial, and territorial partners is critical to increasing trade within Canada, which will build a stronger, more integrated economy and benefit all Canadians. We look forward to working with our counterparts to build an economy that works for the middle class and people working hard to join it.”<br><cite>—The Hon. Dominic LeBlanc, Minister of Intergovernmental and Northern Affairs and Internal Trade</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In 2017, federal, provincial, and territorial governments negotiated a historic Canadian Free Trade Agreement to improve the flow of goods, services, and investments across provincial and territorial borders, giving consumers more choice and lower prices. It also committed all governments to work together to reduce the rules and regulations that hinder trade within Canada and stifle the growth of Canadian businesses.</li><li>Trade between provinces and territories accounts for just under one-fifth of Canada's annual gross domestic product, or $370 billion. It also accounts for almost 40 per cent of all provincial and territorial exports.</li><li>Estimates suggest that removing interprovincial trade barriers could result in an economic benefit roughly comparable to the projected benefit of the Canada-European Union Comprehensive Economic and Trade Agreement.</li><li>Canada’s trade diversification strategy aims to open more markets and to do so on terms that benefit more people including Indigenous people.</li><li>This year, 37 Indigenous business leaders from Canada participated in the first Indigenous trade mission led by the Government of Canada. As part of the trade mission, they attended the World Indigenous Business Forum, in&nbsp;New Zealand.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/07/19/prime-minister-host-first-ministers’-meeting\">Prime Minister to host First Ministers’ Meeting</a></li><li><a href=\"http://canadaspremiers.ca/en/\">Canada’s Premiers</a></li></ul></div>\n      "
}