{
  "path": "/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy, to discuss Canada’s support to Ukraine in the wake of Russia’s continued military aggression.</p>\n\n<p>Prime Minister Trudeau reaffirmed Canada’s steadfast support for Ukraine’s sovereignty, independence, and territorial integrity. The Prime Minister updated President Zelenskyy on Canada’s response to Russia’s unlawful and unjustifiable invasion, which includes additional sanctions against Russia, further military aid such as another shipment of highly specialized military equipment and advanced technologies as well as humanitarian assistance to Ukraine. President Zelenskyy reaffirmed Ukraine’s determination to defeat Russia’s invading forces and highlighted the strength and determination of the Ukrainian people, fighting for their freedom.</p>\n\n<p>Referencing his ongoing and highly productive meetings with leaders in Europe and in the United Kingdom, Prime Minister Trudeau emphasized the coordination underway among Ukraine’s partners in order to continue supporting Ukraine along several lines of effort. President Zelenskyy accepted the Prime Minister’s invitation to address the Parliament of Canada, as Canadians are inspired by Ukraine’s courage and determination and eager to hear directly from the President.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for Canada’s assistance and the two leaders discussed ways in which Canada could continue to support Ukraine in the immediate future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/02/26/joint-statement-further-restrictive-economic-measures\">Joint statement on further restrictive economic measures</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n</ul></div>\n      "
}