{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-meets-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of the United Kingdom, Boris Johnson, in advance of the G7 Summit, to discuss their expectations and shared priorities for the Summit.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson discussed Russia’s illegal and unjustifiable invasion of Ukraine and agreed on the critical importance of continued military, financial, and humanitarian support to the Ukrainian government and people.</p>\n\n<p>The prime ministers discussed the urgency of increasing efforts to address climate change and its impacts, and Prime Minister Johnson assured Prime Minister Trudeau of his support ahead of the United Nations Summit on Biodiversity (COP 15) that Canada will host in Montreal. The two leaders noted the importance of continuing to hold Iran accountable for the downing of Flight PS752, and expressed concern with Iran’s lack of cooperation with the International Atomic Energy Agency with regards to the country’s nuclear program.</p>\n\n<p>The leaders exchanged notes on developments in China and the broader Indo-Pacific region and reaffirmed their commitment to supporting efforts to uphold the rules-based international order. They noted with concern the continued erosion of human rights in Hong Kong.</p>\n\n<p>The two leaders discussed the progress made on security and intelligence cooperation since Prime Minister Trudeau’s visit to the United Kingdom in March and identified the completion of a free trade agreement between Canada and the United Kingdom as a priority. They also spoke of the essential role of critical minerals in enabling the transition towards green economies and committed to further collaboration to strengthen supply chains. The prime ministers agreed on the importance of G7’s support towards developing countries’ efforts to building sustainable economies.</p>\n\n<p>They agreed to continue working together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/united_kingdom-royaume_uni/index.aspx?lang=eng\">Canada and the United Kingdom</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cuktca-acccru/read_agreement-consultez_accord.aspx?lang=eng\">Canada-UK Trade Continuity Agreement (Canada-UK TCA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a>&nbsp;</li>\n</ul></div>\n      "
}