{
  "path": "/en/news/news-releases/2017/11/30/prime-minister-nominates-next-commissioner-lobbying",
  "pageTitle": "Prime Minister nominates next Commissioner of Lobbying | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Nancy Bélanger as the next Commissioner of Lobbying.</p><p>Nancy Bélanger currently serves as Deputy Commissioner, Legal Services and Public Affairs, with the Office of the Information Commissioner of Canada.&nbsp;Ms.&nbsp;Bélanger’s legal career with the federal Public Service spans more than two decades, including six years as General Counsel for the Office of the Conflict of Interest and Ethics Commissioner.</p><p>The Office of the Commissioner of Lobbying was established in 2008 under the <i>Lobbying Act</i> to support the Commissioner of Lobbying. The Commissioner is responsible for maintaining the Registry of Lobbyists, fostering public awareness of the requirements of the Act, and ensuring compliance with the Act and the Lobbyists' Code of Conduct.</p><p>Under the <i>Lobbying Act</i>, this nomination must be approved by the House of Commons and the Senate.</p><h2>Quote</h2><blockquote><p>“Nancy Bélanger is an excellent candidate for the role of Commissioner of Lobbying. She has an extensive legal background, proven leadership experience, and an exemplary commitment to public service. I have no doubt that Ms. Bélanger will do an outstanding job on delivering the mandate of the Office of the Commissioner of Lobbying Canada.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Ms. Bélanger was chosen as the nominee for the position of the Commissioner of Lobbying through the Government’s open, transparent, and merit-based appointment process.</li><li>The Commissioner of Lobbying is an independent Agent of Parliament, appointed under the <i>Lobbying Act</i> for a term of seven years.</li><li>The appointment is made by the Governor in Council after consultation with the leader of each recognized party in the Senate and House of Commons and approval by resolution of both Houses of Parliament.</li></ul><h2>Biographical Notes</h2><ul><li>&nbsp;<a href=\"/en/news/backgrounders/2017/11/30/nancy-bélanger\">Nancy Bélanger</a></li></ul></div>\n      "
}