{
  "path": "/en/news/news-releases/2018/03/20/prime-minister-announces-new-lieutenant-governor-british-columbia",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Janet Austin as the next Lieutenant Governor of British Columbia.</p><p>Ms. Austin is a remarkable community leader and advocate for social change. She currently serves as the Chief Executive Officer of the YWCA Metro Vancouver, a position she has held since 2003. Prior to joining the YWCA, she was the Executive Director of Big Sisters of BC Lower Mainland and worked for BC Housing.</p><p>Ms. Austin is an active member of various local and national organizations, including the Board of Directors of Translink and the City of Vancouver’s Healthy City for All Leadership Table. During her career, she has served on numerous boards, including the Greater Vancouver Board of Trade and the Canadian Paediatric Society.</p><p>The Prime Minister thanked the outgoing Lieutenant Governor, the Honourable&nbsp;Judith&nbsp;Guichon, for her numerous contributions and her work to engage communities, non-profit organizations, and businesses across the province since taking office in 2012.</p><h2>Quote</h2><blockquote><p>“Ms. Austin is an outstanding leader who has dedicated her career to improving the lives of others. Her advocacy work has helped countless Canadians, and makes her an excellent choice as British Columbia’s next Lieutenant Governor. I know she will work hard to represent the province, and its people, well.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, and visiting communities.</li><li>Lieutenant Governors are appointed by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/03/20/janet-austin\">Janet Austin</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1444999464310\">The Lieutenant Governors</a></li></ul></div>\n      "
}