{
  "path": "/en/news/news-releases/2020/05/03/families-receive-increased-support-through-canada-child-benefit",
  "pageTitle": "Families to receive increased support through the Canada Child Benefit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Families are feeling the social and economic impacts of COVID-19 in their everyday lives. Parents are concerned about putting food on the table, and trying to find creative ways to educate and entertain their kids. This is a difficult time for many families, and we need to continue helping parents and investing in our children.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted that families receiving the Canada Child Benefit (CCB) will get $300 extra per child in May to help them deal with the added pressures of COVID-19.</p>\n\n<p>Eligible families will automatically receive this one-time increase as part of their scheduled CCB payment in May. Those who already receive the CCB do not need to re-apply for this one-time increase. This increase will deliver almost $2 billion in extra support across the country to help families with the high cost of taking care of their kids during this challenging period.</p>\n\n<p>This is just one of the many measures the Government of Canada has put in place to help families weather this crisis. In addition to this one-time CCB increase, we have provided individuals and families with low and modest incomes with a special top-up payment through the Goods and Services Tax credit. This measure gave, on average, close to $400 for single individuals and close to $600 for couples, injecting $5.5 billion into the Canadian economy. We have also extended the tax filing deadline for individuals to June 1, 2020.</p>\n\n<p>The government will continue to monitor and respond to the health, social, and economic impacts of COVID-19. We stand ready to take additional actions as needed to support all Canadians, including families and children, and stabilize the economy.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Parents already know how much the Canada Child Benefit helps with the costs of raising kids. By increasing this benefit for May, we are putting even more money in the pockets of families to help them navigate these uncertain times. We are taking the necessary steps to support families and children, so we can all get through this together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2016, the Government of Canada introduced the CCB, a simpler, tax-free, and more generous child benefit better targeted to those who need it most.</li>\n\t<li>The CCB is a monthly payment made to eligible families to help with the cost of raising children under 18 years of age.</li>\n\t<li>The CCB has had a positive impact on families’ incomes, and has played a key role in reducing child poverty. Since it was introduced, the benefit has put more money in the pockets of about 9 out of 10 Canadian families with children.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update/covid-19-ccb-payment-increase.html\">Canada child benefit (CCB) payment increase</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}