{
  "path": "/en/news/news-releases/2020/12/23/prime-minister-announces-upcoming-appointment-new-chief-defence-staff",
  "pageTitle": "Prime Minister announces the upcoming appointment of the new Chief of the Defence Staff | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the upcoming appointment of Vice-Admiral Art McDonald, currently Commander of the Royal Canadian Navy, as Chief of the Defence Staff. Vice-Admiral McDonald will be promoted to the rank of Admiral and replace the current Chief of the Defence Staff, General Jonathan Vance, who will be retiring from the Canadian Armed Forces.</p>\n\n<p>Vice-Admiral McDonald became Commander of the Royal Canadian Navy in June 2019. Before his appointment, he commanded HMCS <em>Halifax</em>, the Fifth Maritime Operations Group, and Joint Task Force Pacific. Through these and other naval roles, he circumnavigated the globe, led sea-based humanitarian and disaster relief operations, and commanded a multi-national task group in the High Arctic.</p>\n\n<p>In his new role, Vice-Admiral McDonald will oversee the Canadian Armed Forces’ ongoing operations in Canada and around the world, and their contributions to the national response to the COVID-19 pandemic, including support for Canada’s vaccine rollout through Operation VECTOR.</p>\n\n<p>The Prime Minister thanked General Jonathan Vance for his years of distinguished service leading the Canadian Armed Forces. General Vance will continue to serve in his role until the appointment of the new Chief of Defence Staff takes effect at a Change of Command ceremony to be held the week of January 11, 2021.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“At home and abroad, Canadian Armed Forces members have always answered the call of duty, working day in and day out to keep us and our loved ones safe. Vice-Admiral Art McDonald brings decades of experience in a variety of command and staff roles, and I am confident that he will provide dedicated leadership to the Canadian Armed Forces as they continue to respond wherever is needed to protect Canadians and our values.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I thank General Jonathan Vance for his four decades of service to Canada and his immense contribution to the Canadian Armed Forces, as Canada’s longest serving Chief of the Defence Staff. Whether helping develop and implement a new defence policy, supporting our allies overseas, or responding to disasters and a pandemic, he has served with distinction and a strong sense of duty.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I want to extend my congratulations to&nbsp;Vice-Admiral Art McDonald on&nbsp;his upcoming appointment as Chief of the Defence Staff&nbsp;at this important&nbsp;time.&nbsp;Vice-Admiral McDonald&nbsp;will continue the work to transform the culture of the Canadian Armed Forces to ensure&nbsp;zero tolerance for sexual misconduct and harassment while eliminating hateful conduct and systemic racism from the organization. He will also continue the implementation of our unprecedented military&nbsp;investments as outlined in&nbsp;<em>Strong, Secure, Engaged</em>. This fully funded 20-year road map makes sure that our military can meet the challenges of the evolving security environment.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Harjit Sajjan, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“I&nbsp;would like to take&nbsp;this opportunity to thank General Vance for his dedication and service to Canada throughout his career. Over the past five years, General Vance has served with distinction as the Chief of the Defence Staff. His sense of duty has&nbsp;always been&nbsp;driven towards looking after the members of the Canadian Armed Forces and their families.”&nbsp;</p>\n\n<footer class=\"default\">The&nbsp;Hon.&nbsp;Harjit Sajjan,&nbsp;Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Chief of the Defence Staff is responsible for the command, control, and administration of the Canadian Armed Forces, as well as military strategy, plans, and requirements.</li>\n\t<li>The Chief of the Defence Staff is appointed by the Governor General on the recommendation of the Governor in Council. As commander-in-chief of Canada, the Governor General plays a major role in recognizing the importance of Canada’s military at home and abroad.</li>\n\t<li>As part of the national pandemic response, Canadian Armed Forces personnel have:\n\t<ul>\n\t\t<li>deployed to long-term care facilities in Quebec and Ontario.</li>\n\t\t<li>directly supported northern and remote communities.</li>\n\t\t<li>assisted with managing and distributing personal protective equipment.</li>\n\t\t<li>helped with contact-tracing efforts in Ontario.</li>\n\t</ul>\n\t</li>\n\t<li>Operation VECTOR is the Canadian Armed Forces’ logistical planning and operations support to the federal, provincial, and territorial governments for the distribution of COVID-19 vaccines.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/12/23/vice-admiral-art-mcdonald\">Vice-Admiral Art McDonald</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/23/prime-minister-thanks-chief-defence-staff-his-service-canadians\">Prime Minister thanks Chief of the Defence Staff for his service to Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/covid-19-military-response.html\">Military response to COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-vector.html\">Operation VECTOR</a></li>\n</ul></div>\n      "
}