{
  "path": "/en/news/news-releases/2023/03/14/creating-and-securing-good-manufacturing-jobs-nova-scotia",
  "pageTitle": "Creating and securing good manufacturing jobs in Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>When we invest in Canadian manufacturing, we invest in workers, in communities, and in our economy. Last year alone, companies invested billions of dollars in our clean auto sector, creating and securing tens of thousands of good jobs and growing our economy.</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, and the Premier of Nova Scotia, Tim Houston, announced that their governments are working closely with tire manufacturer Michelin to help support a $300&nbsp;million project to modernize their Nova Scotia facilities to use technological innovation to manufacture more efficient tires, including tires for electric vehicles, and cut emissions from operations in the process through electrification.</p>\n\n<p>Pending a final agreement, Michelin could receive up to $44.3&nbsp;million in federal funding through the Strategic Innovation Fund. Michelin will also receive a provincial tax credit of about $61.3&nbsp;million over five years from the Province of Nova Scotia toward their expansion. Through this project, Michelin expects to secure 3,600 good middle-class jobs across the company’s three plants in Bridgewater, Pictou, and Waterville, Nova Scotia, as well as create dozens more.</p>\n\n<p>From mining and processing critical minerals like lithium and aluminum, to building batteries, assembling cars, and manufacturing tires, the Government of Canada is attracting investment all along the electric vehicle value chain. Michelin’s investment is another vote of confidence in Canadians and in Canada – a world leader in manufacturing electric vehicles.</p>\n\n<p>Thanks to the talent and abundance of highly skilled workers and key government investments, we are continuing to build a strong economy that benefits all Canadians. Today’s announcement is yet another step toward a healthier future with clean air and good jobs for generations to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Companies understand the excellence of Canada’s workers and auto sector – and today’s announcement is a testament to that. Here in Nova Scotia, we are once again seeing that when we invest in our workers, we build communities and an economy that works for everyone, while leaving a stronger, healthier future for our kids.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement is great news for the future of Canada’s auto sector. We are proud to partner with Michelin on a project that will support Canada’s advancement in the transportation sector and keep Canada on the cutting edge of the clean economy. With this investment, we are continuing to build a strong auto sector ecosystem by supporting the development of clean technology in the tire industry, creating well-paying jobs, and generating economic benefits for Nova Scotians.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Nova Scotia is an amazing place to do business, and Michelin’s decision to modernize and expand its operations here speaks volumes about our business environment. Michelin’s strong commitment to greening their operations aligns with our government’s plan for a clean and green economy, where the environment and Nova Scotians can thrive, and no one is left behind.”</p>\n\n<footer class=\"default\">The Hon. Tim Houston, Premier of Nova Scotia</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is working to support businesses to grow and prosper, and Michelin has been an important part of our province’s economy for more than 50 years. I’m pleased to see the recently enhanced Capital Investment Tax Credit is encouraging businesses to invest and expand in our province. I hope this expansion will help Michelin thrive for another 50 years in Nova Scotia.”</p>\n\n<footer class=\"default\">The Hon. Susan Corkum-Greek, Nova Scotia’s Minister of Economic Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Michelin is committed to developing the mobility of goods and people, and doing so in a cleaner and more sustainable way. With these investments, we will do exactly that: continue to add capacity in the most strategic segments of the tire market to support the transition to electric vehicles and to energy-efficient freight transportation, while further reducing the environmental footprint of our products and our plants.”</p>\n\n<footer class=\"default\">Alexis Garcin, President and CEO, Michelin North America Inc.</footer>\n</blockquote>\n\n<blockquote>\n<p>“We’re excited to continue to enhance and grow our operations in Canada. We have a wonderful history of manufacturing tires here for more than 50 years, and I’m thrilled we can strengthen the competitiveness of our factories for our current and future workforce.”</p>\n\n<footer class=\"default\">Andrew Mutch, President, Michelin North America (Canada) Inc.</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since 2020, Canada has attracted over $17&nbsp;billion in investments by global automakers and suppliers of electric vehicles batteries and battery materials, securing over 17,000 good middle-class jobs across the country.</li>\n\t<li>Michelin has been manufacturing tires in Nova Scotia since 1971, and currently operates three interdependent tire manufacturing plants in the province.</li>\n\t<li>Michelin is one of the largest private sector employers and the single largest exporter in Nova Scotia.</li>\n\t<li>The auto sector in Canada supports nearly 500,000 workers, contributes $16&nbsp;billion annually to our gross domestic product, and is one of the country’s largest export industries.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://ised-isde.canada.ca/site/strategic-innovation-fund/en\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.michelin.ca/en/\">Michelin Canada</a></li>\n</ul></div>\n      "
}