{
  "path": "/en/news/statements/2018/12/06/statement-prime-minister-national-day-remembrance-and-action-violence",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance and Action on Violence Against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance and Action on Violence Against Women:</p><p>“On December 6, 1989, at l'École Polytechnique de Montréal, 14 young women were brutally murdered, simply because they were women. Today, on the <a href=\"https://swc-cfc.gc.ca/commemoration/vaw-vff/remembrance-commemoration-en.html\">National Day of Remembrance and Action on Violence Against Women</a>, we mourn the loss of these promising young lives. We remember the victims of this hateful act of violence, and unite against the misogyny at the root of this tragedy.</p><p>“This day falls within the <a href=\"https://swc-cfc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism against Gender-Based Violence</a> – a time to take action against the violence and discrimination that continue to affect women, girls, and people of diverse gender identities in Canada and around the world.</p><p>“It is long past time to put an end to this violence and the harm it wreaks on survivors, families, and whole communities. Survivors and advocates are leading the fight for change, and their example inspires all of us. No matter our gender identity, we share a responsibility to be part of the solution and promote women’s rights – and each of us has the power to make a difference in our own communities every day.</p><p>“Taking action means supporting women’s leadership, and creating more opportunities for women to lead. It means listening to women, recognizing their contributions, and fighting inequalities that put the most vulnerable at greater risk. And it means finding the courage to speak out against violence and call for change.</p><p>“Through our <a href=\"https://swc-cfc.gc.ca/violence/strategy-strategie/index-en.html\">Strategy to Prevent and Address Gender-Based Violence</a>, the Government of Canada is taking action to prevent violence, support survivors and their families, and improve how our legal and justice systems respond to cases. This year, we expanded the Strategy, adding more support to prevent teen dating violence and cyber bullying, and to help health professionals provide better care to survivors of violence. Earlier this week, we also announced <a href=\"https://www.canada.ca/en/status-women/news/2018/12/government-of-canada-more-than-doubles-support-to-survivors-of-gender-based-violence.html\">more than $50 million in funding</a> for projects to support survivors and their families in communities across Canada – more than doubling our original funding from Budget 2017.</p><p>“On behalf of the Government of Canada, I invite all Canadians to help put a stop to gender-based violence by listening to survivors, speaking out against violence, and helping to create a culture of respect. We all deserve to live in a world where everyone, regardless of their gender, feels safe, valued, and free to be themselves – and we all have a role to play to make it happen.”</p></div>\n      "
}