{
  "path": "/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-meets-nunavut-premier-pj-akeeagok",
  "pageTitle": "Prime Minister Justin Trudeau meets with Nunavut Premier P.J. Akeeagok | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Nunavut Premier P.J. Akeeagok to discuss shared priorities.</p>\n\n<p>Premier Akeeagok spoke about Nunavut’s recent Full Caucus strategic planning retreat in Cambridge Bay, which included participation from Nunavut Tunngavik Incorporated. He highlighted key priorities identified through this collaborative process designed to help define the Government of Nunavut’s mandate, notably Elder care, education, health and mental health, housing, and diversifying the economy.</p>\n\n<p>The two leaders discussed ways to address the territory’s housing needs and the issue of Elder care. They reaffirmed their commitment to continued cooperation between their two governments on these and other shared priorities, such as ensuring affordable child care for families and fostering economic diversification and growth for communities in Nunavut.</p>\n\n<p>The Prime Minister and Premier looked forward to continued collaboration.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/29/prime-minister-justin-trudeau-speaks-nunavut-premier-pj-akeeagok\">Prime Minister Justin Trudeau speaks with Nunavut Premier P.J. Akeeagok</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/elcc-nr-nunavut.html\">The Government of Canada and the Government of Nunavut announce extension of support for quality early learning and child care across the territory</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n</ul></div>\n      "
}