{
  "path": "/en/news/statements/2021/06/12/joint-statement-prime-minister-canada-justin-trudeau-and-president",
  "pageTitle": "Joint Statement by the Prime Minister of Canada, Justin Trudeau, and the President of the French Republic, Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Mr. Justin Trudeau, Prime Minister of Canada, and Mr. Emmanuel Macron, President of France, met in Carbis Bay, UK on June 12, 2021 on the margins of the G7. They issued the following statement:</p>\n\n<p>The pandemic has hit our countries hard and has taken a heavy human toll. Inspired by the resilience of our people, and driven by a spirit of solidarity, Canada and France reaffirm their commitment to working together to address the multidimensional challenges caused by the health crisis. They reiterate their willingness to cooperate with their international partners, in particular their G7 and G20 partners, to work toward a sustainable and equitable post-COVID recovery.</p>\n\n<p>Canada and France, strengthened by their historical ties built on a foundation of shared values, commit to:</p>\n\n<ul>\n\t<li>fighting the pandemic by strengthening multilateral cooperation and solidarity with developing countries, particularly by donating vaccine doses through Covax;</li>\n\t<li>creating conditions for a recovery focused on youth, gender equality and fundamental rights, and working to reduce economic inequalities in our societies;</li>\n\t<li>working together to reform the rule-based multilateral trading system in order to create a level playing field for companies;</li>\n\t<li>strengthening security cooperation and strategic dialogue in the Sahel and within NATO;</li>\n\t<li>promoting the rapid conclusion of a multilateral agreement on cross-border taxation, on digital information in particular;</li>\n\t<li>developing cooperation on artificial intelligence within the framework of the Global Partnership on Artificial Intelligence (GPIA);</li>\n\t<li>making new commitments on gender equality at the Generation Equality Forum, and advancing equality, diversity, inclusion and the fight against all forms of hatred, discrimination and violence;</li>\n\t<li>promoting, in both countries and internationally, ambitious objectives for the protection of biodiversity in view of COP15 in Kunming, and for the fight against climate change and for carbon neutrality by 2050 for COP26 in Glasgow. This commitment will be set out in a renewed Bilateral Climate and Environment Partnership, which will be adopted shortly;</li>\n\t<li>developing their cultural exchanges and promoting the Francophonie as an expression of cultural diversity and as a space for prosperity and democracy, particularly in view of the next summit of the International Organisation of the Francophonie in Djerba.</li>\n</ul>\n\n<p>Bilaterally, and in order to further strengthen their relations, the Prime Minister and the President of the Republic have asked their ministers to continue preparing for the first meeting of a France-Canada Council of Ministers to be held before the end of 2021.</p></div>\n      "
}