{
  "path": "/en/news/statements/2021/07/06/statement-prime-minister-eighth-anniversary-lac-megantic-tragedy",
  "pageTitle": "Statement by the Prime Minister on the eighth anniversary of the Lac-Mégantic tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the eighth anniversary of the Lac-Mégantic&nbsp;tragedy:</p>\n\n<p>“Eight years ago, in the middle of the night, a train carrying crude oil derailed and exploded in the centre of Lac-Mégantic, Quebec. This tragic accident left 47 people dead and destroyed much of the downtown.</p>\n\n<p>“On this solemn anniversary, we honour the memory of the victims of this railway disaster – the deadliest in our country’s modern history. My thoughts, and the thoughts of all Canadians, are with the residents of Lac-Mégantic as we remember this event that shook the entire country.</p>\n\n<p>“The safety of Canadians is the Government of Canada’s priority. To ensure such a tragedy never happens again, we continue to work with our partners, including the Government of Quebec and regional municipalities, to complete the Lac-Mégantic rail bypass project. Last May, the Government of Canada reached an important milestone by <a href=\"https://www.canada.ca/en/transport-canada/news/2021/05/government-of-canada-announces-agreement-with-canadian-pacific-railway-on-the-lacmegantic-rail-bypass-project.html\">signing an agreement</a> with the Canadian Pacific Railway company that will allow the project to be completed in 2023, despite the challenges created by the pandemic.</p>\n\n<p>“The tragedy on July 6, 2013, marked the city of Lac-Mégantic and its residents. Last year on this date, the community inaugurated the Espace Mémoire. This public space commemorates the victims and is a gathering place for everyone affected by the tragedy.</p>\n\n<p>“Today, the entire country remembers and is inspired by the strength, courage, and resilience of Lac-Mégantic and its residents. Our thoughts are with you. On behalf of the Government of Canada, I encourage all Canadians to pay tribute to those who lost their lives or who suffered in this tragedy.”</p></div>\n      "
}