{
  "path": "/en/news/statements/2023/05/02/joint-statement-prime-minister-and-premier-nunavut",
  "pageTitle": "Joint statement by the Prime Minister and the Premier of Nunavut | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, and the Premier of Nunavut, P.J. Akeeagok, released the following joint statement:</p>\n\n<p>“During today’s meeting we made progress on some key priorities that will make a real difference in the lives of Nunavummiut, the residents of Nunavut. Our bilateral meeting took place as part of ‘Nunavut on the Hill’, a two-day working visit to Parliament where Nunavut’s Cabinet participates in meetings with the federal government. Especially on housing, health care, climate change, Arctic security and sovereignty, and Nunavut devolution, our governments are aligned and committed to working together to achieve concrete results for people in Nunavut and beyond.</p>\n\n<p>“Making life better for people starts with ensuring everyone has a safe and affordable place to live. By investing in and working together to close the housing gap, we can improve people’s health and support healing. Nunavut has developed a plan to work with Inuit, the Government of Canada, and industry partners to build 3,000 homes in the territory by 2030. These partnerships have allowed the Government of Nunavut to start construction on 150 new units this year. Nunavut’s plans align with Canada’s Budget 2023, which announced an additional $4 billion investment to implement an Urban, Rural, and Northern Indigenous Housing Strategy, currently under co-development with Indigenous partners. This strategy is about building on the existing distinction-based housing strategies and could be leveraged to help achieve the territory’s housing goals.</p>\n\n<p>“In Canada, we know how important it is for our universal public health care system to stay strong. But our system needs to work for everyone. Nunavut’s community health centres are facing closures due to limited staffing, and there are additional challenges in delivering health care to communities that are accessible only by air. As part of the Government of Canada’s recent, significant investments to improve health care for people – increasing existing investments by more than $198 billion over the next 10 years – the governments of Canada and Nunavut will continue to advance discussions for health transfers and agreements that meet the territory’s unique circumstances, support Nunavummiut who are aging, ensure Elders can age with dignity at home, and prioritize the collection of health information to deliver better care and modern health infrastructure.</p>\n\n<p>“Canada’s efforts to defend the Arctic coast must always include input from Northerners. As Canada and the United States modernize the North American Aerospace Defense Command (NORAD), they will work together with partners, local communities, and other orders of government, to ensure new infrastructure meets local needs and supports economic reconciliation with Inuit.</p>\n\n<p>“Our governments continue to work together with partners toward a devolution agreement that would provide the Government of Nunavut with authority over the management of public lands, fresh waters, and natural resources. Any agreement would support a smooth transition between government administration and a devolved territory would respect the rights of Nunavummiut.</p>\n\n<p>“On these key priorities and beyond, our governments will continue to work together to achieve real results for Nunavummiut and all Canadians.”</p></div>\n      "
}