{
  "path": "/en/news/news-releases/2020/10/09/prime-minister-announces-additional-support-food-banks-and-local-food",
  "pageTitle": "Prime Minister announces additional support for food banks and local food organizations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone deserves to be able to put nutritious food on their table, but for many Canadians and their families, the past few months have been difficult and uncertain. At the same time, food banks and local food organizations are facing challenges in delivering services to Canadians in need, including in securing volunteers and increasing public health and safety measures. As we continue to deal with the impacts of COVID-19, more Canadians are facing food insecurity, therefore making food banks and organizations key to helping feed families and keeping Canadians healthy and safe.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an additional investment of $100&nbsp;million through the Emergency Food Security Fund. This investment will help improve access to food and increase food supply for vulnerable Canadians across the country, who are facing the impacts of the global COVID-19 pandemic.</p>\n\n<p>The Government of Canada will provide this funding to national and regional organizations, who will then support food banks and local food organizations across Canada in order to help reach people experiencing food insecurity.</p>\n\n<p>As we enter a critical point in the pandemic, food banks, local food organizations, and Indigenous groups will be able to use this funding to ensure vulnerable communities continue to have access to safe and healthy food. The funding will be used to purchase and distribute food and other necessities in order to meet the urgent needs of Canadians. The funds will also be used to hire workers where volunteers are unavailable and buy personal protective equipment to help keep workers, volunteers, and visitors at food banks and local food organizations safe.</p>\n\n<p>The Government of Canada will continue to support all Canadians, and especially our most vulnerable, as we work to build a more resilient Canada. Together, we can create a Canada that is healthier and safer, cleaner and more competitive, and fairer and more inclusive for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With Thanksgiving around the corner, no one should have to worry about putting food on the table. Food banks and local food organizations have been there for Canadians who need them most, and we will continue supporting them. Today, while we continue to deal with the health and economic impacts of COVID-19, we are giving these food banks and local food organizations more support so they can keep helping Canadians feed themselves and their families.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Local food organizations are working tirelessly to help Canadians put food on their tables, and now more than ever they need our support. The funding announced today builds on what we have already achieved through our first round of federal emergency funding, which is helping two million food insecure Canadians through 1,800 local-level projects. To all Canadians who are fortunate enough to have quality food on your kitchen tables this Thanksgiving weekend, I ask that you consider how you can support your local food organizations to help those who might not be in the same position right now.”</p>\n\n<footer class=\"default\">The Hon. Marie-Claude Bibeau, Minister of Agriculture and Agri-Food</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This funding is in addition to the April 3, 2020 announcement made by the Government of Canada for a $100 million investment through the Emergency Food Security Fund, in order to support food security in Canada. To date, this funding has supported over 1,800 individual projects, which are estimated to have helped serve six million safe, healthy, and culturally diverse meals to over two million Canadians. Recipients so far have included Food Banks Canada, Breakfast Club of Canada, Community Food Centres Canada, Second Harvest, and the Salvation Army.</li>\n\t<li>In May 2020, one in seven Canadians were experiencing food insecurity, and almost one in five Canadians living in households with children experienced food insecurity.</li>\n\t<li>COVID-19 has caused disruptions to food security for vulnerable Canadians, including those who have lost sources of income and those who have been disproportionately impacted by the health, social, and economic impacts of the pandemic.</li>\n\t<li>Food banks and local food organizations have also had disruptions during the pandemic as a result of a drop in food and monetary donations, difficulties transporting food to remote communities, and an increase in the cost of food and food distribution. Funding will be delivered through the Emergency Food Security Fund.</li>\n\t<li>In August 2020, the Government of Canada annnounced a $50 million investment through the Surplus Food Rescue Program to distribute food to vulnerable Canadians that would otherwise go to waste. Food banks, local food organizations, and food producers are core partners in delivering this service.</li>\n\t<li>On April 14, 2020, the Government of Canada announced additional supports for food security in the North, including:\n\t<ul>\n\t\t<li>$25 million under Nutrition North Canada to increase subsidies so families can better afford much-needed nutritious food and essential items like hygiene products.</li>\n\t\t<li>$40 million over five years beginning in 2019-2020, and $8 million per year in ongoing funding Nutrition North Canada’s new Harvesters Support Grant. This grant was co-developed with Indigenous partners to increase access to traditional foods by reducing the costs associated with traditional hunting and harvesting.</li>\n\t</ul>\n\t</li>\n\t<li>On April 21, 2020, the Government of Canada announced an investment of $350 million to help community organizations serve vulnerable Canadians during the COVID-19 crisis. As of September 1, 2020, $193.4 million has been disbursed through the <a href=\"https://www.canada.ca/en/services/benefits/emergency-community-support-fund.html\">Emergency Community Support Fund</a>, supporting over 7,134 community projects in this time of crisis. On October 5, 2020, applications for a second round of funding opened through the websites of the three national partners, <a href=\"http://www.redcross.ca/communityorganizations\">Canadian Red Cross</a>, <a href=\"https://www.communityfoundations.ca/initiatives/responding-to-covid-19/\">Community Foundations of Canada</a>, and <a href=\"http://www.unitedway.ca/ecsf\">United Way Canada</a>, who will distribute the funds to community organizations that deliver essential services to those in need.</li>\n\t<li>Canadians are encouraged to continue making donations to food organizations or to volunteer with local organizations when possible.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/03/prime-minister-announces-support-food-banks-and-local-food\">Prime Minister announces support for food banks and local food organizations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/14/prime-minister-announces-health-and-social-support-northern\">Prime Minister announces health and social support for northern communities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/21/prime-minister-announces-further-support-help-canadians-need\">Prime Minister announces further support to help Canadians in need</a></li>\n\t<li><a href=\"https://www.agr.gc.ca/eng/agricultural-programs-and-services/emergency-food-security-fund/?id=1585855025072\">Emergency Food Security Fund</a></li>\n</ul></div>\n      "
}