{
  "path": "/en/news/news-releases/2020/03/13/first-ministers-discuss-collective-efforts-address-impact-covid-19",
  "pageTitle": "First Ministers discuss collective efforts to address the impact of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s First Ministers today spoke about efforts to limit the spread of COVID-19 and minimize its health, economic, and social impacts on Canadians across the country.</p>\n\n<p>After the meeting, First Ministers issued the following joint communiqué:</p>\n\n<p>“Today, First Ministers held a call to discuss the evolving coronavirus (COVID-19) pandemic and the measures taken by federal, provincial and territorial governments to limit the spread of the virus in Canada.&nbsp;</p>\n\n<p>“Dr. Theresa Tam, Canada’s Chief Public Health Officer, joined First Ministers and provided an update on the global and domestic situation. First Ministers agreed to continue their collaborative efforts to address the impacts of COVID-19 in Canada. They discussed measures underway, based on best practices and science, to contain the spread of COVID-19, protect the health and safety of all Canadians, and plan for all scenarios. First Ministers also agreed on the importance of federal-provincial-territorial coordination, communication, and preparedness to reduce potential risks to the health of Canadians and our economy and recognized the strong collaboration to date, in particular by health ministers and officials.</p>\n\n<p>“The Prime Minister reiterated his commitment to work with provinces and territories to address any critical gaps identified by premiers. First Ministers agreed that no one should have to be concerned about job security and financial hardship should they require self-isolation. They discussed ways to work together to support Canadian workers and businesses, by providing supports such as sickness benefits. As part of their collaborative work, First Ministers also agreed on the importance for governments to ensure preparedness to support First Nations, Inuit, and Métis Peoples, and rural and remote communities throughout the country.</p>\n\n<p>“As the number of countries affected by COVID-19 increases, the risk of a domestic and international economic downturn also rises, given the impacts on supply and value chains, commodity prices, global financial markets, export markets, and tourism. First Ministers agreed to take action and to support Canadians’ economic well-being, including through fiscal measures where appropriate to mitigate economic impacts. First Ministers are working together to protect Canadian jobs and provide certainty to businesses. They directed finance ministers to continue regular engagement on this matter.</p>\n\n<p>“First Ministers agreed on the importance of maintaining close collaboration and alignment on the response to combat the COVID-19 outbreak for the health and well-being of all Canadians.”</p></div>\n      "
}