{
  "path": "/en/news/statements/2021/04/12/statement-prime-minister-ramadan",
  "pageTitle": "Statement by the Prime Minister on Ramadan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>The Prime Minister, Justin Trudeau, today issued the following statement on Ramadan: </span></span></span></span></span></p>\n\n<p><span><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“Tonight at sunset, Muslims in Canada and around the world will mark the start of Ramadan.</span></span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“This month-long religious journey is a time of spiritual contemplation, and an opportunity to show gratitude for the many blessings we share, through fasting, prayer, and charitable giving. </span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“Over the coming month, while fasting during the daytime, many Muslim Canadians will continue to be on the front lines of our fight against COVID-19. During these exceptional times, I invite all Canadians to recognize the many contributions Muslim communities have made to our country since the pandemic began, as they have for many generations. </span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“As we continue to follow public health guidelines to keep each other and our communities safe, Muslim Canadians will turn to virtual ways to come together and enjoy iftar with family and friends. Many will also take this time to reflect on the values of gratitude, compassion, and generosity at the heart of Islam. These values, which many Canadians of all backgrounds share, are central to building a safer, healthier, and stronger country for everyone.</span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“On behalf of our family, Sophie and I wish all those celebrating a blessed and peaceful Ramadan.</span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“</span></span><span lang=\"AR-EG\" xml:lang=\"AR-EG\"><span>رمضان مبارك</span></span></span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“Ramadan Mubarak.”</span></span></span></span></span></p></div>\n      "
}