{
  "path": "/en/news/statements/2020/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p>\n\n<p>“On&nbsp;<a href=\"https://www.un.org/en/events/youthday/\">International Youth Day</a>, we celebrate young people in Canada and around the world. This year’s theme, ‘Youth Engagement for Global Action,’ encourages the meaningful engagement and participation of young people in all aspects of political, economic, and social life.</p>\n\n<p>“Young people across Canada are shaping our communities, challenging the status quo, and working to build a better, fairer, and more sustainable future. They have embraced the hard truth that we have to do better. That’s why they are fighting climate change, organizing against systemic racism and intolerance, pushing us along the road to reconciliation, and demanding the freedom to be who they are.</p>\n\n<p>“While the past year has brought hardship and uncertainty to our lives, young Canadians have stepped up and been there to help their families, their neighbours, and their communities. Whether creating online spaces to help others cope with the pandemic or volunteering with a local food bank, they understand the value and power of community, and of being there for one another.</p>\n\n<p>“And the Government of Canada has been there for them. We have provided support to students and new graduates by introducing the <a href=\"https://www.canada.ca/en/revenue-agency/services/benefits/emergency-student-benefit.html\">Canada Emergency Student Benefit</a>, and expanding the <a href=\"https://www.canada.ca/en/employment-social-development/programs/canada-student-loans-grants.html\">Canada Student Loans Program</a>. We have helped young Canadians access jobs as well as research positions and skills development placements during the pandemic, through initiatives such as the <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a>, the <a href=\"https://www.canada.ca/en/employment-social-development/programs/work-integrated-learning.html\">Student Work Placement Program</a>, and <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/canada-summer-jobs.html\">Canada Summer Jobs</a>. We have also helped connect them to wellness, mental health, and substance use resources through the <a href=\"https://ca.portal.gs/\">Wellness Together Canada</a> portal. Because when young people are supported, they can reach their full potential to the benefit of all Canadians.</p>\n\n<p>“The Government of Canada is committed to ensuring the views, ideas, and concerns of young people are at the centre of its decisions. We have been hearing directly from young Canadians about issues that matter to them through my <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council/council.html\">Youth Council</a>, which is currently accepting applications for the next cohort of members. We also launched <a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada’s first-ever youth policy</a> last year. Developed with young Canadians, this policy reflects their values and priorities, and creates opportunities for them to build a stronger and more inclusive Canada. Young people are the leaders of today, and we will keep engaging and supporting them so that – together – we can chart the right path forward for our country and the world.”</p></div>\n      "
}