{
  "path": "/en/news/readouts/2021/01/07/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the twenty-fourth call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>The Prime Minister began by reflecting on the shocking and deeply disturbing violence that unfolded in the United States yesterday. He emphasized the need to work together to keep our democracy strong, healthy, and vibrant. First Ministers discussed the importance of protecting our democracy by upholding democratic principles and institutions, and agreeing on grounding debate on common sets of facts. The Prime Minister noted the strong collaboration between all orders of government since the outset of the pandemic.</p>\n\n<p>First Ministers discussed the continued rise in COVID-19 cases across the country and the collective measures they are taking in response. They agreed to continue to work together closely and in partnership to contain the spread of the virus. While there is light at the end of the tunnel with promising vaccine advancements, they acknowledged the critical work that must continue to protect the health and safety of Canadians. They agreed that the Team Canada approach is the best way to tackle this important challenge. This includes making the best use of testing capacity and resources, such as rapid tests.</p>\n\n<p>First Ministers agreed to continue working together to allocate, distribute, and administer vaccines as efficiently and equitably as possible. With vaccinations of the most vulnerable Canadians well under way across the country, the Prime Minister discussed the significant progress that has been made since the spring to get to this point. First Ministers reiterated the importance of combatting misinformation, and encouraging Canadians to get vaccinated once it becomes available to them.</p>\n\n<p>Across the country, long-term care homes are facing a new round of outbreaks. Protecting the most vulnerable Canadians is the top priority, and First Ministers discussed opportunities to strengthen safety measures and agreed on the importance of sharing best practices and applying innovative solutions to minimize the risk to long-term care residents.</p>\n\n<p>First Ministers discussed the ongoing efforts to limit the spread of COVID-19 at our borders, including the new measures implemented today for pre-departure COVID-19 testing of travellers returning to Canada, and the joint efforts federal and provincial governments are making on testing at airports.&nbsp;</p>\n\n<p>All First Ministers firmly reiterated their commitment to a collaborative approach to fighting COVID-19. As the vaccine rollout continues, they emphasized the need to continue closely coordinating efforts to protect Canadians and limit the increase in cases across the country.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/10/prime-minister-hosts-first-ministers-meeting-fighting-covid-19-and\">Prime Minister hosts First Ministers’ Meeting on fighting COVID-19 and strengthening health care</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/01/new-pre-departure-covid-19-testing-requirements-come-into-effect-for-all-air-travellers-flying-into-canada.html\">New pre-departure COVID-19 testing requirements come into effect for all air travellers flying into Canada</a></li>\n</ul></div>\n      "
}