{
  "path": "/en/news/statements/2022/09/28/statement-prime-minister-international-safe-abortion-day",
  "pageTitle": "Statement by the Prime Minister on International Safe Abortion Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Safe Abortion Day:</p>\n\n<p>“Today, on International Safe Abortion Day, we reaffirm our unwavering commitment to upholding a woman’s fundamental right to choose. No one should ever be forced to carry an unwanted pregnancy, and the Government of Canada is unequivocal in that pursuit.</p>\n\n<p>“Here in Canada, we have had access to safe and legal abortions for almost 35 years thanks to decades of hard-fought activism. Abortion is covered under our universal health care system. But there is still more work to be done to improve accessibility, particularly in rural and remote communities. In May, the Government of Canada announced funding to support civil society organizations, such as Action Canada for Sexual Health and Rights and the National Abortion Federation Canada, to strengthen access to safe and inclusive sexual and reproductive health services, including by offering financial assistance to cover travel costs for those seeking an abortion and training for health care providers offering abortion services.</p>\n\n<p>“Abortions are an essential health service which, when performed following medical guidelines, are safe. Unfortunately, nearly half of all abortions performed worldwide are unsafe and these unsafe abortions are a leading cause of maternal deaths. Tragic and preventable deaths will continue for as long as women are denied the right to make choices for their own bodies. That’s why we’re helping to advance sexual and reproductive health and rights in developing countries, with funding to improve access to safe abortions, post-abortion care, and family planning.</p>\n\n<p>“Today, we reflect on the progress we have made and the work that still needs to be done to ensure everyone has access to a safe abortion, including standing up to those who want to take us backwards. To those at home and around the world continuing to fight for their safety and their bodily autonomy: know that we will always stand up for your right to choose.”</p></div>\n      "
}