{
  "path": "/en/news/statements/2022/02/07/statement-prime-minister-death-honourable-donald-johnston",
  "pageTitle": "Statement by the Prime Minister on the death of the Honourable Donald Johnston | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of the Honourable Donald Johnston:</p>\n\n<p>“I was saddened to learn of the passing of Donald Johnston, former federal Cabinet minister, Secretary‑General of the Organisation for Economic Co‑operation and Development (OECD), and President of the Liberal Party of Canada.</p>\n\n<p>“A lawyer by training and a politician by vocation, Mr. Johnston was also a published author of several articles and books, including a best-selling memoir, and a talented musical composer. From 1978 to 1988, he served as Member of Parliament representing the city of Montréal, and held a number of key Cabinet positions, including President of the Treasury Board and Minister of Justice and Attorney General of Canada.</p>\n\n<p>“Mr. Johnston served as the President of the Liberal Party of Canada from 1990 through 1993. He then became the first Canadian to take office as the Secretary‑General of the OECD from 1996 to 2006. Under his stewardship, the OECD implemented recommendations for good governance and expanded dialogue on matters of global concern such as democracy and economic development.</p>\n\n<p>“Over the course of his lifetime, Mr. Johnston was awarded numerous honours, both at home and abroad. He was made a member of the Queen’s Privy Council for Canada, the Queen’s Counsel, and the Order of Canada. He was also awarded France’s Légion d’honneur and Japan’s Grand Cordon of the Order of the Rising Sun, as well as honorary doctorates from several institutions, including McGill University, King’s College in London, United Kingdom, and the University of Economics in Bratislava, Slovakia.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our deepest condolences to Mr. Johnston’s family, friends, and colleagues. He was a visionary leader, a gifted politician, and a dedicated educator. His contributions to Canada will not be forgotten.”</p></div>\n      "
}