{
  "path": "/en/news/readouts/2023/03/30/prime-minister-justin-trudeau-speaks-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Barbados, Mia Mottley.</p>\n\n<p>The two leaders discussed the importance of improving access to concessional financing for countries vulnerable to the impacts of climate change. They agreed to work together to address today’s global financing needs of developing countries through innovative and inclusive solutions. They also committed to work jointly to advance efforts to reform the international financing system. This would ensure equitable access to resources needed to achieve the Sustainable Development Goals (SDGs).</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley expressed concern over the deteriorating security in Haiti and the need to help address the political, security, and humanitarian crises in the country. They emphasized the importance of CARICOM’s role in supporting an inclusive political dialogue and recommitted to working together to help address the urgent needs of the Haitian people.</p>\n\n<p>The leaders also spoke about their roles as co-chairs of the United Nations Secretary-General’s SDG Advocates group and next steps to advance priorities and to ensure continued progress.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley agreed to continue to work closely together.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n\t<li><a href=\"https://migrationnetwork.un.org/events/2023-sdg-summit\">2023 SDG Summit</a></li>\n</ul></div>\n      "
}