{
  "path": "/en/news/readouts/2022/03/01/prime-minister-justin-trudeau-speaks-south-african-president-cyril",
  "pageTitle": "Prime Minister Justin Trudeau speaks with South African President Cyril Ramaphosa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of South Africa, Cyril Ramaphosa, about Russia’s illegal invasion of Ukraine’s sovereign territory.</p>\n\n<p>The Prime Minister strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. Both leaders expressed their profound concern for the human cost of armed conflict and agreed on the importance of international humanitarian law and the Charter of the United Nations. The leaders discussed efforts to bring an end to this unnecessary conflict that will have far-reaching global impacts, including for developing countries emerging from the pandemic. The Prime Minister and the President also discussed how they could work together to help ensure a strong and rapid global response to the situation in Ukraine.</p>\n\n<p>The two leaders reaffirmed their shared commitment to maintaining and strengthening the deep relationship between Canada and South Africa, including on pandemic recovery and climate change. They expressed their strong commitment to continue working closely together at the G20, within the Commonwealth, and at the United Nations to promote global peace, security, and stability for greater shared prosperity.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/southafrica-afriquedusud/bilateral_relations_bilaterales/canada_south-africa-afrique-du-sud.aspx?lang=eng\">Canada-South Africa Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/05/prime-minister-justin-trudeau-speaks-president-south-africa-cyril\">Prime Minister Justin Trudeau speaks with President of South Africa Cyril Ramaphosa</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}