{
  "path": "/en/news/news-releases/2020/03/05/more-1-million-canadians-lifted-out-poverty",
  "pageTitle": "More than 1 million Canadians lifted out of poverty | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada’s plan for Canadians has focused on making life more affordable for families, and helping those who need it the most. By cutting taxes, supporting families, and creating new jobs, we are making sure that everyone has a fair chance to succeed.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited a Boys &amp; Girls Club in Scarborough, Ontario, where he highlighted how important government initiatives have helped lift more than 1 million Canadians out of poverty since 2015 – including 334,000 children and 73,000 seniors. The Government of Canada has made reducing poverty a core priority, and introduced the country’s first-ever Poverty Reduction Strategy in 2018 to set clear goals and help Canadians, no matter where they live or where they come from.</p>\n\n<p>All Canadians benefit when we invest in programs that help the middle class, grow our economy, and reduce poverty. That’s why the Canada Child Benefit, which provides more money to nine out of ten Canadian families, was introduced in 2016. The benefit has been increased twice to keep up with the cost of living, and is putting more money back into the pockets of Canadian families to help with the realities of raising children.</p>\n\n<p>Canadians are also seeing advantages of the increase to the Guaranteed Income Supplement for seniors, and the middle class tax cut. These initiatives are giving more money to people who need it most, helping families make ends meet, and giving seniors the secure retirement that they deserve.</p>\n\n<p>To make life more affordable and reduce chronic homelessness, the Government of Canada also provided a once-in-a-generation investment in Canada’s very first National Housing Strategy. Through the Strategy, more Canadians will have access to a safe and affordable place to call home thanks to initiatives like the Canada Housing Benefit.</p>\n\n<p>While poverty affects everyone differently, reducing its impact benefits all Canadians. As we reduce poverty levels in our country, we are making our communities stronger and more resilient, promoting economic growth, increasing opportunities for young people, and helping more Canadians join the middle class. We will continue to work towards creating a better country and reduce poverty for everyone, regardless of where they live in Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Across the country, more families are able to give their children the best possible start in life, more seniors are able to enjoy their retirement, and more Canadians are able to reach their full potential. There’s much more to do for all Canadians, and we will continue to take action so everyone has a real and fair chance at success.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The results of 2018 Canadian Income Survey released last week show that the percentage of people living in poverty in Canada continues to decrease.</li>\n\t<li>The survey provides a portrait of the income and income sources of Canadians, and has been used to assess the economic well-being of individuals and families in Canada.</li>\n\t<li>Poverty rates have decreased in all 10 provinces since 2015. Since 2017, poverty has decreased in Nova Scotia by 2.5 percentage points, in New Brunswick by 1.8 percentage points, and in British Columbia by 1.4 percentage points.</li>\n\t<li>On August 21, 2018, the Government of Canada released Opportunity for All, Canada’s First Poverty Reduction Strategy, which contained long-term commitments to guide current and future government actions and investments to reduce poverty, including establishing the Market Basket Measure as Canada’s Official Poverty Line.</li>\n\t<li>The Market Basket Measure of low income develops thresholds of poverty based upon the cost of a basket of food, clothing, shelter, transportation, and other items for individuals and families representing a modest, basic standard of living.</li>\n\t<li>Statistics Canada recently released the <em><a href=\"https://www150.statcan.gc.ca/n1/en/catalogue/75F0002M2020002\">Report on the second comprehensive review of the Market Basket Measure</a></em>. The paper describes the proposed changes to update Canada’s official poverty line, which will be validated by Statistics Canada and Employment and Social Development Canada over the coming months.</li>\n\t<li>Canada's First Poverty Reduction Strategy targets a 20 per cent reduction in poverty by 2020 and a 50 per cent reduction in poverty by 2030, relative to 2015 levels.</li>\n\t<li>These targets are aligned with the United Nations Sustainable Development Goals to end poverty.</li>\n\t<li>Across Canada between July 2018 and June 2019, nearly 3.7 million families received close to $24 billion in annual Canada Child Benefit payments.</li>\n\t<li>The Government of Canada is also making long-term investments in areas such as housing, clean water, health, transportation, early learning and child care, and skills and employment, which will help address multiple dimensions of poverty.</li>\n\t<li>The Government of Canada announced a 10-year, $55 billion <a href=\"https://www.placetocallhome.ca/\">National Housing Strategy</a> that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. The strategy sets clear goals to remove 530,000 Canadians from housing need and reduce chronic homelessness.</li>\n\t<li>The Government of Canada will invest $2 billion in the Canada Housing Benefit across the country, which will be cost-matched by provinces and territories for a total $4-billion investment over 8 years, starting in spring 2020.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www150.statcan.gc.ca/n1/daily-quotidien/200224/dq200224a-eng.htm\">2018 Canadian Income Survey</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/poverty-reduction/reports/strategy.html\">Canada’s First Poverty Reduction Strategy</a></li>\n</ul></div>\n      "
}