{
  "path": "/en/news/news-releases/2016/05/11/prime-minister-announces-action-alberta-wildfires",
  "pageTitle": "Prime Minister announces action on Alberta wildfires | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada will stand shoulder to shoulder with the people of Fort McMurray in the wake of the devastating Northern Alberta wildfires.</p>\n<p>The Prime Minister, Justin Trudeau, today announced the creation of a new ad hoc Cabinet committee to coordinate federal efforts to help the thousands of Canadians affected by the wildfires that raged through Northern Alberta in May of 2016.</p>\n<p>The <em>Ad Hoc Committee on Northern Alberta Wildfires</em> will meet as required to consider and coordinate federal contributions to recovery and rebuilding efforts for those affected by the May 2016 Northern Alberta wildfires.&nbsp;</p>\n<p><strong>Chair</strong><br>The Honourable Kent Hehr</p>\n<p><strong>Vice-Chair</strong><br>The Honourable Patricia A. Hajdu</p>\n<p><strong>Members</strong><br>The Honourable Ralph Goodale<br>The Honourable Navdeep Singh Bains<br>The Honourable Jane Philpott<br>The Honourable Jean-Yves Duclos<br>The Honourable James Gordon Carr<br>The Honourable MaryAnn Mihychuk<br>The Honourable Amarjeet Sohi</p>\n<p>The ad hoc Cabinet committee will hold its first meeting on May 12, 2016, and will complement the ongoing efforts on the ground coordinated through the Government Operations Centre.</p>\n<p>The people of Fort McMurray can count on the full support of this government. We will weather this storm together – and together, we will rebuild.</p>\n<p><strong>Quotes</strong></p>\n<p>“The new ad hoc Cabinet committee is part of our work to address both the urgent and long term needs of communities affected by the Northern Alberta wildfires. We are working closely with Alberta Premier Notley and local authorities to coordinate recovery and rebuilding efforts for the many thousands who have been displaced and left homeless.”<br><em>– The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canadians across the country have responded with generosity to the appeal by the Canadian Red Cross. The pledges made until the end of May will be matched by both the Government of Canada and the Government of Alberta. Canadians helping others – no matter the distance that separates them – is what this country is all about. I would especially like to thank the brave first responders who have worked tirelessly to fight this fire. We are committed to help the people of Fort McMurray and the surrounding area rise out of this disaster.”<br><em>– The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts </strong></p>\n<ul>\n<li>As part of its initial response, the Government of Canada will match every dollar donated to the Canadian Red Cross in support of the Fort McMurray relief effort. The commitment will apply to individual charitable donations made within Canada; it will be backdated to May 3<sup>rd</sup>, 2016; and, it will continue until May 31<sup>st</sup>, 2016. There will be no financial cap on the federal government's contribution.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.redcross.ca/\">Canadian Red Cross</a></li>\n<li><a href=\"https://www.canada.ca/en/services/policing/alberta-wildfires.html\">The Government of Canada’s response to the Alberta Wildfires</a></li>\n</ul></div>\n      "
}