{
  "path": "/en/news/statements/2022/07/11/statement-prime-minister-imamat-day",
  "pageTitle": "Statement by the Prime Minister on Imamat Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Imamat Day:</p>\n\n<p>“Today, we join Ismaili Muslims in Canada and around the world to celebrate Imamat Day. This day marks the milestone 65th anniversary of the accession of His Highness Prince Karim Aga Khan&nbsp;IV as the 49th hereditary Imam – spiritual leader – of Shia Ismaili Muslims.</p>\n\n<p>“Since inheriting the Office of the Ismaili Imamat, the Aga Khan has worked to improve the lives of all people, regardless of their birthplace, background, or religious beliefs. Through the work of the Aga Khan Development Network, His Highness has championed access to health care and education, promoted financial inclusion, and helped develop infrastructure in underserved regions.</p>\n\n<p>“The Aga Khan promotes the values of compassion, openness, and respect for diversity and human rights – values that Canadians hold dear. In recognition of these shared values and his contributions to Canada and the world, His Highness was granted honorary Canadian Citizenship in 2010. The establishment of the Global Centre for Pluralism&nbsp;in Ottawa is a demonstration of our shared commitment to building a more pluralistic world. Canada is also home to the Aga Khan Museum in Toronto – the first museum solely dedicated to Islamic arts and cultures in North America.</p>\n\n<p>“Today we also recognize that this year marks the 50th anniversary of the Ugandan Asian resettlement. In 1972, Canada welcomed thousands of refugees from Uganda, many of whom were Ismaili Muslims, and the Aga Khan played a central role in securing their arrival. In the decades since, the Ismaili communities in Canada have grown, thrived, and contributed to making Canada a stronger, more prosperous, and more diverse country in many significant ways.</p>\n\n<p>“On behalf of our family, Sophie and I extend our most sincere wishes to His Highness Prince Karim Aga Khan and thank him for his persistent efforts to make our world a better place.</p>\n\n<p>“Khushiali Mubarak!”</p></div>\n      "
}