{
  "path": "/en/news/news-releases/2020/05/26/prime-minister-join-secretary-general-and-prime-minister-jamaica",
  "pageTitle": "Prime Minister to join UN Secretary General and the Prime Minister of Jamaica to convene high-level meeting to address economic devastation caused by COVID‑19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Ministers Justin Trudeau and Andrew Holness of Canada and Jamaica, and UN Secretary-General António Guterres will convene a special high-level meeting on 28 May to advance concrete solutions to the development emergency caused by the COVID‑19 pandemic.</p>\n\n<p>The Event, which will be virtual, will open with a High-Level Segment in which Heads of State and Government will express their commitment to decisively facilitate global solutions to address the global economic crisis and its effects on the most vulnerable.</p>\n\n<p>A High-Level Panel of leaders from international institutions will discuss the challenges and opportunities to act quickly on the six issues:</p>\n\n<ol>\n\t<li>The need to expand liquidity in the global economy and maintain financial stability to safeguard development gains.&nbsp;</li>\n\t<li>The need to address debt vulnerabilities for all developing countries to save lives and livelihoods for billions of people around the world.&nbsp;</li>\n\t<li>The need to create a space in which private sector creditors can proactively engage in effective and timely solutions.</li>\n\t<li>Prerequisites for enhancing external finance for inclusive growth and creating jobs, including lowering the transactions costs of remittances.</li>\n\t<li>Measures to expand fiscal space and foster domestic resource mobilization by preventing illicit financial flows.</li>\n\t<li>Ensuring a sustainable and inclusive recovery by aligning recovery policies with the Sustainable Development Goals.</li>\n</ol>\n\n<p>Following the Panel, the High-Level Response Segment among Heads of State and Government, and partners will continue.</p>\n\n<p>COVID-19 has so far claimed more than 344,000 lives, with more than 5.3 million confirmed cases. It will cause the global economy to sharply contract this year, throwing more than 300 million people out of work and pushing more than 30 million people into extreme poverty.</p>\n\n<p>The COVID-19 pandemic and the social and economic crisis it triggered, will derail chances to achieve the 2030 Agenda for Sustainable Development – unless there is a commensurate global response that reaches at least 10 percent of global GDP. This response must be rapid, and must provide support to all countries in need, in order to rebuild even better and more resilient economies and societies.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li>Webcast<strong>: </strong><a href=\"http://webtv.un.org\">http://webtv.un.org</a> from 8 a.m. to 12 p.m. (EDT), May 28</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li>Event website <a href=\"https://www.un.org/en/coronavirus/financing-development\">https://www.un.org/en/coronavirus/financing-development</a></li>\n</ul></div>\n      "
}