{
  "path": "/en/news/news-releases/2017/11/11/prime-minister-concludes-visit-vietnam-and-apec-leaders-meeting",
  "pageTitle": "Prime Minister concludes visit to Vietnam and to the APEC Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the Asia-Pacific Economic Cooperation (APEC) Leaders’ Meeting hosted by Vietnam.</p><p>During the meeting, Prime Minister Trudeau reaffirmed Canada’s commitment to progressive trade that creates good, middle class jobs and benefits all members of society, including women, youth, and Indigenous Peoples.</p><p>On the margins of the Leaders’ Meeting, the Prime Minister, joined by Canada’s Special Envoy to Myanmar, the Honourable Bob Rae, met with Myanmar State Counsellor Aung San Suu Kyi. They raised Canada’s ongoing concerns about the crisis in Myanmar affecting vulnerable populations, including the Rohingya, and discussed ways in which Canada could contribute to lasting peace and reconciliation in Myanmar.</p><p>The Prime Minister also met with his counterparts from other APEC member economies, including Australia, Japan and Mexico, to discuss issues of mutual interest.</p><p>Prime Minister Trudeau, along with the Minister of International Trade, François-Philippe Champagne, welcomed progress made on a framework for a new comprehensive and progressive Trans-Pacific Partnership.</p><p>Alongside members of the Canadian delegation and the Canadian Armed Forces, the Prime Minister participated in a Remembrance Day ceremony to remember and honour the brave Canadian women and men in uniform who fought for our country.</p><h2>Quotes</h2><blockquote><p>“I would like to thank President Trần Đại Quang for hosting a successful and productive APEC Leaders’ Meeting. Canada will continue to work closely with Asia-Pacific partners towards deeper economic cooperation, to build a stronger middle class and create more opportunities for all people in the Asia-Pacific region.”<br>–&nbsp;<cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada is committed to free and fair trade that creates good, middle class jobs and better serves all of our citizens. We will continue to advocate for progressive trade agreements that recognize workers’ rights, the environment, and gender equality, while standing up for Canadians and Canadian jobs.”<br>– <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>During the APEC-ASEAN Informal Dialogue session, Prime Minister Trudeau commemorated the 50<sup>th</sup> anniversary of the Association of Southeast Asian Nations (ASEAN) and affirmed the importance of APEC-ASEAN cooperation. He also noted Canada’s 40<sup>th</sup> anniversary as a Dialogue Partner for ASEAN.</li><li>The APEC forum was established in 1989 and has become the most important economic forum in the Asia-Pacific region. Its primary purpose is to facilitate economic growth and prosperity in the region, with the vision of creating a seamless regional economy. Canada is a founding member.</li><li>Canada supports Vietnam’s theme for 2017 “Creating new dynamism, fostering a shared future,” which seeks to generate momentum for economic growth and integration in the region while promoting a peaceful and interconnected Asia-Pacific region.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/apec/declarations.aspx?lang=eng\">APEC Declarations and Statements</a></li><li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li><li><a href=\"http://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/tpp-ptp/index.aspx?lang=eng&amp;menu_id=95\">Canada and Asia-Pacific Trade</a></li><li><a href=\"http://www.international.gc.ca/asia_pacific-asie_pacifique/index.aspx?lang=eng\">Canada and Asia-Pacific</a></li><li><a href=\"http://www.international.gc.ca/asia_pacific-asie_pacifique/index.aspx?lang=eng\"></a><a href=\"https://www.canada.ca/en/global-affairs/news/2017/11/minister_champagnewelcomesprogressonthecomprehensiveandprogressi.html\">Minister Champagne Welcomes Progress on the Comprehensive and Progressive Trans-Pacific Partnership</a></li></ul></div>\n      "
}