{
  "path": "/en/news/statements/2019/05/16/statement-prime-minister-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p>\n\n<p>“Today, on the <a href=\"https://may17.org/\">International Day Against Homophobia, Transphobia, and Biphobia</a>, we come together to call for a world where we can all live with respect, safety, and freedom – no matter who we love or how we identify.</p>\n\n<p>“This year’s national theme is, ‘Online violence has real consequences.’ For many LGBTQ2 people, online platforms provide supportive and inclusive spaces where everyone is free to be who they are and express themselves. But these online spaces are often targets for bullying and harassment. Online services providers are taking action, but we must do more to stop the spread of online violence and hate.</p>\n\n<p>“We all have a role to play to make sure LGBTQ2 people feel safe and can participate fully in Canadian society. The Government of Canada is working with LGBTQ2 communities and organizations in Canada and around the world to break down barriers and make equality a reality.</p>\n\n<p>“Every day, advocates and organizations – like <a href=\"https://www.fondationemergence.org/?lang=en\">Fondation Émergence</a>, which created the first day against homophobia&nbsp;in 2003 – bring Canadians together in the fight against homophobia, transphobia, and biphobia. To help address the unique needs of LGBTQ2 Canadians, and the persisting disparities they face, <a href=\"https://www.budget.gc.ca/2019/docs/plan/chap-04-en.html#expanding-the-work-of-the-lgbtq2-secretariat\">Budget 2019</a> committed additional support for the community-level organizations leading the work to bring about change.</p>\n\n<p>“Beyond our borders, we are helping to fund and support Canadian organizations that are advancing human rights and improving the quality of life for LGBTQ2 people in developing countries. Canada will continue to advocate for LGBTQ2 rights, including through our leadership as the current co-chair of the Equal Rights Coalition. These measures are important steps toward eliminating the barriers faced by LGBTQ2 communities around the world.</p>\n\n<p>“This year, we mark 50 years since the partial decriminalization of homosexuality, one step in the ongoing battle for equality for LGBTQ2 communities in Canada. To commemorate the milestone anniversary, the Royal Canadian Mint launched a new <a href=\"https://www.mint.ca/store/news/news-34900031?cat=News+releases&amp;nId=700002&amp;parentnId=600004&amp;nodeGroup=About+the+Mint&amp;lang=en_CA#.XN3ss0xFzZk\">$1&nbsp;‘Equality’ coin</a>. The coin recognizes the progress we have made to recognize and protect the rights of LGBTQ2 Canadians, and values of diversity, inclusion, and equality that continue to drive this work and define our country.</p>\n\n<p>“Today, and every day, I encourage Canadians to strive for a future where everyone – regardless of their gender expression, gender identity, or sexual orientation – can live in equality and freedom.”</p></div>\n      "
}