{
  "path": "/en/news/news-releases/2022/07/21/delivering-clean-air-and-good-jobs-nova-scotia",
  "pageTitle": "Delivering clean air and good jobs in Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>When we invest in clean energy projects like wind, solar, and hydroelectricity, we deliver on key promises we made to Canadians: clean air, good jobs, and a strong economy. And by working in partnership with Indigenous communities on these projects, we do all of this while advancing reconciliation.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a new federal investment of up to $255&nbsp;million to deliver clean power to homes across Nova Scotia and create hundreds of good middle-class jobs.</p>\n\n<p>With up to $125 million, new wind energy projects will provide clean power to around 350,000 homes in Nova Scotia, create hundreds of good jobs, and deliver benefits to local Indigenous communities, including jobs and training.</p>\n\n<p>With up to $130&nbsp;million, we’re also investing so that Nova Scotia Power can install batteries to store clean energy at four sites across the province. These batteries will help provide reliable electricity to homes and businesses and support the closure of coal-fired power plants, delivering cleaner air for Nova Scotians. With this investment, Nova Scotia will have one of the largest battery systems in North America.</p>\n\n<p>This new funding, in combination with the Atlantic Loop, will build a more integrated clean energy grid in Nova Scotia and support our ambitious and achievable climate goals. We will continue to make smart investments to deliver clean air, good jobs, and a strong economy for generations to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s investments in clean energy projects in Nova Scotia will cut pollution and create good jobs. When we power our homes and businesses with clean electricity, we deliver cleaner air and a better future for our kids and grandkids.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is delivering investments that will support Indigenous communities and all Nova Scotians in developing a cleaner electricity grid while creating sustainable jobs. Today’s announcement is an important step toward our goal of achieving a net-zero-emitting electricity system by 2035.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>&nbsp;The projects are part of a competitive federal and provincial process. The allocation and exact amounts of federal funding will be confirmed once this process is complete and agreements are finalized.&nbsp;</li>\n\t<li>Canada has a goal of achieving a net-zero electricity system by 2035, as outlined in the <em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em> that was launched this spring.</li>\n\t<li>The <em>2030 Emissions Reduction Plan</em> is an ambitious and achievable sector-by-sector approach for Canada to reach its new climate target of cutting emissions by at least 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n\t<li>Canada already has one of the cleanest electricity grids in the world, with nearly 83 per cent of the electricity that Canadians use coming from non-emitting sources.</li>\n\t<li>Almost 75 per cent of Nova Scotia’s electricity is currently generated from fossil fuels, including 47 per cent from coal. Today’s funding will help the province meet its goal of achieving 80 per cent renewable energy for its electricity needs by 2030.</li>\n\t<li>Moving away from coal-fired electricity has helped improve public health in Canada and around the world by creating cleaner, more breathable air.</li>\n\t<li>To cut pollution from electricity, the <a href=\"https://www.nrcan.gc.ca/climate-change-adapting-impacts-and-reducing-emissions/green-infrastructure-programs/smart-renewables-and-electrification-pathways-program/23566 \">Smart Renewables and Electrification Pathways Program</a> aims to support electrical grid modernization projects across the country. The program focuses on replacing fossil-fuel generated electricity with renewables.</li>\n\t<li>This spring, the <a href=\"https://www.nrcan.gc.ca/energy/electricity-infrastructure/electricity-infrastructure-publications/clean-power-roadmap-for-atlantic-canada/24190\">Clean Power Roadmap for Atlantic Canada</a>, developed by the federal government with the Atlantic provincial governments and their respective utilities, with input from the Government of Quebec and Hydro-Québec as observers, was released. The roadmap is a collective Atlantic Canadian vision for an interconnected clean power grid that would serve as the foundation for a competitive, electrified economy across the Atlantic region.</li>\n\t<li>In addition to today’s announcement, the Government of Canada, the governments of the Atlantic Provinces and Quebec, and their respective utilities continue to work to advance the Atlantic Loop to expand electrical interconnections and move clean power among the Atlantic Provinces and Quebec.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/clean-air-and-a-strong-economy.html\">Budget&nbsp;2022 Backgrounder: Clean Air and a Strong Economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nrcan.gc.ca/climate-change-adapting-impacts-and-reducing-emissions/green-infrastructure-programs/smart-renewables-and-electrification-pathways-program/23566\">Smart Renewables and Electrification Pathways Program</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\"><em>2030 Emissions Reduction Plan: Clean Air, Strong Economy</em></a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy/electricity-infrastructure/electricity-infrastructure-publications/clean-power-roadmap-for-atlantic-canada/24190\">Clean Power Roadmap for Atlantic Canada</a></li>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a></li>\n</ul></div>\n      "
}