{
  "path": "/en/news/statements/2020/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement to mark the New Year:</p>\n\n<p>“Tonight, across the country, Canadians will count down to midnight to welcome a new year, and reflect on the one that has passed.</p>\n\n<p>“This year has been challenging for many of us. We have experienced a global pandemic that has threatened our health, our economy, and our very way of life. We have seen acts of senseless violence that have devastating impacts on our communities. And, we have heard heartbreaking stories and calls for justice from racialized Canadians and Indigenous peoples, demanding that we act now to address racism, discrimination, and injustices in our country.</p>\n\n<p>“Through the mental, physical, and financial toll of these past 12 months, we have also seen Canadians show strength, resilience, and a willingness to work together. Communities have taken steps to support their most vulnerable, families and businesses have made sacrifices to keep others safe, and people from coast to coast to coast have fought for a better, fairer future for everyone. These actions should inspire us all as we move into the next year.</p>\n\n<p>“In 2021, we will continue our fight against COVID-19 with a renewed sense of hope. Canadians have already started to receive doses of safe and effective vaccines. We have the most diverse vaccine portfolio of any country, and we continue to work with provinces and territories, and Indigenous communities and partners, to ensure that all Canadians will have free access to vaccines as soon as possible. We will also keep doing what it takes, for as long as it takes, to support people and businesses through the crisis.</p>\n\n<p>“Businesses, entrepreneurs, workers, and all Canadians have shown incredible resilience and resolve throughout the many challenges they have faced this year. And we have taken action to have people’s backs every step of the way. We created measures like the Canada Emergency Wage Subsidy, the Canada Emergency Business Account, and the new Canada Emergency Rent Subsidy to help hundreds of thousands of businesses, charities, and non-profits pay their bills and keep their workers on the payroll. We have also supported Canadians who have lost their income due to the pandemic – including the 8.9 million Canadians who received the Canada Emergency Response Benefit this year – and are continuing to provide income support through <a href=\"https://www.canada.ca/en/services/benefits/ei/cerb-application/transition.html\">new recovery benefits and changes to Employment Insurance</a>.</p>\n\n<p>“The challenges we have faced this year have shown how important it is to build back better. As we recover from this crisis, we must take every opportunity to make our country stronger, more sustainable, and more just for everyone. That means building a more inclusive economy, and working with our partners to address the systemic barriers that discriminate against too many Canadians, making it harder for them to succeed. It means taking further climate action, and investing in clean energy and technologies. And it means taking action to ensure all Canadians are safe, involved, and supported in their communities.</p>\n\n<p>“In this past year alone, we have already taken some major steps toward these goals. We introduced a <a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">strengthened climate plan</a> so we can meet and exceed our international climate commitments, reduce pollution, create jobs and new opportunities for businesses, and build a healthier, cleaner, more resilient future for all Canadians. We also launched our country’s first <a href=\"http://www.ic.gc.ca/eic/site/150.nsf/eng/home\">Black Entrepreneurship Program</a> to support Black entrepreneurs and business owners in partnership with Canadian financial institutions, and introduced legislation to allow for the <a href=\"https://www.justice.gc.ca/eng/declaration/index.html\">implementation</a> of the United Nations Declaration on the Rights of Indigenous Peoples. In addition, we took action to protect our communities from gun violence by banning over 1,500 models and variants of assault-style firearms and some of their components.</p>\n\n<p>“As we wrap up this year and move into a new one, I invite Canadians to reflect on all that we have learned about ourselves – our perseverance, our ingenuity, and our compassion for others. I also express my gratitude to those working on the front lines of the pandemic, who put the interests of their neighbours, their communities, and their country ahead of their own every day. The pandemic has shown us what we can accomplish and overcome when we all work together toward shared goals and values. Now, as we look to the opportunities that await us in 2021, let us all continue to build a Canada that is stronger, fairer, and more equitable for everyone.”&nbsp;</p></div>\n      "
}