{
  "path": "/en/news/news-releases/2015/11/25/prime-minister-meets-her-majesty-queen-elizabeth-ii-and-prime",
  "pageTitle": "Prime Minister meets with Her Majesty Queen Elizabeth II and Prime Minister David Cameron of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, was received today by Her Majesty Queen Elizabeth II at Buckingham Palace. The Prime Minister also had his first bilateral meeting today with David Cameron, Prime Minister of the United Kingdom (U.K.).</p>\n<p>The Prime Minister and David Cameron discussed a wide range of pressing international issues, including climate change, coalition efforts to counter violent extremism and the Islamic State of Iraq and Syria, the humanitarian and security situation in Syria and Iraq, migration challenges facing Europe, and the situation in Ukraine. They also discussed the outstanding relationship both countries enjoy and how it can be deepened, including through the implementation of the Canada-European Union (EU) Comprehensive Economic and Trade Agreement (CETA).&nbsp;</p>\n<p>The Prime Minister will now travel to Valletta, Malta, to attend the Commonwealth Heads of Government Meeting being held from November 27 to 29, 2015.</p>\n<p><strong>Quotes</strong></p>\n<p>“I am thrilled to have expressed Canada’s commitment to further fostering the unique relationship we share with Her Majesty Queen Elizabeth II as our Sovereign, and I look forward to Her Majesty’s participation at the Commonwealth Heads of Government Meeting in Malta. Her Majesty remains an integral part of our country’s history, progress, and future, and her years of leadership have been key to the Commonwealth’s success.”<br><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canada and the U.K. remain strong partners, with a common history and shared values that define us: democracy, peace, rule of law, and opportunity for all. We are committed to economic growth and sustainable development, including solutions to address climate change in today’s complex world. We are also important allies in the promotion of peace and international security. I look forward to working with Prime Minister Cameron going forward to advance the goals of Commonwealth partners.”<br><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canada and the U.K. enjoy excellent commercial relations. Two-way merchandise trade with the United Kingdom was valued at $24.4 billion in 2014, making it Canada’s fourth largest trading partner.</li>\n<li>Canada and the U.K. are committed to strengthening their economic and trade relations.</li>\n<li>One of the key instruments is through the Canada-EU Comprehensive Economic and Trade Agreement (CETA).</li>\n<li>The U.K. has been a supporter of CETA, which will create new bilateral trade, jobs, and investment opportunities between Canada and the U.K.</li>\n<li>Once it enters into force, CETA will provide Canada with preferential market access to the largest and most lucrative integrated market in the world, a market of more than 500 million consumers that generates over $20 trillion in annual economic activity.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/commonwealth/index.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n<li><a href=\"http://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union: Comprehensive Economic and Trade Agreement (CETA)</a></li>\n<li><a href=\"https://chogm2015.mt\">CHOGM Malta 2015</a></li>\n<li><a href=\"http://thecommonwealth.org/\">The Commonwealth</a></li>\n</ul></div>\n      "
}