{
  "path": "/en/news/news-releases/2023/04/14/supporting-and-improving-indigenous-led-health-care-first-nations",
  "pageTitle": "Supporting and improving Indigenous-led health care for First Nations in British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone deserves equal access to quality health care, free from racism and discrimination. That’s why the Government of Canada is working in partnership with First Nations, Inuit, and Métis to support greater Indigenous control of health services and deliver better health outcomes for Indigenous Peoples.</p>\n\n<p>The Prime Minister, Justin Trudeau, was joined today by the Minister of Indigenous Services, Patty Hajdu, and the leaders of the First Nations Health Authority (FNHA) and the First Nations Health Council (FNHC), on Coast Salish Traditional Territory, to announce the signing of a renewed 10-year Canada Funding Agreement with the FNHA in British Columbia, to deliver better health care for First Nations in the province. Through the agreement, $8.2&nbsp;billion in funding will support the FNHA as it continues to deliver and improve the health systems that serve and support over 200 First Nations communities in the province. This includes but is not limited to continuing to develop innovative supports for mental health and wellness needs, increasing access to quality, culturally safe care, and strengthening coordination between the FNHA and the provincial health care services to better meet the unique needs of First Nations communities.</p>\n\n<p>The Government of Canada transferred control of First Nations health operations in British Columbia to the First Nations in the province 10 years ago, following the signing of a historic agreement in 2011. Since then, the FNHA has transformed how health care is delivered to First Nations in the province, ensuring that health funding is distributed wherever it is needed most, to support healthy, self-determining, and vibrant communities across the province.</p>\n\n<p>Today’s announcement is in addition to the recently announced Indigenous Health Equity Fund, a federal investment of $2&nbsp;billion over 10 years to address the unique challenges Indigenous Peoples across Canada face when it comes to fair and equitable access to quality and culturally safe health care services. We will continue working collaboratively with Indigenous partners and communities to address these gaps, support Indigenous health priorities, and work toward eliminating health inequalities for all.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s announcement is an important step toward ensuring that decisions that impact the health of First Nations can be made by First Nations. We’re committed to working in partnership with Indigenous communities to deliver the best results for people’s health, build a more resilient health care system, and ensure that our country’s health care systems respect the unique needs of Indigenous Peoples so that everyone can get the medical care they need, when they need it.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<blockquote>\n<p>“When First Nations lead in health care design and delivery, services improve and Indigenous Peoples get and stay healthier. The First Nations Health Authority has a long-term vision to create healthier people and communities. Sustainable and predictable funding is the foundation of this important work. This renewed 10-year agreement supports the First Nations Health Authority on the journey of health transformation. Thank you to the many leaders, service providers and health care workers that make a difference every day. This agreement helps to ensure you have the strong and secure foundation to continue your important, life changing work.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Patty Hajdu, Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario</footer></blockquote>\n\n<blockquote>\n<p>“This new 10-year funding agreement will allow the FNHA to continue the important work toward creating a culturally safe health care system for First Nations people in British Columbia. Funds to address existing disparities and inequities will be discussed and aligned with our communities in partnership with federal, provincial, and other health agencies. FNHA will continue to work together on health system innovations, and through the delivery of new or redesigned health and wellness programs that support the unique needs of First Nations people and their communities.”</p>\n\n<footer class=\"default\">Richard Jock, Chief Executive Officer, First Nations Health Authority</footer></blockquote>\n\n<blockquote>\n<p>“Today’s announcement of a new 10-year federal funding agreement speaks to the strong partnerships between the FNHA, the federal and provincial governments, local health authorities, and other health care providers. It is a testament to the shared understanding of the many disparities in the current health care system that contribute to gaps in health outcomes for Indigenous Peoples. I lift my hands and acknowledge all those who continue to work toward building a safer and more accessible health care system for First Nations in British Columbia.”</p>\n\n<footer class=\"default\">Colleen Erickson, Board Chair, First Nations Health Authority</footer></blockquote>\n\n<blockquote>\n<p>“This year marks the 10-year anniversary of a historic transfer of federal operations in First Nations health to the control of First Nations in British Columbia. Today’s funding announcement extends this unique health governance structure with our Canada and British Columbia partners, based on a shared vision of health transformation for First Nations – a governance structure that is a first for Canada and one of only a few in the world. Focused on health transformation and control of health care by First Nations, the FNHC’s recent Gathering Wisdom for a Shared Journey&nbsp;XII in February saw Chiefs and leaders endorse a ‘10-Year Strategy on the Social Determinants of Health: A Framework for the Future’. With the highest level of support of any FNHC resolution, Chiefs and leaders clearly stated that First Nations know best how to manage and deliver health for their communities.”</p>\n\n<footer class=\"default\">Wade Grant, Chair, First Nations Health Council</footer></blockquote>\n\n<blockquote>\n<p>“Today’s announcement responds to the demand by Chiefs and communities for sustainable, predictable funding to provide community-based solutions to improve health and wellness for First Nations people. Since launching a new approach to First Nations health in 2011 via the British Columbia Tripartite Framework Agreement on First Nations Health Governance, First Nations have worked to reclaim the traditions and cultural teachings that kept us healthy for thousands of years. With this new agreement and implementation of the ‘10-Year Strategy on the Social Determinants of Health’,<em> </em>the FNHC is ready to work with its partners at the FNHA and the First Nations Health Directors Association on urgent priorities including Healing Approaches and Cultural Infrastructure.”</p>\n\n<footer class=\"default\">Wenecwtsin (Wayne Christian), Deputy Chair, First Nations Health Council</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>British Columbia’s First Nations Health Governance Structure enables First Nations in the province to participate fully in the design and delivery of health services within their communities. The First Nations Health Authority (FNHA) in British Columbia is the first of its kind in Canada, mandated to plan, design, manage, deliver, and fund the delivery of First Nations health programs in the province. The Government of Canada’s transfer of control of First Nations health operations to the FNHA was prescribed in the <a href=\"https://www.sac-isc.gc.ca/eng/1584706392620/1584706415366\">2011 Tripartite Agreement</a> signed by Canada, British Columbia, the First Nations Health Council (FNHC), and the FNHA.</li>\n\t<li>Five other federally funded First Nations health transformation initiatives are now underway in Nova Scotia, Quebec, Ontario, and two in Manitoba.</li>\n\t<li>Budget&nbsp;2023 also includes additional investments for Indigenous health priorities:\n\t<ul class=\"bulletOutline\"><li>$810.6&nbsp;million over five years to support medical travel and maintain medically necessary services through the Non-Insured Health Benefits Program, including mental health services, dental and vision care, and medications; and</li>\n\t\t<li>$16.2&nbsp;million over three years for interventions that will contribute to the goal of eliminating tuberculosis across Inuit Nunangat by 2030.</li>\n\t</ul></li>\n\t<li>The federal government works collaboratively and in partnership with Indigenous partners and communities to support improved access to high quality, culturally appropriate health services, greater Indigenous control of health services, and improved health outcomes. Each year, the government invests approximately $5&nbsp;billion in Indigenous health. This includes important new investments announced since 2021 to support further progress, including:\n\t<ul class=\"bulletOutline\"><li>$354&nbsp;million over five years to increase the number of nurses and other medical professionals in remote and isolated First Nations communities;</li>\n\t\t<li>$250&nbsp;million over five years to further support recruitment and retention of health professionals on reserve;</li>\n\t\t<li>$825&nbsp;million over three years for distinctions-based mental health and wellness strategies;</li>\n\t\t<li>$127&nbsp;million over three years to foster health systems free from racism and discrimination; and</li>\n\t\t<li>$107&nbsp;million over three years to continue efforts to transform how health services are designed and delivered by First Nations communities.</li>\n\t</ul></li>\n\t<li>On February 7, 2023, the Government of Canada announced $2&nbsp;billion over 10 years in the new Indigenous Health Equity Fund to make further progress on Indigenous health priorities across Canada. This was part of the more than $198&nbsp;billion over 10 years to improve health care for people in Canada, including Indigenous Peoples.</li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2023/04/first-nations-health-transformation-in-british-columbia.html\">Backgrounder: First Nations health transformation in British Columbia</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.sac-isc.gc.ca/eng/1626810177053/1626810219482\">Indigenous health care in Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/02/working-partnership-deliver-high-quality-health-care-indigenous\">Working in partnership to deliver high-quality health care for Indigenous People</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"https://www.fnha.ca/\">First Nations Health Authority</a></li>\n</ul></div>\n      "
}