{
  "path": "/en/news/statements/2018/06/04/prime-minister-welcomes-recommendations-gender-equality-advisory-council",
  "pageTitle": "Prime Minister welcomes recommendations from the Gender Equality Advisory Council for Canada’s G7 Presidency | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the recommendations from the Gender Equality Advisory Council for Canada’s G7 Presidency:</p><p>“Today, I welcome the recommendations from the Gender Equality Advisory Council for Canada’s G7 Presidency, entitled ‘<a href=\"https://g7.gc.ca/en/g7-presidency/gender-equality-advisory-council/recommendations/\">Make Gender Inequality History</a>.’ I thank the Council for their important work and for sharing their knowledge and expertise, which will inform the discussions and decision-making at this week’s G7 Summit, and help to inspire the work of the G7 countries moving forward.</p><p>“Gender equality is a fundamental human right, a key to growing strong economies, and a top priority for Canada and our G7&nbsp;Presidency. None of us can move forward when half of us are held back. To build peace, reduce poverty, and grow economies that work for everyone, we must address the deep-rooted drivers of inequality and eliminate the barriers that prevent women, girls, and gender diverse people from participating fully and freely in all aspects of our society.</p><p>“Canada is committed to working with G7 members and its domestic and international partners to promote the rights of women, girls, and marginalized communities. Together, we can explore ways to implement the recommendations of the Council and continue to work to achieve the gender equality targets set out in the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">2030 Agenda for Sustainable Development</span></a>. We know that when women and girls have an equal opportunity to succeed, all of us benefit.</p><p>“I look forward to discussing the Council’s recommendations with Council members and G7 leaders in Charlevoix. We will listen to the voices of women, girls, and gender diverse people as we work to build a world where all people – no matter their gender identity – are safe, free, and empowered.”</p></div>\n      "
}