{
  "path": "/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-united-states-vice-president-kamala",
  "pageTitle": "Prime Minister Justin Trudeau meets with United States Vice President Kamala Harris | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with United States Vice President Kamala Harris, on the margins of the North American Leaders’ Summit. During the meeting, the Prime Minister and Vice President emphasized the strong ties that bind our people and countries together.</p>\n\n<p>The Prime Minister thanked the Vice President for her support in advocating for the release of Canadians Michael Kovrig and Michael Spavor, who were detained arbitrarily in China. They discussed a range of global challenges, including their deep concerns about the worsening crises in Haiti, Afghanistan, and Ethiopia. Prime Minister Trudeau noted the close cooperation between Canada and the United States in securing the safe passage of refugees from Afghanistan. The Prime Minister and Vice President shared their concerns about the developing situation in Ethiopia and underscored the importance of a political solution and an inclusive national dialogue to end the conflict. The Prime Minister stressed the importance of human rights and unhindered humanitarian access. The two leaders also discussed our respective relationships with China, and agreed to continue our close collaboration on issues of common interest.</p>\n\n<p>The Prime Minister and Vice President discussed the importance of the protection and promotion of democracy, and their ongoing work to strengthen international cooperation and coordination to advance democracy and human rights internationally.&nbsp;The Prime Minister noted that the promotion of democracy, human rights, and the rule of law are central to Canadian foreign policy, and that he looked forward to participating in the forthcoming Summit for Democracy. The two leaders noted their shared concerns over online hate, and committed to working with likeminded partners to protect democratic rights and freedoms, safeguard electoral processes, and counter the rise of authoritarian and anti-democratic politics globally.</p>\n\n<p>The Prime Minister and Vice President discussed the importance of dismantling and combatting all forms of discrimination and hatred, including online. Prime Minister Trudeau expressed his desire to continue working with Vice President Harris to advance their shared priorities on gender equality, especially in regards to the needs of those who are most marginalized and disadvantaged.</p>\n\n<p>Prime Minister Trudeau also welcomed future opportunities to work with Vice President Harris to ensure a predictable trade environment central to resilient supply chains, reinforcing the collective commitment to free and fair trade that underpins our shared economic security and prosperity. The Prime Minister raised his concerns over Buy America measures and the proposed electric vehicle tax credits, and emphasized the importance of finding a mutually acceptable solution in the interest of middle class jobs in both countries and the future of the North American auto sector.</p>\n\n<p>The Prime Minister and Vice President agreed to continue their dialogue on a wide range of issues, and the Prime Minister invited the Vice President to visit Ottawa soon.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.state.gov/summit-for-democracy/\">The Summit for Democracy</a></li>\n</ul></div>\n      "
}