{
  "path": "/en/news/statements/2019/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian Multiculturalism&nbsp;Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/multiculturalism-day.html\">Canadian Multiculturalism&nbsp;Day</a>, we celebrate the values which set Canada apart and make our country one of the best places in the world to live.</p>\n\n<p>“Respect, openness, courage, and compassion – these values have stitched together the Canadian tapestry for generations and generations. Today, the threads of our tapestry have never been stronger, brighter, or more intricate.</p>\n\n<p>“As the first country in the world to adopt a policy of multiculturalism, Canada has long recognized that we are all better off when we respect and unite behind our differences. But our work is not yet finished. We must all continue to learn about each other, embrace our diversity, and celebrate what it is to be Canadian – while learning from the mistakes in our past, and making sure never to repeat them.</p>\n\n<p>“We are also not immune to the violent and hateful extremism unfolding around the world. By calling out and standing up to divisive speech and acts, we put ourselves forward as an example – as people who treat each other with respect, champion the rights of all, and embrace diversity as a strength.</p>\n\n<p>“Whoever we are and wherever we come from, we all bring something unique and important to Canada. Today, and every day, let’s celebrate multiculturalism and recognize the invaluable contributions that Canadians of all backgrounds have made, and continue to make, to our country.”</p></div>\n      "
}