{
  "path": "/en/news/statements/2019/08/14/statement-prime-minister-report-conflict-interest-and-ethics",
  "pageTitle": "Statement by the Prime Minister on the report by the Conflict of Interest and Ethics Commissioner | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the report by the Conflict of Interest and Ethics Commissioner:</p>\n\n<p>“I thank the Ethics Commissioner for his important work. Our independent Parliamentary officers play a key role to ensure transparency and accountability at the federal level, and to uphold the institutions Canadians rely on. We fully cooperated with the Commissioner on this matter.</p>\n\n<p>“The Commissioner took the strong view that all contact with the Attorney General on this issue was improper. I disagree with that conclusion, especially when so many people’s jobs were at stake.</p>\n\n<p>“My objective was, and always will be, to stand up for people’s jobs and livelihoods across the country, while upholding the rule of law and respecting the role of the Attorney General. When thousands of jobs are on the line and communities stand to suffer, it is the government’s responsibility to stand up for them.</p>\n\n<p>“That said, the buck stops with me, and I take full responsibility for everything that happened, and accept the report.</p>\n\n<p>“In March, I sought advice from former Deputy Prime Minister and Minister of Justice and Attorney General Anne McLellan to clarify questions related to this matter. She held extensive consultations on the relationship between the federal government and the Minister of Justice and Attorney General of Canada, and <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/08/14/review-roles-minister-justice-and-attorney-general-canada\">her advice has been made public</a>. We will carefully review her recommendations to determine how we can best move to implement them and ensure the openness, transparency, and accountability of the institutions Canadians rely on.</p>\n\n<p>“Our government has made tremendous progress over the last few years, for seniors, students, workers, families, and newcomers. We have always fought to create and protect jobs, to invest in Canadians, and to strengthen the middle class at the heart of our country’s success. That priority will continue to guide everything we do.”</p></div>\n      "
}