{
  "path": "/en/news/readouts/2023/01/31/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister expressed Canada’s ongoing solidarity with the Ukrainian people as they continue to fight Russia’s brutal invasion while facing Russian strikes on civilian targets. The two leaders discussed Ukraine’s military, humanitarian, and financial needs, as well as the recent announcements of significant new support to Ukraine. They also spoke about how Canada and like-minded partners could continue working together to meet Ukraine’s needs due to Russia’s ongoing illegal and unprovoked invasion.</p>\n\n<p>The Prime Minister and the President talked about the upcoming somber anniversary of Russia’s invasion on February 24, and the Prime Minister reaffirmed Canada’s support for Ukraine for as long as it takes. Prime Minister Trudeau welcomed President Zelenskyy’s diplomatic efforts toward a just peace, and the two leaders discussed ongoing engagement with the Global South.</p>\n\n<p>The leaders agreed to remain in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/03/prime-min-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/12/13/canada-provides-ukraine-115-million-russian-and-belarusian-tariff\">Canada provides Ukraine $115&nbsp;million from Russian and Belarusian tariff revenues to repair Kyiv’s power grid</a></li>\n</ul></div>\n      "
}