{
  "path": "/en/news/statements/2021/01/17/statement-prime-minister-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul Wallenberg Day:</p>\n\n<p>“Today, we pay tribute to Raoul Wallenberg, a Swedish diplomat who risked his life to save tens of thousands of Hungarian Jews from persecution and certain death during the Holocaust.</p>\n\n<p>“As a Swedish diplomat in Budapest, Mr. Wallenberg led one of the most daring and successful rescue efforts of the Nazi era. He provided special passports, called Schutz-Passes, to thousands of Jews, saving them from deportation to concentration camps. He also created a network of safe havens operating under the protection of the Swedish state. These safe houses, hospitals, youth centres and soup kitchens provided refuge for Jews fleeing persecution. On several occasions, Mr. Wallenberg succeeded in securing the cancellation of deportations, and rescued Jews from deportation trains and the ‘death march.’ Over the course of six months, he saved more Jews from the horrors of the Nazi regime than any single individual, organization, or government.</p>\n\n<p>“Tragically, Mr. Wallenberg was arrested by Soviet forces and disappeared near the end of the war. While his fate remains unknown, his legacy lives on. In honour of his heroic efforts, countless awards, monuments, streets, parks, committees, institutions, and anti-racism campaigns now bear his name. In 1985, Canada named Mr.&nbsp;Wallenberg its first honorary citizen, and in 2001, the government designated January&nbsp;17th as Raoul&nbsp;Wallenberg Day, to honour his bravery and humanism.</p>\n\n<p>“The Holocaust was one of the darkest chapters in human history. Seventy-six years after the liberation of Nazi concentration and extermination camps, Jewish communities in Canada and around the world are confronted with the rise of antisemitism. The Government of Canada will always stand with Jewish communities, and continue to fight against antisemitism, hatred, and racism, which fuel such despicable acts. We will also continue to keep alive the memory and the stories of survivors for younger generations, and work to promote and defend pluralism, inclusion, and human rights. That is why we named the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism.</p>\n\n<p>“Today, I encourage all Canadians to reflect on Raoul Wallenberg's remarkable story, and ask themselves how we can embrace his values in our personal lives, in order to build a more equal, safer, and fairer world.”</p></div>\n      "
}