{
  "path": "/en/news/readouts/2023/02/02/prime-minister-justin-trudeau-speaks-prime-minister-latvia-krisjanis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Latvia Krišjānis Kariņš | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Latvia, Krišjānis Kariņš.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Kariņš on his reappointment as Prime Minister following the formation of a new governing coalition in Latvia.</p>\n\n<p>The two leaders condemned Russia’s ongoing aggression against Ukraine and reiterated their shared commitment to support Ukraine for as long as it takes.</p>\n\n<p>The prime ministers also discussed the regional and global consequences of Russia’s actions, including implications for the defence of NATO’s Eastern Flank. Prime Minister Kariņš expressed appreciation for Canada’s continued leadership as Framework Nation for NATO’s enhanced Forward Presence in Latvia, and Prime Minister Trudeau reaffirmed Canada’s commitment to work with Latvia and other Allies to augment NATO’s forward presence in the country.</p>\n\n<p>The two leaders committed to continuing to collaborate in support of Ukraine and in the defence of Allies. They agreed to remain in regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/12/14/statement-prime-minister-formation-new-government-latvia\">Statement by the Prime Minister on the formation of a new government in Latvia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/canadian-military-support-to-ukraine.html\">Canadian military support to Ukraine</a></li>\n</ul></div>\n      "
}