{
  "path": "/en/news/statements/2021/09/30/uqausiksaq-kanatamu-angajuqkaaqmut-uvani-suliniqmut-amma",
  "pageTitle": "ᐅᖃᐅᓯᒃᓴᖅ ᑲᓇᑕᒧ ᐊᖓᔪᖅᑳᖅᒧᑦ ᐅᕙᓂ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧ ᐅᓪᓗᕐᒥ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓇᑕᒧ ᐊᖓᔪᖅᑳᖅ ᔭᔅᑎᓐ ᑐᕉᑑ, ᐅᓪᓗᒥ ᐅᑯᓂᖓ ᐅᖃᐅᓯᒃᑲᖃᕐᒪᑦ ᐆᒧᖓ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧ ᐅᓪᓗᕐᒧᑦ:</p>\n\n<p>“ᐅᓪᓗᒥ, ᑐᙵᓱᒃᑎᑦᑎᕗᖓ ᑭᒃᑯᓕᒫᓂ ᑲᓇᑕᒦᑦᑐᓂᒃ ᐃᓕᓴᖅᓯᓯᒪᖁᔨᓪᓗᖓ ᐊᒻᒪ ᐅᔾᔨᕈᓱᑦᑎᐊᖁᔨᓪᓗᖓ ᓯᕗᓪᓕᖅᐹᕐᒥᑦ <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/national-day-truth-reconciliation.html\">ᑲᓇᑕᒥ ᐅᓪᓗᕐᒥᒃ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ</a>. ᐅᓇ ᐅᓪᓗᖅ ᐃᖅᑲᐅᒪᔾᔪᑎᐅᓂᐊᖅᑐᖅ ᐋᓐᓂᖅᓯᒪᔾᔪᑎᐊᓗᖕᓂᒃ ᐊᒃᑐᐃᒍᑎᐅᓯᒪᒻᒪᕆᒃᑐᓂᒃ ᐃᓕᓐᓂᐊᕆᐊᖅᕕᕕᓂᕐᓂᒃ ᑲᓇᑕᒥ, ᐊᒻᒪᓗ ᐃᓱᒪᒋᓗᒋᑦ ᐊᓂᒍᐃᓯᒪᔪᑦ, ᐃᓚᖏᓪᓗ, ᓄᓇᖏᓪᓗ. ᐅᓇ ᐅᓪᓗᖅ ᐃᖅᑲᐅᒪᔾᔪᑎᐅᓂᐊᖅᑐᖅ ᐅᓄᖅᑐᒻᒪᕆᐊᓗᖕᓂ ᓄᓇᕋᕐᓂᒃ ᐊᖏᕐᕋᙲᓐᓇᖅᑐᕕᓂᕐᓂᒃ, ᐊᒻᒪᓗ ᐅᕙᑦᑎᓐᓂ ᖃᐅᔨᕚᓪᓕᖅᑎᑦᑎᔾᔪᑎᐅᓗᓂ ᐊᒻᒪᓗ ᐋᖅᑭᒋᐊᒃᑲᓐᓂᕆᐊᖃᕐᓂᕐᒥᒃ ᐊᒻᒪ ᐱᓕᕆᐊᖃᑦᑎᐊᒻᒪᕆᒡᓗᑕᓗ ᑕᒪᑐᒥᖓ.</p>\n\n<p>“ᐅᓇ ᑲᓇᑕᒥ ᐅᓪᓗᖅ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ ᐃᓕᓴᖅᓯᓯᒪᔾᔪᑎᐅᔪᖅ 150,000 ᐅᖓᑖᓂᒃ ᓄᓇᖃᖅᑳᖅᑐᑦ ᓄᑕᕋᖏᑦ ᐊᖏᕐᕋᖏᓐᓂ ᕿᒪᐃᑎᑕᐅᓚᐅᕐᓯᒪᖕᒪᑕ ᐃᓚᖏᓐᓂᒃ ᐊᒻᒪ ᓄᓇᖏᓐᓂᒃ. ᓱᕈᓰᑦ ᐃᓕᓐᓂᐊᕆᐊᕐᕕᒃᒧᐊᖅᑕᐅᓚᐅᕐᓯᒪᖕᒪᑕ ᐊᒻᒪᓗ ᐅᓄᓗᐊᖅᑐᐊᓗᐃᑦ ᐱᑦᑎᐊᖅᑕᐅᙱᓗᐊᕌᓗᒃᖢᑎᒃ ᐊᒻᒪᓗ ᐃᓕᖅᑯᓯᖏᓐᓂᒃ ᐊᓯᐅᔨᑎᑕᐅᓪᓗᑎᒃ, ᐅᖃᐅᓯᖏᓐᓂᒃ ᐊᒻᒪ ᐊᑐᖃᑦᑕᖅᑕᖏᓐᓂᒃ. ᐅᓇ ᒐᕙᒪᑐᖃᒃᑯᑦ ᐅᓪᓗᕆᑎᑕᖓ ᐅᕙᙶᖅᑐᖅ ᐅᕆᓐᔾ ᐅᕕᓂᕈᖅ ᐅᓪᓗᕐᒥ, ᑖᓐᓇᓗ ᐱᒋᐊᕈᑎᖃᖅᖢᓂ ᐆᒪ ᕕᓕᔅ ᕗᐃᔅᑕᑦ ᐅᓂᒃᑳᖓᓂᑦ ᐊᒻᒪᓗ ᓂᕈᐊᕆᔭᐅᓯᒪᓪᓗᓂ ᓄᓇᖃᖅᑳᖅᑐᓄᑦ ᐃᖅᑲᐅᒪᔾᔪᑎᐅᓂᐊᕐᓗᓂ ᐃᓕᓐᓂᐊᕆᐊᕐᕕᐅᓚᐅᖅᓯᒪᔪᑦ ᖃᓄᐃᓕᐅᕈᓯᕕᓂᖏᓐᓂᒃ ᐊᒻᒪᓗ ᒪᒥᓴᖅᐸᓪᓕᐊᔾᔪᑎᐅᓗᓂ. ᑲᓇᑕᒥ ᐅᓪᓗᖅ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ ᐋᖅᑭᒃᑕᐅᓯᒪᔪᖅ ᒪᓕᒐᖅᑎᒍᑦ ᐊᓂᒍᖅᑎᑕᐅᓚᐅᖅᑐᒥ ᐅᐱᕐᖔᖑᓚᐅᕐᑐᖅ, ᐊᒻᒪᓗ ᐱᒋᐊᖅᑕᐅᓯᒪᓪᓗᓂ ᐅᑯᓂᖓ ᐊᑐᓕᖁᔭᐅᓂᕐᒧᑦ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ ᑲᒥᓴᓐᑯᓐᓄᑦ ᐊᑐᖁᔭᐅᓯᒪᔪᓂᒃ ᓇᒻᐸ 80. ᐃᓚᒋᔭᐅᓪᓗᓂ ᐃᖅᑲᐅᒪᔾᔪᑎᖃᕐᓂᕐᒧᑦ ᑖᔅᓱᒥᖓ ᐅᓪᓗᕐᒥ, ᐃᓚᐅᓚᐅᕐᓯᒪᒐᒪ ᐅᓐᓄᒃᑯᑦ ᖁᕕᐊᓲᑎᖃᖅᑐᓂᒃ ᐃᖅᑲᐅᒪᓪᓗᒋᑦ ᐊᓂᒍᐃᓯᒪᔪᑦ ᐊᒻᒪᓗ ᐅᑎᖅᑎᑕᐅᓚᐅᖅᓯᒪᙲᓐᓇᖅᑐᑦ ᐃᓚᖏᓐᓄᑦ ᐊᒻᒪ ᓄᓇᖏᓐᓄᑦ, ᑖᒃᑯᐊ ᐃᒡᓗᐊᓗᒃ ᐊᓯᖏᓐᓗ ᖃᐅᒻᒪᖃᖅᑎᑕᐅᑎᓪᓗᒋᑦ ᐆᕆᓐᔾᒥᒃ, ᐊᒻᒪᓗ ᓄᑖᒥ ᐊᐅᓚᖁᑎᒥᒃ ᐊᓂᒍᐃᓯᒪᔪᓄᑦ ᐅᑯᓇᙵᑦ ᑲᓇᑕᒥ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ ᐋᖅᑭᒃᓯᓚᐅᖅᖢᑎᒃ.</p>\n\n<p>“ᑕᒪᑐᒪᓂ ᐊᕐᕌᒍᒥ, ᓇᓂᓯᑲᑕᖕᓂᐅᓚᐅᖅᑐᖅ ᓇᓗᓇᐃᒃᑯᑎᖃᐅᙱᑦᑐᓂ ᐃᓗᕕᕕᓂᐊᓗᖕᓂ ᐃᓕᓐᓂᐊᕆᐅᕐᕕᕕᓃᑦ ᓄᓇᖏᓐᓂᒃ ᐃᖅᑲᐅᒪᔾᔪᑎᒋᔭᕗᑦ ᐊᒃᑐᐃᔾᔪᑎᑐᐃᓐᓇᐅᙱᑦᑐᓂᒃ ᐃᓄᖃᓕᖅᓯᒪᓂᕐᒥᒃ ᐊᒻᒪᓗ ᐊᑐᖅᑕᐅᖃᑦᑕᖅᑐᕕᓂᐊᓗᒃᖏᓂᒃ, ᑭᓯᐊᓂᓕ ᐱᓕᕆᓂᐅᔭᕆᐊᓕᖕᒥᒃ ᐋᖅᑭᒃᓱᐃᕙᓪᓕᐊᓂᕐᒥᒃ ᒪᒥᓴᖅᐸᓪᓕᐊᓂᕐᒥᒃ ᑲᓇᑕᒥ. ᐅᓪᓗᒥ ᐃᓕᓴᖅᓯᓯᒪᕗᒍᑦ ᐋᓐᓂᕈᑎᕕᓂᐊᓗᖕᓂᒃ, ᓈᒻᒪᙱᓕᐅᕈᑎᕕᓂᐊᓗᖕᓂᒃᑦ ᐊᒻᒪᓗ ᑭᖑᕚᕇᒃᑕᕐᓂᒃᑯᑦ ᓈᒻᒪᙱᓕᐅᕈᑎᕕᓂᐊᓗᖕᓂᒃ ᓄᓇᖃᖅᑳᖅᑐᑦ ᐊᑐᖅᑕᕕᓂᖏᓐᓂᒃ - ᐊᒻᒪᓗ ᓱᓕ ᐊᑐᖅᑕᐅᓪᓗᑎᒃ - ᓲᖃᐃᒻᒪ ᐃᓕᓐᓂᐊᕆᐊᖅᕕᕕᓂᕐᓄᑦ ᖃᓄᐃᓕᐅᕈᓯᕕᓃᑦ, ᐃᓅᖃᑎᒌᙱᓐᓂᕐᒧᑦ ᐊᔾᔨᐅᙱᑎᑦᑎᕙᖕᓂᖅ ᓱᓕ ᐊᑐᖅᑕᐅᕙᒃᑐᓂᒃ. ᑕᒪᑦᑕ ᖃᐅᔨᒪᓕᕆᐊᖃᕋᑦᑕᑦ ᖃᓄᐃᓕᐅᕈᑎᐅᓂᑯᓂᒃ ᐊᒻᒪ ᐊᑐᖅᑕᐅᕙᖕᓂᑯᓂᒃ ᐃᓕᓐᓂᐊᕆᐊᕐᕕᕕᓂᕐᓂᒃ. ᑕᒪᒃᑯᓂᖓ ᓱᓕᔪᓂᒃ ᐅᖃᐅᓯᐅᓯᒪᔪᓂᒃ ᐃᓕᓴᖅᓯᓯᒪᑦᑎᐊᓕᕈᑦᑕ ᐊᒻᒪᓗ ᑕᒻᒪᖅᑕᐅᓂᑯᕕᓂᕐᓂᒃ ᐋᖅᑭᒃᓯᓇᓱᒃᑯᑦᑕ ᑕᐃᒪᓕ ᓯᕗᒧᑦ ᐱᕙᓪᓕᐊᔪᓐᓇᖅᓯᔪᓐᓇᕋᔭᖅᑐᒍᑦ ᐱᐅᓂᕐᓴᒃᑯᑦ, ᐊᔾᔨᒌᒃᑎᑦᑎᓂᒃᑯᑦ ᐊᒻᒪ ᐱᐅᓂᕐᓴᒧᑦ ᓯᕗᓂᒃᓴᒧᑦ.</p>\n\n<p>“2015-ᖑᓚᐅᕐᓯᒪᑎᓪᓗᒍ, ᑲᓇᑕᒥ ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᓯᒪᖕᒪᑕ ᐱᓕᕆᖃᑎᖃᖅᖢᑎᒃ ᓄᓇᖃᖅᑳᖅᑐᓂᒃ ᐊᑐᖅᑐᐊᓯᒪᙱᓐᓂᐅᓗᐊᖅᑐᓂᒃ ᐊᑯᓂᓗᐊᕌᓗᒃ - ᐊᒻᒪᓗ ᐊᑕᐅᑦᑎᒃᑯᑦ ᐱᓕᕆᕙᓪᓕᐊᒍᓐᓇᕐᓂᐊᕋᑦᑕ. ᐅᑯᓇᙵᑦ ᓱᓕᓂᖅᒧᑦ ᐊᒻᒪ ᐱᒋᐊᒃᑲᓐᓂᕈᒪᓂᖅᒧᑦ ᑲᒥᓴᓐᑯᓐᓂ ᐊᑐᓕᖁᔭᐅᓯᒪᔪᓂᒃ 80%-ᖏᑦ ᐅᕘᓈᖓᖕᒪᑕ ᐊᑕᐅᓯᕐᒧᑦ ᐱᓕᕆᖃᑎᒋᖕᓂᒃᑯᓪᓘᓐᓃᑦ ᑲᒪᒋᔭᐅᔭᕆᐊᖃᕐᓂᖓᓂᒃ ᒐᕙᒪᑐᖃᒃᑯᓐᓄᑦ ᐱᐊᓂᒃᑕᐅᓯᒪᔭᕆᐊᖃᖅᑐᑦ ᐅᕝᕙᓘᓐᓃᑦ ᐱᓕᕆᐊᕆᔭᐅᓕᕆᐊᖃᖅᑐᑦ. ᓄᖅᑲᖅᑎᑦᑎᓚᐅᕋᑦᑕ 117-ᓂᒃ ᐃᒥᑦᑎᐊᕆᙱᓐᓂᕐᒧᑦ ᐊᑐᖁᔨᔪᓐᓃᕈᑎᓂᒃ, ᐸᕐᓇᐅᓯᐅᖅᓯᒪᓪᓗᑕ ᑕᒪᐃᓐᓂ ᓄᖅᑲᖅᑎᑦᑐᒪᓪᓗᑎᒍᑦ ᖃᓂᑦᑐᒥᓐ. ᐊᓂᒍᖅᑎᑦᑎᓚᐅᕋᑦᑕ ᐆᒥᖓ <em>ᔫᓇᐃᑕᑦ ᓇᐃᓴᓐ ᓄᓇᖃᖅᑳᖅᑐᓄᑦ ᐱᔪᓐᓇᐅᑎᖏᓐᓄᑦ ᒪᓕᒐᖅᒥᒃ</em>, ᓴᐳᔾᔨᓯᒪᔪᖅ ᓄᓇᖃᖅᑳᖅᑐᑦ ᐅᖃᐅᓯᖏᓐᓂᒃ, ᐊᒻᒪᓗ ᐃᓕᓐᓂᐊᕐᓂᓕᕆᓂᕐᒧᑦ ᐃᑲᔪᕈᑎᒃᓴᖃᖅᖢᑕ ᓄᓇᖃᖅᑳᖅᑐᓄᑦ ᓄᑖᓄᑦ ᐱᐅᓂᕐᓴᓄᓪᓘᓐᓃᑦ ᐃᓕᓐᓂᐊᕐᕕᐅᓂᐊᖅᑐᓄᑦ. ᐱᓕᕆᐊᖃᕋᓱᖕᒥᔪᒍᑦ ᐱᒻᒪᕆᖕᓂ ᐱᓕᕆᐊᖃᕋᓱᒃᖢᑕ ᓇᓗᓇᐃᖅᑕᐅᓯᒪᔪᓂᒃ ᑲᓇᑕᒥ ᖃᐅᔨᓇᓱᖕᓂᖅ ᔭᒐᓯᒪᔪᓂᒃ ᐃᓄᐊᖅᑕᐅᓯᒪᔪᓂᒡᓗ ᓄᓇᖃᖅᑳᖅᑐᑦ ᐊᕐᓇᓂᒃ ᐊᒻᒪ ᓂᕕᐊᖅᓵᓂᒃ ᐅᓂᒃᑳᓕᐊᓂᒃ ᐊᒻᒪᓗ ᒪᓕᒐᓕᕆᓂᒃᑯᑦ ᐱᓕᕆᐊᖑᖁᔭᐅᔪᓂᒃ, ᐊᒻᒪᓗ ᐋᖅᑭᒃᓱᐃᖃᑎᖃᖅᖢᑕ ᓄᓇᖃᖅᑳᖅᑐᓄᑦ ᓱᕈᓯᓕᕆᔩᑦ ᐊᒻᒪ ᐃᓄᓕᕆᔨᒃᑯᑦ ᒪᓕᒐᖓᓂᒃ ᑕᒪᒃᑯᐊ ᓄᓇᖃᖅᑳᖅᑐᑦ ᓱᕈᓯᖏ ᐃᓚᖏᓐᓃᑎᑕᐅᖏᓐᓇᕈᓐᓇᕐᓗᑎᒃ ᐊᒻᒪ ᓄᓇᖏᓐᓂᒃ. ᑲᔪᓯᓂᐊᕆᓪᓗᑕ ᓄᓇᖃᖅᑳᖅᑐᑦ ᓄᓇᓕᖏᓐᓂᒃ ᐃᑲᔪᕋᓱᒡᓗᑕ, ᓇᓗᓇᐃᖅᑕᐅᓯᒪᓂᖓᒍᑦ ᐊᐅᓚᔾᔪᑎᒃᓴᓂᒃ 2021-ᒧᑦ, ᐱᐅᓂᕐᓴᒥ ᓯᕗᓂᒃᓴᖃᖅᑎᑦᑎᓇᓱᖕᓂᕐᒥᒃ ᑭᒃᑯᑐᐃᓐᓇᕐᓂᒃ.</p>\n\n<p>“ᑭᒡᒐᖅᑐᐃᓪᓗᓂ ᑲᓇᑕᒥ ᒐᕙᒪᒃᑯᓐᓂᒃ, ᑲᓇᑕᒥᐅᑕᓕᒫᓂᒃ ᖃᐅᔨᕚᓪᓕᖁᔨᕗᖓ ᐃᓕᓐᓂᐊᕆᐊᕐᕕᐅᕙᓚᐅᖅᓯᒪᔪᓂᒃ ᑲᓇᑕᒥ, ᐃᓕᓐᓂᐊᕆᐊᖅᐸᒃᑐᕕᓂᕐᓂᒃ ᐅᓂᒃᑳᖅᑎᑦᑎᕙᒡᓗᑕ ᐊᒻᒪᓗ ᖃᐅᔨᓇᓱᒡᓗᑕ ᖃᓄᖅ ᐱᓕᕆᐊᖃᕈᓐᓇᕐᒪᖔᑦᑕ ᒪᒥᓴᖅᐸᓪᓕᐊᓂᕐᒧᑦ. ᑭᒃᑯᓕᒫᓂᒃ ᐊᑐᖁᔨᒐᓗᐊᕆᕗᖓ ᐊᐅᐸᔮᖅᑐᓂᒃ ᐆᕆᓐᔾ ᐅᕕᓂᕈᕐᓂ ᐅᔾᔨᕈᓱᓕᖅᑎᑦᑎᓇᓱᖕᓂᕐᒥᒃ, ᓲᖃᐃᒻᒪ ᓱᕈᓯᓕᒫᑦ ᐱᒻᒪᕆᐅᖕᒪᑕ.”</p></div>\n      "
}