{
  "path": "/en/news/statements/2018/10/02/statement-prime-minister-donna-strickland-winning-nobel-prize-physics",
  "pageTitle": "Statement by the Prime Minister on Donna Strickland winning the Nobel Prize in Physics | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after learning that Canadian physicist Dr. Donna Strickland won the 2018 Nobel Prize in Physics:</p><p>“I join Canadians and the international science community to recognize the remarkable accomplishments of Canadian physicist Dr. Donna Strickland, a winner of this year’s Nobel Prize in Physics.</p><p>“Dr. Strickland, an associate professor at the University of Waterloo, is only the third woman in history to win this prestigious award, and the first woman to be awarded the prize in 55 years.</p><p>“With her colleague Dr. Gérard Mourou of France, Dr. Strickland was awarded one half of the 2018 Nobel Prize in Physics for the development of a new technique to create short, intense laser pulses. Their innovative work can be found in applications including corrective eye surgery, and is expected to have a significant impact on cancer therapy and other physics research in the future. The other half of this year’s prize was awarded to Dr. Arthur Ashkin, who also won for his work revolutionizing laser physics.</p><p>“In the words of Dr. Strickland, ‘we need to celebrate women physicists’ – and help motivate more women to pursue careers in science and technology. When women are empowered and have the tools they need to thrive in STEM fields, everyone benefits. While winning a Nobel Prize is a tremendous feat in its own right, it is even more special as we mark <a href=\"https://www.swc-cfc.gc.ca/commemoration/whm-mhf/index-en.html\">Women’s History Month</a>, a time to celebrate the many women who, like Dr. Strickland, have paved the way for future generations of women and girls.</p><p>“On behalf of all Canadians, I congratulate Dr. Strickland for this remarkable achievement, and thank her for inspiring other women and young girls to dream without limits and pursue the careers of their choice.”</p></div>\n      "
}