{
  "path": "/en/news/statements/2017/10/01/statement-prime-minister-national-seniors-day",
  "pageTitle": "Statement by the Prime Minister on National Seniors Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark National Seniors Day:</p><p>“On <a href=\"https://www.canada.ca/en/employment-social-development/campaigns/national-seniors-day.html\">National Seniors Day</a>, we celebrate seniors across Canada and honour their invaluable contributions to our country. Canada’s seniors hold a unique and cherished place within our families, our workplaces, and our communities.</p><p>“Seniors have a lasting and life-changing impact on us all. They raise and mentor succeeding generations, pass on important lessons, and help us learn to care for our world and each other. They take care of us as we grow, help us through the hard moments, and celebrate with us in good times. Canada’s seniors make a difference in all our lives, and contribute each day to making our country stronger, more open, and more inclusive.</p><p>“Our Government recognizes the pivotal role seniors play in the wellbeing of our whole country. We are working hard to ensure they have the support they need and the secure and dignified retirement they deserve. We strengthened the Canada Pension Plan, increased the Guaranteed Income Supplement for the lowest-income single seniors, and restored the age of eligibility for the Old Age Security benefits from 67 to 65. We also created the Canada Caregiver Credit to provide better support to those who need it most and help families take care of their loved ones. We are also investing in home care and housing for seniors so more seniors can get the care and support they need in their communities. Whether in housing, health care, or income security, we will continue to help Canadian seniors get the support they need to participate in their communities and enjoy a secure and dignified retirement.</p><p>“Seniors carry stories that help us understand who we are as a country, and knowledge that helps us better contribute to our communities. As workers, volunteers, and members of our families and communities, they help build a stronger Canada and a better world.</p><p>“On behalf of the Government of Canada, I invite all Canadians to say thank you and recognize a senior in their life – a parent, grandparent, or mentor – for everything they contribute to Canadian society. Their past and present continue to help create a better future for all of us.”</p></div>\n      "
}