{
  "path": "/en/news/news-releases/2021/01/12/prime-minister-announces-new-commissioner-nunavut",
  "pageTitle": "Prime Minister announces new Commissioner of Nunavut | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Eva Aariak as the new Commissioner of Nunavut.</p>\n\n<p>Ms. Aariak has been a lifelong champion for Nunavut and Inuit languages and culture. Throughout her career as an educator, journalist, entrepreneur, public servant, and elected official, she promoted the use and understanding of Inuktut. As the first Languages Commissioner of Nunavut, Ms. Aariak also helped make this a working language within the territorial government, and recommended to the Nunavut Legislative Assembly the groundbreaking <em>Inuit Language Protection Act</em>, which was subsequently passed into law.</p>\n\n<p>As Nunavut’s first woman premier and an advocate for equity and gender equality, Ms.&nbsp;Aariak has contributed greatly to advancing the role of women in Canadian public life. During her time as premier, she also led innovative and inclusive poverty reduction efforts to strengthen local economies, improve food security, and increase access to housing across the territory.</p>\n\n<p>The Prime Minister thanked the previous Commissioner, Nellie Taptaqut Kusugak, for her dedicated service to Nunavummiut.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With her long record of service to Nunavummiut and tireless efforts to promote and preserve their culture and languages, I am confident that Ms. Aariak will excel in her new role as Commissioner of Nunavut and continue to inspire others to serve their communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Territorial Commissioners are Governor in Council appointments.</li>\n\t<li>Territorial Commissioners fulfill many of the same duties as provincial Lieutenant Governors. Their responsibilities include swearing in Members of the Legislative Assembly and the Executive Council, opening the Legislative Assembly, and providing assent for legislation passed by the Assembly.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/01/12/eva-aariak\">Eva Aariak</a></li>\n</ul></div>\n      "
}