{
  "path": "/en/news/news-releases/2017/07/17/prime-minister-announces-advisory-board-select-next-supreme-court",
  "pageTitle": "Prime Minister announces Advisory Board to select next Supreme Court Justice | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to ensuring that Supreme Court of Canada Justices are appointed in a way that is transparent, inclusive, and accountable to Canadians.</p><p>The Prime Minister, Justin Trudeau, today announced the members of the independent and non-partisan Advisory Board who will help support the <a href=\"/en/news/news-releases/2017/07/14/prime-minister-opens-process-select-next-justice-supreme-court-canada\">search for the next Supreme Court justice</a>, which was launched on July 14, 2017.</p><p>The Advisory Board will follow the Government’s <a href=\"/en/news/backgrounders/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">new Supreme Court of Canada appointments process</a> to identify jurists of the highest caliber who are functionally bilingual and representative of the diversity of our great country. In this instance, any qualified candidate from Western Canada or Northern Canada may apply.</p><p>The seven-member Advisory Board, chaired by former Prime Minister Kim Campbell, includes four members nominated by independent professional organizations. The Advisory Board will review candidates who apply, and submit a shortlist of three to five individuals for consideration by the Prime Minister.</p><p>The Minister of Justice and the Chair of the Advisory Board will appear before Parliament to discuss the selection process. Members of Parliament and Senators from all parties will also have the opportunity to take part in a question and answer session with the nominee, before she or he is appointed to the Supreme Court of Canada.</p><h2>Quote</h2><blockquote><p>“The new approach launched last year to select Justices of the Supreme Court proved highly successful. I am delighted that the Advisory Board will again be chaired by former Prime Minister Kim Campbell, and I welcome the newest member, Ms. Sheila MacPherson, to this important Board. I look forward to receiving their recommendations, and to naming Canada’s next Justice of the Supreme Court.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Advisory Board is comprised of the following members:<ul><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Kim_Campbell\">The Right Honourable Kim Campbell</a>&nbsp;(Chairperson) is the former Prime Minister of Canada and Canadian Consul General, and is the Founding Principal of the Peter Lougheed Leadership College at the University of Alberta</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Camille_Cameron\">Camille Cameron</a>&nbsp;is the Dean of the Schulich School of Law at Dalhousie University, and Chair of the Canadian Council of Law Deans</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Stephen_Kakfwi\">Stephen Kakfwi</a>&nbsp;is the former Premier of the Northwest Territories and President of the Dene Nation, and is working to improve the recognition and realities of Indigenous Peoples within Canada</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Sheila_MacPherson\">Sheila MacPherson</a> is the President-elect of the Federation of Law Societies of Canada, a senior lawyer in Yellowknife and the Law Clerk of the Legislative Assembly of the Northwest Territories</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Lili-Anna_Peresa\">Lili-Anna Pereša</a>&nbsp;is the President and Executive Director of Centraide of Greater Montréal</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Richard_Jamieson_Scott\">Richard J. Scott</a>&nbsp;is the former Chief Justice of the Manitoba Court of Appeal, and is a counsel, arbitrator and mediator in a Winnipeg law firm</li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes#Susan_Ursel\">Susan Ursel</a>&nbsp;is a senior partner with a Toronto firm, and Chair of the Canadian component of the African Legal Research Team, which provides legal research support to Envisioning Global LGBT Rights</li></ul></li><li>The application period ends on Friday, September 15, 2017.</li><li>Qualifying candidates who wish to be considered to serve as the next member of the Court must complete and submit an application package (questionnaire, authorization form, and a background check consent form) no later than 23:59 Pacific daylight saving time on September 15, 2017.</li><li>The applications now being accepted are for the purpose of identifying the next member of the Supreme Court of Canada, following the December 15, 2017, retirement of Chief Justice Beverley McLachlin.</li><li>Candidates may demonstrate they satisfy the geographical requirement by reference to their bar membership, judicial appointment, or other relationship with Western Canada (British Columbia, Alberta, Saskatchewan and Manitoba) or Northern Canada (Yukon, Northwest Territories and Nunavut).</li><li>From the nine justices of the Supreme Court then assembled, the Prime Minister will identify the jurist best placed to serve as the next Chief Justice of Canada.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2017/07/28/mandate-letter-chair-independent-advisory-board-supreme-court-canada\">Mandate Letter (Chair) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li><li><a href=\"/en/news/backgrounders/2017/07/28/mandate-letter-members-independent-advisory-board-supreme-court\">Mandate Letter (members) - Independent Advisory Board for Supreme Court of Canada Judicial Appointments</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/07/17/independent-advisory-board-supreme-court-canada-judicial-appointments\">Independent Advisory Board for Supreme Court of Canada judicial appointments</a></li><li><a href=\"/en/news/backgrounders/2017/07/17/biographical-notes\">Biographical Notes</a></li></ul><h2>Associated links</h2><ul><li>News release: <a href=\"/en/news/news-releases/2017/07/14/prime-minister-opens-process-select-next-justice-supreme-court-canada\">Prime Minister opens the process to select the next justice of the Supreme Court of Canada</a></li><li>News release: <a href=\"/en/news/news-releases/2016/08/02/prime-minister-announces-new-supreme-court-canada-judicial\">Prime Minister announces new Supreme Court of Canada judicial appointments process</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/mandate-mandat-eng.html\">Terms of Reference for the Advisory Board</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and assessment criteria</a></li></ul></div>\n      "
}