{
  "path": "/en/news/readouts/2022/11/03/prime-minister-justin-trudeau-convenes-second-meeting-incident-response",
  "pageTitle": "Prime Minister Justin Trudeau convenes a second meeting of the Incident Response Group to discuss the situation in Haiti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><a name=\"_Hlk118309383\" id=\"_Hlk118309383\"></a>Yesterday, Prime Minister Justin Trudeau convened the Incident Response Group with ministers and senior officials to discuss the evolving situation in Haiti. They were joined by the Ambassador and Permanent Representative of Canada to the United Nations in New York, Bob Rae, the Ambassador of Canada to the United States, Kirsten Hillman, and the Ambassador of Canada to Haiti, Sébastien Carrière.</p>\n\n<p>The group was briefed by Mr.&nbsp;Daniel Jean, Representative of the Deputy Minister of Foreign Affairs and former National Security and Intelligence Advisor to the Prime Minister, who led the government’s recent interdepartmental assessment mission to Haiti from October 26 to 29, 2022. Mr.&nbsp;Jean advised the group that Haiti remains in a precarious security and humanitarian situation, which has been exacerbated by gang control over key installations and sites in Port-au-Prince, including the Varreux terminal – an important transportation and commercial hub. Blockades by gangs continue to exacerbate the grave humanitarian crisis by limiting the flow of fuel, food, water, medicine, and other essential goods.</p>\n\n<p>The group stressed the urgent need to restore security and humanitarian access in the country, and discussed how Canada and its partners – including the Caribbean Community (CARICOM), the United Nations, the United States of America, civil society organizations, and others – are supporting the people of Haiti in this difficult time. They explored a range of options, underlining Canada’s readiness to work with partners to address Haiti’s complex and immediate security and humanitarian needs through concrete actions. Prime Minister Trudeau underscored the importance of ensuring unhindered access for the delivery of humanitarian assistance to those affected, of holding those responsible for the unrest to account, and of working with partners to support a Haitian-led solution to the current situation.</p>\n\n<p>The Prime Minister and ministers reiterated Canada’s commitment to further collaborating with regional and international partners to support Haiti’s security and stability.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/18/prime-minister-justin-trudeau-convenes-incident-response-group-discuss\">Prime Minister Justin Trudeau convenes the Incident Response Group to discuss the situation in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-conducts-assessment-mission-in-haiti.html\">Canada conducts assessment mission in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-and-united-states-coordinate-delivery-of-haitian-national-police-equipment.html\">Canada and United States coordinate delivery of Haitian National Police equipment</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/20/prime-minister-justin-trudeau-speaks-members-caribbean-community-caricom\">Prime Minister Justin Trudeau speaks with members of the Caribbean Community (CARICOM)</a></li>\n</ul></div>\n      "
}