{
  "path": "/en/news/statements/2020/03/09/statement-prime-minister-commonwealth-day",
  "pageTitle": "Statement by the Prime Minister on Commonwealth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Commonwealth Day:</p>\n\n<p>“Today on <a href=\"https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days/commonwealth-day.html\">Commonwealth Day</a>, we join Commonwealth countries around the world to celebrate our shared values and the strong bonds of cooperation and friendship that unite us all.</p>\n\n<p>“This year’s theme, <a href=\"https://thecommonwealth.org/media/news/commonwealth-theme-2020-announced\">‘Delivering a Common Future: Connecting, Innovating, Transforming’</a>, highlights the long-standing bonds that exist between people and governments across the Commonwealth. These connections help us work together to overcome our common challenges and build a better world for all our citizens.</p>\n\n<p>“Headed by Her Majesty Queen Elizabeth II, the Commonwealth works to advance democracy, environmental protection, sustainable development, the rule of law, gender equality, and universal human rights. These values make us who we are, and are critical for the development, prosperity, and wellbeing of the more than 2.4 billion people who call the Commonwealth home.</p>\n\n<p>“Canada will continue to work with other Commonwealth members to advance our shared priorities. We look forward to the Commonwealth Heads of Government Meeting this June in Rwanda, where we will work with our partners to find concrete ways to connect, innovate, and transform our societies so that everyone, particularly women and young people, can reach their full potential and succeed.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to learn more about the shared history of the Commonwealth, and how Canada plays a unique role in helping advance shared priorities.”</p></div>\n      "
}