{
  "path": "/en/news/statements/2022/03/09/statement-prime-minister-result-presidential-election-south-korea",
  "pageTitle": "Statement by the Prime Minister on the result of the presidential election in South Korea | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the result of the presidential election in South Korea:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Yoon Suk‑yeol on his victory in South Korea’s presidential election.</p>\n\n<p>“Canada and South Korea enjoy a strong relationship, based on shared democratic values and extensive trade and investment relations. We work closely together on the world stage, including through the G20, the United Nations, the Asia‑Pacific Economic Cooperation (APEC) forum, the World Trade Organization (WTO), and the Ottawa Group. The <a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/korea-coree/index.aspx?lang=eng\">Canada‑Korea Free Trade Agreement</a> – Canada’s first and only bilateral free trade agreement in the Asia‑Pacific region – is fostering economic growth and creating jobs in both our countries.</p>\n\n<p>“As Canada and South Korea prepare to celebrate 60 years of diplomatic relations next year, I look forward to working with President-elect Yoon to deepen relations between our two countries and advance our shared priorities. This includes standing united with Ukraine in the face of Russia’s unwarranted and unjustifiable invasion, recovering from the COVID-19 pandemic, and enhancing peace and security in the Indo-Pacific and around the world. As the Government of Canada works to develop a new, comprehensive Indo-Pacific strategy to strengthen partnerships in the region, we will continue to promote greater prosperity and economic growth that benefits everyone in Canada and South Korea.</p>\n\n<p>“I thank outgoing President Moon Jae‑in for his valuable partnership over the years and wish him all the best in his future endeavours.”</p></div>\n      "
}