{
  "path": "/en/news/readouts/2022/06/26/prime-minister-justin-trudeau-meets-president-rwanda-paul-kagame",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Rwanda Paul Kagame | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met with the President of Rwanda, Paul Kagame, on the margins of the Commonwealth Heads of Government Meeting. The Prime Minister extended his sincere appreciation to President Kagame for hosting the meeting.</p>\n\n<p>Prime Minister Trudeau and President Kagame agreed to work together to advance shared priorities in response to the many crises facing the world.</p>\n\n<p>The two leaders discussed their concern for the serious global impacts of Russia’s invasion of Ukraine, notably for food and energy insecurity, and confirmed their shared commitments to sovereignty, territorial integrity, and international law.</p>\n\n<p>Recognizing the invasion is driving up the cost of living across the Commonwealth, Prime Minister Trudeau and President Kagame agreed to work together to improve food and energy security, support ambitious climate action, create opportunities for youth, and make life better and more affordable for people around the world.</p>\n\n<p>The Prime Minister and the President emphasized their shared commitment to the core values that must bring the countries of the Commonwealth together: free and democratic societies, and the promotion of peace and prosperity to improve the lives of all people. They spoke at length about the importance of the modernization and renewal of this important institution.</p>\n\n<p>The two leaders also spoke about the close bilateral partnership between Canada and Rwanda, and agreed to continue working together in areas such as gender equality, climate change, economic growth, peace and security, and the response to COVID-19.&nbsp;Prime Minister Trudeau was pleased to inform President Kagame of Canada’s plan to open a High Commission in Rwanda. President Kagame thanked the Prime Minister for providing to Rwanda more than two million vaccines through COVAX. The two leaders agreed to strengthen cooperation on air transport to encourage people-to-people and commercial ties between both countries. They also welcomed a new agreement to tackle climate change between Canada and Rwanda.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_rwanda.aspx?lang=eng\">Canada-Rwanda relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/16/prime-minister-justin-trudeau-speaks-president-rwanda-paul-kagame\">Prime Minister Justin Trudeau speaks with President of Rwanda Paul Kagame</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/06/minister-joly-announces-expansion-of-diplomatic-relations-with-rwanda-and-appointment-of-new-ambassador-to-african-union.html\">Minister Joly announces expansion of diplomatic relations with Rwanda and appointment of new ambassador to African Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}