{
  "path": "/en/news/statements/2018/11/12/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Global Entrepreneurship Week, which runs from November 12 to 18:</p><p>“Entrepreneurs drive Canada’s economy forward. Through their ingenuity and hard work, they create millions of jobs, help strengthen the middle class, and generate economic growth that improves our lives and keeps our communities strong, competitive, and prosperous.</p><p>“During <a href=\"https://www.futurpreneur.ca/en/initiatives/gew-canada/\">Global Entrepreneurship Week</a>, we celebrate entrepreneurs in Canada and around the world and thank them for the important contributions they make to our communities and economy. This week is also an opportunity for people to connect with potential collaborators, mentors, and investors to help them take their ideas and businesses to the next level.</p><p>“This year’s celebration focuses on empowering women entrepreneurs and young graduates to start and build new businesses, and creating a more inclusive and collaborative community of entrepreneurs.</p><p>“The Government of Canada has taken several steps to help Canadian entrepreneurs successfully start, manage, and grow their businesses. Over the last three years, we have opened the door to new markets – securing free trade agreements with the European Union and the growing markets of Asia – and kept the door open to our largest market through a modernized North American trade agreement. Thanks to these agreements, Canadian businesses now have preferential access to 1.5 billion customers around the world.</p><p>“Earlier this year, we lowered the small business tax rate to 10 per cent, and we will lower it again next year to 9 per cent. We also reached a deal with major credit card companies to lower the fees they charge to Canadian businesses. Reduced fees will encourage business owners to invest, expand, and create jobs, while keeping prices lower for Canadians.</p><p>“We also launched <a href=\"https://www.ic.gc.ca/eic/site/080.nsf/eng/home\">Innovation Canada</a>, a one-stop shop guiding entrepreneurs to government programs and services that help businesses innovate, create jobs, and grow our economy. We also launched a new <a href=\"http://www.ic.gc.ca/eic/site/108.nsf/eng/h_00000.html\">Intellectual Property Strategy</a>, which will help Canadian entrepreneurs better protect their creative ideas and inventions, give Canadian businesses more tools to deal with intellectual property issues, and position Canada as a leader in the global knowledge economy.</p><p>“More and more young Canadians are embracing start-up culture. This year, we hosted <a href=\"https://www.ic.gc.ca/eic/site/126.nsf/eng/home\">Youth Can Do It!</a>, a national event that brought together 25 young Canadian entrepreneurs with business experts so they could gain the connections, information, and resources they need for their next venture. We are also supporting <a href=\"https://www.futurpreneur.ca/en/\">Futurpreneur Canada</a> to help young people across the country launch and grow successful businesses.&nbsp;&nbsp;</p><p>“Women entrepreneurs are essential to growing Canada’s economy. In 2017, we created the <a href=\"https://advancingwomeninbusiness.com/\">Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders</a> to support and grow women-owned businesses. In <a href=\"https://www.budget.gc.ca/2018/home-accueil-en.html\">Budget 2018</a>, we announced Canada's first <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a> to help women expand their businesses with better access to financing, talent, networks, and expertise. As part of this strategy, the Government will address gaps in support for women entrepreneurs, and directly invest in women-owned and -led businesses.</p><p>“On behalf of the Government of Canada, I invite all Canadians to join me to celebrate the entrepreneurs that make Canada one of the most innovative and prosperous places in the world. I also thank Futurpreneur Canada and all those organizing this special week, and wish them every success with this year’s activities.”</p></div>\n      "
}