{
  "path": "/en/news/news-releases/2022/05/12/prime-minister-meets-prime-minister-latvia-krisjanis-karins",
  "pageTitle": "Prime Minister meets with Prime Minister of Latvia Krišjānis Kariņš | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today held a bilateral meeting with the Prime Minister of Latvia, Krišjānis Kariņš, during his visit to Canada from May 10 to 12, 2022.</p>\n\n<p>The prime ministers discussed ways to further coordinate additional military support to Ukraine as the country continues to fight Russia’s unprovoked and unjustifiable aggression. The leaders stressed the importance of coordination among members of the North Atlantic Treaty Organization (NATO) and discussed ways to further strengthen NATO’s deterrence and defence measures in Eastern Europe, particularly in the Baltic region. The prime ministers also expressed their shared support for Finland joining the NATO Alliance.</p>\n\n<p>Following their meeting, Prime Minister Trudeau announced Canada will deploy a Canadian Armed Forces general officer and six staff officers to NATO’s Multinational Division North Headquarters, based in Ādaži, Latvia.</p>\n\n<p>The prime ministers also discussed the strong Canada-Latvia partnership rooted in common values and a commitment to the rules-based international system, as well as security issues in the broader Baltic region. They agreed to stay in touch ahead of the upcoming Canada-Baltics 3+1 Foreign Ministers’ Meeting, which Canada will host in June.</p>\n\n<p>During his visit to Canada, Prime Minister Kariņš also met with the Honourable Anthony Rota, Speaker of the House of Commons, and with the Deputy Prime Minister and Minister of Finance, Chrystia Freeland.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Latvia share deep-rooted values of freedom, democracy, and the rule of law, and we continue to deepen our bilateral relationship. Today, Prime Minister Kariņš and I discussed military support to Ukraine as it continues to defend itself from Russia’s unprovoked and unjustifiable aggression. By working together, as NATO Allies and friends, we will continue to defend against and deter threats to democracy and global stability around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“At this crucial time for Euro-Atlantic security, Canada’s commitment to the NATO Alliance continues to be unwavering. To this end, we recently deployed a second frigate to NATO’s maritime forces and have added even more troops and capabilities to the Canadian-led multinational enhanced Forward Presence Battle Group in Latvia. This contribution of Canadian Armed Forces personnel to Multinational Division North Headquarters is yet another example of Canada’s commitment towards the security of our NATO Allies, and to defending every inch of NATO territory.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau has visited Latvia twice. His last visit was in March 2022.</li>\n</ul>\n\n<ul>\n\t<li>Canada and Latvia’s relationship is rooted in shared values of freedom, democracy, and the rule of law. Our ties are strong due in part to the 30,000 Canadians of Latvian heritage.</li>\n\t<li>Canada was the first G7 country to recognize the restoration of Latvia’s independence in 1991, and one of the first countries to ratify Latvia’s accession to NATO in 2004.</li>\n\t<li>Canada currently has approximately 700 Canadian Armed Forces personnel leading NATO’s enhanced Forward Presence Battle Group in Latvia as part of Operation REASSURANCE.</li>\n\t<li>Created in March 2019, NATO’s Multinational Division North Headquarters performs several vital roles – including support for the defence planning of Baltic nations, and the coordination of regional military activities – such as the activities of enhanced Forward Presence forces.</li>\n\t<li>Headquartered in Ādaži, Latvia, with additional elements in Denmark, Multinational Division North is currently led by Denmark, and falls under the command of NATO’s Multinational Corps Northeast.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/11/prime-minister-latvia-krisjanis-karins-visits-canada\">Prime Minister of Latvia Krišjānis Kariņš visits Canada</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\" title=\"Canada and the North Atlantic Treaty Organization\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/08/prime-minister-concludes-successful-bilateral-visit-latvia\">Prime Minister concludes successful bilateral visit to Latvia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\" title=\"Operation REASSURANCE\">Operation REASSURANCE</a></li>\n</ul></div>\n      "
}