{
  "path": "/en/news/statements/2022/08/19/statement-prime-minister-world-humanitarian-day",
  "pageTitle": "Statement by the Prime Minister on World Humanitarian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Humanitarian Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/humanitarian-day\">World Humanitarian Day</a>, we honour all the workers who selflessly put the needs of others before their own to deliver health care, food, water, and shelter to those who need it most.</p>\n\n<p>“These dedicated volunteers and professionals inspire us with their courage as they brave armed conflict, violence, and natural disasters to provide relief and hope to the world’s most vulnerable. Sadly, the number of people who need humanitarian assistance has more than tripled over the last decade, and the United Nations estimates that over 300&nbsp;million people around the world will require humanitarian assistance this year alone.</p>\n\n<p>“This year’s theme for World Humanitarian Day – #ItTakesAVillage – reminds us that we all have a part to play in supporting those who need it. Canada has a proud tradition of supporting experienced humanitarian partners worldwide, and we continue to stand ready to provide assistance – in particular to women and girls, who are disproportionately affected by the pandemic and armed conflicts around the world. Building on our <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, we will continue to ensure that the voices of women and girls remain at the centre of the government’s efforts to support humanitarian responses around the world.</p>\n\n<p>“As Russia’s illegal and unjustifiable aggression against Ukraine continues, Canada is helping people impacted by the conflict. Since the beginning of the invasion, we have committed $320&nbsp;million to supply medical aid, food, shelter, and more to address the needs of displaced and vulnerable populations in Ukraine and across the region. In June, Canada also committed additional funding to help meet the needs of those most affected by the global food security crisis exacerbated by the conflict. This builds on the $514.5 million already allocated globally in 2022 for emergency food and nutrition assistance.</p>\n\n<p>“In many parts of the world, the safety and security of humanitarian workers, particularly local staff, are at great risk as they face increasing attacks, violence, and threats, in contravention of international law and humanitarian principles. Canada will continue to advocate for their safety, their security, and their ability to deliver aid to those most in need.</p>\n\n<p>“On this day, I join Canadians in thanking humanitarian workers here at home and around the world. Your continued dedication, courage, and selflessness are a source of relief, inspiration, and hope for millions of people every day.”</p></div>\n      "
}