{
  "path": "/en/news/news-releases/2021/12/03/prime-minister-welcomes-new-parliamentary-secretaries",
  "pageTitle": "Prime Minister welcomes new parliamentary secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced a new team of parliamentary secretaries.</p>\n\n<p>This team will be an important link between ministers and Parliament, working closely with their colleagues to find real solutions to the challenges that Canadians face, as we finish the fight against COVID-19 and build a better future for everyone. Together, we will work to create new jobs and grow the middle class, put home ownership back in reach for Canadians, accelerate the fight against climate change, deliver on $10-a-day child care, and continue to walk the shared path of reconciliation.</p>\n\n<p>The new parliamentary secretaries are appointed as follows:</p>\n\n<ul>\n\t<li><strong>Gary Anandasangaree</strong> becomes Parliamentary Secretary to the Minister of Justice and Attorney General of Canada</li>\n\t<li><strong>Vance Badawey</strong> becomes Parliamentary Secretary to the Minister of Indigenous Services</li>\n\t<li><strong>Jaime Battiste</strong> becomes Parliamentary Secretary to the Minister of Crown-Indigenous Relations</li>\n\t<li><strong>Terry Beech</strong> becomes Parliamentary Secretary to the Deputy Prime Minister and Minister of Finance</li>\n\t<li><strong>Rachel Bendayan</strong> becomes Parliamentary Secretary to the Minister of Tourism and Associate Minister of Finance</li>\n\t<li><strong>Chris Bittle</strong> becomes Parliamentary Secretary to the Minister of Canadian Heritage</li>\n\t<li><strong>Élisabeth Brière</strong> becomes Parliamentary Secretary to the Minister of Mental Health and Addictions and Associate Minister of Health</li>\n\t<li><strong>Paul Chiang </strong>becomes Parliamentary Secretary to the Minister of Housing and Diversity and Inclusion (Diversity and Inclusion)</li>\n\t<li><strong>Julie Dabrusin</strong> becomes Parliamentary Secretary to the Minister of Natural Resources and Parliamentary Secretary to the Minister of Environment and Climate Change</li>\n\t<li><strong>Pam Damoff</strong> becomes Parliamentary Secretary to the Minister of Public Safety</li>\n\t<li><strong>Francis Drouin</strong> becomes Parliamentary Secretary to the Minister of Agriculture and Agri-Food</li>\n\t<li><strong>Terry Duguid</strong> remains Parliamentary Secretary to the Minister of Environment and Climate Change</li>\n\t<li><strong>Greg Fergus</strong> remains Parliamentary Secretary to the Prime Minister and Parliamentary Secretary to the President of the Treasury Board</li>\n\t<li><strong>Andy Fillmore</strong> becomes Parliamentary Secretary to the Minister of Innovation, Science and Industry</li>\n\t<li><strong>Darren Fisher</strong> becomes Parliamentary Secretary to the Minister of Seniors</li>\n\t<li><strong>Peter Fragiskatos </strong>becomes Parliamentary Secretary to the Minister of National Revenue</li>\n\t<li><strong>Anthony Housefather</strong> becomes Parliamentary Secretary to the Minister of Public Services and Procurement</li>\n\t<li><strong>Yvonne Jones</strong> becomes Parliamentary Secretary to the Minister of Natural Resources and Parliamentary Secretary to the Minister of Northern Affairs</li>\n\t<li><strong>Mike Kelloway</strong> becomes Parliamentary Secretary to the Minister of Fisheries, Oceans and the Canadian Coast Guard</li>\n\t<li><strong>Annie Koutrakis</strong> becomes Parliamentary Secretary to the Minister of Transport</li>\n\t<li><strong>Irek Kusmierczyk</strong> remains Parliamentary Secretary to the Minister of Employment, Workforce Development and Disability Inclusion</li>\n\t<li><strong>Marie-France Lalonde </strong>becomes Parliamentary Secretary to the Minister of Immigration, Refugees and Citizenship</li>\n\t<li><strong>Stéphane Lauzon</strong> becomes Parliamentary Secretary to the Minister of Rural Economic Development</li>\n\t<li><strong>Soraya Martinez Ferrada</strong> becomes Parliamentary Secretary to the Minister of Housing and Diversity and Inclusion (Housing)</li>\n\t<li><strong>Bryan May</strong> becomes Parliamentary Secretary to the Minister of National Defence</li>\n\t<li><strong>Yasir Naqvi</strong> becomes Parliamentary Secretary to the President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness</li>\n\t<li><strong>Jennifer O’Connell</strong> becomes Parliamentary Secretary to the Minister of Intergovernmental Affairs, Infrastructure and Communities</li>\n\t<li><strong>Rob Oliphant</strong> remains Parliamentary Secretary to the Minister of Foreign Affairs</li>\n\t<li><strong>Ya’ara Saks</strong> becomes Parliamentary Secretary to the Minister of Families, Children and Social Development</li>\n\t<li><strong>Darrell Samson</strong> remains Parliamentary Secretary to the Minister of Veterans Affairs and Associate Minister of National Defence</li>\n\t<li><strong>Marc G. Serré</strong> becomes Parliamentary Secretary to the Minister of Official Languages</li>\n\t<li><strong>Terry Sheehan</strong> becomes Parliamentary Secretary to the Minister of Labour</li>\n\t<li><strong>Maninder Sidhu</strong> becomes Parliamentary Secretary to the Minister of Foreign Affairs</li>\n\t<li><strong>Jenna Sudds</strong> becomes Parliamentary Secretary to the Minister for Women and Gender Equality and Youth</li>\n\t<li><strong>Anita Vandenbeld </strong>becomes Parliamentary Secretary to the Minister of International Development</li>\n\t<li><strong>Adam van Koeverden</strong> becomes Parliamentary Secretary to the Minister of Health and Parliamentary Secretary to the Minister of Sport</li>\n\t<li><strong>Arif Virani</strong> becomes Parliamentary Secretary to the Minister of International Trade, Export Promotion, Small Business and Economic Development</li>\n</ul>\n\n<p>The Prime Minister announced that Mr. Fergus and Mr. Oliphant will be sworn in as members of the Privy Council.</p>\n\n<p>The Prime Minister also announced the following appointments. Under the leadership of the Leader of the Government in the House of Commons, Mark Holland, and the Chief Government Whip, Steven MacKinnon, the following team will work with all parliamentarians to make progress on the priorities that matter most to Canadians:</p>\n\n<ul>\n\t<li><strong>Kevin Lamoureux</strong> will continue to serve as Parliamentary Secretary to the Leader of the Government in the House of Commons &nbsp;</li>\n\t<li><strong>Mark Gerretsen </strong>will serve as Parliamentary Secretary to the Leader of the Government in the House of Commons (Senate)</li>\n\t<li><strong>Sherry Romanado&nbsp;</strong>will serve as Deputy Leader of the Government in the House of Commons</li>\n\t<li><strong>Ruby Sahota</strong> will serve as Deputy Government Whip</li>\n</ul>\n\n<p>This new team of parliamentary secretaries brings the diverse knowledge, experience, and skills needed to carry out the Government of Canada’s progressive plan and support the unique needs of people and regions across the country. They will help advance new legislation, engage directly with Canadians on key initiatives, and represent the government at home and abroad.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians across the country have chosen to keep Canada moving forward, from finishing the fight against COVID-19 to getting the job done on $10-a-day child care. This talented and diverse team of parliamentary secretaries will work tirelessly with their ministers and colleagues to deliver on these priorities and build a better future for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Parliamentary secretaries are chosen by the Prime Minister to assist ministers.</li>\n\t<li>The responsibilities of parliamentary secretaries generally fall into two broad categories: House of Commons business and department-related duties.</li>\n\t<li>Parliamentary secretaries are not members of Cabinet and do not play a formal role in the Cabinet decision-making process. They support their ministers, but overall responsibility and accountability remains with the minister.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/parliamentary-secretaries\">Parliamentary Secretaries</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2016/01/05/guide-parliamentary-secretaries\">Guide for Parliamentary Secretaries</a></li>\n\t<li><a href=\"https://www.ourcommons.ca/members/en/house-officers\">Party Leaders and House Officers</a></li>\n</ul></div>\n      "
}