{
  "path": "/en/news/news-releases/2021/05/27/making-homes-more-energy-efficient-reduce-energy-bills-create-jobs",
  "pageTitle": "Making homes more energy efficient to reduce energy bills, create jobs, and cut pollution | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Climate action starts at home. By helping Canadians make their homes more energy efficient, the Government of Canada is making it easier for them to reduce their energy bills and making their lives more affordable. This will cut pollution, create jobs and growth, and build a cleaner future for all Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today launched the new Canada Greener Homes Grant, which will help up to 700,000 Canadian homeowners across the country improve the energy efficiency of their homes and reduce their energy bills through an investment of $2.6 billion over seven years.</p>\n\n<p>Homeowners will be able to receive grants of up to $5,000 to make energy efficient retrofits to their primary residences, and up to $600 to help with the cost of home energy evaluations. Eligible home improvements and upgrades include replacing windows and doors, adding insulation, sealing air leaks, improving heating and cooling systems – such as with heat pumps – and purchasing renewable energy systems like solar panels.</p>\n\n<p>To support this new initiative, we announced last week our commitment to recruit and train up to 2,000 new energy advisors to help provide guidance, advice, and timely evaluations to Canadians from coast to coast to coast. This recruitment, with a focus on advancing diversity and inclusion, will create new jobs and economic growth that benefits everyone.</p>\n\n<p>Today’s announcement is just one of the many steps the Government of Canada is taking to fight climate change, reduce pollution, and protect the environment. Through Canada’s climate plan, we are making life more affordable for Canadians, creating good middle class jobs, and building a stronger and cleaner economy for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Whether replacing a drafty window, adding insulation, or making upgrades ahead of a tough Canadian winter, today’s investment will help Canadians make their homes more comfortable and life more affordable. Improving the energy efficiency of our homes not only cuts down on pollution, it also creates new jobs, economic growth, and a cleaner future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canadians are looking for ways to save money on their energy bills and do their part to fight climate change. We are driving economic activity and creating jobs by improving energy efficiency and helping Canadians lower their carbon footprint. The Canada Greener Homes Grant is good for your wallet, good for the economy, and good for the planet.”</p>\n\n<footer class=\"default\">The Hon. Seamus O’Regan, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>“The homes and buildings of Canadians account for almost 20 per cent of Canada’s greenhouse gas emissions, so retrofitting our homes to make them more comfortable and efficient won’t just save money, it’s an important measure in the fight against climate change.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“Tackling climate change, creating jobs and growth, and building a cleaner future for all Canadians are top priorities for the Government of Canada. The new Canada Greener Homes Grant will help make the lives of homeowners across the country more affordable by reducing their energy bills and making their homes more energy efficient. This initiative is an important part of our plan to build cleaner, more inclusive communities, tackle climate change, and drive to net-zero emissions by 2050.”</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Canada Greener Homes Grant is retroactive to December 1, 2020.</li>\n\t<li>Homeowners can go <a href=\"https://www.nrcan.gc.ca/energy-efficiency/homes/canada-greener-homes-grant/23441\">online</a> to register, plan, and document their progress, which includes applying for their pre-retrofit EnerGuide evaluation, choosing from a <a href=\"https://www.nrcan.gc.ca/node/23504\">list of eligible retrofits</a>, scheduling a post-retrofit evaluation, and applying for reimbursement.</li>\n\t<li>To <a href=\"https://www.nrcan.gc.ca/node/23476\">participate in this new initiative</a>, a homeowner’s primary residence must be at least six months old, from the date of occupancy by the first homeowner, and eligible for an EnerGuide evaluation. Residences include single and semi-detached houses, row housing, townhomes, mobile homes on a permanent foundation, permanently moored floating homes, small multi-unit residential buildings (up to three storeys with a footprint of up to 600m<sup>2</sup>), and mixed-use buildings (residential portion only).</li>\n\t<li>Retrofits that help protect homes from weather events – such as floods, wind damage, and power outages – are also eligible for the grant if they are done in combination with measures that improve energy efficiency.</li>\n\t<li>Buildings, including homes, account for 13 per cent of Canada’s greenhouse gas emissions. When taking into account space and water heating as well as electricity use for cooling, lighting, and appliances, this brings the total to 18 per cent. Retrofitting existing homes is an effective way to reduce greenhouse gas emissions.</li>\n\t<li>Home energy retrofits that reduce consumption of heating oil and natural gas will also reduce greenhouse gas emissions while saving money.</li>\n\t<li>Today’s investment was included in the Fall Economic Statement 2020, and approved on May 6, 2021 through the adoption of Bill C-14, <em>An Act to implement certain provisions of the economic statement tabled in Parliament on November 30, 2020 and other measures</em>.</li>\n\t<li>Announced in December 2020, Canada’s strengthened climate plan,&nbsp;<em>A Healthy Environment and a Healthy Economy</em>,&nbsp;includes $15 billion in investments to help achieve our economic and environmental goals.\n\t<ul>\n\t\t<li>The plan includes measures to make it easier for Canadians to improve the energy efficiency of the places where they live and gather, including through investments in retrofits.</li>\n\t</ul>\n\t</li>\n\t<li>Budget 2021 provides $4.4 billion in interest-free loans of up to $40,000 to help up to 200,000 homeowners and landlords complete extensive home retrofits. More details will be available this summer.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2021/05/government-of-canada-invests-in-energy-efficient-homes.html\">Backgrounder: Government of Canada Invests in Energy Efficient Homes</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/homes/canada-greener-homes-grant/23441\">Canada Greener Homes Grant</a></li>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2021/05/canada-investing-10-million-to-create-jobs-for-new-energy-advisors.html\">Canada Investing $10 million to Create Jobs for New Energy Advisors</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/healthy-environment-healthy-economy.html\">A Healthy Environment and a Healthy Economy</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/fes-eea/2020/home-accueil-en.html\">Fall Economic Statement 2020: Supporting Canadians and Fighting COVID-19</a></li>\n</ul></div>\n      "
}