{
  "path": "/en/news/news-releases/2016/03/02/prime-minister-announces-significant-new-investments-climate",
  "pageTitle": "Prime Minister announces significant new investments in climate resilience | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the Government of Canada’s commitment to invest in two initiatives that will give Canadian cities and towns the tools they need in order to reduce emissions and adapt to a changing climate.</p>\n<p>Innovation and adaptation are vital to create clean jobs, grow our economy, and protect our environment. The GLOBE 2016 conference demonstrates the important role that businesses, governments, and investors will play in Canada’s transition to a low-carbon economy that provides good jobs and great opportunities for Canadians.</p>\n<p>To get there, Canada must make smart, strategic investments in clean growth and new infrastructure. Retooling our economy for this era of change will require new thinking and innovation.</p>\n<p>As an important first step, the Prime Minister announced $75 million in new funding to the Federation of Canadian Municipalities (FCM) to help local governments reduce emissions and build climate resiliency at the municipal-level. The Government of Canada will also invest $50 million to improve climate resilience in building and infrastructures codes across Canada.</p>\n<p>Taken together, these measures will reduce greenhouse gas emissions, enhance the life cycle of public and private infrastructure projects—including buildings, bridges, roads, and water and wastewater utilities—and ensure the long-term sustainability of Canadian communities.</p>\n<p>Going forward, new growth will be clean growth. The future is happening now, and Canada needs to be a part of it.</p>\n<p><strong>Quote</strong></p>\n<p>“The investments announced today will supply the architects of our next generation of infrastructure with the guidelines, standards, and data they need to ensure that every Canadian community and every Canadian industry can thrive in a changing climate.&nbsp;Working with the provinces and territories, municipalities, and Indigenous groups, we will create a cleaner, more prosperous future for Canada, and take our place among the leaders in this new, clean growth economy.”&nbsp;</p>\n<p>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada </em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Under the theme “Business Innovation for the Planet,” GLOBE 2016 is bringing together nearly 2,000 business and government leaders from more than 50 countries to develop sustainable – and effective – business strategies.</li>\n<li>The summit’s program builds on the climate talks that took place last December in Paris, where Canada and 194 other parties reached a historic, ambitious, and balanced agreement to address climate change.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.cop21paris.org/\">COP21</a></li>\n<li><a href=\"http://www.globeseries.com/\">GLOBE 2016</a></li>\n</ul></div>\n      "
}