{
  "path": "/en/news/news-releases/2022/11/21/prime-minister-announces-appointment-three-senators",
  "pageTitle": "The Prime Minister announces the appointment of three senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed Dr. Sharon Burey, Mr. Andrew Cardozo, and Rear-Admiral Rebecca Patterson as independent senators to fill vacancies for Ontario.</p>\n\n<p>Dr. Sharon Burey is a pediatrician and recognized health advocacy and policy leader for the health and well-being of children in Ontario. Dr. Burey has dedicated her career to equality and justice for those living in poverty, visible minorities, and other marginalized communities. She was also the first woman of colour to hold the position of President of the Pediatricians Alliance of Ontario. Dr. Burey has received numerous awards and honours for her medical, community, and advocacy work.</p>\n\n<p>Mr. Andrew Cardozo is a recognized expert on public policy, a columnist, and artist. A think-tank leader, Mr. Cardozo is the President of the Pearson Centre for Progressive Policy, a regular contributor to the Hill Times, and has been a columnist for the Toronto Star and Broadcast Dialogue. His public policy areas of expertise span Canadian government and politics, multiculturalism, anti-racism, diversity and equity, broadcasting and cultural policy, and skills development, especially the future of work. Mr. Cardozo has also been an Adjunct Professor at Carleton University and the recipient of several awards, including the 125th Anniversary of the Confederation of Canada Medal.</p>\n\n<p>Rear-Admiral Rebecca Patterson is a Canadian Armed Forces leader, Defence Champion for Women, and the first person with a military nursing background to ever lead at the rank of Flag (General) Officer. Rear-Admiral Patterson has held various leadership roles within the Canadian Armed Forces. She is currently serving as Director General, Culture Change, Chief Professional Conduct and Culture, where she coordinates the whole-of-Defence policy approach to support Canada’s National Action Plan on Women, Peace and Security. In this role, she also supports departmental efforts to transform culture, eliminate harmful behaviors, and re-establish public trust in the institution. Rear-Admiral Patterson is an Officer in the Order of Military Merit and the recipient of numerous other honours and awards, including the Governor General’s Meritorious Service Medal.</p>\n\n<p>Dr.&nbsp;Burey, Mr. Cardozo, and Rear-Admiral Patterson were recommended by the Independent Advisory Board for Senate Appointments, and chosen using a merit-based process open to all Canadians. This process ensures senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p>\n\n<p><strong>Quote</strong></p>\n\n<blockquote>\n<p>“Today, I welcome Dr. Sharon Burey, Mr. Andrew Cardozo, and Rear-Admiral Rebecca Patterson as Parliament’s newest independent senators. I know that their rich experiences, diverse perspectives, and passion for public service will help them be strong voices for all Ontarians. I look forward to working with them, and with all senators, as we continue to build a stronger, more prosperous, and more inclusive country that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Senate is the Upper House in Canada’s parliamentary democracy. It unites a diverse group of accomplished Canadians in service of their country. Created to counterbalance representation by population in the House of Commons, the Senate not only defends regional interests, it also creates space for the voices of historically underrepresented groups like Indigenous Peoples, racialized communities, and women.</li>\n\t<li>With today’s announcement, there have been 66 independent appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, senators are appointed on the advice of the Prime Minister.</li>\n\t<li>In 2016, the selection process for senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n\t<li>The Board is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General, new senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial and territorial, and minority interests – important functions in a modern democracy.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/21/sharon-burey\">Sharon Burey</a></li>\n\t<li><a href=\"/en/news/backgrounders/2022/11/21/andrew-cardozo\">Andrew Cardozo</a></li>\n\t<li><a href=\"/en/news/backgrounders/2022/11/21/rebecca-patterson\">Rebecca Patterson</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Senate Appointments Process – Questions and Answers</a></li>\n\t<li><a href=\"https://sencanada.ca/en\">Senate of Canada</a></li>\n</ul></div>\n      "
}