{
  "path": "/en/news/readouts/2021/06/14/prime-minister-justin-trudeau-meets-prime-minister-mark-rutte-netherlands",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Mark Rutte of the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau today met with the Prime Minister of the Netherlands, Mark Rutte, on the margins of the NATO Summit.</p>\n\n<p>The leaders discussed efforts to end the global COVID-19 pandemic, and measures taken in Canada and the Netherlands to keep people safe and to support workers and businesses. They emphasized the importance of encouraging an economic recovery that benefits everyone.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte spoke about the strength of transatlantic relations. They discussed their collaboration within NATO, as well as Canada’s proposal to host a NATO Centre of Excellence (COE) on Climate and Security.</p>\n\n<p>The leaders highlighted the strong economic and commercial ties between Canada and the Netherlands, and the benefits of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) for businesses and workers in both countries. They emphasized the role that CETA can play in encouraging economic recovery.</p>\n\n<p>The two leaders also spoke about relations with China, and the need to end the arbitrary detention of Canadians Michael Kovrig and Michael Spavor.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/184620.htm\">2021 NATO Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}