{
  "path": "/en/news/readouts/2022/11/10/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister expressed Canada’s continued solidarity with Ukraine as it fights to regain territory while facing Russian strikes on civilian targets and energy infrastructure. These unjustifiable attacks aim only to cause suffering as winter approaches.</p>\n\n<p>The Prime Minister reiterated Canada’s commitment to support Ukraine and its people through military, economic, and humanitarian assistance for as long as necessary. The two leaders considered how Canada can continue to assist Ukraine in the coming months and in the longer term.</p>\n\n<p>The Prime Minister and the President noted the need to address the global impacts of Russia’s invasion, and discussed what can be done to support those most affected by food insecurity.</p>\n\n<p>The leaders also discussed ongoing multilateral efforts to hold Russia to account for its illegal and unjustifiable aggression, and exchanged on ways to approach their upcoming engagements, including at the G20.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for Canada’s significant contributions to Ukraine, including the recently announced Ukraine Sovereignty Bond.</p>\n\n<p>The leaders agreed to stay in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/10/28/prime-minister-announces-new-measures-support-ukraine\">Prime Minister announces new measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/10/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}