{
  "path": "/en/news/readouts/2023/02/16/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Barbados, Mia Mottley.</p>\n\n<p>The leaders discussed their ambitions for mobilizing the international community to make progress on the United Nations Sustainable Development Goals (SDGs), in their roles as co-chairs of UN Secretary-General’s SDG Advocates group.</p>\n\n<p>The prime ministers talked about Prime Minister Mottley’s Bridgetown Initiative to modernize the global financial architecture. Prime Minister Trudeau said that Canada would continue to champion the interests of CARICOM and Small Island and Low-Lying Coastal Developing States (SIDS), particularly on shared interests such as climate resilience and access to concessional finance. Prime Minister Mottley thanked Prime Minister Trudeau for Canada’s leadership in helping to strengthen financial governance in the Caribbean region.</p>\n\n<p>The leaders discussed the ongoing crisis in Haiti and underscored the need for continued support for the Haitian people, including through convening inclusive political dialogue and strengthening the capacity of the Haitian National Police.</p>\n\n<p>The two leaders agreed to continue working closely together over the coming year.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n\t<li><a href=\"https://hgc.caricom.org/#:~:text=Hyatt%2C%20Baha%20Mar.-,The%20Forty%2DFourth%20(44th)%20Regular%20Meeting%20of%20the%20Conference,The%20Bahamas%2C%20Honourable%20Philip%20Davis.\">Forty-Fourth Regular Meeting of the Conference of Heads of Government of CARICOM</a></li>\n</ul></div>\n      "
}