{
  "path": "/en/news/statements/2015/12/16/statement-prime-minister-canada-meeting-national-aboriginal",
  "pageTitle": "Statement by the Prime Minister of Canada on meeting with National Aboriginal Organizations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on meeting with National Aboriginal Organizations:</p>\n<p>“Our overarching goal is to renew the relationship between Canada and Indigenous peoples. This renewal must be a nation-to-nation relationship, based on recognition, respect for rights, co-operation, and partnership.</p>\n<p>“The meeting here today with the Assembly of First Nations, the Congress of Aboriginal Peoples, the Inuit Tapiriit Kanatami, the Métis National Council, and the Native Women’s Association of Canada is an important step towards realizing a renewed partnership.</p>\n<p>“The views of these organizations are critical on how we engage on a number of the commitments we made to Indigenous peoples. We will be seeking views on the way forward for: the national inquiry into missing and murdered Indigenous women and girls; a national reconciliation framework informed by the Calls to Action of the Truth and Reconciliation Commission, starting with the implementation of the United Nations<em>&nbsp;</em>Declaration on the Rights of Indigenous Peoples; and the funding and fiscal relationship required to close the gap in education and economic outcomes.</p>\n<p>“A strong, healthy, cooperative relationship with the leaders of National Aboriginal Organizations is key to making change happen. That is why I am committed to meeting annually with Indigenous leaders from across the country.</p>\n<p>“I thank all the National Aboriginal Organizations leaders who joined with me today in a spirit of openness, collaboration, and hope to bring about positive change.”</p></div>\n      "
}