{
  "path": "/en/news/news-releases/2019/05/22/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of the Court of Queen’s Bench of Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Kenneth G. Nielsen, a judge of the Court of Queen’s Bench of Alberta, as an Associate Chief Justice of the Court of Queen’s Bench of Alberta.</p>\n\n<p>Justice Nielsen has been appointed to a newly created position in an effort to help manage the growing and increasingly complex caseload being experienced by the Court.<strong>&nbsp; </strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish Kenneth Nielsen every success as a new Associate Chief Justice of the Court of Queen’s Bench of Alberta. I am confident that he will continue to serve Albertans well, with his extensive experience in practising and teaching law and over a decade serving as a judge on the superior court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Justice Nielsen was appointed to the Court of Queen’s Bench of Alberta in 2007.</li>\n\t<li>The <em>Budget Implementation Act, 2017, No. 2.</em> created a second Associate Chief Justice position within Alberta’s superior court.</li>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n\t<li>The Court of Queen's Bench is the Superior Trial Court for the Province, hearing trials in civil and criminal matters and appeals from decisions of the Provincial Court.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/05/22/honourable-justice-kenneth-g-nielsen\">The Honourable Justice Kenneth G. Nielsen</a></li>\n</ul></div>\n      "
}