{
  "path": "/en/news/news-releases/2016/08/18/prime-minister-travel-china-official-visit-and-attend-g20-summit",
  "pageTitle": "The Prime Minister to travel to China for an official visit and to attend G20 Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to China – at the invitation of Premier of the State Council of the People's Republic of China, Li Keqiang – for an official visit from August 30 to September 6. During the official visit, the Prime Minister will also participate in the G20 Leaders' Summit on September 4 and 5 in Hangzhou, China.</p>\n<p>This official visit – which includes stops in Beijing, Shanghai, Hangzhou, and Hong Kong – will provide an opportunity for the Prime Minister to connect with Chinese leaders in government, business, and the public at large.</p>\n<p>During his visit, the Prime Minister will seek to promote greater dialogue between Canada and China. The Canadian delegation will also work closely with Chinese leaders to bolster our shared prosperity and grow the Canadian middle class.</p>\n<p>At the Hangzhou Summit, G20 leaders will consider measures to lift global economic growth and investment, create jobs, strengthen the middle class, reinforce the resilience of the global financial system, and increase trade and investment.</p>\n<p>Canada welcomes the agenda brought forward by China as this year's G20 host, which encourages members to work together towards an innovative, interconnected, and inclusive world economy.</p>\n<p><strong>Quotes</strong></p>\n<p>\"Strengthening our relationship with China is essential to growing our middle class, and creating new opportunities for Canadian businesses. On this trip, I will strive for a closer, more balanced relationship between Canada and China—one that unlocks the untapped potential in our two countries’ commercial ties, and advances important issues like good governance, the rule of law and the environment.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>\"Canada firmly believes in the work of the G20 and its ability to promote strong, sustainable, and inclusive global growth and prosperity. We place great importance on working with our G20 partners to help address some of the world's most pressing challenges, like climate change, migration, and sustainable development.\"<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>China is the world's second largest economy, and Canada's second-largest single-country trading partner. In 2015, Hong Kong was Canada’s 8th largest merchandise export market reaching $3.9 billion.</li>\n<li>Two-way merchandise trade between Canada and China amounted to nearly $85.8 billion in 2015, a 10.1 per cent increase over 2014, and accounted for 8.1 percent of Canada's total merchandise trade.</li>\n<li>Canada's two-way foreign direct investment (FDI) relationship with China reached $33 billion at the end of 2015 and two-way investment relationship with Hong Kong amounted to $23.7 billion in 2015.</li>\n<li>Canadians of Chinese descent make up approximately 4.5% per cent of Canada's population.</li>\n<li>Students from China—over 120,000 in 2015—are by far the largest group of international students in Canada.</li>\n<li>Together, the members of the G20 account for more than 85 per cent of the world's economy and nearly two-thirds of the world's population, making the G20 the premier forum for international economic cooperation.</li>\n<li>Also at the G20 Summit, other areas of focus will include: international taxation, anti-corruption efforts, climate change, energy, development and migration.</li>\n<li>Minister of Foreign Affairs, the Honourable Stéphane Dion, Minister of International Trade, the Honourable Chrystia Freeland, and Minister of Finance, the Honourable Bill Morneau, will also be travelling to China as part of the Canadian delegation.</li>\n</ul></div>\n      "
}