{
  "path": "/en/news/news-releases/2016/03/16/prime-minister-announces-canadas-bid-non-permanent-seat-united",
  "pageTitle": "Prime Minister announces Canada’s bid for a non-permanent seat on the United Nations Security Council | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced Canada’s candidacy for election to the United Nations (UN) Security Council as a non-permanent member for a two-year term that begins in 2021.</p>\n<p>Canada is committed to playing a positive and constructive role in the world in order to advance Canadian interests and make meaningful contributions to solving global challenges.</p>\n<p>The Prime Minister made the announcement at the United Nations Headquarters in New York City. The United Nations remains a principal forum for pursuing Canada’s international objectives – including the promotion of democracy, inclusive governance, human rights, development, and international peace and security.</p>\n<p>Moving forward, Canada will continue to strengthen its relationship with the United Nations and will expand its contribution to the maintenance of international peace and security. A peaceful world is also a safer and more prosperous world for Canada.</p>\n<p><strong>Quote</strong></p>\n<p>“From John Humphrey’s work on the UN Declaration on Human Rights to Lester B. Pearson’s pivotal role in the development of peacekeeping, Canadians have accomplished extraordinary things in support of the UN’s mission to promote human rights, development, and peace and security. We are determined to help the UN make greater strides in support of its goals for all humanity.”</p>\n<p>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Security Council is one of the six main organs established under the UN Charter. It is composed of 15 members—five permanent and 10 non-permanent.</li>\n<li>The five permanent Security Council members are: China, France, Russia, the United Kingdom, and the United States.</li>\n<li>The&nbsp;General Assembly elects 10 non-permanent members&nbsp;for a two-year term. The&nbsp;10&nbsp;non-permanent seats are distributed on a regional basis.</li>\n</ul>\n<p><strong>Associated Link</strong></p>\n<p><a href=\"http://www.international.gc.ca/genev/mission/canada-UN_nu.aspx?lang=eng\">Canada and the United Nations</a></p></div>\n      "
}