{
  "path": "/en/news/news-releases/2017/09/15/new-facebook-research-facility-open-montreal",
  "pageTitle": "New Facebook research facility to open in Montréal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From smartphone applications that can understand human speech to self-driving cars, artificial intelligence (AI) is changing the way that people interact with each other and their environment. AI and deep learning help create jobs, improve our quality of life, and generate new opportunities for the middle class and those working hard to join it.</p><p>The Prime Minister, Justin Trudeau, today took part in Facebook’s announcement that they will open a new AI lab in Montréal – the company’s first intelligence lab in Canada, and only its second outside of the United States. By next year, the lab is expected to employ a team of twenty researchers headed by McGill University’s Dr. Joelle Pineau, a leading AI researcher.</p><p>The researchers will develop new ways of teaching machines the complex relationship between actions and results, known as reinforcement learning. They will also develop dialog systems for machines and computers that enable them to speak with users in a natural and easily understandable way.</p><p>This new lab will help grow a stronger Canadian technology ecosystem. It will create good jobs and help Canada continue to retain and recruit high quality talent in this important area of research and economic growth. It will mean a stronger economy for our country, as professionals and students choose to stay here rather than look abroad for jobs and opportunities in the technology sector.</p><h2>Quote</h2><blockquote><p>“When tech giants like Facebook decide to invest in our cities, that is not only a testament to the world-class talent of our people, but also to Canada’s enormous potential as an innovation and tech hub. Facebook’s new lab in Montréal will underline Canada’s status as a global AI powerhouse, and a leader in the economy of the future&nbsp;— and encourage other leading tech companies to set up shop here and create good, middle class jobs for Canadians.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Montréal is a natural fit for this new lab, as many of the early AI pioneers come from the city and several important advancements have been made here.</li><li>In addition to this new lab, Facebook will invest $7 million in the broader Montréal-based AI community through partnerships with the Canadian Institute for Advanced Research and the Montreal Institute for Learning Algorithms.</li><li>Canada is a world leader when it comes to investing in research at post-secondary institutions, ranking first among G7 nations and eighth among Organisation for Economic Co-operation and Development nations.</li><li>In order to help new, innovative initiatives in Canada, Budget 2017 included an <a href=\"http://www.ic.gc.ca/eic/site/062.nsf/eng/home\">Innovation and Skills Plan</a> to make it easier for Canadian entrepreneurs and innovators to turn their ideas into thriving businesses.</li><li>To retain and attract top academic talent, and to increase the number of post-graduate trainees and researchers studying artificial intelligence and deep learning, Budget 2017 also proposed $125 million to launch a Pan-Canadian Artificial Intelligence Strategy for research and talent.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-01-en.html\">Budget 2017: Chapter 1 - Skills, Innovation and Middle Class Jobs</a></li></ul></div>\n      "
}