{
  "path": "/en/news/news-releases/2017/06/07/belgian-prime-minister-charles-michel-visit-canada",
  "pageTitle": "Belgian Prime Minister Charles Michel to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that Charles Michel, Prime Minister of Belgium, will visit Canada from June 14 to 16, 2017. The two leaders will meet in Ottawa on June 16.</p><p>During their meeting,&nbsp;<span lang=\"EN\" xml:lang=\"EN\">Prime Minister Trudeau and Prime Minister Michel will discuss issues of mutual interest, including how to leverage opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA). They will explore how to best harness innovation in science and technology to create jobs and encourage clean economic growth in both countries.</span><span lang=\"EN\" xml:lang=\"EN\"> As NATO Allies, they will also</span> discuss security and defence issues, and reinforce a collaborative approach to addressing the common threat of terrorism.</p><h2>Quote</h2><blockquote><p>“Canada and Belgium are close friends with a strong partnership in trade, investment and innovation. I look forward to meeting with Prime Minister Michel to discuss how CETA will expand trade opportunities between our two countries and create good, well-paying middle class jobs on both sides of the Atlantic.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Belgium enjoy an excellent bilateral relationship across the political, commercial and cultural spectrums.</li><li><span lang=\"EN\" xml:lang=\"EN\">Canada and Belgium enjoy a robust trading relationship, with Antwerp serving as a major port of entry for Canadian goods into Europe. </span></li><li>Belgium is Canada’s 6th largest EU trading partner and our 16th globally. In 2016, bilateral merchandise trade between Canada and Belgium totalled more than $5.4 billion.</li><li>Investments by both countries into each other’s economies are substantial. In 2016, Canadian investments in Belgium totalled $1.7 billion, and Belgian investments in Canada totalled more than $3.2 billion.</li><li><span lang=\"EN\" xml:lang=\"EN\">Canadian and Belgian research institutions and companies collaborate on innovation, science and technology in a variety of areas – from life sciences to microelectronics and environmental and imaging technologies</span>.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/belgium-belgique/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;menu_id=28\">Canada-Belgium Relations</a></li></ul></div>\n      "
}