{
  "path": "/en/news/statements/2019/06/06/statement-prime-minister-75th-anniversary-d-day-and-battle-normandy",
  "pageTitle": "Statement by the Prime Minister on the 75th anniversary of D-Day and the Battle of Normandy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75th anniversary of D-Day and the Battle of Normandy:</p>\n\n<p>“Today, on the <a href=\"https://www.veterans.gc.ca/eng/remembrance/history/second-world-war/d-day/75th-anniversary\">75th anniversary of D-Day and the Battle of Normandy</a>, we pause to honour those who fought and gave their lives in a campaign that helped turn the tide of the Second World War.</p>\n\n<p>“Seventy-five years ago today, the largest combined military operation in history began. The Allied landings aimed to secure five beaches along the coast of occupied France. Land mines, gun positions, barbed wire, concrete bunkers, anti-tank walls, and thousands of enemy troops guarded the shores.&nbsp;</p>\n\n<p>“It was a gamble like the world had never seen. The possibility of catastrophic casualties was high, but the Allies knew they needed to break through the Atlantic Wall to defeat the Nazis and end the war in Europe.</p>\n\n<p>“Fourteen thousand Canadians stormed Juno Beach on June 6, 1944. They joined British, American, and French allies in the massive D-Day amphibious assault on the beaches of Normandy. They served under different flags, but fought for one cause. They stood up to tyranny and stood for freedom, and laid down their lives in defence of human rights and democracy.</p>\n\n<p>“The magnitude of cooperation among nations was staggering. Air forces, naval forces, amphibious forces – assault infantry, paratroopers, sappers, tank crews, and gunners – all came together as one.</p>\n\n<p>“They formed a mighty multinational force that would breach the Atlantic Wall and open brutal fighting throughout Northwest Europe. Eleven months later, Nazi Germany surrendered. The war would soon be over.</p>\n\n<p>“For the thousands of Canadians who landed on Juno Beach 75 years ago, it was a day that they could never forget. Neither can we. The living memory of the Second World War will soon pass. We share a sacred responsibility to keep veterans’ stories alive, to recognize the cost of war, and honour their immeasurable sacrifices.</p>\n\n<p>“I urge all Canadians to pause and remember the more than 5,000 Canadian soldiers who gave their lives during the Battle of Normandy. They were among the more than one million Canadians who served during the Second World War – and changed the course of history.</p>\n\n<p>“Lest we forget.”</p>\n\n<p>&nbsp;</p></div>\n      "
}