{
  "path": "/en/news/news-releases/2017/05/01/prime-minister-announces-appointment-honourable-stephane-dion",
  "pageTitle": "Prime Minister announces appointment of the Honourable Stéphane Dion as Ambassador to Germany and Special Envoy to the European Union and Europe | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">Today, the Prime Minister, Justin Trudeau, announced the appointment of the Honourable Stéphane Dion as Canada’s Ambassador to Germany and his Special Envoy to the European Union (EU) and Europe.&nbsp; </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">Following consultations with European partners, it was agreed that this appointment will best deliver on the Prime Minister’s commitment to strengthen Canada’s relations with Europe. The Prime Minister has exchanged letters with European Council President Donald Tusk and European Commission President Jean-Claude Juncker, his two counterparts in Canada-EU Leaders’ Summits, on the purpose of Mr. Dion’s role as Special Envoy to the EU and Europe. Mr. Dion will depart to take up his assignments in early May.&nbsp; </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">As Special Envoy to the EU and Europe, Mr. Dion will play a central role in advancing Canada’s interests throughout Europe, ensuring coherence across the activities of Canadian diplomatic missions, and providing strategic guidance to the Prime Minister. He will also work with European partners to advance a shared progressive international agenda, more important than ever in today’s challenging environment. Canada will continue to be represented by our existing Mission to the EU and Ambassador to the EU in Brussels. Mr. Dion will work closely with them to provide further impetus to Canada-EU relations. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">As Canada’s Ambassador to Germany, Mr. Dion will work to deepen our relationship with Germany – the largest economy in Europe, and an important bilateral trade and investment partner. Germany and Canada share values, such as openness, diversity and inclusion, and are important friends and allies in the G7, G20, NATO, United Nations, and other multilateral organizations.&nbsp; </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">In these important assignments, Mr. Dion's unique experience and attributes will be of enormous strategic benefit to both Canada and Europe. He will engage with interlocutors across Europe at a high level in order to protect and promote our values and interests.</span></p><h2>Quote</h2><blockquote><p>“Stéphane is a man who has long fought to create a better country for all Canadians, with a keen understanding of how the transatlantic relationship can help to advance shared values and interests. As my Special Envoy and Canada’s senior diplomatic voice in Europe, I know he will proudly represent Canada with courage and conviction in this next important chapter for him, for Canada and for the whole of Europe.”<br><cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote></div>\n      "
}