{
  "path": "/en/news/itineraries/2018/11/29/itinerary-friday-november-30-2018",
  "pageTitle": "Itinerary for Friday, November 30, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>Buenos Aires, Argentina</h2><p><strong>9:00 a.m.</strong> The Prime Minister will participate in a signing ceremony for the new North American Free Trade Agreement with President of the United States Donald Trump and President of Mexico Enrique Peña Nieto, and will deliver remarks. Minister of Foreign Affairs Chrystia Freeland will be in attendance.</p><p>Palacio Duhau Hotel, Park Hyatt Buenos Aires<br> Avenida Alvear 1661</p><p><strong>Note for media:</strong></p><ul><ul><li>Pooled coverage</li></ul></ul><p><b>10:00 a.m. </b>The Prime Minister will participate in the welcome ceremony held by President of Argentina Mauricio Macri.</p><p>Family Photo Area, Ground Floor<br>Costa Salguero Centre<br>Av. Costanera Rafael Obligado 1221</p><p><b>Note for media:</b></p><ul><ul><li>Official photographers only and host broadcaster only</li></ul></ul><p><b>10:30 a.m. </b>The Prime Minister will participate in the G20 Leaders’ Retreat.</p><p><i> Closed to media. </i></p><p><b>12:20 p.m. </b>The Prime Minister will participate in the G20 family photo.</p><p>Family Photo Area, Ground Floor<br>Costa Salguero Centre<br>Av. Costanera Rafael Obligado 1221</p><p><b>Note for media:</b></p><ul><ul><li>Pooled photo opportunity and host broadcaster only</li></ul></ul><p><b>12:30 p.m. </b>The Prime Minister will attend the G20 Summit opening remarks, delivered by President of Argentina Mauricio Macri.</p><p>Plenary Room, Ground Floor<br>Costa Salguero Centre<br>Av. Costanera Rafael Obligado 1221</p><p><b>Note for media:</b></p><ul><ul><li>Pooled photo opportunity and host broadcaster only</li></ul></ul><p><b>1:00 p.m. </b>The Prime Minister will participate in the G20 Working Luncheon, Working Session I, hosted by President of Argentina Mauricio Macri.</p><p><i> Closed to media. </i></p><p><b>2:30 p.m. </b>The Prime Minister will meet with the President of South Africa Cyril Ramaphosa.</p><p>Room 17, Ground Floor<br>Costa Salguero Centre<br>Av. Costanera Rafael Obligado 1221<b>&nbsp; &nbsp;</b></p><p><b>Note for media:</b></p><ul><ul><li>Photo opportunity at the beginning of the meeting</li></ul></ul><p><b>3:15 p.m. </b>The Prime Minister will participate in the G20 Working Session II.</p><p><i>Closed to media.</i></p><p><b>5:15 p.m.</b>&nbsp;The Prime Minister will meet with Governor of the Bank of England Mark Carney.</p><p>Room 17, Ground Floor<br>Costa Salguero Centre<br>Av. Costanera Rafael Obligado 1221&nbsp;&nbsp;</p><p><b> Note for media:</b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li></ul></ul><p><b>6:20 p.m. </b>The Prime Minister will participate in the G20 Leaders arrival. &nbsp;</p><p><b>Note for media:</b></p><ul><ul><li>Official photographers only and host broadcaster only</li></ul></ul><p><b>6:30 p.m. </b>The Prime Minister and Ms. Grégoire Trudeau will participate in the G20 family photograph.</p><p><b>Note for media:</b></p><ul><ul><li>Official photographers only and host broadcaster only</li></ul></ul><p><b>7:15 p.m.</b> The Prime Minister and Ms. Grégoire Trudeau will attend a cultural performance.</p><p><b>Note for media:</b></p><ul><ul><li>Host broadcaster only</li></ul></ul><p><b>8:15 p.m.</b> The Prime Minister and Ms. Grégoire Trudeau will attend the G20 leaders’ dinner held by President of Argentina Mauricio Macri.</p><p><b>Note for media:</b></p><ul><ul><li>Host broadcaster only</li></ul></ul></div>\n      "
}