{
  "path": "/en/news/statements/2021/02/19/g7-leaders-statement",
  "pageTitle": "G7 Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the leaders of the Group of Seven, met today and resolved to work together to beat COVID-19 and build back better. Drawing on our strengths and values as democratic, open economies and societies, we will work together and with others to make 2021 a turning point for multilateralism and to shape a recovery that promotes the health and prosperity of our people and planet.</p>\n\n<p>We will intensify cooperation on the health response to COVID-19.&nbsp;The dedication of essential workers everywhere represents the best of humanity, while the rapid discovery of vaccines shows the power of human ingenuity. Working with, and together to strengthen, the World Health Organisation (WHO), and supporting its leading and coordinating role, we will: accelerate global vaccine development and deployment; work with industry to increase manufacturing capacity, including through voluntary licensing; improve information sharing, such as on sequencing new variants; and, promote transparent and responsible practices, and vaccine confidence. We reaffirm our support for all pillars of the Access to COVID-19 Tools Accelerator (ACT-A), its COVAX facility, and affordable and equitable access to vaccines, therapeutics and diagnostics, reflecting the role of extensive immunisation as a global public good. Today, with increased financial commitments of $4 billion USD to ACT-A and COVAX, collective G7 support totals $7.5 billion. We invite all partners, including the G20 and International Financial Institutions, to join us in increasing support to ACT-A, including to increase developing countries’ access to WHO-approved vaccines through the COVAX facility.</p>\n\n<p>COVID-19 shows that the world needs stronger defences against future risks to global health security. We will work with the WHO, G20 and others, especially through the Global Health Summit in Rome, to bolster global health and health security architecture for pandemic preparedness, including through health financing and rapid response mechanisms, by strengthening the “One Health” approach and Universal Health Coverage, and exploring the potential value of a global health treaty.</p>\n\n<p>We have provided unprecedented support for our economies over the past year totalling over $6 trillion across the G7. We will continue to support our economies to protect jobs and support a strong, sustainable, balanced and inclusive recovery. We reaffirm our support to the most vulnerable countries, our commitment to the Sustainable Development Goals, and our partnership with Africa, including to support a resilient recovery. We will work through the G20 and with the International Financial Institutions to strengthen support for countries’ responses by exploring all available tools, including through full and transparent implementation of the Debt Service Suspension Initiative and the Common Framework.</p>\n\n<p>Recovery from COVID-19 must build back better for all. Looking to UNFCCC COP26 and CBD COP15, we will put our global ambitions on climate change and the reversal of biodiversity loss at the centre of our plans. We will make progress on mitigation, adaptation and finance in accordance with the Paris Agreement and deliver a green transformation and clean energy transitions that cut emissions and create good jobs on a path to net zero no later than 2050. We are committed to levelling up our economies so that no geographic region or person, irrespective of gender or ethnicity, is left behind. We will: champion open economies and societies; promote global economic resilience; harness the digital economy with data free flow with trust; cooperate on a modernised, freer and fairer rules-based multilateral trading system that reflects our values and delivers balanced growth with a reformed World Trade Organisation at its centre; and, strive to reach a consensus-based solution on international taxation by mid-2021 within the framework of the OECD. With the aim of supporting a fair and mutually beneficial global economic system for all people, we will engage with others, especially G20 countries including large economies such as China. As Leaders, we will consult with each other on collective approaches to address non-market oriented policies and practices, and we will cooperate with others to address important global issues that impact all countries.</p>\n\n<p>We resolve to agree concrete action on these priorities at the G7 Summit in the United Kingdom in June, and we support the commitment of Japan to hold the Olympic and Paralympic Games Tokyo 2020 in a safe and secure manner this summer as a symbol of global unity in overcoming COVID-19.</p>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2021/02/19/prime-minister-concludes-productive-g7-leaders-meeting\">Prime Minister concludes productive G7 Leaders’ meeting</a></li>\n</ul></div>\n      "
}