{
  "path": "/en/news/readouts/2023/04/13/prime-minister-justin-trudeau-meets-mayor-winnipeg-scott-gillingham",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Winnipeg Scott Gillingham | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Mayor of Winnipeg, Scott Gillingham, to discuss shared priorities, including issues related to infrastructure, trade corridors, public safety, and housing.</p>\n\n<p>The Prime Minister and the Mayor discussed key infrastructure priorities such as improving trade and transportation corridors for the benefit of the people and the economy of Winnipeg, Manitoba, and all of Canada; creating good middle-class jobs; and making life more affordable for people.</p>\n\n<p>The two leaders discussed safety in downtown Winnipeg, the importance of addressing the root causes of violent crime, and the city’s community safety plan. They also spoke of the importance of addressing homelessness and promoting initiatives to increase public safety across the city.</p>\n\n<p>The Prime Minister and the Mayor agreed that collaboration between all orders of government is needed to build more affordable housing. They discussed federal investments under the Housing Accelerator Fund that will provide funding for local governments to fast track the creation of 100,000 new homes across Canada.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Mayor Gillingham agreed to continue working together on these priority issues for Winnipeg.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"/en/news/news-releases/2023/04/12/building-clean-economy-with-good-middle-class-jobs\">Building a clean economy with good middle-class jobs</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2023/03/minister-of-transport-announces-funding-to-improve-intermodal-connectivity-in-the-winnipeg-metropolitan-region.html\">Minister of Transport announces funding to improve intermodal connectivity in the Winnipeg Metropolitan Region</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/03/17/building-more-homes-faster\">Building more homes, faster</a></li>\n</ul></div>\n      "
}