{
  "path": "/en/news/statements/2021/02/06/statement-prime-minister-international-day-zero-tolerance-female-genital",
  "pageTitle": "Statement by the Prime Minister on International Day of Zero Tolerance for Female Genital Mutilation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Zero Tolerance for Female Genital Mutilation:</p>\n\n<p>“Today, on the International Day of Zero Tolerance for Female Genital Mutilation, Canadians and people around the world recognize the need to bring an end to this horrible practice that has had devastating impacts on the lives of over 200 million women and girls worldwide.</p>\n\n<p>“Female genital mutilation/cutting (FGM/C) is a grave human rights abuse that causes severe impacts on women and girls’ physical and mental health. To date, approximately 60&nbsp;countries around the world have laws against FGM/C. In Canada, anyone who helps in the practice can be criminally charged, including those who take a child out of the country for the procedure.</p>\n\n<p>“Canada has played an active role in international efforts to eliminate harmful practices like FGM/C, including through the adoption of the United Nations’ <a href=\"https://www.un.org/sustainabledevelopment/\">2030 Agenda for Sustainable Development</a>. Protecting women’s rights as human rights and the empowerment of women and girls are at the heart of the Government of Canada’s <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>. In June 2019, we committed to reach an average of $1.4 billion in annual funding by 2023 to support women’s, children’s and adolescents’ health around the world. This funding will include $700 million per year specifically dedicated to sexual and reproductive health and rights, including sexual and gender-based violence.</p>\n\n<p>“We know that ending the practice will require collective action by governments and affected communities. That is why we are working collaboratively with women advocates and religious leaders around the world to help change social attitudes, and to ensure the empowerment of women and girls, including agency and control over their bodies and sexuality. Canada is providing $10 million over four years to UNICEF to reduce FGM/C in Ethiopia. The project equips adolescent girls with resources and skills to voice their opinions and denounce violence. It also engages with community members, including social and law enforcement workers, as well as political, cultural and religious leaders to prevent FGM/C. The initiative will also train health professionals to provide quality prevention and health services for survivors and girls at risk.</p>\n\n<p>“Here at home, we can help address the issue by improving data collection. We can also offer information and training to health service providers to identify those at risk and to assist survivors through culturally sensitive social support, and health and psychological services.</p>\n\n<p>“If you are in Canada and you believe you or someone you know are at risk of undergoing FGM/C, please seek assistance through your local police or child protective services. If you or the person at risk is a Canadian citizen abroad, please contact the nearest Canadian embassy or consulate, call 1-613-996-8885 or email <a href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a>.</p>\n\n<p>“It is only by working cooperatively and by investing in women and girls’ health that we can protect and promote their sexual and reproductive health rights. We all benefit when women and girls are safe to live their lives without fear of physical or psychological harm simply because of their sex or gender. Together with our international partners, we must end FGM/C and build a better, more equal and safer world in which everyone’s human rights are respected.”</p></div>\n      "
}