{
  "path": "/en/news/statements/2020/10/17/statement-prime-minister-international-day-eradication-poverty",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Eradication of Poverty | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Eradication of Poverty:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/events/povertyday/\">International Day for the Eradication of Poverty</a>, we reflect on the progress we have made – and the work that remains – to end poverty here in Canada and around the world.</p>\n\n<p>“Everyone deserves a real and fair chance to succeed, and that is why the <a href=\"https://www.canada.ca/en/employment-social-development/programs/poverty-reduction.html\">Poverty Reduction Strategy is a core priority</a> for the Government of Canada. Since 2015, we’ve introduced the Canada Child Benefit (CCB) to help families with the cost of raising children, increased the Guaranteed Income Supplement (GIS) to support the lowest income single seniors, and cut taxes to help people make ends meet. We’ve also helped more than one million families find a safe and affordable place to call home, through investments of more than $20 billion in housing. Through these and many other actions, we were able to help lift more than one million Canadians out of poverty between 2015 and 2018. But we know that we have to do more.</p>\n\n<p>“The global COVID-19 pandemic’s economic impacts have put this progress at risk everywhere. Worldwide, the equivalent of 500 million jobs have been lost and up to 150 million people could fall into extreme poverty. By the end of 2020, an estimated 265 million more people could face acute food shortages. In Canada, the health and economic impacts of the pandemic have placed the heaviest burden on those who were already struggling.</p>\n\n<p>“We’ve always believed in investing in Canadians to help provide a better quality of life, and that is the path that we continue to take through this crisis. Our government has been unwavering in its commitment to provide supports that will help Canadians weather this pandemic, and we will continue to do so – whatever it takes, as long as it lasts. We ensured that close to 9 million Canadians could continue to pay their bills with the Canada Emergency Response Benefit, and protected over 3.7 million jobs with the Canada Emergency Wage Subsidy (CEWS). For seniors faced with increasing costs, we introduced measures like one-time, tax-free payments to those eligible for the Old Age Security program and the GIS. We created the Emergency Community Support Fund to provide funding to organizations that help Canadians most in need. We also established a one-time payment to persons with disabilities to further help them during this crisis, and continued to help families with a one-time special CCB payment in May. And we are committed to expanding our supports to Canadians as we continue to deal with the pandemic, including by creating <a href=\"https://canada.ca/coronavirus\">three new Recovery Benefits</a> so Canadians can pay their bills, and extending the CEWS to help save more jobs.</p>\n\n<p>“The well-being of all Canadians is a key measure of our success. As we build back better, the government will continue to make substantial investments in areas like housing to make sure that everyone has a safe and affordable place to call home. We will also continue to work with partners – including directly with First Nations, Inuit, and Métis Nation partners – to address food insecurity and strengthen local food supply chains, so everyone can put nutritious food on their table.</p>\n\n<p>“While we act on these priorities at home, the Government of Canada is also doing its part to end poverty around the world, including through our support for achieving the Sustainable Development Goals. Last month, <a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/prime-minister-co-chairs-high-level-meeting-address-economic\">we announced an additional $400 million in international development funding in 2020</a>, and we have committed to increasing investments in international assistance going forward. This new funding will address short-term humanitarian development needs caused by the pandemic and other crises, and help support developing countries’ recovery and resilience – because we know that we can’t end the pandemic in Canada without ending it everywhere. The funding will also help preserve hard-won development gains that have lifted millions of people out of poverty these past decades.</p>\n\n<p>“Our generation is at a crossroads, and we cannot move forward unless we all pull together. By making life more affordable and helping those who need it the most, we are building a stronger and more resilient Canada for everyone and laying the foundations of a better world.”</p></div>\n      "
}