{
  "path": "/en/news/news-releases/2018/11/22/more-affordable-housing-families-calgary",
  "pageTitle": "More affordable housing for families in Calgary | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian should have a safe and affordable place to live where they can build a better future for themselves and their families. That is why the Government of Canada unveiled Canada’s very first National Housing Strategy – a once-in-a-generation $40 billion investment to fight homelessness and support access to affordable housing across Canada.</p><p>The Prime Minister, Justin Trudeau, today announced that, as part of the National Housing Strategy, the Government will invest $31 million to build state-of-the-art, affordable, and accessible rental apartments for middle class families in Calgary’s city centre.</p><p>The new high-rise building – to be built by the Kanas Corporation – will include 121 rental housing units conveniently located near schools, public transit, and public services, including Glenmore Park and Rockyview General Hospital.</p><p>Almost all of the units will meet the City of Calgary’s affordability guidelines, with rental rates that will remain affordable for the next ten&nbsp;years. The building will also be energy-efficient, using energy storage and green energy sources such as wind, solar, and battery power, to help protect the environment and save families even more money.</p><p>The Government of Canada will continue to help build affordable homes that meet the needs of families across the country, to make sure every hardworking Canadian has a fair and equal chance at success.</p><h2>Quote</h2><blockquote><p>“Everyone deserves a safe and affordable place to call home. Today’s announcement will lead to over 120 new, affordable, and accessible apartments for families in Calgary’s city centre. This new building will provide people with housing where kids can learn and grow, and where families have the stability and opportunities they need to thrive in their community.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Approximately 30&nbsp;per&nbsp;cent of Canadians live in rental units.</li><li>The innovative design of this 15-storey building will achieve energy savings of 57&nbsp;per&nbsp;cent and a 100&nbsp;per&nbsp;cent reduction in greenhouse gas emissions below the requirements of the National Energy Code of Canada for Buildings 2015.</li><li>The Government of Canada is contributing a total of $31 million to the project through the Canada Mortgage and Housing Corporation’s Rental Construction Financing initiative (RCFi) and the Affordable Housing Innovation Fund.</li><li>The RCFi is a National Housing Strategy initiative that supports construction projects that provide a stable supply of affordable rental housing across the country.</li><li>In Budget 2018, the Government of Canada increased the amount for low-cost loans provided by the RCFi from $2.5&nbsp;billion to $3.75 billion for the next three years. The initiative will help build more than 14,000&nbsp;new rental-housing units across Canada.</li><li>In 2017, the Government of Canada announced a 10-year, $40 billion National Housing Strategy that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. This Strategy is part of a long-term vision to strengthen the middle class and provide affordable housing to Canadians, and lift more Canadians out of poverty. The strategy sets clear goals to remove 530,000 Canadians from housing need and reduce chronic homelessness.</li><li>The Affordable Housing Innovation Fund is providing $200 million over five years for projects that showcase new funding models and innovative building techniques. This funding will help lower the costs and risks of financing affordable housing projects and make the affordable housing sector more attractive for private market developers and investors. It will also create up to 4,000&nbsp;new affordable housing units, reducing the number of Canadians living in housing need.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.cmhc-schl.gc.ca/\">Canada Mortgage and Housing Corporation</a></li><li><a href=\"https://www.placetocallhome.ca/\">Canada’s National Housing Strategy</a></li><li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy initiatives</a></li></ul></div>\n      "
}