{
  "path": "/en/news/news-releases/2016/09/03/prime-minister-trudeau-and-jack-ma-chairman-alibaba-group-announce",
  "pageTitle": "Prime Minister Trudeau and Jack Ma, Chairman of the Alibaba Group, announce initiatives to strengthen Canadian business presence on world’s largest e-commerce platform | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to represent Canada to the world as a strong and valuable trading partner, that is open for investment and business, in order to increase trade, spur international investment, and grow Canada’s middle class. This means encouraging Canadian companies – especially small and medium-sized enterprises – to be more engaged in the Chinese economy.</p>\n<p>The Prime Minister, Justin Trudeau, and Alibaba Group Executive Chairman Jack Ma today announced a number of initiatives that will help Canadian companies connect with Alibaba’s 400 million consumers. First, they launched the “Canada Pavilion” on Alibaba’s online shopping site, which will help brand Canadian products and services.</p>\n<p>Additionally, the Prime Minister witnessed the signing of a joint declaration of cooperation by Minister of International Trade Chrystia Freeland and Michael Evans, Director and President of Alibaba Group, that will strengthen trade promotion cooperation between the Canadian Trade Commissioner Service and Alibaba Group.</p>\n<p>During their discussions, the Prime Minister and Mr. Ma agreed to further support collaboration in several areas, including facilitating the growth of tourism through the use of AliTrip and AliPay services.</p>\n<p>A cooperation agreement was signed between Air Canada and Alibaba’s Alitrip to work jointly to expand the travel market between China and Canada.</p>\n<p>Finally, the two also committed to look into establishing a representative and commercial presence of Alibaba in Canada – which would create new export opportunities for Canadian small and medium-sized enterprises and other partners, and support the Canadian middle class.</p>\n<p>While in Hangzhou, the Prime Minister and Minister Freeland had an opportunity to tour the Alibaba Xixi campus with over 30 Canadian companies present.</p>\n<p>Today’s announcements highlight the importance of building relationships with international partners over time that result in new jobs for middle class Canadians.</p>\n<p>Moving forward, the Prime Minister will continue to strengthen relationships with individuals – and companies – around the world in order to ensure that middle class Canadians have the greatest chance to succeed.&nbsp;&nbsp;</p>\n<p><strong>Quotes</strong></p>\n<p>“China presents a large and growing market for Canadian businesses. That is why we’re increasing our commercial presence in the Chinese market, and encouraging our small and medium-sized enterprises to tap into the enormous opportunities there. I will continue to promote Canada abroad, draw in international investment, highlight Canadian products around the world, and increase opportunities for our middle class.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Today is a very good day for Canadian businesses. They now have a permanent e-home on the world’s biggest online shopping site – Alibaba – and with it, the ability to reach over 400 million Chinese consumers. There is significant potential for further business development with Alibaba, which would help encourage Chinese tourism to Canada, create jobs at home, and strengthen our middle class.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>\"Increasing cooperation with Alibaba will support our small and medium-sized enterprises as they tap into the Chinese market. China is our second-largest trading partner, and we know that taking advantage of e-commerce will lead to greater middle class prosperity at home.\"<br>—<em>The</em>&nbsp;<em>Honourable Chrystia Freeland, Minister of International Trade</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Prime Minister first met Mr. Ma during the World Economic Forum in Davos, Switzerland, in January 2016, where the two discussed the value of e-commerce to the success of small and medium-sized enterprises.</li>\n<li>The Alibaba Group includes a number of business lines, most notably e-commerce giants Tmall and Taobao Marketplace, which together held a nearly 80 per cent share of China’s US$600 billion e-commerce market in 2015.</li>\n<li>Alibaba has more than 400 million online consumers in China.</li>\n<li>A Memorandum of Understanding was signed between Air Canada and Alitrip to open a direct flagship store on the Alitrip platform, to work together to develop marketing initiatives, and to carry out joint marketing promotions with Air Canada, utilizing Alitrip’s data resources.</li>\n</ul>\n<p><strong><br>Associated Link</strong></p>\n<ul>\n<li><a href=\"https://canada.tmall.com\">Alibaba Canada Pavilion</a></li>\n</ul></div>\n      "
}