{
  "path": "/en/news/news-releases/2023/03/15/10-day-child-care-now-reality-families-newfoundland-and-labrador",
  "pageTitle": "$10-a-day child care now a reality for families in Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Families across Canada know that affordable child care is not a luxury ‒ it is a necessity. With global inflation driving up the cost of living and making it harder for families to make ends meet, the Government of Canada has been working with provinces and territories to deliver on our promise of $10-a-day child care – putting more money back in the pockets of Canadian families, driving economic growth that benefits everyone, and giving children the best possible start in life.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Newfoundland and Labrador, Andrew Furey, today announced that Newfoundland and Labrador families are now benefitting from $10-a-day regulated child care – three years ahead of the national target. With $10-a-day child care, families are now saving an estimated $6,300 per year for each child in care.</p>\n\n<p>Newfoundland and Labrador also announced the opening of the first pre-kindergarten centres in the province. Supported by federal funding, these pre-kindergarten centres will allow more children and families across the province to access high-quality, affordable, flexible, and inclusive early learning and child care.</p>\n\n<p>This announcement comes less than two years after the governments of Canada and Newfoundland and Labrador reached an agreement to support an average of $10-a-day regulated child care in the province. Already, families in nearly half of Canada’s provinces and territories are benefitting from regulated early learning and child care at an average of $10-a-day or less, and fees have been cut by at least 50 per cent in all other jurisdictions, with work on track to deliver $10-a-day regulated child care on average by March&nbsp;2026.</p>\n\n<p>Delivering $10-a-day regulated child care across the country is a key part of the federal government’s plan to make life more affordable for Canadians. It builds on a wide range of other support programs, including the Canada Child Benefit, which puts more money into the pockets of nine out of 10 Canadian families with children and has helped lift hundreds of thousands of children out of poverty. We will continue to put Canadian families at the heart of everything we do, as we make life more affordable, create good jobs, and grow the economy to benefit all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Reaching $10-a-day child care is a huge milestone achievement for families in Newfoundland and Labrador. It means hundreds of dollars per child back in the pockets of hard-working families every month, it means more jobs in early learning and child care, it means a stronger economy for Newfoundland and Labrador, and it means we’re giving every child the best possible start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement is a major achievement in our governments’ shared vision to make high-quality child care more affordable and accessible for families. This is a great example of what can be achieved when we share a commitment to improving the lives of Canadians. I am deeply proud of this achievement, and I look forward to the day that families across the country can enjoy the benefits families in Newfoundland and Labrador now enjoy today.”</p>\n\n<footer class=\"default\">The Hon. Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Affordable child care helps families and provides more opportunities for parents to take part in the workforce, so I implemented $25-a-day child care within months of becoming Premier. Now our government is proud to remain a leader as one of the first jurisdictions in this country to offer $10-a-day child care, and we continue our efforts to create more spaces as we build a bright future for Newfoundlanders and Labradorians.”</p>\n\n<footer class=\"default\">The Hon. Andrew Furey, Premier of Newfoundland and Labrador</footer>\n</blockquote>\n\n<blockquote>\n<p>“We have made great strides in reducing the cost of child care in our province and we remain focused on meeting the demand, through measures such as increased wages for early childhood educators. Increasing accessibility to affordable child care allows more parents into the workplace and ensures children receive quality early learning, improving the quality of life for families.”</p>\n\n<footer class=\"default\">The Hon. John Haggie, Newfoundland and Labrador’s Minister of Education</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In July 2021, Canada and Newfoundland and Labrador announced an <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">agreement</a> to significantly improve early learning and child care for all children in the province, with the Government of Canada contributing over $306&nbsp;million for the early learning and child care sector in Newfoundland and Labrador over five years.</li>\n\t<li>Additionally, over $41&nbsp;million was announced in July 2021 through the <a href=\"https://www.canada.ca/en/early-learning-child-care-agreement/agreements-provinces-territories/newfoundland-labrador-2021.html\">Canada-Newfoundland and Labrador Early Learning and Child Care Agreement&nbsp;- 2021 to 2025</a>, including $6.5&nbsp;million through a one-time investment in 2021-22 to support the early childhood workforce.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada already helped create close to 1,200 more affordable child care spaces in Newfoundland and Labrador – and over 40,000 across the country – prior to the pandemic.</li>\n\t<li>As part of Budget&nbsp;2021, the Government of Canada made a transformative investment of more than $27&nbsp;billion over five years to build a Canada-wide early learning and child care system with provinces and territories. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Delivering a high-quality, inclusive, and affordable Canada-wide early learning and child care system is good for families and the economy. TD Economics has pointed to a range of studies that have shown that for every dollar spent on early childhood education, the broader economy receives between $1.50 and $2.80 in return. And in Quebec, affordable child care alone has raised the province’s GDP by 1.7 per cent.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Budget&nbsp;2021: A Canada-wide Early Learning and Child Care Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/campaigns/child-care.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_Canada.ca/child-care\">Toward $10-a-Day: Early Learning and Child Care</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">$10 a day child care for families in Newfoundland and Labrador</a></li>\n</ul></div>\n      "
}