{
  "path": "/en/news/readouts/2021/11/17/prime-minister-justin-trudeau-asks-minister-blair-convene-incident",
  "pageTitle": "Prime Minister Justin Trudeau asks Minister Blair to convene the Incident Response Group to discuss floods and extreme weather in British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>While in Washington, D.C. today ahead of the North American Leaders’ Summit, Prime Minister Justin Trudeau spoke with the President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness, Bill Blair, about the extreme weather conditions in British Columbia. They discussed the urgent request from the province for assistance from the Government of Canada.</p>\n\n<p>At the request of the Prime Minister and on his behalf, Minister Blair convened the Incident Response Group (IRG) to discuss the floods, landslides, and extreme weather conditions caused by climate change that are affecting thousands of people in British Columbia.</p>\n\n<p>Minister Blair updated the IRG Ministers on the situation in the province, noting that he has been in very close contact with provincial counterparts. He indicated that the floods are affecting numerous communities across British Columbia, including Indigenous communities, and that the emergency response is complex and requires cooperation across all levels of government. He noted that British Columbia Premier John Horgan has now declared a state of emergency in the province. Minister Blair thanked all first responders, the officials at Environment Canada who have been actively engaged with the province, Canadian Armed Forces members, search and rescue volunteers, and emergency managers who are working hard to keep people safe during this time. He affirmed the Prime Minister’s commitment to being there for the people of British Columbia, including those in remote communities and Indigenous communities who are being significantly affected by this devastation.</p>\n\n<p>Minister Blair confirmed that the Government of Canada has approved a Request for Federal Assistance from British Columbia. Minister of National Defence Anita Anand indicated that this is the top priority for the Canadian Armed Forces. The Minister gave an overview of the transportation, humanitarian, and supply assistance that the Canadian Armed Forces will provide to support individuals, communities, and critical infrastructure affected by the floods, landslides, and extreme weather conditions, particularly in the hard-hit southwest and central areas of the province. This assistance will include air support to evacuate people affected by the floods and to reach important supply routes disrupted by the floods; help to vulnerable, stranded, or in-distress people; and personnel to mitigate the effects of the floods, which includes the protection of critical infrastructure, access roads, and properties. Minister Anand indicated that members of the Canadian Armed Forces are already on their way to British Columbia, to conduct reconnaissance and coordination efforts, and that more will be deployed in the coming days, based on the province’s needs.</p>\n\n<p>Minister of Public Safety Marco E. L. Mendicino noted that the Royal Canadian Mounted Police is monitoring and coordinating support in affected communities, and that police services continue to be provided in evacuated areas, neighbouring communities, and across the province.</p>\n\n<p>Minister of Transport Omar Alghabra provided an overview of the work being done with the province to help the port, terminal, railway, and trucking sectors address the impacts of the floods, and support those who are displaced or being evacuated as a result of the landslides. He noted that significant efforts are underway to ensure the movement of essential goods, including food and other critical supplies.</p>\n\n<p>Minister of Indigenous Services Patty Hajdu underlined the government’s commitment to work with First Nations leadership, the First Nations Health Authority, and emergency management partners to ensure First Nations have the information and resources they need to keep their communities safe.</p>\n\n<p>Minister of Agriculture and Agri-Food Marie-Claude Bibeau also highlighted the critical significance of this event on animal welfare, farms, aquaculture, and food producers in the area. She committed to supporting the province in this difficult time.</p>\n\n<p>Minister of Health Jean-Yves Duclos committed that the Public Health Agency of Canada would fully support its provincial Health counterparts, who have already been so heavily affected not only by the COVID-19 response, but also the response to the recent wildfires.</p>\n\n<p>Finally, Minister of Fisheries, Oceans and the Canadian Coast Guard Joyce Murray, who is from British Columbia, expressed her thanks to her colleagues and offered the resources from her department in responding to the situation.</p>\n\n<p>All ministers in attendance reiterated that the federal government stands ready to help all provinces and territories when support is requested. They agreed on the need to continue working closely with the province of British Columbia, Indigenous communities, and other partners on the response and recovery efforts. They committed to continuing to prioritize federal action on climate change to mitigate the impacts of extreme weather conditions, and protect the health and safety of communities across Canada.</p>\n\n<h2>Associated link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/16/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan\">Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan</a></li>\n</ul></div>\n      "
}