{
  "path": "/en/news/news-releases/2023/01/05/prime-minister-japan-kishida-fumio-visit-canada",
  "pageTitle": "Prime Minister of Japan Kishida Fumio to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Prime Minister of Japan, Kishida Fumio, will visit Ottawa on January 12, 2023. This will be Prime Minister Kishida’s first bilateral visit to Canada since he assumed office in October 2021.</p>\n\n<p>Prime Minister Trudeau will meet with Prime Minister Kishida to discuss Japan’s priorities for its upcoming G7 Presidency. They will also continue to cooperate on Canada and Japan's shared values, including our vision for a free and open Indo-Pacific and further strengthening bilateral trade, investment, and innovation to grow our economies and benefit people in both countries.</p>\n\n<p>Canada and Japan are key partners, globally and in the Indo-Pacific region. During their time together, the two leaders will continue to work closely to grow our economies, create good jobs in both countries, and improve regional security, including through Canada's recently announced Indo-Pacific Strategy and Japan's National Security Strategy. These discussions will explore ways Canada and Japan can implement joint priorities across a range of issues, from free trade, to energy security, to peacekeeping and peacebuilding.</p>\n\n<p>The leaders will also discuss Russia’s illegal and unjustifiable invasion of Ukraine, and continue working together to support the Ukrainian government and people.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Japan share a close friendship rooted in decades of cooperation, shared values, and deep ties between our people. We both benefit from a strong trade, innovation, and investment relationship bolstered by the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, which has been helping businesses and workers in both our countries succeed since 2018. I look forward to welcoming Prime Minister Kishida to Canada and working even more closely together to deliver results for people in Canada and Japan.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Japan has assumed its Presidency of the G7 in 2023.</li>\n\t<li>Japan is the world’s third-largest national economy, one of Canada’s most important economic and commercial partners, and Canada’s largest source of bilateral foreign direct investment in Asia.</li>\n\t<li>In 2021, Canada’s exports of merchandise to Japan totalled $14.5 billion, while imports from Japan were $15.5 billion. Agricultural products, energy, minerals, and forest products are among Canada’s largest exports to Japan.</li>\n\t<li>Canada and Japan have a long history of diplomatic relations dating back to 1928, when Japan opened a diplomatic mission in Ottawa. Canada inaugurated its diplomatic mission to Japan in Tokyo on May 21, 1929, formalizing our full bilateral diplomatic relations.</li>\n\t<li>Canada’s Indo-Pacific Strategy will advance and defend Canada’s interests by supporting a more secure, prosperous, inclusive, and sustainable region while protecting Canada’s national and economic security at home and abroad.</li>\n\t<li>In May 2021, the Foreign Ministers of Canada and Japan agreed on six shared priorities contributing to a free and open Indo-Pacific region. These include the rule of law; peacekeeping operations, peacebuilding, and humanitarian assistance and disaster relief; energy security; health security and responding to COVID-19; free trade promotion and trade agreement implementation; and the environment and climate change. Implementation of the six shared priorities is being pursued in accordance with a detailed <a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-japan-action-plan-for-contributing-to-a-free-and-open-indo-pacific-region.html\">Action Plan</a> announced in October 2022.</li>\n\t<li>The Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) eliminates or reduces tariffs on most key Canadian exports to Japan, including for agriculture and agri-food, seafood, forestry, and metals and mineral products. The CPTPP is a demonstration of Canada and Japan’s shared commitment to furthering the principles of an effective, open, inclusive, and rules-based trading system.</li>\n\t<li>There are over 99,000 people of Japanese origin residing in Canada (according to the 2021 Census) and prior to the COVID-19 pandemic, approximately 600,000 Japanese and Canadians travelled to each other’s country annually.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/japan-japon/relations.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/indo-pacific-indo-pacifique/index.aspx?lang=eng\">Canada’s Indo-Pacific Strategy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}