{
  "path": "/en/news/news-releases/2020/02/10/prime-minister-concludes-productive-visit-ethiopia-promote",
  "pageTitle": "Prime Minister concludes productive visit to Ethiopia to promote partnerships | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Ethiopia. Africa’s young and fast-growing population, coupled with its rapid economic growth and focus on climate action, makes countries in the region natural partners for Canada. &nbsp;</p>\n\n<p>The visit focused on how Canada, Ethiopia, and African countries can partner in our shared commitment to democracy, women’s empowerment and gender equality, fighting climate change, and economic growth that benefits everyone. &nbsp;</p>\n\n<p>While meeting with Ethiopian Prime Minister Abiy Ahmed and President Sahle-Work Zewde, Prime Minister Trudeau discussed how the two governments can work more closely together to advance democracy and gender equality, find innovative solutions to climate change, and increase trade and investment between our two countries. Canada believes that advancing these shared priorities helps both countries and regions grow.</p>\n\n<p>To strengthen our economic partnerships, the Prime Minister was joined by a Canadian trade delegation and the Minister of Small Business, Export Promotion and International Trade, Mary Ng. Prime Minister Trudeau and Minister Ng committed to growing trade and investment for businesses in both countries and developing better access to each other’s markets. The Prime Minister was also joined by Masai Ujiri, who has helped advance Canada’s interests on the continent through his longstanding relationships in Africa and his work to empower youth, by promoting sport with his organization Giants of Africa.</p>\n\n<p>In addition to making important investments to fight climate change and promote gender equality, Canada will provide funding for the National Electoral Board of Ethiopia to empower voters and candidates, and strengthen democracy. Canada also welcomed Ethiopia as a member of Canada’s Military Training Cooperation Program, which delivers military training to member countries and helps build their security capacity.</p>\n\n<p>The visit to Ethiopia coincided with the 33rd African Union (AU) Summit. As the first Canadian Prime Minister to attend AU Summit events, Prime Minister Trudeau met with other world leaders to explore how Canada can help advance their common vision for a more integrated, prosperous, and peaceful continent. This work is particularly meaningful to Canada as Chair of the United Nations Peacebuilding Commission in 2020.</p>\n\n<p>During these events, Prime Minister Trudeau announced support for the African Union Commissions’ efforts to advance gender equality. Through investments, Canada will help increase economic opportunities and address barriers for 150,000 women in East Africa. Other investments will help provide leadership training to 200 youth leaders and support for entrepreneurs and small and medium-sized businesses in Ethiopia, with a focus on those owned by young people and women. When women around the world succeed, so does our global economy. &nbsp;</p>\n\n<p>The Prime Minister attended events focused on how empowering women and girls is key to addressing many other issues, including poverty and inequality.&nbsp;He announced funding to promote sexual and reproductive health and rights of women and girls, and to combat sexual and gender-based violence.</p>\n\n<p>Prime Minister Trudeau also underlined how building an economy that works for everyone depends on our ability to adapt to and combat climate change. He announced that Canada will co-host the first ever Canada-Africa Clean Growth Symposium, in Addis Ababa, in 2021. The symposium will explore innovative ways to grow our economies while reducing emissions and building resilience to a changing climate.</p>\n\n<p>While participating on a panel about the potential of Africa’s blue economy, which focuses on using ocean resources to unlock economic growth, create jobs, and reduce poverty, the Prime Minister highlighted how Canada is working with others to build a more sustainable ocean economy, at home and abroad. This work builds on the leadership Canada demonstrated as the 2018 G7 Presidency and as co-host of the 2018&nbsp;Sustainable Blue Economy Conference&nbsp;in Kenya. Canada believes that countries need to work together to protect coasts and coastal communities, support sustainable oceans and fisheries, and clear up ocean plastic waste, to create economic growth.</p>\n\n<p>Throughout the visit, Prime Minister Trudeau positioned Canada as an important partner for Ethiopia and Africa. He demonstrated Canada’s readiness to work with the continent to address global challenges, and build a better, more secure, and more prosperous future for Canadians and Africans.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada is a natural partner for Ethiopia and other African countries. Through our shared priorities of creating economic growth, promoting peaceful democracy and gender equality, and fighting climate change, we can find innovative ways to grow businesses and create opportunity for Canadians and Africans. I look forward to continuing to work together as we tackle global challenges and create a path forward for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the visit, Prime Minister Trudeau met with:\n\t<ul>\n\t\t<li>African Union Commission Chairperson Moussa Faki Mahamat</li>\n\t\t<li>Prime Minister of Ethiopia Abiy Ahmed</li>\n\t\t<li>President of Ethiopia Sahle-Work Zewde</li>\n\t\t<li>President of Rwanda Paul Kagame</li>\n\t\t<li>President of Egypt Abdel Fattah el-Sisi</li>\n\t\t<li>President of Cabo Verde Jorge Carlos Fonseca</li>\n\t\t<li>President of Nigeria Muhammadu Buhari</li>\n\t\t<li>Prime Minister of Mauritius Pravind Jugnauth</li>\n\t\t<li>President of Madagascar Andry Rajoelina</li>\n\t\t<li>President of Somalia Mohamed Abdullahi Mohamed</li>\n\t\t<li>President of Botswana Mokgweetsi Masisi</li>\n\t\t<li>President of Burkina Faso Roch Marc Christian Kaboré</li>\n\t</ul>\n\t</li>\n\t<li>Canada established diplomatic relations with Ethiopia in 1965, and our two countries share goals based on regional security interests, growing commercial ties, and social, economic, and political development.</li>\n\t<li>Merchandise trade between Canada and Ethiopia totalled over $170 million in 2018. Canadian companies are currently active in Ethiopia in the aerospace, energy, information/communication technology, agriculture, and mining sectors.</li>\n\t<li>The African Union is a multilateral organization that promotes peace and security, socio-economic development, governance, climate change, and continental integration. Canada is accredited as a permanent observer to the African Union.</li>\n\t<li>The African Union is led by its Assembly, which includes African Heads of States and Governments who meet annually at the Summit to develop, negotiate, and adopt common positions on key continental issues and priorities.</li>\n\t<li>In 2018, Canada, Kenya, and Japan co-hosted the first-ever global conference on the sustainable blue economy, aimed at furthering the international community’s support of the United Nations’ 2030 Agenda for Sustainable Development.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/02/10/canada-working-partners-africa-advance-shared-priorities\">Canada working with partners in Africa to advance shared priorities</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/au.aspx?lang=eng\">Canada and the African Union</a></li>\n</ul></div>\n      "
}