{
  "path": "/en/news/readouts/2022/11/22/prime-minister-justin-trudeau-meets-president-estonia-alar-karis",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Estonia Alar Karis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Estonia, Alar Karis, to discuss regional security and bilateral cooperation.</p>\n\n<p>The leaders discussed ways to continue to support Ukraine and to increase costs on Russia for its unjustifiable aggression. They reaffirmed their commitment to stand by Ukraine for as long as needed.</p>\n\n<p>The Prime Minister reiterated Canada’s commitment to security in Eastern Europe, including through membership in the NATO&nbsp;Cooperative Cyber&nbsp;Defence Centre of Excellence, based in Tallinn, and leadership of NATO’s enhanced Forward Presence&nbsp;Battle Group in&nbsp;Latvia.</p>\n\n<p>The leaders talked about enhancing their bilateral cooperation, including by opening a full embassy with a resident ambassador in Tallinn as part of Canada’s diplomatic expansion in Central and Eastern Europe. They discussed the importance of developing resilient supply chains for critical minerals, and welcomed commercial cooperation between the two countries to create good jobs and economic growth.&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Karis looked forward to continuing to work together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/estonia-estonie/relations.aspx?lang=eng\">Canada-Estonia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/30/prime-minister-and-nato-leaders-strengthen-transatlantic-security\">Prime Minister and NATO Leaders strengthen transatlantic security</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/10/defence-minister-anita-anand-concludes-productive-visit-to-europe-for-meetings-with-allies-and-partners.html\">Defence Minister Anita Anand concludes productive visit to Europe for meetings with Allies and partners</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}