{
  "path": "/en/news/readouts/2021/04/29/prime-minister-justin-trudeau-holds-30th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 30th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the 30th call with Canada’s provincial and territorial premiers to discuss their shared response to the global COVID-19 pandemic. The Deputy Prime Minister also joined the call to provide premiers with an update on the federal budget.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 situation. Canada is currently facing an aggressive third wave, which is placing enormous pressure on health care systems and has led many jurisdictions to impose strict new public health measures. The Prime Minister reiterated his commitment to support provinces and territories in their response efforts. Premiers recognized the support being provided to Ontario, Nova Scotia, and Nunavut by the federal government and other provinces and territories to help them manage the impacts of the third wave. The Team Canada approach has been proven again to be the most effective way to manage the pandemic and keep Canadians safe.</p>\n\n<p>The Prime Minister and Deputy Prime Minister also discussed the importance of sick leave for Canadian workers and their families. They noted federally mandated sick pay introduced in 2019, as well as billions of dollars in federal investments since the outset of the pandemic in programs to support workers, such as the Canada Emergency Wage Subsidy to support pay, including sick pay, and the Canada Recovery Sickness Benefit to fill gaps across the country, particularly for gig and contract workers.</p>\n\n<p>The Deputy Prime Minister updated premiers on the federal budget, highlighting the extension of federal support programs to help Canadian workers and businesses get through the pandemic, as well as the new Canada Recovery Hiring Program. She also spoke about important new investments that will spur economic recovery, including investments to support youth employment and to assist the tourism sector, as well as measures to support long-term growth and prosperity, including investments in a green recovery and clean technologies.</p>\n\n<p>The Prime Minister provided an update on the vaccine rollout, highlighting that Canada is currently third among G20 nations in vaccination rates. He thanked premiers for their work in getting vaccines to Canadians. First Ministers also discussed the importance of ensuring that vulnerable and marginalized communities have access to, and confidence in, the vaccines, and the need to continue to work together to ensure as many Canadians as possible are vaccinated as quickly as possible. The Prime Minister noted that while case numbers are rising, the success of vaccination in reducing incidences of severe illness among seniors and Indigenous communities is very encouraging. First Ministers agreed on the importance of working together and maintaining strong public health measures to limit the impacts of the third wave.</p>\n\n<p>The Prime Minister also updated premiers on borders, including new restrictions for passengers arriving from India and Pakistan. First Ministers discussed the need for Canadians to avoid all non-essential travel, whether domestic or international. The Prime Minister raised the importance of maintaining strong border measures and First Ministers discussed ways to further strengthen these measures. The Prime Minister also highlighted the restrictions that several provinces and territories have put in place to limit interprovincial travel.</p>\n\n<p>All First Ministers firmly reiterated their commitment to a collaborative, Team Canada approach to fighting and ending the COVID-19 pandemic.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Shipments and deliveries</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/18/additional-support-ontario-fight-covid-19-outbreak\">Additional support for Ontario to fight the COVID-19 outbreak</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget 2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://travel.gc.ca/travelling/health-safety/covid-19-security?utm_campaign=covid-19-travel-security&amp;utm_source=canada&amp;utm_medium=slideshow-news-en\">COVID-19: Your safety and security outside Canada</a></li>\n</ul></div>\n      "
}