{
  "path": "/en/news/news-releases/2022/01/21/over-10000-new-affordable-homes-canadians",
  "pageTitle": "Over 10,000 new affordable homes for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves a safe and affordable place to call home. The COVID-19 pandemic has made it clearer than ever that affordable housing is key to Canada’s recovery, as we rebuild an economy that works for everyone. That is why the Government of Canada will continue to support vulnerable Canadians and address rising levels of homelessness and housing needs in communities from coast to coast to coast.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that over 10,000 new affordable housing units will be created across the country through the Rapid Housing Initiative (RHI), exceeding the initial goal of 7,500 new units. These housing units will help vulnerable Canadians and those experiencing or at risk of homelessness. A third of the units will support women or women and their children, and more than a third of the units will assist Indigenous Peoples.</p>\n\n<p>The Government of Canada’s $2.5&nbsp;billion RHI is helping vulnerable individuals and families find a safe and affordable place to call home. These investments are helping grow the middle class and those who are working hard to join it by creating thousands of good jobs in the housing and construction sector, supporting our economic recovery, and building back stronger communities, while getting us closer to our goal of eliminating chronic homelessness in Canada.</p>\n\n<p>The government will continue working with provincial, territorial, and municipal governments, Indigenous governing bodies, as well as stakeholders and organizations to quickly create more homes for people in need of housing. Together, we will make safe and affordable housing a reality for people across the country.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We know that finding a safe and affordable place to live is a challenge for many Canadians across the country. Through the Rapid Housing Initiative, we are building more housing units, increasing affordable housing, and working to end chronic homelessness. As we build a better future for everyone, we will continue working to improve access to housing, particularly for our most vulnerable, while putting home ownership back in reach for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As I’ve said many times before – everyone in Canada deserves a safe and affordable place to call home. The Rapid Housing Initiative will support those who need it most by quickly providing more than 10,000 new affordable housing units to vulnerable families. This is just one of the many ways our government’s National Housing Strategy continues to support Canadians from coast to coast to coast. Today’s results represent a historic step in our work to ensure that no Canadian is left behind.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Housing and Diversity and Inclusion and Minister responsible for Canada Mortgage and Housing Corporation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The RHI is delivered by Canada Mortgage and Housing Corporation (CMHC), under the National Housing Strategy (NHS).</li>\n\t<li>Canada’s NHS is an ambitious, 10-year plan to invest over $72&nbsp;billion to give more Canadians a place to call home. Launched in 2017, it will create up to 160,000 new homes, meet the housing needs of 530,000 families, and repair and renew more than 300,000 housing units.</li>\n\t<li>Over 10,000 new housing units will be created through the RHI from coast to coast to coast, exceeding the initial goal of 7,500 new units. Most housing units will be constructed within 12 to 18 months of an agreement being signed with funding recipients.\n\t<ul>\n\t\t<li>Of these units, 33 per cent of units will support women or women and their children, and over 41 per cent of units will support Indigenous Peoples.</li>\n\t\t<li>Funding was delivered through two main streams. The Cities Stream was allocated to pre-determined municipalities across Canada based on the number of renters in severe housing need, local market housing costs, and a regional distribution. The Projects Stream was for eligible applications from provinces, territories, municipalities, Indigenous governing bodies and organizations, and non-profit organizations.</li>\n\t</ul>\n\t</li>\n\t<li>The RHI takes a human rights-based approach to housing, serving people experiencing or at risk of homelessness and other vulnerable people under the NHS, including: women and children fleeing domestic violence, seniors, young adults, Indigenous Peoples, people with disabilities, people experiencing mental health and addiction issues, veterans, LGBTQ2 individuals, racialized groups, and recent immigrants or refugees.</li>\n\t<li>Budget&nbsp;2021 provided an additional $1.5&nbsp;billion in new funding in 2021-22 for the RHI to address the urgent housing needs of vulnerable Canadians, building on the $1&nbsp;billion announced in the 2020 <em>Fall Economic Statement</em>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rapid-housing\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/27/new-rapid-housing-initiative-create-3000-new-homes-canadians\">New Rapid Housing Initiative to create up to 3,000 new homes for Canadians</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2021/canada-provides-update-rapid-housing-initiative\">Rapid Housing Initiative will exceed targets by creating more than 4,700 new homes for Canadians</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/30/4500-more-homes-canadians\">4,500 more homes for Canadians</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rapid-housing#rhi-combined-results\">Rapid Housing Initiative breakdown by province and territory</a></li>\n</ul></div>\n      "
}