{
  "path": "/en/news/statements/2019/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p><p>“Today marks the beginning of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a>, a time to celebrate Black culture and history, and to reflect on the significant contributions Black Canadians have made to building Canada.</p><p>“As leaders, advocates, entrepreneurs, artists, members of our armed forces, and everything in between, Black Canadians have helped shape our history and our identity as a country. Whether on the global stage or here at home, they have defended the values that make us who we are – values like freedom, justice, democracy, and equality. Their work has helped transform Canada into a more inclusive, compassionate, and prosperous country for all of us.</p><p>“This year’s theme – Black Canadian Youth: Boundless, Rooted, &amp; Proud – celebrates young Black Canadians: their power, their voices, their achievements, and their future. But it also reminds us of the inequality and barriers many continue to face, from anti-black racism and discrimination to a lack of opportunity and resources. That’s unacceptable. Our diversity is our strength, and we need to do more to achieve real equality for young Canadians and everyone in our country.</p><p>“That is why we are working hard to make sure all Canadians have equal opportunities to thrive – no matter the colour of their skin or where they come from, the language they speak or the religion they practice. Last year, we launched a <a href=\"https://www.canada.ca/en/canadian-heritage/news/2018/06/the-government-of-canada-announces-new-funding-for-black-canadian-youth.html\">new funding initiative</a> to address the unique challenges faced by Black communities in Canada, including $9 million over three years for community-led projects to support the needs of Black Canadian youth. In <a href=\"https://www.budget.gc.ca/2018/docs/plan/chap-04-en.html\">Budget 2018</a>, we committed additional funding to develop new culturally informed approaches to improve mental health in Black Canadian communities. We will continue to take concrete action to combat anti-black racism and make sure Black communities across our country have the support they need to prosper.</p><p>“On behalf of the Government of Canada, I invite all Canadians to take part in community events for Black History Month and learn more about the important role that Black Canadians have played – and continue to play – to strengthen the country we all call home.”</p></div>\n      "
}