{
  "path": "/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine",
  "pageTitle": "Statement by the Prime Minister on Russia’s attack on Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement condemning Russia’s attack on Ukraine:</p>\n\n<p>“Canada condemns in the strongest possible terms Russia’s egregious attack on Ukraine. These unprovoked actions are a clear further violation of Ukraine’s sovereignty and territorial integrity. They are also in violation of Russia’s obligations under international law and the Charter of the United Nations.</p>\n\n<p>“Canada calls on Russia to immediately cease all hostile and provocative actions against Ukraine and withdraw all military and proxy forces from the country. Ukraine’s sovereignty and territorial integrity must be respected and the Ukrainian people must be free to determine their own future.</p>\n\n<p>“Russia’s actions will be met with severe consequences. Tomorrow morning, I will be meeting with G7 partners, and we will continue working closely and quickly with NATO and our allies to collectively respond to these reckless and dangerous acts, including by imposing significant sanctions in addition to those already announced.</p>\n\n<p>“In the face of these attacks on Ukraine, Canada will take additional action to stop Russia’s unwarranted aggression. We continue to stand with Ukraine, its people, and the Ukrainian Canadian community here in Canada. Russia’s brazen acts will not go unpunished.”</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/22/canada-announces-support-address-situation-ukraine\">Canada announces support to address the situation in Ukraine</a></li>\n</ul></div>\n      "
}