{
  "path": "/en/news/statements/2021/10/14/statement-prime-minister-formation-new-government-norway",
  "pageTitle": "Statement by the Prime Minister on the formation of a new government in Norway | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in Norway:</p>\n\n<p>“On behalf of the Government of Canada, I would like to congratulate Prime Minister Jonas Gahr Støre on the formation of a new government in Norway. My thoughts – and those of all Canadians – are with Prime Minister Støre and the people of Norway following yesterday’s tragic events in Kongsberg, and our country stands with you during this challenging time.</p>\n\n<p>“Canada and Norway enjoy a close relationship, rooted in decades of cooperation, strong people-to-people ties, and shared priorities, such as promoting international peace and security, advancing gender equality, and strengthening progressive trade. We work closely together on a variety of global issues, including at the United Nations, NATO, the Organization for Security and Co‑operation in Europe, and the World Trade Organization.</p>\n\n<p>“I look forward to working with Prime Minister Støre on issues that are important to both of our countries, from supporting COVID‑19 recovery efforts, to promoting democracy and human rights, and ensuring international peace and security. As partners in the Arctic Council and the High Level Panel for a Sustainable Ocean Economy, Canada and Norway will continue to work together to fight climate change, protect the environment, and promote sustainable development. This is essential to building a cleaner and more prosperous future for people around the world.</p>\n\n<p>“I thank former Prime Minister Erna Solberg for her valuable partnership over the years. I had the pleasure to meet her on many occasions, including when she visited Canada in 2018 to participate at the G7 Summit in Charlevoix. She played an essential role in strengthening the close relations between Canada and Norway, and I wish her well in her future endeavours.”</p></div>\n      "
}