{
  "path": "/en/news/readouts/2018/12/01/prime-minister-justin-trudeau-meets-prime-minister-theresa-may-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister Theresa May of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Trudeau met with Prime Minister May of the United Kingdom on the margins of the G20 Summit in Buenos Aires, Argentina.</p><p>The Prime Ministers ‎reaffirmed their commitment to a seamless transition in relations following the United Kingdom’s withdrawal from the European Union.&nbsp;They spoke about two countries' longstanding commitment to mutually beneficial trade and said they looked forward to achieving bilateral free-trade ties. They welcomed the conclusion on Friday of the new Open Skies-type air transport agreement.</p><p>The Prime Ministers recognized that Canada and the U.K. are two of the world's closest allies and partners and that the dynamic Canada-United Kingdom relationship would continue to grow and deepen after the United Kingdom leaves the European Union.</p><p>The Prime Ministers discussed Russia’s use of military force in the Sea of Azov on November 25, 2018. They agreed that Russia must immediately release the Ukrainian vessels and their crew and that Ukraine’s sovereignty needs to be respected and protected.</p><p>The Prime Ministers also discussed the conflict in Yemen and its humanitarian consequence, and stressed the need for a ceasefire and more international assistance. They also discussed the‎ murder of Jamal Khashoggi on October 2, 2018 in the Saudi consulate in Istanbul and on the need for transparency on what transpired and who was responsible.</p><p>The Leaders agreed to continue their close cooperation, through the G20 and other multilateral fora, to address global challenges to the rules-based international system and to advance growth that benefits everyone. They looked forward to Canada and the U.K. working together on reforming the WTO in order to improve its effectiveness.</p><p>‎The Prime Ministers discussed their shared commitment to girls' education, to gender equality and women's empowerment, and to human rights. Prime Minister Trudeau congratulated Prime Minister May on the U.K. succeeding Canada as co-chair of the Equal Rights Coalition which champions LGBTQ2 rights globally.</p></div>\n      "
}