{
  "path": "/en/news/statements/2021/11/23/kihci-okimaw-o-wihtamakewin-ohci-kihci-okimawinahk-itasiwewin",
  "pageTitle": "Kihci Okimaw Ô-Wîhtamâkêwin ohci Kihci Okimâwinahk Itasiwêwin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kihci Okimaw, Justin Trudeau, anohc pakitinam ôma wîhtamâkêwin ohci Kihci Okimâwinahk Itasiwêwin :</p>\n\n<p>“Kêkâ mitâtahtosâp pîsim aspin ka-nakiskamahk namôy-mwâsi-mitâtahtomitanawâw askiy sisikoc ispayiwin, Canadians nawasônamwak ta-yahkohtêcik ôma Takwâki-Pîsim. Kî-mêkiwak isi kihci opaminikêwak ê-kîhkânâkwahk sîhkimiwêwin ta-mâmawî- atoskatahkik ta-nakinikâtêk COVID-19 âyimihiwêwin mîna ta-miskâtêk kihci nahêyihtamakêwin ka-natawêyihtâkwahk ta-osihcikâtêk nawaci-kwayask nîkânihk kiki kahkiyaw Canadians. Kihci-Okimânâhk Kânata kî-natohtawêw Canadians, mîna nikwayâcihonân ta-pônihtayahk ôma notinikêwin asicâyihk COVID-19, ta-sôhkêyihtamakahk sisikoc-isiwêpan wâskâwêwina, ta-wêhci pimâtisihk, ta-mâmawî-pimohtêstamahk wâkôwîcihiwîwin, ta-astahk mîkiwâm tipêyihcikêwin nawac ta-kî-kâhcitinikatêk, ta-osihtahk atoskêwina, mîna ta-ohpikihk iyinito okaskihcikêwak.</p>\n\n<p>“Ka-osihcikâtêk nawaci-kwayask nîkânihk mâcihtân asici ta-nakinikâtêk ôma sisikoc ispayiwin êkwa ta-pônihtahk cîstahowina. Mâmawî, kî-yahkohtênaw. Ayiwâk ayênânêwimitanaw niyânanosâp per cent ohci Canadians ka-kaskihtamasocik kî-pôni-cîstahwâwak, mîna niki sîhkihkêmonân kahkiyaw okimânâhk mîna okimânâhk-pimipayihtâwin otatoskêwak, êkwa kahkiyaw awiyak ka-papâmâcihôt pîhci Kânata isi pimihawin, iskotêwotâpânâsk, ahpô nâpihkwân ta-cîstahohcik. Mastaw otâhk ispayiwin Maskawâtisiwin Kânata pakitêyihtam cîstahowina kiki awâsisak tastaw niyânan êkwa pêyakosâp itahtopiponêwin, mîna okimânâhk asotamâkêw kîhtwâm aniskaciwin COVID-19 cîstahowina êkwa kahkihtwâm cîstahowêwina. Kîspin ta-ahkami sîhkimâyahkik kahkiyaw ka-kaskihtamasocik Canadians ta-otinahkik COVID-19 cîstahowina, ka-kî-osihtânaw nawac miyw-âyâwin nîkanihk mîna sôhkâpiskâw maskihkîwikamikohk pamihcikêwin. Okimânâhk nawac ta-nîkânîstamawêw kahkiyaw Canadians isi ta-otinahk yahkohtêwin ta-nâkatohkâtcikâtêk nasihkâc otamiyohiwêwina ka-itahkamikahk ohci COVID-19, ta-sôhkêpayik kinwês-kanawêyimowêwin, êkwa ta-maskawisihtahk kâhcitinikatêw isi mâmitonêyihcikan maskawâtisiwin êkwa wahkê-aspinêwin nanâtawihiwêwin. Pêyâhtak nakanawêyiminânak Canadians isi mînopayiwin mîna nawac miyw-âyâwin anohc êkwa ati-nîkân.</p>\n\n<p>“Kisik ka-âsêpitamahk ôma sisikoc ispayiwin nâwayês kiyanow, piko ta-mînosihtahk manâcihcikêwin êwako atoskêmakan kiki kahkiyaw awiyak. Êkosi ta-itocikâtêk, okimânâhk ta-ahkami nîkânahêw Canadians mîna pamihiwêw isi onîkânihk. Êwako itwêmakan ta-nâkatohkâtcikâtêk iyikohk pimâcihowin âhkwakisowin mîna ta-nâkatohkâtcikâtêk mîkiwâm têpakihcikêwin mîna awâsis kanawêyimowin. Nawîcihiwânân ta-astahk mîkiwâm tipêyihcikêwin kâwî ta-kahcitinikâtêk kiki Canadians nawac asici sîpihkâw Nistam-Mîkiwâm Tipêyihcikêwin Îyiyihêwêwin, oskayi Awihiwêwin-ta-Tipêyihcikâtêk pimipayihtâwin, mîna ta-âciwinikâtêk kîsihtâwin itakihtêwin kiki nistam-mîkiwâm tipêyihcikêwak. Ka-nîkânîstamakêhk wîtotîmâkanak ta-osihcikâtêk ayiwâk ta-wêhci pimâtisihk kiki iyinito okaskihcikêwak mîna ayisiyiniwak ka-sôhkatoskêcik ta- pimitisahikêt. Êwako ohci pâsci mihcêhîs pîsim niki masinahênân kêkâ-mitâtaht awâsis kanawêyimowin tipêyimowin asici ka-piskihtahastâhk êkwa tipahaskanihk êwako ta-âciwinam mêstinikêwin mitoni nanitaw âpihtaw pîhci kîhtwam askiy kiki osâm piko tipêyihcikêwin, ta-osihtahk mitâtahtomitanaw kihci mitâtahtomitanaw oskayi awâsis kanawêyimowin tawawina akami askiy, mîna ta-osihtahk âstamispîhk kiskinwahamâkêwin êkwa awâsis kanawêyimowin pamihcikêwin êwako ta-itakihtêw, iyikohk, $mitâtahtwâpisk pêyak kîsikâw kiki sôhkatoskêwak onîkihikomâwak. Kihci-Okimânâhk Kânata ta-kîsihtâw ôma $mitâtahtwâpisk pêyak kîsikâw isi awâsis kanawêyimowin, mîna ta-ahkami osihcikâtêk nawaci-kwayask mîna nawac ayiwâk ta-wêhci pimâtisihk kiki kahkiyaw Canadians.</p>\n\n<p>“Ta-osihtahk nawac ayiwâk sôhkâtisiwin manâcihcikêwin, ta-osihtahk atoskêwina, mîna ta-ohpikihk iyinito okaskihcikêwak, Kânata piko ta-sôhkêyihtahk mîna sisikoc-isiwêpan wâskâwêwina sôhkêyimowin. Êwako ohci ka-yahkohtêyahk ta-nakinamhk mîna ta-âciwinamahk pimiy mîna pahkitêwâpoy itêhkêskamik ka-pimohtatahk, nîkânistamâkêwin pîhci askiy-nînahk opimohtahiwêwin, mîna sîhkihkêmowin ta-atâwakihk êka kîkway-ka-pimohtatahk otâpânâsk. Ni-ayânân askiti-âpacihcikana mîna nakacî-atoskêwak ta-osihtahk kanâci-osîhcikêwina êkwânihi askiy ta-âpacihtat ta-âciwinahk misiwanâcihcikêwin mîna ta-osihtahk kanâci askiy manâcihcikêwin. Kihci-Okimânâhk Kânata ta-ahkami nîkânistamawêw otatoskêwak mîna pamikêwin ta-wîcihikoyahk isi manâcihcikêwin nîkanihk, êyiwêhk mîna nâkatohkâtcikâtêw ta-kanâcihtahk yêhêwin ka-otahtamahk mîna manâcihêw Canadians ohci maci-kîsikâwina. Mâmawî, wahyawês piko ta-itohtêyahk mîna nawac sôhkêsîs isi sisikoc-isiwêpan wâskâwêwin, namwâc piko ta-manâcihtayahk kî-wâsakâskamihtawin askiwinaw, mâka ta-ohpikihk kî-manâcihcikêwinaw isi namôya miyâskawawak otatoskêwak.</p>\n\n<p>“Kahkiyaw Canadians kaskihtamasowak mînopayiwin pîhci omâmawâyâwinihk, mâka pâskisikan mâyinikêwin yahkikin pîhci Kânata misi ôtênawa. Ata asay niki mâcihtânân ta-sôhkêyihtamakahk wâskâwêwina isi pâskisikan paminikêwin, kêyapic mistahi kîkway ta-itocikâtêk. Êwako ohci ta-osihcikâtêw ka-yahkastayahk ni-yahkohtêwinân mîna ê-sôhkêscikêhk ka-natawêyihtâkwahk kâwî ta-atawihk môskîscikêw-itowahk nîmâskwêwina mîna ta-atoskâtamahk asici ka-piskihtahastâhk êkwa tipahaskanihk ka-nôhtê nakinahkik pâskisikana.</p>\n\n<p>“Okimânâhk mîna ta-ahkami kêhcinâhow kahkiyaw awiyak mînopayiw mîna kaskihtamasow ta-yahkohtêt kiyam piko isi onisitawêyihtâkosiwin, awînihi ê-sâkihâcik, tânitê ohcîwin, ka-isi pîkiskwêt, awinhi ka-ayamihêstawât, ahpô ka-isi itasinâsot. Niki ahkami nôtinênân âyâtastêwin pakwâtitowin, pîtotêyihtamowin, mîna âtawêyihtamowin pîhci mâmawâyâwinihk, êkwa ta-nîkânipayihtahk sôhkâtisiwin ohci Kaskitêwiyâsak mîna ka-pîtotêyihtahcik Canadians, mîna Nêhiyawak. Nanîpawîstamâkânân kiki LGBTQ2 mâmawâyâwinihk mêkwâc ka-pônihcikâtêk nakinikêwin isi kwêskinâkohtâwin nanâtawihiwêwin, mîna namanâcihtânân mîna ta-nîkânîstamâkêhk ôhi kihci nîso pîkiskwêwina, nanapo pîhci mîna ôhpimê ohci Quebec.</p>\n\n<p>“Mâka ka-osihtahk nawac kikinikâsowin mîna nahiyikohk Kânata namwâc ta-ispayin kîspin piko sôhkêsîs ta-waskawîyahk isi ta-mâmawî-pimohtêstamahk wâkôwîcihiwîwin. Canadians kî-sêkisiwak ka-miskikâtêkihk ka-patâpacikâtêkihk wâtihkwâna mîna nahinikêwina ka-itastêkihk cîki kayâhtê ayimihâwi kiskinwahamâtowikamikohk. Isi askininahk, êkwa isi okimânâhk, piko ta-ahkami tâpwêwin ta-wîhtamahk ôhi mâyahkamikisiwowina ohci êkosi isi niki mîsahênân kayâhtê mâyahkamikisiwowina mîna ta-yahkohtêyahk isi ka-kîhkâtêyihtâkwan ohci wâkôwîcihiwîwin, kiki kahkiyaw awiyak. Kihci-Okimânâhk Kânata ta-ahkami nîkânîstamawêw Nêhiyawak pîhci ôhi mâmawâyâwinihk isi nîkânistamâkêwin pîhci nanâtohkî-nakiskamâkêwin maskawâtisiwin mîna miyw-âyâwin pimipayihtâwin, mîna nanâskomonân isi Tâpwîwina mîna Wâkôwîcihiwîwin Pimohtêstamakêwin ohci Kânata Nâkatohkâtcikâtêwin kiki Papâsi-wâskâwêwin mîna ta-nawasônaw kihci pîkiskwêstamakêw ayiwâk ta-nikanipayihtahk kwayaskwâtisiwin kayâs ka-kî-itahkamikahk ohci ayimihâwi kiskinwahamâtowikamikohk. Okimânâhk mîna ta-kisîpitam atoskêwin asici Nêhiyaw wîcihiwêwak ta-nâkatohkâtcikâtêk misiwêskamik itaskinahk mâyahkamikisiwowin isi Wanihiwêwin êkwa Nipahtâkêwin Nêhiyaw Iskwêwak, Iskwêsisak, êkwa 2SLGBTQQIA+ ayisyiniwak, mîna nakêhcinahownân nahiyikohk mîna ka-ohtisihk nahiyikohk tipahikêwin kiki êkwâniki mâyi-tôtawaw ohci Nistam Iyiniwak Awâsis êkwa Wîtotîmâkanak Pamîstakêwin pimipayihtâwin. Mâmawî, ka-kipahênaw tawawina êkwânihi ôsâm mihcêt Nistam Iyiniwak, Ayaskîmow, êkwa Âpihtawikosisânak mâmawâyâwinihk kêyapic anohc otiskawiskam mîna ta-osihcikâtêk nawaci-kwayask êkwa nawac ayiwâk kikinikâsowin nîkânihk.</p>\n\n<p>“Piyisk, okimânâhk nisitawinam ê-wîkiyahk pîhci sôhkê âyâtaskitêw askiy. Ôma sisikoc ispayiwin kî-wâpahtakihonaw ê-kistêyihtâkwahk ta-atoskatamahk asici misiwêskamik itaskinahk wîcihiwêwak ta-nakiskamahk mawinêskâkêwina anohc ohci êkwa ati-nîkân. Ka-nôtinamahk ohci sisikoc-isiwêpan ayimipayiwin isi kâhcitinikâtêwin pimohtatâwin osîhcikêwina êwako ta-osihtahk miyo iyinito okaskihcikêwak atoskêwina, mîna ta-nîpawîstamâkêyahk ta-sôhkêpayik misiwêskamik itaskinahk pêyâhtakêyimowin êkwa nâkatohkâcikâtêwin, Kânata ta-ahkami nîkanistam isi askiyninahk ikohk.</p>\n\n<p>“Osihcikâtêwina kâwî ohci mawinêskâkêwina kâwî ohci COVID-19 sisikoc ispayiwin, Canadians ihkatêyihtamwak kihci opaminikêwak ta-wîci atoskatahkik mîna ta-pimohtatacik isi ô-nîkânêyihcikâtêwina. Kihci-Okimânâhk Kânata nâkatêyihtam ta-ahkami nîkânahêw Canadians kisik osihcikâtêw ê-kanâta mîna nawac miyw-âyâwin nîkanihk. Mâmawî kî-yahkipênaw Kânata – kiki kahkiyaw awiyak.”</p></div>\n      "
}