{
  "path": "/en/news/news-releases/2018/02/24/prime-minister-concludes-visit-india",
  "pageTitle": "Prime Minister concludes visit to India | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his first state visit to India, which included stops in New Delhi, Agra, Ahmedabad, Mumbai, and Amritsar.</p><p>During the visit, Prime Minister Trudeau met with the Prime Minister of India, Narendra Modi, the President of India, Ram Nath Kovind, and the Indian Minister of External Affairs, Sushma Swaraj. Both Prime Ministers participated in a roundtable discussion with Indian and Canadian business executives to discuss creating new opportunities to cooperate in the global economy, promoting women’s economic empowerment, and creating new jobs in both our countries.</p><p>Canada and India signed six memoranda of understanding which will increase our cooperation in areas such as education, sport, intellectual property, information and communication technology, as well as science and innovation. In addition, twenty new or enhanced initiatives were launched, including projects to support education, women's empowerment and health, and research to clean polluted waters.</p><p>Prime Minister Trudeau welcomed more than $1 billion in investment between Canadian and Indian companies, which will create 5,800 new middle class jobs for Canadians.</p><p>On the last day of the visit, Prime Minister Trudeau delivered a keynote speech at the 2018 Young Changemakers Conclave annual conference. During his remarks, he emphasized the importance of gender equality, youth engagement, and diversity, and discussed the role of technology and innovation in empowering young leaders. The Prime Minister answered questions in an open session with thousands of young people.</p><p>Prime Minister Trudeau also participated in two events this week to celebrate the strong sporting traditions enjoyed by both Canada and India. On Thursday, the Prime Minister visited a cricket pitch at the Modern School in Delhi to practice and meet with representatives of Cricket Canada. Today, he joined a road hockey game, hosted by Canadian Olympic gold medalist Hayley Wickenheiser, with 20 members of the women’s ice hockey team from Ladakh in Northern India.</p><p>Sports bring people together, build bridges between communities, and have been proven to promote economic growth and sustainable development. Earlier this week, Canada and India signed an agreement to work together to protect the integrity of sport and use it to achieve the goals outlined in the United Nations 2030 Agenda for Sustainable Development.</p><p>The empowerment of women and girls – the focus of Canada’s Feminist International Assistance Policy and one of the United Nations’ Sustainable Development Goals – will be a driving force behind the activities taken under this new agreement. Through sport, we can help empower women and girls and create a more just and prosperous future for everyone.</p><h2>Quotes</h2><blockquote><p>\"Today, I had the privilege to hear directly from young leaders on how they're making their country, and the world, a better place to live. It was a fitting way to conclude our trip, which has set the stage for further collaboration between Canada and India, and will create new opportunities – and good, middle class jobs – for people in both our countries.\"<br>—<cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"Whether playing ice hockey or cricket, Indians and Canadians understand the power of sport to bridge communities, create connections, and bring out our best. We look forward to working with India to improve the global sport environment and ensure that our sport programs and competitions are fair, safe, and accessible.”&nbsp;<br>—<cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Prime Minister Trudeau was joined in India by a delegation of ministers and parliamentarians who had their own programs of meetings and activities, including:<ul><li>Minister of Innovation, Science and Economic Development, Navdeep Bains;</li><li>Minister of Small Business and Tourism, Bardish Chagger;</li><li>Minister of Science and Minister of Sport and Persons with Disabilities, Kirsty Duncan;</li><li>Minister of Foreign Affairs, Chrystia Freeland;</li><li>Minister of National Defence, Harjit Singh Sajjan; and</li><li>Minister of Infrastructure and Communities, Amarjeet Sohi.</li></ul></li><li>The 2018 Young Changemakers Conclave annual conference showcased the United Nations 2030 Sustainable Development Goals touching on gender equality, education, climate change, economic growth, and human rights. It also explored how innovation, technology, and young people can play an important role in solving issues affecting the global future.</li><li>With the Memorandum of Understanding on Cooperation in Sport now signed by Canada and India, officials from both countries will work to identify specific activities that can be undertaken to advance mutual priorities.</li><li>During this visit, the Prime Minister also met with civil society leaders, underscoring the important role they play to underpin democracy.</li></ul><h2>Related products</h2><ul><li><a href=\"/en/news/news-releases/2018/01/22/prime-minister-trudeau-travel-india-state-visit\">Prime Minister Trudeau to travel to India for state visit</a></li><li><a href=\"/en/news/news-releases/2018/02/18/canada-and-india’s-relationship-strengthened-people-people-ties\">Canada and India’s relationship strengthened by people-to-people ties</a></li><li><a href=\"/en/news/news-releases/2018/02/20/prime-minister-announces-new-commercial-partnerships-india-and\">Canada announces new commercial partnerships with India</a></li><li><a href=\"/en/news/news-releases/2018/02/22/canada-announces-new-partnerships-india\">Canada announces new partnerships with India</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/india-inde/relations.aspx?lang=eng\">Canada-India Relations</a></li><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li></ul></div>\n      "
}