{
  "path": "/en/news/readouts/2022/09/24/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss Hurricane Fiona | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the ongoing impact of Hurricane Fiona on the Atlantic provinces and in Quebec. The Prime Minister was joined by ministers and senior officials who are actively working with their provincial counterparts and First Nations communities to assess the hurricane’s impacts and offer support and assistance to affected areas, as may be required.</p>\n\n<p>The Prime Minister and ministers expressed their grave concern about the severity of the hurricane and its significant impact on the safety of people and on infrastructure.</p>\n\n<p>Officials provided the Prime Minister with an overview of the hurricane’s trajectory and projected path, noting widespread impacts on communities across the region as a result of extremely high winds, storm surge, and heavy rains, which have severely affected people, their homes, and power, transportation, and telecommunications infrastructure.</p>\n\n<p>Officials also briefed the Prime Minister and ministers on ongoing work with provincial emergency management organizations, as well as telecommunications and power utilities to help determine impacts and potential requirements for assistance. Officials noted continuing engagement with First Nations communities who have been affected.</p>\n\n<p>The Prime Minister and ministers reviewed and confirmed the readiness of key federal resources that may be deployed to provide support to affected areas in the coming days, including the Canadian Armed Forces, the Canadian Coast Guard, Transport Canada, and others. They also discussed financial support for relief and recovery efforts through the Canadian Red Cross.</p>\n\n<p>The Government of Canada will continue to work closely with provincial governments, affected First Nations communities, and emergency response organizations to ensure that necessary support is provided to affected Canadians during this difficult time. The government is also committed to working closely to support recovery and rebuilding efforts.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://weather.gc.ca/hurricane/track_e.html\">Hurricane Track</a></li>\n\t<li><a href=\"https://www.redcross.ca/\">Canadian Red Cross</a></li>\n</ul></div>\n      "
}