{
  "path": "/en/news/readouts/2022/11/12/prime-minister-justin-trudeau-meets-prime-minister-vietnam-pham-minh-chinh",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Vietnam Pham Minh Chinh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Vietnam, Pham Minh Chinh, on the margins of the Association of Southeast Asian Nations (ASEAN) Summit.</p>\n\n<p>The prime ministers discussed the importance of the Comprehensive Partnership between Canada and Vietnam that was announced during Prime Minister Trudeau’s visit to Vietnam in 2017. The Canada-Vietnam Comprehensive Partnership promotes enhanced bilateral cooperation in several key areas, including political and diplomatic, development cooperation, and people-to-people ties. Prime Minister Trudeau talked about the strong potential to grow ties between our countries, including cooperation on regional security, climate change, clean energy, gender equality, and education. He also raised consular cases and the importance of advancing the promotion and protection of human rights.</p>\n\n<p>They talked about the growing trade and investment relationship between Canada and Vietnam, which is rooted in joint membership in the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), and is creating jobs and opening up new markets for Canadian businesses.</p>\n\n<p>Prime Minister Trudeau highlighted the upcoming release of Canada’s Indo-Pacific Strategy. He emphasized the important role ASEAN will play in Canada’s work to deepen its partnerships in the region. He also reiterated Canada’s long-term commitment to strengthen its relationship with ASEAN.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/vietnam/index.aspx?lang=eng\">Canada and Vietnam</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2017/11/08/joint-statement-canada-and-socialist-republic-vietnam-establishment\">Joint Statement by Canada and the Socialist Republic of Vietnam on the establishment of a comprehensive partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a>&nbsp;</li>\n</ul></div>\n      "
}