{
  "path": "/en/news/readouts/2022/04/06/prime-minister-justin-trudeau-meets-united-nations-high-commissioner",
  "pageTitle": "Prime Minister Justin Trudeau meets with the United Nations High Commissioner for Refugees Filippo Grandi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the United Nations High Commissioner for Refugees (UNHCR), Filippo Grandi, during the High Commissioner’s visit to Canada.</p>\n\n<p>The Prime Minister and the High Commissioner shared their deep concerns about the long-lasting humanitarian impacts of armed conflicts, particularly on the protection of civilian populations and on food security globally.</p>\n\n<p>The leaders discussed the unprecedented scale of the humanitarian crisis in Ukraine resulting from Russia’s invasion, the ongoing humanitarian needs in Afghanistan, and Canada’s continued leadership and contributions to the international response.</p>\n\n<p>Prime Minister Trudeau also raised concerns about the suffering caused by the forced and irregular displacement of people in Central America and throughout the Americas. He spoke about Canada’s joint efforts with partners, including the International Organization for Migration, aimed to address the root causes that drive irregular movements and migration, and to respond to the needs of displaced people, particularly within the collaborative framework of the MIRPS Support Platform, of which Canada is Chair.</p>\n\n<p>The two leaders noted the close and valued partnership between Canada and the UNHCR, including with respect to Canada’s resettlement program. The Prime Minister lauded the UNHCR’s international protection regime, which is crucial in guiding and supporting international responses to new and ongoing displacement crises.</p>\n\n<p>The Prime Minister and the High Commissioner looked forward to the continued partnership between Canada and the UNHCR in addressing the many humanitarian crises unfolding around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/unhcr-hcr.aspx?lang=eng\">Canada and the United Nations High Commissioner for Refugees</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/refugees/afghanistan.html\">Canada’s response to the situation in Afghanistan</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2021/12/canada-launches-new-initiative-to-protectvulnerable-women-and-girls-in-central-america.html\">Canada launches new initiative to protect vulnerable women and girls in Central America</a></li>\n</ul></div>\n      "
}