{
  "path": "/en/news/news-releases/2017/04/03/prime-minister-nominates-next-president-public-service-commission",
  "pageTitle": "Prime Minister nominates next President of the Public Service Commission | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Patrick&nbsp;Borbey as the new President of the Public Service Commission.&nbsp;</p><p>Mr. Borbey, currently the Associate Deputy Minister of Canadian Heritage, holds a Bachelor of Social Sciences and a Master of Business Administration from the University of Ottawa. During his 35 years in the Public Service, Mr. Borbey has held a number of positions of significant responsibility, including Senior Assistant Deputy Minister, Treaties and Aboriginal Government, at the former department of Aboriginal Affairs and Northern Development Canada, and President of the Canadian Northern Economic Development Agency.</p><h2>Quote</h2><blockquote><p>“Patrick Borbey is well-qualified to take on the role of President of the Public Service Commission. Chosen through the new, non-partisan merit-based process designed to select the right candidate to tackle the challenges faced by the Commission, Patrick brings an in-depth knowledge of the public sector and a solid understanding of the mandate and operations of this important organization.”<br><cite>—&nbsp;Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><b>Quick Facts</b></h2><ul><li>The Public Service Commission is responsible for promoting and safeguarding a merit-based, representative and non-partisan public service that serves all Canadians, in collaboration with its stakeholders.</li><li>As set out in the&nbsp;<i>Public Service Employment Act</i>, this appointment must be approved by resolution of the House of Commons and Senate.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/04/02/biographical-notes-–-patrick-borbey\">Biographical notes on Patrick Borbey</a></li></ul></div>\n      "
}