{
  "path": "/en/news/readouts/2023/01/03/prime-min-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister extended his warmest wishes to those in Ukraine preparing to celebrate Orthodox Christmas, even as they continue to endure Russia’s strikes against them and on their country’s essential infrastructure.</p>\n\n<p>As the new year begins, the Prime Minister also expressed his hope that 2023 will bring a just and sustainable peace to the people of Ukraine. He commended President Zelenskyy’s ongoing efforts toward this end, including his peace initiative, and reaffirmed Canada’s support for these endeavours.</p>\n\n<p>The two leaders also discussed the latest developments on the ground in Ukraine and condemned Russia’s ongoing attacks. The Prime Minister reiterated Canada’s commitment to providing humanitarian, military, financial, and other assistance to the government and people of Ukraine for as long as is necessary, to safeguard their free, democratic, and secure future.</p>\n\n<p>The leaders agreed to remain in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/12/16/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/12/13/canada-provides-ukraine-115-million-russian-and-belarusian-tariff\">Canada provides Ukraine $115&nbsp;million from Russian and Belarusian tariff revenues to repair Kyiv’s power grid</a></li>\n</ul></div>\n      "
}