{
  "path": "/en/news/news-releases/2022/06/30/prime-minister-and-nato-leaders-strengthen-transatlantic-security",
  "pageTitle": "Prime Minister and NATO Leaders strengthen transatlantic security | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a pivotal North Atlantic Treaty Organization (NATO) Summit where he met with Allied Heads of State and Government to advance transatlantic security particularly in the face of Russia’s ongoing invasion of Ukraine.</p>\n\n<p>Allies reiterated their unwavering commitment to continue supporting Ukraine as it defends itself against Russia’s illegal, unprovoked, and unjustifiable aggression, and agreed to a Comprehensive Assistance Package for Ukraine. Leaders decided to further enhance NATO’s longer-term deterrence and defence posture, agreed on increasing common funding, endorsed NATO’s new Strategic Concept, and invited Finland and Sweden to join the Alliance. Discussions also focused on strengthening Alliance resilience, and sharpening NATO’s technological edge.</p>\n\n<p>At the Summit, the Prime Minister announced that Canada will bolster its military deployment in Latvia by augmenting NATO’s enhanced Forward Presence (eFP) mission there. Canada will continue to lead NATO’s eFP Battle Group as the Framework Nation, and will develop a sustainable plan in coordination with Latvia in the near-term to be able to surge a combat-capable brigade into the country. Canada will work closely with Latvia, NATO and Allies to generate and deploy forces and invest in infrastructure and training areas to support the increase of troops. This announcement builds on Canada’s leadership role and existing contributions in Latvia over the last five years.</p>\n\n<p>The Prime Minister also announced that Canada is providing an additional six drone cameras and is currently in process of finalizing negotiations to supply Ukraine with up to 39 armoured combat support vehicles (ACSVs), including elements for repairs and servicing. This will complete the allocation of $500 million in military support for Ukraine announced in Budget 2022.<strong> </strong></p>\n\n<p>Leaders also endorsed NATO’s new Strategic Concept, the blueprint to ensure NATO will continue to adapt the evolving security environment over the next decade and beyond. The new Concept reaffirms the Alliances’ values, and sets out NATO’s three core tasks of deterrence and defence; crisis prevention and management; and cooperative security. It aligns with Canada’s overarching foreign policy priorities on women, peace, and security; and addressing the impacts of climate change.</p>\n\n<p>In addition, Canada will increase its diplomatic presence and network in Central and Eastern Europe and the Caucasus, including a new embassy in Armenia, converting current Canadian offices in Estonia, Lithuania, and Slovakia to full embassies with resident ambassadors and strengthening our presence at our embassy in Latvia.</p>\n\n<p>Additionally, the Prime Minister announced Canada’s intention to host NATO’s North American Regional Office of the Defence Innovation Accelerator for the North Atlantic (DIANA). DIANA will comprise a network of innovation hubs, with technology accelerator sites and test centres across Europe and North America. This will serve to foster and protect Allied innovation, including Canadian innovation. DIANA will bring defence personnel together with the Alliance’s best and brightest start-ups, scientific researchers, and technology companies to remain competitive as well as to solve critical defence and security challenges.</p>\n\n<p>Further, Prime Minister Trudeau announced that the NATO Climate Change and Security Centre of Excellence (CCASCOE) will be located in Montreal. The Centre will drive shared work on responding to the security challenges of climate change – such as extreme weather – as well as collaboration on decreasing the environmental impact of military operations. This Centre will be Canada’s first NATO Centre of Excellence and will cement Montreal’s status as a global hub for international organizations.</p>\n\n<p>While at the Summit, the Prime Minister held bilateral meetings with NATO’s Secretary General, as well as his counterparts from Australia, Denmark, Finland, South Korea and Sweden. The Prime Minister also met with the Prime Minister of New Zealand.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“In the face of Russia’s ongoing attack on Ukraine – an attack on democracy, human rights, freedom, and security everywhere – NATO has reaffirmed its enduring transatlantic bond. NATO Allies are united and determined to uphold the Alliance’s values, and to strengthen our defensive alliance, for now and for the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister was joined by the Minister of Foreign Affairs, Mélanie Joly, and the Minister of National Defence, Anita Anand.</li>\n\t<li>Canada strongly supports Finland and Sweden’s application to join NATO and has taken domestic action to ensure this occurs as quickly as possible.</li>\n\t<li>DIANA will concentrate on new emerging and disruptive technologies that NATO has identified as priorities including: artificial intelligence, big-data processing, quantum-enabled technologies, autonomy, biotechnology, novel materials and space.</li>\n\t<li>The establishment of the NATO Climate Change and Security Centre of Excellence is an ongoing initiative led jointly by Global Affairs Canada and the Department of National Defence. Canada is working closely with NATO, Allies, and other stakeholders to complete the design of the Centre of Excellence. Canada aims to establish the Centre of Excellence in 2023 or afterwards.</li>\n\t<li>Canada is currently contributing to the following NATO operations, missions, and activities:\n\t<ul>\n\t\t<li>Supporting NATO assurance and deterrence measures in Central and Eastern Europe through Operation REASSURANCE:\n\t\t<ul>\n\t\t\t<li>leading NATO’s multinational enhanced Forward Presence (eFP) Battle Group Latvia, as Framework Nation, since 2017;</li>\n\t\t\t<li>providing a General Officer and staff to Multinational Division Headquarters – North in Latvia;</li>\n\t\t\t<li>deploying CF-18 fighter aircraft to conduct surveillance and air policing activities in Europe. The next deployment will be in summer 2022;</li>\n\t\t\t<li>providing two Halifax-class frigates to the Standing NATO Maritime Groups, currently HMCS <em>Halifax</em> and HMCS <em>Montreal</em>, which will return to Canada in July 2022;</li>\n\t\t\t<li>providing two Kingston-class Maritime Coastal Defence Vessels to Standing NATO Mine Countermeasures Group 1 which will be joining NATO in July 2022; and</li>\n\t\t\t<li>providing a CP-140 Aurora aircraft from February to July 2022.</li>\n\t\t</ul>\n\t\t</li>\n\t\t<li>Supporting training and capacity building efforts in the Middle East under Operation IMPACT, including through NATO Mission Iraq; and</li>\n\t\t<li>Deploying personnel to NATO’s Kosovo Force.</li>\n\t</ul>\n\t</li>\n\t<li>Canada has also placed 3,400 Canadian Armed Forces personnel across all branches of the service at a higher state of readiness to deploy to the NATO Response Force should these forces be requested by NATO.</li>\n\t<li>Canada is also providing two CC-130 Hercules aircraft, operating out of the United Kingdom, to support Allies’ bilateral donations to Ukraine.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2022/06/29/madrid-summit-declaration\">Madrid Summit Declaration</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/news_197281.htm?selectedLocale=en\">NATO 2022 Strategic Concept</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/centre-excellence.aspx?lang=eng\">NATO Climate Change and Security Centre of Excellence</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/06/joint-declaration-betweenthe-ministry-of-defence-of-the-republic-of-latvia-and-the-department-of-national-defence-of-canada-concerning-augmented-fo.html\">Joint declaration between the Ministry of Defence of the Republic of Latvia and the Department of National Defence of Canada concerning augmented forward presence Latvia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/06/minister-joly-announces-expansion-of-canadas-diplomatic-presence-in-central-and-eastern-europe-and-caucasus.html\">Minister Joly announces expansion of Canada’s diplomat presence in Central and Eastern Europe and Caucasus</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/29/statement-prime-minister-natos-invitation-finland-and-sweden-join\">Statement by the Prime Minister on NATO’s invitation to Finland and Sweden to join NATO</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}