{
  "path": "/en/news/news-releases/2018/08/31/prime-minister-announces-changes-parliamentary-secretaries",
  "pageTitle": "Prime Minister announces changes to parliamentary secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the parliamentary secretaries.</p><p>The parliamentary secretaries included in today’s announcement are either newly appointed, taking on new responsibilities, or staying in their current portfolio. The appointments are effective on August 31.</p><p>Together, the new team brings a wealth of experience and range of skills and perspectives – all of which will position Canada for greater growth and success. The parliamentary secretaries will support their respective cabinet ministers to deliver real results for Canadians, and help the Government continue to grow the economy and strengthen the middle class.</p><p>The changes to <a href=\"/en/parliamentary-secretaries\">the parliamentary secretaries</a> are as follows:</p><ul><li><b>Omar Alghabra</b>, currently Parliamentary Secretary to the Minister of Foreign Affairs (Consular Affairs), becomes Parliamentary Secretary to the Minister of International Trade Diversification.</li><li><b>Gary Anandasangaree</b> becomes Parliamentary Secretary to the Minister of Canadian Heritage and Multiculturalism (Multiculturalism).</li><li><b>Terry Beech</b>, currently Parliamentary Secretary to the Minister of Fisheries, Oceans and the Canadian Coast Guard, becomes Parliamentary Secretary to the Minister of Transport.</li><li><b>Sean Casey</b>, currently Parliamentary Secretary to the Minister of Canadian Heritage, becomes Parliamentary Secretary to the Minister of Fisheries, Oceans and the Canadian Coast Guard.</li><li><b>Serge Cormier</b>, currently Parliamentary Secretary to the Minister of Immigration, Refugees and Citizenship, becomes Parliamentary Secretary to the Minister of National Defence.</li><li><b>Roger Cuzner </b>remains Parliamentary Secretary to the Minister of Employment, Workforce Development and Labour.</li><li><b>Matt DeCourcey</b>, currently Parliamentary Secretary to the Minister of Foreign Affairs, becomes Parliamentary Secretary to the Minister of Immigration, Refugees and Citizenship.</li><li><b>Terry Duguid </b>remains Parliamentary Secretary to the Minister of Status of Women.</li><li><b>Andy Fillmore</b>, currently Parliamentary Secretary to the Minister of Democratic Institutions, becomes Parliamentary Secretary to the Minister of Canadian Heritage and Multiculturalism.</li><li><b>Sean Fraser</b> becomes Parliamentary Secretary to the Minister of Environment and Climate Change.</li><li><b>Pamela Goldsmith-Jones</b>, currently Parliamentary Secretary to the Minister of International Trade Diversification, becomes Parliamentary Secretary to the Minister of Foreign Affairs (Consular Affairs).</li><li><b>Richard Hébert</b> becomes Parliamentary Secretary to the Minister of Small Business and Export Promotion.</li><li><b>Yvonne Jones</b>, currently Parliamentary Secretary to the Minister of Crown-Indigenous Relations, becomes Parliamentary Secretary to the Minister of Intergovernmental and Northern Affairs and Internal Trade.</li><li><b>Bernadette Jordan</b> becomes Parliamentary Secretary to the Minister of Democratic Institutions.</li><li><b>Kamal Khera</b>, currently Parliamentary Secretary to the Minister of National Revenue, becomes Parliamentary Secretary to the Minister of International Development.</li><li><b>David Lametti</b> remains Parliamentary Secretary to the Minister of Innovation, Science and Economic Development.</li><li><b>Kevin Lamoureux </b>remains Parliamentary Secretary to the Leader of the Government in the House of Commons.</li><li><b>Stéphane Lauzon</b>, currently Parliamentary Secretary to the Minister of Sport and Persons with Disabilities, becomes Parliamentary Secretary to the Minister of Veterans Affairs and Associate Minister of National Defence.</li><li><b>Paul Lefebvre</b> becomes Parliamentary Secretary to the Minister of Natural Resources.</li><li><b>Andrew Leslie </b>remains Parliamentary Secretary to the Minister of Foreign Affairs.</li><li><b>Joël Lightbound</b> remains Parliamentary Secretary to the Minister of Finance.</li><li><b>Alaina Lockhart</b>, currently Parliamentary Secretary to the Minister of Small Business and Tourism, becomes Parliamentary Secretary to the Minister of Tourism, Official Languages and La Francophonie.</li><li><b>Steven MacKinnon </b>remains Parliamentary Secretary to the Minister of Public Services and Procurement and Accessibility.</li><li><b>Karen McCrimmon</b>, currently Parliamentary Secretary to the Minister of Transport, becomes Parliamentary Secretary to the Minister of Public Safety and Emergency Preparedness.</li><li><b>Marco Mendicino</b>, currently Parliamentary Secretary to the Minister of Justice and Attorney General of Canada, becomes Parliamentary Secretary to the Minister of Infrastructure and Communities.</li><li><b>Marc Miller</b>, currently Parliamentary Secretary to the Minister of Infrastructure and Communities, becomes Parliamentary Secretary to the Minister of Crown-Indigenous Relations.</li><li><b>Joyce Murray </b>remains Parliamentary Secretary to the President of the Treasury Board and Minister of Digital Government.</li><li><b>Jennifer O’Connell</b> becomes Parliamentary Secretary to the Minister of Finance (Youth Economic Opportunity).</li><li><b>John Oliver</b> becomes Parliamentary Secretary to the Minister of Health.</li><li><b>Jean-Claude Poissant </b>remains Parliamentary Secretary to the Minister of Agriculture and Agri-Food.</li><li><b>Sherry Romanado</b>, currently Parliamentary Secretary to the Minister of Veterans Affairs and Associate Minister of National Defence, becomes Parliamentary Secretary to the Minister of Seniors.</li><li><b>Peter Schiefke</b> remains Parliamentary Secretary to the Prime Minister (Youth) and becomes Parliamentary Secretary to the Minister of Border Security and Organized Crime Reduction.</li><li><b>Deb Schulte</b> becomes Parliamentary Secretary to the Minister of National Revenue.</li><li><b>Dan Vandal</b> becomes Parliamentary Secretary to the Minister of Indigenous Services.</li><li><b>Adam Vaughan </b>remains Parliamentary Secretary to the Minister of Families, Children and Social Development.</li><li><b>Arif Virani</b>, currently Parliamentary Secretary to the Minister of Canadian Heritage (Multiculturalism), becomes Parliamentary Secretary to the Minister of Justice and Attorney General of Canada.</li><li><b>Kate Young</b>, currently Parliamentary Secretary to the Minister of Science, becomes Parliamentary Secretary to the Minister of Science and Sport and to the Minister of Public Services and Procurement and Accessibility (Accessibility).</li></ul><p>The Prime Minister also announced that <b>Mark Holland</b>, currently Parliamentary Secretary to the Minister of Public Safety and Emergency Preparedness, has agreed to serve as Chief Government Whip, and that <b>Linda Lapointe</b> will serve as Deputy Government Whip.</p><h2>Related products</h2><ul><li><a href=\"/en/parliamentary-secretaries\">Parliamentary Secretaries</a></li><li><a href=\"/en/canadian-ministry-order-precedence\">The Canadian Ministry</a></li></ul></div>\n      "
}