{
  "path": "/en/news/news-releases/2017/12/04/prime-minister-trudeau-welcomes-upcoming-canada-china-year-tourism",
  "pageTitle": "Prime Minister Trudeau welcomes upcoming Canada-China Year of Tourism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today visited the headquarters of a top online media company in Beijing, China – Sina Weibo – where he promoted Canada as a premier destination for Chinese tourists. Joined by Chinese youth, he also highlighted the celebrations that will be held in both countries during the 2018 Canada-China Year of Tourism.</p><p>Canada and China enjoy strong and longstanding cultural and people-to-people ties. Growing tourism between our two countries will deepen our commercial relationship and create good, well-paying jobs for Canadians while growing our middle class for years to come.</p><p>Our government is working closely with Canadian businesses and communities to ensure they are prepared to welcome an increased number of Chinese tourists during the Canada-China Year of Tourism and beyond.</p><p>Events and celebrations that showcase Canadian and Chinese cultures will be held in both countries next year. The Prime Minister also announced that Canada will host the Canada-China Year of Tourism closing ceremonies next fall in China and that China will host the opening ceremonies next spring in Canada.</p><h2>Quotes</h2><blockquote><p>“The Canada-China Year of Tourism is an exceptional opportunity to strengthen the people-to-people connections between our two countries and celebrate the best that Canada and China offer the world. It will grow our tourism sector, which means more middle class jobs for Canadians and better economic growth for communities across the country.”<br> <cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and China are united by strong people-to-people ties and a long history of cooperation. I am happy to join Prime Minister Trudeau and my colleagues today to announce the next steps on the Canada-China Year of Tourism, which will offer a unique opportunity to share our respective rich cultures, amazing attractions and unforgettable experiences. We are committed to working together with our Chinese partners to create memorable experiences that keep visitors coming back to Canada time and again.”<br><cite>— The Hon. Bardish Chagger, Minister of Small Business and Tourism, and Leader of the Government in the House of Commons</cite></p></blockquote><h2>Quick facts</h2><ul><li>China is one of Canada’s fastest-growing tourism markets and our third-largest source of tourism. Nearly 610,000 Chinese tourists visited Canada in 2016, an increase of more than 20% on average each year since 2011, and spent an estimated&nbsp;$1.25&nbsp;billion. That number is expected to grow significantly over the next four years.</li><li>Canada’s tourism industry is a key economic driver, and employs one in ten Canadians.</li><li>Over five per cent of Canada's population has Chinese ancestry, and Mandarin and Cantonese are Canada's third and fourth most widely spoken languages.</li></ul><h2>Related products</h2><ul><li><a href=\"/en/news/news-releases/2017/11/26/prime-minister-strengthen-bilateral-and-commercial-ties-trip-china\">Prime Minister to strengthen bilateral and commercial ties on trip to China</a></li><li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2016/09/2018-will-year-canada-china-tourism.html?wbdisable=true\">2018 will be the year of Canada­­–China tourism</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.56003307.1168694504.1511191876-108037952.1511191871\">Canada-China Relations</a></li></ul></div>\n      "
}