{
  "path": "/en/news/readouts/2022/11/01/prime-minister-justin-trudeau-meets-prime-minister-luxembourg-xavier",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Luxembourg Xavier Bettel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Luxembourg, Xavier Bettel, during Prime Minister Bettel’s visit to Canada.</p>\n\n<p>The two leaders discussed Russia’s illegal and unjustifiable invasion of Ukraine and its global impacts, including on food and energy security.&nbsp;They agreed on the importance of maintaining strong unity amongst allies to increase support to those impacted, in Ukraine and internationally.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Bettel highlighted the strength of the relationship between Canada and Luxembourg, and identified avenues to deepen bilateral cooperation on shared values and priorities. They discussed the benefits of further promoting innovation and job creation through bilateral trade and investment, as demonstrated by the successful visit to Canada by a commercial delegation from Luxembourg last summer.</p>\n\n<p>The two leaders agreed to work more closely together to address the growing security impacts of climate change. They also spoke of the importance of promoting the diversity of Francophone cultures, and contributing to the creation and promotion of Francophone content. Finally, they agreed on the need to deepen cooperation to advance human rights and defend democracy and democratic institutions around the world.</p>\n\n<p>The prime ministers agreed to stay in close contact and to keep working closely together to further shared priorities.</p>\n\n<p><strong>Associated Links</strong></p>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/luxembourg/relations.aspx?lang=eng\">Canada-Luxembourg relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}