{
  "path": "/en/news/statements/2019/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p>\n\n<p>“No one should face violence because of who they are. Yet for far too many women, girls, and people of diverse gender identities and gender expressions, that is their reality.</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/events/endviolenceday/\">International Day for the Elimination of Violence against Women</a>, we reaffirm our commitment to end gender-based violence, here in Canada and around the world. We also honour the survivors, advocates, and community-based organizations working tirelessly to bring about change.</p>\n\n<p>“Our government is taking concrete steps to help end gender-based violence and close the gaps in services for Indigenous peoples, LGBTQ2 communities, persons with disabilities, newcomers, and people of every age.</p>\n\n<p>“Earlier this year, we welcomed the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls. Our government is committed to ending this national tragedy, and co-developing and implementing a National Action Plan. We will continue to listen to the voices of survivors and advocates, and work with Indigenous partners to create meaningful, Indigenous-led action.</p>\n\n<p>“Globally, one in three women experiences physical or sexual violence in their lifetime. Together, we must fight gender-based violence wherever it occurs, and end the stigma that too often surrounds survivors.</p>\n\n<p>“On the world stage, our government is taking the lead by supporting women’s organizations to advance gender equality through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/wvl_projects-projets_vlf.aspx?lang=eng\">Women’s Voice and Leadership Program</a> and the <a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/gender_equality-egalite_des_genres/index.aspx?lang=eng\">Equality Fund</a>. Through initiatives like the <a href=\"https://www.unwomen.org/en/trust-funds/un-trust-fund-to-end-violence-against-women\">United Nations Trust Fund to End Violence against Women</a>, Canada further supports the work of grassroots, women-led organizations and networks to address the root causes of violence, and stands with survivors as they seek justice and rebuild their lives.</p>\n\n<p>“Today, as we launch the <a href=\"https://cfc-swc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism Against Gender-Based Violence</a>, I invite Canadians to reflect on what we can all do – through our words and actions – to end gender-based violence and create a brighter future for everyone.”</p></div>\n      "
}