{
  "path": "/en/news/news-releases/2017/05/11/prime-minister-trudeau-participate-microsoft-ceo-summit-seattle",
  "pageTitle": "Prime Minister Trudeau to participate in the Microsoft CEO Summit in Seattle, Washington | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in the Microsoft CEO Summit in Seattle, Washington, on May 17 and 18, to promote the Cascadia Innovation Corridor, encourage investment in the Canadian technology sector, and draw global talent to Canada.</p><p>This year’s summit, under the theme “The CEO Agenda: Navigating Change,” will bring together more than 150 chief executive officers. While at the Summit, Prime Minister Trudeau will showcase Budget 2017’s <a href=\"http://www.ic.gc.ca/eic/site/062.nsf/eng/home\">Innovation and Skills Plan</a> and demonstrate how Canada is making it easier for Canadian entrepreneurs and innovators to turn their ideas into thriving businesses.</p><p>Prime Minister Trudeau will also meet with Washington Governor Jay Inslee.</p><h2>Quote</h2><blockquote><p>“Canada’s greatest strength is its skilled, hard-working, creative, and diverse workforce. Canada is recognized as a world leader in research and development in many areas like artificial intelligence, quantum computing, and 3D programming. Our government will continue to help Canadian businesses grow and create good, well-paying middle class jobs in today’s high-tech economy.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada-U.S. bilateral trade in goods and services reached approximately $882 billion in 2016.</li><li>Nearly 400,000 people and over $2 billion-worth of goods and services cross the Canada-U.S. border every day.</li><li>Canada-Washington bilateral trade was $19.8 billion in 2016. Some 223,300 jobs in the State of Washington depend on trade and investment with Canada. Canada is among Washington’s top export destinations.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-01-en.html\">Budget 2017: Chapter 1 - Skills, Innovation and Middle Class Jobs</a></li></ul></div>\n      "
}