{
  "path": "/en/news/readouts/2022/09/23/prime-minister-justin-trudeau-meets-president-south-korea-yoon-suk-yeol",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of South Korea Yoon Suk Yeol | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of South Korea, Yoon Suk Yeol, for a working visit. This was President Yoon’s first bilateral visit abroad since he became President in March 2022.</p>\n\n<p>The leaders acknowledged that Canada and South Korea share a special friendship strengthened by Canada’s involvement during the Korean War, a mutual commitment to multilateralism, and economic partnership and growth that works for everyone.</p>\n\n<p>The Prime Minister and the President held an extended bilateral meeting with key ministers, including for Canada, Minister of Foreign Affairs Mélanie Joly and Minister of Innovation, Science and Industry François-Philippe Champagne, and for South Korea, Foreign Minister Park Jin, Minister of Trade, Industry and Energy Lee Chang-Yang, and National Security Advisor Kim Sung-Han.</p>\n\n<p>During the visit, the two leaders agreed to enhance the Canada-South Korea bilateral relationship to a Comprehensive Strategic Partnership focused on advancing five shared priorities. These include defending the rules-based international system, democracy, freedom, human rights, and gender equality; strengthening security and defence partnerships; working together in science, technology, and innovation; promoting trade and investment; and deepening partnerships in health and culture.</p>\n\n<p>The Prime Minister and the President agreed to take action to strengthen economic security at a time of growing disruption and uncertainty caused by the pandemic and conflict. They pledged to deepen cooperation on supply chain resiliency, critical minerals, and batteries for electric vehicles, all while maintaining high labour conditions and environmental standards. To advance these shared priorities, the leaders agreed to work toward launching a ministerial dialogue on economic security.</p>\n\n<p>Noting the urgent need for action to address climate change, the leaders spoke of the importance of increasing cooperation on shared priorities, including the transition to clean energy, the phasing out of coal, the implementation of carbon pricing, and clean technology. The two leaders also discussed the role of Canada as a reliable supplier of energy to a net-zero world.</p>\n\n<p>The Prime Minister and the President discussed global and regional security issues. They committed to continue working together to challenge Russia’s illegal and unjustifiable invasion of Ukraine. They stressed the importance of maintaining strong unity amongst like-minded partners, and continuing to impose severe costs on Russia in the face of its aggression.</p>\n\n<p>The leaders also expressed their concerns about North Korea’s recent ballistic missile launches, which violate successive United Nations Security Council resolutions and pose a serious threat to international peace and security. Prime Minister Trudeau reiterated Canada’s strong commitment to supporting international efforts to promote security and stability in the region, including through Operation NEON.</p>\n\n<p>While in Ottawa, President Yoon laid a wreath at the National War Memorial and visited the Governor General of Canada, Her Excellency the Right Honourable Mary Simon.</p>\n\n<p>The two leaders looked forward to the 60th anniversary of diplomatic relations between Canada and South Korea in 2023 as a key opportunity to further strengthen the momentum of the Canada-South Korea partnership.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/republic_korea-republique_coree/relations.aspx?lang=eng\">Canada-the Republic of Korea relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/korea-coree/overview-apercu.aspx?lang=eng\">Canada-Korea Free Trade Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/16/president-south-korea-yoon-suk-yeol-visit-canada\">President of South Korea Yoon Suk Yeol to visit Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/23/republic-korea-and-canada-stronger-together-joint-leaders-statement\">The Republic of Korea and Canada: Stronger Together - Joint Leaders’ Statement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/30/prime-minister-justin-trudeau-meets-president-south-korea-yoon-suk-yeol\">Prime Minister Justin Trudeau meets with President of South Korea Yoon Suk Yeol</a></li>\n</ul></div>\n      "
}