{
  "path": "/en/news/readouts/2022/10/18/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss the situation in Haiti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau convened the Incident Response Group with ministers and senior officials to discuss the latest developments on the evolving situation in Haiti.</p>\n\n<p>The group was briefed on the latest developments on the ground in Haiti, including Haitian Prime Minister Ariel Henry’s request for assistance. The Prime Minister and ministers expressed their grave concern over the deteriorating security and the humanitarian crisis in Haiti as armed gangs hinder access to the country’s primary fuel terminal, water, medicine, and other essential goods, amidst an emerging cholera outbreak that has a potential to get worse.</p>\n\n<p>The group was updated on Canada and&nbsp;U.S. contributions to help&nbsp;the&nbsp;Haitian National Police (HNP)&nbsp;protect and serve the Haitian people. A&nbsp;Canadian and U.S. military airlift operation of security equipment, including tactical and armoured vehicles, as well as supplies purchased by the Haitian Government for the HNP in Port-au-Prince, will help to restore security in the country.</p>\n\n<p>The group also discussed additional diplomatic, humanitarian, and stabilization options to support the Haitian people during this crisis, as well as measures to bring accountability to those responsible for it. Departments and agencies represented at the meeting were tasked with&nbsp;assessing&nbsp;further options for Canadian assistance, in cooperation with allies and partners and based on local needs and facts on the ground.</p>\n\n<p>The Prime Minister and ministers conveyed Canada’s ongoing commitment to work closely and collaborate with regional and international partners to support Haiti’s stability and sustainable development, as well as help advance a Haitian-led solution and encourage inclusive political dialogue among Haitian stakeholders.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada-Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/14/prime-minister-justin-trudeau-speaks-president-suriname-chandrikapersad\">Prime Minister Justin Trudeau speaks with President of Suriname Chandrikapersad Santokhi</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-and-united-states-coordinate-delivery-of-haitian-national-police-equipment.html\">Canada and United States coordinate delivery of Haitian National Police equipment</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/chairs-statement-meeting-on-haiti-at-the-general-assembly-of-the-organization-of-american-states.html\">Chairs Statement: Meeting on Haiti at the General Assembly of the Organization of American States</a></li>\n</ul></div>\n      "
}