{
  "path": "/en/news/readouts/2023/01/24/prime-minister-justin-trudeau-meets-mayor-hamilton-andrea-horwath",
  "pageTitle": "Prime Minister Justin Trudeau meets with Mayor of Hamilton Andrea Horwath | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and the Minister responsible for the Federal Economic Development Agency for Southern Ontario, Filomena Tassi, met with the Mayor of Hamilton, Andrea Horwath, to discuss key areas for cooperation.</p>\n\n<p>The leaders talked about making progress on shared priorities, including advancing infrastructure projects and housing and homelessness initiatives. In particular, the Prime Minister and Mayor emphasized the importance of building affordable housing along the Light Rail Transit corridor. They also discussed the 2030 Commonwealth Games.</p>\n\n<p>Mayor Horwath thanked the Prime Minister for recent federal government investments to support people and communities in Hamilton, including a $23.5 million investment for an expansion and sustainability project at John C. Munro Hamilton International Airport and the $400 million investment to support a project by Canada’s largest producer of flat-rolled steel, ArcelorMittal Dofasco, to convert the steel production process and phase out coal-fired steelmaking at its facilities in Hamilton.</p>\n\n<p>The two leaders agreed to continue working together to build a brighter, stronger future for the people of Hamilton.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/office-infrastructure/news/2021/07/canada-and-ontario-invest-in-improved-public-transit-for-residents-of-hamilton.html\">Canada and Ontario invest in improved public transit for residents of Hamilton</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/20/making-housing-more-affordable-canadians\">Making housing more affordable for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2023/01/government-of-canada-is-strengthening-our-supply-chain-with-investments-at-john-c-munro-hamilton-international-airport.html\">Government of Canada is strengthening our supply chain with investments at John C. Munro Hamilton International Airport</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/07/government-investing-in-hamiltons-steel-industry-to-support-good-jobs-and-significantly-reduce-emissions.html\">Government investing in Hamilton’s steel industry to support good jobs and significantly reduce emissions</a></li>\n</ul></div>\n      "
}