{
  "path": "/en/news/statements/2020/11/16/statement-prime-minister-louis-riel-day",
  "pageTitle": "Statement by the Prime Minister on Louis Riel Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Louis Riel Day:</p>\n\n<p>“As we mark the 150th anniversary of the Métis Nation’s entry into Confederation, today we also join the Métis people and all Canadians to honour Louis Riel. The Founder of Manitoba and an elected Member of Parliament, Louis Riel was a great defender of minority rights and the French language. In addition, his struggle to preserve Métis culture paved the way for the Canada we know today.</p>\n\n<p>“Today, through the <a href=\"https://pm.gc.ca/en/canada-metis-nation-accord\">Canada-Métis Nation Accord</a>, the Government of Canada and the Métis Nation are working together to achieve true reconciliation based on a relationship of respect, partnership, and the affirmation of rights. By continuing to move forward on our shared path of reconciliation, we will advance self-determination and self-government for the Métis Nation.</p>\n\n<p>“This year, the global COVID-19 pandemic has highlighted the unique challenges that Indigenous peoples and communities face. That is why the Government of Canada continues to work closely with Métis Nation partners to better respond to the pandemic’s challenges through distinctions-based community solutions. In recent months, we launched the Indigenous Community Support Fund, which is helping support Métis organizations and communities during the pandemic. The government’s response to this health crisis also includes support for Métis businesses through the Indigenous Community Business Fund, as well as funding for Métis Nation early learning and childcare facilities and Métis students pursuing post-secondary education. In addition, the government has allocated funding to respond to urgent mental health needs in Métis communities.</p>\n\n<p>“Today, I encourage all Canadians to recognize Louis Riel’s contributions to the development of Canada and the role that the Métis Nation has played, and continues to play, in building a fairer and more inclusive country.”</p></div>\n      "
}