{
  "path": "/en/news/statements/2019/04/04/statement-prime-minister-70th-anniversary-north-atlantic-treaty",
  "pageTitle": "Statement by the Prime Minister on the 70th anniversary of the North Atlantic Treaty Organization | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 70th anniversary of the North Atlantic Treaty Organization:</p>\n\n<p>“Today, Canada joins our Allies to mark the 70th anniversary of the <a href=\"https://www.nato.int/\">North Atlantic Treaty Organization</a> (NATO), a major milestone for Euro-Atlantic security and for Canada.</p>\n\n<p>“Founded in 1949, NATO has brought countries on both sides of the Atlantic together to build peace, security, and stability, and to uphold the fundamental values of individual liberty, human rights, democracy, and the rule of law. For 70 years, the Alliance has played a crucial role in preventing conflict and preserving peace – from acting as a deterrent during the Cold War, to helping to restore peace in the Balkans, to leading training and security-building efforts in Afghanistan.</p>\n\n<p>“Today, NATO continues to modernize and adapt to respond to changing security threats and new challenges, while holding steadfast to its founding principles. Through its <a href=\"https://www.nato.int/cps/en/natolive/topics_49212.htm\">Open Door Policy</a>, the Alliance welcomes new members who share the desire to work collectively to support the rules-based international order and contribute to Euro-Atlantic security. We look forward to welcoming North Macedonia as the Alliance’s 30th member once its accession process is completed.</p>\n\n<p>“Canada is a proud founding member of this growing community. We have demonstrated strong and active leadership in NATO throughout its history, and will continue to do so. The threats we face today know no borders, and we know that together, we are safer and stronger.</p>\n\n<p>“At the NATO Summit this past July, Canada increased its support to the Alliance. We are leading the multinational enhanced Forward Presence Battle Group Latvia under <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a>, and have rejoined the <a href=\"https://www.canada.ca/en/department-national-defence/news/2018/02/canada_rejoins_natoairbornewarningandcontrolsystemprogram.html\">Airborne Warning and Control System program</a>. We also assumed command of the new <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-impact.html\">NATO training and capacity building mission</a> in Iraq, to help Iraq strengthen its defence and security institutions, and support long-lasting peace and security.</p>\n\n<p>“NATO defends important values that Canadians hold dear. Today, as we celebrate this milestone anniversary, Canada reaffirms its commitment to work with our Allies to build a safer, more peaceful world for our citizens and people around the world.”</p></div>\n      "
}