{
  "path": "/en/news/statements/2017/10/18/statement-prime-minister-global-dignity-day",
  "pageTitle": "Statement by the Prime Minister on Global Dignity Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark Global Dignity Day in Canada:</p><p>“Today, students across Canada and around the world will gather to mark Global Dignity Day.</p><p>“Every person has the potential to transform the world around them for the better. No matter our age, sexual orientation, gender identity, or background, we all deserve to lead a dignified life. &nbsp;&nbsp;</p><p>“The Global Dignity movement inspires young people to be their best selves, and reminds us all of our value, worth, and potential. The challenges we face as individuals are as unique as we are. Today is an opportunity to celebrate those who stand up for their rights and convictions, despite these challenges and because of them.</p><p>“Young people everywhere are making a difference. They are willing to lead, and as courageous as they are curious. Their passion and openness push us further and faster on the path toward a more just, equal, and sustainable world.</p><p>“As one of Global Dignity’s National Role Models, I encourage Canadians to promote dignity for all, not only today, but every day. As the preamble to the Universal Declaration of Human Rights states, ‘recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice, and peace in the world.’</p><p>“On behalf of the Government of Canada, I invite Canadians to participate in Global Dignity Day events across the country. I thank the Global Dignity Organization and its partners for organizing this special day and congratulate everyone involved.”</p></div>\n      "
}