{
  "path": "/en/news/statements/2018/05/15/statement-prime-minister-birth-his-royal-highness-prince-louis-cambridge",
  "pageTitle": "Statement by the Prime Minister on the birth of His Royal Highness Prince Louis of Cambridge | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the birth of Their Royal Highnesses The Duke and Duchess of Cambridge’s third child:</p>\n\n<p>“Canadians were delighted to hear that Their Royal Highnesses The Duke and Duchess of Cambridge welcomed a new baby boy into their family, His Royal Highness Prince Louis of Cambridge.</p>\n\n<p>“We have had the pleasure of hosting The Duke and Duchess of Cambridge on two royal tours, including their most recent visit when Prince George and Princess Charlotte were introduced to the beauty of Canada’s west coast. We all look forward to Prince Louis joining the family on a future tour.</p>\n\n<p>“To celebrate the birth of the Prince, Canada will donate $50,000 to&nbsp;<a href=\"https://www.jack.org/\">Jack.org</a>, a national network of young people in Canada who are leading important conversations on mental health. The organization supports 2,500 student leaders to bring awareness around mental health issues, break down stigma, and make sure students can get the help they need. We will also donate $50,000 to&nbsp;<a href=\"https://stellasplace.ca/\">Stella’s Place</a>, an organization that helps young adults better understand their mental health and how to manage it. In addition, we are gifting Prince Louis a traditional Haida blanket – a memento of his parents’ recent visit to Haida Gwaii.&nbsp;</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I extend our heartfelt congratulations to Their Royal Highnesses The Duke and Duchess of Cambridge and the Royal Family.”</p></div>\n      "
}