{
  "path": "/en/news/news-releases/2019/11/29/prime-minister-announces-changes-senate-leadership",
  "pageTitle": "The Prime Minister announces changes to the Senate leadership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Peter Harder, Government Representative in the Senate, and Grant Mitchell, Government Liaison in the Senate, will be stepping down from their positions.</p>\n\n<p>In April 2016, Senator Harder was the first independent Senator appointed under the merit-based selection process open to Canadians. During his time as Government Representative, he maintained a strong focus on non-partisan collaboration, and worked tirelessly to advance the government’s legislative agenda in the Senate. Senator Harder will step down from this role on December 31<sup>st</sup> 2019, and his replacement will be named in due course.</p>\n\n<p>Senator Mitchell was appointed to the Senate in 2005 after a distinguished career in public service, business, and politics in Alberta. He became Government Liaison in the Senate in May 2016, and has made important contributions to Senate reform. Senator Mitchell will continue as Government Liaison until a replacement is named for Senator Harder.</p>\n\n<p>Thanks to the work of Senator Harder and Senator Mitchell – alongside the former Legislative Deputy, Senator Diane Bellemare – the Senate is in a stronger position than ever to serve Canadians from coast to coast to coast. All three Senators will continue to sit in the Upper House, and to be a strong voice for their regions – Ontario, Alberta, and Quebec – and for all Canadians.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Senator Harder and Senator Mitchell led the Senate through a historic period of modernization. They played a vital role examining legislation and advocating for a transparent and accountable Senate that works for all Canadians. I thank them for their outstanding work and service.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government Representative in the Senate, the Government Liaison in the Senate, and the Legislative Deputy to the Government Representative make up the Government Representative Office. This team promotes a vision of an &nbsp;independent, accountable, and transparent Senate.</li>\n\t<li>The Government Representative in the Senate is the first point of contact between the Government and the Senate, working to move government bills through the Upper House and champion renewal of the institution.</li>\n\t<li>The Government Liaison is responsible for outreach on government business in the Senate, and ensures that Senators have the information they need in anticipation of votes.</li>\n\t<li>In 2016, the selection process for Senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n</ul></div>\n      "
}