{
  "path": "/en/news/news-releases/2022/01/24/10-day-child-care-families-nunavut",
  "pageTitle": "$10-a-day child care for families in Nunavut | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every child deserves the best possible start in life, and all parents should have the ability to build both a family and career. Yet, too many families across Canada lack access to affordable, inclusive, and high-quality child care. The COVID-19 pandemic has also made it clear that without access to child care, too many parents – especially women – cannot fully participate in the workforce.</p>\n\n<p>That is why the Government of Canada has laid out a plan to provide Canadian parents with, on average, $10‑a‑day child care spaces for children under six years old. This plan to build a Canada‑wide, community‑based early learning and child care system will make life more affordable for families, create new jobs, get parents back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, virtually joined the Premier of Nunavut, P.J.&nbsp;Akeeagok, today to announce an agreement that will support an average of $10‑a‑day licensed child care in the territory by March 2024, two years ahead of the federal target. By the end of 2022, parent fees for licensed child care will be reduced by 50 per cent on average, saving families hundreds of dollars per month. This would mean a family in Iqaluit would save an estimated total of up to $14,000 per year on child care fees. This will apply to parents with children up to six years old in licensed child care spaces.</p>\n\n<p>Through the agreement, the governments of Canada and Nunavut will work together to improve access to quality, affordable, flexible, and inclusive early learning and child care programs and services. This includes creating 238 new licensed early learning and child care spaces by the end of March 2026, with federal funding of $66&nbsp;million over five years.</p>\n\n<p>This agreement will fund critical services, and grow a strong and skilled workforce of early childhood educators, including through the creation of a wage grid and greater opportunities for training and professional development. Nunavut is also proposing to invest up to 25 per cent of the federal funding on increased wages for early childhood educators. Additionally, the agreement will support a child care system that is fully inclusive of children with disabilities and children needing enhanced or individual supports, and ensures all families have equitable access to high-quality, affordable child care no matter where in the territory they live.</p>\n\n<p>The agreement also includes a clear commitment to continue to work collaboratively with representative Inuit organizations to ensure that all children in the territory have access to Inuit-specific Indigenous early learning and child care.</p>\n\n<p>Since 2015, the federal government has been helping make life more affordable for families. This includes programs like the Canada Child Benefit (CCB), which is increased annually to help families keep up with the costs of living and raising their children. The CCB puts more money into the pockets of nine out of 10 Canadian families with children and has helped lift 435,000 children out of poverty. The time for a Canada-wide early learning and child care system is now. The Government of Canada will continue to work with territories, provinces, and Indigenous partners across the country to make life easier and more affordable for families, grow the middle class, create jobs, help parents return to the workforce, and give children across the country a better start in life.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to affordable child care. That is why we’re making $10‑a‑day child care a reality across the country. Today’s agreement with Nunavut is an important step forward to delivering on our Canada-wide early learning and child care system, which will save families thousands of dollars each year, create jobs, grow the middle class, and give our kids the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The investments that we make into early learning opportunities for our children today determine our future. Safe, reliable, and affordable child care will not only yield positive outcomes in our children’s development, but it will also help families make ends meet. By the end of 2022, parents will see their daycare fees cut by half, and by March 2024, these fees will be reduced to $10 per day.”</p>\n\n<footer class=\"default\">The Hon. P.J. Akeeagok, Premier of Nunavut</footer>\n</blockquote>\n\n<blockquote>\n<p>“Affordable, high-quality child care is both an economic and social policy. It gives our children the best possible start in life and enables mothers and fathers to work, thereby increasing our workforce and growing the economy. Fee reductions in the coming year and the eventual average of $10 a day will deliver thousands of dollars of savings to families with young children in Nunavut. This agreement with the Government of Nunavut will help families with the cost of living and strengthens our plan to ensure Canada has a strong recovery that leaves no one behind.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, Nunavut joins eleven other provinces and territories as we build our Canada-wide early learning and child care system, working towards an average of $10-a-day child care by March 2026. This historic agreement will grow a strong and skilled early childhood educator workforce, and is another important step on the path to ensuring all families have access to high-quality, affordable, flexible, and inclusive early learning and child care, no matter where they live.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Better access to affordable, high-quality, and culturally relevant child care has the potential to greatly improve the lives of Nunavummiut. It means a solid foundation for our children, greater employment opportunities, increased income for families, and the creation of more Inuktut language resources for child care facilities. The investment and commitments made in today’s agreement will have positive, long-lasting effects, not just for our children and families, but for all of Nunavut.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Pamela Gross, Nunavut’s Minister of Education</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In addition to today’s announcement, the Government of Canada has reached early learning and child care agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta\">Alberta</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/13/10-day-child-care-families-new-brunswick\">New Brunswick</a>, and the <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/15/10-day-child-care-families-northwest-territories\">Northwest Territories</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> last year to strengthen the early learning and child care system in the province.</li>\n\t<li>The 238 new licensed spaces in Nunavut will be among licensed not-for-profit and family-based child care providers.</li>\n\t<li>In addition to the federal contribution, Nunavut currently invests nearly $4.3&nbsp;million in early learning and child care annually.</li>\n\t<li>The governments of Canada and Nunavut will create an implementation committee that will monitor progress on child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>As part of Budget&nbsp;2021, the Government of Canada made a transformative investment of over $27&nbsp;billion over five years to build a Canada-wide early learning and child care system with territories and provinces. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Dedicated Inuit early learning and child care funding is being implemented in partnership with Nunavut Tunngavik Incorporated and the regional Inuit associations in Nunavut, who are stakeholders and funders in the territory’s child care system, to advance the vision and priorities identified in the co-developed <a href=\"https://www.canada.ca/en/employment-social-development/programs/indigenous-early-learning/2018-framework.html\">Indigenous Early Learning and Child Care Framework</a>.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 1,000 spaces in Nunavut.</li>\n\t<li>Investments in child care will benefit all Canadians. Studies show that for every dollar invested&nbsp;in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n\t<li>To promote greater gender equality at home and in the workplace, the Government of Canada has also introduced the Parental Sharing Benefit in 2019. This measure provides an additional five weeks of Employment Insurance parental benefits when parents – including adoptive and same-sex parents – agree to share parental benefits.</li>\n\t<li>In addition to these investments, the Government of Canada is directly supporting parents, no matter how they choose to care for their children, through the Canada Child Benefit (CCB).</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada Child Benefit (CCB)</a></li>\n</ul></div>\n      "
}