{
  "path": "/en/news/statements/2015/12/08/statement-prime-minister-canada-after-delivering-speech-assembly-first",
  "pageTitle": "Statement by the Prime Minister of Canada after delivering a speech to the Assembly of First Nations Special Chiefs Assembly | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement after delivering a speech today to the Assembly of First Nations Special Chiefs Assembly in Gatineau, Quebec.</p>\n<p>“There is no relationship more important to me – and to Canada – than the one with First Nations, the Métis Nation, and Inuit.</p>\n<p>“It is time for a renewed, nation-to-nation relationship with First Nations peoples: one that is based on the understanding that the constitutionally-guaranteed rights of First Nations are a sacred obligation that we carry forward. This obligation is based on respect, co-operation, and partnership; it is guided by the spirit and intent of the original treaty relationship; and it respects inherent rights, treaties and jurisdictions, and the decisions of our courts.</p>\n<p>“Bringing about real change will take more than just individual people – or even individual governments. What is needed is nothing less than a total renewal of the relationship between Canada and the First Nations peoples.</p>\n<p>“I am also proud to say that, as promised, we have begun the process to create a national public inquiry into missing and murdered Indigenous women and girls in Canada.</p>\n<p>“A priority moving forward will be to make significant investments in First Nations education. We will deliver increased funding for First Nations education and we will work on education reforms for First Nations children that are led by First Nations.</p>\n<p>“We will lift the two per cent cap on funding for First Nations programs. It is time for a new fiscal relationship with First Nations that gives these communities sufficient, predictable, and sustained funding.</p>\n<p>“In partnership with Indigenous communities, the provinces, territories, and other vital partners, we will also fully implement the calls to action of the Truth and Reconciliation Commission, starting with the implementation of the United Nations Declaration on the Rights of Indigenous Peoples.&nbsp;&nbsp;</p>\n<p>“Finally, we will conduct a full review of the legislation unilaterally imposed on Indigenous peoples by earlier governments.</p>\n<p>“Working together as partners, I am confident that we can make meaningful and immediate progress on the issues that matter most to First Nations communities.”</p></div>\n      "
}