{
  "path": "/en/news/readouts/2022/11/12/prime-minister-justin-trudeau-meets-prime-minister-cambodia-hun-sen",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Cambodia Hun Sen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Cambodia, Hun Sen, on the margins of the Association of Southeast Asian Nations (ASEAN) Summit.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Hun Sen on a successful year as ASEAN host. He thanked him for inviting him to join this year’s ASEAN Summit as guest of the chair and for convening the Canada-ASEAN 45th Anniversary Commemorative Summit. Prime Minister Trudeau also expressed appreciation for Prime Minister Hun Sen’s support for Canada’s efforts to deepen its relationship with ASEAN through the commitment to establish a Strategic Partnership.</p>\n\n<p>The leaders talked about the growing trade ties between Canada and Cambodia, and the fact that a Canada-ASEAN free-trade agreement would help drive prosperity and create good jobs in both our countries and across the region.</p>\n\n<p>Prime Minister Trudeau discussed the upcoming release of Canada’s Indo-Pacific Strategy and the central role that ASEAN will play in our work to strengthen our engagement and partnerships in the region.</p>\n\n<p>The prime ministers exchanged views on Russia’s unjustifiable invasion of Ukraine and the severe impacts the conflict is having on food, fuel, and energy security in the Indo-Pacific region. Prime Minister Trudeau committed to working with Cambodia and ASEAN partners on mitigating the effects of the crisis, especially on the most vulnerable.</p>\n\n<p>The leaders discussed the long-standing ties between Canada and Cambodia and Canada’s history of support on landmine clearance. They agreed to keep in touch to discuss the deepening of regional cooperation, ensure greater sustainable development, and protect human rights.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/cambodia-cambodge/index.aspx?lang=eng\">Canada and Cambodia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/08/08/statement-prime-minister-marking-asean-day-and-45-years-partnership\">Statement by the Prime Minister marking ASEAN Day and 45 years of partnership with the Association of Southeast Asian Nations</a></li>\n</ul></div>\n      "
}