{
  "path": "/en/news/news-releases/2020/03/23/prime-minister-announces-support-farmers-and-agri-food-businesses",
  "pageTitle": "Prime Minister announces support for farmers and agri-food businesses under Canada’s response to COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian farmers and food businesses work hard so Canadians have quality food on their grocery store shelves and kitchen tables. In these times of uncertainty, it is more important than ever to make sure that they are supported so they can continue providing the good, healthy food that nourishes our families.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced important new measures to support farmers and agri-food businesses in Canada facing financial hardship due to the impacts of the COVID-19 pandemic.</p>\n\n<p>Farm Credit Canada will receive support from the Government of Canada that will allow for an additional $5 billion in lending capacity to producers, agribusinesses, and food processors. This will offer increased flexibility to farmers who face cashflow issues and to processors who are impacted by lost sales, helping them remain financially strong during this difficult time.</p>\n\n<p>In addition, all eligible farmers who have an outstanding Advance Payments Program (APP) loan due on or before April 30 will receive a Stay of Default, allowing them an additional six months to repay the loan. This important measure, which represents $173 million in deferred loans, will help keep more money in farmers’ pockets during these critical months.</p>\n\n<p>The Stay of Default will also provide farmers the flexibility they need to manage their cashflow when facing lower prices or reduced marketing opportunities. Applicable farmers who still have interest-free loans outstanding will have the opportunity to apply for an additional $100,000 interest-free portion for 2020-2021, as long as their total APP advances remain under the $1 million cap.</p>\n\n<p>The Government of Canada remains committed to supporting Canada’s agricultural sector to ensure that farmers and businesses have the support they need to provide for their families and all Canadians during this critical time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Farmers and food producers work hard to put food on tables across our country, and they should not have to worry about being able to afford their loan payments or having enough money to support their own families. We are taking action now to give them more flexibility to meet the challenges ahead in these times of uncertainty.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Like many Canadians, I am truly grateful for our farmers and food business owners and employees, who continue working hard so we all have quality food on our grocery store shelves and kitchen tables. Their continued work is essential to our plan to manage COVID-19. The measures announced today will provide farmers and food producers across the country with important financial flexibility they will need during these challenging times.”</p>\n\n<footer class=\"default\">The Hon. Marie-Claude Bibeau, Minister of Agriculture and Agri-Food&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Grains, oilseeds, and pulse producers who participated in the 2018 Stay of Default <a href=\"https://www.canada.ca/en/agriculture-agri-food/news/2019/08/crop-producers-granted-extension-to-repay-cash-advances.html\">announced this summer</a>, are encouraged to contact their administrator for more details. Cattle, bison, flower, and potted plant producers should also contact their APP administrator to enquire about their eligibility for the Stay of Default.</li>\n\t<li>The <a href=\"http://www.agr.gc.ca/eng/agricultural-programs-and-services/advance-payments-program/?id=1462198969862\">Advance Payments Program</a> is a financial loan guarantee program that provides producers easy access to credit through cash advances. For the 2019 program year, there are over 21,000 producers participating and over $3 billion in advances.</li>\n\t<li>Administrators participating in the Stay of Default are the Alberta Sugar Beet Growers, Alberta Wheat Commission, BC Breeder and Feeder Association, Canadian Canola Growers Association, Manitoba Corn Growers Association Inc., Manitoba Livestock Cash Advance Inc., Western Cash Advance Program Inc., PEI Federation of Agriculture, and the Agricultural Credit Corporation.</li>\n\t<li>Farm Credit Canada is our country’s leading agriculture and food lender, with a healthy loan portfolio of more than $38 billion. The Crown corporation provides flexible, competitively priced financing, management software, information, and knowledge specifically designed for the agriculture and food industries.&nbsp;</li>\n\t<li>Farmers will continue to have support under the <a href=\"http://www.agr.gc.ca/eng/about-our-department/key-departmental-initiatives/canadian-agricultural-partnership/?id=1461767369849\">Canadian Agricultural Partnership</a>. The comprehensive suite of business risk management programs are designed to help manage significant financial impacts and risks beyond farmers’ control.</li>\n\t<li>The new deadlines for outstanding Advance Payments Program loans are as follows:\n\t<ul>\n\t\t<li>September 30, 2020: 2018 cash advances for grains, oilseeds, and pulses.</li>\n\t\t<li>September 30, 2020: 2018 cash advances for cattle and bison.</li>\n\t\t<li>October 31, 2020: 2019 cash advances on flowers and potted plants.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update.html\">Helping Canadians with the economic impact of the COVID-19 Pandemic</a></li>\n\t<li><a href=\"http://www.agr.gc.ca/eng/programs-and-services/advance-payments-program/?id=1462198969862\" title=\"Advance Payments Program\">Advance Payments Program</a></li>\n\t<li><a href=\"https://www.fcc-fac.ca/en/covid-19.html\">Farm Credit Canada </a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}