{
  "path": "/en/news/statements/2022/09/08/statement-prime-minister-international-literacy-day",
  "pageTitle": "Statement by the Prime Minister on International Literacy Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Literacy Day:</p>\n\n<p>“Today, on <a href=\"https://www.unesco.org/en/days/literacy-day\">International Literacy Day</a>, we raise awareness of the importance of being able to read and write, and we recognize all those who work tirelessly to make sure education is accessible for everyone, both at home and abroad.</p>\n\n<p>“This year’s theme, ‘Transforming Literacy Learning Spaces’, invites us to ensure people around the world can access quality, equitable, and inclusive education. Literacy provides a foundation for lifelong success. By embracing a variety of learning spaces – including digital learning spaces – we can reduce barriers to learning, encourage ongoing education, and ensure no one is left behind.</p>\n\n<p>“Last year, the Government of Canada introduced the <a href=\"https://www.canada.ca/en/services/jobs/training/initiatives/skills-success.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_skills-success\">Skills for Success </a>program, which helps adult Canadians improve their literacy, numeracy, and digital skills so they can succeed in today’s and tomorrow’s economy. As we recover from the COVID‑19 pandemic, we will continue to create new training opportunities for Canadians and build a stronger workforce from coast to coast to coast.</p>\n\n<p>“As Co-Chair of the United Nations Sustainable Development Goals Advocates Group, I&nbsp;am working to advance quality education and gender equality at home and abroad. As a result of the pandemic, nearly 24&nbsp;million learners worldwide might never return to formal education, including 11&nbsp;million young women and girls. To promote access to quality education and lifelong learning for children and youth who are refugees, experience other forms of displacement, or are living in host communities, the Government of Canada launched the <a href=\"https://www.international.gc.ca/campaign-campagne/together-learning-ensemble-apprentissage/index.aspx?lang=eng\">Together for Learning</a> campaign in 2021. Our efforts are helping address the gender gap in literacy and achieving increases in literacy rates where they are most needed.</p>\n\n<p>“On behalf of the Government of Canada, I thank all those who work to promote and improve access to quality education, here in Canada and around the world. Literacy is a fundamental human right, and we will continue to work to close the gaps in access to education and build a better, fairer, and more prosperous future for everyone.”</p></div>\n      "
}