{
  "path": "/en/news/readouts/2020/02/21/prime-minister-justin-trudeau-convenes-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss work underway to end the blockades and restore rail service across the country, and updates on the Ukraine International Airlines tragedy and the novel coronavirus (COVID-19).&nbsp; The Prime Minister and the Deputy Prime Minister met with ministers, the RCMP Commissioner, and Government of Canada officials who have been working around the clock to resolve these significant issues facing the country.</p>\n\n<p>The Prime Minister and Deputy Prime Minister updated the group on their continued work to end the blockades. The Prime Minister spoke about his call yesterday with the Council of the Federation, during which he and the premiers talked about the very real impacts the blockades are having on people and businesses across the country. They are focused on restoring fully functional rail service to the country and are actively looking at options to resolve the situation, while remaining committed to building trust and respect among all parties involved.</p>\n\n<p>Minister of Transport Marc Garneau updated the group on the economic impacts of the blockades on Canadian farmers, businesses, and families. Minister of Crown-Indigenous Relations Carolyn Bennett and Minister of Indigenous Services Marc Miller discussed their ongoing outreach to Indigenous leaders across the country. They noted that the repeated offers to meet with Wet’suwet’en hereditary chiefs to address immediate and long-term issues have not yet been accepted. Minister of Public Safety and Emergency Preparedness Bill Blair provided an overview of the current situation, while emphasizing the critical importance of police independence to ensure trust in our institutions. With RCMP Commissioner Brenda Lucki, he updated the Prime Minister and ministers on current RCMP operations, including their offer to withdraw from Wet’suwet’en territory to encourage an open dialogue.</p>\n\n<p>The Prime Minister and ministers will continue to work directly with premiers and Indigenous leaders to resolve this situation as soon as possible. The Government of Canada’s priority remains to resolve it peacefully, while protecting the rule of law in our country.</p>\n\n<p>The Prime Minister and members of the Incident Response Group also discussed Canada’s continued efforts to help families affected by the Ukraine International Airlines flight PS752 tragedy. Officials from Global Affairs Canada updated the group on the status of consular assistance, including ongoing support for families. Minister Garneau provided an update on the state of the investigation and the need for a transparent analysis of the black box data. The ministers re-iterated the need to work on all fronts to support the grieving families and bring them justice and accountability. They also discussed the work being done to develop a Safer Skies Strategy, which will bring together partners to establish a common set of practices to better protect passengers from the risk of flying in or near foreign conflict zones.</p>\n\n<p>The Prime Minister and members of the Incident Response Group also received an update on cases of COVID-19 in Canada and internationally from Minister of Health Patty Hajdu. The group was briefed on the release from quarantine of Canadians repatriated earlier this month from Wuhan, China, including an overview of the efforts by local, provincial, and territorial health authorities, Canadian Armed Forces personnel, and many others to provide support at Canadian Forces Base Trenton in Ontario.&nbsp; Ministers and officials will remain in close contact with domestic and international partners, including G7 Health Ministers, to prevent and limit the spread of the virus and to protect the health and safety of all Canadians.</p>\n\n<p>Minister Hajdu and Canada’s Chief Public Health Officer Dr. Theresa Tam briefed the group on the repatriation of Canadian passengers who had been quarantined aboard the <em>Diamond Princess</em> cruise ship. They have now arrived at the NAV Canada Training Institute in Cornwall, Ontario, where they will remain in isolation for 14 days. The group highlighted that while prevention and containment measures have been effective in delaying the spread of the virus in Canada, this global outbreak requires all travellers to monitor their own health and seek medical attention should they begin experiencing symptoms.</p>\n\n<p>Deputy Prime Minister Chrystia Freeland, Minister of Crown-Indigenous Relations Carolyn Bennett, Minister of Transport Marc Garneau, Minister of Health Patty Hajdu, Leader of the Government in the House of Commons and Quebec Lieutenant Pablo Rodriguez, Minister of Public Safety and Emergency Preparedness Bill Blair, and Minister of Indigenous Services Marc Miller participated in the meeting, along with RCMP Commissioner Brenda Lucki and Government of Canada officials.</p></div>\n      "
}