{
  "path": "/en/news/statements/2022/05/03/statement-prime-minister-world-press-freedom-day",
  "pageTitle": "Statement by the Prime Minister on World Press Freedom Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Press Freedom Day:</p>\n\n<p>“Today, on World Press Freedom Day, we honour the many journalists here in Canada and around the world who work tirelessly to seek out and report on the truth. We also reaffirm our longstanding commitment to the freedom of the press – a foundational pillar of our democracy – and recognize those who have been injured or lost their lives defending freedom of the press.</p>\n\n<p>“While Canada enjoys a strong and free press, we know that this is not the case everywhere – many journalists face censorship, intimidation, violence, imprisonment, and false arrests. This year alone, many journalists were killed and hundreds imprisoned in the line of duty around the world. This serves as reminder that we must continue to advocate for journalists and for a strong and free press.</p>\n\n<p>“As Russia continues its illegal and unjustifiable invasion of Ukraine, we thank the reporters on the front lines who are risking their lives to deliver accurate information to the world. In the age of disinformation and misinformation, independent, fact-based reporting is vital. We must all come together to support the work of journalists and double down in the fight against disinformation.</p>\n\n<p>“The Government of Canada is supporting media freedom at home and abroad. As co-chair of the <a href=\"https://mediafreedomcoalition.org\">Media Freedom Coalition</a> and as 2022 Chair of the Freedom Online Coalition, Canada is working with international partners to defend media freedom. We are also addressing the challenges and the spread of disinformation online by giving people the tools to recognize disinformation and working to build a healthy information ecosystem, including through the <a href=\"https://www.canada.ca/en/canadian-heritage/services/online-disinformation.html\">Digital Citizen Initiative</a> and new investments in Budget&nbsp;2022 to fight disinformation. Canada is also providing $13.4&nbsp;million over five years to bolster the G7 Rapid Response Mechanism (RRM), which strengthens coordination between countries in identifying, and responding to, foreign threats to democracy, including state-sponsored disinformation.</p>\n\n<p>“On this World Press Freedom Day, we pay tribute to the many journalists who have been injured, or lost their lives defending freedom of the press. We recognize the journalists risking their lives every day in treacherous environments – including on the frontlines of wars – to report freely on matters of public interest. I encourage all Canadians to recognize the important work of journalists and media workers, and I thank them for their relentless pursuit of the truth and their commitment to share those truths with us.”</p></div>\n      "
}