{
  "path": "/en/news/statements/2022/12/14/statement-prime-minister-formation-new-government-latvia",
  "pageTitle": "Statement by the Prime Minister on the formation of a new government in Latvia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the formation of a new government in Latvia:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Krišjānis Kariņš on his re-appointment as Prime Minister of Latvia and on the formation of a new government.</p>\n\n<p>“Canada and Latvia’s relationship is rooted in strong ties between our peoples and in shared values of freedom, democracy, and the rule of law. As NATO Allies, we work together to protect transatlantic security, most notably through the Canadian-led NATO enhanced Forward Presence, which has approximately 700 Canadian troops on the ground in Latvia. I have had the pleasure of meeting with these troops on several occasions to thank them for their bravery and dedication – a testament to Canada’s enduring commitment to Latvia and the region.</p>\n\n<p>“Our countries also enjoy a strong trading relationship through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which helps create jobs and promote economic growth that benefits everyone on both sides of the Atlantic.</p>\n\n<p>“Canada remains committed to collaborating with Latvia and other allies to support Ukraine as it defends itself against Russia’s unprovoked and unjustifiable invasion. Together, we will work to defend democracy and deter threats to global stability.</p>\n\n<p>“I look forward to continuing to work with Prime Minister Kariņš to deepen our already strong bilateral relationship and make further progress on the issues that matter to people in both our countries, in Europe, and globally. As announced this summer, we will continue to strengthen our presence at our embassy in Latvia, while advancing European and transatlantic peace and security, expanding trade and investment, and promoting innovation and scientific cooperation.”</p></div>\n      "
}