{
  "path": "/en/news/statements/2021/12/24/statement-prime-minister-christmas",
  "pageTitle": "Statement by the Prime Minister on Christmas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Christmas:</p>\n\n<p>“Merry Christmas, Canada! Today, our family joins Christians across the country and around the world to celebrate the birth of Jesus Christ and his message of compassion, love, and selflessness.</p>\n\n<p>“As a family, we usually gather for meals with loved ones, exchange gifts around the Christmas tree, and most importantly, create memories together. This is also a day to reflect on the many contributions that Christians have made – and continue to make – to communities across the country. This holiday season, like last year’s, we continue to deal with the impacts of the COVID-19 pandemic. Yet, we have seen Canadians continue to meet these challenging times with generosity, kindness, and hope, and find different ways to celebrate, help those in need, and give back to the community.</p>\n\n<p>“Today, we look back on the challenges of this past year and reflect on the progress we have made. This year marked the beginning of the most extensive immunization campaign in our country’s history. As we finish the fight against COVID-19, let’s continue to follow public health guidance as we celebrate Christmas, so we can keep our communities and our front-line heroes safe. For those who have not already done so, I encourage all eligible Canadians to get their vaccines and booster shots.</p>\n\n<p>“During the holidays, we also take time to remember our brave Canadian Armed Forces members serving here in Canada and overseas. They continue to make extraordinary sacrifices to keep us safe, defend our values, and protect our way of life.</p>\n\n<p>“From our family to yours, Hadrien, Ella-Grace, Xavier, Sophie, and I wish you happiness, health, and peace this holiday season. Merry Christmas and all the best in 2022.”</p></div>\n      "
}