{
  "path": "/en/news/news-releases/2022/01/20/prime-minister-announces-members-national-security-and-intelligence",
  "pageTitle": "Prime Minister announces members of the National Security and Intelligence Committee of Parliamentarians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians count on our national security and intelligence community to keep communities safe and respond to evolving threats while upholding the rights and freedoms of all citizens. That is why the Government of Canada established the National Security and Intelligence Committee of Parliamentarians in 2017. The Committee has produced a number of comprehensive and well-received reports on issues such as foreign interference as well as diversity and inclusion within the security and intelligence community.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced members of the National Security and Intelligence Committee of Parliamentarians for the 44th Parliament. The multi-party Committee includes representatives from both the House of Commons and the Senate. All recognized party leaders in the House of Commons and all leaders and facilitators in the Senate were consulted ahead of the appointments. The Leader of the Official Opposition chose not to recommend the participation of any Conservative Members of Parliament.</p>\n\n<p>Chaired by the Honourable David J. McGuinty, P.C., Member of Parliament for Ottawa South, since its launch in 2017, the Committee uses a non-partisan approach to review national security and intelligence activities carried out across government to ensure that the legislative, regulatory, policy, administrative, and financial framework for national security and intelligence is sound. This includes activities undertaken by the Canada Border Services Agency, the Communications Security Establishment, the Canadian Security Intelligence Service, the Department of National Defence and the Canadian Armed Forces, Global Affairs Canada, and the Royal Canadian Mounted Police, among many others.</p>\n\n<p>With a focus on issues of accountability, efficacy, and democratic principles, the Committee provides the Prime Minister with an annual report, and special reports when needed. These reports, which include findings and recommendations, are then tabled by the Prime Minister in both the House of Commons and the Senate.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“National security and the protection of democracy are top priorities for the government, and that’s why the National Security and Intelligence Committee of Parliamentarians plays a key role to keep Canadians safe in a transparent manner while safeguarding the rights, values, and freedoms that define our way of life. Together, we will continue to work with Committee members and all parliamentarians to ensure the strength and accountability of our national security and intelligence community and its practices.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The members of the National Security and Intelligence Committee of Parliamentarians are:\n\t<ul>\n\t\t<li>Stéphane Bergeron, Bloc Québécois</li>\n\t\t<li>Don Davies, NDP</li>\n\t\t<li>The Honourable Dennis Dawson, Senate</li>\n\t\t<li>Iqra Khalid, Liberal</li>\n\t\t<li>The Honourable Frances Lankin, P.C., C.M., Senate</li>\n\t\t<li>Patricia Lattanzio, Liberal</li>\n\t\t<li>James Maloney, Liberal</li>\n\t\t<li>The Honourable David J. McGuinty, P.C., Liberal (Chair)</li>\n\t\t<li>The Honourable Vernon White, Senate</li>\n\t</ul>\n\t</li>\n\t<li>The Committee was first created under the&nbsp;<a href=\"https://laws-lois.justice.gc.ca/eng/AnnualStatutes/2017_15/FullText.html\"><em>National Security and Intelligence Committee of Parliamentarians Act</em></a>, which came into force on October 6, 2017. It is dissolved at the end of each session of Parliament, and new members are appointed after the new session opens.</li>\n\t<li>The Secretariat of the National Security and Intelligence Committee of Parliamentarians assists the Committee in fulfilling its review mandate.</li>\n\t<li>The Government of Canada anticipates the Committee’s forthcoming reports on the federal policing mandate of the Royal Canadian Mounted Police, the national security and intelligence activities of Global Affairs Canada, and other important subjects related to national security.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.nsicop-cpsnr.ca/index-en.html\">National Security and Intelligence Committee of Parliamentarians</a></li>\n</ul></div>\n      "
}