{
  "path": "/en/news/statements/2020/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p>\n\n<p>“Disability inclusion is about creating communities, spaces, services, and supports that allow everyone to fully and equally participate in society. Over one in five Canadians have one or more disabilities, and they deserve to live in a country that is free of barriers and discrimination. Only together can we build a Canada that is fairer and more inclusive for everyone. &nbsp;</p>\n\n<p>“On the <a href=\"https://www.un.org/en/observances/day-of-persons-with-disabilities\">International Day of Persons with Disabilities</a>, we honour all Canadians with visible and non-visible disabilities who continue to break down stigma and stereotypes to help us create a more accessible and disability-inclusive society. Today, we also reaffirm our commitment to build a Canada where no one is left behind. &nbsp;&nbsp;</p>\n\n<p>“The global COVID-19 pandemic has disproportionately affected Canadians with disabilities, and highlighted some long-standing challenges. Recognizing the potential for greater health risks, financial hardships, and barriers to accessing services, the Government of Canada created the COVID-19 Disability Advisory Group. Comprised of experts in disability inclusion, the Advisory Group has advised the government on disability-specific issues, challenges, and systemic gaps as well as on the best measures and strategies to address them. The government provided additional support, including a special one-time, tax-free payment to help Canadians with disabilities cover extra expenses during the pandemic. We are also helping to improve workplace accessibility and access to jobs by investing $15 million to create a National Workplace Accessibility Stream as part of the Opportunities Fund for Persons with Disabilities. And in this week’s Fall Economic Statement, we invested an additional $65 million in the Opportunities Fund in 2021-22, which will further support training and career advancement for persons with disabilities.</p>\n\n<p>“Over the past five years, the Government of Canada has taken major steps to ensure people with disabilities in Canada have equal rights, opportunities, and chances at success. Last year, the <em><a href=\"https://www.canada.ca/en/employment-social-development/news/2019/07/canadas-first-federal-accessibility-legislation-comes-into-force.html\">Accessible Canada Act</a> </em>came into force. This historic Act – developed following extensive consultations with the disability community – established new organizations and processes for developing future standards and regulations that will help create a barrier-free Canada for people with disabilities. The government will also work to bring forward a Disability Inclusion Action Plan, including a new Canadian Disability Benefit, an employment strategy, and a better process to determine eligibility for disability programs and benefits. While we have made important progress, we also know that the work does not stop here and that there is much more to be done to provide equal opportunity for Canadians with disabilities.</p>\n\n<p>“Canada will also continue to protect and promote the rights of people with disabilities around the world. A decade ago, we ratified the United Nations Convention on the Rights of Persons with Disabilities and, in 2018, we went even further by acceding to the Optional Protocol. At the 2018 Global Disability Summit, Canada announced a series of commitments to help ensure the meaningful inclusion and participation of people with disabilities in international assistance efforts. Today, we continue to be an active supporter of disability rights in international forums, including as part of the Global Action on Disability Network.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me&nbsp;in celebrating the contributions and accomplishments of people living with disabilities. As we build a fairer and more resilient Canada, let us all strive to achieve a more inclusive and barrier-free society for everyone.”</p></div>\n      "
}