{
  "path": "/en/news/news-releases/2018/10/02/government-canada-welcomes-largest-private-sector-investment-project",
  "pageTitle": "Government of Canada welcomes largest private sector investment project in Canadian history | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2>LNG Canada announces 40 billion dollar investment that will lead to 10,000 middle class jobs</h2><p>Canada is a country that understands that environmental leadership and economic growth go hand-in-hand. With modern infrastructure and cleaner technology to get our resources to new markets, we can diversify our trade, grow our economy, and create good, well-paying jobs for middle-class Canadians.</p><p>The Prime Minister, Justin Trudeau, today welcomed LNG Canada’s decision to build a major liquefied natural gas (LNG) project in Kitimat, British Columbia. The $40-billion project represents the largest private sector investment project in the history of the country, which will:</p><ul><li>Create 10,000 jobs at the height of construction;</li><li>Lead to billions of dollars in direct government revenues; and</li><li>Include hundreds of millions of dollars in construction contracts for Indigenous businesses.</li></ul><p>In addition, the Prime Minister announced $275&nbsp;million in federal support, as well as a commitment that trade barriers will not get in the way of this generational project.</p><p>The largest infrastructure project of its kind in Canada, it will include a natural gas liquefaction facility, a pipeline, and a marine terminal to export surplus Canadian natural gas to some of the world’s fastest growing economies in Asia.</p><p>Once built, it will have the lowest carbon intensity of any large-scale LNG facility in the world.</p><h3>Quote</h3><blockquote><p>“Today’s announcement by LNG Canada represents the single largest private sector investment project in Canadian history. It is a vote of confidence in a country that recognizes the need to develop our energy in a way that takes the environment into account, and that works in meaningful partnership with Indigenous communities.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h3>Quick facts</h3><ul><li>Globally, Canada is the fourth largest producer and fifth largest exporter of natural gas. The value of Canadian net exports (exports minus imports) was $6.7&nbsp;billion in 2017.</li><li>The LNG Canada facility will be built in Kitimat, B.C. Construction is expected to begin in 2018, with the terminal in service by 2024.</li><li>At full capacity, the terminal will convert and export as much as 26 million tons of liquefied natural gas per year, primarily to Asia. This represents roughly 20 per cent of overall gas production in Canada.</li><li>Prime Minister Trudeau met with Royal Dutch Shell senior executives in China and at the World Economic Forum in Davos, Switzerland. More recently, he met in New York with Chief Executive Officer&nbsp;Ben van Beurden where they discussed how to advance energy projects that are both good for Canada’s economy and the environment.</li></ul><h3>Associated links</h3><ul><li><a href=\"https://www.lngcanada.ca/\">LNG Canada</a></li><li><a href=\"https://www.nrcan.gc.ca/energy/facts/natural-gas/20067\">Natural Gas Facts</a></li><li><a href=\"https://www.nrcan.gc.ca/energy/natural-gas/5683\">Canadian LNG projects</a></li></ul></div>\n      "
}