{
  "path": "/en/news/news-releases/2022/09/17/prime-minister-attend-united-nations-general-assembly-new-york",
  "pageTitle": "Prime Minister to attend United Nations General Assembly in New York | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City, from September 20 to 22, 2022, to participate in the 77th Session of the United Nations (UN) General Assembly.</p>\n\n<p>During his visit, the Prime Minister will continue to work closely with our global partners to grow the middle class and generate economic growth that works for all Canadians by addressing the world’s biggest challenges. As Co-Chair of the UN Sustainable Development Goals (SDG) Advocates group the Prime Minister will continue to help make life better for people by advocating for strong climate action, the empowerment of women and girls, and reducing inequality. He will advance action on protecting nature and biodiversity, work to ensure that no one goes hungry by addressing the global food crisis, and improve health outcomes for people.</p>\n\n<p>On September 20, the Prime Minister will attend the opening of the High-Level General Debate of the 77th Session of the UN General Assembly.</p>\n\n<p>Prime Minister Trudeau will advance innovative solutions to the global food crisis, including with countries from the Global South that have been the most impacted: He will highlight Canada’s ongoing work to tackle the global food security crisis that has increased dramatically over the past several years and is now further exacerbated by Russia’s illegal invasion of Ukraine.</p>\n\n<p>Later that day, Prime Minister Trudeau will participate in the “Christchurch Call Summit” alongside New Zealand’s Prime Minister Jacinda Ardern and France’s President Emmanuel Macron where he will reiterate Canada’s pledge to eliminate terrorist and violent extremist content online.</p>\n\n<p>In New York, the Prime Minister will also highlight Canada’s leadership on climate action and nature protection, as well as build global momentum on key policies like pollution pricing and biodiversity conservation. Canada will co-host the “Countdown to COP15: Landmark Leaders Event for a Nature Positive World” and the Prime Minister will co-chair the Ocean Panel leaders’ meeting on “Financing Ocean Solutions for People and Planet: Delivering on SDG 14.”</p>\n\n<p>On September 21, Prime Minister Trudeau will attend the “Global Fund to Fight AIDS, Tuberculosis, and Malaria Seventh Replenishment – Pledging Conference”. The Global Fund is a partnership between governments, civil society, the private sector, technical partners, and people affected by the diseases to support country-led prevention, treatment, and care programs.</p>\n\n<p>While in New York, the Prime Minister will host a meeting with Caribbean and regional partners to continue to advance ways the international community can help support Haiti’s stability and sustainable development.</p>\n\n<p>The Prime Minister will attend the Welcoming Reception for Heads of Delegation hosted by President Biden and Dr. Biden. He will also hold additional meetings with partners from around the world to discuss global challenges, including the impacts of the pandemic and of Putin’s illegal and unjustifiable invasion of Ukraine and the continued need to counter Russian disinformation.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The United Nations is a principal forum for promoting a more peaceful, equal, and stable world. I look forward to engaging with global partners to continue making life better for people by defending democracy and human rights, taking ambitious climate action, ending poverty, improving access to health care and education, reducing inequality, and driving economic growth that benefits everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canadian delegation to the United Nations (UN) General Assembly will include Minister of Foreign Affairs, Mélanie Joly, Minister of International Development, Harjit Sajjan, and Minister of the Environment and Climate Change, Steven Guilbeault.</li>\n\t<li>Canada has been active at the UN since its creation in 1945 and played a key role in drafting the <a href=\"https://www.un.org/en/about-us/un-charter\">UN Charter</a>, an international treaty that sets out basic principles of international relations.</li>\n\t<li>Today, Canada continues to support the UN by actively participating in the organization’s activities and providing financial support.</li>\n\t<li>Canada is the eighth-largest contributor to the UN with an annual assessed contribution to the UN system of CAD $366.8M, including CAD$203.7 million for peacekeeping.</li>\n\t<li>Canada will welcome the world to Montréal from December 7-19, 2022 for the 15th Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, which will focus on agreeing to a new Global Biodiversity Framework to guide the world’s collective efforts to protect nature and halt biodiversity loss around the globe.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/06/prime-minister-co-chair-united-nations-sustainable-development-goals\">Prime Minister to co-chair the United Nations Sustainable Development Goals Advocates group</a></li>\n\t<li><a href=\"https://sdgs.un.org/\">United Nations – Sustainable Development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving Forward Together: Canada’s 2030 Agenda National Strategy</a></li>\n</ul></div>\n      "
}