{
  "path": "/en/news/readouts/2021/01/05/prime-minister-justin-trudeau-speaks-president-south-africa-cyril",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of South Africa Cyril Ramaphosa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of South Africa, Cyril Ramaphosa.</p>\n\n<p>Prime Minister Trudeau and President Ramaphosa discussed the global response to the COVID-19 pandemic and the measures taken by both countries to protect people’s health and safety and to support businesses and workers. They discussed ongoing collaboration to ensure developing countries’ access to critical diagnostics, therapeutics, and vaccines, and efforts to ensure equitable and efficient access to vaccines, including through the COVAX Facility.</p>\n\n<p>The two leaders spoke about their work together in the United Nations and the G20, through the Financing for Development in the Era of COVID-19 and Beyond initiative, to improve developing and vulnerable countries’ access to debt service relief and financing to support a sustainable global recovery from the pandemic.</p>\n\n<p>They discussed stability and security in Africa, including recent developments in Ethiopia. Prime Minister Trudeau affirmed Canada’s continued commitment to an inclusive and peaceful Ethiopia.</p>\n\n<p>Prime Minister Trudeau and President Ramaphosa looked forward to further strengthening the deep and historic friendship between Canada and South Africa.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/southafrica-afriquedusud/bilateral_relations_bilaterales/canada_south-africa-afrique-du-sud.aspx?lang=eng\">Canada - South Africa Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/22/prime-minister-concludes-virtual-g20-leaders-summit\">Prime Minister concludes virtual G20 Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/world-leaders-focus-key-actions-assist-countries-battered-financial\">World leaders to focus on key actions to assist countries battered by the financial crisis caused by COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}