{
  "path": "/en/news/readouts/2019/08/24/prime-minister-justin-trudeau-meets-boris-johnson-prime-minister-united",
  "pageTitle": "Prime Minister Justin Trudeau meets with Boris Johnson, Prime Minister of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, met with Boris Johnson, Prime Minister of the United Kingdom.</p>\n\n<p>The Prime Ministers committed to working together to continue strengthening all facets of the Canada-UK relationship.&nbsp; In line with the G7 Summit theme of reducing inequalities, the two leaders discussed the global economy and the importance of growth, job creation and a strong middle class.&nbsp; They agreed on the need to reform the World Trade Organization (WTO), highlighting Canada’s leadership in this regard.</p>\n\n<p>In discussing Brexit and the future of Canada-UK trade, Prime Minister Trudeau and Prime Minister Johnson reaffirmed their interest in ensuring that people and businesses in Canada and the UK continue to benefit and prosper from the deep and productive trading relationship. They committed to having their respective trade officials meet shortly to work towards this outcome.</p>\n\n<p>The two leaders exchanged views on some of the challenging situations facing the world today, including Venezuela, tensions in the Persian Gulf and the situation in Kashmir.&nbsp; With respect to Hong Kong, both underlined the importance of freedom of expression and assembly. The Prime Ministers discussed relations with Russia and agreed that it should not be readmitted to the G7 unless it ceased its aggression against Ukraine.&nbsp; Prime Minister Johnson thanked Canada for its support in condemning the Salisbury poisoning in March 2018.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson agreed on the need to tackle climate change and protect biodiversity. They also discussed the issue of Amazon wildfires as an international crisis to be addressed during this G7 Summit.&nbsp; They discussed their shared commitment to gender equality and women's empowerment and agreed on the central importance of quality education for girls.</p>\n\n<p>Prime Minister Trudeau thanked Prime Minister Johnson for the UK’s support on the two Canadians detained in China and reiterated the call for their immediate release.</p></div>\n      "
}