{
  "path": "/en/news/readouts/2019/06/07/prime-minister-justin-trudeau-meets-president-emmanuel-macron-france",
  "pageTitle": "Prime Minister Justin Trudeau meets with President Emmanuel Macron of France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Emmanuel Macron, President of France.</p>\n\n<p>The two leaders reflected on the D-Day commemorations held in Normandy the day before and the sacrifices made by Canadian and other Allied soldiers during the Second World War.</p>\n\n<p>The Prime Minister welcomed President Macron’s commitment to begin the process for ratification of CETA immediately. The Prime Minister and the President highlighted the increase in trade between Canada and France since the Comprehensive Economic and Trade Agreement (CETA) entered into provisional application in September, 2017.</p>\n\n<p>The leaders also welcomed the progress made on the Canada - France Climate and Environment Partnership and discussed how the two countries can further advance their cooperation.</p>\n\n<p>Prime Minister Trudeau confirmed to President Macron that Canada, in line with its contributions to peace and security in Mali and neighbouring countries, would become an Observer to the Sahel Alliance. The Sahel Alliance is a platform that allows donor countries and multilateral organizations to better coordinate international assistance in the Sahel region.</p>\n\n<p>Prime Minister Trudeau and President Macron also shared perspectives on a range of pressing international priorities, including buttressing the rules-based international trading system, in the lead up to the G20 Summit in Osaka Japan later this month and the G7 Summit that France will host in Biarritz in August. The Prime Minister underlined the important role the G20 and G7 must play in promoting gender equality, including through supporting women’s economic empowerment.</p>\n\n<p>The two leaders reiterated their mutual commitment to La Francophonie and discussed important international challenges, such as the crisis in Venezuela, combating violent extremism and the situation in Ukraine.</p></div>\n      "
}