{
  "path": "/en/news/statements/2021/04/07/statement-prime-minister-yom-hashoah",
  "pageTitle": "Statement by the Prime Minister on Yom HaShoah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Prime Minister, Justin Trudeau, today issued the following statement on Yom HaShoah, Holocaust Remembrance Day:</span></span></span></p>\n\n<p><span><span><span>“At sunset today, we will join Jewish communities and others in Canada and around the world to remember the six million innocent Jewish children, women, and men who were systematically murdered by the Nazis during the Holocaust. We will also honour and pay tribute to the resilience of the survivors, and recognize those who risked their lives to save others.</span></span></span></p>\n\n<p><span><span><span>“Traditionally, Jewish communities gather to light a memorial candle, recite prayers in memory of the victims, and recount the stories of Holocaust survivors. This year’s commemorations will look different because of the global COVID-19 pandemic. As we continue to follow public health guidelines to keep each other and our communities</span><span> safe, we will find innovative ways to mark this solemn day.</span></span></span></p>\n\n<p><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“The</span> <span lang=\"EN-CA\" xml:lang=\"EN-CA\">Holocaust is one of the darkest chapters in human history. Sadly, more than 75 years after the liberation of Nazi concentration and extermination camps, Jewish communities in Canada and around the world continue to face violence, hate, and rising antisemitism.</span> <span>This is unacceptable. As a country, we urgently need to address the resurgence of antisemitism, wherever and whenever we find it. Canada is equipped with the tools and resources needed to combat antisemitic attitudes and Holocaust denial, including through our support for the International Holocaust Remembrance Alliance’s definition of antisemitism, which we adopted as part of our </span><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\"><span>Anti-Racism Strategy</span></a><span>.</span></span></span></span></p>\n\n<p><span><span><span><span>“We are working with our domestic and international partners to apply the lessons from the past to prevent such atrocities from happening again. That is why, in order to strengthen Holocaust education, remembrance, and research, and to combat antisemitism as key elements of the promotion and protection of human rights in Canada and around the world, I named the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism.</span></span></span></span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“On this sombre day, I invite all Canadians to take time to remember the victims of the Holocaust, and honour its survivors. Today, and every day, we vow, ‘Never again,’ and promise to remain vigilant against antisemitism and all forms of hatred, wherever and whenever they occur.”</span></span></p></div>\n      "
}