{
  "path": "/en/news/news-releases/2022/09/15/prime-minister-announces-canadian-delegation-state-funeral-her",
  "pageTitle": "Prime Minister announces Canadian delegation to the State Funeral of Her Majesty Queen Elizabeth II | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he and Their Excellencies the Right Honourable Mary Simon, Governor General of Canada, and Mr. Whit Fraser will travel to the United&nbsp;Kingdom on September 16, 2022, to attend the State Funeral of Her Majesty Queen Elizabeth&nbsp;II, which will take place in London on September 19, 2022. Prime Minister Trudeau will be accompanied by Sophie Grégoire Trudeau.</p>\n\n<p>Canada will also be represented by former governors general the Right Honourable Michaëlle Jean and the Right Honourable David Johnston, as well as former prime ministers the Right Honourable Kim Campbell, the Right Honourable Jean Chrétien, the Right Honourable Paul Martin, and the Right Honourable Stephen Harper. They will be joined by Assembly of First Nations National Chief RoseAnne Archibald, President of Inuit Tapiriit Kanatami Natan Obed, and President of the Métis National Council Cassidy Caron, as well as the Clerk of the Privy Council and Secretary to the Cabinet and former High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland, Janice Charette, and current High Commissioner for Canada to the United Kingdom of Great Britain and Northern Ireland, the Honourable Ralph Goodale.</p>\n\n<p>Members of the Royal Canadian Mounted Police and representatives of regiments of the Canadian Armed Forces will join uniformed personnel from other Commonwealth countries for the service on September 19.</p>\n\n<p>In addition, the Canadian delegation will include members of the Order of Canada Mark Tewksbury, Gregory Charles, and Sandra Oh and Cross of Valour recipient Leslie Arthur Palmer. They will participate in a procession of recipients of national honours as part of the service.</p>\n\n<p>The day of Her Late Majesty’s State Funeral in the United Kingdom will be marked in Canada with a National Day of Mourning and a national commemorative ceremony held at Christ Church Cathedral, the Anglican cathedral in Ottawa. The ceremony will be attended by former prime ministers the Right Honourable Brian Mulroney and the Right Honourable Joe Clark, and all Members of Parliament have been invited. The ceremony will be broadcast live for everyone to watch.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Her Majesty Queen Elizabeth&nbsp;II was steadfast in her service to Canada, the Commonwealth, and its people. It is with a heavy heart, but deep appreciation, that we will come together to honour Her Majesty – whose lifetime of public service is an extraordinary example to us all.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Her Majesty Queen Elizabeth&nbsp;II acceded to the throne on February 6, 1952. She was crowned in Westminster Abbey on June 2, 1953, and was Canada’s longest-reigning sovereign, having served for over 70 years.</li>\n\t<li>Members of the Royal Canadian Mounted Police as well as the following regiments of the Canadian Armed Forces will participate in the service:\n\t<ul>\n\t\t<li>The Royal Regiment of Canadian Artillery</li>\n\t\t<li>The Corps of Royal Canadian Engineers</li>\n\t\t<li>The Governor General’s Horse Guards</li>\n\t\t<li>The King’s Own Calgary Regiment</li>\n\t\t<li>Royal 22<sup>e</sup> Régiment</li>\n\t\t<li>Governor General’s Foot Guards</li>\n\t\t<li>The Canadian Grenadier Guards</li>\n\t\t<li>The Stormont, Dundas and Glengarry Highlanders</li>\n\t\t<li>Le Régiment de la Chaudière</li>\n\t\t<li>The Royal New Brunswick Regiment</li>\n\t\t<li>The North Shore (New Brunswick) Regiment</li>\n\t\t<li>48th Highlanders of Canada</li>\n\t\t<li>The Argyll and Sutherland Highlanders of Canada</li>\n\t\t<li>The Calgary Highlanders</li>\n\t\t<li>Canadian Armed Forces Legal Branch</li>\n\t\t<li>Air Reserve</li>\n\t</ul>\n\t</li>\n</ul>\n\n<ul>\n\t<li>To honour the life and service of Her Majesty Queen Elizabeth&nbsp;II, Canadians are invited to sign the online&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/book.html\">book of condolences</a>&nbsp;or express their condolences&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/send-condolences.html\">in other ways</a>.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/10/statement-prime-minister-proclamation-accession-his-majesty-king-charles\">Statement by the Prime Minister on the proclamation of the accession of His Majesty King Charles&nbsp;III</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/13/national-day-mourning-canada-honour-her-majesty-queen-elizabeth-ii\">National Day of Mourning in Canada to honour Her Majesty Queen Elizabeth&nbsp;II</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a name=\"_Hlk113551019\" id=\"_Hlk113551019\"></a><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen.html\">Commemoration for Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/monarchy-crown.html\">Monarchy and the Crown</a></li>\n</ul></div>\n      "
}