{
  "path": "/en/news/readouts/2021/03/05/prime-minister-justin-trudeau-speaks-president-peru-francisco-sagasti",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Peru Francisco Sagasti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Peru, Francisco Sagasti.</p>\n\n<p>Prime Minister Trudeau and President Sagasti discussed ongoing efforts in Canada and Peru to fight the global COVID-19 pandemic, save lives, and support people and communities. They spoke about the impacts of the pandemic across the hemisphere and agreed on the importance of continued international collaboration to ensure access to vaccines, including through the COVAX Facility.</p>\n\n<p>The two leaders discussed the situation in Venezuela and its impacts throughout the region. Prime Minister Trudeau recognized Peru’s significant efforts in hosting Venezuelan migrants and refugees. He reaffirmed Canada’s commitment to working with the international community to address the crisis, support Venezuelans, provide humanitarian assistance, and promote and protect democracy.</p>\n\n<p>Prime Minister Trudeau and President Sagasti highlighted the strong friendship between Canada and Peru, built on shared values and warm people-to-people ties. They also mentioned their countries’ important trade relationship and long history of effective development partnership and cooperation, including on gender equality, education, and science and technology. The two leaders underscored their commitment to ongoing collaboration in support of the global response to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/peru-perou/bilateral_relations_bilaterales/canada_peru-perou.aspx?lang=eng\">Canada - Peru Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-by-international-development-minister-on-appointment-to-the-covax-advance-market-commitment-engagement-group.html\">Statement by International Development Minister on Appointment to the COVAX Advance Market Commitment Engagement Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/venezuela.aspx?lang=eng\">Canada and the Venezuela crisis</a></li>\n</ul></div>\n      "
}