{
  "path": "/en/news/news-releases/2015/11/12/pm-attend-g20-summit-turkey-and-apec-leaders-meeting-philippines",
  "pageTitle": "PM to attend G20 Summit in Turkey and APEC Leaders’ Meeting in the Philippines | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2>Introduction</h2><p>The Prime Minister, Justin Trudeau, will be making his first international trip as Prime Minister of Canada to the G20 Summit in Antalya, Turkey (November 15 and 16, 2015), and to the Asia-Pacific Economic Cooperation (APEC) Leaders’ Meeting in Manila, Philippines (November 18 and 19, 2015).</p><p>At the G20 Summit, the Prime Minister will participate in discussions on the global economy and on creating growth, stimulating job creation, and ensuring shared prosperity. Other areas of focus will include trade, financial regulation, international tax issues, anti-corruption efforts, energy, development, action against climate change, as well as the refugee crisis.</p><p>At the APEC Leaders’ Meeting, the Prime Minister will work with his counterparts to promote sustainable economic growth, with a focus on small and medium enterprises, and to enhance social inclusion and institution building.</p><p>On the margins of both summits, Prime Minister Trudeau will hold bilateral discussions with various leaders of the G20 and APEC to advance issues of mutual interest.</p><h2>Quotes</h2><blockquote><p>“Canada believes that investment is central to creating broad-based growth, good-paying middle class jobs, and prosperity. I look forward to sharing a positive Canadian vision with G20 leaders, so we can build strong relationships and make real progress in areas of shared interest. We are also focused on renewing Canada’s international reputation, in order to make real and meaningful contributions to a more peaceful and prosperous world.”<br>– <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>Successful, confident countries invest in their own futures. Canadians chose change and rejected austerity. During my first international trip as Prime Minister I will meet with leaders from around the world to advance Canadian interests, including our plan to invest in growth for the middle class and those working hard to join it.”<br>– <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada supports APEC’s open trade agenda and welcomes the work it does to increase prosperity, including opportunities it creates for Canadians. I look forward to working with APEC leaders to further strengthen trade and investment for the region, while addressing human development and environmental challenges.”<br>– <cite>The Right Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The G20 can trace its origins to a 1999 meeting between the former Canadian Finance Minister, Paul Martin, and the then U.S. Treasury Secretary nominee, Lawrence Summers.</li><li>Turkey, the host of this year’s G20 Summit, has set out overarching themes framed as the “three I’s”: inclusiveness, implementation, and investment for growth.</li><li>Members of the G20 account for more than 85 per cent of the world’s economy and nearly two-thirds of the world’s population.</li><li>As the premier forum for international economic cooperation, the G20 provides an opportunity to develop a coordinated response to pressing economic challenges.</li><li>The theme for this year’s APEC Leaders’ Meeting is “Building Inclusive Economies, Building a Better World,” representing the Philippines’ vision for an Asia-Pacific region.</li><li>APEC’s 21 members account for 2.8 billion people and over half of the world’s gross domestic product, representing over 84 per cent of Canada’s total merchandise trade. They include four of Canada’s top five trading partners – the United States, China, Mexico, and Japan.</li><li>APEC brings together some of the largest and most dynamic economies in the world to promote sustainable economic growth and prosperity among economies in the Asia-Pacific region.</li><li>Trade in goods and services between APEC economies has more than tripled since the forum's inception in 1989.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/apec/index.aspx?lang=eng\">APEC</a></li><li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li><li><a href=\"http://g20.org/English/\">G20</a></li><li><a href=\"http://www.international.gc.ca/g20/index.aspx\">The Group of 20: The Premier Forum for International Economic Cooperation</a></li><li><a href=\"/en/news/backgrounders/2015/11/15/canada’s-adjusted-growth-strategy-and-investment-strategy-g20\">Canada’s Adjusted Growth Strategy and Investment Strategy for the G20</a></li></ul></div>\n      "
}