{
  "path": "/en/news/statements/2022/02/24/g7-leaders-statement-invasion-ukraine-armed-forces-russian-federation",
  "pageTitle": "G7 Leaders’ Statement on the invasion of Ukraine by armed forces of the Russian Federation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We the Leaders of the Group of Seven (G7) are appalled by and condemn the large-scale military aggression by the Russian Federation against the territorial integrity, sovereignty and independence of Ukraine, directed partly from Belarusian soil. This unprovoked and completely unjustified attack on the democratic state of Ukraine was preceded by fabricated claims and unfounded allegations. It constitutes a serious violation of international law and a grave breach of the United Nations Charter and all commitments Russia entered in the Helsinki Final Act and the Charter of Paris and its commitments in the Budapest Memorandum. We as the G7 are bringing forward severe and coordinated economic and financial sanctions. We call on all partners and members of the international community to condemn this attack in the strongest possible terms, to stand shoulder to shoulder with Ukraine, and raise their voice against this blatant violation of the fundamental principles of international peace and security.</p>\n\n<p>This crisis is a serious threat to the rules-based international order, with ramifications well beyond Europe. There is no justification for changing internationally recognized borders by force. This has fundamentally changed the Euro-Atlantic security situation. President Putin has re-introduced war to the European continent. He has put himself on the wrong side of history.</p>\n\n<p>We are committed to uphold peace, stability and international law. We are united in our support for the people of Ukraine and its democratically elected government. In this dark hour our thoughts are with the people of Ukraine. We stand ready to support with humanitarian assistance in order to mitigate the suffering, including for refugees and displaced persons from the Russian aggression.</p>\n\n<p>We call on the Russian Federation to stop the bloodshed, to immediately de-escalate and to withdraw its forces from Ukraine. We also call on Russia to ensure the safety of the OSCE Special Monitoring Mission. We also condemn the involvement of Belarus in this aggression against Ukraine and call on Belarus to abide by its international obligations.</p>\n\n<p>We condemn in the strongest possible terms Russian President Putin’s decision on February 21 to recognize the Donetsk and Luhansk self-declared entities in eastern Ukraine as “independent” states as well as his decision to send Russian military forces into these regions. We call on other states not to follow Russia’s illegal decision to recognize the proclaimed independence of these entities. The decision by President Putin is a grave violation of the basic principles enshrined in the UN Charter, in particular the respect for the territorial integrity and sovereignty of states and also a blatant breach of UN Security Council resolution 2202 – supported by the Russian Federation as a permanent member of the Security Council – as well as of the Minsk agreements, which stipulate the return of the areas concerned to the control of the Ukrainian Government.</p>\n\n<p>We reaffirm our unwavering commitment to Ukraine’s sovereignty and territorial integrity within its internationally recognized borders and territorial waters as well as the right of any sovereign state to determine its own future and security arrangements. We reaffirm that illegally occupied Crimea and the self-declared “people’s republics” are an integral part of Ukraine.</p>\n\n<p>We condemn President Putin for his consistent refusal to engage in a diplomatic process to address questions pertaining to European security, despite our repeated offers.</p>\n\n<p>We stand united with partners, including NATO, the EU and their member states as well as Ukraine and remain determined to do what is necessary to preserve the integrity of the international-rules base order. In this regard, we are also closely monitoring global oil and gas market conditions, including in the context of Russia’s further military aggression against Ukraine. We support consistent and constructive engagement and coordination among major energy producers and consumers toward our collective interest in the stability of global energy supplies, and stand ready to act as needed to address potential disruptions.</p></div>\n      "
}