{
  "path": "/en/news/statements/2016/02/12/statement-prime-minister-canada-first-100-days",
  "pageTitle": "Statement by the Prime Minister of Canada on First 100 days | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today to highlight the accomplishments made by the Government of Canada during the first 100 days of its mandate:</p>\n<p>“When we were elected, we promised real change to improve the lives of Canadians – change based on what people from coast to coast to coast have told us they want. After the first 100 days, I am proud of the progress we have made towards that goal.</p>\n<p>“As one of our first orders of business, we cut taxes for the middle class. We asked the wealthiest Canadians to pay a little more, so that more money could be put back into the pockets of middle class Canadians.</p>\n<p>“In November, I was extremely proud to introduce our gender-balanced Cabinet. We know our country is enriched – and our government is more effective – when decision-makers represent Canada’s rich diversity.</p>\n<p>“Our government also began the important consultations to design a framework for an inquiry into missing and murdered Indigenous women and girls. Indigenous communities demand answers and they deserve justice.</p>\n<p>“Together, we have demonstrated global leadership by welcoming thousands of Syrian refugees into our homes and our communities. These new Canadians will make great contributions to our country, and the extent to which Canadians have come together to lend a hand is nothing short of inspirational.</p>\n<p>“We have also made important investments in innovative industries like regenerative medicine and clean water technologies. We restored the long-form census, introduced legislation to bring fairness to Canadian labour laws, and have announced that we will re-open the Kitsilano Coast Guard base. These are just a handful of our achievements after just 100 days in government.</p>\n<p>“Today, I am happy to announce that our government will create an additional 35,000 summer jobs for students this year. Through the Canada Summer Jobs program, we will invest up to an extra $113 million to help young Canadians get the valuable work experience they need.</p>\n<p>“Youth unemployment has remained stubbornly high, and far too many young people have not been able to join the workforce. Our government was elected on a promise to do something about this, right away, and that is exactly what we are doing.</p>\n<p>“While I am excited about what we have accomplished in the first 100 days, I know there is still much to do to help Canadian families. In the upcoming budget, we will continue with our plan to invest in strengthening the middle class with a new Canada Child Benefit and historic investments in job-creating infrastructure.”</p>\n<p></p></div>\n      "
}