{
  "path": "/en/news/readouts/2022/11/13/prime-minister-justin-trudeau-meets-secretary-general-association",
  "pageTitle": "Prime Minister Justin Trudeau meets with Secretary-General of the Association of Southeast Asian Nations (ASEAN) Dato Jock Hoi Lim | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Secretary-General of the Association of Southeast Asian Nations (ASEAN), Dato Jock Hoi Lim, on the margins of the ASEAN Summit.</p>\n\n<p>Prime Minister Trudeau and Secretary-General Lim discussed ongoing efforts to strengthen engagement between Canada and ASEAN. Prime Minister Trudeau thanked Secretary-General Lim for his constructive role in supporting the Canada-ASEAN Strategic Partnership, as well as the launch of Canada-ASEAN free trade negotiations in November 2021. These steps will further deepen Canada’s ties with the Indo-Pacific, strengthen our trade diversification efforts and promote security and prosperity for the people of Canada and across ASEAN countries.</p>\n\n<p>Prime Minister Trudeau highlighted the upcoming release of Canada’s Indo-Pacific Strategy and discussed the important role that ASEAN will continue to play as Canada deepens its engagement in the region.</p>\n\n<p>The Prime Minister expressed Canada’s appreciation to Secretary-General Lim for his leadership as he concludes his term as ASEAN Secretary-General. The Prime Minister wished him well in his future endeavours.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/asean-anase/fta-ale/negotiations-negociations.aspx?lang=eng\">Canada-ASEAN Free Trade Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/08/08/statement-prime-minister-marking-asean-day-and-45-years-partnership\">Statement by the Prime Minister marking ASEAN Day and 45 years of partnership with the Association of Southeast Asian Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}