{
  "path": "/en/news/news-releases/2018/06/25/prime-minister-trudeau-attend-nato-summit",
  "pageTitle": "Prime Minister Trudeau to attend NATO Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Brussels, Belgium, to attend the NATO Summit on July 11 and 12, 2018.</p><p>Canada, along with 11 other countries, founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. For more than six decades, NATO has proven itself to be a major contributor to international peace, security, and stability – essential for economic growth and prosperity.</p><p>At the Summit, Prime Minister Trudeau will discuss trans-Atlantic security issues and challenges with other NATO leaders, including how to work together to strengthen the international rules-based order and protect our citizens.</p><p>Together, NATO leaders will explore how best to reinforce our collective security, including by responding to emerging and evolving threats as well as conducting training and capacity-building with partner nations and organizations. Leaders will also address Russia’s aggressive and illegal actions, and Prime Minister Trudeau will reaffirm Canada’s support for Ukraine.</p><p>In all discussions and working sessions, Prime Minister Trudeau will reiterate Canada’s commitment to playing an active role in the Alliance, and a strong and constructive role in the world.</p><h2>Quote</h2><blockquote><p>“NATO is a cornerstone of Canada’s international security policy, and an important alliance as we look for more stability in a world going through rapid change. I look forward to meeting with leaders from NATO member states in Belgium to deepen our already strong relationships, and to discuss what more we can and must do to advance peace and security for our citizens and people around the world.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Since 2014, Canada has actively worked alongside NATO allies to maintain security and stability in Central and Eastern Europe. Measures include training, exercises, and other operational tasks.</li><li>Operation REASSURANCE is the Canadian Armed Forces’ support to NATO assurance and deterrence measures in Central and Eastern Europe. As part of this operation, Canada has established its largest sustained military presence in Europe in over a decade by leading a multinational NATO battlegroup in Latvia.</li><li>In light of continued international instability, NATO Allies decided at the July 2016 Warsaw Summit to further strengthen the Alliance posture in order to deter possible aggression against NATO members. The most visible element of this strengthened deterrence and defence posture is the establishment of the enhanced Forward Presence in Central and Eastern Europe.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/nato-ee.page\">Operation REASSURANCE</a></li></ul></div>\n      "
}