{
  "path": "/en/news/statements/2016/10/30/eu-canada-summit-joint-declaration",
  "pageTitle": "EU-Canada Summit Joint Declaration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">1.&nbsp;Mr. Donald Tusk, President of the European Council, Mr. Jean-Claude Juncker, President of the European Commission, and Mr. Justin Trudeau, Prime Minister of Canada met in Brussels for the 16th European Union-Canada Summit. The partnership between the European Union (EU) and Canada, based on shared values, a long history of close cooperation and strong people-to-people ties, is more important than ever in a world where those shared values are increasingly being challenged. As strategic partners and celebrating the 40th anniversary of the foundational EU-Canada treaty, the EU and Canada committed to working even more closely together in such key areas as peace, democracy, prosperity, protection of human rights and the rule of law, as well as the protection of the environment, social inclusion and cultural diversity. Signed today, the EU-Canada Comprehensive Economic and Trade Agreement (CETA) and the Strategic Partnership Agreement (SPA) demonstrate our joint commitment to a progressive international agenda across the policy spectrum, and mark a historic step in the strengthening and deepening of our relationship.&nbsp; </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">2. The SPA will set the stage for even stronger collaboration both bilaterally and in multilateral forums. It will enrich the political dimension of our relationship and allow for more systematic and structured cooperation in a broad range of sectors, notably with regard to peace and security, migration, the fight against terrorism, energy, climate change, research and innovation, development and consular protection. Together we will continue to promote a rules-based global order, grounded in our common values and in international law.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">3. The Comprehensive Economic and Trade Agreement (CETA) that we have signed today is the most comprehensive, ambitious and progressive trade agreement ever negotiated by either Canada or the European Union and will open a new dimension to our economic partnership.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">4. CETA will deliver sustainable and inclusive economic growth and spur job creation. We are committed to the swift provisional implementation of CETA so that Canadians and Europeans are able to enjoy the benefits that CETA will bring as soon as possible. We remain fully committed to the principle that trade agreements should fully preserve the ability of governments to regulate in the public interest, especially with regard to public services as well as environmental and labour protections. We are firmly committed to ensuring that our stakeholders, including employers, trade unions, consumer and environmental groups, participate in the ongoing implementation of CETA. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">5. The EU and its Member States and Canada have adopted at the EU-Canada Summit a Joint Interpretative Instrument to explain in a clear and unambiguous manner what certain provisions in CETA mean. This interpretative instrument has legal status and will serve as an authentic interpretation of CETA in the sense of Article 31 of the <em>Vienna Convention on the Law of Treaties. </em></span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">6. CETA considerably enhances the framework for our bilateral trade relations and offers new economic opportunities. On both sides of the Atlantic, we will therefore engage actively with citizens, workers, entrepreneurs, producers and companies to ensure that our stakeholders can seize the opportunities that CETA brings and benefit from the agreement from the outset.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">7. This landmark agreement between Canada and the EU sends a positive signal about the importance of free, fair and progressive international trade. We commit to working together to promote these principles in the multilateral arena, notably in the World Trade Organization. We are also committed to working together towards our common objective of an independent and impartial multilateral investment court.&nbsp; </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">8. We commit to strengthening our consultation and cooperation on foreign policy issues, in particular in multilateral fora such as the UN, G7, G20 and the Organization for Security and Co-operation in Europe. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">9. We remain firmly committed to Ukraine's sovereignty and territorial integrity, and reiterate the need for a complete implementation by all parties of the Minsk agreements to bring a sustainable and peaceful solution to the conflict. We do not recognise and continue to condemn the illegal annexation of Crimea and Sevastopol by the Russian Federation. We also remain committed to implement a policy of non-recognition. We continue to closely cooperate and coordinate our actions as regards restrictive measures which will remain clearly linked to the complete implementation of the Minsk agreements and respect for Ukraine’s sovereignty. We will also continue our efforts to assist Ukraine in the implementation of agreed reforms, including civilian security sector reform, as an essential element of Ukraine's progress towards greater democracy, openness and accountability.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">10. On Syria, we strongly condemn the continued, widespread violations of human rights and international humanitarian law by all parties to the conflict, notably the Syrian regime and its supporters, against the Syrian people.&nbsp; These include the use of unlawful, indiscriminate and disproportionate attacks, including the use of chemical weapons, and the deliberate targeting of hospitals and medical facilities. The targeting of a United Nations (UN) humanitarian convoy on 19 September is a clear violation of international humanitarian law, which requires full investigation. The use of starvation of civilians through besiegement of populated areas as a tactic of war by parties to the conflict, but for which the Syrian regime bears the greatest responsibility, and forced population transfers are both contrary to international law. We call for the immediate and full implementation of a cessation of hostilities to be monitored and enforced by a strong mechanism, for sieges to be lifted, and for safe, complete and unhindered humanitarian access to reduce violence and relieve the suffering of the Syrian population in Aleppo and elsewhere. All parties to the conflict must allow humanitarian organizations to do their job in line with international humanitarian principles and standards, and in compliance with international humanitarian law and relevant UN Security Council Resolutions. We continue to support the work of the UN Special Envoy for a credible and viable political transition, as stated in UN Security Council Resolution 2254 and other relevant UN Security Council resolutions and the Geneva communiqué. A renewed cessation of hostilities and efforts to find a political solution are urgent in order to allow all parties to reengage in the intra-Syrian talks to resume once the situation on the ground will allow it. It is agreed that the UN should lead and coordinate international stabilization and peacebuilding efforts, and we stand ready to support reconstruction once a credible political transition has begun. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">11. We also discussed the situations in Iraq and Libya. On Iraq, we agreed to explore synergies in our stabilisation and capacity building efforts, including on the rule of law, good governance and human rights. On Libya, we reaffirm our support for the Libyan Political Agreement and its fulfilment, and the Government of National Accord as the sole legitimate government of Libya, as endorsed in UN Security Council Resolution 2259 and subsequent resolutions. We urge all Libyans to unite in the face of the country's challenges, including the fight against terrorism. We agree to continue our exchanges on how to further support the Libyan people in finding a path to stability through peaceful negotiation. We also agreed that implementing sustainable political solutions is the only way to fight Daesh in the region in the long term.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">12. We underline our collective commitment to strengthen cooperation to achieve Afghanistan's self-reliance in the transformation decade (2015-2024) and to create a political, social and economic environment conducive to peace, security, sustainable development and prosperity. We welcome the outcome of the conference on Afghanistan held on 4-5 October 2016 and the important political and financial support announced by both the EU and Canada.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">13. We strongly condemn terrorism in all its forms and manifestations, and deplore the recent attacks by terrorist groups, including Daesh, in the Middle East, Africa, Europe, the Americas and Asia. We undertake to strengthen efforts in the fight against terrorism including in the framework of the Global Counterterrorism Forum and in the Global Coalition against Daesh. Determined action is required to stem the flow of foreign terrorist fighters and to address the potential impact of their return. We will accelerate efforts to prevent and counter radicalization that leads to violent extremism, to ensure systematic control at the external borders, to share information more effectively, to dissuade, detect and disrupt suspicious travel, to prevent and disrupt financial support to terrorist organizations and to investigate and prosecute foreign terrorist fighters. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">14. We affirm our support for cooperation, including in multilateral peace and stabilization operations, within the framework of UN peacekeeping, the EU’s Common Security and Defence Policy (CSDP) and the strategic partnership between the EU and the North Atlantic Treaty Organization (NATO). Canada</span>’<span lang=\"EN-GB\" xml:lang=\"EN-GB\">s contribution to CSDP civilian and military missions and operations remains a vital expression of solidarity in international crisis management. We reviewed our current successful CSDP cooperation in Ukraine and the Palestinian territories and will look into other possible joint efforts. We also welcome the conclusion of negotiations of a security of information agreement. Moreover, we will explore ways to further defence and security cooperation, including in the areas of education, training and sharing lessons learned. We look forward to the implementation of the EU-NATO Joint Declaration made in Warsaw in July 2016. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">15. We welcome the adoption of the 2030 Agenda for Sustainable Development that integrates the social, economic and environmental dimensions of sustainable development, as well as peace, justice and governance. We will work together to support the achievement of its goals and targets ensuring that no one is left behind.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">16. We emphasize the importance of ensuring the promotion and protection of human rights. We underline the importance of gender equality and of empowering women and girls as powerful agents of change.&nbsp; Building respect for diversity and pluralism worldwide via international cooperation and multilateralism will remain key to our joint action. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">17. We acknowledge that our societies and the world have reaped remarkable benefits from diversity, and are guided by the belief that economic, cultural, political, and social success relies on efforts to build societies that embrace diversity-based inclusion. We will work individually and collectively to ensure that diversity is recognized and leveraged as a strength.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">18. We reaffirm our determination to further cooperate to increase the effectiveness of the international humanitarian system and the respect for humanitarian principles and international humanitarian law. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">19. In this context we commit to launch an EU-Canada development policy dialogue to discuss ways in which Canada and the EU can collaborate to support the poorest and most vulnerable.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">20. We welcome and recognize the value of enhanced mobility, including through visa-free travel between the European Union and Canada for all of our respective citizens, as envisaged in the Canada-EU SPA.&nbsp; The decision of Canada to lift, in late 2017, visa requirements for all Bulgarian and Romanian citizens will further facilitate the strong cultural, educational, family and business relations that exist between Canada and Europe.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">21. We recognise the importance of global responsibility-sharing related to addressing large movements of refugees and migrants in full respect of relevant international law, and will continue to play a leading role, including in multilateral forums and in the framework of the G7 and G20. We reaffirm our common approach and agree to step up efforts to address the root causes of forced migration and displacement, and to respond effectively to challenges related to the management of large migratory flows and refugee situations, particularly those that are protracted. We will continue to provide humanitarian assistance, seek durable solutions for refugees and sufficient support for their host communities, and provide support to enhance their access to quality education at all levels, as well as employment opportunities. We agree to work together to encourage others to step up their support, including through private sector and civil society’s efforts, and to work together to engage new mechanisms such as the Education Cannot Wait Fund.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">22. We call upon the international community to implement the New York Declaration for Refugees and Migrants. We will ensure close cooperation in the follow-up work towards the achievement of a global compact for safe, orderly and regular migration and a comprehensive refugee response framework by 2018. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">23. We commit to deepen our bilateral cooperation on refugee and migration issues. Alongside existing cooperation arrangements, we will explore the possible establishment of a new migration platform involving Canada, the EU and its member states to share best practices and technical expertise on themes which may include effective border management, integration and resettlement programmes, asylum systems, return policies and tackling illegal migration, and legal migration, as appropriate. This will be done bearing in mind the need for coordination, cost-effectiveness and efficiency.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">24. We reaffirm our commitment to work with our international partners to support the ambitious and effective implementation of the historic Paris Agreement. We will ensure robust implementation of the Paris Agreement’s transparency and carbon markets-related provisions. We recognize the importance of the EU’s and Canada’s efforts to develop and communicate long-term low GHG emission development strategies well within the schedule provided by the COP21 decision. We agree on the importance of addressing transport emissions, including the reduction of air pollutants and GHG emissions from on-road light duty and heavy-duty vehicles consistent with the aspirational policies and programs identified in the G20 Energy Efficiency Leading Programme. We welcome the recent agreement at the International Civil Aviation Organization on an offset system for international aviation emissions, and encourage further progress at the International Maritime Organization to develop a roadmap for reducing GHG emissions from international shipping. We welcome the recent adoption under the Montreal Protocol of the Kigali amendment to phase down hydrofluorocarbons as a major contribution to the objectives of the Paris Agreement.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">25. We reiterate the importance of the upcoming EU-Canada High Level Dialogue on Climate in 2017 to jointly pursue efficient means to implement agreed actions and reach concrete results. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">26. We agree to continue to regularly hold the EU-Canada High Level Dialogue on Energy to address joint and global issues such as the exchange of information on gas market developments; fostering research and innovation; sharing best practices for energy efficiency; and renewable energy regulation and integration. Canada and the EU will work together, where appropriate, to assist third countries’ energy plans, cooperate in international energy forums, promote open global energy markets and the global energy transition towards a climate-neutral, safe and sustainable, low-carbon economy. We encourage investments in energy infrastructure and low-carbon projects, including through joint initiatives, and in the development of sustainable indigenous resources aiming to strengthen the stability, diversity and sustainability of supplies. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">27. We also reaffirm the importance of protecting the environment and agree to engage through the EU-Canada High Level Dialogue on Environment in 2017 to join our efforts in protecting the environment. We confirm our intention for greater collaboration internationally and in particular to address the specific challenges of combatting wildlife trafficking. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">28. We reaffirm our commitment to strengthening our cooperation with regard to the Arctic. We will work jointly towards the establishment of a pan-Arctic observation system and to support work on area-based management tools, including marine protected areas, in close cooperation with and with respect for Arctic residents, regional stakeholders, organisations and processes as well as within multilateral institutional frameworks. We will work on the reinforcement of international cooperation to reduce short lived climate pollutants such as black carbon and methane, as part of wider efforts to protect the Arctic environment and to implement the Paris Agreement. We also note the importance of building sustainable and strong Arctic economies and continuing to support the well-being and rights of Arctic residents and communities. With that in mind, we recognise the importance of our joint statement on access to the EU of seal products from Indigenous communities in Canada, and commit to continued cooperation in this framework. We also agree to work closely within the Arctic Council and look forward to the Arctic Council taking a final decision to fully accredit the EU as an observer.&nbsp; </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">29. We commit to strengthening cooperation on oceans, including their governance. We will work together on actions to promote conservation, sustainable blue growth and maritime safety and security. We will step up cooperation on international fisheries management, including the fight against illegal, unreported and unregulated fishing. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">30. We will continue to enhance cooperation under the Canada-EU-United States Atlantic Ocean Research Alliance and further the successful implementation of the Galway Statement. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">31. We recognise the importance of increasing our cooperation on scientific research and have signed an implementing arrangement to facilitate cooperation of Canadian researchers in the Horizon 2020 programme.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">32. We are committed to improving the framework conditions for cooperation between researchers from Canada and the European Union and, recognising the many global challenges our societies are facing, will seek to focus our research and innovation programmes where appropriate.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">33. We further deepen our ties in scientific cooperation and reinforce our collaboration under the existing Agreement for Scientific and Technological Cooperation between Canada and the EU with the signature of an implementing arrangement to facilitate cooperation between EU and Canadian researchers of excellence. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">34. We are committed to continue driving forward global collaboration to address emerging infectious diseases such as Ebola and Zika. We will continue our collaboration in the area of research and innovation through joint leadership of the work of the \"Global Research Collaboration for Infectious Disease Preparedness. We will also work together on the development guidelines for data-sharing during public health emergencies.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">35. We acknowledge the important role that education, and in particular higher education and youth exchange, has in promoting democratic values and shaping a generation of open–minded, skilled workers. We recognise the need to promote youth mobility, notably through the Erasmus+ programme that funds the mobility of young people, youth workers, students and university staff, as a way to foster links between our respective peoples, notably between our young citizens.</span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">36. We reiterate our adherence to joint cultural values and agree to enhance cultural cooperation and protect cultural heritage, in particular via the current initiatives to safeguard global heritage sites and cultural property, including those recognized by UNESCO conventions and programmes. We will continue our efforts to foster diversity of cultural expression by promoting the principles and objectives of the 2005 UNESCO Convention on the Protection and Promotion of the Diversity of Cultural Expressions. </span></p>\n<p><span lang=\"EN-GB\" xml:lang=\"EN-GB\">37. Canada and the EU look forward to jointly implementing this declaration with vigour and taking into account our shared history, values and interests.</span></p></div>\n      "
}