{
  "path": "/en/news/news-releases/2018/11/01/opening-rail-line-and-federal-investments-revitalize-churchill",
  "pageTitle": "Opening of rail line and federal investments to revitalize Churchill | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In 2017, spring flooding badly damaged the Hudson Bay Rail Line, Churchill’s only land link to the rest of Canada. Since then, Churchill has only been accessible via air and sea. Prices on everything from fuel to groceries skyrocketed. Tourism declined. Local families, students, and business owners were left stranded.</p><p>The Prime Minister, Justin Trudeau, along with Minister Jim Carr, today announced that, by the end of November, the rail line will resume its operations, servicing both passengers and freight.</p><p>They also announced more than $3.8 million toward 40 projects that will increase tourism, provide skills training, help offset the freight costs stemming from the rail line closure, and open the door for more investments in the community and more opportunities for residents.</p><p>These investments, and the restoration of freight and passenger rail service, will help revitalize and diversify the local economies in Churchill and other northern communities in Manitoba.</p><h2>Quotes</h2><blockquote><p>“Today’s announcement marks the beginning of a new chapter for Churchill. We know that nobody is more invested in the future of the Hudson Bay Rail Line than the people who live in Churchill. We have committed millions of dollars over the next decade to ensure the ongoing operations of the line, and made significant investments to increase tourism, support skills training, and empower local businesses, which will bring long-term benefits to the people of Churchill and northern Manitoba.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Quality infrastructure is key to unleashing the economic potential of our communities. The Hudson Bay Railway Line is not only a vital mainland connection for the town of Churchill and surrounding communities, it represents an important transportation and commercial hub. Together with our $3.8 million investment in people of northern Manitoba, it builds the foundation for good jobs and growth in the region.”<br>—<cite>The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development and Minister responsible for Western Economic Diversification Canada</cite></p></blockquote><blockquote><p>“The Government of Canada is dedicated to ensuring the long-term growth of Churchill and the surrounding area. We continue to work with local partners to address the unique challenges in the region and create sustainable economic opportunities for Manitoba’s North.”<br>—<cite>The Hon. Jim Carr, Minister of International Trade Diversification</cite></p></blockquote><blockquote><p>“The CRED Fund has supported some terrific initiatives that have helped to drive forward economic development in the Churchill Region. We’re looking forward to continuing to utilize the Fund to help the dreams of local entrepreneurs become a reality, and to help them capitalize on the opportunities that will arise as Churchill’s access to the world is expanded through Arctic Gateway.”<br>—<cite>Jason Denbow, Executive Director, Community Futures Manitoba and Community Futures Saskatchewan</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In September, the Government of Canada announced an investment of $117&nbsp;million to support the acquisition and repair of Churchill rail line by the Arctic Gateway Group.</li><li>The Churchill Region Economic Development (CRED) Fund was created to respond to the economic uncertainty facing the Town of Churchill. It aims to encourage the short- and long-term sustainable economic development and diversification of local economies, facilitate economic adjustment, and enable collaboration and partnerships leading to enterprise opportunities.</li><li>To date, the CRED Management Committee has approved 46 projects valued at $4.6 million.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/western-economic-diversification/news/2018/09/government-of-canada-announces-support-for-acquisition-and-repair-of-churchill-rail-line-by-arctic-gateway-group.html\">Government of Canada announces support for acquisition and repair of Churchill rail line by Arctic Gateway Group</a></li><li><a href=\"https://www.canada.ca/en/western-economic-diversification/news/2016/09/government-canada-announces-4-6-fund-churchill-region.html?wbdisable=true\">Government of Canada Announces $4.6M Fund for Churchill and Region</a></li><li><a href=\"https://cfmanitoba.ca/special-programs/cred\">Churchill Region Economic Development Fund</a></li><li><a href=\"https://cfmanitoba.ca/approved-projects\">Churchill Region Economic Development Fund – Approved Projects</a></li></ul></div>\n      "
}