{
  "path": "/en/news/statements/2022/01/24/statement-prime-minister-world-day-african-and-afrodescendant-culture",
  "pageTitle": "Statement by the Prime Minister on World Day for African and Afrodescendant Culture | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the World Day for African and Afrodescendant Culture:</p>\n\n<p>“Today marks the <a href=\"https://en.unesco.org/commemorations/africanafrodescendantculture\">World Day for African and Afrodescendant Culture</a>, an opportunity to reflect on and celebrate the rich cultures, heritage, and achievements of Africans and African diasporas in Canada and around the world.</p>\n\n<p>“Africans and people of African descent have made numerous economic, social, and spiritual contributions worldwide, shaping many spheres, including science, medicine, and art. Although recognition of and appreciation for African and Afrodescendant culture have been limited in the past, this day<strong> </strong>calls on us to honour<strong> </strong>the richness of African and Afrodescendant cultures and reflect on how essential they are to the world’s shared culture. Today, and every single day, we must protect and promote cultural diversity as a catalyst for dialogue, peace, and prosperity for Africans, people of African descent, and humanity as a whole.</p>\n\n<p>“Inclusion and respect for diversity are cornerstones of Canadian identity and at the heart of our democracy. We must reject all forms of racism and discrimination, and eliminate inequalities and inequities by demonstrating leadership and empowering communities. That is why the Government of Canada officially recognizes the <a href=\"https://www.un.org/en/observances/decade-people-african-descent\">United Nation’s International Decade for People of African Descent</a>, which spans from 2015 to 2024 and focuses on the themes of recognition, justice, and development. We reiterate our commitment to taking a whole-of-government approach that builds upon the framework of the Decade, by developing policies and projects that tackle anti-Black racism, discrimination, and bias in public and private institutions. We will continue to be guided by the Decade’s principles to develop concrete measures to ensure equality before the law, eradicate poverty and social exclusion, and eliminate racism and discrimination for people of African descent in Canada.</p>\n\n<p>“With <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti-Racism Strategy</a>, through the Federal Anti-Racism Secretariat, the government is demonstrating leadership by addressing issues of systemic racism across the country. In 2020, we launched Canada’s first-ever <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a> to support Black Canadian business owners and entrepreneurs – for whom barriers were exacerbated during the COVID-19 pandemic – help them grow their businesses, and empower them to succeed into the future. As part of the program, in 2021 we announced that the Black Entrepreneurship Loan Fund is accepting applications to loans that will provide funding to Black entrepreneurs and business owners to help them face the challenges that come with running a business. We also launched new partnerships to establish the <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en/black-entrepreneurship-knowledge-hub\">Black Entrepreneurship Knowledge Hub</a>, which will conduct research and identify barriers and opportunities to further develop an inclusive market economy that values and amplifies the contributions of under-represented groups.</p>\n\n<p>“Last year, we co-sponsored a resolution at the United Nations General Assembly to declare August 31 as the <a href=\"https://www.un.org/en/observances/african-descent-day\">International Day for People of African Descent</a>. This observance seeks to bring justice for and awareness of the struggles, hopes, and resilience of Africans and people of African descent. We also welcomed the United Nations General Assembly establishing the Permanent Forum of People of African Descent, which will serve as an advisory body to the Human Rights Council and encourage the full political, economic, and social inclusion of Africans and people of African descent as equal citizens around the world. Here at home, the Government of Canada has recognized more than 40 people, places, and events of national historic significance that reflect the importance of Black Canadians to our country’s shared heritage. Designations, such as <a href=\"https://www.pc.gc.ca/en/culture/clmhc-hsmbc/res/information-backgrounder/africville\">Africville</a>, <a href=\"https://www.pc.gc.ca/en/culture/clmhc-hsmbc/res/information-backgrounder/richard-pierpoint\">Richard Pierpoint</a>, and <a href=\"https://www.pc.gc.ca/en/culture/clmhc-hsmbc/res/information-backgrounder/mary-ann-shadd\">Mary Ann Shadd</a>, acknowledge past tragedies and injustices while highlighting the perseverance, resistance, resilience, and strength of Black Canadians. Telling these stories allows us to create platforms to discuss the ways people of African descent continue to unite, impact, and shape our country – and most importantly, our future.</p>\n\n<p>“We have made progress in recognizing Africans and people of African descent, but there is still a lot of work ahead of us. The Government of Canada will continue to engage with partners across the country to ensure that federal programs and services for Black Canadians reflect the realities and needs of Black Canadians. We will also work with the African Union and other international partners to advance and strengthen peace and security, human rights, humanitarian assistance, trade, democratic governance, and development initiatives with countries in Africa. Together, we can remove barriers to inclusion and ensure everyone has a chance at getting ahead, regardless of who they are and where they come from.</p>\n\n<p>“Today, I invite all Canadians to learn more about African and Afrodescendant cultures, and take part in virtual events commemorating the World Day for African and Afrodescendant Culture.”</p></div>\n      "
}