{
  "path": "/en/news/statements/2021/05/17/statement-prime-minister-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p>\n\n<p>“Today, on the&nbsp;<a href=\"https://en.may17mai.com/\">International Day Against Homophobia, Transphobia, and Biphobia</a>, we join members of LGBTQ2 communities, in Canada and around the world, to reaffirm their fundamental right to be treated equally, regardless of their sexual orientation, gender identity, or gender expression. We also reiterate our commitment to denouncing the discrimination, violence, and prejudice they continue to experience for simply being themselves.</p>\n\n<p>“This year’s theme, ‘For some, showing their colours isn’t a choice’, highlights the difficult reality that many LGBTQ2 people continue to face high rates of harassment, bullying, and violent crimes. As governments and as citizens, we all have a role to play to make sure LGBTQ2 people feel safe and supported and can participate fully in society. This is why the Government of Canada declared trans rights as human rights, and passed legislation to fully protect gender identity and expression. And why, in 2017, I delivered a formal apology in the House of Commons to all LGBTQ2 people in Canada who were harmed or unjustly treated because of federal legislation, policies, and practices. By choosing inclusion over intolerance, we can fight stigma, help break down barriers, and ensure every LGBTQ2 person has the opportunity to be their authentic self.</p>\n\n<p>“Sadly, over the past year, the pandemic has disproportionately affected some people in our society. Longstanding social and economic disparities experienced by Black, Indigenous, and racialized LGBTQ2 people have been further exacerbated. As we continue to recover from this crisis, we must seize every opportunity to foster a fairer and more equitable society. Last year, we <a href=\"https://www.canada.ca/en/department-justice/news/2020/09/federal-government-reintroduces-legislation-to-criminalize-conversion-therapy-related-conduct-in-canada.html\">re‑introduced legislation</a>&nbsp;to protect the dignity and equality of LGBTQ2 people by criminalizing conversion therapy. This cruel, harmful, and degrading practice has had disastrous effects on too many lives and has no place in Canada. We also launched a process to engage LGBTQ2 communities in areas such as health care, safety, housing, homelessness, and employment in order to better understand their daily realities and experiences. This is a meaningful step towards the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/free-to-be-me/lgbtq2-action-plan.html\">first federal LGBTQ2 Action Plan</a>. In Budget 2021, we have proposed new funding to continue this important work and to set up an LGBTQ2 Projects Fund. This new fund would support community-based initiatives that address key issues affecting LGBTQ2 communities. Measures like these can make a real difference in the lives of LGBTQ2 people in communities across the country.</p>\n\n<p>“In addition to our work at home, Canada continues to be a global leader in defending LGBTQ2 rights internationally, including through our active membership in the Equal Rights Coalition.</p>\n\n<p>“On this day, we also recognize the brave and tireless work of advocates and ally organizations from coast to coast to coast who provide support to lesbian, gay, bisexual, transgender, queer, and two-spirit individuals in Canada. This includes <a href=\"https://www.fondationemergence.org/?lang=en\">Fondation Émergence</a>, which created the first day against homophobia&nbsp;in 2003 and continues to bring Canadians together to advance LGBTQ2 rights.</p>\n\n<p>“Everyone deserves to be able to have pride in who they are and to live a true, authentic life – free from discrimination and persecution – regardless of who they love or who they are. Today, and every day, I invite Canadians to stand up for LGBTQ2 rights and celebrate the diversity and strength of our communities. Together, we must challenge stigma, denounce prejudice, and condemn violence to build a safer, more compassionate, and more inclusive country.”</p></div>\n      "
}