{
  "path": "/en/news/statements/2017/09/14/statement-prime-minister-death-member-parliament-arnold-chan",
  "pageTitle": "Statement by the Prime Minister on the death of Member of Parliament Arnold Chan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement after learning of the death of Member of Parliament Arnold Chan:</p><p>“Canada lost one of its most devoted servants today.</p><p>“I was deeply saddened to learn of the death of my close friend and colleague Arnold Chan. On behalf of all Canadians, Sophie and I offer our deepest condolences to his wife, Jean; to their three sons, Nathaniel, Ethan, and Theodore;&nbsp;and to Arnold’s parents, brother, friends, and constituents.</p><p>“Arnold was elected to serve the people of Scarborough-Agincourt in 2014. For three and a half years, he distinguished himself as a thoughtful, kind and – above all – tireless advocate for Canadians. He believed deeply in our democracy and became one of its most faithful and eloquent guardians.</p><p>“Arnold accomplished all of this despite battling cancer throughout most of his&nbsp;time as an MP. Even at his sickest, he found the strength to stand up in the House of Commons and represent his constituents, who he cared about so deeply.</p><p>“In June, Arnold delivered an impassioned speech to the House. I encourage all Canadians to take time today to listen to <a href=\"http://www.cpac.ca/en/programs/house-of-commons/episodes/49352414/\">Arnold’s words</a>, which hold lessons for us all. He reminds us that real democracy means listening to each other instead of talking over each other, and that our civic duty includes not just casting a ballot but taking care, in our everyday actions, of the country we are lucky to call home.</p><p>“In 2015, Arnold became Deputy Leader of the Government in the House of Commons. He was a committed advocate for the Armenian-Canadian community and chaired the Canada-Armenia Parliamentary Friendship Group.</p><p>“I am forever enriched by Arnold’s friendship, as Canadians are by his leadership and devoted service. He leaves us with wise words that he truly embodied: ‘We should use our heads, but follow our hearts.’”</p></div>\n      "
}