{
  "path": "/en/news/readouts/2022/02/25/prime-minister-justin-trudeau-speaks-prime-minister-boris-johnson-united",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister Boris Johnson of the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Prime Minister Boris Johnson of the United Kingdom<strong> </strong>about Russia’s illegal invasion of Ukraine’s sovereign territory.</p>\n\n<p>Prime Minister Trudeau strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty and independence of Ukraine. The two leaders stressed that Russia’s actions threaten peace and order in Europe and around the world, are blatant violations of international law, and will not be tolerated.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson recognized the heroic efforts and sacrifices of the Ukrainian armed forces and people, and committed to further support them. The leaders discussed the heavy, punitive sanctions against those in Russia who are directly responsible for this tragedy. They also stressed the importance of maintaining unity among partners and allies and continuing to support Ukraine.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Johnson agreed to continue coordinating closely on efforts with allies and partners to impose severe costs on Russia.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine\">Statement by the Prime Minister on Russia’s attack in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/22/canada-announces-support-address-situation-ukraine\">Canada announces support to address the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}