{
  "path": "/en/news/news-releases/2017/02/10/governor-general-canada-visit-kingdom-sweden",
  "pageTitle": "Governor General of Canada to visit the Kingdom of Sweden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced Their Excellencies the Right Honourable David Johnston, Governor General of Canada, and Mrs. Sharon Johnston will conduct a state visit to the Kingdom of Sweden, with stops in Stockholm, Malmö, Lund and Gothenburg from February 19 to 23, 2017.</p><p>Their Majesties King Carl XVI Gustaf and Queen Silvia will be hosting Their Excellencies during the visit, which will focus on building innovative, sustainable societies that benefit everyone.</p><h2>Quote</h2><blockquote><p>“Canada and Sweden have a great deal in common as Northern countries that are firmly committed to human rights, the environment, free trade, and the well-being and prosperity of their citizens. This visit by the Governor General of Canada will help further strengthen our social and commercial ties, and reaffirm our warm friendship.”<br> <cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>This will be the second time a Canadian governor general conducts a visit to the Kingdom of Sweden.</li><li>Canada and Sweden collaborate on Northern issues within the Arctic Council, including on sustainable development and environmental protection.</li><li>Significant trade and investment flow between the two countries, with close cooperation in innovation, science and technology.</li><li>Sweden is one of Canada’s top priority countries for investment as it is home to a number of large, technologically sophisticated, multi-national companies and dynamic and innovative small-to-medium sized enterprises.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.arctic-council.org/index.php/en/\">The Arctic Council</a></li><li><a href=\"http://www.canadainternational.gc.ca/sweden-suede/index.aspx?lang=eng\">The Embassy of Canada to Sweden</a></li></ul></div>\n      "
}