{
  "path": "/en/news/statements/2018/10/29/prime-minister-welcomes-final-report-canada-united-states-council",
  "pageTitle": "Prime Minister welcomes final report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the final report from the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders:</p><p>“I am pleased to welcome today the final report from the <a href=\"https://advancingwomeninbusiness.com/\">Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders</a>, which was created in February 2017 to drive women’s participation, leadership, and success in the workforce.</p><p>“Women entrepreneurs and business leaders are changing the game, creating good, well-paying, middle class jobs, and growing economies that benefit everyone. Over the past year, the Council has provided important recommendations on the work we need to do to support them: grow women-owned businesses, advance women’s participation in STEM fields, help more women start their own businesses and pursue high growth enterprises, and increase women’s access to capital.</p><p>“As the final report highlights, to create real opportunities for women business leaders, we need to make gender diversity in leadership a priority. When companies successfully promote gender diversity on their executive teams, they perform better financially, drive innovation, grow our economy, and strengthen the middle class. All of us benefit when women have the tools and resources they need to participate at the highest levels of our businesses and economy. By identifying clear goals and taking concrete action, we can eliminate the barriers that hold women back.</p><p>“Canada will continue to champion gender equality at home and abroad. Budget 2018 put gender equality at its core and laid the groundwork to close the gender wage gap. With the budget, we took action on the Council’s earlier recommendations, and announced the Women’s Entrepreneurship Strategy and new policies to help more parents take parental leave. We also introduced new legislation to encourage diversity on boards and recognize corporations committed to promoting women leaders. Businesses succeed when their highest levels of leadership reflect our diversity – and these changes are giving Canadian businesses a competitive advantage. It will take all of us, working together, to make gender equality a reality – and Canada will continue to collaborate with partners around the world to move us closer to that goal.</p><p>“Women’s leadership is key to tackling the problems we face today, and women-led businesses are creating jobs and opportunities for the middle class and people working hard to join it. Together, we can make sure women have the tools they need to succeed and prosper. I thank the members of the Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders for their vital work and their important recommendations on how we can promote women’s leadership across our economy. I know their contributions will continue to inspire us as we work together to support women leaders in business and beyond.”</p></div>\n      "
}