{
  "path": "/en/news/readouts/2022/01/19/prime-minister-justin-trudeau-speaks-prime-minister-sweden-magdalena",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Sweden Magdalena Andersson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Sweden, Magdalena Andersson, to offer his congratulations on becoming Sweden’s first woman Prime Minister. Prime Minister Trudeau recognized Sweden’s leadership on gender equality and Prime Minister Andersson’s gender-balanced Cabinet.</p>\n\n<p>The two leaders reaffirmed the deep relationship and ongoing collaboration between Canada and Sweden, based on common values, interests, and priorities.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Andersson discussed their shared concerns about Russia’s aggressive and destabilizing actions in and around Ukraine and the Baltic region. They agreed on the importance of continued coordination and engagement among allies and partners. Prime Minister Trudeau expressed the imperative for Russia to de-escalate the situation, and emphasized that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions. He reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The two leaders discussed the downing of Ukraine International Airlines Flight 752 and their commitment to continuing to pursue justice from Iran for the victims of this tragedy.</p>\n\n<p>The prime ministers further agreed that Canada, Sweden, and other likeminded countries must cooperate and coordinate their efforts to address current global challenges. They emphasized the importance of a green, inclusive, and sustainable economic recovery that leaves no one behind. They discussed the importance of a common price on pollution to ensure equitable trade and competitiveness.</p>\n\n<p>Prime Minister Trudeau emphasized that he looked forward to continued cooperation with Prime Minister Andersson and to working together on shared priorities, including climate action, security, and prosperity and economic growth for the middle class.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/sweden-suede/bilateral_relations_bilaterales/canada_sweden-suede.aspx?lang=eng\">Canada-Sweden Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/12/g7-foreign-ministers-statement-on-russia-and-ukraine.html\">G7 Foreign Ministers’ Statement on Russia and Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/flight-vol-ps752.aspx?lang=eng\">Canada’s response to Ukraine International Airlines Flight 752 tragedy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2022/01/08/prime-ministers-remarks-national-day-remembrance-victims-air-disasters\">Prime Minister’s remarks for the National Day of Remembrance for Victims of Air Disasters</a></li>\n</ul></div>\n      "
}