{
  "path": "/en/news/readouts/2021/04/20/prime-minister-justin-trudeau-speaks-secretary-general-united-nations",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Secretary-General of the United Nations António Guterres | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Secretary-General of the United Nations, António Guterres.</p>\n\n<p>The Prime Minister and the Secretary-General discussed the ongoing challenges of the COVID-19 pandemic and the urgency of getting people everywhere vaccinated as quickly as possible.</p>\n\n<p>They spoke of their collaboration, together with Prime Minister of Jamaica Andrew Holness, in hosting a high-level meeting on International Debt Architecture and Liquidity on March 29, and the importance of building back better to ensure a strong economic recovery that benefits everyone.</p>\n\n<p>Prime Minister Trudeau and Secretary-General Guterres discussed the importance of raising ambition on climate change, backed with concrete plans, and looked forward to participating in this week’s Leaders Summit on Climate, hosted by President of the United States of America Joe Biden.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/03/29/world-leaders-meet-strengthening-financial-measures-boost-efforts\">World leaders to meet on strengthening financial measures to boost efforts to cope with COVID-19 fallout</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/17/prime-minister-trudeau-participate-leaders-summit-climate\">Prime Minister Trudeau to participate in Leaders Summit on Climate</a></li>\n</ul></div>\n      "
}