{
  "path": "/en/news/readouts/2022/11/08/prime-minister-justin-trudeau-meets-new-brunswick-premier-blaine-higgs",
  "pageTitle": "Prime Minister Justin Trudeau meets with New Brunswick Premier Blaine Higgs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with New Brunswick Premier Blaine Higgs to discuss energy issues, the Atlantic Loop, and other shared priorities. The Prime Minister was also in Oromocto to announce new federal funding to help connect rural homes across Canada to high-speed Internet, including more than 16,000 homes in New Brunswick.</p>\n\n<p>The Prime Minister and the Premier discussed ways the federal and provincial governments can continue to work together to improve energy security and resiliency while reducing costs for consumers by supporting a clean electric grid in Atlantic Canada. The leaders spoke about small modular reactors, liquified natural gas, and the importance of continued collaboration on the Atlantic Loop to support the phase-out of coal, achieve net-zero, ensure energy security, and create new opportunities for people and businesses in the region.</p>\n\n<p>The leaders also discussed the importance of protecting language rights and official bilingualism&nbsp;in the province and strengthening health care.</p>\n\n<p>Prime Minister Trudeau and Premier Higgs agreed to keep working together on these and other shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/08/connecting-canadians-high-speed-internet-new-brunswick-and-across\">Connecting Canadians with high-speed Internet in New Brunswick and across Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/atlantic-canada-opportunities/news/2022/11/government-of-canada-supports-a-netzero-industry-transformation.html\">Government of Canada supports a net‑zero industry transformation</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/03/government-of-canada-invests-in-small-modular-reactor-technology-to-help-transition-canada-to-net-zero-with-cleaner-sources-of-energy.html\">Government of Canada invests in small modular reactor technology to help transition Canada to net zero with cleaner sources of energy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/natural-resources-canada/news/2022/03/clean-power-roadmap-for-atlantic-canada-unveils-collective-vision-for-an-interconnected-power-grid.html\">Clean Power Roadmap for Atlantic Canada Unveils Collective Vision for an Interconnected Power Grid</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/10/08/prime-minister-justin-trudeau-speaks-new-brunswick-premier-blaine-higgs\">Prime Minister Justin Trudeau speaks with New Brunswick Premier Blaine Higgs</a></li>\n</ul></div>\n      "
}