{
  "path": "/en/news/statements/2023/02/05/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 5 to 11, 2023:</p>\n\n<p>“Canada has a proud tradition of supporting international development efforts, and today, on the first day of&nbsp;<a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/idw-sdi.aspx?lang=eng\">International Development Week</a>, we commit to continuing that work. In the face of global challenges ranging from Russia’s ongoing aggression against Ukraine to global inflation, food and energy insecurity, and the climate crisis, Canada is ready to meet the moment. On this day, we also recognize all those who work hard to advance the United Nations’ <a href=\"https://www.un.org/sustainabledevelopment/\">Sustainable Development Goals</a> (SDGs) and build a more peaceful, inclusive, and prosperous world for everyone.</p>\n\n<p>“A unique Canadian tradition since 1991, International Development Week shines a light on the work of international development workers, volunteers, and partners, and provides an opportunity to highlight Canada’s important contributions on the international stage. Ordinary citizens and experts, driven by compassion and a belief in a better world, are working to advance human rights, create opportunities, and improve the lives of people here at home and abroad. By highlighting this important work, International Development Week invites all of us to join global efforts and be agents of positive change.</p>\n\n<p>“The Government of Canada continues to respond to this call too, by supporting international development efforts and making progress on key priorities, including advancing global health, addressing nutrition needs, and promoting gender equality around the world. In 2020-21, we provided close to $1.2&nbsp;billion to meet the humanitarian needs of some 115&nbsp;million people worldwide. <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a> guides our efforts by addressing the unique challenges faced by women, girls, and 2SLGBTQI+ persons around the world, to reduce the poverty and inequality that disproportionately impacts these groups and others in situations of vulnerability. We also provided support to over 800 women’s rights organizations working to advance the rights of women and girls and promote gender equality through the Women’s Voice and Leadership initiative. Canada also recognizes the importance of supporting developing countries in the fight against climate change. That’s why, in 2021, we doubled our previous commitment to international climate finance to&nbsp;$5.3&nbsp;billion over the next five years, and at COP15 in Montréal last December, we announced new funding to advance conservation efforts in developing countries, which are home to the vast majority of the world’s biodiversity.</p>\n\n<p>“Canada is also doing its part to implement the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">2030 Agenda for Sustainable Development</a> and its 17 SDGs to put us on an inclusive and resilient path toward ending poverty and hunger, achieving equality, and creating sustainable economic growth while protecting the planet. This is an effort to ensure everyone can fulfil their potential. In 2021, we released a <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/national-strategy.html\">national strategy</a> to guide our efforts to implement the 2030 Agenda with a whole-of-government, whole-of-society approach, recognizing that everyone can play a role in achieving the SDGs. As Co-Chair of the UN Secretary General’s SDG Advocates group, I continue to rally countries, governments, the private sector, and others to come together to raise our voices and accelerate our progress toward building a sustainable, resilient, and equitable future for all.</p>\n\n<p>“Let’s <a href=\"https://www.international.gc.ca/campaign-campagne/idw-sdi/index.aspx?lang=eng\">#GoForTheGoals</a> together! I encourage everyone <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/idw-sdi.aspx?lang=eng\">to learn more about the SDGs, to get involved, and to take action</a>. And this week, let’s also thank Canadians who are working tirelessly toward a better tomorrow for everyone.”</p></div>\n      "
}