{
  "path": "/en/news/itineraries/2018/10/04/itinerary-friday-october-5-2018",
  "pageTitle": "Itinerary for Friday, October 5, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>Windsor, Ontario</h2><p><b>9:00 a.m. </b>The Prime Minister, along with Minister of Infrastructure and Communities François-Philippe Champagne, will make an announcement regarding the Gordie Howe International Bridge. A media availability will follow.</p><p>Canadian Port of Entry<br>35 Prospect Avenue</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to arrive no later than 8:15 a.m., and are required to present identification upon check-in.</li><li>Designated parking is available adjacent to the event location. Please follow the direction of traffic flaggers to the designated parking area. A shuttle service will be provided from the designated parking area to the event location.</li><li>Prior to moving into the event area, all media equipment (including satellite trucks) will be required to undergo a security check.</li><li>Please note that this event will take place outdoors.</li></ul></ul><p><b>10:45 a.m.</b> The Prime Minister and Minister of Employment, Workforce Development and Labour Patricia Hajdu will participate in a roundtable with labour union leaders.</p><p>Huron Room, Second Floor<br>Best Western Plus Waterfront Hotel<br>277 Riverside Drive West&nbsp;&nbsp;</p><p><b>Notes for media: </b></p><ul><ul><li>Photo opportunity and open coverage for opening remarks</li><li>Media are asked to present themselves to the main lobby no later than 10:20 a.m.</li></ul></ul><p><b>12:30 p.m. </b>The Prime Minister will attend the Windsor-Detroit Bridge Authority BBQ, and will deliver remarks.</p><p>Senator David A. Croll Park<br>73 University Avenue East</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage</li><li>Media are asked to present themselves to the media riser no later than 12:15 p.m.</li></ul></ul><p><b>1:30 p.m. </b>The Prime Minister and Minister of Employment, Workforce Development and Labour Patricia Hajdu will tour the FCA Windsor assembly plant.</p><p>FCA Windsor<br>2199 Chrysler Centre</p><p><b>Notes for media: </b></p><ul><ul><li>Photo opportunity for the tour</li><li>Media are asked to arrive no later than 1:10 p.m.</li><li>Media are asked to RSVP in advance to <a href=\"mailto:Daniela.m.ferro@fcagroup.com\">Daniela.m.ferro@fcagroup.com</a>.</li><li>Media must check in with plant gate security upon arrival. Limited parking for media will be reserved inside the main plant gate, located at the corner of Tecumseh Road and Chrysler Centre.</li><li>Closed toe, flat shoes must be worn.</li></ul></ul><p><b>2:45 p.m. </b>The Prime Minister will tour the Unemployed Help Centre of Windsor, and will participate in the Thanksgiving turkey distribution.</p><p>Unemployed Help Centre<br>6955 Cantelon Drive</p><p><b>Notes for media: </b></p><ul><ul><li>Photo opportunity for the turkey distribution only. Please note this will take place outdoors.</li><li>Media are asked to arrive no later than 2:30 p.m.</li><li>Media are encouraged to park in the visitors parking lot, on the Food Bank side.</li></ul></ul></div>\n      "
}