{
  "path": "/en/news/news-releases/2021/04/21/prime-minister-announces-high-commissioner-canada-united-kingdom",
  "pageTitle": "Prime Minister announces High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Honourable Ralph Goodale has been appointed as High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland.</p>\n\n<p>As High Commissioner, Mr. Goodale will provide strategic advice to the Prime Minister on areas of importance to people in Canada and the United Kingdom. His decades of experience will further strengthen the relationship between our two countries as we continue to work together to tackle the greatest challenges of today and tomorrow, including beating the global COVID-19 pandemic, fighting climate change, pursuing post-Brexit trade, creating jobs and opportunity for our people, and building back a better world for everyone.</p>\n\n<p>For the past year, Mr. Goodale has served as a special advisor to the Prime Minister for Canada’s ongoing response to Iran’s shooting down of Ukraine International Airlines Flight PS752. His report on this tragedy was published last December, but the search for transparency, accountability, and justice for the families of the many Canadian victims continues. The Prime Minister will continue to consult Mr. Goodale for his experience and expertise in this area.</p>\n\n<p>Canada and the United Kingdom are close friends and allies with a long history of strong people-to-people ties and common values. Our two countries work together in many international organizations to advance our common interests, including gender equality, science and innovation, trade and national security, and education.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Ralph Goodale’s decades of experience will continue to serve Canadians well in his new position as High Commissioner for Canada in the United Kingdom of Great Britain and Northern Ireland. As a trusted advisor in London, he will work to further strengthen the friendship between our two countries while we work together to tackle our greatest challenges, and continue to offer thoughtful and heartfelt advice on behalf of Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the UK share a sovereign, Her Majesty Queen Elizabeth II, and are among the oldest parliamentary democracies in the world.</li>\n\t<li>The UK is one of Canada’s largest trading partners. The Canada-UK Trade Continuity Agreement entered into force on April 1, 2021, preserving preferential market access for businesses in both countries.</li>\n\t<li>Canada and the UK work together through international organizations including the United Nations, NATO, the Five Eyes, the G7, the G20, and the Commonwealth. This year, the two countries will continue this work in support of the UK’s agenda as G7 President.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/04/21/honourable-ralph-goodale\">Ralph Goodale</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/united_kingdom-royaume_uni/index.aspx?lang=eng\">High Commission of Canada in the United Kingdom</a></li>\n</ul></div>\n      "
}