{
  "path": "/en/news/news-releases/2017/11/30/prime-minister-nominates-next-commissioner-official-languages",
  "pageTitle": "Prime Minister nominates the next Commissioner of Official Languages | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Raymond&nbsp;Théberge as the new Commissioner of Official Languages.</p><p>Mr. Théberge has served as President and Vice-Chancellor of l’Université de Moncton since 2012. A Franco-Manitoban, his distinguished career spans more than 35 years as an educator, academic, author, and senior official in both the governments of Manitoba and Ontario.&nbsp;</p><p>The Commissioner of Official Languages is responsible for promoting equality of English and French in Canadian society, and supporting the preservation and development of official language minority communities. The Commissioner also ensures the equality of English and French within federal institutions and other organizations subject to the <i>Official Languages Act</i>.</p><p>Under the <i>Official Languages Act</i>, the nomination must be approved by the House of Commons and the Senate.</p><h2>Quote</h2><blockquote><p>“Raymond Théberge’s passion for linguistic duality and minority language rights makes him the perfect choice to be Canada’s new Commissioner of Official Languages. His experience as a community advocate, an academic and a public servant has provided him with a greater appreciation of the challenges faced by English- and French-speaking communities across Canada. I am confident that Mr. Théberge will hold our government to account for the full implementation of the <i>Official Languages Act</i>.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>If appointed, Mr. Théberge would be the first Commissioner of Official Languages from Western Canada, and the first from outside Ontario or Quebec to hold the position. With experience in Manitoba, Ontario, and New Brunswick, Mr.&nbsp;Théberge brings with him a unique perspective and understanding of the challenges facing different minority linguistic communities across Canada.</li><li>The Commissioner of Official Languages is an Agent of Parliament appointed under the <i>Official Languages Act</i> for a term of seven years.</li><li>The appointment is made by the Governor in Council after consultation with the leader of each recognized party in the Senate and House of Commons and approval by resolution of both Houses of Parliament.</li><li>The Office of the Commissioner of Official Languages was created in 1970 under the <i>Official Languages Act</i> to protect and promote linguistic duality.</li><li>The Commissioner of Official Languages reports directly to Parliament.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/11/30/raymond-théberge\">Raymond Théberge</a></li></ul></div>\n      "
}