{
  "path": "/en/news/news-releases/2020/06/01/prime-minister-announces-support-help-communities-create-jobs-and",
  "pageTitle": "Prime Minister announces support to help communities create jobs and restart the economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As we continue to focus on the health and safety of all Canadians during the COVID-19 pandemic, we are also taking immediate action to support small towns and big cities across the country to restart the economy, and create good, well-paying jobs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that funding delivered through the federal Gas Tax Fund will be accelerated this year to help communities as quickly as possible while respecting public health guidelines.</p>\n\n<p>This means that $2.2 billion in annual federal infrastructure funding for communities will be delivered in one payment in June. Early delivery of the full funding for 2020-21 will help communities quickly move forward with infrastructure projects that will improve our quality of life and help restart local economies.</p>\n\n<p>Communities have flexibility to use the funding to meet their local needs. Projects could include access to high-speed broadband, improvements to water and road systems, and the building of cycling and walking paths. These projects create jobs, and improve how Canadians live, work, and play.</p>\n\n<p>Since the start of the crisis, Prime Minister Trudeau and Deputy Prime Minister Chrystia Freeland have worked closely with premiers. The Government of Canada is working with the provinces and territories to look at ways to further support municipalities as part of this ongoing collaboration.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“From coast to coast to coast, Canadians are feeling the economic impacts of COVID-19, while they do what they can to protect the health and safety of their families and communities. That is why we are taking action to restart the economy, get Canadians back to work, and come out of this stronger. This funding will help communities address their immediate needs, while also planning the infrastructure they need for the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we continue to face the greatest public health and economic crisis of our time, immediate investments in infrastructure will play a vital role in addressing the needs of municipalities and First Nations communities, reviving local economies, and improving the lives of Canadians. The Government of Canada is taking quick action to support communities across Canada by accelerating this year’s payment through the federal Gas Tax Fund. This will put $2.2 billion in the hands of communities now to fund local infrastructure projects like public transit, high-speed broadband, and recreation centres, and get Canadians to work.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Catherine McKenna, Minister of Infrastructure and Communities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In past years, payments to communities through the federal Gas Tax Fund have typically been made in two instalments, in summer and later in the year.</li>\n\t<li>The federal Gas Tax Fund is a long-term, indexed source of funding for over 3,600 communities across the country. In recent years, it has supported thousands of projects annually.</li>\n\t<li>The federal Gas Tax Fund includes 18 different project categories, including capacity building, sport infrastructure, and roads. Communities can also use the funds immediately for priority projects, bank them for later use, pool the dollars with other communities for shared infrastructure projects, or use them to finance major infrastructure expenditures.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada's Long-Term Infrastructure Plan</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/gtf-fte-eng.html\">The Federal Gas Tax Fund</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/prog/gtf-fte-tab-eng.html\">Federal Gas Tax Fund Allocation Table</a></li>\n</ul></div>\n      "
}