{
  "path": "/en/news/news-releases/2016/05/24/prime-minister-canada-concludes-his-visit-tokyo",
  "pageTitle": "Prime Minister of Canada concludes his visit to Tokyo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada has committed to deepen and renew its social and economic engagement with Asia, in order to better pursue Canada’s interests and values.</p>\n<p>Today, the Prime Minister, Justin Trudeau, concluded his official working visit in Japan, which included an audience with the Emperor and Empress of Japan, and a meeting with Prime Minister Shinzo Abe.</p>\n<p>While in Tokyo, the Prime Minister met with representatives of the automotive sector to underline that Canada is a great place to invest. He also took the opportunity to discuss trade opportunities, promote Canadian quality, and highlight Canada’s research and development capacity and innovation expertise. The automotive sector represents tremendous opportunities to create jobs, strengthen the middle class, and grow both countries’ economies.</p>\n<p>During the meeting with Prime Minister Abe, the two leaders discussed a wide range of issues important to Canada and Japan, including the implementation of the Paris Agreement on climate change, global health initiatives, infrastructure for sustainable growth, and collaboration on Arctic science. Finally, they discussed the revitalization of the Canada-Japan Joint Economic Committee, an important forum to improve economic ties between Canada and Japan.</p>\n<p><strong>Quote</strong></p>\n<p>“Improving trade relations with Japan is a top priority of our government. The growing collaboration between Canada and Japan – on innovation and science – will contribute directly to our economic growth, and will benefit all Canadians.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada </em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Prime Minister Trudeau last met with Prime Minister Abe on March 31, 2016 in Washington D.C.</li>\n<li>Japan is among Canada’s top five bilateral merchandise trading partners.</li>\n<li>This year marks the 40th anniversary of the Canada-Japan Joint Economic Committee (JEC), which began in 1976 based on the Japan-Canada Framework for Economic Cooperation.</li>\n<li>The JEC focuses on priority areas of cooperation, including infrastructure, energy, science and technology, the business environment, promoting investment and tourism. A cooperative working group led by Global Affairs Canada and Japan’s Ministry of Foreign Affairs will monitor progress within these priority areas of cooperation to ensure that the framework is as effective as possible.</li>\n<li>Canada and Japan are partners in numerous international groups and organizations including the G7, G20, APEC, the ASEAN Regional Forum, and the OECD.</li>\n</ul></div>\n      "
}