{
  "path": "/en/news/news-releases/2015/11/23/prime-minister-hosts-first-ministers-meeting",
  "pageTitle": "Prime Minister hosts First Ministers’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, is hosting a First Ministers’ Meeting today with provincial and territorial Premiers to discuss the country’s strategy to fight climate change.</p>\n<p>A main focus of today’s First Ministers’ Meeting, the first held since 2009, is to discuss climate change and Canada’s approach to the negotiations in advance of COP21 (the 21<sup>st</sup> Conference of the Parties to the United Nations Framework Convention on Climate Change).</p>\n<p>The Prime Minister and the Premiers are also discussing the next steps to support the successful resettlement of 25,000 Syrian refugees to Canada, with a focus on how to support their integration following a robust security screening process.</p>\n<p>Prior to the First Ministers’ Meeting, a climate science briefing is being provided by two of Canada’s top climate scientists: Dr. Greg Flato, Senior Scientist with Environment and Climate Change Canada, and Mr. Alain Bourque, Executive Director at Ouranos, a Montreal-based consortium that focusses its work on climate science. The briefing will be moderated by Jeremy Hansen, an astronaut with the Canadian Space Agency.</p>\n<p>The briefing includes a Google Hangout during which high-school students will ask questions about the science and impacts of climate change.</p>\n<p><strong>Quote</strong></p>\n<p>“The challenges we face as a country require a true partnership between the federal government and the provinces and territories, which can only be achieved by sitting down together and engaging in an open and continuous dialogue. I have the deepest respect for our Premiers, and for the knowledge and range of perspectives they bring to the table. It is exciting to engage with them today on the pressing issues of climate change and the resettlement of Syrian refugees, and I look forward to regular collaboration on a range of issues important to Canadians.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Prime Minister has committed to holding annual First Ministers’ Meetings, and to open and continuous dialogue with each provincial and territorial Premier, in service to the people of their province or territory.</li>\n<li>COP21, also known as the Paris Climate Conference, will be held November 30 to December 11, 2015, in Paris, France, and is the culmination of four years of negotiations towards a new global climate agreement.</li>\n<li>COP21 will see Canada engaging with other countries in negotiations towards the adoption of a new international climate change agreement. The Prime Minister has invited all provincial and territorial leaders to attend, as well as the federal Opposition leaders and Green Party leader Elizabeth May.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://canadaspremiers.ca/en/\">Canada’s Premiers </a>&nbsp;</li>\n</ul></div>\n      "
}