{
  "path": "/en/news/statements/2020/02/02/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 2 to 8, 2020:</p>\n\n<p>“Today marks the beginning of the 30th <a href=\"https://www.international.gc.ca/campaign-campagne/idw-sdi/index.aspx?lang=eng\">International Development Week</a> – a time to recognize the efforts and sacrifices of international development workers, volunteers, and partners who help make the world a better place for everyone.</p>\n\n<p>“This year’s theme – Go for the Goals – challenges us to take action at home and abroad to support the goals set out in the United Nations’ <a href=\"https://www.un.org/sustainabledevelopment/development-agenda/\">2030 Agenda for Sustainable Development</a>. Staying true to our values, Canada will continue to work with partners to achieve these goals, so we can end poverty and inequality, build more prosperous and peaceful societies, and protect the planet.</p>\n\n<p>“To achieve a better and more sustainable future, we need to give everyone an equal chance at success. When women and girls are empowered and their rights are respected, they transform their families and communities for the better. That is why we launched Canada’s first <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a> to address inequality and protect the rights of women and girls around the world.</p>\n\n<p>“Canada, along with our development partners, will continue to show leadership in protecting those who are most vulnerable, and working to improve access to health care, proper nutrition, and education. We are supporting this work with targeted investments, including those to promote sustainable development and help lift more people out of poverty. We are also making inclusive education a priority, and <a href=\"https://www.canada.ca/en/global-affairs/news/2019/07/canada-announces-support-to-improve-access-to-quality-education-for-women-and-girls-in-fragile-conflict-and-crisis-situations.html\">funding projects</a> that will improve access to quality education for women and girls in crisis and conflict situations.</p>\n\n<p>“Together, we can shape a world where no one goes hungry, no one feels unsafe, and no one is left behind. On behalf of the Government of Canada, I encourage all Canadians to celebrate the many people who work hard every day to empower people, uplift communities, and build stronger economies.”</p></div>\n      "
}