{
  "path": "/en/news/news-releases/2017/06/21/prime-minister-announces-100-wellington-become-space-indigenous",
  "pageTitle": "Prime Minister announces 100 Wellington to become space for Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to advancing reconciliation with Indigenous Peoples based on recognition of rights, respect, co-operation, and partnership as the foundation for transformative change.</p><p>In support of this commitment, the Prime Minister, Justin Trudeau, today announced that a new space for Indigenous Peoples will be established at 100 Wellington Street in the National Capital Region on the ancestral land of the Algonquin people.</p><p>The Government of Canada will work in full partnership with representatives of First Nations, Inuit, and the Métis Nation on next steps in the design and redevelopment of 100 Wellington to ensure this becomes an inclusive space that reflects the vision of Indigenous Peoples and the spirit of reconciliation.</p><p>This location symbolizes a turning point in Canada’s relationship with Indigenous Peoples. It provides a concrete marker, in the heart of the Nation’s capital and facing Parliament Hill, of the importance of Indigenous Peoples to this country’s foundation, to its past and, most importantly, to its future.</p><p>The Prime Minister also announced that the Langevin Block, which sits across the street from Parliament Hill and houses the Prime Minister’s Office and the Privy Council Office, will be officially renamed the Office of the Prime Minister and Privy Council.</p><p>The Government of Canada is committed to build a nation-to-nation, Inuit-Crown, and government-to-government relationship with Indigenous Peoples in Canada. Keeping the name of Sir Hector-Louis Langevin – an individual associated with the residential school system – on the Prime Minister’s Office is inconsistent with this vision.</p><h2>Quote</h2><blockquote><p>“Together, we have taken the first steps in what we know will be a multigenerational journey toward reconciliation. We have a lot of hard work ahead, and it is to all of our benefit that Indigenous Peoples be given a lead role in shaping the future of this country. This new space – located so close to Parliament Hill – will help ensure that the dialogue we have started is sustained and deepened as we move forward together.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The redevelopment of 100 Wellington, the former United States Embassy, is part of the <a href=\"http://www.tpsgc-pwgsc.gc.ca/citeparlementaire-parliamentaryprecinct/rehabilitation/index-eng.html\">Long Term Vision and Plan for the Parliamentary Precinct</a>.</li><li>This new space is one of several Government initiatives aimed at advancing reconciliation with Indigenous Peoples. In December 2016, the Prime Minister announced the establishment of new permanent bilateral mechanisms with the Assembly of First Nations, the Inuit Tapiriit Kanatami, and the Métis National Council. The Prime Minister and key Ministers will meet with these groups to develop policy on shared priorities and monitor progress.</li></ul></div>\n      "
}