{
  "path": "/en/news/news-releases/2019/05/30/prime-minister-welcomes-increased-collaboration-united-states",
  "pageTitle": "Prime Minister welcomes increased collaboration with the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today met with Vice President of the United States, Mike Pence.</p>\n\n<p>During the visit, Prime Minister Trudeau and Vice President Pence reaffirmed the strength of the Canada-United States relationship, highlighting how the partnership between our two countries has created millions of good, middle class jobs on both sides of the border.</p>\n\n<p>The Prime Minister and Vice President discussed the ratification of the new North American Free Trade Agreement, which will create good, well-paying jobs and new opportunities for people in both countries. They then met with Canada’s council on the agreement, the Canadian Council for the United States-Mexico-Canada Agreement. The Prime Minister and Vice President also welcomed the recent lifting of U.S. tariffs on Canadian steel and aluminum, and Canada’s retaliatory tariffs, and exchanged views on efforts to resolve other trade issues, including softwood lumber and uranium.</p>\n\n<p>The Prime Minister and Vice President discussed the strong security and defence partnership between our two countries, and ways we can deepen cooperation on the management of our shared border, address irregular migration, and strengthen continental defence. The leaders also highlighted our countries’ close collaboration in space, and on energy innovation and development in North America.</p>\n\n<p>Together, Prime Minister Trudeau and Vice President Pence issued a joint statement on China’s wrongful detention of two Canadian citizens, Michael Kovrig and Michael Spavor.</p>\n\n<p>The Prime Minister and Vice President also discussed efforts to address key regional and global challenges, including ongoing reform efforts in Ukraine and the crisis in Venezuela. They reiterated their support for Interim President of Venezuela, Juan Guaidó, and expressed their shared desire for a peaceful Venezuelan-led transition through free and fair elections as soon as possible.</p>\n\n<p>The Prime Minister restated Canada’s disappointment with the U.S.’s decision not to suspend Title III of the Cuban Liberty and Democratic Solidarity (Libertad) Act of 1996, commonly known as the Helms-Burton Act.</p>\n\n<p>The Prime Minister also underscored that Canada remains committed to exercising the full extent of its rights and sovereignty over its Arctic waters, including the Northwest Passage.</p>\n\n<p>The Prime Minister also raised women’s rights and LGBTQ2 rights with the Vice President.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“There is no relationship in the world quite like the Canada-U.S. relationship. We know we are better off when we work together to grow the middle class, and create more opportunities for people on both sides of the border. Vice President Pence’s visit was a chance to deepen the partnership between our two countries—a partnership that is essential to our shared security, prosperity, and to millions of middle class jobs.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the United States share one of the largest trading relationships in the world. The two countries also share the longest, secure border in the world, over which some 384,000 people and $2.6 billion worth of goods and services cross daily.</li>\n\t<li>Bilateral merchandise trade between the two countries increased 5.7 percent to $742.9&nbsp;billion in 2018.</li>\n\t<li>Canada buys more goods from the United States than China, Japan, and the United Kingdom combined.</li>\n\t<li>The U.S. is the single greatest investor in Canada. In 2018, U.S. stock investment in Canada was $406 billion, representing nearly half of all investment in Canada.</li>\n\t<li>Nearly 9 million American&nbsp;jobs and more than 2 million Canadian jobs are supported by the bilateral economic relationship.</li>\n\t<li>Trade between NAFTA members—Canada, the United States, and Mexico—was valued at nearly $1.5 trillion in 2018.</li>\n</ul>\n\n<h2>Related product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/30/joint-statement-canada-and-united-states\">Joint statement between Canada and the United States</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/country-pays/united_states-etats_unis/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}