{
  "path": "/en/news/readouts/2020/07/13/prime-minister-justin-trudeau-speaks-president-united-states-america",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America, Donald Trump | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Donald Trump.</p>\n\n<p>The Prime Minister expressed regret for being unable to attend the celebration of the new NAFTA on July 8 in Washington, D.C. with President Trump and the President of Mexico, Andrés Manuel López Obrador.</p>\n\n<p>Prime Minister Trudeau thanked President Trump for the United States’ ongoing support to free Canadians Michael Kovrig and Michael Spavor, who have been arbitrarily detained in China. The two leaders also discussed concerns with the ongoing situation in Hong Kong and China’s imposition of a new national security law.</p>\n\n<p>The Prime Minister noted signs of economic recovery from the slowdown caused by COVID-19, including in the North American aluminum industry. The Prime Minister stated that tariffs on aluminum would hurt both countries.</p>\n\n<p>The Prime Minister raised the Black Lives Matter movement, and the need to combat systemic racism.&nbsp;</p>\n\n<p>The President and Prime Minister agreed to stay in close contact over the coming weeks and months.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/06/30/statement-deputy-prime-minister-entry-force-new-nafta\">Statement by the Deputy Prime Minister on the entry-into-force of the new NAFTA</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/latest-travel-health-advice.html#_Canada-U.S._border_restrictions_1\">Canada-U.S. border restrictions</a></li>\n</ul></div>\n      "
}