{
  "path": "/en/news/news-releases/2017/10/27/prime-minister-announces-appointment-new-chief-justice-supreme-court",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of the Supreme Court of Prince Edward Island | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Tracey L. Clements, a judge of the Supreme Court of Prince Edward Island, to the position of Chief Justice of the Supreme Court of Prince Edward Island.</p><p>She replaces the Honourable Jacqueline R. Matheson, who elected to become a supernumerary judge effective January 1, 2017, after 29 years of distinguished service as a judge.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the appointment of Tracey L. Clements as Chief Justice of the Supreme Court of Prince Edward Island. A proud Islander, her understanding – and deep appreciation – of Canada’s judicial system has been honed over a 20-year career as a practicing lawyer in PEI and, more recently, as a judge on the province’s Supreme Court. I trust that she will bring diligence, integrity and honour to her new role.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li><li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and the recommendation of the Prime Minister.</li><li>The Supreme Court of Prince Edward Island has seven full-time and supernumerary judges.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/10/27/honourable-tracey-l-clements\">The Honourable Tracey L. Clements</a></li></ul></div>\n      "
}