{
  "path": "/en/news/statements/2020/10/01/statement-prime-minister-national-seniors-day",
  "pageTitle": "Statement by the Prime Minister on National Seniors Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Seniors Day:</p>\n\n<p>“Today, we reflect on the immense contributions Canada’s seniors have made in shaping our country. They are our friends and family, neighbours, coworkers and role models, and they have laid the foundation for a better life for millions of Canadians.</p>\n\n<p>“This year has been tough for many of Canada’s seniors. Unfortunately, many have experienced considerable health, economic, and social challenges throughout the COVID-19 pandemic, and the disease has disproportionately affected them, particularly those living in long-term care facilities. Some seniors spent prolonged periods alone and separated from their families and communities. Public health measures meant many seniors needed to rely on friends, families or community services for access to groceries and medicine. Many also saw their savings impacted. That is why the Government of Canada has introduced measures to support seniors and help them get through this difficult time.</p>\n\n<p>“Shortly after the start of the pandemic, the Government of Canada contributed $9 million in funding through the United Way Canada to work with communities in each province and territory to support isolated or vulnerable seniors. We invested a further $350 million to community-based charities and non-profit organizations to help vulnerable Canadians through the <a href=\"https://www.canada.ca/en/services/benefits/emergency-community-support-fund.html\">Emergency Community Support Fund</a>. The Fund provided, among others, added support for the home delivery of groceries and medicine, transportation services for medical appointments, as well as enhanced information and support lines. We also expanded the <a href=\"https://www.canada.ca/en/employment-social-development/programs/new-horizons-seniors/notice-covid-19.html#h2.01\">New Horizons for Seniors Program</a> with an additional $20 million to support organizations that improve seniors’ quality of life by maintaining social support networks through community-based projects.</p>\n\n<p>“The Government of Canada introduced a further $2.5 billion investment in a <a href=\"https://www.canada.ca/en/services/benefits/publicpensions/notice-covid-19/one-time-payment.html\">one-time tax-free payment</a> of $300 for seniors eligible for the Old Age Security pension, with an added $200 for those benefiting from the Guaranteed Income Supplement. This measure provided individuals eligible for both OAS and GIS a total of $500 in supports. And, to ensure that seniors continue receiving their benefits, the Guaranteed Income Supplement was temporarily extended for seniors whose 2019 income information had not been assessed. We have also provided a one-time special payment through the Goods and Services Tax credit averaging $375 for single seniors and $510 for senior couples, which benefited over 4 million seniors. And, we gave seniors extra flexibility with their Registered Retirement Income Funds by reducing minimum withdrawals by 25 per cent for 2020.</p>\n\n<p>“Members of the Canadian Armed Forces also assisted in long-term care facilities, and the Canadian Red Cross is still helping. They did a crucial job helping our grandparents, parents and elders, and for that, we owe them our deepest thanks.</p>\n\n<p>“In last week's Throne Speech, we said that we will continue to help and protect seniors, by working with Parliament on <em>Criminal Code</em> amendments to penalize those who neglect seniors under their care. We will also work with the provinces and territories to set new national standards for long-term care, take additional action to help people stay in their homes longer, increase Old Age Security once a senior turns 75, and boost the Canada Pension Plan survivor’s benefit.</p>\n\n<p>“Now that we are building back our economy and starting our recovery, let us find strength in the legacy of resiliency, determination and compassion provided to us by seniors. We owe them a debt of gratitude. Now, we need to be there for those who raised us and built this country. Together, on National Seniors Day, let us recommit ourselves to a fairer, healthier, more resilient Canada that is more inclusive for everyone.” &nbsp;&nbsp;&nbsp;</p></div>\n      "
}