{
  "path": "/en/news/news-releases/2021/03/22/unprecedented-agreement-connect-nearly-150000-quebecers-high-speed",
  "pageTitle": "Unprecedented agreement to connect nearly 150,000 Quebecers to high-speed Internet | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Government of Canada, the Government of Quebec, and Internet service providers (ISPs) Vidéotron, Cogeco, Bell, Xplornet, Sogetel, and TELUS are partnering to launch the extensive Canada-Quebec Operation High Speed, to connect nearly 150,000 homes to high-speed Internet by September 2022. This operation is made possible by an equal investment totalling $826.3 million from the Government of Canada and the Government of Quebec.</span></span></span></p>\n\n<p><span><span><span>Prime Minister Justin Trudeau and Premier François Legault were joined today by Minister of Innovation, Science and Industry François-Philippe Champagne, and Parliamentary Assistant to the Premier of Quebec (high-speed Internet) Gilles Bélanger to make this announcement.</span></span></span></p>\n\n<p><span><span><span>In the context of the global COVID-19 pandemic, when access to quality Internet service has become even more critical, it is imperative to think outside the box in order to accelerate the implementation of this service. By working with ISPs, establishing a deadline and penalties for these new contracts, and covering 100 per cent of the homes in the project area, we will ensure that the operation is completed quickly.</span></span></span></p>\n\n<h2><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>Quotes</span></span></span></span></span></h2>\n\n<blockquote>\n<p><span><span><span>“Over the past year, many people have worked from home, studied from their kitchen table, shopped online, and accessed government services remotely. So it’s more important than ever that everyone has access to high-speed Internet. We are working closely with the Quebec government to build strong communities and a more resilient future for all.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span>“Today, we are announcing an unprecedented agreement on high-speed Internet. We are starting a major acceleration of the rollout throughout Quebec. This is a giant leap forward towards fulfilling our commitment to connect all Quebecers by fall 2022. The pandemic has clearly demonstrated that high-speed Internet is an essential service for distance learning, working remotely, and staying connected with our loved ones. It is absolutely essential when starting and developing a business. It’s a vital economic lever for the growth of all our regions.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span>François Legault, Premier of Quebec</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“People in rural Quebec are in dire need of reliable connectivity. The COVID-19 crisis has shown how important it is to have access to digital broadband services. By investing in these projects through the Connect to Innovate program and the Universal Broadband Fund, we can help bridge the digital divide, stimulate economic growth, and create jobs.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Hon. François-Philippe Champagne, Federal Minister of Innovation, Science and Industry</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“With today’s announcement, Quebec has truly become the first in Canada when it comes to connecting its population to high-speed Internet. To get to this point, we had to change the way we do things in order to speed things up. I would like to thank our partners who helped make this announcement a reality. We were able to overcome challenges to reach this unprecedented agreement. This is proof that we can challenge the status quo when we all work together. Access to reliable, high-performance Internet services is essential to ensure the vitality of our regions.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Gilles Bélanger, Parliamentary Assistant to the Premier of Quebec (high-speed Internet)</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“We commend the Government of Quebec’s courage and its political will to accelerate high-speed Internet access for thousands of Quebecers in underserved regions. Vidéotron, Quebecers’ most admired telecommunications company for 15 years, is prepared to face this challenge. We intend to follow through on our commitment to offer high-performance technology and products – through our Helix platform, the best customer service, and competitive prices. The success of this ambitious plan depends on the collaboration of all stakeholders, and you can count on Videotron's expertise and commitment to make it happen.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Pierre Karl Péladeau, President and CEO, Québecor</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Our expertise in deploying high-speed Internet and our continued commitment to serving the regions, combined with the decision by both governments to accelerate investments in connectivity, will help bridge the digital divide between major cities and the regions. Connectivity is essential to ensure digital inclusion in our society and is a powerful driver of economic and social development for our communities. We applaud the vision and collaboration between orders of government to ensure that this major, strategic project is a success for Quebec. And we are very proud to contribute to it.” </span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Philippe Jetté, President and CEO, Cogeco Inc. and Cogeco Communications Inc.</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Bell is committed to building the best networks, and we are proud to apply our leadership to connect Quebec. Whether as a network builder or as an infrastructure owner, Bell is ready to contribute to this major project and determined to transform the way that Quebecers communicate with each other and the rest of the world. Collaboration and rigorous execution by all stakeholders are key to the success of this historic project, and Bell has put the required processes in place for everyone to work together and ensure its success.” </span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Karine Moses, President, Quebec Division, Bell </span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“As a pioneer in the rollout of Internet in rural areas, Xplornet is proud to support the Quebec government in its determination to connect all Quebecers to high-speed Internet by 2022. This is a historic time for the economic development of our regions, and Xplornet is doing its part to connect over 23,000 families.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"FR-CA\" xml:lang=\"FR-CA\">Charles Beaudet, Vice-President Quebec, Xplornet Communications Inc.</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“We are proud to step up our efforts to connect Quebecers as quickly as possible. For the past 12 years, Sogetel has been deploying fibre optics on a massive scale in underserved areas. This project is in line with the mission of our company, which has been serving rural communities since its founding, in 1892. Our team is ready to take on this challenge!”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Richard Biron, Vice-President, Corporate Development, Sogetel</span></span></span></footer>\n</blockquote>\n\n<blockquote>\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“The 6,000 TELUS team members across the province would like to salute the active contribution of the governments of Quebec and Canada in the rollout of high-speed Internet services. Over the past 20 years, we have invested close to $30 billion in our infrastructure and operations in Quebec, including $300 million for the deployment of fibre optics in the regions. We are already providing high-speed Internet access to 99 per cent of homes in the regions we serve. These joint investments will allow us to accelerate the deployment of our PureFibre network to reach almost all families and businesses. More than ever, connectivity is critical to economic recovery, to improving access to virtual health care, and to connecting Quebecers to essential digital resources.”</span></span></span></p>\n\n<footer class=\"default\"><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">François Gratton, Executive Vice-President of TELUS and CEO of TELUS Health, TELUS Agriculture and TELUS Quebec</span></span></span></footer>\n</blockquote>\n\n<h2><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Quick Facts</span></span></span></h2>\n\n<ul>\n\t<li><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-Quebec Operation High Speed will give Quebec the highest connectivity rate in Canada with a 99 per cent coverage rate.</span></span></span></span></li>\n\t<li><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The 150,000 homes that will be connected as part of today’s announcement are in addition to the 66,000 homes already connected through other programs from the Government of Canada and the Government of Quebec.</span></span></span></span></li>\n\t<li><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Government of Canada has committed billions of dollars to rural and remote Internet infrastructure, including $1.75 billion through the Universal Broadband Fund. This funding will help grow businesses, create jobs, and ensure that 98 per cent of Canadians will have high-speed Internet access by 2026, with the goal of reaching the entire population by 2030.</span></span></span></span></li>\n\t<li><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">To date, the Quebec government alone has invested more than $1 billion to accelerate high-speed Internet access for all Quebecers by fall 2022.</span></span></span></span></li>\n\t<li><span><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">In order to reach the goal of optimal connectivity throughout the country in 2022, 36,000 households still need to be served. These households are located in particularly hard-to-reach areas and sparsely populated regions. Technological solutions are currently being considered and the strategy to reach these homes by 2022 will be announced at a later date. </span></span></span></span><span><span><span><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong></span></span></span></li>\n</ul>\n\n<h2><span><span><span lang=\"FR-CA\" xml:lang=\"FR-CA\">Associated Links</span></span></span></h2>\n\n<ul>\n\t<li><span><span><a href=\"https://cdn-contenu.quebec.ca/cdn-contenu/gouvernement/MCE/IHV/operationHV/Tableau_fournisseurs_de_services_Internet.pdf\"><span lang=\"EN\" xml:lang=\"EN\">Distribution of various households and ISPs subsidies</span></a><span lang=\"EN\" xml:lang=\"EN\"> (French only)</span></span></span></li>\n\t<li><span><span><a href=\"https://cdn-contenu.quebec.ca/cdn-contenu/gouvernement/MCE/IHV/operationHV/Tableau_regions_administratives.pdf\"><span lang=\"EN\" xml:lang=\"EN\">Regional distribution of households</span></a><span lang=\"EN\" xml:lang=\"EN\"> (French only)</span></span></span></li>\n\t<li><span><span><a href=\"https://www.quebec.ca/gouv/ministere/conseil-executif/organismes-lies/secretariat-a-linternet-haute-vitesse-et-aux-projets-speciaux-de-connectivite/operation-haute-vitesse/\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">High-Speed Internet and Special Connectivity Projects Secretariat</span></a> <span lang=\"EN\" xml:lang=\"EN\">(French only)</span></span></span></li>\n\t<li><span><span><a href=\"https://www.ic.gc.ca/eic/site/139.nsf/eng/h_00002.html\"><span lang=\"EN\" xml:lang=\"EN\">High Speed Access for All: Canada’s Connectivity Strategy</span></a></span></span></li>\n\t<li><span><span><a href=\"https://www.ic.gc.ca/eic/site/139.nsf/eng/h_00006.html\"><span lang=\"EN\" xml:lang=\"EN\">Universal Broadband Fund</span></a></span></span></li>\n</ul></div>\n      "
}