{
  "path": "/en/news/readouts/2020/06/11/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their thirteenth weekly call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>The Prime Minister acknowledged the peaceful anti-racism demonstrations that have been held across Canada. First Ministers were united in denouncing racism in all its forms, and agreed to continue working together to fight discrimination and injustice.&nbsp;The Prime Minister also raised the issue of policing in Canada, including equipping Royal Canadian Mounted Police officers with body cameras.</p>\n\n<p>First Ministers continued discussions on an agreement to safely restart the economy. The Prime Minister reaffirmed that the Government of Canada is ready to contribute $14 billion to help provinces and territories address their critical needs over the next six to eight months. This includes personal protective equipment for healthcare workers and businesses, testing and contact tracing, childcare, assistance for vulnerable populations, support for municipalities, and paid sick leave for workers.</p>\n\n<p>First Ministers provided updates on measures to restart the economy. The Prime Minister highlighted the latest measures regarding the Canada-U.S. border, and spoke of the limited exemption announced earlier this week to allow immediate family members of Canadian citizens and permanent residents, who do not have COVID-19 or exhibit any signs or symptoms of COVID-19, to come to Canada.</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, and the need to closely coordinate their efforts, moving forward.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2020/06/05/prime-ministers-remarks-announcing-support-canadians-disabilities\">Prime Minister’s remarks announcing support for Canadians with disabilities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/01/prime-minister-announces-support-help-communities-create-jobs-and\">Prime Minister announces support to help communities create jobs and restart the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states\">Prime Minister announces temporary border agreement with the United States</a></li>\n</ul></div>\n      "
}