{
  "path": "/en/news/statements/2021/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/youth-day\">International Youth Day</a>, we celebrate the endless potential of young people in Canada and around the world.</p>\n\n<p>“Young people are powerful leaders of change. They care deeply about our country, understand the issues we are facing, and know that we have to – and can – do better. They serve their communities actively, participate in civic life, and advocate for a fairer, more diverse, and more inclusive Canada. Over the past year and a half, they have shown incredible strength and determination, and made great sacrifices to help keep our communities safe and healthy. Unfortunately, they have also been among the most impacted by the global COVID-19 pandemic, with significant job losses and a severe mental health decline.</p>\n\n<p>“That is why, since the beginning of the pandemic, the Government of Canada has been focused on supporting young Canadians through this crisis and helping them reach their full potential. In fact, the government’s response to the crisis represents the largest investment in young Canadians in the history of our country. It included creating some 300,000 new work opportunities and experiences for young Canadians, providing income support to over 700,000 students through the Canada Emergency Student Benefit, and doubling the Canada Student Grants for the 2020-21 school year. That means more money in the pockets of young people and more opportunities for them to develop their career.</p>\n\n<p>“Earlier this year, we also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/28/investing-young-canadians\">announced new investments in Budget 2021</a> to make it easier for young people to pursue and complete their education, pay down student debt, and find training and work opportunities. As we look to the future and start our recovery from the pandemic, we will continue to support young people and make sure they have the right tools to work, innovate, and succeed – because when we invest in them, we are investing in our country’s future.</p>\n\n<p>“The Government of Canada is also working to ensure that young people have a voice in the decisions that affect them. Yesterday, we released Canada’s first-ever <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/state-youth.html\">State of Youth Report</a>, which recognizes the important contributions of young people in the country. Informed by nearly 1,000 young Canadians of diverse backgrounds, the report outlines their viewpoints and recommendations on key issues including health and wellness, climate change, and reconciliation with Indigenous peoples. Building on <a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada’s first-ever youth policy</a> launched in 2019, the report provides us with a unique opportunity to partner with young people to tackle the challenges they face today. In the months ahead, we will continue to engage with them to advance this crucial work and develop real, meaningful solutions together.</p>\n\n<p>“Last month, I welcomed the fifth cohort of members to my <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council/council.html\">Youth Council</a>. These young Canadians from across the country are bringing their unique perspectives and strengths to help inform government priorities and decisions, and using their voices to push for positive change. I look forward to hearing their innovative ideas on the issues that matter most to them and to all Canadians.</p>\n\n<p>“This year’s theme – Transforming Food Systems: Youth Innovation for Human and Planetary Health – calls on governments around the world to harness the creativity, energy, and innovative spirit of young people to meet the challenges of today and tomorrow. From fighting the climate crisis to promoting sustainable development, to creating the jobs of tomorrow – this is what we can accomplish when we partner with young people. The Government of Canada will continue to listen to young Canadians, support them, and empower them to make our country – and our world – a better, fairer, and more inclusive place to live.”</p></div>\n      "
}