{
  "path": "/en/news/news-releases/2019/12/13/prime-minister-releases-new-mandate-letters-ministers",
  "pageTitle": "Prime Minister releases new mandate letters for ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today released ministerial mandate letters to guide Cabinet in delivering real, positive results for Canadians.</p>\n\n<p>On Election Day, Canadians chose to continue moving forward. People have been clear that they want progress on the issues that matter most, from fighting climate change and strengthening the middle class, to walking the road of reconciliation, keeping people safe and healthy, and positioning Canada for success in an uncertain world.</p>\n\n<p>Canadians expect the Government to be open and accountable in all its work. In 2015, the Prime Minister publicly released the ministerial mandate letters for the first time, to ensure Canadians can follow the Government’s priorities and track its progress. The mandate letters released today outline a commitment to move forward in an open, positive, and collaborative way. The Government will work in partnership with Indigenous peoples, provinces, territories, municipalities, and Parliamentarians on behalf of all Canadians.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“It is more important than ever to unite around our shared purpose, as we build a stronger, more inclusive, and more resilient country. That is exactly what our team will do, finding common ground and delivering real, positive results for all Canadians. These mandate letters outline our commitment to keep government open, transparent, and accountable, and to continue moving forward for Canadians from coast to coast to coast.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister first made mandate letters public in November 2015.</li>\n\t<li>Mandate letters outline the policy objectives that each minister will work to accomplish, as well as the pressing challenges they will address in their role. Mandate letters are not an exhaustive list of all files a minister will work on.</li>\n\t<li>Publicly available mandate letters help Canadians hold the government to account. They outline the Prime Minister’s expectations for each minister, and give Canadians a clear idea of how the government will deliver its agenda.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/mandate-letters\">Mandate letters</a></li>\n</ul></div>\n      "
}