{
  "path": "/en/news/readouts/2022/04/01/prime-minister-justin-trudeau-convenes-incident-response-group-war-ukraine",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group on the war in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the latest developments of the war in Ukraine with ministers and senior officials.</p>\n\n<p>The group was briefed on the latest developments on the ground in Ukraine. The Prime Minister and ministers discussed the humanitarian, financial, and military aid that Canada has provided to Ukraine to date, and explored options to further respond to Ukraine’s evolving needs in the face of Russia’s ongoing aggression.</p>\n\n<p>The Prime Minister, ministers, and officials remain determined to continue providing urgent support to Ukraine.</p>\n\n<p>The group discussed the government’s ongoing efforts to assist Ukrainians wishing to seek refuge in Canada, coordinate their travels, and help them settle in their new communities. Settlement Program services have now been extended to newcomers arriving under the Canada-Ukraine Authorization for Emergency Travel. A pathway to permanent residency for family members of Canadians immigrating from Ukraine has also been created.</p>\n\n<p>The group discussed the impacts of the war on Ukraine’s people, infrastructure, and economy as well as energy prices and food security around the world. They discussed how Canada can alleviate current pressures on supply chains in the medium- and long-term, including by increasing food production and processing.</p>\n\n<p>The Prime Minister and ministers committed to continue working alongside allies and international partners to support the territorial integrity, sovereignty, and independence of Ukraine.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement to Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/28/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/03/canada-expands-settlement-support-for-ukrainians-coming-to-canada.html\">Canada expands settlement support for Ukrainians coming to Canada</a></li>\n</ul></div>\n      "
}