{
  "path": "/en/news/readouts/2021/05/25/prime-minister-justin-trudeau-speaks-president-indonesia-joko-widodo",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Indonesia Joko Widodo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Indonesia, Joko Widodo.</p>\n\n<p>Prime Minister Trudeau and President Widodo discussed the growing relationship between Canada and Indonesia. The leaders agreed to take further steps towards negotiating a Canada-Indonesia Comprehensive Economic Partnership Agreement, and recognized the opportunity to realize untapped trade, jobs, and investment potential for the benefit of both Canadians and Indonesians.</p>\n\n<p>The two leaders also discussed the global response to the COVID-19 pandemic and ongoing efforts to ensure equitable and efficient access to vaccines, including through the COVAX Facility.</p>\n\n<p>Prime Minister Trudeau and President Widodo spoke about regional issues. Prime Minister Trudeau welcomed the leadership of both Indonesia and ASEAN in seeking a resolution to the crisis in Myanmar and offered Canada’s support for these efforts. The Prime Minister noted Canada’s engagement in pressing for a return to democracy and addressing the humanitarian situation, in particular the plight of the Rohingya. Prime Minister Trudeau expressed Canada’s interest in developing closer ties with ASEAN, including through a Canada-ASEAN free trade agreement.</p>\n\n<p>The Prime Minister and the President discussed shared priorities for the G20, including during Indonesia’s upcoming presidency in 2022.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/indonesia-indonesie/bilateral_relations_bilaterales/canada-indonesia-indonesie.aspx?lang=eng\">Canada-Indonesia Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/consultations/consulting-indonesia-consultation-indonesie.aspx?lang=eng\">Consulting Canadians on a possible comprehensive economic partnership agreement with Indonesia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new\">Prime Minister announces additional support for equitable access to new COVID-19 medical solutions</a></li>\n\t<li><a href=\"https://www.g20.org/about-the-g20.html\">About the G20</a></li>\n</ul></div>\n      "
}