{
  "path": "/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine",
  "pageTitle": "Canada announces additional measures to support Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada condemns in the strongest possible terms Russia’s egregious attack on Ukraine. These additional unprovoked actions are another clear and further violation of Ukraine’s sovereignty, territorial integrity, and independence. They are also in violation of Russia’s obligations under international law and the Charter of the United Nations.</p>\n\n<p>Canada has already taken a series of measures, in close coordination with our allies and international partners, to respond to Russia’s reckless and dangerous acts, and following last night’s attack on Ukraine, Canada will take additional action to stop Russia’s unwarranted aggression.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that Canada will be imposing additional sanctions under the <em>Special Economic Measures (Russia) Regulations</em> and the <em>Special Economic Measures (Ukraine) Regulations.</em> These new actions, which build on the measures announced on February 22, include:</p>\n\n<ul>\n\t<li>Imposing restrictions on 58 additional Russian individuals and entities, including banks, financial elites and their families;</li>\n\t<li>Sanctioning members of the Russian Security Council, including the Defence Minister, the Finance Minister, and the Justice Minister;</li>\n\t<li>Imposing restrictions on four Ukrainian individuals for their collaboration with Russia to destabilize Ukraine; and</li>\n\t<li>Restricting exports to Russia by halting new export permit applications and cancelling valid export permits, with a limited number of exceptions for critical medical supply chains.</li>\n</ul>\n\n<p>The Prime Minister also announced that Canada will take additional and immediate measures to support Ukrainians and people residing in Ukraine, and to make it easier and faster for Canadian citizens, permanent residents, and their accompanying immediate family members to return to Canada. These new measures include:</p>\n\n<ul>\n\t<li>Establishing a dedicated service channel for Ukraine enquiries on immigration. This will be available for clients both in Canada and abroad at 613-321-4243, with collect calls accepted. In addition, clients can now add the keyword “Ukraine2022” in their email enquiry, which will prioritize their email;</li>\n\t<li>Urgent processing of travel documents, including issuing single-journey travel documents for immediate family members of Canadian citizens and permanent residents who do not have valid passports;</li>\n\t<li>Ensuring that Ukrainians currently in Canada are able to extend their stay or work longer in Canada by prioritizing the renewal of work and study permits;</li>\n\t<li>Issuing open work permits to Ukrainian visitors, workers, and students who are currently in Canada and cannot go home; and&nbsp;</li>\n\t<li>Waiving fees for travel and immigration documents, such as for Canadian passports, permanent resident travel documents, proofs of citizenship, visitor visas and work and study permits.</li>\n</ul>\n\n<p>Immigration, Refugees and Citizenship Canada (IRCC) has already implemented measures to priority-process applications for travel documents for Canadian citizens, permanent residents and their immediate family members, and grant applications for adoption, and permanent and temporary residence applications for people with a primary residence in Ukraine who want to reunite or travel with family, study, work or start a new life in Canada. More immigration measures will be announced in the near future.</p>\n\n<p>Russia’s actions are being met with severe consequences. Earlier this week, Canada unequivocally condemned Russia’s decision to recognize the independence of the Donetsk and Luhansk regions in Ukraine and in response announced it will:</p>\n\n<ul>\n\t<li>Impose new sanctions against Russia, including new prohibitions on direct and indirect dealings in Russian sovereign debt;</li>\n\t<li>Send additional military contributions to support the North Atlantic Treaty Organization (NATO) through Operation REASSURANCE, including up to an additional 460 personnel to the approximately 800 currently deployed in Europe in support of NATO; and</li>\n\t<li>Authorize approximately 3,400 Canadian Armed Forces personnel across all branches of the service to deploy to the NATO Response Force should they be required by NATO.</li>\n</ul>\n\n<p>Russia’s attack on Ukraine is also an attack on democracy, on international law, on human rights, and on freedom. It threatens peace and order in Europe and around the world. These unwarranted actions will not go unpunished. We continue to stand with Ukraine, its people, and the Ukrainian Canadian community here in Canada.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada condemns in the strongest possible terms Russia’s egregious attack on Ukraine. Canada is taking strong action to stand up for what is right and protect the rights and freedoms of the Ukrainian people. Let me be clear: there will be serious consequences for Russia’s actions. Together with our allies and partners, we will continue to take decisive action to support the sovereignty, territorial integrity, and independence of Ukraine and by extension, democratic principles, freedom, and human rights around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, we woke up to a changed world. Russia has launched a brutal and unprovoked attack on the sovereignty of Ukraine – a country of more than 40 million people who have sought nothing but peace and freedom. Canada understands what is at stake. We know that the people of Ukraine, in fighting for their lives and their sovereignty, are fighting for us, too. They are fighting for democracy, and we stand with them.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is a dark day. Russia’s further invasion of Ukraine is a fundamental challenge to the world order that has kept us safe since the Second World War. The fight is in Ukraine, but the threat extends far past its borders. Canada and our partners have been clear: these reckless and dangerous acts will not go unpunished. The sanctions being imposed today will work in coordination with those from our partners to inflict severe costs to the Russian regime.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“In the wake of Russia’s deliberate attack on Ukrainians orchestrated by Putin, Canada’s message to Ukraine is clear – Canada stands with you. Today is a devastating day for Ukraine, for democratic societies, and for peace and security around the world. Together with our allies and partners, our Canadian Armed Forces and country will continue to meet Putin’s unwarranted aggression with Canada’s steadfast support to the Ukrainian people as they fight for their sovereign right to exist.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada is steadfast in its support of the sovereignty and territorial integrity of Ukraine. For over a month, we have been prioritizing applications from Ukraine, bolstering our resources in the region, and preparing additional measures. We will continue to provide priority assistance to Canadians, permanent residents and their families, as well as Ukrainians who wish to come to Canada and Ukrainian temporary residents already in Canada who cannot return home. As we continue to monitor the ongoing situation, we will increase our efforts to make it easier for Ukrainians to stay in Canada, and faster for them to arrive.”</p>\n\n<footer class=\"default\">The Hon. Sean Fraser, Minister of Immigration, Refugees and Citizenship</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In response to Russia’s threats and military build-up in and around Ukraine in recent weeks, the Government of Canada invested in additional support for Ukraine. This includes through the extension and expansion of Operation UNIFIER, the Canadian Armed Forces’ military training and capacity-building mission in Ukraine, up to $620&nbsp;million in loans, and the provision of nearly $10&nbsp;million in lethal and non-lethal equipment and ammunition.</li>\n\t<li>Since Russia’s attempted annexation and illegal occupation of Crimea in 2014, Canada has sanctioned more than 440 individuals and entities, with many of these sanctions undertaken in coordination with our allies and partners. Canada’s sanctions will impose asset freezes and dealings prohibitions on listed persons.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine\">Statement by the Prime Minister on Russia’s attack on Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/22/canada-announces-support-address-situation-ukraine\">Canada announces support to address the situation in Ukraine</a></li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/02/additional-immigration-support-for-those-affected-by-the-situation-in-ukraine.html\">Additional immigration support for those affected by the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/02/canada-imposes-additional-economic-measures-on-russia-in-response-to-russias-attack-on-ukraine.html\">Canada imposes additional economic measures on Russia in response to Russia’s attack on Ukraine</a></li>\n</ul></div>\n      "
}