{
  "path": "/en/news/readouts/2021/03/08/prime-minister-justin-trudeau-speaks-prime-minister-sweden-stefan-lofven",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Sweden Stefan Löfven | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Sweden, Stefan Löfven.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Löfven discussed the global COVID-19 pandemic. They emphasized the importance of delivering vaccines as quickly as possible to protect people from the virus, and of working with the international community to increase global resilience and preparedness when dealing with health crises.</p>\n\n<p>Speaking on International Women’s Day, the two leaders underlined their commitment to making progress on gender equality and the empowerment of women and girls, highlighting that the pandemic has set back women’s equality around the world. They will continue to move forward together to create a more equal and inclusive future.</p>\n\n<p>The Prime Ministers discussed Ukraine International Airlines Flight 752 and the ongoing work with international partners to get the transparency, accountability, and justice from Iran that the victims and their families deserve.</p>\n\n<p>The leaders spoke about other international issues, with Prime Minister Trudeau raising concerns about the situation in Myanmar and human rights in Xinjiang.&nbsp;They also discussed the need for global cooperation to fight climate change.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Löfven looked forward to continuing close cooperation between Canada and Sweden on shared priorities, such as strengthening multilateralism, cooperation in the Arctic, and protecting democracy and human rights.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/sweden-suede/bilateral_relations_bilaterales/canada_sweden-suede.aspx?lang=eng\">Canada-Sweden Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/03/08/statement-prime-minister-international-womens-day\">Statement by the Prime Minister on International Women’s Day</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-canada-mark-first-anniversary-downing-ukraine\">Statement by the Prime Minister of Canada to mark the first anniversary of the downing of Ukraine International Airlines Flight 752</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/02/canada-imposes-sanctions-on-myanmar-military-officials-in-response-to-coup-detat.html\">Canada imposes sanctions on Myanmar military officials in response to coup d’état</a></li>\n</ul></div>\n      "
}