{
  "path": "/en/news/statements/2021/04/07/statement-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“Today, on </span><a href=\"https://www.who.int/campaigns/world-health-day/2021\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">World Health Day</span></a><span lang=\"EN-CA\" xml:lang=\"EN-CA\">, we reflect on how the global COVID-19 pandemic has impacted our physical and mental health, and the pressure it has put on health systems in Canada and around the world. We also recognize how the pandemic has deepened existing inequalities in our societies that influence people’s health, safety, and well-being.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“This year’s theme – ‘Building a fairer, healthier world’ – calls on us to address these barriers and inequalities so everyone can have equal opportunities to access quality health services and live a healthy life. Our fight against COVID-19 has shown that vulnerable communities are more exposed to the virus, and face barriers in accessing quality health care. They are also more likely to suffer the social and economic consequences of public health measures put in place to limit its spread. As we build back from this crisis, we must work to make our country, and the world, fairer and healthier for everyone – no matter who they are or where they live.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“In Canada, we are already taking steps toward a recovery that leaves no one behind. The Government of Canada has worked with provinces and territories to make sure that early immunization for COVID-19 prioritized people who are most at risk from the virus, including older adults and adults in Indigenous communities. We are also taking action to address the physical, mental, and financial toll the pandemic has taken on women by continuing work to end gender-based violence, creating a </span><a href=\"https://www.canada.ca/en/department-finance/task-force-women-economy.html\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Task Force on Women in the Economy</span></a><span lang=\"EN-CA\" xml:lang=\"EN-CA\">, and laying the foundation for a Canada-wide early learning and child care system. In addition, we have invested $1 billion to create over 4,700 affordable housing units across the country, so more Canadians can have a safe place to call home. We will keep striving for a fairer Canada for everyone, because more equal societies are healthier societies.</span></span></span></p>\n\n<p><span><span><span lang=\"EN-CA\" xml:lang=\"EN-CA\">“On the world stage, there has been unparalleled global coordination to fight COVID-19, including on the development and roll out of safe and effective vaccines. Canada works with its partners, including through the G7 and G20, to coordinate response efforts, strengthen global health systems, and address the disproportionate effects of the pandemic on vulnerable people, including women. Through our </span><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/fiap-paif.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Feminist International Assistance Policy</span></a><span lang=\"EN-CA\" xml:lang=\"EN-CA\">, we are also supporting work to improve the quality and accessibility of health services, improve nutrition, and advance health and reproductive rights for women and girls around the world. Just as we cannot beat COVID-19 unless we beat it everywhere, we cannot build a better world unless we all work together.</span></span></span></p>\n\n<p><span lang=\"EN-CA\" xml:lang=\"EN-CA\"><span>“Today, I thank all Canadians for the sacrifices they are making to protect one another and help stop the spread of COVID-19. We will continue to do whatever it takes, for as long as it takes, to keep people safe, healthy, and supported through the pandemic. As we work toward our recovery, we will apply the lessons we have learned from this crisis to build a stronger Canada, and a more inclusive and healthier world.”</span></span></p></div>\n      "
}