{
  "path": "/en/news/statements/2018/07/01/statement-prime-minister-canada-day",
  "pageTitle": "Statement by the Prime Minister on Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada Day:</p><p>“Happy Canada Day!</p><p>“No matter where we are, today, as Canadians, we celebrate Canada and the people who have built the country we love.</p><p>“We’re 37 million – strong in our differences, proud of our diversity, and united by our dreams. From one generation to the next, Canadians have brought our country’s promise to life, with hard work, bold vision, and determination. They’ve grown the strong middle class at the heart of our success – and today, Canada’s workers are the backbone of our country.</p><p>“Canada’s workers build the roads and bridges that get us to work on time and back home again. They put food on the table for families from coast to coast to coast. Some are young people starting their career, or newcomers bringing fresh talent to the workforce.</p><p>“From Ontario steel to Quebec aluminum, from agriculture and the energy sector in the Prairies and the North, to forestry in British Columbia and fisheries in the Atlantic, Canadians get the job done – and build our communities along the way.</p><p>“We know we can count on Canadians. We stand with each other, and we will always stand up for each other. Canada’s success has always come from its people – lifting each other up, one community at a time.</p><p>“Today, we celebrate how much we’ve accomplished together – and set our sights on the future. Together, we will continue to put our values into practice, and make Canada’s promise a reality. We will continue to advance reconciliation, and make sure the rights of First Nations, Inuit, and Métis peoples are recognized and implemented, based on respect, cooperation, and partnership. Together, we will keep building a country where every Canadian – no matter where they’re from, what religion they practice, or whom they love – has a real and fair chance to succeed.</p><p>“Canada, this is our challenge – and I know we’re up to it. Today, let’s do what we do best as Canadians: look to the future, and roll up our sleeves. Together, we will keep building a country that makes us all proud.</p><p>“On behalf of our family, Sophie and I wish everyone a very happy Canada Day.”</p></div>\n      "
}