{
  "path": "/en/news/statements/2021/11/18/statement-prime-minister-latvias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Latvia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Latvia’s Independence Day:</p>\n\n<p>“Today, we join Latvian communities in Canada and around the world to celebrate Latvia’s Independence Day.</p>\n\n<p>“This day has always been significant for Latvians. In 1918, the country’s proclamation of independence was marked as a new beginning. However, the Second World War resulted in the Soviet annexation of Latvia, ushering in over half a century of communist rule. During that period, Latvia experienced propaganda, mass arrests, and oppression. Canada never recognized the Soviet Union’s annexation, and was the first G7 country to acknowledge the restoration of Latvia's independence in 1991.</p>\n\n<p>“Since then, Canada and Latvia have enjoyed a strong relationship, founded on the shared values of democracy, freedom, the rule of law, and the close connections between people in our two countries. More than 30,000 people of Latvian ancestry call Canada home, and help make our country stronger, more prosperous, and more inclusive.&nbsp; &nbsp;</p>\n\n<p>“Canada was also the first country to ratify Latvia’s accession to the North Atlantic Treaty Organization (NATO) in 2004. Since 2017, Canada has led the multinational NATO enhanced Forward Presence Battle Group in Latvia, contributing approximately 540 troops as part of Operation REASSURANCE.</p>\n\n<p>\"Today, Latvia and Canada work closely in multilateral organizations, including the United Nations, the Organization for Economic Co-operation and Development, and the Organization for Security and Co-Operation in Europe. We are also trading partners through the Canada-European Union Comprehensive Economic and Trade Agreement, which is creating new opportunities and good jobs for people on both sides of the Atlantic. Canada will continue to work with Latvia to reinforce our dynamic bilateral relationship, reaffirm our commitment to NATO’s defence and deterrence measures in Eastern and Central Europe, and grow our economic partnership for the benefit of people in both our countries.</p>\n\n<p>“On behalf of the Government of Canada, I offer my best wishes to all those celebrating Latvia’s Independence Day.”</p></div>\n      "
}