{
  "path": "/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-president-metis-national",
  "pageTitle": "Statement by the Prime Minister, Justin Trudeau, and the President of the Métis National Council, Clément Chartier | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada and the President of the Métis National Council are issuing this joint statement on the Pan-Canadian Framework on Clean Growth and Climate Change:</p>\n<p>Canada and the Métis National Council recognize the importance of addressing climate change, as it is significantly impacting our environment, as well as the health, wellness, and economic sustainability of our communities. Across the Métis Nation homeland, there are damaging effects of climate change on the land, air and water. By working together, we will inform action on climate change to improve the resiliency and adaptability of our communities and build more innovative and competitive economic opportunities for the Métis Nation.</p>\n<p>We agree to move forward to ensure the Métis are full and effective partners in advancing clean growth and addressing climate change. This will be done through robust, ongoing, meaningful engagement informed by Traditional Knowledge and consistent with the principles in the United Nations Declaration on the Rights of Indigenous Peoples, including free, prior and informed consent.</p>\n<p>The Pan-Canadian Framework on Clean Growth and Climate Change builds on the Paris Agreement, where Parties agreed that they should, when taking action to address climate change, recognize and respect the rights of Indigenous Peoples. The Government of Canada’s approach to engagement includes its commitment to renewing its nation-to-nation, government-to-government relationship with the Métis Nation.</p>\n<p>Respecting a distinctions-based approach, the Government of Canada and the Métis National Council have agreed to form a senior-level table to ensure inclusive and meaningful engagement of the Métis Nation to inform action on the implementation of the Framework. This senior-level table will begin meeting in early 2017. The table will support the meaningful engagement of the Métis Nation and Canada in jointly developing real and meaningful approaches and advising on and tracking progress on the implementation of relevant acts, regulations, policies and programs such as advancing clean energy solutions. Together, we will translate scientific information and Traditional Knowledge into action to support the implementation of the Framework.</p>\n<p><strong>Quotes</strong></p>\n<p>“We are thankful for the Métis Nation showing climate leadership across their homeland, and beyond. There is no relationship more important to the Government of Canada than the one with Indigenous Peoples. Meaningful engagement and partnership with the Métis Nation to support the implementation of this historic Framework is another step toward reconciliation, and will result in a cleaner and more sustainable environment today, tomorrow, and for future generations.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“The Métis National Council is pleased to have reached an agreement with the Government of Canada that ensures the full engagement of the Métis Nation in the implementation of the Framework through a nation-to-nation and government-to-government approach. Climate change action must enable the protection of the Métis Nation relationship to their traditional lands and ensure the ongoing well-being of our Métis way of life. We are thankful for the leadership of the Government of Canada through Prime Minister Trudeau and look forward to positive outcomes for the environment and for the Métis Nation as we move forward through this long term process.”<br><em>- Clément Chartier, President of the Métis National Council</em></p>\n<p><br><strong>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/statements/2016/12/09/statement-prime-minister-justin-trudeau-and-national-chief-assembly\">Statement by the Prime Minister, Justin Trudeau, and the National Chief of the Assembly of First Nations, Perry Bellegarde</a></li>\n<li><a href=\"/en/news/statements/2016/12/09/commitment-action-prime-minister-canada-justin-trudeau-and-president\">Commitment to action by the Prime Minister of Canada, Justin Trudeau, and the President of Inuit Tapiriit Kanatami, Natan Obed</a></li>\n<li><a href=\"/en/news/backgrounders/2016/12/09/process-document-ongoing-engagement-pan-canadian-framework-clean\">Process Document for Ongoing Engagement on the Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n</ul></div>\n      "
}