{
  "path": "/en/news/statements/2022/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p>\n\n<p>“Women, girls, and gender diverse people play an invaluable role in building a fairer and more inclusive future with equal opportunity for everyone, here in Canada and around the world.</p>\n\n<p>“Today, on International Women’s Day, we celebrate the achievements of women and girls that have helped shape the world we know today and we recommit to ensuring that everyone has the chance to reach their full potential, regardless of their gender identity, race, ethnicity or religion. This year’s theme, <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/international-womens-day/2022-theme.html\">Women Inspiring Women</a>, invites us to highlight the accomplishments of the many women, girls, and gender diverse people who demonstrate leadership by challenging norms and harmful stereotypes, empowering others, and serving as role models for all of us.</p>\n\n<p>“Canadian women and girls are leaders in breaking down barriers – from 2022 Winter Olympic and Paralympic athletes like Lisa DeJong, who won Canada’s first-ever Paralympic snowboard cross medal, to award-winning director and animator Domee Shi, whose debut feature film will be released this week. In the arts, business, medicine, sports, and Canada’s public service, women are continuously overcoming significant obstacles and paving the way for the next generation.</p>\n\n<p>“Since the beginning of the pandemic, women and girls have been disproportionately bearing the impacts of COVID-19. This is especially true for many marginalized groups, including Indigenous, Black and racialized women as well as women living with disabilities, and those who are members of LGBTQ2 communities. The Government of Canada has been there to support them, including through the <a href=\"https://women-gender-equality.canada.ca/en/funding/funding-programs/feminist-response-recovery-fund/feminist-response-recovery-fund-about.html\">Feminist Response and Recovery Fund</a> and the <a href=\"https://www.canada.ca/en/department-finance/task-force-women-economy.html\">Task Force on Women in the Economy</a>. As we recover from the pandemic, we have a unique opportunity to build a more inclusive future, including through a Canada-wide <a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day early learning and child care system</a>, which will make life more affordable for Canadian families and increase women’s participation in the workforce. We will also continue to support initiatives that promote gender equality and the empowerment of women and girls worldwide through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>.</p>\n\n<p>“Today, as we celebrate the many accomplishments of women and girls who are building a fairer, stronger, and more inclusive future, we cannot forget that there is more to be done. We all have a role to play in breaking down barriers and ensuring that all women, girls, and gender diverse people have every opportunity to succeed in life.”</p></div>\n      "
}