{
  "path": "/en/news/statements/2020/08/24/statement-prime-minister-ukrainian-independence-day",
  "pageTitle": "Statement by the Prime Minister on Ukrainian Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ukrainian Independence Day:</p>\n\n<p>“Today, we join Ukrainian communities in Canada and around the world to celebrate the 29th anniversary of Ukraine’s independence.</p>\n\n<p>“Canada was the first Western country to recognize Ukraine’s independence. Ever since, we have worked alongside the people of Ukraine as a steadfast partner and close friend. We have supported them in their efforts to protect their sovereignty and security and build a more prosperous, democratic future. As part of that effort, our Canadian Armed Forces members are providing capacity building to the Security Forces of Ukraine as part of <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a>. We have also established free trade between our two countries and we are working closely with the international community to support Ukraine’s reform efforts.</p>\n\n<p>“Canada and Ukraine enjoy a close relationship built on shared values and strong people-to-peoples ties. Over 1.3 million Canadians of Ukrainian descent call this country home. Through their unique culture, traditions, and language, members of the Ukrainian-Canadian community continue to make Canada a better place, every day.</p>\n\n<p>“As we celebrate these deep and lasting bonds of family and friendship, we also recognize that this year has been difficult for people in both our countries. The Ukraine International Airlines Flight PS752 tragedy and the COVID-19 pandemic have taken the lives of so many Canadians and Ukrainians, and changed the lives of countless others. The COVID‑19 pandemic has had significant economic, health, and social impacts on both of our people. These challenges serve to remind us of the importance of solidarity and cooperation as we work to ensure the safety, security, and well-being of Ukrainians and Canadians.</p>\n\n<p>“Today, we celebrate the close people-to-people connections, cultural ties, and values that unite Canada and Ukraine. We look forward to continuing to build our relationship as we advance our shared priorities and we reaffirm our steadfast commitment to support Ukraine’s sovereignty and territorial integrity.</p>\n\n<p>“On behalf of all Canadians, Sophie and I wish those celebrating today a happy Ukrainian Independence Day.</p>\n\n<p>“Slava Ukraini!”</p></div>\n      "
}