{
  "path": "/en/news/readouts/2020/03/30/prime-minister-justin-trudeau-speaks-prime-minister-australia-scott",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Australia Scott Morrison | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke with the Prime Minister of Australia, Scott Morrison, to exchange views on their&nbsp;respective national measures to combat&nbsp;the COVID‑19 pandemic.&nbsp;</p>\n\n<p>The prime ministers discussed the health and social effects of the pandemic on their countries, and shared information on steps they have taken to prevent the spread of the virus and protect the health and safety of their citizens. They also discussed critical strategies to support their national economies. &nbsp;Both leaders spoke of the need to ensure secure supply lines of vital medical equipment.</p>\n\n<p>The leaders agreed on the importance of international coordination including in the G20 to promote global economic stability in the face of this health crisis. &nbsp;They also discussed the need to support the developing world as it fights the COVID-19 pandemic</p>\n\n<p>The prime ministers&nbsp;agreed to stay in close contact on these issues as the situation evolved. &nbsp;</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/21/prime-minister-announces-efforts-bring-canadians-home-abroad\">Prime Minister announces efforts to bring Canadians home from abroad</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}