{
  "path": "/en/news/news-releases/2020/03/21/prime-minister-announces-efforts-bring-canadians-home-abroad",
  "pageTitle": "Prime Minister announces efforts to bring Canadians home from abroad | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada’s top priority is the safety and security of Canadians. As the global COVID-19 pandemic continues to evolve rapidly, we are taking action to limit the spread of the virus and provide support to Canadians at home and abroad.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new measures by the Government of Canada to help bring Canadians home from abroad.</p>\n\n<p>All over the world, COVID-19 has caused sudden border restrictions and flight cancellations, leaving Canadians stranded outside of the country without a way home. Under these extraordinary circumstances, the Government of Canada is working with Canadian airlines and foreign governments to provide access to commercial flights for Canadian travellers who want to return home.</p>\n\n<p>The flights will prioritize stranded travellers who are Canadian citizens, Canadian permanent residents, or immediate family members of Canadian citizens. In addition, only travellers who are asymptomatic will be allowed to board, and all travellers will be asked to self-isolate for 14 days upon entry.</p>\n\n<p>In the first series of flights to help Canadians return home, Air Canada will operate a special flight today from Morocco. Flights will also be planned for Peru and Spain, and other countries&nbsp;as soon as possible. Factors such as the number of Canadians, airspace closures, and the local situation are being taken into consideration in order to identify the locations for these flights. We are currently working with Air Canada and are engaged with other airlines as we assess global needs.</p>\n\n<p>The Government of Canada is working with Canadian airlines to ensure that stranded Canadians are offered a reasonable commercial price for their return ticket home.</p>\n\n<p>All Canadians abroad are strongly encouraged to <a href=\"https://travel.gc.ca/travelling/registration\">register with Global Affairs Canada</a>. This will allow the Government of Canada to provide information to them as soon as it becomes available.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Our government is taking the necessary action to protect the health and safety of Canadians. COVID-19 is a rapidly evolving global issue. That is why we are taking these exceptional measures to help Canadian travelers find a way to get home to their families and friends.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canadian citizens, permanent residents and members of their immediate family holding a valid travel document will have priority to board these flights to Canada. Foreign nationals who have already committed to working, studying or making Canada their home, will also be permitted to board with valid travel documentation.</li>\n\t<li>Canadians who are unable to pay, and who have no available sources of funds to return home, are encouraged to apply for an emergency repayable loan through the <a href=\"https://travel.gc.ca/assistance/emergency-info/financial-assistance/covid-19-financial-help\">COVID-19 Emergency Loan Program for Canadians Abroad</a>. This program was created to help Canadians return home and to cover basic essential needs while they work towards their return.</li>\n\t<li>Under the <em>Aeronautics Act</em>, the Minister of Transport will require airlines to deny boarding of a traveller who is symptomatic, regardless of citizenship status, and keep them from boarding an international flight to Canada. This includes trans-border flights, including those from the United States. The pre-boarding health assessment would include the operator asking simple health questions, looking for visible signs of illness before boarding.</li>\n\t<li>In the event the traveller presents COVID-19 symptoms, the airline will be required to refuse to board the passenger for travel for a period of 14 days, or until a medical certificate is presented that confirms the patient does not carry the virus.</li>\n\t<li>The Government of Canada is asking all travellers entering Canada to self-isolate for 14 days upon entry. For those travelling by air, the request to self-isolate will be clearly communicated at multiple points, for example when purchasing a plane ticket, before boarding the plane, and again upon arrival in Canada. Exemptions to self-isolation for 14 days will be provided to healthy workers who provide essential services.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://travel.gc.ca/assistance/emergency-info/financial-assistance/covid-19-financial-help\">COVID-19: Financial help for Canadians outside Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">Government of Canada takes action on COVID-19</a></li>\n\t<li><a href=\"https://travel.gc.ca/assistance/embassies-consulates\">Embassies and consulates by destination</a></li>\n\t<li><a href=\"https://travel.gc.ca/travelling/registration\">Registration of Canadians Abroad</a></li>\n</ul></div>\n      "
}