{
  "path": "/en/news/readouts/2022/12/19/prime-minister-justin-trudeau-speaks-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Barbados, Mia Mottley.</p>\n\n<p>The leaders underscored the importance of the international community’s continued progress toward achieving the United Nations Sustainable Development Goals (SDGs), and discussed their priorities as co-chairs of the United Nations Secretary-General’s SDGs Advocates Group.</p>\n\n<p>Prime Minister Trudeau commended Prime Minister Mottley for her leadership in advancing efforts to modernize the global financial architecture through the Bridgetown Initiative.</p>\n\n<p>The two leaders also discussed the ongoing humanitarian and security crisis in Haiti and underscored the need for a robust Haitian-led solution to achieve long-lasting stability in the country. Prime Minister Mottley thanked Canada for its leadership in convening partners to support Haiti. Prime Minister Trudeau commended the Caribbean Community (CARICOM) for its offer to host dialogues among Haitian stakeholders to support political consensus and stabilization in the country. He offered Canada’s support in these efforts and stressed the importance of targeted sanctions against those who are enabling the ongoing violence and insecurity.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley agreed to continue working closely together in 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada and the Sustainable Development Goals</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/12/canada-imposes-sanctions-against-haitian-economic-elites.html\">Canada imposes sanctions against Haitian economic elites</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley\">Prime Minister Justin Trudeau meets with the Prime Minister of Barbados Mia Mottley</a></li>\n</ul></div>\n      "
}