{
  "path": "/en/news/readouts/2022/06/08/prime-minister-justin-trudeau-meets-president-general-motors-international",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of General Motors International Shilpan Amin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Shilpan Amin, President of General Motors International, on the margins of the Summit of the Americas.</p>\n\n<p>The Prime Minister recognized the vital contribution that General Motors International makes to the Canadian auto manufacturing sector, and welcomed the company’s recent investments in Oshawa and Ingersoll, Ontario.&nbsp;These investments strengthen the integrated North American auto sector and create good, middle-class jobs.</p>\n\n<p>The Prime Minister stressed Canada’s commitment to a net-zero future, and the critical role that zero-emission passenger vehicles will play in that future. He welcomed General Motors’ partnership in that effort, including its recent announcement to build a cathode active material (CAM) plant in Bécancour, Quebec, to support the production of electric vehicle batteries in North America.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/04/government-of-canada-secures-thousands-of-jobs-and-helps-create-canadas-first-full-scale-commercial-electric-vehicle-manufacturing-facility.html\">Government of Canada secures thousands of jobs and helps create Canada’s first full-scale commercial electric vehicle manufacturing facility</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/auto-auto.nsf/eng/home\">Canadian automotive industry</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n</ul></div>\n      "
}