{
  "path": "/en/news/statements/2022/10/24/statement-prime-minister-united-nations-day",
  "pageTitle": "Statement by the Prime Minister on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:\n</p>\n<p>“On October 24, 1945, in the wake of the Second World War, the United Nations (UN) was founded. Canada and the other founding members shared a vision of peace and security in a world that protects human rights, fundamental freedoms, and the international order. Today, we mark <a href=\"https://www.un.org/en/observances/un-day\">United Nations Day</a> by joining with our international partners to reaffirm our commitment to this vision and to the mission of the UN.\n</p>\n<p>“Since its founding, the UN has helped improve the lives of millions of people worldwide. With the combined strength of its 193 member states, it engages in peacekeeping operations around the world, delivers essential humanitarian assistance, and ensures a coordinated global approach to tackling ongoing and emerging crises and global challenges.\n</p>\n<p>“The UN’s 2030 Agenda for Sustainable Development and <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">the Sustainable Development Goals (SDGs)</a>, adopted by all member states, represent the kind of powerful consensus the UN can achieve in pursuit of a better future for all that leaves no one behind. The Government of Canada’s <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">2030 Agenda National Strategy</a> and <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a> have guided our implementation of the SDGs and, as co-Chair of the SDG Advocates Group, I am driving progress toward these goals through partnership.\n</p>\n<p>“The UN has come together in the face of intensifying challenges including the global recovery from the COVID-19 pandemic, the climate crisis, and more recently Russia’s unjustifiable invasion of Ukraine. The UN facilitates critical international cooperation, encourages unified decision-making, and provides humanitarian aid where it’s needed most.\n</p>\n<p>“Russia’s brutal, illegal, and unprovoked invasion of Ukraine demonstrates a blatant disregard for international law, democracy, and human life. A historic vote earlier this month demonstrated UN members’ collective determination to uphold the principles of the UN Charter when they overwhelmingly condemned Russia's actions in Ukraine and called Moscow's move illegal. Along with providing important humanitarian and financial aid, the solidarity and cooperation of UN member states is critical in standing against Russia and in supporting Ukraine.\n</p>\n<p>“Canada helped draft the UN Charter and, 77 years on, we remain deeply committed to its mission. For decades, Canada has partnered with its allies to address the most complex challenges of our time and today, we reaffirm our commitment to this crucial partnership. When we are united, we can build a stronger, safer, and fairer world.”\n</p></div>\n      "
}