{
  "path": "/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19",
  "pageTitle": "Canada’s plan to mobilize science to fight COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is supporting our country’s researchers as they do critical work to protect the health and safety of all Canadians, and people around the world, during the COVID-19 outbreak.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced support to quickly mobilize Canadian researchers and life sciences companies to support large-scale efforts towards countermeasures to combat COVID-19, including potential vaccines and treatments.</p>\n\n<p>This $275&nbsp;million for coronavirus research and medical countermeasures is part of the Government of Canada’s more than $1 billion COVID-19 Response Fund. The funding will be used to advance projects that are already underway by university researchers and others to respond to COVID-19, and ensure domestic supply of potential vaccines. These research efforts can move quickly, and include:</p>\n\n<ul>\n\t<li>$192 million in new projects that will be prioritized under the new Strategic Innovation Fund COVID-19 stream to deliver direct support to Canadian companies for large-scale projects. These companies include:\n\t<ul>\n\t\t<li>AbCellera, a Vancouver-based biotech company that has built the world’s leading technology for antibody discovery, is at the forefront of developing antibody-based drugs to treat and prevent COVID-19. AbCellera’s technology is being used to search blood samples of patients who have recovered from COVID-19 to find naturally-produced antibodies that can be used for treatment and prevention. AbCellera was the first company in North America to receive a sample from a convalescent patient, and within days identified over 500 human antibodies that are candidates for development as a treatment. The company has partnered with global biopharmaceutical company Eli Lilly to rapidly manufacture and distribute a treatment with the goal of beginning clinical trials in July 2020.</li>\n\t\t<li>Medicago, a Quebec City-based company with 20 years of experience in plant-based vaccines and therapeutics, that has identified a viable plant-based vaccine candidate currently at the pre-clinical testing phase. Funding will allow Medicago to rapidly move forward on clinical trials and then quickly shift to scaling up production for pandemic response.</li>\n\t</ul>\n\t</li>\n\t<li>Funding for the University of Saskatchewan’s Vaccine and Infectious Disease Organization – International Vaccine Centre (VIDO-InterVac), one of the largest and most advanced infectious disease research facilities in the world. With $11 million in funding from the Canada Foundation for Innovation, VIDO-InterVac will be able to strengthen its existing expertise in coronavirus research and to help develop a vaccine for COVID-19. An additional $12 million from Western Economic Diversification’s Regional Economic Growth Through Innovation program will help VIDO-InterVac expand its bio-manufacturing capacity to support clinical trials.</li>\n\t<li>Funding of $15 million for the National Research Council of Canada to upgrade its Human Health Therapeutics facility in Montréal to develop, test and scale-up promising vaccine candidates to be ready for industrial production. This will involve certifying the facility for Good Manufacturing Practice (GMP) quality assurance to ensure that their human pharmaceuticals and biologics, including vaccines, are consistently produced and controlled. This certification will support a more effective roll-out and production of vaccines, and help ensure that any vaccines produced by the facility can be made available to Canadians and people around the world more quickly.</li>\n\t<li>Support for BlueDot, a Toronto-based digital health firm, with a first-of-its-kind global early warning technology for infectious diseases. The company was one of the first in the world to identify the spread of COVID-19. The Government of Canada, through the Public Health Agency of Canada, will use its disease analytics platform to support modelling and monitoring of the spread of COVID 19, and to inform government decision-making as the situation evolves.</li>\n</ul>\n\n<p>These measures are part of a larger strategy the Government of Canada is implementing to protect Canadians and prevent the spread of the virus. The whole-of-government strategy will help ensure the capacity of our health care system, support international and domestic efforts, and mitigate the economic impacts on Canadians and Canadian business.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada is home to some of the most skilled and brightest researchers in the world, who are working hard to develop countermeasures that will protect the health and safety of Canadians and support international efforts to fight this pandemic. We are all in this together, and need to be doing our part to prevent the spread of the virus.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government is committed to protecting the health and safety of Canadians. We are all in this together: Canada is benefiting from the impressive and innovative power of Canadian researchers and businesses in our coordinated national approach to fight COVID-19. Together, we are rapidly scaling-up our capacity in research and in manufacturing the products we will need during the pandemic.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry&nbsp;&nbsp;</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our top priority is protecting the health and well-being of Canadians. We are funding nearly 100 research teams focused on rapidly developing effective methods to diagnose, treat, and manage patients with COVID-19 and on determining how to further strengthen our communication with Canadians.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“In the fight against COVID-19, we’re enlisting the best of Canadian ingenuity. Through our whole-of-government approach, we will be able to scale up the efforts to develop a vaccine for COVID-19, thanks in part to the support of our regional economic agencies across the country.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Economic Development and Official Languages</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the beginning of the COVID-19 outbreak, the Government of Canada has supported Canadian researchers and consulted with experts from around the world to help combat this new coronavirus.</li>\n\t<li>On March 11, 2020, the Government of Canada <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">announced a $1-billion package to help Canadians cope with the COVID-19 outbreak</a>, which included $275&nbsp;million for coronavirus research and medical countermeasures.</li>\n\t<li>A rapid research funding competition for projects was also launched to provide new evidence to help address COVID-19. Thanks to federal research funding organizations and researchers who volunteered their time to urgently review applications, the Government of Canada is now providing <a href=\"https://www.canada.ca/en/institutes-health-research/news/2020/03/government-of-canada-funds-49-additional-covid-19-research-projects.html\">$52 million in funding for 96 research projects</a>. Researchers will focus on developing and implementing measures to rapidly detect, manage, and reduce the transmission of COVID-19 to help tackle the spread of the virus in Canada and around the world.</li>\n\t<li>On March 20, 2020, the <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announced Canada’s Plan to Mobilize Industry to fight COVID-19</a>, which will create pathways to deploy resources to domestic manufacturers and businesses so they can help during this critical time.</li>\n\t<li>The Plan introduces <a href=\"https://pm.gc.ca/en/news/backgrounders/2020/03/20/new-measures-under-canadas-plan-mobilize-industry-fight-covid-19\">new measures</a> to help these businesses rapidly scale up production or re-tool their manufacturing lines to develop products made in Canada that will help in the fight against COVID-19. These products include critical health and safety supplies and equipment, including personal protective equipment, sanitization products, diagnostic and testing products, and disease tracking technology.</li>\n\t<li>On March 21, 2020, Minister Bains sent a letter to every university, college, polytechnic and cegep in the country asking them to help identify personal protective equipment, medical equipment and supplies in laboratories that the government might be able to purchase during the crisis. The Minister also asked for help to identify innovative manufacturing solutions, such as 3D printers, that could help address potential shortages of essential equipment.</li>\n\t<li>The Chief Science Advisor of Canada (CSA) has assembled a multidisciplinary science expert panel to advise her on the latest scientific developments relevant to COVID-19. This information will assist the CSA in providing current and cross-disciplinary advice to the Prime Minister and government. The expert group is composed of distinguished Canadian scientists and will be meeting on a regular basis to discuss available science and evidence from disease modelling, risk perception, diagnostic, and clinical research.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update.html\">Helping Canadians with the economic impact of the COVID-19 Pandemic</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}