{
  "path": "/en/news/statements/2018/10/01/statement-prime-minister-national-seniors-day",
  "pageTitle": "Statement by the Prime Minister on National Seniors Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Seniors Day:</p><p>“Trailblazers, role models, and unsung heroes, Canada’s seniors have shaped our country in countless ways, and paved a better path for millions of Canadians.</p><p>“They answered the call to serve and defended the freedom and democracy we enjoy today. They supported their families through the decades, working at one job or more so their kids could have the best start possible in life. They laid blueprints for buildings that continue to define our cities’ skylines, and drafted landmark social programs that make our country a stronger, more compassionate place.</p><p>“So many seniors have spent a lifetime in service to others. Every day, they raise, mentor, and teach future generations, lift communities through volunteer work, and share much-needed wisdom and perspective.</p><p>“In less than 20 years, Canada’s seniors will represent almost a quarter of our population. The new Minister of Seniors, Filomena Tassi, is leading the Government of Canada’s efforts to better understand the needs of Canadian seniors and make sure they get the support they need.</p><p>“We are working hard every day to give seniors, their families, and future retirees greater security and a better quality of life. We have enhanced the Canada Pension Plan, lowered&nbsp;the age of eligibility for Old Age Security benefits from 67 to 65, and boosted the Guaranteed Income Supplement by nearly $1,000 a year for vulnerable seniors.</p><p>“We have improved EI caregiver benefits to make it easier for Canadians to care for a family member in need. We have also committed $6 billion in funding to provinces for better home care, including palliative care, and taken steps to create safer, more accessible, and affordable housing, so more Canadians, including seniors, have a comfortable place to call home.</p><p>“Today, I encourage all Canadians to say thank you and recognize seniors in their life – parents, grandparents, teachers, friends, and neighbours – for everything they have done, and continue to do, for our country.”</p></div>\n      "
}