{
  "path": "/en/news/news-releases/2019/06/07/secretary-general-organisation-internationale-de-la-francophonie",
  "pageTitle": "Secretary-General of the Organisation internationale de la Francophonie to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Secretary-General of the Organisation internationale de la Francophonie, Louise Mushikiwabo, will visit Canada from June 9 to 12.</p>\n\n<p>During the visit, Prime Minister Trudeau and Secretary-General Mushikiwabo will discuss progress achieved since the Yerevan Summit on shared priorities, including advancing gender equality, defending human rights, and protecting and promoting the French language and francophone cultures. They will also discuss future goals and priorities of the Organisation, as well as the administrative modernization that the Organisation is undertaking.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada is a proud member of the international Francophone community and the Organisation internationale de La Francophonie. I look forward to meeting with Secretary-General Mushikiwabo to discuss ways we can work together to address common challenges, advance gender equality, and protect and promote the French language and francophone cultures.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>La Francophonie, whose main institution is the Organisation internationale de la Francophonie (OIF), is a group of 88 member states and governments who all share French as a common language.</li>\n\t<li>Member countries are collectively home to over 1 billion people, including 300 million Francophones, across five continents.</li>\n\t<li>Canada’s annual contribution of approximately $40 million helps the institutions, agencies and bodies of the Organisation internationale de la Francophonie to implement their respective programs.</li>\n\t<li>Canada has four seats on the OIF. In addition to federal representation, the provinces of New Brunswick and Quebec are full members, and Ontario has observer status.</li>\n\t<li>In 1969, Canada adopted its <em>Official Languages Act</em>. This March marked the 50<sup>th</sup> anniversary of the law<em>.</em></li>\n</ul>\n\n<h2>Associated Link(s)</h2>\n\n<ul>\n\t<li><a href=\"https://international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.francophonie.org/\">Organisation internationale de la Francophonie (OIF)</a></li>\n</ul></div>\n      "
}