{
  "path": "/en/news/statements/2019/08/19/statement-prime-minister-world-humanitarian-day",
  "pageTitle": "Statement by the Prime Minister on World Humanitarian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Humanitarian Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/humanitarianday/\">World Humanitarian Day</a>, we pay tribute to humanitarian aid workers and recognize the sacrifices they and their families make to help communities in crises. Humanitarian aid workers face difficult and dangerous situations to bring hope of a better future to people around the world.</p>\n\n<p>“In recent years, we have seen an overwhelming rise in extreme weather and natural disasters, driven by the climate crisis. Millions of people have been forced to flee their homes to escape not only armed conflict, violence and unrest, but also more frequent floods, fires, and tropical storms. Humanitarian workers are often the first to arrive in the wake of these events.</p>\n\n<p>“Each crisis is different and humanitarian workers face new challenges every day – often reaching people without access to food, healthcare, water, or shelter. They support the needs of vulnerable people and affected communities, offer life-saving care, and provide help for survivors of gender-based violence. Often members of crisis-affected communities themselves, they use their experience, knowledge, and ingenuity to get the job done and save lives.</p>\n\n<p>“The only way we can tackle the increasingly complex humanitarian crises facing our global community is by working together. That is why the Government of Canada supports international efforts to protect people and to promote international humanitarian law. Working with partners, we will continue to provide humanitarian aid funding to relief organizations and help meet the needs and priorities of people in crises, while putting the empowerment of women and girls at the centre of our efforts.</p>\n\n<p>“On behalf of the Government of Canada, I thank everyone involved in humanitarian work, here at home and around the world. Your work makes a lasting difference in the lives of millions of people.”</p></div>\n      "
}