{
  "path": "/en/news/statements/2022/06/10/los-angeles-declaration-migration-and-protection",
  "pageTitle": "Los Angeles Declaration on Migration and Protection | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Heads of State and Government of Argentine Republic, Barbados, Belize, the Federative Republic of Brazil, Canada, the Republic of Chile, the Republic of Colombia, the Republic of Costa Rica, the Republic of Ecuador, the Republic of El Salvador, the Republic of Guatemala, the Republic of Haiti, the Republic of Honduras, Jamaica, the United Mexican States, the Republic of Panama, the Republic of Paraguay, the Republic of Peru, the United States of America, and the Oriental Republic of Uruguay, gathered in Los Angeles on the occasion of the Ninth Summit of the Americas, reiterate our will to strengthen national, regional, and hemispheric efforts to create the conditions for safe, orderly, humane, and regular migration and to strengthen frameworks for international protection.</p>\n\n<p>We embrace the need to promote the political, economic, security, social, and environmental conditions for people to lead peaceful, productive, and dignified lives in their countries of origin.&nbsp; Migration should be a choice and not a necessity.</p>\n\n<p>We are committed to protecting the safety, dignity, human rights, and fundamental freedoms of all migrants, refugees, asylum seekers, and displaced and stateless persons regardless of their migratory status.&nbsp; We intend to cooperate closely to facilitate safe, orderly, humane, and regular migration, including return and readmission, in accordance with national legislation.</p>\n\n<p>We acknowledge that addressing irregular international migration requires a multilateral approach, and that ongoing health, social, and economic challenges of the pandemic exacerbate the root causes driving irregular migration.&nbsp;</p>\n\n<p>We celebrate the tradition of our region in welcoming refugees and migrants and showing solidarity with our neighbors.&nbsp; We recognize the positive contributions of refugees and migrants to the socio-economic development of their host communities. &nbsp;We applaud the sustained efforts of States in our hemisphere in hosting refugees, providing regular migration pathways, promoting local economic and social integration, facilitating voluntary return, and supporting the reintegration of returnees. &nbsp;This response should not rest solely on communities and countries that neighbor zones of migration flows.</p>\n\n<p>We remain committed to collectively leveraging the benefits of migration while addressing its challenges in countries and communities of origin, transit, destination, and return.&nbsp; We do so in a spirit of collaboration, solidarity, and shared responsibility between sovereign and independent States and in partnership with civil society and international organizations.&nbsp; We reaffirm our shared commitment to supporting host communities; strengthening regular pathways and access to international protection; fostering opportunities for decent work; facilitating regularization and access to services; and promoting principles of safe, orderly, humane, and regular migration.</p>\n\n<h2>Promoting Stabilization in Communities of Destination, Origin, Transit, and Return</h2>\n\n<p>We affirm that countries of origin and countries and communities hosting large numbers of migrants and refugees may need international financing and assistance related to development, basic humanitarian needs, protection, security, public health, education, financial inclusion, and employment. &nbsp;We support efforts that allow migrants, refugees, asylum seekers, and others in situations of vulnerability to integrate into host countries and access international protection when required, legal identity, regular status, dignified employment, and public services to rebuild their lives and contribute to those communities, when and as appropriate and in accordance with national legislation.&nbsp; We plan to continue efforts to prevent and reduce statelessness.&nbsp; We intend to expand efforts to address the root causes of irregular migration throughout our hemisphere, improving conditions and opportunities in countries of origin.&nbsp; We reaffirm the importance of safe, dignified and sustainable readmission and reintegration of returning migrants to help them reestablish themselves in their communities of origin.&nbsp; We further reaffirm the importance of ensuring all foreign nationals receive prompt consular assistance.</p>\n\n<h2>Promoting Regular Pathways for Migration and International Protection</h2>\n\n<p>We affirm that<strong><em>&nbsp;</em></strong>regular pathways, including circular and seasonal labor migration opportunities, family reunification, temporary migration mechanisms, and regularization programs promote safer and more orderly migration.&nbsp; We intend to strengthen fair labor migration opportunities in the region, integrating robust safeguards to ensure ethical recruitment and employment free of exploitation and discrimination.&nbsp; We intend to promote the recognition of qualifications, the portability of social benefits, and accountability for those who commit human rights violations and abuses.&nbsp; We plan to promote access to protection and complementary pathways for asylum seekers, refugees, and stateless persons in accordance with national legislation.&nbsp; We seek to invest in protection-sensitive border management processes that encourage and facilitate lawful, safe, and secure travel within the region.&nbsp; We commit to identify vulnerable individuals to ensure access to protection, as appropriate, at the soonest safe point possible.&nbsp; We further commit to provide specialized and gender-responsive attention to individuals in situations of vulnerability, including unaccompanied or separated migrant children, victims of trafficking, migrants of the LGBTQI+ community, survivors of gender-based violence, and indigenous and afro-descendant communities.&nbsp;</p>\n\n<h2>Promoting Humane Migration Management</h2>\n\n<p>Renewing our commitment to respect and ensure the human rights of migrants and refugees, we recognize each country’s responsibility to manage mixed movements across international borders in a secure, humane, orderly, and regular manner.&nbsp; We intend to expand collaborative efforts to save lives, prevent violence and discrimination, and combat smuggling of migrants and trafficking in persons.&nbsp; This includes expanded collaboration to prosecute smuggling and human trafficking criminal organizations as well as their facilitators and money laundering networks.&nbsp; We commit to provide appropriate protection and assistance to victimized individuals.&nbsp; We intend, in accordance with national legislation, to improve and facilitate regional law enforcement information sharing and explore new mechanisms to strengthen cooperation on border management, visa regimes, and regularization processes to combat exploitation by criminal groups.&nbsp; In the instance of foreign nationals with no fear of persecution or torture in their country of origin and without legal basis to remain in their country of presence, we commit to conduct any returns in a manner that respects the dignity of the individual, integrates safeguards to prevent refoulement, and ensures the return of children to safe conditions.&nbsp;</p>\n\n<h2>Promoting a Coordinated Emergency Response</h2>\n\n<p>Recognizing the imperative of promoting order, regular processes, and the safety of migrants, refugees and asylum seekers in the region, we commit to jointly plan, prepare, and identify necessary resources for emergency response and humanitarian assistance in situations of mass migration and refugee movements.&nbsp; We plan to strengthen existing regional coordination mechanisms and elevate the participation of civil society and international organizations to advance those aims.&nbsp; This includes strengthening information sharing, enhancing early warning systems, leveraging existing relevant fora and processes, and defining a common set of triggers that activate a coordinated response, in accordance with national legislation.</p>\n\n<h2>A Shared Approach to Reduce, Mitigate, and Manage Irregular Migration</h2>\n\n<p>To advance the common goals laid out in this Declaration and create the conditions for safe, humane, and regular migration through robust responsibility sharing, we intend to work together across the hemisphere to:</p>\n\n<ul>\n\t<li>Convene multilateral development banks, international financial institutions, and traditional donors to establish new financial support instruments for countries hosting migrant populations.</li>\n\t<li>Improve regional cooperation mechanisms for law enforcement information sharing, protection-sensitive border management, visa regimes, and regularization processes.</li>\n\t<li>Strengthen temporary labor migration pathways, as feasible, that benefit countries across the region, including through new programs promoting connections between employers and workers, robust safeguards for ethical recruitment, and legal protections for workers’ rights.</li>\n\t<li>Improve access to public and private services for migrants and refugees to promote their social and economic inclusion in host communities.</li>\n</ul>\n\n<hr>\n<p>This Declaration builds upon existing efforts and international commitments and advances the vision set forth in the Global Compact on Refugees and the Global Compact for Safe, Orderly and Regular Migration (GCM) anchored in the 2030 Agenda for Sustainable Development.&nbsp; We acknowledge the progress noted in the International Migration Review Forum Progress Declaration for the GCM.&nbsp; We affirm the fundamental work that continues under the Comprehensive Regional Protection and Solutions Framework (MIRPS), the Regional Conference on Migration (RCM), and the South American Conference on Migration (SACM), as key regional bodies to facilitate the implementation of this Declaration, as well as the Quito Process and the Regional Inter-agency Coordination Platform for refugees and migrants from Venezuela.&nbsp; The United Nations 1951 Refugee Convention; its 1967 Protocol; the Convention against Torture and Other Cruel, Inhuman, or Degrading Treatment or Punishment; the United Nations Convention against Transnational Organized Crime; its<strong>&nbsp;</strong>Protocol to Prevent, Suppress and Punish Trafficking in Persons, especially Women and Children; its<strong>&nbsp;</strong>Protocol against the Smuggling of Migrants by Land, Sea and Air; the United Nations Convention on the Rights of the Child; the International Convention on the Protection of the Rights of all Migrant Workers and Members of their Families; as well as other international conventions&nbsp;remain binding on Parties to those conventions that endorse this Declaration.&nbsp; This Declaration aligns with States’ commitments in the International Labour Organization’s Declaration on Fundamental Principles and Rights at Work and its General Principles and Operational Guidelines for Fair Recruitment.&nbsp; We reiterate the importance and meaning of the principle of non-refoulement as a cornerstone of the international protection of refugees.&nbsp; We applaud efforts throughout the region to provide a coordinated and comprehensive response to all migrants, returnees, refugees, asylum seekers and stateless persons fleeing human rights violations and abuses, generalized violence, and ongoing political and military conflicts. &nbsp;We make this Declaration of non-legally binding commitments to enhance cooperation and shared responsibilities on managing migration and protection in ways grounded in human rights, transparency, nondiscrimination, responsibility-sharing, and State sovereignty.</p>\n\n<hr>\n<p>&nbsp;</p></div>\n      "
}