{
  "path": "/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-prime-minister-new-zealand-jacinda",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of New Zealand Jacinda Ardern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of New Zealand, Jacinda Ardern, on the margins of the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting.</p>\n\n<p>The two prime ministers reiterated their commitment to addressing shared priorities, including economic growth that benefits everyone, and reconciliation with Indigenous Peoples. They reaffirmed their commitment to taking ambitious action to combat climate change, and help build a net-zero future. The two leaders also discussed respective approaches to strengthening gun control laws.</p>\n\n<p>Prime Minister Trudeau highlighted the upcoming release of Canada’s Indo-Pacific Strategy. He emphasized that New Zealand is a close partner as Canada takes steps to increase its engagement in the region. The prime ministers committed to continue working together to promote sustainable growth that creates good middle-class jobs across the Indo-Pacific region.</p>\n\n<p>Earlier in the day, Prime Minister Trudeau and Prime Minister Ardern participated in a meeting convened by the Vice President of the United States of America, Kamala Harris, to condemn North Korea’s latest missile launch and urge the regime to end its missile and nuclear programs. The Prime Minister of Japan, Kishida Fumio, the Prime Minister of Australia, Anthony Albanese, and the Prime Minister of South Korea, Han Duck-soo, also participated in the meeting.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Ardern underlined their shared commitment to continue supporting Ukraine, and remain united with other allies in the face of ongoing Russian aggression.</p>\n\n<p>The two leaders agreed to continue working together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_new_zealand-nouvelle_zelande.aspx?lang=eng\">Canada-New Zealand Relations</a></li>\n\t<li><a href=\"/en/news/readouts/2022/09/20/prime-minister-justin-trudeau-meets-prime-minister-new-zealand-jacinda\">Prime Minister Justin Trudeau meets with Prime Minister of New Zealand Jacinda Ardern</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/11/statement-by-minister-joly-on-north-koreas-continued-provocations.html\">Statement by Minister Joly on North Korea’s continued provocations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}