{
  "path": "/en/news/news-releases/2023/01/18/building-made-canada-electric-vehicle-chargers",
  "pageTitle": "Building made-in-Canada electric vehicle chargers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From mining, to manufacturing, to charging, Canadian businesses and workers are attracting historic investments in the electric vehicle (EV) supply chain. When electric vehicles are made from Canadian minerals, assembled by Canadian auto workers, and powered at Canadian-made chargers, we secure and create jobs, grow our economy, and keep our air clean now and into the future.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited the facilities of EV charger manufacturer FLO in Shawinigan, Quebec, to highlight made-in-Canada chargers. Canadian workers are leading on every step of the EV supply chain, from mining and processing critical minerals, to building EVs and batteries, to building charging infrastructure. To make EVs more accessible for Canadians, the Government of Canada is investing more than $1.2&nbsp;billion in projects to build almost 84,500 chargers by 2027, of which thousands are already in service. This is in addition to charging stations supported by investments from provinces, territories, and the private sector.</p>\n\n<p>While in Quebec, the Prime Minister will visit the Hydrogen Research Institute (HRI) of the Université du Québec à Trois-Rivières, which conducts research on technologies to support the storage, production, and use of hydrogen. The Université du Québec à Trois-Rivières is supporting the development of Canadian hydrogen hubs and supply chains, to help cut emissions from transportation, including trucking and marine transportation. Developing and adopting more hydrogen technology not only creates jobs and economic growth, but helps reduce pollution and fight climate change. The Minister of Innovation, Science and Industry, François-Philippe Champagne, is attending both events.</p>\n\n<p>Canadian workers and businesses are already leading on clean energy and technology, and the components that go into it. As demand continues to grow, positioning Canada as a reliable supplier of clean technology will create even more Canadian jobs, grow our economy, and cut pollution to help fight climate change.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadian-made electric vehicle chargers are win-win-win: not only do they support good middle-class jobs and position Canada as a global leader on clean tech, they also make it easier than ever for Canadians to choose an EV as their next vehicle. Going electric saves families money on monthly expenses, all while keeping our air clean for generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We’re making electric vehicles more affordable and charging more accessible where Canadians live, work, and play. Investing in more EV infrastructure will put more Canadians in the driver’s seat on the road to a net-zero future and help achieve our climate goals.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Natural Resources</footer>\n</blockquote>\n\n<blockquote>\n<p>“As we can see here at FLO in Shawinigan, our region has the talent that the world needs. Thanks to Louis Tremblay and all the workers at FLO, it’s clear that Canadian innovation is helping to build a cleaner, greener, and more resilient economy, while also cementing our position as a global leader in the EV supply chain.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Today’s visit comes on the third day of the Prime Minister’s tour to highlight Canada’s strong EV supply chain, from mining to manufacturing. The Prime Minister’s tour also included a visit to Saskatoon to highlight Canadian leadership in critical minerals – the building blocks of clean technology ‒ and a stop in Windsor to highlight Canadian manufacturing of EVs and EV batteries.</li>\n\t<li>Canada is advancing toward the deployment of 50,000 new chargers supported by $400&nbsp;million in investments and $500&nbsp;million in financing through the Canada Infrastructure Bank, in addition to the 34,500&nbsp;EV chargers already funded by the federal government.</li>\n\t<li>Canada currently has&nbsp;nearly 20,000 publicly available charging stations at 8,249 charging sites&nbsp;across the country.</li>\n\t<li>With over 75,000 fast and level&nbsp;2&nbsp;EV charging stations deployed across North America, FLO is a leading manufacturer and network operator of electric vehicle charging solutions. Based and founded in Quebec in 2009 as AddÉnergie, FLO is now the leader in smart charging solutions for electric vehicles in Canada and is expanding into international markets, demonstrating Canada’s expertise and innovation.</li>\n\t<li>Last month, the Government of Canada published proposed regulations that set zero-emission vehicles (ZEV) sales targets for manufacturers and importers of new passenger cars, SUVs, and pickup trucks. The regulations will require that at least 20 per cent of new vehicles sold in Canada will be zero emission by 2026, at least 60 per cent by 2030, and 100 per cent by 2035. These targets will help increase supply for more Canadians to be able to buy ZEVs.</li>\n\t<li>To help more Canadians purchase a ZEV, the government is investing $1.7&nbsp;billion to extend the Incentives for Zero-Emission Vehicles (iZEV) Program until March 2025, and expand the types of vehicles eligible under the program, to include more vans, trucks, and SUVs. The program provides up to $5,000 off the purchase or lease of a ZEV. To date, over 185,160 incentives have been provided to Canadians and businesses.</li>\n\t<li>The <a href=\"https://www.nrcan.gc.ca/energy-efficiency/transportation-alternative-fuels/greening-freight-programs/green-freight-program/20893\">Green Freight Program</a>, the <a href=\"https://www.nrcan.gc.ca/energy-efficiency/transportation-alternative-fuels/electric-and-alternative-fuel-infrastructure/zero-emission-vehicle-awareness-initiative-medium-and-heavy-duty-stream/zero-emission-vehicle-awareness\">medium- and heavy-duty stream of the ZEVAI</a>, and the <a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles/medium-heavy-duty-zero-emission-vehicles\">Incentive for Medium- and Heavy-Duty Zero-Emission Vehicles (iMHZEV) Program</a> reduce emissions by helping businesses and communities across the country make the switch to ZEV.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2023/01/16/strengthening-global-electric-vehicle-supply-chains-canadian\">Strengthening global electric vehicle supply chains with Canadian resources</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/01/17/building-electric-vehicles-canada-create-jobs-and-cleaner-future\">Building electric vehicles in Canada to create jobs and a cleaner future for everyone</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/transportation-alternative-fuels/zero-emission-vehicle-infrastructure-program/21876\">Zero Emission Vehicle Infrastructure Program</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/energy-efficiency/transportation-alternative-fuels/electric-and-alternative-fuel-infrastructure/zero-emission-vehicle-awareness-initiative/22209\">Zero Emission Vehicle Awareness Initiative</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles/zero-emission-vehicle-charging-stations#/find/nearest?country=CA\">Zero Emission vehicle charging stations</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles\">Zero-emission vehicles</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/climate-change-adapting-impacts-and-reducing-emissions/canadas-green-future/the-hydrogen-strategy/23080\">The Hydrogen Strategy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadian-critical-minerals-strategy.html\">The Canadian Critical Minerals Strategy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reduction Plan</a></li>\n</ul></div>\n      "
}