{
  "path": "/en/news/readouts/2021/12/22/prime-minister-justin-trudeau-speaks-chancellor-olaf-scholz-germany",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor Olaf Scholz of Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Chancellor of Germany, Olaf Scholz, to offer his congratulations on the successful formation of a new government and on his appointment as Chancellor.</p>\n\n<p>The two leaders reaffirmed the deep relationship and ongoing collaboration between Canada and Germany, based on common values, interests, and priorities.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz discussed&nbsp;their shared concerns about Russia’s aggressive and destabilizing actions in and around Ukraine. The leaders agreed on the importance of continued coordination and engagement between allies and partners, including in the context of NATO and the G7. Prime Minister Trudeau expressed the imperative for Russia to de-escalate the situation, and reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The two leaders further agreed that Canada, Germany, and other likeminded countries must cooperate and coordinate their efforts to address current global challenges, including countering authoritarian and destabilizing forces through the promotion of democracy, human rights, and the rule of law. The Prime Minister indicated that he was ready to support Germany’s G7 Presidency in 2022 in addressing issues of common interest and concern.</p>\n\n<p>Prime Minister Trudeau emphasized that he looked forward to working closely with Chancellor Scholz to ensure ongoing&nbsp;prosperity for people in both countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/12/08/statement-prime-minister-formation-new-government-germany\">Statement by the Prime Minister on the formation of a new government in Germany</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/12/g7-foreign-ministers-statement-on-russia-and-ukraine.html\">G7 Foreign Ministers’ Statement on Russia and Ukraine</a></li>\n</ul></div>\n      "
}