{
  "path": "/en/news/news-releases/2018/04/16/prime-minister-announces-partnerships-climate-and-culture-france",
  "pageTitle": "Prime Minister announces partnerships on climate and culture with France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau embarked today on the first day of an official visit to France to further deepen the ties between our two countries and to promote even closer economic collaboration, including through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), to build a strong middle class and create new jobs and opportunities for people in both countries.</p><p>Prime Minister Trudeau and French President Emmanuel Macron today concluded a productive meeting during which they discussed important shared issues including the environment, the economy, culture and international security. They also discussed ways we can increase trade and investment, grow the middle class and further strengthen the relationship between the two countries.</p><p>Together, the two leaders announced that, as of today, France and Canada commit to increase their cooperation against climate change, through the France-Canada Partnership on climate and the environment. Alongside the Paris Agreement, this new partnership will help the two countries to redouble their efforts and work together even more closely to fight climate change.</p><p>In order to deepen the close relationship between the two countries with regards to culture, Prime Minister Trudeau and President Macron also announced a new cultural initiative aimed at promoting cultural expression, diversity and the French language in the digital space. This initiative will also enable the two countries to enhance their collaboration within the United Nations Educational, Scientific and Cultural Organization (UNESCO).</p><p>During his first day in Paris, Prime Minister Trudeau also met with the Co-chairs of the G7 Gender Equality Advisory Council, Isabelle Hudon, Ambassador of Canada to France and Monaco, and Melinda Gates. Together, they discussed ways to promote economic growth that benefits everyone, a theme that will be at the forefront of the upcoming G7 summit in Charlevoix.</p><p>The Prime Minister also met with representatives from the Organization for Economic Co-operation and Development, UNESCO and the International Organization of La Francophonie, to strengthen Canada’s relationships with these important multilateral organizations.</p><p>Tomorrow, the Prime Minister will meet with Édouard Philippe, Prime Minister of France, Gérard Larcher, President of France’s Senate, and François de Rugy, President of the French Assemblée Nationale, before addressing the Assemblée Nationale. In his speech, Prime Minister Trudeau will discuss Canada’s role in the world. He will highlight Canada’s commitment to progressive trade, gender equality, international security and democracy, in addition to underlining the important values Canada shares with France and Europe. This will be the first time a Canadian head of government addresses the Assemblée Nationale.</p><p>Prime Minister Trudeau will also meet with Canadian business leaders to discuss the benefits of progressive trade and of CETA for entrepreneurs on both sides of the Atlantic.</p><h2>Quote</h2><blockquote><p>“I would like to thank President Macron for his warm welcome. Canada and France have a close relationship and share an ambitious vision of how we can create economic growth that benefits everyone and shape our world for the better. Now, thanks to the France-Canada Partnership on climate and the environment and the new cultural initiative, we will be working even more closely together to fight climate change, further strengthen our cultural ties and build a better future for people in both countries.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and France have a long-standing, solid relationship based on a common history and language, shared values, and diversified collaboration on economic, social, political and security issues.</li><li>CETA has shown its benefits even during its provisional implementation. In 2017, imports into Canada from France grew by 4 percent from the previous year, and Canadian investment in France increased by 23 percent. CETA represents the future of our stronger economic partnership based on common values and goals.</li><li>The France-Canada Partnership on climate and the environment will support and accelerate achievement of Paris Agreement targets thanks to concrete measures, such as mobilizing global players to promote carbon pricing and encouraging energy efficiency and reduce emissions in the land, marine and air transport sectors, with the aim of making this agreement in principle a reality.</li><li>This is the first time a Canadian head of state has been asked to speak inside the Assemblée Nationale (also known as the hemicycle) in front of all its members.</li><li>In Paris, at a ceremony to rekindle the flame at the Tomb of the Unknown Soldier, the Prime Minister will pay homage to the sacrifice and courage of the thousands of Canadians who gave their lives on French soil during the two World Wars.</li><li>In the company of Isabelle Hudon, Ambassador of Canada to France and Monaco, the Prime Minister will inaugurate the new chancery, to open officially on May 2. The chancery will provide a more suitable and modern space for Canadian culture in France by housing the embassy and the Canadian Cultural Centre under the same roof.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/04/04/prime-minister-travel-peru-france-and-united-kingdom\">Prime Minister to travel to Peru, France, and the United Kingdom</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li><li><a href=\"/en/news/backgrounders/2018/04/16/canada-france-climate-and-environment-partnership\">France-Canada Partnership on climate and the environment</a></li><li><a href=\"/en/news/backgrounders/2018/04/16/joint-declaration-cultural-diversity-and-digital-space\">Joint statement on cultural diversity and the digital space</a></li></ul></div>\n      "
}