{
  "path": "/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta",
  "pageTitle": "$10-a-day child care for families in Alberta | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every child deserves the best possible start in life, and all parents should have the ability to build both a family and career. Yet, too many families across Canada lack access to affordable, inclusive, and high-quality child care. The COVID-19 pandemic has also made it clear that without access to child care, too many parents – especially women – cannot fully participate in the workforce.</p>\n\n<p>That is why the Government of Canada has laid out a plan to provide Canadian parents with, on average, $10‑a‑day child care spaces for children under six years old. This plan to build a Canada‑wide, community‑based early learning and child care system will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of Alberta, Jason Kenney, today announced that both governments have reached an agreement that will support an average of $10‑a‑day care in the province, significantly reducing the price of child care for families. The agreement includes creating 42,500 new regulated early learning and child care spaces by the end of March 2026. With federal funding of almost $3.8 billion over the next five years, Alberta will also see a 50 per cent reduction in average parent fees for children under the age of six in regulated child care by the end of 2022.</p>\n\n<p>This agreement will fund critical services, and grow a strong and skilled workforce of early childhood educators, including through greater opportunities for professional development. The agreement will also support a child care system that is fully inclusive of children with disabilities and children needing enhanced or individual supports, and ensures all families have equitable access to high-quality, affordable child care.</p>\n\n<p>The agreement also includes a clear commitment to continue to work collaboratively with Indigenous organizations in Alberta to develop an approach that will support Indigenous children in the province in having access to culturally-appropriate, quality, and affordable child care.</p>\n\n<p>Since 2015, the government has been helping make life more affordable for families. This includes programs like the Canada Child Benefit, which puts more money into the pockets of nine out of 10 Canadian families and has helped lift more than 400,000 children out of poverty. The Government of Canada continues to work with provinces, territories, and Indigenous partners across the country to make life easier and more affordable for families, grow the middle class, create jobs, help parents return to the workforce, and give children across the country a better start in life.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to affordable child care. That is why we’re making $10‑a‑day child care a reality across the country. Today’s agreement with Alberta is an important step forward to delivering on our Canada-wide early learning and child care system, which will create jobs, grow the middle class, and give our kids the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Access to child care is as much an economic policy as it is a social policy. Not only does it give our children the best possible start in life, it ensures that parents – especially mothers – can work, and it creates good, well-paying jobs for educators. Today’s announcement with the Government of Alberta is another important step in making this a reality for families everywhere in Canada. It is an essential part of our plan to make sure Canada has a strong recovery that leaves no one behind.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every child deserves the best possible start in life. Our vision and objectives for early learning and child care are quite simple: reduce child care fees in the next five years, create more spaces, ensure equitable access for all children, and grow a strong and skilled early childhood educator workforce. Today’s historic agreement with Alberta is another important step on the path to ensuring all families have access to high-quality, affordable, flexible, and inclusive child care.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today is a good day for parents and families in Alberta. We’ve listened to families, child care operators, and business leaders to develop an agreement that gives us flexibility to truly meet the needs of and make life a little easier for even more families in Alberta.”</p>\n\n<footer class=\"default\">The Hon. Rebecca Schulz, Alberta’s Minister of Children’s Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“We promised Alberta families we would get this done and that is exactly what we did. Access to affordable early learning and child care is a matter of equality, fairness, and access to economic opportunities. This agreement will get more parents back to work, it will put more money in the pockets of thousands of Alberta families, and it will give so many young children the best start in life.”</p>\n\n<footer class=\"default\">The Hon. Randy Boissonnault, Minister of Tourism and Associate Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Earlier this year, the Government of Canada reached similar agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, and <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> to strengthen the early learning and child care system in the province.</li>\n\t<li>The 42,500 new regulated spaces in Alberta will be among licensed not-for-profit, public, and family-based child care providers.</li>\n\t<li>In addition to the federal contribution, Alberta currently invests nearly $400&nbsp;million in early learning and child care annually.</li>\n\t<li>Recognizing Alberta’s mixed market system, the governments of Canada and Alberta will also create a Canada-Alberta Implementation Committee which will develop and propose an expansion plan and cost control framework to support the growth of additional regulated spaces by licensed providers.</li>\n\t<li>The Canada-Alberta Implementation Committee will also monitor progress on child care commitments in consultation with stakeholders. The Government of Canada will be represented on this committee by the Federal Secretariat on Early Learning and Child Care.</li>\n\t<li>Budget&nbsp;2021 provides new investments to build a high-quality, affordable, flexible, and inclusive early learning and child care system across Canada. These investments total up to $30&nbsp;billion over five years, and combined with previous investments announced since 2015, $9.2&nbsp;billion every year, permanently.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 2,500 in Alberta.</li>\n\t<li>Investments in child care will benefit all Canadians. Studies show that for every dollar invested&nbsp;in early childhood education, the broader economy receives between $1.50 and $2.80 in return.</li>\n\t<li>To promote greater gender equality at home and in the workplace, the Government of Canada has also introduced the Parental Sharing Benefit in 2019. This new measure provides an additional five weeks of Employment Insurance parental benefits when parents – including adoptive and same-sex parents – agree to share parental benefits.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap3\"><em>Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada child benefit</a></li>\n</ul></div>\n      "
}