{
  "path": "/en/news/news-releases/2022/11/18/prime-minister-strengthens-relations-indo-pacific-region-apec",
  "pageTitle": "Prime Minister strengthens relations with the Indo-Pacific region at the APEC Economic Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting hosted by Thailand, where he positioned Canada as a strong partner to grow and diversify trade to create good, middle-class jobs on both sides of the Pacific, and strengthen ties between our people.</p>\n\n<p>During the various APEC Leaders’ working sessions, including a session with the APEC Business Advisory Council, the Prime Minister promoted the expansion of regional market access, trade, and economic growth opportunities in the Indo-Pacific. He underlined Canada’s unique contributions to the region – as an energy security partner, a safe source of agriculture and agri-food, and a reliable exporter of natural resources, including the critical minerals needed in the clean energy transition. He also encouraged leaders to make ambitious commitments and investments that foster clean economic growth, and advance women’s economic empowerment.</p>\n\n<p>As part of the upcoming release of Canada’s Indo-Pacific Strategy, the Prime Minister announced the following measures to expand trade, investment, and supply chain resilience in the Indo-Pacific to benefit people in the region and Canada alike:</p>\n\n<ul>\n\t<li>$45&nbsp;million to launch a series of enhanced Minister-led trade missions to the Indo-Pacific to support exporters and regionally based Canadian Chambers of Commerce in Indo-Pacific markets to facilitate long-term trade and investment opportunities;&nbsp;</li>\n\t<li>$31.8&nbsp;million to establish Canada’s first agriculture office in the region to increase and diversify agriculture and agri-food exports to the Indo-Pacific, strengthening trade on both sides of the Pacific; and</li>\n\t<li>$92.5&nbsp;million to significantly expand capacity at Canada’s missions in the Indo-Pacific and within Global Affairs Canada to deepen diplomatic, trade, development, and climate ties with regional partners and defend Canadian interests in the region.</li>\n</ul>\n\n<p>The Prime Minister also announced an investment of $13.5&nbsp;million to expand natural resource ties with Indo-Pacific partners – in trade, investment, and science, technology and innovation. This investment will help countries on both sides of the Pacific transition to a clean economy by sharing and expanding Canada’s expertise, including the sustainable development of critical minerals, and supporting the Canadian energy sector and its workers for generations to come.</p>\n\n<p>While in Thailand, Prime Minister Trudeau endorsed the Bangkok Goal Declaration on the Bio-Circular-Green (BCG) Economy, a trade and investment model in support of the energy transition, ensuring that member economies remain environmentally and socially responsible when conducting business.</p>\n\n<p>Throughout his meetings, the Prime Minister expressed his concern at the economic impact of Russia’s illegal invasion of Ukraine, which has created significant threat to global peace and stability. In the face of wider impacts caused by the invasion, including on food and energy security, global supply chains, and post-pandemic economic recovery, he underscored the importance of a united response to overcome the conflict’s impact on economic growth in the region.</p>\n\n<p>Following North Korea’s recent series of missile tests, including the suspected launch of an intercontinental ballistic missile on Friday, Prime Minister Trudeau participated in a security meeting convened by the Vice-President of the United States of America, Kamala Harris, on the margins of the APEC Economic Leaders’ Meeting. He was joined by the leaders of South Korea, Japan, New Zealand, and Australia. The Prime Minister strongly condemned Pyongyang’s provocation and called for continued international coordination to address the threat posed by North Korea’s ongoing nuclear and ballistic missile programs.</p>\n\n<p>At the APEC Economic Leaders’ Meeting, the leaders issued a joint declaration highlighting priorities and commitments to inform APEC’s future work agenda and the members’ commitment to work with partners to build an economy that works for people on both sides of the Pacific.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“By opening new markets and opportunities for Canadian businesses, innovators, and entrepreneurs, and attracting investment to Canada in sectors like clean energy that will define the global economy, we are building an economy that works for all Canadians. I look forward to working with fellow APEC leaders to build on our success, and create even more opportunities for Canadians and all people in the Indo-Pacific region.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the seventh time Prime Minister Trudeau has participated in an APEC Economic Leaders’ Meeting, and his first official visit to Thailand.</li>\n\t<li>This was the third leg of the Prime Minister’s three-stop tour of the Indo-Pacific that also included his participation in the Association of Southeast Asian Nations (ASEAN) Summit in Phnom Penh, Cambodia and the G20 Summit in Bali, Indonesia. The Prime Minister will now travel to Djerba, Tunisia to participate in the Eighteenth Summit of La Francophonie.</li>\n\t<li>As of 2020, APEC’s 21 member economies are responsible for more than 60 per cent of global economic output, account for 47 per cent of world trade, and are home to 38 per cent of the world’s population.</li>\n\t<li>In 2020, known foreign direct investment from APEC economies in Canada totalled $569&nbsp;billion. Four of Canada’s top five trading partners are APEC members: the United States of America, China, Mexico, and Japan.</li>\n\t<li>In Bangkok, the Prime Minister held bilateral meetings with the President of Chile, Gabriel Boric and the Prime Minister of Thailand, Prayut Chan-o-cha. He also held pull-aside meetings with the Vice-President of the United States of America, Kamala Harris, and the Prime Minister of New Zealand, Jacinda Ardern.</li>\n\t<li>Following the meeting with Chile, the Prime Minister witnessed the signing of the <a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/declaration_itp-pmti.aspx?lang=eng\">Canada-Chile Joint Declaration on Investment Treaty Practice</a>, a next step to Chile’s ratification of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership.</li>\n\t<li>The Prime Minister had an audience with Their Majesties the King and Queen of Thailand.</li>\n\t<li>He also met with the Chief Executive Officer of the Canadian Partnership for Women and Children’s Health, Julia Anderson.</li>\n</ul>\n\n<ul>\n\t<li>While in Thailand, the Prime Minister also announced an investment of $1.2&nbsp;million to expand knowledge and data analysis on smuggling of migrants in the Southeast Asia region to ensure that counter-smuggling responses are targeted and effective.</li>\n</ul>\n\n<ul>\n\t<li>While in Thailand, the Prime Minister met with members of Junior Team Canada to discuss their participation in the APEC Voices of the Future program and to emphasize the importance of youth engagement, entrepreneurship, and community leadership.</li>\n\t<li>Thailand is currently Canada’s second-largest overall trading partner in the ASEAN region.</li>\n\t<li>Canadian direct investment in Thailand totalled $134&nbsp;million in 2021, while Thai direct investment in Canada reached $72&nbsp;million.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/18/expanding-partnerships-and-strengthening-ties-indo-pacific\">Backgrounder: Expanding partnerships and strengthening ties in the Indo-Pacific</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/17/prime-minister-justin-trudeau-meets-prime-minister-thailand-prayut-chan-o\">Prime Minister Justin Trudeau meets with Prime Minister of Thailand Prayut Chan-o-cha</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/17/prime-minister-justin-trudeau-meets-president-chile-gabriel-boric\">Prime Minister Justin Trudeau meets with President of Chile Gabriel Boric</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/declaration_itp-pmti.aspx?lang=eng\">Canada-Chile Joint Declaration on Investment Treaty Practice</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/16/prime-minister-advances-indo-pacific-engagement-and-shared-priorities-g20\">Prime Minister advances Indo-Pacific engagement and shared priorities at G20 Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/thailand-thailande/relations.aspx?lang=eng\">Canada-Thailand Relations</a></li>\n</ul></div>\n      "
}