{
  "path": "/en/news/news-releases/2019/05/08/prime-minister-attend-christchurch-call-meeting-eliminating-terrorist",
  "pageTitle": "Prime Minister to attend the Christchurch Call meeting on eliminating terrorist and violent extremist content online | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The recent attacks in Christchurch, New Zealand, have highlighted the urgent need for governments, tech companies, and civil society to work together to eliminate terrorist and violent extremist content online.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that he will travel to Paris, France, from May 15 to 17, to meet with government leaders and representatives of prominent social media companies to discuss concrete solutions to eliminate terrorist and violent extremist content online.</p>\n\n<p>During the meeting, government leaders will explore how they can – and must – work more closely with the tech industry, especially social media platforms, to stop the internet from being used as a tool to organize and promote terrorism and violent extremism.</p>\n\n<p>During his visit, Prime Minister Trudeau will also attend VivaTech, an important gathering of technology leaders and start-ups, and will meet with Canadian start-ups. While at VivaTech, the Prime Minister will deliver remarks on trust in the digital world.</p>\n\n<p>At the same time, the Minister of Innovation, Science and Economic Development, Navdeep Bains, will attend the G7 Meeting of Digital Ministers, which will focus on combating online hate and abuse.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Social media and other online platforms have connected people in many positive and unprecedented ways. But they have also increasingly become used as tools to incite, publish, and broadcast extremist violence and hatred. Governments and social media companies share an urgent responsibility to build a coordinated global response to eliminate this content – and make sure people can continue to have trust in online spaces.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In December 2018, the Government of Canada launched the&nbsp;<a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a>, which outlines Canada’s approach and priorities to prevent the kind of radicalization that leads to violence to begin with.</li>\n\t<li>Radicalization to violence happens when a person or group takes on extremist beliefs that lead to them advocating violence and, possibly, taking part in terrorist activity.</li>\n\t<li>The Canada Centre for Community Engagement and Prevention of Violence&nbsp;leads the Government of Canada’s efforts to counter radicalization to violence, and works with all levels of governments, not-for-profit organizations, communities, youth, frontline practitioners, academia, law enforcement, and international organizations.</li>\n\t<li>Viva Technology or “VivaTech” is a three-day event bringing together the world’s leaders in technology and business with the most promising start-ups and disruptors of tomorrow to explore transformational ideas on a global scale. Since its inception in 2016, VivaTech has welcomed more than 100,000 attendees – among them 9,000 of the most innovative start-ups in the world.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a></li>\n\t<li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France relations</a></li>\n\t<li><a href=\"https://www.elysee.fr/en/g7\">G7</a></li>\n\t<li><a href=\"https://vivatechnology.com/\">VivaTech</a></li>\n</ul></div>\n      "
}