{
  "path": "/en/news/news-releases/2022/04/29/producing-made-canada-vaccines-and-creating-hundreds-good-jobs",
  "pageTitle": "Producing made-in-Canada vaccines and creating hundreds of good jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada’s top priority remains protecting the health and safety of all Canadians. Since the beginning of the pandemic, we worked hard to secure life-saving personal protective equipment, invest in our health care system, and ensure everyone could get vaccinated. As we recover from the pandemic, we will continue to strengthen Canada’s capacity to develop and produce made-in-Canada vaccines so we can keep Canadians healthy now and into the future, while creating good jobs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that COVID-19 vaccine developer Moderna will build a state-of-the-art manufacturing facility in Quebec to deliver made-in-Canada vaccines. When completed, this new facility will be able to produce up to 100&nbsp;million mRNA vaccine doses annually. It will also create hundreds of good jobs.</p>\n\n<p>Construction is set to start this year and the facility is expected to be operational in 2024 at the earliest, subject to planning and regulatory approvals. In addition to COVID-19 vaccines, the facility is expected to be able to produce vaccines for other respiratory diseases, such as influenza – pending their ongoing development by Moderna and approval by Health Canada.</p>\n\n<p>Strengthening our biomanufacturing and life sciences sector across the country will help re-establish Canada’s domestic vaccine manufacturing capability, bring Canadian innovation to the front lines of tomorrow’s health solutions, and ensure we are better prepared for future health crises – all while growing the economy and creating good jobs.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“COVID-19 vaccines saved lives and got Canadians back to doing the things they love.</p>\n\n<p>Today’s announcement means that Canadian workers and Canadian innovation will play a key role in keeping our communities safe now and in the future. It also means hundreds of new, well-paying jobs as we recover from this pandemic and build a better future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s announcement is yet another example of our promise to Canadians to have their back throughout this pandemic and beyond. From the outset, we took short-term strategic actions with a long-term vision to ensure that Canada is well prepared for future pandemics while also strengthening our economy and creating good jobs for Canadians. Moderna establishing their operations here in Canada is a testimony to that vision and to Canada’s attractiveness as a place to invest and to innovate.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“One of our government’s top priorities is to protect the health and safety of people in Canada. Moderna’s new facility will strengthen domestic health security and pandemic preparedness through timely access to innovative, cutting-edge vaccines that help us save lives. Moderna’s presence will also further establish Canada as a global leader in mRNA technology, leading a new era of domestic health innovation.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government continues to work in partnership with leading vaccine developers to build a domestic biomanufacturing capacity for safe and effective mRNA vaccines. We are working to ensure that Canada continues to have access to vaccines well into the future and that we continue to protect the health and safety of everyone in Canada.”</p>\n\n<footer class=\"default\">The Hon. Filomena Tassi, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are delighted to reach this landmark with the Government of Canada and bring a state-of-the-art mRNA facility to the people of Canada. The government has shown true leadership in the fight against COVID-19. We share a common vision for the fundamental need for pandemic preparedness in the face of future pandemics and health emergencies.”</p>\n\n<footer class=\"default\">Stéphane Bancel, Chief Executive Officer, Moderna</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Moderna is a pioneering biotechnology company specializing in mRNA therapeutics and vaccines. Over 29 million doses of its Spikevax vaccine have been distributed across Canada since the start of the pandemic.</li>\n\t<li>In August 2021, the Government of Canada announced a memorandum of understanding with Moderna to build a state-of-the-art mRNA vaccine production facility in Canada. Construction is set to start this year, and the facility is expected to be operational in 2024 at the earliest, subject to planning and regulatory approvals.</li>\n\t<li>A definitive agreement is being finalized based on the 2021 memorandum of understanding between the Government of Canada and Moderna.</li>\n\t<li>Moderna is committed to partnering with Canada’s leading research universities and institutions to help advance research and development here at home.</li>\n\t<li>Today’s announcement marks a major milestone in the Government of Canada’s <a href=\"https://www.ic.gc.ca/eic/site/151.nsf/eng/00018.html\">Biomanufacturing and Life Sciences Strategy</a>. Launched in July 2021, the strategy presents a long-term vision to protect Canadians against future pandemics and other health emergencies.</li>\n\t<li>Since the onset of the pandemic, the government has <a href=\"https://www.ic.gc.ca/eic/site/151.nsf/eng/00006.html\">committed more than $1.6&nbsp;billion in 30 projects</a> in the biomanufacturing, vaccine, and therapeutics sector to support the domestic development and production of safe and effective vaccines and therapies to respond to COVID-19, future pandemics, and other health priorities.</li>\n\t<li>Through the <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a>, the government has supported projects from coast to coast to coast. This includes up to $415 million to support Sanofi in building an end-to-end influenza vaccine manufacturing facility in Toronto, Ontario; up to $175.6 million for AbCellera toward its antibody therapy research and the construction of an antibody production facility in British Columbia; $39.8 million for BioVectra to build a state-of-the-art facility in Prince Edward Island and reconfigure their facilities in Nova Scotia.</li>\n\t<li>The government has also invested $126 million to build a new Biologics Manufacturing Centre at the National Research Council Canada’s Royalmount site in Montréal. This new centre will be capable of large-quantity, end-to-end production of vaccines ‒ approximately 24 million doses annually, depending on the vaccine candidate.</li>\n\t<li>In addition, Budget&nbsp;2021 provided a total of $2.2&nbsp;billion over seven years toward growing a vibrant domestic life sciences sector and securing pandemic preparedness. This funding will help build Canada’s talent pipeline and research systems, as well as foster the growth of Canadian life sciences firms.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/08/government-of-canada-announces-agreement-with-leading-covid-19-vaccine-developer-moderna-inc-to-build-mrna-vaccine-facility-in-canada.html\">Government of Canada announces agreement with leading COVID­19 vaccine developer Moderna, Inc. to build mRNA vaccine facility in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/vaccines.html\">Vaccines for COVID-19</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.modernatx.com/\">Moderna</a></li>\n</ul></div>\n      "
}