{
  "path": "/en/news/news-releases/2020/03/22/government-requests-recall-house-commons-help-workers-and-businesses",
  "pageTitle": "Government requests recall of the House of Commons to help workers and businesses during COVID-19 crisis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking strong and quick action to protect the health and safety of all Canadians, stabilize our economy, and help workers and businesses as COVID-19 continues to spread.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the Government House Leader has asked the Speaker of the House of Commons to recall the House in order to introduce urgent economic measures, as part of Canada’s $82 billion response to support workers and businesses during the COVID-19 pandemic. The quick passage of this legislation is important to ensure Canadians have the financial support needed during this crisis. The House is expected to meet on Tuesday, March 24, at 12 p.m. ET.</p>\n\n<p>The Government of Canada recently announced wide-ranging actions that would help ensure Canadians can pay for their rent and groceries, and help businesses pay their bills and employees during this time of uncertainty. These measures would also help Indigenous communities across the country, support young people in the repayment of their student loans, and protect people experiencing homelessness or fleeing intimate partner violence.</p>\n\n<p>Members of Parliament from all parties have been clear in their desire to help Canadians, workers, and businesses experiencing financial hardship because of the COVID-19 pandemic. Recalling the House will give them the opportunity to come together to debate these important measures and get Canadians the immediate support they need. We are all in this together, and the Government of Canada is ready to help every Canadian during this time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We have to take immediate action to address the global COVID-19 pandemic, and Canadians are counting on all parliamentarians to work together to help them during this difficult time. Canadians are worried about their health and their jobs, and we need everyone to come together and do their part. I know this is a challenging time, but we will get through this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Members of the House of Commons understand the importance of coming together quickly and effectively to the benefit of all Canadians. Recalling Parliament to support Canadians now, when they need it most, demonstrates the government’s strong commitment to action.”</p>\n\n<footer class=\"default\">The Hon. Pablo Rodriguez, Leader of the Government in the House of Commons</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In order to implement the new economic measures announced as part of its response to COVID-19, the Government of Canada must introduce legislation and seek the approval of Parliament.</li>\n\t<li>According to a motion unanimously adopted on March 13, 2020, the House of Commons may be recalled during the current period of adjournment to consider measures to address the economic impact of the COVID-19 pandemic, as well as its impact on the lives of Canadians.</li>\n\t<li>The Government has been in discussions with opposition House leaders and whips to minimize the number of Members of Parliament recalled, while respecting the current proportion of party representation in the House. This follows public health guidelines about social distancing.</li>\n\t<li>A minimum of 20 Members of Parliament must be present in order for the House to exercise its powers, including passing legislation.</li>\n</ul></div>\n      "
}