{
  "path": "/en/news/news-releases/2016/11/04/prime-minister-canada-marks-one-year-anniversary-swearing-29th",
  "pageTitle": "Prime Minister of Canada marks one year anniversary of the swearing-in of the 29th Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today marked the one year anniversary of the swearing-in of the 29<sup>th</sup> Ministry.</p><p>Exactly one year ago, Prime Minister Justin Trudeau and his Cabinet took office with a clear mandate to deliver real change for Canadians from coast-to-coast-to-coast.</p><p>Since then, the government has worked hard to fulfill its commitment to strengthen the middle class and grow the economy over the long term. By listening to Canadians and by following through on the things that matter most to them, the government has started to deliver real results for all Canadians:</p><p>1. As a first step, the Prime Minister named his Cabinet that was not only gender-balanced, but reflected the great diversity of Canada.</p><p><img src=\"/sites/pm/files/media/articles/swearing_in.jpg\" alt=\"Prime Minister Trudeau holds a press conference following the swearing-in ceremony of the 29th Ministry\"></p><div><p><strong>Janice, Saskatoon:</strong><br><em>“I’m a 67 year old female – born and raised in Saskatchewan – and I have fought for gender parity throughout my entire professional life. It’s a wonderful day when I see a cabinet that is made up of so many women. Finally, in 2015, we have come a long way!”</em></p></div><p>&nbsp;</p><p>2. After one month in office, the government introduced a middle class tax cut that asked the wealthiest one percent to pay a little more so that the middle class – and those working hard to join it – could pay less.</p><p><img src=\"/sites/pm/files/media/articles/MCTC_2.jpg\" alt=\"Prime Minister Trudeau speaks with families in Gatineau, Quebec\"></p><div><p><strong>Brandon and Briana, Scarborough:</strong><br> <em>“Thanks to the government’s tax cut, both Brandon and I will each get a tax break of almost $450 this year. When we put it together, that gives us enough to make an advance payment on our condo mortgage.”</em></p></div><p>&nbsp;</p><p>3. As part of Budget 2016, the federal government introduced a new Canada Child Benefit – a fair and generous tax-free monthly cheque that gives nine out of ten Canadian families more money to help with the high cost of raising their children.</p><p><img src=\"/sites/pm/files/media/articles/CCB_edmonton_gold.jpg\" alt=\"Prime Minister Trudeau meets with Edmonton families at the Edmonton Public Library\"></p><div><p><strong>Sergei, Oakville North-Burlington:</strong><br><em>“As the father of a young daughter, I am grateful for the (…) government’s creation of the Canada Child Benefit. It means [my daughter] can enroll in sports or school programs without us having to worry about costs. The CCB will make a big difference to my family.”</em></p></div><p>&nbsp;</p><p>4. Working in close partnership with the provinces and the territories, the federal government came to a historic agreement that strengthened the Canadian Pension Plan, so that hard working Canadians can secure the strong and stable retirement they deserve.</p><p><img src=\"/sites/pm/files/media/articles/seniors_2.jpg\" alt=\"Prime Minister Trudeau meets with senior citizens at an outdoor event\"></p><div><p><strong>Dave, North Bay:</strong><br> <em>“I’m optimistic about the new plan and welcome having more money for everyone – especially since many of us don’t have private pensions and some have not been fortunate enough to have extra money to save, even though we have worked just as hard as the people with large incomes. We have to think about all Canadians, rather than look at only our own personal circumstances.”</em></p></div><p>&nbsp;</p><p>5. Building on its commitment to forge a new, nation-to-nation relationship with Indigenous Peoples in Canada, the federal government launched the National Inquiry into Missing and Murdered Indigenous Women and Girls – a powerful step in the reconciliation process.</p><p><img src=\"/sites/pm/files/media/articles/sisters_MMIW.jpg\" alt=\"Prime Minister Trudeau attends the Sisters in Spirit Vigil honouring missing and murdered women\"></p><div><p><strong>Sharna, Gleichen:</strong><br> <em>“I would like to thank the Prime Minister for keeping his promise - to the victims, their families, and to my people – to undertake an Inquiry into Missing and Murdered Indigenous Women and Girls. As a First Nations aboriginal, mother, and social justice advocate, I can only hope that this vital inquiry will bring real answers and change.”</em></p></div><p>&nbsp;</p><p>6. In response to the deepening humanitarian crisis in the Middle East, the Prime Minister kept his promise to open Canada’s doors to more than 25,000 Syrian refugees fleeing war and persecution.</p><p><img src=\"/sites/pm/files/media/articles/syrian_coat_shot.jpg\" alt=\"Prime Minister Trudeau welcomes Syrian refugees to Canada\"></p><div><p><strong>Mohamed, former Syrian refugee, Toronto:</strong><br> <em> “I was sponsored by Bathurst United Church, and I started volunteering at the Continuing Education Student Association of Ryerson [University]. And, after about two weeks, they offered me a job there. Canada makes it very easy for you to feel welcome and to feel like you’re at home.”</em></p></div><p>&nbsp;</p><p>7. Recognizing the need for concerted global action to combat climate change, the government proposed a pan-Canadian approach to pricing carbon pollution, one where all Canadian jurisdictions will have carbon pricing in place by 2018.</p><p><img src=\"/sites/pm/files/media/articles/first_ministers_meeting_carbon.jpg\" alt=\"Prime Minister Trudeau meets with ministers to discuss carbon pollution pricing\"></p><div><p><strong>Eric, Burnaby:</strong><br> <em>“I want to sincerely thank you for the carbon pricing plan that your government announced yesterday – it’s a balanced approach that will do a lot of good in helping Canada to reduce its GHG emissions. Climate change is the most important and pressing issue facing humanity today, yet it's an easy one to ignore, so I'm extremely pleased and inspired to see my federal government finally taking the issue seriously.”</em></p></div><p>&nbsp;</p><p>8. Finally, the government made a strong investment in Canada’s youth by boosting Canada Student Grants for middle and low-income families by 50 percent – so that more Canadians can afford a post-secondary education and receive the skills and training they need to get the jobs of today and tomorrow.</p><p><img src=\"/sites/pm/files/media/articles/size.jpg\" alt=\"Prime Minister Trudeau talks with a college student\"></p><div><p><strong>Anita, Calgary:</strong><br> “Thanks to the new Canada Student Grants, I will receive $3,000 this academic year that I don’t have to pay back. That’s over $1,000 more than I got last year – which will make it easier for me to manage my debt loads.”</p></div><p>&nbsp;</p><p>Moving into the second year of the mandate, the federal government will continue to invest in our people, our communities, and our economy. Canada will remain focused on the priorities of its citizens and take clear action to build an economy that works for everyone – not just the wealthiest one percent.</p><h2>Quote</h2><blockquote><p>“While we are immensely proud of what has been accomplished, we know that there is a tremendous amount of work still to be done. Our government’s priorities are Canadians’ priorities, and we will continue to do everything we can to make a real difference in the lives of all Canadians.”<br><cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote></div>\n      "
}