{
  "path": "/en/news/statements/2018/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p><p>“In 1950, just five years after the end of the Second World War, Communist armies from the North crossed the 38<sup>th</sup> Parallel and invaded South Korea. Today, we remember the thousands of brave Canadians – many answering the call of duty for a second time – who fought in the Korean War and defended the sovereignty of South Korea.</p><p>“Over the course of more than three years, the Korean War claimed millions of lives, many of them civilians, as the North and its communist allies attempted to gain control of the South.</p><p>“Canada was one of 16 United Nations member countries to deploy combat forces in support of South Korea. Nearly 27,000 Canadians put their lives on the line to repel the invasion, restore peace, and protect democracy and freedom.</p><p>“Canadians served on land, in the air, and at sea, and often fought in conditions that recalled the horrors of the First World War. Frontlines deteriorated into trench warfare.</p><p>“Soldiers endured extreme and unpredictable weather as dangerous as the enemy. They fell asleep with water up to their chest, after monsoon rains melted their trenches into sludge and muck. During the winter months, they faced the constant threat of frostbite and hypothermia as bitter cold jammed weapons and turned rations into ice.</p><p>“Sixty-five years ago today, an armistice brought active fighting in the war to an end. Thousands of Canadians soon returned home, bearing the physical and emotional scars of war. Over 500 Canadians made the ultimate sacrifice. They are honoured in the <a href=\"http://www.veterans.gc.ca/eng/remembrance/memorials/books\">Books of Remembrance</a> in the Memorial Chamber of the Peace Tower on Parliament Hill – their names inscribed alongside those of more than 118,000 others who have died in service to and defence of our country.</p><p>“We must never forget those who gave their lives to help restore peace. We must never forget their courage. We must never forget that, thanks to the efforts of our troops and allies, South Korea today is a prosperous nation and a dear friend to Canada.</p><p>“On behalf of the Government of Canada, I invite all Canadians to learn more about the <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/korean-war\">Korean War</a>, participate in activities that honour our Veterans, and take time to reflect on our country’s contributions to peace and freedom around the world. Active service members, Veterans, and their families – during the Korean War and continuing to this day – have given so much to protect and defend the values that we hold dear.</p><p>“We will remember them.”</p></div>\n      "
}