{
  "path": "/en/news/news-releases/2018/03/29/inuit-crown-partnership-committee-makes-progress-shared-priorities",
  "pageTitle": "Inuit-Crown Partnership Committee makes progress on shared priorities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in the Inuit-Crown Partnership Committee meeting to review progress made since the Committee was formed last year and to discuss what actions need to be taken to advance our shared commitment to reconciliation.</p><p>During the meeting, the Prime Minister and Inuit leaders reflected on the important progress made to strengthen the Inuit-Crown relationship and to address key social, economic, cultural, and environmental issues together. These accomplishments include:</p><ul><li>Long-term funding to support housing in Nunavut and an Inuit-led housing plan in the Inuit regions of Nunavik, Nunatsiavut, and Inuvialuit Settlement Region.</li><li>A commitment to eliminate tuberculosis across Inuit Nunangat by 2030, and to reduce active tuberculosis by at least 50 per cent by 2025.</li><li>Progress on an Inuit early learning and child care framework, which would reflect the distinct needs and priorities of Inuit children and families.</li><li>Progress toward a new Arctic Policy Framework, including infrastructure and related needs, which will ensure that Inuit Nunangat residents and governments are at the forefront of decisions about the future of their region.</li></ul><p>The leaders discussed how to build on the momentum of the past year to further advance important priorities and policies. The Committee agreed to keep working on the seven priorities established last year and to add environment and climate change as a new one. The focus of this new priority will be on Indigenous protected and conserved areas, the Indigenous Guardians Program, and taking action on climate change. The leaders also acknowledged that the full implementation of the Inuit-Crown land claims agreements and the United Nations Declaration on the Rights of Indigenous Peoples are key components to reconciliation. In addition, the leaders committed to continue to advance language rights for Inuit as another fundamental component of reconciliation.</p><p>The work of the Inuit-Crown Partnership Committee is a reflection of our shared commitment to a renewed Inuit-Crown relationship and to reconciliation based on recognition and respect for Inuit as first Canadians, Canadians first.</p><h2>Quotes</h2><blockquote><p>“Today’s meeting with Inuit leaders was productive and encouraging. Important work has been done over the past year to find innovative and meaningful solutions to the distinct issues faced by Inuit. Together, we can bring about the type of transformative change that we need to make a real difference for Inuit, for the benefit of all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Inuit-Crown Partnership Committee brings Inuit leadership and the Government of Canada together to act on shared priority areas that will improve the lives of Inuit. We have made good progress in our first year and will continue to build on and improve this partnership committee&nbsp;to best&nbsp;advance Inuit rights and&nbsp;create a better Canada overall.”<br>—<cite>President Natan Obed, Inuit Tapiriit Kanatami</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Inuit-Crown Partnership Committee was created in February 2017 and was founded on the principle that an equal partnership between Inuit and the Crown is essential to the reconciliation process.</li><li>The Committee includes the Prime Minister and several federal ministers, President Natan Obed on behalf of Inuit Tapiriit Kanatami, Chair/CEO Duane&nbsp;Smith on behalf of the Inuvialuit Regional Corporation, President Aluki&nbsp;Kotierk on behalf of Nunavut Tunngavik Incorporated, President Charlie&nbsp;Watt on behalf of Makivik Corporation, and President Johannes Lampe on behalf of the Nunatsiavut Government.</li><li>The Committee also includes the presidents of the National Inuit Youth Council, Pauktuutit Inuit Women of Canada, and the Inuit Circumpolar Council Canada as observers.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee</a></li><li><a href=\"/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">Inuit Nunangat Declaration on Inuit-Crown Partnership</a></li><li><a href=\"https://itk.ca/inuit-crown-partnership-committee-advances-agenda/\">Inuit-Crown Partnership Committee Advances Agenda</a></li><li><a href=\"https://www.pc.gc.ca/en/culture/autochtones-indigenous/gardiens-guardians\">Indigenous Guardian Programs</a></li></ul><p>Also available in <a href=\"/en/news/news-releases/2018/03/29/ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ-ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ-ᑲᑎᒪᔨᕋᓛᖑᔪᑦ-ᑲᔪᓯᑦᑎᐊᖅᑎᑦᑎᔪᑦ-ᓯᕗᓪᓕᐅᑎᖃᑎᒌᒃᑕᒥᓂᒃ\">Inuktitut</a>.</p></div>\n      "
}