{
  "path": "/en/news/statements/2020/04/07/statement-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</p>\n\n<p>“This year, we mark <a href=\"https://www.who.int/news-room/campaigns/world-health-day/world-health-day-2020\">World Health Day</a> at a time when we are facing a rapidly evolving global pandemic. To fight the outbreak of COVID-19, Canadians and people around the world have had to change how we work, how we play, and how we stay connected with our loved ones and communities. We are all in this together, and we must each do our part to stop the spread of COVID-19.</p>\n\n<p>“Difficult times like these remind us of the importance of working together. In 1948, the World Health Organization was created to do just that. Since its foundation, it has brought countries together to ensure everyone has access to the health services they need. Canada is working with the World Health Organization and other partners to fight the COVID-19 pandemic and protect those most vulnerable.</p>\n\n<p>“Here at home, we need to do the same. We need to protect our front-line health care workers and essential service providers. This means staying at home, except for critical things like getting groceries or medications, and practising physical distancing by keeping at least two metres apart, if you need to be outside. This is the only way we can keep those who are most at risk safe.</p>\n\n<p>“The government is working day and night to make sure that all Canadians have what they need to stay healthy and provide for their families. By putting more money in the pockets of people and businesses facing financial hardship, investing in health research, and purchasing essential medical equipment, we are doing what needs to be done so we can all get through this, together.</p>\n\n<p>“The actions that we take today are important, because they have consequences that reach beyond our families, our communities, and even our borders. Today, I ask Canadians to do what we do best – work together, and look out for one another. We must all do our part and make sacrifices to protect our health and the health of everyone around us.”</p></div>\n      "
}