{
  "path": "/en/news/statements/2019/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p>\n\n<p>“On the <a href=\"https://www.un.org/en/observances/day-of-persons-with-disabilities\">International Day of Persons with Disabilities</a>, we recognize Canadians, and people around the world, who live with a disability. Our neighbours and friends, colleagues and family, every day they defy stereotypes and overcome stigma to redefine what it means to thrive.</p>\n\n<p>“Even as people with disabilities lead the way forward, many still face discrimination, exclusion, and barriers. Today, we recommit ourselves to building a more inclusive country – and world – based on equality and respect for everyone’s human rights.</p>\n\n<p>“Over the last four years, we have taken significant steps to remove barriers and ensure equal opportunities for all Canadians. This July, the <em><a href=\"https://www.canada.ca/en/employment-social-development/news/2019/07/canadas-first-federal-accessibility-legislation-comes-into-force.html\">Accessible Canada Act</a></em> came into force, after being developed with disability communities through the most inclusive and accessible consultations in Canadian history. Canada’s first national accessibility law is helping to create communities, workplaces, and services that give everyone the opportunity to participate fully in society.</p>\n\n<p>“While we have made important progress, we also know there is more to be done. With the leadership of the new Minister of Employment, Workforce Development and Disability Inclusion, Carla Qualtrough, we will continue to promote the rights of Canadians with disabilities, and build a more accessible and disability inclusive country.&nbsp;</p>\n\n<p>“We will also continue to protect the rights of people with disabilities around the world. Last December, Canada acceded to the Optional Protocol to the United Nations <a href=\"https://www.ohchr.org/EN/HRBodies/CRPD/Pages/ConventionRightsPersonsWithDisabilities.aspx\">Convention on the Rights of Persons with Disabilities</a> as part of our unwavering commitment to provide equal opportunity and protect the dignity and independence of people with disabilities.</p>\n\n<p>“We all benefit when everyone can fully contribute to our communities. Today, let us celebrate the accomplishments of people living with disabilities, as we work together to build a more inclusive Canada.”</p></div>\n      "
}