{
  "path": "/en/news/news-releases/2018/01/22/prime-minister-trudeau-travel-india-state-visit",
  "pageTitle": "Prime Minister Trudeau to travel to India for state visit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to India – at the invitation of Prime Minister Narendra Modi – for a state visit from February 17 to 23.</p><p>Canada and India enjoy a special relationship that is based on a common language, similar institutions and forms of government, and a commitment to democracy. India is one of the fastest growing economies in the world, and offers tremendous opportunities to grow Canada’s middle class and bolster our shared prosperity.</p><p>This state visit – which includes stops in Agra, Amritsar, Ahmedabad, Mumbai, and New Delhi – will provide an opportunity for Prime Minister Trudeau to connect with Indian leaders in government and business, promote the empowerment of women and girls, and strengthen Canada and India’s close economic ties.</p><p>During the visit, Prime Minister Trudeau and Prime Minister Modi will reaffirm the close friendship between our two countries, and discuss ways to create good middle class jobs for Canadians and Indians alike.</p><p>Prime Minister Trudeau will also participate in several business roundtables to promote further trade and investment between Canada and India. The Canadian delegation will also work closely with Indian leaders to advance mutual growth and prosperity.</p><p>While in India, Prime Minister Trudeau will also speak to students, and visit several landmarks, including the Taj Mahal, Sri Harmandir Sahib (also known as the Golden Temple), and the Swaminarayan Akshardham in Gujarat.</p><h2>Quote</h2><blockquote><p>“Canada and India share a special bond, and are linked by tremendous people-to-people connections. The more than one million Canadians of Indian origin make the relationship between our two countries a truly special one. I look forward to meeting with Prime Minister Modi, and further strengthening the Canada-India friendship.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This state visit will build on a number of recent meetings held between Prime Minister Trudeau and Prime Minister Modi and ministers from both countries.</li><li>This will be the fourth meeting between Prime Minister Trudeau and Prime Minister Modi. The two leaders met previously in November 2017 during the East Asia Summit in Manila, Philippines; in July 2017 during the G20 in Hamburg, Germany; and in April 2016 during the Nuclear Security Summit in Washington, D.C. Prime Minister Trudeau also met him in his capacity as Leader of the Liberal Party in Toronto in April 2015 during Prime Minister Modi’s official visit to Canada.</li><li>Since September 2016, there have been eleven ministerial visits to India, including, most recently, a trade mission led by Minister of International Trade François-Philippe Champagne, Minister of Innovation, Science and Economic Development Navdeep Bains, and Minister of Transport Marc Garneau, in November 2017.</li><li>Canada is home to a large Indian diaspora. Over one million – approximately 3.6 per cent – of Canadians are of Indian heritage. India is Canada’s second largest source of immigrants (approximately 40,000 in 2016).</li><li>In 2016, two-way merchandise trade between Canada and India totalled $8&nbsp;billion. Bilateral trade in services reached $2.1 billion in the same year, an increase of 1.9 per cent over 2015.</li><li>Canada is a leading education destination for Indian students, and India is the second largest source of international students for Canada’s universities, colleges, and schools. Approximately 124,000 Indian students had a valid Canadian study permit in 2017, an increase of over 60 per cent compared to last year.</li><li>India is also a major source of international tourists for Canada, with 215,000&nbsp;Indians visiting in 2016.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://international.gc.ca/world-monde/india-inde/relations.aspx?lang=eng\">Canada-India Relations</a></li></ul></div>\n      "
}