{
  "path": "/en/news/news-releases/2018/08/28/prime-minister-announces-changes-cabinet-committees",
  "pageTitle": "Prime Minister announces changes to the Cabinet committees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the structure and mandate of Cabinet committees to make them even more efficient and responsive to the needs of Canadians, and to reflect recent changes to the Ministry.&nbsp;</p><p>The new and modified Cabinet committees reflect the Government of Canada’s top priorities: delivering economic growth, diversifying international trade, strengthening the middle class, advancing reconciliation with Indigenous peoples, and fighting climate change.&nbsp;</p><p>The Treasury Board will assume responsibility for key delivery challenges including defence procurement and modernizing the public service pay system. As the management board of government, the Treasury Board is well-placed to lead the whole-of-government approach needed on these key files. A special sub-committee of Treasury Board will be tasked with addressing the unacceptable hardships caused by the Phoenix pay system, and implementing a modern, reliable, long-term solution. This sub-committee will engage with all implicated Ministers and impacted stakeholders including organized labour.&nbsp;</p><p>The Prime Minister is also creating a new Incident Response Group, similar to those in place with our Five Eyes allies. It will be a dedicated, emergency committee that will convene in the event of a national crisis or during incidents elsewhere that have major implications for Canada. The Group will bring together relevant ministers and senior government leadership to coordinate a prompt federal response and make fast, effective decisions to keep Canadians safe and secure, at home and abroad.&nbsp;</p><p>The new list of Cabinet committees is as follows:&nbsp;</p><ul><li>Cabinet Committee on Agenda, Results and Communications</li><li>Cabinet Committee on Growing the Middle Class and Inclusion</li><li>Cabinet Committee on Canada-U.S. Relations, Trade Diversification and Internal Trade</li><li>Cabinet Committee on Reconciliation</li><li>Cabinet Committee on Environment and Clean Growth</li><li>Cabinet Committee on Canada in the World and Public Security</li><li>Treasury Board</li><li>Ad Hoc Committee on the 2018 B.C. Wildfires&nbsp;</li></ul><h2>Quote</h2><blockquote><p>“Cabinet committees play a vital role in delivering the Government’s agenda and turning government priorities into concrete results for Canadians. Today’s changes will make our Cabinet committees even more efficient and agile, and ensure we continue to deliver on our promises to Canadians as effectively as possible.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul class=\"sm-spacing\"><li>The following changes have been made to the structure of Cabinet committees:<ul class=\"sm-spacing\"><li>The Cabinet Committee on Agenda, Results and Communications’ mandate has been expanded include addressing issues related to advancing the Government’s agenda and all aspects of Parliamentary business. This work would have previously been addressed by the Cabinet Committee on Open Transparent Government and Parliament.</li><li>The Cabinet Committee on Growing the Middle Class has merged with the Cabinet Committee on Diversity and Inclusion, and has been re-named the Cabinet Committee on Growing the Middle Class and Inclusion.</li><li>The Cabinet Committee on Canada-United States Relations has been re-named the Cabinet Committee on Canada-U.S. Relations, Trade Diversification and Internal Trade, and its mandate has been expanded to focus on fostering strong relations between Canada and the United States and advancing issues of mutual interests, while exploring opportunities related to trade diversification and internal trade.</li><li>A new Cabinet Committee on Reconciliation has been formed to strengthen the relationship with Indigenous peoples and advance the commitment to a renewed nation-to-nation, Inuit-Crown, and government-to-government relationship with First Nations, Inuit and the Métis Nation based on recognition of rights, respect, co-operation, and partnership. This committee will build on the work previously undertaken by the Working Group of Ministers on the Review of Laws and Policies Related to Indigenous Peoples.</li><li>The Cabinet Committee on Environment, Climate Change and Energy has been renamed the Cabinet Committee on Environment and Clean Growth.</li><li>The Cabinet Committee on Canada in the World and Public Security has incorporated policy items from the Cabinet Committee on Intelligence and Emergency Management, while the new Incident Response Group has been created to address public emergencies and national security incidents as they arise in order to protect Canadians’ safety and security, both at home and abroad.</li><li>The Treasury Board – as the management board of government – will actively assume responsibility for the issues previously addressed by the Cabinet Committee on Defence Procurement and the Working Group of Ministers on Achieving Steady State for the Pay System, namely defence procurement and modernizing the pay system.</li></ul></li><li>The membership of the various committees, including some Chair and Vice-Chair positions, has been adjusted to benefit from ministerial experience and availability.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/cabinet-committee-mandate-and-membership\">Cabinet Committee Mandate and Membership</a></li><li><a href=\"/en/news/news-releases/2018/08/28/prime-minister-releases-new-ministerial-mandate-letters\">Prime Minister releases new ministerial mandate letters</a></li></ul></div>\n      "
}