{
  "path": "/en/news/statements/2023/04/07/statement-canada-prime-minister-world-health-day",
  "pageTitle": "Statement by the Prime Minister on World Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Health Day:</p>\n\n<p>“Today, as we celebrate World Health Day, and mark 75 years since the founding of the World Health Organization, we are reminded of the importance of international cooperation in achieving the global goal of healthy lives and well-being for all. This year’s theme, ‘Health For All’, reminds us of the work that remains to be done toward that goal and of what can be achieved when we work together.</p>\n\n<p>“World Health Organization members, including Canada, have pulled together to keep the world safe and serve the vulnerable. Thanks to our joint efforts, we have achieved huge feats in support of public health like eradicating smallpox and reducing malaria transmission. When the COVID-19 pandemic hit, we acted quickly to reinforce our health systems and collectively distribute billions of lifesaving COVID-19 vaccines, tests, and treatments worldwide.</p>\n\n<p>“Today, 30 per cent of the world’s population lacks access to essential health services. The overlapping crises of conflict, climate, food and nutrition insecurity, and the continued impact of COVID-19 are making it even harder for people to get the health services they need. Canada is committed to a future where everyone has access to essential health services and the health and rights of women and girls are respected. That’s why we are leading on global health, scaling up our international assistance for the health and rights of women and girls to $1.4&nbsp;billion by next year and maintaining it at that level to 2030.</p>\n\n<p>“Canada has work to do at home, too. Our universal, public health care system is a core part of what it means to be Canadian. It is built on a promise that no matter where you live, or what you earn, you will always be able to get the medical care you need. But right now, our health care system is not living up to that promise. That is why the Government of Canada is increasing health investments by over $198&nbsp;billion over the next 10 years to improve health care for Canadians.</p>\n\n<p>“Through these investments, we will support provinces and territories in their efforts to clear backlogs and support the front-line workers who are the backbone of our health care system; improve access to family health services as well as quality mental health and substance use services to support the well-being of all Canadians; and ensure patients can access their own health information and benefit from it being shared between the health professionals they see, across jurisdictions.</p>\n\n<p>“On this World Health Day, as we work toward #HealthForAll, we recommit to building a world where everyone has access to timely and quality health and nutrition services. Together, we can ensure everyone, wherever they are in the world, enjoys a longer, healthier, and more prosperous life.”</p></div>\n      "
}