{
  "path": "/en/news/statements/2022/04/24/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week, taking place from April 24 to 30, 2022:</p>\n\n<p>“Volunteers are the lifeblood of communities and organizations across the country. Every year, approximately 24&nbsp;million Canadians volunteer their time, energy, and experiences to improve the lives of others from coast to coast to coast.</p>\n\n<p>“During <a href=\"https://volunteer.ca/index.php?MenuItemID=464&amp;lang=en\">National Volunteer Week</a>, we celebrate Canada’s volunteers and thank them for devoting their time.</p>\n\n<p>“Throughout the pandemic, this year’s theme, ‘Volunteering Is Empathy In Action’, has been on full display. Over the past two years, we have seen Canadians practise empathy by supporting those who needed it most. Whether it was delivering food or spending time with someone to combat loneliness, Canadians are always creating caring and compassionate communities through volunteering.</p>\n\n<p>“In recognition of the significant contributions volunteers make to our country, the Government of Canada created <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards.html\">Canada’s Volunteer Awards</a>. The awards celebrate volunteers across the country and aim to inspire Canadians from all walks of life to find ways to make a difference in their communities. Canada’s Volunteer Awards recently <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards/2020-recipients.html\">recognized 21 recipients</a>, including Dr. Francis Ho, a lifelong volunteer and family doctor, who was a leading voice in public health education for Asian communities. When the 2022 call for nominations opens this fall, I hope Canadians will take the time to nominate an individual or an organization changing lives and bettering our communities through service.</p>\n\n<p>“During this National Volunteer Week, I invite all Canadians to join me in thanking our volunteers whose service and selflessness play a key role in building a better future for everyone.”</p></div>\n      "
}