{
  "path": "/en/news/statements/2017/04/09/statement-prime-minister-canada-100th-anniversary-battle-vimy-ridge",
  "pageTitle": "Statement by the Prime Minister of Canada on the 100th anniversary of the Battle of Vimy Ridge | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement for the 100<sup>th</sup> anniversary of the Battle of Vimy Ridge:</span></p><p>“One hundred years ago, on a gentle slope in France, the four divisions of the Canadian Corps fought for the first time as one. They were ordinary – yet extraordinary – men, from all corners of the country: Francophone, Anglophone, new Canadians, Indigenous Peoples.</p><p>“On Easter Monday, April 1917, battling through snow, sleet, and constant machine gun fire, they broke through an impregnable fortress and achieved a historic victory. They succeeded where other armies had failed – but at a great cost. Nearly 3,600 Canadians lost their lives. Over 7,000 more were wounded. The Battle of Vimy Ridge remains one of the bloodiest battles in Canada’s history.</p><p>“Despite these losses, Canadian bravery and ingenuity won the day and led to one of the most decisive victories in the First World War. The innovative fighting techniques used so effectively by our soldiers at Vimy Ridge would contribute to the final Allied victory a year and a half later.</p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Many of the soldiers wearing the Canadian uniform that day were immigrants to this country. People of many languages and backgrounds,&nbsp;</span><span lang=\"EN-US\" xml:lang=\"EN-US\">representing every region in Canada, fought for the values we hold so dear: freedom, democracy, and peace. In the words of one veteran: ‘We went up Vimy Ridge as Albertans and Nova Scotians. We came down as Canadians.’ </span></p><p>“Today, as we gather to commemorate the 100th anniversary of the Battle of Vimy Ridge, we remember the thousands of Canadians who gave their lives far from Canada’s shores. We pay tribute to the 100th anniversary of a pivotal battle that has left an indelible mark on our history. And we thank every Canadian who has answered the call to serve for their selflessness and sacrifice.&nbsp;</p><p>“Lest we forget.”</p><p><b><span lang=\"EN-US\" xml:lang=\"EN-US\">Associated Link</span></b></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\"><a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/vimy-ridge/100-anniversary\">100<sup>th</sup> Anniversary of the Battle of Vimy Ridge</a></span></p></div>\n      "
}