{
  "path": "/en/news/news-releases/2022/04/25/prime-minister-announces-public-order-emergency-commission-following",
  "pageTitle": "Prime Minister announces Public Order Emergency Commission following the invocation of the Emergencies Act | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada’s top priority remains keeping Canadians safe, while protecting jobs, trade, and our economy.&nbsp;In February, when blockades and occupations across the country disrupted our economy, hurt workers, and endangered public safety, the government invoked the <em>Emergencies Act </em>to supplement provincial and territorial capacity to end them.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the establishment of the Public Order Emergency Commission, an independent public inquiry following the invocation of the <em>Emergencies Act.</em></p>\n\n<p>The Commission will examine the circumstances that led to the declaration being issued and the measures taken in response to the emergency. This includes the evolution of the convoy, the impact of funding and disinformation, the economic impact, and efforts of police and other responders prior to and after the declaration.</p>\n\n<p>The Prime Minister also announced the appointment of the Honourable Paul S. Rouleau as Commissioner of the Public Order Emergency Commission. Justice Rouleau brings twenty years of experience on the bench to the role. He was first appointed as a Justice of the Superior Court of Ontario in 2002, then to the Court of Appeal for Ontario in 2005. He has also since been appointed as a Deputy Judge of the Supreme Court of Yukon, the Nunavut Court of Justice, and the Supreme Court of the Northwest Territories.</p>\n\n<p>As Commissioner, Justice Rouleau will submit a final report in both official languages to the Government of Canada on his findings and recommendations, which must be tabled in the House of Commons and Senate of Canada by February 20, 2023.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Ensuring the safety and security of everyone in Canada and protecting our economy are top priorities. I am pleased to announce that the Honourable Paul S. Rouleau has agreed to serve as the Commissioner and undertake this important work. He will look into the circumstances that led to the <em>Emergencies Act</em> being invoked, and make recommendations to prevent these events from happening again.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“When our government invoked the <em>Emergencies Act</em> to help end the illegal blockades and get our country moving again, we committed to Canadians that we’d be upfront and transparent about it. We have kept that commitment – and today we’re taking a further step with the establishment of the Commission. I’m confident that this process will examine the circumstances that led to the invocation of the <em>Emergencies Act</em> fairly and impartially, as well as make potential recommendations regarding the management of public order emergencies.”</p>\n\n<footer class=\"default\">The Hon. Marco E. L. Mendicino, Minister of Public Safety</footer>\n</blockquote>\n\n<blockquote>\n<p>“Invoking the <em>Emergencies Act</em> was a decision taken only after careful consideration and with significant caution. As we reflect on the circumstances that led to this action, Canadians can have confidence this Commission will be undertaken in a thorough and independent manner, as the Act itself requires.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On February 14, 2022,&nbsp;the Honourable David Lametti, Minister of Justice and Attorney General of Canada, with the support of the Honourable Marco E.L. Mendicino, Minister of Public Safety, and the Honourable Bill Blair, President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness, announced the declaration of a public order emergency under the&nbsp;<em>Emergencies Act</em>, to end disruptions, border blockades, and the occupation of Ottawa’s downtown core. The declaration<em> </em>was revoked on February 23, 2022.</li>\n\t<li>The <em>Emergencies Act</em> requires that a commission be convened within 60 days and its report tabled in Parliament within 360 days of the revocation of the declaration of a public order emergency. The Commission must examine the circumstances that led to the declaration being issued and the measures taken for dealing with the emergency.</li>\n\t<li>Under Part I of the federal&nbsp;<em>Inquiries Act</em>, the Commissioner has the power to summon witnesses under oath, and require them to provide documents or other items that the Commissioner consider necessary to carry out their work.</li>\n\t<li>The Commission’s work and mandate are outlined in the <a href=\"https://orders-in-council.canada.ca/attachment.php?attach=41898&amp;lang=en\">Order in Council</a>, which establishes the Commission and its mandate.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/04/25/honourable-paul-s-rouleau\">Biographical note: The Honourable Paul S. Rouleau</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-justice/news/2022/02/canadas-emergencies-act.html\">Canada’s <em>Emergencies Act</em></a></li>\n\t<li><a href=\"https://laws-lois.justice.gc.ca/eng/acts/e-4.5/page-1.html\"><em>Emergencies Act</em></a></li>\n\t<li><a href=\"https://laws-lois.justice.gc.ca/eng/acts/i-11/\"><em>Inquiries Act</em></a><em> </em></li>\n\t<li><a href=\"https://www.canada.ca/en/services/policing/emergencies/public-order.html\">Government of Canada declaration and revocation of a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades and the occupation of the city of Ottawa</a></li>\n</ul></div>\n      "
}