{
  "path": "/en/news/statements/2019/07/06/statement-prime-minister-sixth-anniversary-lac-megantic-tragedy",
  "pageTitle": "Statement by the Prime Minister on the Sixth Anniversary of the Lac-Mégantic Tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the sixth anniversary of the Lac-Mégantic tragedy:</p>\n\n<p>“Today, I join the people of Lac-Mégantic and all Canadians to pay tribute to those who lost their lives in the train disaster six years ago.</p>\n\n<p>“On July 6, 2013, a runaway train carrying crude oil derailed and exploded in the heart of the community. The accident took the lives of 47 people, forced thousands more from their homes, and destroyed nearly half of the downtown, in the deadliest train disaster in our country’s modern history.</p>\n\n<p>“On this solemn anniversary, our thoughts are with those who lost loved ones, and all those whose lives were forever changed. The tragedy left scars that cannot be erased – but in the aftermath, the people of Lac-Mégantic showed profound resilience, solidarity, and determination. Over the last six years, they have worked hard to heal, rebuild, and create a better future for their community.</p>\n\n<p>“No community should have to go through what Lac-Mégantic experienced. Rail safety and the safe transportation of dangerous goods in Canada remain major priorities for the Government of Canada. We are continuing to work with provincial, municipal, and industry stakeholders to make sure a tragedy like this never happens again.</p>\n\n<p>“Last year, we took an important step to support the community’s rebuilding efforts. Answering the call from Lac-Mégantic and the neighbouring municipalities of Nantes and Frontenac, we announced key investments in the <a href=\"https://www.canada.ca/en/transport-canada/news/2019/06/the-government-of-canada-is-examining-the-feasibility-of-relocating-rail-bypass-operations-to-the-lac-megantic-industrial-park.html\">rail bypass project</a>. Once completed, the rail line will be permanently removed from Lac-Mégantic’s downtown. We hope that the project will help mark a new beginning for this brave, resilient community.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to honour those who lost their lives and stand with all those affected by this tragedy. To the people of Lac-Mégantic: know that you are in our thoughts and that you have our unwavering support.”</p></div>\n      "
}