{
  "path": "/en/news/readouts/2022/02/21/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>The two leaders condemned in the strongest terms Russia’s illegal and illegitimate move to recognize the so-called Donetsk and Luhansk People’s republics as independent states. They affirmed their intention to impose sanctions in response, as well as their steadfast commitment to the sovereignty, territorial integrity, and independence of Ukraine.</p>\n\n<p>The Prime Minister stressed that Russia’s actions threaten peace and order in Europe and around the world, are blatant violations of international law, and will not be tolerated. The two leaders urgently called on Russia to de-escalate tensions and pursue a diplomatic solution to the situation. They committed to continue close coordination with Allies and partners, including Ukraine. They emphasized&nbsp;that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen agreed to continue coordinating closely.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/15/prime-minister-justin-trudeau-speaks-president-european-commission-ursula\">Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}