{
  "path": "/en/news/news-releases/2021/06/04/prime-minister-welcomes-reappointment-daniel-therrien-privacy",
  "pageTitle": "Prime Minister welcomes reappointment of Daniel Therrien as Privacy Commissioner of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the reappointment of Daniel Therrien as Privacy Commissioner of Canada. This reappointment is effective today, for a one-year term.</p>\n\n<p>The Office of the Privacy Commissioner provides Parliament with impartial, fact-based information and expert advice, with the mission to protect and promote the privacy rights of Canadians. The Privacy Commissioner’s responsibilities include investigating complaints, conducting audits, and taking legal action when needed; publicly reporting on how public and private sector organizations handle personal information; and supporting research and promoting public awareness and understanding of privacy issues.</p>\n\n<p>Mr. Therrien was first appointed as Privacy Commissioner of Canada on June 5, 2014, after three decades as a lawyer in the federal government focusing on issues of human rights, public safety, and national security. Under the <em>Privacy Act</em>, the Privacy Commissioner is appointed for a term of seven years and is eligible to be reappointed to further terms not exceeding seven years.</p>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"2fd03f89-e9c4-481f-a607-279fa7b15c9c\" href=\"/en/news/backgrounders/2021/06/04/daniel-therrien\">Daniel Therrien</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/27/prime-minister-announces-nomination-daniel-therrien-reappointment\">Prime Minister announces nomination of Daniel Therrien for reappointment as Privacy Commissioner of Canada</a></li>\n</ul></div>\n      "
}