{
  "path": "/en/news/news-releases/2022/05/08/prime-minister-visits-kyiv-ukraine",
  "pageTitle": "Prime Minister visits Kyiv, Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Canada sends a resounding message to the world that we continue to stand shoulder to shoulder with Ukraine and its people.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Kyiv, Ukraine, where he met with President Volodymyr Zelenskyy. The Deputy Prime Minister, Chrystia Freeland, and the Minister of Foreign Affairs, Mélanie Joly, accompanied the Prime Minister.</p>\n\n<p>Earlier today, the Prime Minister, Deputy Prime Minister, and Minister of Foreign Affairs participated in a flag raising ceremony to mark the re-opening of the Canadian Embassy in Ukraine. Ambassador Larisa Galadza, together with a team of additional staff members, will resume diplomatic operations in Kyiv, Ukraine as part of a gradual restoring of Canada’s full diplomatic presence and services. Until further notice, consular and immigration services will continue to be provided in Poland and many other European cities in the region.</p>\n\n<p>Prime Minister Trudeau also visited Irpin, where he witnessed firsthand the reckless brutality of Vladimir Putin’s illegal war. Russian forces have terrorized and killed civilians and destroyed homes and neighbourhoods. Canada is leading efforts to ensure they are held accountable for war crimes and other egregious violations of human rights. At the same time, the Prime Minister also witnessed the strength and resilience of Ukrainians, and despite efforts by Russia, Kyiv still stands strong and proud today.</p>\n\n<p>In a bilateral meeting, the Prime Minister and President Zelenskyy discussed the historic partnership between their two countries, the situation in Ukraine, and the need for additional international support – including humanitarian, financial, and military assistance. The two leaders also discussed global efforts to impose severe and lasting sanctions on Russia in response to President Putin’s invasion of Ukraine. Prime Minister Trudeau reiterated Canada’s unwavering support for Ukraine and ongoing commitment to help in any way possible.</p>\n\n<p>Today, the Prime Minister announced additional measures and investments to continue supporting Ukraine, including:</p>\n\n<ul>\n\t<li>Providing an additional $50 million in military assistance, which builds on recent contributions of artillery, ammunition, and civilian-pattern light armoured vehicles:\n\t<ul>\n\t\t<li>18 drone cameras, including in-service support and repair,</li>\n\t\t<li>$15 million of high-resolution satellite imagery,</li>\n\t\t<li>Up to $1 million in small arms and related ammunition, and</li>\n\t\t<li>Additional ammunition for M777 howitzers;</li>\n\t</ul>\n\t</li>\n\t<li>Allocating $25 million, from Canada’s $100 million contribution for humanitarian aid in the region, to the World Food Programme to address food security in Ukraine; and</li>\n\t<li>Contributing $10 million in funding to support human rights, civil society, and demining in Ukraine, in particular:\n\t<ul>\n\t\t<li>$1.5 million to the United Nations Women’s Peace and Humanitarian Fund;</li>\n\t\t<li>$2.5 million to the United Nations Office of the High Commissioner for Human Rights to monitor, document and assess human rights violations;</li>\n\t\t<li>$775,000 to Front Line Defenders to support human rights activists and organizations;</li>\n\t\t<li>Up to $2 million to German Marshal Fund of the United States to support civil society actors at risk;</li>\n\t\t<li>Up to $1.15 million in digital emergency support for civil society in Ukraine; and</li>\n\t\t<li>$2 million to HALO Trust for mine action emergency response.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<p>The Prime Minister also announced his intention to temporarily remove trade tariffs on Ukrainian imports for a period of one year and that Canada will be imposing new sanctions under the <em>Special Economic Measures (Russia) Regulations.</em> These new actions, which build on the measures previously announced on April 27, 2022, include:</p>\n\n<ul>\n\t<li>Imposing sanctions on 21 additional Russian individuals, including oligarchs and close associates of the Russian regime; and</li>\n\t<li>Sanctioning 19 individuals in the Russian defence sector and five entities for providing indirect or direct support to the Russian military.</li>\n</ul>\n\n<p>The investments and measures announced today build on what Canada has already committed this year. Since February 2022, Canada has provided $245 million in humanitarian assistance and over $131 million for defensive military equipment. On top of that, Budget 2022 proposes to provide $1 billion in loans through the IMF Administered Account for Ukraine from Canada. This is on top of $620 million in bilateral loans already committed to Ukraine, of which $500 million has already been disbursed. Budget 2022 also proposes $500 million in additional military aid. Today’s sanctions also build on those that have already been imposed on more than 1,000 individuals and entities from Russia, Ukraine and Belarus since February 24, 2022.</p>\n\n<p>During his visit, Prime Minister Trudeau and President Zelenskyy participated in a G7 Leaders’ meeting. Together with leaders from the G7, the Prime Minister and President commemorated the end of the Second World War in Europe. The leaders condemned President Putin’s unprovoked, unjustifiable and illegal war, and Russia’s horrendous attacks on civilians and civilian infrastructure. The G7 reiterated its steadfast military, financial, and diplomatic support for Ukraine and committed to phasing out reliance on Russian energy, imposing additional sanctions, combatting Russian propaganda, and addressing the international challenges caused by President Putin’s war – particularly global food security.</p>\n\n<p>Canada will continue to support Ukraine and Ukrainians as they fight authoritarianism and as they defend their freedoms, their democracy, and their way of life.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As Russia continues its ongoing illegal and unjustifiable war against Ukraine, Canada will continue to be there to support Ukraine and its people. I would like to thank President Zelenskyy for hosting this visit, but also more importantly, for his leadership. Together with Ukrainians, President Zelenskyy is defending the values at the very heart of democracies. His courage and the courage of Ukrainians is inspiring, and we will continue to do everything we can to make sure Ukraine gets the support it needs.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada and our allies are united in our condemnation of Vladimir Putin and his war of aggression, and we are united in our support for the remarkable people of Ukraine who are so bravely resisting his assault. We know that in standing up for themselves, the people of Ukraine are standing up for democracy and international law—and we stand with them. Today’s visit is a key opportunity for Canada to further underscore that unwavering support.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“When the Russian regime invaded Ukraine they had gravely underestimated the response of the allies and our commitment towards the people of Ukraine, who continue to fight with courage for their country. Canada will always be a friend to Ukraine and we are here in Kyiv to show our unwavering support. From mapping mines to making sure Russian forces are held accountable for their crimes, Canada is doing its part to support Ukraine.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since the beginning of 2022, Canada has committed $245 million in humanitarian assistance to respond to the worsening humanitarian crisis in Ukraine and neighbouring countries. Of this, $145 million has been allocated to United Nations organizations, the Red Cross Movement and to non-governmental organizations.</li>\n\t<li>Canada has also provided over 345,000 essential relief items such as blankets, mattresses, etc. from Canada’s National Emergency Strategic Stockpile to help respond to humanitarian needs in Ukraine and the region. These items were specifically requested by our partners and are being dispatched to Ukraine and neighbouring countries.</li>\n\t<li>In partnership with the Canadian Red Cross, 31,000 relief items from existing stockpiles have been deployed to Ukraine, including tarps, kitchen sets, hygiene parcels, and blankets.</li>\n\t<li>On April 9, 2022, Prime Minister Trudeau co-convened the Stand Up for Ukraine pledging event with the President of the European Commission, Ursula von der Leyen, which raised $12.4 billion for people fleeing the Russian invasion, inside Ukraine and abroad.</li>\n\t<li>In Budget 2022, Canada also allocated $500 million in additional military aid for Ukraine for the fiscal year 2022-23.</li>\n\t<li>Since 2015, Canada has committed approximately $154 million for defensive military equipment for Ukraine, with over $131 million of that committed since February 2022.</li>\n\t<li>Since Russia’s illegal occupation and attempted annexation of Crimea in 2014, Canada has imposed sanctions on more than 1,400 individuals and entities. Many of these sanctions have been undertaken in coordination with Canada’s allies and partners. Canada’s latest sanctions impose asset freezes and prohibitions on listed individuals and entities.</li>\n\t<li>Since Russia’s invasion of Ukraine on February 24, 2022, Canada has imposed sanctions on over 1,000 individuals and entities from Russia, Ukraine and Belarus.</li>\n\t<li>In March 2022, Canada referred the situation in Ukraine to the International Criminal Court (ICC), in concert with other ICC member states, in light of the numerous allegations of serious international crimes committed by Russian forces in Ukraine, including war crimes and crimes against humanity.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/08/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/05/canadas-intention-to-remove-tariffs-on-goods-from-ukraine.html\">Backgrounder: Canada’s Intention to Remove Tariffs on Goods from Ukraine</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.globalcitizen.org/en/info/ukraine/\">The Stand Up For Ukraine campaign</a></li>\n</ul></div>\n      "
}