{
  "path": "/en/news/statements/2022/05/18/statement-prime-minister-13th-anniversary-end-armed-conflict-sri-lanka",
  "pageTitle": "Statement by the Prime Minister on the 13th anniversary of the end of the armed conflict in Sri Lanka | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 13th anniversary of the end of the armed conflict in Sri Lanka:</p>\n\n<p>“As we mark the 13th anniversary of the end of the armed conflict in Sri Lanka, we remember and pay tribute to the lives that were lost during these 26 years of armed conflict, including at the massacre in Mullivaikal, as well as those who went missing, were injured, or displaced. Our thoughts are with the families and loved ones who continue to live with the pain, trauma, and loss from this tragedy.</p>\n\n<p>“This year, we also express our concern for the continued suffering of the people in Sri Lanka during the current economic and political crisis. We urge the Sri Lankan government to ensure people’s right to protest and freedom of expression are respected and we call on all parties to refrain from violence.</p>\n\n<p>“The people of Sri Lanka, including the Tamil people, deserve a safe, peaceful, and stable country. Over the years, I have met with the Tamil community, and others affected by the war in Sri Lanka and their experiences remind us of the ongoing need to achieve lasting peace and reconciliation. Canada continues to call on Sri Lanka to fulfill its commitment to establish a meaningful accountability process that provides justice for victims and survivors, and we will keep working as a member of the core group on Sri Lanka at the United Nations Human Rights Council to ensure accountability and reconciliation. Canada also continues to offer its support to the Government of Sri Lanka in taking concrete action to uphold its human rights obligations, and to all those working toward peace and reconciliation in the country.</p>\n\n<p>“Today, I encourage Canadians to reach out to their Tamil neighbours, and others affected by the armed conflict in Sri Lanka, to express their solidarity. By learning about and reflecting on past tragedies, we can all work together to ensure they never happen again and build a better future for everyone.”</p></div>\n      "
}