{
  "path": "/en/news/statements/2021/07/26/klusuwaqn-wejiaq-prime-minister-wjit-piskwatoq-kanata-30th-kaplnolowey",
  "pageTitle": "Klusuwaqn wejiaq Prime Minister wjit Piskwa’toq Kanata 30th Kaplno’lowey General, E’pit Mawimtawa’qa’toq Ula Tepaqi Muyuwalut Mali Simon | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Ula Prime Minister, Justin Trudeau, kisikuk tewa’tasik ta’n menuwaqtasik klusuwaqn wjit Piskwa’lan piley Kaplno’l General, E’pit mawi espipit Muyuwalut Mali Simon:</p>\n\n<p>“Wjit Kaplno’l Kanata, kepmite'tmn ni’n aqq mekite’tm wjit piskwa’lan Kanata 30th Kaplno’lowey General, E’pit ta’n mawi espipit wjit muyuwalanen Mali Simon.</p>\n\n<p>“Weskwijinuwin Nunavik, Oqwatnuk Quebec, E’pit mawi espipit te’sik kisa’toq elukwatk wjit wen eyk kikjuk nekm. Ta’n etlowistoq wj’t Inuit asite'tasitew aqq ketlamsitk, nutqo'ltijik majuwinu’k aqq ma’wt environment, mesink ta’n te’sik muyuwatk aqq timk Inuk wjit kl’nimn ta’n telukwet Kanata ambassador.</p>\n\n<p>“Ta’n teli pijiaq ta’n elukwet, E’pit ta’n Mawi espipit nemitasik te’sik pema'tu'n wjit pekisitoq wjit mawita’mk, teliaq, aqq ta’n Human Rights maliaptik koqowey amsela’sik. Kisa’toq ta’n ikana'lisk wjit melkiknowa’toq ta’n majuwinu' Kanata ta’n eykik Arctic region, kitk ta’n te'sikjik tett eykik aqq se’k eymu’tijik. Wjit Kanata Kaplno’l General aqq Steward wjit Kanata Constitution aqq institutions, Ni’n kejitu ika’tew ta’n nekm kejitoq aqq nenk wjit ikana’lan Kanata msit ta’n ketlamite’tk, kitk wikuwaq aqq ta’n tepit wjit ketlamite’tasik aqq tepaqa’tiket kitk Kanata Tli’suti. Ni’n elt kejitu ta’n, wjit Kanata Commander-pisit-saqamaw, lukwetew wjit apoqnmin ta'n menuwaqtasik wjit mu talipien wen aqq Asko'tasit Kanata aqq kikmanaq.</p>\n\n<p>“Ni’n welte’tm ula ta’n sa’q tela'sik wjit nike’ ta’n siawa’sik ta’n metuwe’k pa na'sik ta’n kisi tliaqip. Ni’n ke’itu ta’n, wjit Kanata L’nu’k Tmk Kaplno’l General, E’pit ta’n mekite’tk ika’lsitew elukwetk apoqnwen n metuwe’kl ta’n kejitasik kitk, pemimtna’q ta’n askwa’toq wjit apiksituwaqn, aqq l’tmin tmkwatikney ta’n msit ula teluwi’tmu’k ula wikulti’k.</p>\n\n<p>“Ula Na’kwek, apankitmu’k elt mukwite’tmanmew E’pit Espipit Eleke’wi’skw Elisapet II, Eleke’wi’skw wjit Kanata, ta’n 69 netipunkekl elukwatk Commonwealth aqq ta’n majuwinu' Kanata ta’n wekunk wantaqo’ti, mekite’taqn, aqq ta’n teli jijitoq. Ula na 13th te’sik nemiut ula Kaplno’l General wjit Kanata wejiaq E’pit Espipit weja’tikemk ta’n tujiw wesuwa’to’q throne 1952 ek.</p>\n\n<p>“Ni’n weltasi E’pit tepaqa’toq Muyuwalut Mali Simon wjit wesuwa’toq wjit apankitmn aqq iknmwetn ta’n te’sik kamulamunk wejiaq welta’suwaqn. Menuwekey msit Kanata wjit kwilmin wla'sikn aqq atiknetmin ula kepmite’tasik wjit siawa’sin wjit kinu eymu’ti’k, aqq tekweywin ta’n tujiw nemituan pekisitoq ta’n menuwekej ta’n keknuwe’k, aqq me’ Kanata aji espitek aqq sa’qawey etlukutijik.”</p>\n\n<h2>Ta’n wiaqtek Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Prime Minister ewi'kik Ta’n Eleke’wi’skw asite’tk wjit Kanata Kaplno’lowitew</a></li>\n</ul></div>\n      "
}