{
  "path": "/en/news/news-releases/2017/12/07/prime-minister-successfully-concludes-second-official-visit-china",
  "pageTitle": "Prime Minister successfully concludes second official visit to China with keynote address at Fortune Global Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today wrapped up a successful second official visit to China. Over the last five days, the Prime Minister visited Beijing and Guangzhou, where he met with leaders in government and business, and focused on growing the Canada-China relationship through trade and investment.</p><p>The Prime Minister met with several government leaders, including His Excellency, President Xi Jinping of the People’s Republic of China, and His Excellency, Li Keqiang, Premier of the State Council of the People’s Republic of China. Together, they agreed to move forward on several initiatives to deepen bilateral ties, including continuing exploratory discussions towards a comprehensive trade agreement, issuing the Joint Statement of Climate Change and Clean Growth, and increasing market access for Canadian producers of beef and pork. Leaders also addressed important regional issues, including North Korea and Myanmar, and had a respectful discussion on continuing efforts to improve human rights and the rule of law in their respective countries.</p><p>The Prime Minister wrapped up his visit to China in Guangzhou at the Fortune Global Forum, which brought together multinational CEOs and the heads of China’s most important companies to discuss issues related to international commerce. At the forum, the Prime Minister delivered the keynote address, participated in an armchair discussion, and held several bilateral meetings with global business leaders. As the forum wrapped up, the Prime Minister announced that Canada will host the 2018 Fortune Global Forum. Throughout these engagements, the Prime Minister reiterated the importance of pursuing progressive trade deals and encouraged international investments in Canada. &nbsp;</p><p>The Prime Minister also visited the Sina Corporation’s new headquarters where he highlighted the 2018 Canada-China Year of Tourism through a live event with Weibo, one of the largest social media platforms in Asia, and promoted Canada as a premier tourism destination.</p><p>The Prime Minister also participated in a roundtable with the Canadian founder and alumni of Educating Girls of Rural China, where they discussed the organization’s work to support the education of young girls in China. The Prime Minister took the opportunity to reaffirm Canada’s commitment to gender equality and the empowerment of women and girls around the world.</p><p>The Prime Minister also joined business leaders from major Canadian and Chinese companies from diverse sectors, including agriculture, finance, energy and natural resources, for a roundtable discussion on Canada-China Economic Relations.</p><p>The Prime Minister, along with members of the Canadian delegation, also took a moment to remember the victims of the École Polytechnique Montreal and reflect on the importance of eliminating gender-based violence in all its forms.</p><h2>Quote</h2><blockquote><p>“A stronger relationship between Canada and China is essential to creating good jobs and new opportunities for middle class Canadians to succeed. We have made a lot of progress during this trip, and we will build on this momentum and continue exploratory discussions towards a comprehensive trade agreement between our two countries. We are committed to pursuing trade deals that benefit everyone and put people first.”<br><cite>— Rt.&nbsp;Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>China is Canada’s second-largest trading partner, largest and fastest growing source market for international students, and third-largest source of tourists.</li><li>Canada’s merchandise exports to China were almost $21 billion in 2016, an increase of four percent over 2015, with top exports being forest and agricultural products, copper and iron ores, and motor vehicles.</li><li>In 2016, Canada and China agreed to designate 2018 the Canada-China Year of Tourism, which includes initiatives to increase the flow of tourists and promote cultural activities.</li><li>The Fortune Global Forum&nbsp; attracted a large number of high-profile CEOs from around the world, in addition to senior level executives, ambassadors, and current and former senior government officials.</li></ul><h2>Related products</h2><ul><li><a href=\"/en/news/news-releases/2017/12/04/canada-announces-new-partnerships-china-grow-shared-prosperity\">Canada announces new partnerships with China to grow shared prosperity</a></li><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/12/04/canada-china-joint-initiatives-and-agreements\">Canada-China Joint Initiatives and Agreements</a></li><li><a href=\"/en/news/statements/2017/12/04/canada-china-joint-statement-climate-change-and-clean-growth\">Joint Statement on Climate Change and Clean Growth</a></li><li><a href=\"/en/news/news-releases/2017/12/04/prime-minister-trudeau-welcomes-upcoming-canada-china-year-tourism\">Prime Minister Trudeau welcomes upcoming Canada-China Year of Tourism</a></li><li><a href=\"/en/news/news-releases/2017/11/26/prime-minister-strengthen-bilateral-and-commercial-ties-trip-china\">Prime Minister to strengthen bilateral and commercial ties on trip to China</a></li></ul><h2>Associated link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.56003307.1168694504.1511191876-108037952.1511191871\">Canada-China Relations</a></li></ul></div>\n      "
}