{
  "path": "/en/news/readouts/2020/06/16/prime-minister-justin-trudeau-speaks-prime-minister-saint-vincent-and",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Saint Vincent and the Grenadines Ralph Gonsalves | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Saint Vincent and the Grenadines, Ralph Gonsalves, to discuss the latest developments in the COVID-19 pandemic.</p>\n\n<p>The prime ministers exchanged information on the efforts within Canada and the Caribbean to fight the pandemic and protect the health, safety, and economic well-being of all citizens.</p>\n\n<p>Prime Minister Trudeau recognized the significant impact that COVID-19 is having on Caribbean Community (CARICOM) countries, particularly on the economic front. The prime ministers agreed that the pandemic underscored the need for strengthened global partnerships and international institutions focused on the needs of the most vulnerable.</p>\n\n<p>The two leaders spoke of the friendship between Canada and Saint Vincent and the Grenadines, built on shared climate action goals and enduring people-to-people ties.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/saint_vincent_grenadines/relations.aspx?lang=eng\">Canada-Saint Vincent &amp; the Grenadines relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}