{
  "path": "/en/news/statements/2023/04/18/statement-prime-minister-mark-three-years-shooting-nova-scotia",
  "pageTitle": "Statement by the Prime Minister to mark three years since the shooting in Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark three years since the mass shooting incident in Nova Scotia:</p>\n\n<p>“Three years ago, on April 18 and 19, 2020, the deadliest mass shooting in Canadian history shook Nova Scotia – and all of Canada. On this sombre day, we remember those we lost and hold their memories close to our hearts. Our thoughts go to everyone who was forever impacted by this senseless tragedy.</p>\n\n<p>“In the aftermath of this attack, Canadians across the country united in grief and solidarity. We showed who we are as Canadians by holding vigils to honour the victims and coming together to offer support to those impacted. As we continue to honour those who died, I am inspired by the strength and resilience I’ve seen from the families, survivors, and all Nova Scotians.</p>\n\n<p>“Last month, the <a href=\"https://masscasualtycommission.ca/\">Mass Casualty Commission</a> released its final report. As we review and respond to the recommendations under federal jurisdiction, we will work closely with the Government of Nova Scotia and with the people and the communities affected to ensure a tragedy like this never happens again. The Government of Canada has already taken action to keep Canadians safe in their communities, and we have invested in better mental health supports – like the <a href=\"https://wellnesstogether.ca/en-CA\">Wellness Together Canada</a> portal and the <a href=\"https://www.wellnesstogether.ca/en-CA/pocketwell\">PocketWell</a> app to provide free, 24/7 access to support, ranging from information to connecting with professionals.</p>\n\n<p>“Today, Canadians remember the 22 people, including a woman who was expecting a child, whose lives were cut short on one of the darkest days in Canadian history. We will never forget them. To the people of Nova Scotia: we know the pain, trauma, and heartbreaking loss will never truly go away, but today and every day, we stand with you.”</p></div>\n      "
}