{
  "path": "/en/news/readouts/2022/11/10/prime-minister-justin-trudeau-speaks-prime-minister-italy-giorgia-meloni",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Italy Giorgia Meloni | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Italy, Giorgia Meloni.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Meloni on her recent appointment as Prime Minister. The two leaders discussed the importance of building on the strong relationship between their two countries, including at the G7 and NATO, to address ongoing global concerns related to Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>With 2022 marking the 75th anniversary of bilateral relations, the prime ministers underlined the deep people-to-people and cultural ties between Canada and Italy, and agreed to work closely to advance international peace and security, to promote the development and adoption of clean technologies and to help create good jobs on both sides of the Atlantic by strengthening bilateral investment and trade.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Meloni looked forward to meeting in person at the G20 Leaders’ Meeting in Indonesia next week.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/italy-italie/relations.aspx?lang=eng\">Canada-Italy relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/10/22/statement-prime-minister-formation-new-government-italy\">Statement by the Prime Minister on the formation of a new government in Italy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}