{
  "path": "/en/news/statements/2021/02/12/statement-prime-minister-chinese-new-year",
  "pageTitle": "Statement by the Prime Minister on Chinese New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Chinese New Year, also known as the Spring Festival:</p>\n\n<p>“Today, Chinese communities across Canada and around the world mark the beginning of Chinese New Year and welcome the Year of the Ox.</p>\n\n<p>“The Spring Festival is a time to look to the year ahead with optimism and hope. This holiday is traditionally a time for friends and families to come together, and would mark the beginning of two weeks of celebrations, including feasts and parades. Festivities will look different this year due to the global COVID-19 pandemic, but the lessons we draw from the ox – an animal symbolizing hard work, perseverance, and honesty – will help us move forward during these difficult times.</p>\n\n<p>“For generations, Chinese Canadians have made important contributions to communities across the country – and this year has been no different. Many have been working on the frontlines of the global COVID-19 pandemic to keep us all safe and healthy. From donating personal protective equipment to supporting seniors, Chinese Canadian community organizations have also contributed to fighting this virus and supporting their fellow Canadians. Today is an opportunity to honour these, and all other efforts by Chinese Canadians, to continuously make our country a better place for everyone.</p>\n\n<p>“Chinese New Year is also an opportunity to recognize that anti-Asian racism still exists here in Canada. Together, let’s reaffirm our commitment to build a more inclusive Canada, celebrate the diversity that makes us strong, and continue to fight discrimination and hatred in all its forms.</p>\n\n<p>“On behalf of our family, Sophie and I wish good health, happiness, and good fortune to everyone celebrating.</p>\n\n<p>“新年快樂! Xīn Nián Kuài Lè! Sun Nin Fai Lok!”</p></div>\n      "
}