{
  "path": "/en/news/news-releases/2016/03/08/prime-minister-announces-changes-senior-ranks-public-service",
  "pageTitle": "The Prime Minister announces changes in the senior ranks of the Public Service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the following changes in the senior ranks of the Public Service:</p>\n<p><a href=\"/en/news/backgrounders/2016/03/08/catherine-blewett\"><strong>Catherine Blewett</strong>,</a> currently Clerk of the Executive Council and Secretary to Cabinet, Government of Nova Scotia, becomes Deputy&nbsp;Minister of Fisheries and Oceans, effective June 20, 2016.</p>\n<p><a href=\"/en/news/backgrounders/2016/03/08/marie-lemay\"><strong>Marie Lemay</strong>,</a> currently President of the Economic Development Agency of Canada for the Regions of Quebec, becomes Deputy Minister of Public Services and Procurement, effective April 11, 2016.</p>\n<p><a href=\"/en/news/backgrounders/2016/03/08/dylan-jones\"><strong>Dylan Jones</strong></a>, currently President and Chief Executive Officer of the Canada West Foundation, becomes Deputy Minister of Western Economic Diversification, effective June 20, 2016.</p>\n<p><a href=\"/en/news/backgrounders/2016/03/08/siddika-mithani\"><strong>Siddika Mithani</strong>,</a> currently Associate Deputy Minister of Environment and Climate Change, becomes President of the Public Health Agency of Canada, effective April 11, 2016.</p>\n<p><a href=\"/en/news/backgrounders/2016/03/08/coleen-volk\"><strong>Coleen Volk</strong></a>, currently Deputy Secretary to the Cabinet (Senior Personnel, Business Transformation and Renewal), Privy Council Office, becomes Associate Deputy Minister of Environment and Climate Change, effective April 11, 2016.</p>\n<p>The Prime Minister took the opportunity to congratulate <strong>George Da Pont</strong>, Deputy Minister of Public Services and Procurement, <strong>Matthew King</strong>, Deputy Minister of Fisheries and Oceans, and <strong>Krista Outhwaite,</strong> President of the Public Health Agency of Canada, on the occasion of their retirements, and <strong>Daphne Meredith</strong>, Deputy Minister of Western Economic Diversification, on her upcoming retirement in June. The Prime Minister thanked them for their many distinguished accomplishments over the course of their careers and noted their dedication and commitment in serving Canadians.</p>\n<p><strong>Biographical notes hyperlinked above.</strong></p>\n<p></p></div>\n      "
}