{
  "path": "/en/news/news-releases/2016/12/20/prime-minister-announces-allocation-new-towing-vessel-british",
  "pageTitle": "Prime Minister announces allocation of a new towing vessel to British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today toured a tugboat in the Burrard Inlet and took a brief ride in English Bay.</p><p>He used the opportunity to announce that the second of the two emergency towing vessels promised in the Oceans Protection Plan would operate on Canada’s West Coast.</p><p>The vessels will help the Canadian Coast Guard tow large commercial ships – including tankers – that are in distress and that pose a hazard to safe navigation, the marine environment, public health and local economies.</p><p>This is one of many measures included in the $1.5 billion Oceans Protection Plan that the Government of Canada announced in November 2016 which will make Canada a world-leader in marine safety. The plan is also an important step towards the co-management of our coasts with Indigenous and coastal communities in order to keep them healthy, clean, and safe for generations to come.</p><h2>Quote</h2><blockquote><p>“In November, the Government of Canada announced a new Oceans Protection Plan that will help make Canada a world-leader in marine safety and keep our coasts healthy, clean and safe.&nbsp; Part of that plan is to lease two new emergency towing vessels to help ensure that the Coast Guard has sufficient towing capacity to help commercial ships in distress. Both of these vessels will operate on Canada’s West Coast and help to keep large disabled vessels off BC's pristine coasts. ”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Oceans Protection Plan will include over $1.5 billion in funding over five years, starting in 2017-18.</li><li>Under the Oceans Protection Plan two new vessels will be leased with the ability to tow large commercial ships, including tankers. The vessels will be operated by the Canadian Coast Guard on Canada’s West Coast. In addition, towing capacity will be added to major Canadian Coast Guard vessels on the East and West coasts.</li><li>Marine trade employs approximately 250,000 Canadians and injects more than $25 billion to Canada’s economy.</li><li>New research into the impacts of increased shipping on marine ecosystems will be funded.</li><li>The Government of Canada will work with provincial and Indigenous partners to develop a plan for the best location and most effective use of these new vessels and resources.</li><li>Other notable measures the Government has and will take include, the re-opening the Kitsilano Coast Guard base, the forming of new Indigenous Community Response Teams in British Columbia,&nbsp; strengthening the Polluter-Pays Principle and the building of four new lifeboat stations in British Columbia.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/news-releases/2016/11/07/prime-minister-canada-announces-national-oceans-protection-plan\">The Prime Minister of Canada announces the national Oceans Protection Plan</a></li><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-ocean-protection-plan-world-leading-marine-safety-system\">World-leading marine safety system</a></li><li><a href=\"/en/news/backgrounders/2016/11/07/canada’s-oceans-protection-plan-what-it-means-canada’s-regions\">Oceans Protection Plan in each region</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.tc.gc.ca/eng/oceans-protection-plan.html\">Oceans Protection Plan</a></li></ul></div>\n      "
}