{
  "path": "/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response",
  "pageTitle": "Prime Minister announces new actions under Canada’s COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 is a rapidly evolving global issue. The Government of Canada will do everything necessary to protect the health, safety, and wellbeing of Canadians, and is working around the clock to limit the spread of this pandemic. This is a critical time, and our top priority remains the safety and security of all Canadians.&nbsp;</p>\n\n<p>The Prime Minister, Justin Trudeau, today outlined additional actions being taken under the Government of Canada’s whole-of-government response to COVID-19 to limit its spread and to provide support to Canadian travellers. The Prime Minister also strongly urged Canadians to heed the following recommendations that:</p>\n\n<ul>\n\t<li>All Canadians avoid non-essential travel outside the country until further notice.</li>\n\t<li>Canadian travellers return to Canada via commercial means while they remain available.</li>\n\t<li>All travellers to Canada self-isolate for 14 days upon entry, with exceptions for workers who are essential to the movement of goods and people.</li>\n</ul>\n\n<p>COVID-19’s spread has affected people in countries around the world. To protect Canadians and to ease the potential burden overseas travellers could place on our health care system and its frontline workers, the Prime Minister announced that, beginning March 18, 2020&nbsp;the Government of Canada will, for air travel specifically:</p>\n\n<ul>\n\t<li>Bar foreign nationals from all countries except the United States from entering Canada. The measure would not apply in designated exceptional circumstances, including to air crews, travellers arriving in Canada in transit to a third country, Canadian permanent residents, diplomats, or immediate family members of Canadian citizens.</li>\n\t<li>Redirect international passenger flight arrivals to four airports: Toronto Pearson International Airport, Vancouver International Airport, Montréal-Trudeau International Airport, and Calgary International Airport. At this time, this measure will not affect domestic flights or flights from the United States, sun destinations such as Mexico and the Caribbean, or St. Pierre-et-Miquelon, which can continue to operate on their regular routes and land at current Canadian destinations. The Government is working closely with the airline industry and airports to avoid unnecessarily disrupting operations and minimize additionally inconveniencing travellers.</li>\n\t<li>Strengthen screening measures at airports, including stronger and more visible messaging, health screening at kiosks, and enhanced cleaning and disinfection of high-traffic areas and facilities at airports.</li>\n</ul>\n\n<p>In addition, airlines will prevent all travellers who present COVID-19 symptoms, regardless of their citizenship, from boarding international flights to Canada. Airlines will conduct a basic health assessment of all air travellers based on guidance from the Public Health Agency of Canada.</p>\n\n<p>The Government will also provide support to Canadians affected by COVID-19 abroad. To help these Canadians return home or cope with challenges they are facing while travelling, the Government has created the COVID-19 Emergency Loan Program for Canadians Abroad. The Program will provide the option of an emergency loan to Canadians in need of immediate financial assistance to help them return home or to temporarily cover their life-sustaining needs while they work toward their return.</p>\n\n<p>These measures are part of a larger strategy the Government of Canada is implementing, based on science, to prioritize the health and safety of Canadians, ensure the capacity of our health care system, support international and domestic efforts, and mitigate the economic impacts on Canadians and Canadian business.</p>\n\n<p>Today’s announcement builds on earlier measures put in place to respond to COVID-19, including waiving the one-week waiting period for Employment Insurance sickness benefits, enhancing the Work-Sharing Program, funding vaccine development and clinical trials, and investing to support the health care system in our provinces and territories.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“My top priority is the health and safety of all Canadians. Our government is doing what it must to protect all Canadians, and to support workers and businesses. We will get through this together by following the directions from our public health and medical experts, and doing what we can to protect ourselves, our families, and our communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our top priority remains the health and safety of Canadians. This is a critical time, and we need to do everything we can to contain the outbreak and lessen the burden on our healthcare system. We are taking a whole-of-government and whole-of-country approach to limit the spread of COVID-19 and keep Canadians safe.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“These measures will further support our public health response to limit the spread of COVID-19 in Canada. Everyone has a role to play in protecting themselves and their communities. It is critical that all air travellers entering Canada follow these public health recommendations.”&nbsp;</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<blockquote>\n<p>“The safety and security of the travelling public and the transportation system is a top priority for our Government. These measures will help ensure that Canadian travellers remain safe and our transporation system continues to operate as smoothly as possible to support the economy.”</p>\n\n<footer class=\"default\">The Hon. Marc Garneau, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“In these challenging times, Canadians should know that all hands are on deck and that whatever comes, our government will do what it must to protect the health and safety of all Canadians and to minimize the social and economic impacts of COVID-19 on our workers, our businesses, and our economy.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, President of the Treasury Board</footer>\n</blockquote>\n\n<blockquote>\n<p>“The measures we announced today to temporarily prevent foreign nationals from flying into Canada will help reduce the threat from international travel. We continue to closely monitor the rapidly evolving COVID-19 situation and will announce additional measures to protect the health and safety of Canadians if and when required.”</p>\n\n<footer class=\"default\">The Hon. Bill Blair, Minister of Public Safety and Emergency Preparedness</footer>\n</blockquote>\n\n<blockquote>\n<p>“Ensuring the health and safety of Canadians both at home and abroad remains our priority. We continue to work around the clock to provide assistance and consular services to Canadians worldwide affected by COVID-19. I will continue to collaborate with my counterparts globally to take action in limiting the global spread of this virus.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada is asking all travellers entering Canada to self-isolate for 14 days upon entry. For those travelling by air, the request to self-isolate will be clearly communicated at multiple points, for example when purchasing a plane ticket, before boarding the plane, and again upon arrival in Canada.</li>\n\t<li>Exemptions to self-isolation for 14 days will be provided to healthy workers who provide essential services. This includes workers in the trade and transportation sector who are important for the movement of goods and people across the border, such as truck drivers and crew on any aircraft, train or marine vessel crossing the border. It also includes healthy people who have to cross the border to go to work, including health care providers and critical infrastructure workers.</li>\n\t<li>Under the <em>Aeronautics Act</em>, the Minister of Transport will require airlines to deny boarding of a traveller who is symptomatic, regardless of citizenship status, and keep them from going on an international flight to Canada. This includes trans-border flights, including those from the United States. The pre-boarding health assessment would include the operator asking simple health questions, looking for visible signs of illness before boarding, and possibly referring the traveller for a further medical assessment.</li>\n\t<li>In the event the traveller presents COVID-19 symptoms, the airline will be required to refuse to board the passenger for travel for a period of 14 days, or until a medical certificate is presented that confirms the patient does not carry the virus.</li>\n\t<li>Measures implemented by governments throughout the world in their efforts to contain the spread of COVID-19 have had significant impacts on Canadians abroad. Cross-border transit and movement within countries is being restricted, and Canadian travellers are recommended to return to Canada via commercial means while they remain available.</li>\n\t<li>In situations where Canadians abroad are in need of immediate financial assistance as a result of COVID-19, the new COVID-19 Emergency Loan Program for Canadians Abroad will provide repayable loans to facilitate their return to Canada or help ensure that their basic essential needs are met while they work on their return to Canada.</li>\n\t<li>This loan program will help Canadians who are in quarantine or receiving treatment for COVID-19 in a foreign country cope with challenges related to cultural and language barriers, access to medication, feelings of isolation, as well as post-discharge logistics, and return travel to Canada.</li>\n\t<li>Canadians in quarantine or receiving treatment for COVID-19 in a foreign country require a tailored approach to consular support that considers the local circumstances and addresses the unique human challenges associated with undergoing quarantine and treatment in an unfamiliar environment. Global Affairs Canada will do its best to supplement its existing consular services through new partnerships with domestic and international partners to enhance its ability to assist affected Canadians.</li>\n\t<li>Global Affairs Canada is providing 24/7 consular support to Canadians abroad affected by COVID-19 through the Emergency Watch and Response Centre and through consular staff at its network of missions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">The Government of Canada Takes Action on COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2020/03/new-measures-for-covid-19-response.html\">New measures for COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://travel.gc.ca/assistance/embassies-consulates\">Embassies and consulates by destination</a></li>\n</ul></div>\n      "
}