{
  "path": "/en/news/statements/2023/01/01/statement-prime-minister-haiti-independence",
  "pageTitle": "Statement by the Prime Minister on Haiti’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Haiti’s Independence Day:</p>\n\n<p>“Today, we join the people of Haiti and Haitian communities in Canada and around the world to celebrate Haiti’s Independence Day.</p>\n\n<p>“Since 1804, on January 1st of every year, Haitians and people of African descent commemorate Haiti’s declaration of independence. The Haitian Revolution, which lasted 15 years, resulted in Haiti becoming the second independent nation in the Americas, the first independent nation in Latin America, as well as the first country in the Western Hemisphere where Black people successfully overturned slavery.</p>\n\n<p>“Since establishing diplomatic relations in 1954, Canada and Haiti have maintained close ties due to their geographical proximity and shared official language, as well as the ongoing presence of Canadian organizations supporting development in the country. Canada and Haiti are close partners within organizations such as La Francophonie and the United Nations, where we work together to respond to global challenges and build a better future for people.</p>\n\n<p>“Today, we must also recognize the ongoing, precarious security and humanitarian situation in Haiti. In the face of adversity, Haitians are demonstrating their tremendous strength as a people – and Canada is there to support them. Especially over the past few months, Canada has taken action in response to the egregious situation, including by providing additional humanitarian support, coordinating the delivery of vital security equipment, purchased by the Haitian government, to help restore security and stability, and implementing robust sanctions on those responsible.</p>\n\n<p>“As a steadfast partner, Canada will continue to stand with Haitian people as they strive for a brighter future. We will continue to work with the international community to advance a Haitian-led solution and support Haitian institutions to restore stability in the country.</p>\n\n<p>“Canada is home to over 165,000 Canadians of Haitian ancestry. On this day, I invite all Canadians to celebrate the many contributions of the Haitian Canadian community in making our country more vibrant and prosperous.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to everyone celebrating Haiti’s Independence Day.</p>\n\n<p>“Bòn Ane! e Bòn Fèt endepandans!”</p></div>\n      "
}