{
  "path": "/en/news/readouts/2023/02/14/prime-minister-justin-trudeau-speaks-united-states-special-presidential-0",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the United States Special Presidential Envoy for Climate, John Kerry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the United States Special Presidential Envoy for Climate, John Kerry.</p>\n\n<p>Prime Minister Trudeau and Special Presidential Envoy Kerry discussed shared priorities for Canada and the United States, including regional climate action and security. They spoke about the ongoing crisis in Haiti, and the importance of supporting regional actors. To this end, they looked forward to engaging with Caribbean leaders at the CARICOM Heads of Government meeting&nbsp;that will take place on February 15 and 16&nbsp;in Nassau, The Bahamas.</p>\n\n<p>The Prime Minister and the Special Presidential Envoy discussed the ongoing political, humanitarian, and socioeconomic aspects of the crisis in Haiti. They reaffirmed their commitment to work together to support Haitian-led solutions, promote dialogue toward democratic elections, and enhance Haiti’s effective law enforcement capacity.&nbsp;The Prime Minister talked about the importance of coordinated sanctions to pressure those responsible for the ongoing violence and instability in Haiti, and disrupt the flow of weapons to criminal gangs in Haiti.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Special Presidential Envoy Kerry looked forward to speaking more about this issue in the coming days.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/11/prime-minister-travel-bahamas-meet-caribbean-community-caricom\">Prime Minister to travel to The Bahamas to meet with Caribbean Community (CARICOM) leaders</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2023/02/canada-deploys-cp-140-long-range-patrol-aircraft-to-support-haiti.html\">Canada deploys CP-140 long-range patrol aircraft to support Haiti</a></li>\n</ul></div>\n      "
}