{
  "path": "/en/news/readouts/2022/12/13/prime-minister-justin-trudeau-speaks-chancellor-germany-olaf-scholz",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor of Germany Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Chancellor of Germany, Olaf Scholz.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz discussed Russia’s unjustifiable and unprovoked war of aggression against Ukraine, and denounced the illegal targeting of critical infrastructure by Russian forces. The two leaders addressed the importance of the continued coordination of international support towards Ukraine, and agreed on the importance of a newly-created multi-agency Donor Coordination Platform, which will help support the country’s recovery and reconstruction.</p>\n\n<p>Prime Minister Trudeau further underlined Chancellor Scholz’s strong leadership during Germany’s successful presidency of the G7 in 2022, and both leaders agreed to work together to support Japan’s presidency of the G7 in 2023.&nbsp;&nbsp;</p>\n\n<p>Both leaders highlighted the growing cooperation between Canada and Germany in support of Europe’s energy security, in particular related to critical supply chains, and the hydrogen alliance that was announced during the Chancellor’s visit to Canada in August. The Prime Minister and Chancellor also discussed Germany’s ongoing efforts towards the ratification of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), and committed to doing what they can to help create jobs, and foster investments on both sides of the Atlantic Ocean.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz agreed to stay in close contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a name=\"_Hlk121828473\" id=\"_Hlk121828473\"></a><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/12/12/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/23/prime-minister-concludes-successful-visit-german-chancellor-olaf\">Prime Minister concludes a successful visit by German Chancellor Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}