{
  "path": "/en/news/readouts/2020/02/17/prime-minister-justin-trudeau-convenes-incident-response-group-address",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to address infrastructure disruptions caused by blockades across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the Government of Canada’s engagement to resolve infrastructure disruptions caused by blockades across Canada as soon as possible. Deputy Prime Minister Chrystia Freeland, Minister of Crown-Indigenous Relations Carolyn Bennett, Minister of Finance Bill Morneau, Minister of Transport Marc Garneau, Leader of the Government in the House of Commons and Quebec Lieutenant Pablo Rodriguez, Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Indigenous Services Marc Miller, Minister of Natural Resources Seamus O’Regan, and Minister of Justice and Attorney General David Lametti also participated.</p>\n\n<p>The Prime Minister, Deputy Prime Minister, and ministers all agreed on the importance of freedom of expression as a democratic right, and they discussed the need to approach this urgent situation in a way that builds trust and respect towards an immediate resolution with all parties. Deputy Prime Minister Freeland, Minister Bennett, Minister Rodriguez, and Minister Miller provided an update on their ongoing outreach to provincial and Indigenous leaders, including with Mohawk Nation and Gitxsan Simgyget, Wet’suwet’en Dini Ze’ and Ts’ake ze. Minister Morneau and Minister Garneau briefed the group on the economic impacts of the disruptions on business, farmers, travellers, and communities across Canada.</p>\n\n<p>The Prime Minister re-emphasized the urgency of the situation and the need for ministers to continue to be engaged at all levels to resolve this quickly to minimize these very real impacts on Canadians. All participants committed to continue to cooperate closely and to be fully engaged.</p>\n\n<p>The Prime Minister stressed the importance of resolving the situation in a peaceful manner, with continued dialogue to address underlying issues in the spirit of reconciliation. The Prime Minister and Ministers remain actively involved in this issue by continuing to reach out to premiers and Indigenous leaders to bring this situation to a resolution as soon as possible.</p></div>\n      "
}