{
  "path": "/en/news/news-releases/2017/07/14/prime-minister-opens-process-select-next-justice-supreme-court-canada",
  "pageTitle": "Prime Minister opens the process to select the next justice of the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today opened the process to select the next justice of the Supreme Court of Canada, to fill the vacancy created by the upcoming retirement of Chief Justice Beverley McLachlin.</p><p>Under the <a href=\"/en/news/backgrounders/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">new approach</a> launched last year, an independent and non-partisan Advisory Board, the members of which will be announced shortly, will be given the task of identifying suitable candidates who are jurists of the highest caliber, functionally bilingual, and representative of the diversity of our great country.</p><p>Chief Justice McLachlin was appointed to the Supreme Court of Canada from the Supreme Court of British Columbia. In recognition of the custom of regional representation, the process will be open to all qualified applicants from Western Canada and Northern Canada. This is the first time that the North is acknowledged in the custom of regional representation.</p><h2>Quote</h2><blockquote><p>“The Supreme Court of Canada is recognized around the world as a strong, independent judicial institution. This strength includes regional representation. The process we are opening up today will recruit potential candidates from Western Canada and Northern Canada and follow the tradition of appointing only the most exceptional and impressive individuals to the court.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The application period ends on Friday, September 15, 2017.</li><li>Qualifying candidates who wish to be considered for the upcoming vacancy must complete and submit an application package&nbsp;(questionnaire, authorization form, and a background check consent form) no later than 23:59 Pacific daylight saving time on September 15, 2017.</li><li>Those interested in applying are encouraged to first review the statutory requirements set out in the&nbsp;<i><a href=\"http://laws-lois.justice.gc.ca/eng/acts/S-26/\">Supreme Court Act</a></i>, as well as the Statement of Qualifications and Assessment Criteria that will guide the Advisory Board in evaluating a candidate’s suitability.</li><li>The applications now being accepted are for the purpose of identifying the next member of the Supreme Court following the December 15, 2017, retirement of Chief Justice Beverley McLachlin.</li><li>Candidates may demonstrate that they satisfy the geographical requirement by reference to their bar membership, judicial appointment, or other relationship with Western Canada (British Columbia, Alberta, Saskatchewan and Manitoba) and Northern Canada (Yukon, Northwest Territories and Nunavut).</li><li>From the nine justices of the Supreme Court then assembled, the Prime Minister will identify the jurist best placed to serve as the next Chief Justice of Canada.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/index-eng.html\">Supreme Court of Canada Appointments</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and Assessment Criteria</a></li><li><a href=\"/en/news/backgrounders/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">New process for judicial appointments to the Supreme Court of Canada</a></li></ul></div>\n      "
}