{
  "path": "/en/news/news-releases/2015/11/27/prime-minister-releases-guide-ministers",
  "pageTitle": "Prime Minister releases guide for Ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today took the step of publicly releasing <em>Open and Accountable Government</em>, a guide that sets out his expectations for the conduct of his Ministers and their roles and responsibilities in Canada’s system of responsible parliamentary government.</p>\n<p>The document lays out both individual and collective ministerial responsibilities, as well as details on Ministers’ relationships with the Prime Minister and Cabinet, their portfolios, and Parliament. It outlines the standards of conduct expected of Ministers – including accountability and ethical guidelines – and addresses a range of administrative, procedural, and institutional matters. It also provides guidance to ministerial exempt staff, as well as useful information for public servants and Canadians on their system of government.</p>\n<p><strong>Quotes</strong></p>\n<p>“In order for Canadians to trust their government, they need a government that trusts them. We will be open and honest with Canadians, and we will uphold the highest standards of integrity and impartiality both in our public and private affairs. The documents we are releasing today provide guidance on how we must go about our responsibilities as Ministers, and I encourage Canadians to read them and to hold us accountable for delivering these commitments.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Our plan for an open and accountable government will allow us to modernize how the Government of Canada works, so that it better reflects the values and expectations of Canadians. At its heart is a simple idea: open government is good government.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Guides for Ministers are typically revised and reissued following elections or transitions of government in Canada.</li>\n</ul>\n<ul>\n<li>A number of sections in <em>Open and Accountable Government</em> have been updated and expanded, including new sections on the use of social media, the governance of Crown corporations, and a code of conduct for exempt staff.</li>\n</ul>\n<ul>\n<li>Work has already begun to make the Government of Canada more open and transparent, including making ministerial mandate letters available to the public for the first time in Canadian history. Other commitments that will be acted upon include making government information more accessible, making it easier for Canadians to access their own personal information, embracing open data, and disclosing parliamentary expenses.</li>\n</ul>\n<p><strong>Associated Link</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2015/11/27/open-and-accountable-government\">Open and Accountable Government</a></li>\n</ul></div>\n      "
}