{
  "path": "/en/news/readouts/2022/03/03/prime-minister-justin-trudeau-speaks-prime-minister-netherlands-mark-rutte",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Prime Minister of the Netherlands Mark Rutte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the Netherlands, Mark Rutte, about Russia’s illegal invasion of Ukraine’s sovereign territory.</p>\n\n<p>Prime Minister Trudeau strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. The leaders stressed that Russia’s actions threaten peace and order in Europe and around the world as well as cherished democratic values. They condemned these actions as blatant violations of international law.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte recognized the heroic efforts and sacrifices of the Ukrainian armed forces and people. They committed to pursuing efforts to mobilize the international community in support of Ukraine’s cause and explored options to further structure these efforts.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Rutte agreed to meet soon and to continue coordinating efforts to impose severe costs on Russia.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/03/canada-to-refer-the-situation-in-ukraine-to-international-criminal-court.html\">Canada to refer the situation in Ukraine to International Criminal Court</a></li>\n</ul></div>\n      "
}