{
  "path": "/en/news/news-releases/2019/12/05/prime-minister-welcomes-new-speaker-house-commons",
  "pageTitle": "Prime Minister welcomes the new Speaker of the House of Commons | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the election of Anthony Rota as the new Speaker of the House of Commons.</p>\n\n<p>Canadians expect their Members of Parliament to work together to address the issues that matter most. Canada’s democracy relies on healthy debate, trust in our public institutions, and the right of all elected representatives to be heard in the House of Commons.</p>\n\n<p>The role of the Speaker is critically important, as they impartially interpret parliamentary rules and traditions. The Speaker is also responsible for overseeing the administration and management of the House of Commons, and for fulfilling ceremonial and diplomatic duties.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Our colleague, Anthony Rota, is widely recognized and respected as a skilled Parliamentarian. With today’s vote, Members of Parliament have shown every confidence in his ability to oversee the House of Commons in a fair and impartial manner. I congratulate Speaker Rota on his election and look forward to working with him – and all members of the House – to continue delivering real, positive change for Canadians. I also thank Geoff Regan for his exceptional service to the House as Speaker over the last four years, and his tireless work to protect and strengthen Canada’s democracy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Honourable Anthony Rota is the 37th Speaker of the House of Commons.</li>\n\t<li>At the beginning of a new Parliament, the House of Commons elects a Speaker of the House. Through a secret ballot, Members of Parliament choose who among them will be Speaker.</li>\n\t<li>The Speaker also serves as the spokesperson for the House of Commons in its relations with the Senate, the Crown, and other bodies outside Parliament.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.ourcommons.ca/speaker/en/role\">Role of the Speaker</a></li>\n</ul></div>\n      "
}