{
  "path": "/en/news/statements/2018/11/28/statement-prime-minister-sustainable-blue-economy-conference",
  "pageTitle": "Statement by the Prime Minister on the Sustainable Blue Economy Conference | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to congratulate Kenya on a successful Sustainable Blue Economy Conference:</p><p>“This week, Canada, led by the Minister of Fisheries, Oceans and the Canadian Coast Guard, Jonathan Wilkinson, is proud to have co-hosted the first-ever <a href=\"http://www.dfo-mpo.gc.ca/campaign-campagne/bec-ceb/index-eng.html\">Sustainable Blue Economy Conference</a> with Kenya and Japan. The conference – held in Nairobi, Kenya – brought together more than 10,000 delegates from over 150 countries around the world.</p><p>“This conference was an example of multilateralism at its best, and showcased Canada’s leadership, working in partnership in uniting countries to face our shared challenges. Government representatives, business leaders, academics, and scientists came together to look for ways to create sustainable economic growth, promote healthy and clean waters, and build safe and resilient coastal communities. They showed that when we work together, we deliver real solutions and better results for people and the planet.</p><p>“A blue economy is about harnessing the potential of our oceans, seas, lakes, and rivers – resources that Canada is privileged to have in abundance – to make life better for all, particularly women, young people, Indigenous peoples, and people living in developing countries. It means tapping into the latest innovations, scientific advances, and best practices while building prosperity and conserving our waters for future generations.</p><p>“Building a sustainable ocean economy is a global challenge and one we have to face together. With our partners, Canada is determined to do our part.</p><p>“At the conference, Canada announced support for the United Nations Decade of Ocean Science, which will create a project office to help build scientific capacity and enhance cooperation in marine affairs through ocean research. We also announced funding for the World Economic Forum’s Friends of Ocean Action Group and for the United Nations Special Envoy for the Ocean, for the sustainable use and conservation of ocean, sea, and marine resources, in line with the <a href=\"https://sustainabledevelopment.un.org/post2015/transformingourworld\">2030 Agenda for Sustainable Development</a>. We also highlighted our <a href=\"https://www.canada.ca/en/fisheries-oceans/news/2018/11/fighting-back-against-climate-change-canada-helps-create-more-resilient-coastal-communities.html\">commitment</a> to work with the global community to support resilient coasts and coastal communities.</p><p>“These measures further build on Canada’s leadership in protecting the oceans we share. In cooperation with Indigenous and coastal communities, we are working to protect our environment and safeguard our oceans for generations to come through our $1.5 billion national <a href=\"https://www.tc.gc.ca/eng/canada-oceans-protection-plan.html\">Oceans Protection Plan</a>. Canada also made oceans protection and clean energy a top priority during our G7 Presidency, launched the <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a> to eradicate plastic pollution, and announced funding to preserve the health and resilience of our coasts and coastal communities.</p><p>“On behalf of the Government of Canada, I thank Kenya and Japan for their leadership and dedication to environmental stewardship. Climate change knows no borders. Only by working together can we build a blue economy that is prosperous and sustainable, and leaves no one behind.”</p></div>\n      "
}