{
  "path": "/en/news/readouts/2022/08/26/prime-minister-justin-trudeau-meets-nato-secretary-general-jens",
  "pageTitle": "Prime Minister Justin Trudeau meets with NATO Secretary General Jens Stoltenberg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, in 4 Wing Cold Lake, Canada’s busiest fighter base and a key hub for continental defence, Prime Minister Justin Trudeau met with the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, on the last day of his three-day visit to Canada, which included his first visit to the Canadian Arctic.</p>\n\n<p>Prime Minister Trudeau and Secretary General Stoltenberg discussed Canada’s steadfast commitment to NATO and transatlantic security, including the key roles that Canada and the binational North American Aerospace Defense Command (NORAD) play for the Alliance. The leaders also discussed Russia’s illegal and unjustifiable invasion of Ukraine, and agreed on the importance of continued military, financial, and humanitarian support to the Ukrainian government and people. The Prime Minister and the Secretary General discussed how Canada intends to meet its commitment, made in June at the NATO Summit in Madrid, to bolster its military deployment in Latvia, further reinforcing NATO’s deterrence and defence posture along its eastern flank.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s strong commitment to hosting and leading two new and important NATO entities. The Climate Change and Security Centre of Excellence and the North American Office of the Defence Innovation Accelerator for the North Atlantic (DIANA) will both play a key role in helping NATO better understand and face the challenges of tomorrow.</p>\n\n<p>The Prime Minister and the Secretary General discussed other shared priorities, including ongoing and future transatlantic security threats and challenges and the need for ambitious climate action. They committed to continuing to work together in defence of democracy and the rules-based international order.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/19/secretary-general-north-atlantic-treaty-organization-jens-stoltenberg\">Secretary General of the North Atlantic Treaty Organization Jens Stoltenberg to visit Canada</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/30/prime-minister-and-nato-leaders-strengthen-transatlantic-security\">Prime Minister and NATO Leaders strengthen transatlantic security</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.norad.mil/\">North American Aerospace Defense Command</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/centre-excellence.aspx?lang=eng\">NATO Climate Change and Security Centre of Excellence</a></li>\n</ul></div>\n      "
}