{
  "path": "/en/news/statements/2021/10/08/statement-prime-minister-50th-anniversary-canadas-multiculturalism",
  "pageTitle": "Statement by the Prime Minister on the 50th anniversary of Canada’s multiculturalism policy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 50th anniversary of Canada’s multiculturalism policy:</p>\n\n<p>“On this day in 1971, Prime Minister Pierre Elliott Trudeau announced multiculturalism as an official government policy – the first of its kind in the world – to recognize the contribution of cultural diversity and multicultural citizenship to the Canadian social fabric.</p>\n\n<p>“The diversity of Canadians is a fundamental characteristic of our heritage and identity. For generations, newcomers from all over the world, of all backgrounds, ethnicities, faiths, cultures, and languages, have been coming to Canada with the hopes of making it their home. Today, in addition to First Nations, Métis, and Inuit peoples, people from more than 250 ethnic groups call Canada home and celebrate their cultural heritage with pride – they are at the heart of our success as a vibrant, prosperous, and progressive country.</p>\n\n<p>“Canada’s multiculturalism policy was implemented based on the recommendations of the Royal Commission on Bilingualism and Biculturalism. These recommendations were made upon the urging of diverse ethnocultural groups throughout Canada, a reminder of the lengthy and ongoing struggle for equality in this country. The policy promotes respect for cultural diversity, acknowledges the freedom of all members of Canadian society to preserve, enhance, and share their own cultural heritage, and considers their cultural contributions throughout the country as essential to Canada. The policy received constitutional sanction in 1982, with an explicit recognition that the <em>Canadian Charter of Rights and Freedoms</em> should be&nbsp;interpreted in a manner consistent with the multicultural heritage of Canadians. Multiculturalism was then further enshrined into law in 1988 through the passing of the <em>Canadian Multiculturalism Act</em>,<em> </em>which was adopted unanimously by Parliament. This was an important step toward promoting the full and equitable participation of individuals of all backgrounds in shaping a strong, diverse, and inclusive society.</p>\n\n<p>“While the policy continues to give vitality to Canadian society, reflect its multicultural reality, and inspire people and countries around the world, we still have work to do to make Canada inclusive, fair, and equitable for all. This year, several disturbing and divisive incidents motivated by hate have reminded us that prejudice, systemic racism, and discrimination continue to be a lived reality for many Indigenous and Black peoples, religious minorities, and racialized communities. Many also continue to face barriers to social and economic participation, which have only gotten worse during the COVID-19 pandemic.</p>\n\n<p>“Today, Canada strives to be a respectful, prosperous, and compassionate country thanks to the tremendous contributions of people of all backgrounds who call it home. As we continue to build a more inclusive and open country, we recognize that a multicultural society is a work in progress. We must continue to promote the values of respect and inclusion that the <em>Canadian Multiculturalism Act</em>, the <em>Charter</em>, human rights legislation, and many other commitments have sought to promote. Along with Canada’s strong multiculturalism policy, we must also recognize the rich cultures of First Nations, Inuit, and Métis peoples, and our commitments to respecting their Aboriginal, treaty, and human rights and advancing reconciliation. This requires us to confront painful truths about our history and society, learn from them, and take meaningful action together to address systemic discrimination and ensure everyone is treated with respect and able to participate equitably in economic, social, cultural, and political life in Canada.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to find out more about <a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/multiculturalism.html\">multiculturalism</a> in Canada, celebrate the cultural diversity that makes us who we are, and continue to learn from one another. By appreciating our differences as the source of our strength and resilience, we can build a truly inclusive, vibrant, and multicultural society.”</p></div>\n      "
}