{
  "path": "/en/news/readouts/2022/12/07/prime-minister-justin-trudeau-meets-federation-canadian-municipalities-big",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Federation of Canadian Municipalities’ Big City Mayors’ Caucus | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau attended a roundtable discussion with the Big City Mayors’ Caucus, a group of the Federation of Canadian Municipalities (FCM) representing 23 of Canada’s biggest cities.</p>\n\n<p>Prime Minister Trudeau and the Mayor of Montréal, Valérie Plante, opened the discussion by marking&nbsp;the 33rd anniversary of the&nbsp;École Polytechnique de Montréal&nbsp;1989 tragedy on this National Day of Remembrance and Action on Violence against Women. The Prime Minister and mayors also acknowledged the circumstances around recent news of gender-based violence against Indigenous women in Manitoba, and the anniversary of the Halifax explosion of 1917.</p>\n\n<p>The Prime Minister and mayors discussed shared priorities of the federal and municipal governments. This includes improving access to affordable housing and child care, fighting homelessness, supporting people’s mental health and well-being, strengthening public transit and infrastructure, increasing public safety, and continuing the fight against climate change. They committed to working together on these priorities to build stronger and more inclusive communities.</p>\n\n<p>Mayors welcomed recent announcements by the federal government on the National Adaptation Strategy, to foster resilient communities and strengthen Canada’s economy. They underlined how the Strategy responds to the recommendations of the FCM by investing directly in municipalities through the FCM’s Green Municipal Fund, to help cities better assess and respond to climate risks. Mayors also expressed their interest in continuing to work together and with the federal government to boost the resilience of our cities and accelerate Canada’s transition toward net-zero.</p>\n\n<p>On housing affordability, Prime Minister Trudeau highlighted the recent launch of the third round of the Rapid Housing Initiative and the federal government’s plans to move forward with a $4&nbsp;billion Housing Accelerator Fund, announced in Budget&nbsp;2022, to help municipalities across Canada remove barriers, including regulatory delays, and build housing more quickly in an ambitious and innovative manner.</p>\n\n<p>On transit, the Prime Minister and mayors discussed permanent public transit funding and its ability to allow municipalities to plan for years ahead. The Prime Minister reiterated that the federal government will continue engaging and working with municipalities on the development of new public transit programs, to create jobs and opportunities for Canadians and improve their quality of life.</p>\n\n<p>The Prime Minister and mayors agreed to&nbsp;remain in close contact and to continue working together on these and other shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://fcm.ca/en\">Federation of Canadian Municipalities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/12/06/statement-prime-minister-national-day-remembrance-and-action-violence\">Statement by the Prime Minister on the National Day of Remembrance and Action on Violence against Women</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/national-adaptation-strategy.html\">Canada’s National Adaptation Strategy: Building Resilient Communities and a Strong Economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/08/30/creating-nearly-17000-homes-canadians-across-country\">Creating nearly 17,000 homes for Canadians across the country</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/making-housing-more-affordable.html\">Budget&nbsp;2022: Making Housing More Affordable</a></li>\n</ul></div>\n      "
}