{
  "path": "/en/news/statements/2019/10/24/statement-prime-minister-united-nations-day",
  "pageTitle": "Statement by the Prime Minister on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:</p>\n\n<p>“Today, on United Nations Day, we are reminded of what we can achieve when the world works together. We also reflect on major global challenges like the climate crisis, inequality, and violent extremism.</p>\n\n<p>“In an unpredictable and changing world, it is more important than ever that we join forces to meet these challenges and build a better future for our children and grandchildren.</p>\n\n<p>“For over 70 years, the United Nations (UN) has brought the international community together to address difficult issues that transcend borders. Staff and volunteers from around the world support UN programs, funds, and agencies dedicated to helping the world’s most vulnerable people.</p>\n\n<p>“Canada is a proud founding member of the UN, and will continue to engage partners from around the world to achieve global security and prosperity. We have renewed our longstanding commitment to UN peacekeeping, and have taken a leadership role to meet the changing nature of conflict and peacebuilding, including through innovative approaches such as the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations</a>.</p>\n\n<p>“As we work closely with the UN to meet the challenges of the 21st century, we remain committed to achieving the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">Sustainable Development Goals</a> at home and abroad to help make the world more just, prosperous, safe, and sustainable.</p>\n\n<p>“We are committed to playing a positive and constructive role at the United Nations. This is why Canada has submitted its candidacy to serve on the <a href=\"https://www.international.gc.ca/campaign-campagne/unsc-csnu/index.aspx?lang=eng\">UN Security Council for 2021-22</a>.</p>\n\n<p>“As we approach the United Nations’ 75th anniversary next year, I invite Canadians to reflect on everything the UN has accomplished and thank all UN staff and volunteers for their dedication and selfless service.”</p></div>\n      "
}