{
  "path": "/en/news/news-releases/2019/02/11/prime-minister-announces-investments-safer-more-affordable-housing",
  "pageTitle": "Prime Minister announces investments for safer, more affordable housing in Vancouver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves to have a safe and affordable place to call home. That is why the Government of Canada launched Canada’s very first National Housing Strategy – a once-in-a-generation $40 billion investment to fight homelessness and improve access to affordable housing from coast to coast to coast.</p><p>The Prime Minister, Justin Trudeau, today highlighted an investment of $40 million through the National Housing Strategy for a project to develop new, affordable housing in Vancouver. The new project, which will be completed this year, will include 115 rental housing units located close to public transit, schools, and local services.</p><p>The Prime Minister also announced funding for three new projects to build new affordable homes, provide housing for people in transition, and expand shelter capacity in Vancouver.</p><p>Through the Affordable Housing Innovation Fund, the Government of Canada is helping Vancity credit union to provide financing for new affordable rental housing developments, which will create as many as 2,500 new homes for middle class families in Vancouver and across the province.</p><p>The Fund will also help the city’s most vulnerable find a place to call home, by providing funding to the Vancouver Affordable Housing Agency for a temporary modular housing initiative. This will help lower-income residents and those experiencing homelessness to transition into longer-term housing. Once completed, this initiative is expected to provide over 600 pre-constructed units, which can be easily relocated and reassembled across Vancouver as needed.</p><p>The Government of Canada is also supporting the redevelopment of the Union Gospel Mission’s Women and Families Centre in Vancouver’s Downtown Eastside community. The Centre will expand to over 60 units, providing a safe shelter for women who are recovering from addiction.</p><p>By making smart investments in housing initiatives that put people first, the Government of Canada is making a real difference in the lives of Canadians from coast to coast to coast.</p><h2>Quote</h2><blockquote><p>“Having a roof over our heads is something many of us take for granted, but for others, it’s not only top of mind, it’s everything. By investing in affordable rental housing, temporary shelters for people who are living on the streets, and support centres for women battling addiction, we’re not just investing in our communities – we’re investing in people. Because every Canadian deserves a safe and affordable place to call home.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>In 2017, the Government of Canada announced a 10-year, $40 billion National Housing Strategy that will help reduce homelessness and improve the availability and quality of housing for Canadians in need. The strategy sets clear goals to remove 530,000 Canadians from housing need and reduce chronic homelessness.</li><li>Through the Affordable Housing Innovation Fund, the Government of Canada is contributing $6 million to Vancity’s Pre-construction Equity Loan Fund to support the development of new affordable housing. The Fund provides low interest funding for affordable housing projects, offering a lower rate than other financial institutions.</li><li>The Government of Canada is providing $1.5 million through the Affordable Housing Innovation Fund to the Vancouver Affordable Housing Agency, for an initiative that assembles temporary housing in underused sites in the city, using factory-built housing units that can be relocated and reassembled as needed.</li><li>The Affordable Housing Innovation Fund is providing $200 million over five years for projects that showcase new funding models and innovative building techniques, lowering the cost and risks of financing affordable housing projects.</li><li>Through the National Housing Co-Investment Fund, the Government of Canada has a financial commitment of over $11.3 million to redevelop a new Women and Families Centre in the Downtown Eastside of Vancouver that provides temporary housing to women recovering from addiction. The new centre will expand to over 60 units, and will be more affordable, accessible, and energy efficient.</li><li>The National Housing Co-Investment Fund provides low-cost loans and financial contributions to support and develop affordable housing that is energy efficient and accessible.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.placetocallhome.ca/\">Canada’s National Housing Strategy</a></li><li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs/affordable-housing-innovation-fund\">Affordable Housing Innovation Fund</a></li><li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs/co-investment-fund---new-construction-stream\">National Housing Co-Investment Fund</a></li></ul></div>\n      "
}