{
  "path": "/en/news/statements/2020/10/10/statement-prime-minister-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister for World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Mental Health Day:</p>\n\n<p>“For many of us, the issue of mental health hits close to home. Whether it’s something that we personally deal with or something that we’ve witnessed a child, co-worker, friend, or loved one struggle through, Canadians face the challenges of mental health and see the crucial role that it plays in our lives every day.</p>\n\n<p>“Today, on <a href=\"https://www.who.int/campaigns/world-mental-health-day/world-mental-health-day-2020\">World Mental Health Day</a>, we have an opportunity to raise awareness about the importance of fostering open discussions around mental health, so we can fight stigma and help make sure everyone has access to the quality care they need. Mental health services and supports should be available for everyone, and this year, as Canadians deal with increased isolation due to the COVID-19 global pandemic, proper resources are even more important.</p>\n\n<p>“To ensure no one feels alone during these challenging times, the Government of Canada is taking action to provide critical services to those most at risk, while helping all Canadians access mental health services. This spring, we announced an <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/03/prime-minister-announces-virtual-care-and-mental-health-tools\">investment of $240.5 million</a> to expand capacity to deliver health care virtually, including the <a href=\"https://ca.portal.gs/\">Wellness Together Canada</a> portal that provides free access to mental health and substance use supports for all Canadians. We also dedicated <a href=\"https://pm.gc.ca/en/news/backgrounders/2020/07/16/priorities-safely-restart-canadas-economy\">$500 million</a> through the Safe Restart Agreement to address immediate needs and gaps in the support and protection of people experiencing challenges related to mental health, substance use, or homelessness. And, as we build a fairer and more resilient Canada, the Government will further increase mental health resources, so all Canadians get the care they need.</p>\n\n<p>“The pandemic has disproportionately affected those who are more likely to experience its mental health effects, such as women, racialized Canadians, Indigenous peoples, and children and youth. That’s why the government has made investments to help Indigenous communities adapt and expand mental wellness services. We also provided funding for organizations to promote mental health in our communities and to tackle systemic challenges and barriers to getting support, including those faced by Black Canadians.</p>\n\n<p>“In addition, we have supported women and children fleeing violence by providing funding to women’s shelters, and have increased counselling resources for children and youth through funding to Kids Help Phone. All Canadians should be able to receive the care and services they need without facing barriers, and we are committed to continuing to ensure people have support in these difficult times.</p>\n\n<p>“World Mental Health Day is also a chance to celebrate the people who are working hard to further make high-quality mental health care a reality around the world. We recognize the voices of those living with a mental health challenge, and their loved ones, whose stories lie at the core of our efforts to improve mental health care for all. We all have a role to play to create a culture where we can talk openly about mental health, and change attitudes that perpetuate discrimination against people experiencing mental health challenges. That starts with being kind to one another, and showing compassion and understanding for those around us – because you can’t always see struggles that some people are facing.</p>\n\n<p>“On behalf of the Government of Canada, I thank all Canadians who are caring for those dealing with mental health challenges. I also thank all those – including my mother Margaret and my wife Sophie – who are open and brave enough to share their personal struggles, and who contribute to the public discussion around mental health. Together, we can be inspired by their dedication to the cause, and build a Canada where no one is left behind.”</p></div>\n      "
}