{
  "path": "/en/news/news-releases/2022/02/11/canada-joins-international-initiatives-cut-plastic-pollution-and",
  "pageTitle": "Canada joins international initiatives to cut plastic pollution and protect our oceans | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>No one wants to see plastic litter at the park, on a beach, or in our waterways. That’s why Canada is continuing to take strong action to reduce plastic pollution, protect biodiversity, and promote healthy, resilient oceans and coastal communities, here at home and around the world.</p>\n\n<p>The Prime Minister, Justin Trudeau, virtually joined other world leaders today at the <a href=\"http://oneoceansummit.fr/en/\">One Ocean Summit</a>, hosted by France, to announce Canada will join international partnerships and initiatives toward reducing plastic pollution and protecting our oceans.</p>\n\n<p>These partnerships and initiatives include:</p>\n\n<ul>\n\t<li>Joining the High Ambition Coalition on Biodiversity Beyond National Jurisdiction to advance the protection of marine biodiversity.</li>\n\t<li>Endorsing the <a href=\"https://ellenmacarthurfoundation.org/global-commitment/overview\">New Plastics Economy Global Commitment</a>, which unites more than 500 businesses and governments committed to taking prompt action to reduce plastic pollution.</li>\n\t<li>Supporting the development of a new, ambitious, and legally binding global agreement on plastics at the United Nations Environment Assembly that takes a full lifecycle approach to addressing plastic pollution.</li>\n</ul>\n\n<p>These partnerships complement the many actions that Canada has already taken to eliminate plastic waste and protect our oceans. Here at home, the government continues to lead the world by example by tackling plastic pollution through a ban on harmful single‑use plastics, establishing recycled content requirements, and working with provinces and territories to make plastic producers responsible for their plastic waste. The government is also supporting ocean health through the development of a new, government-wide&nbsp;<a href=\"https://www.dfo-mpo.gc.ca/campaign-campagne/bes-seb/index-eng.html\">Blue Economy Strategy</a>.</p>\n\n<p>Canada is a leader on the world stage through ongoing work to champion the <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a> and membership in the <a href=\"https://www.oceandecade.org/ocean-decade-alliance/\">Ocean Decade Alliance</a>.</p>\n\n<p>With the longest coastline in the world and one quarter of the world’s freshwater, Canada is uniquely positioned to lead in reducing plastic pollution and protecting ocean health.&nbsp;The government will continue to work with partners at home and around the world to protect the environment and build a healthy future for generations to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians know that our natural spaces are something to be cherished, not littered with trash. As we take action here at home to ban harmful single-use plastics, we’re stepping up on the world stage too. That’s why Canada is joining our international partners in the fight against ocean pollution. By working together to reach a future free from plastic waste, we are building a clean, healthy tomorrow for generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“With the world’s longest coastline, bordering three oceans that are critical to the lives and livelihood of many Canadians, Canada is an ocean nation. As a coastal Canadian myself, I know how critical it is that we work together to protect our shared waters from the devastating impacts of plastic pollution. That’s why, along with our partners, our government is committed to reducing plastic pollution, and ensuring the conservation and regeneration of our ocean ecosystems for future generations.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<blockquote>\n<p>“Plastic pollution in our oceans is a growing problem that we must work together urgently to address. Our government has made it a top priority to eliminate plastic waste and pollution, including through a ban on harmful single-use plastics. We are working to move Canada toward a circular economy that keeps plastics in our economy and out of landfills. Canada is championing the Ocean Plastics Charter, and we will continue working with international partners to achieve an ambitious, legally binding global agreement on plastics.”</p>\n\n<footer class=\"default\">The Hon. Steven Guilbeault, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Canada-led Ocean Plastics Charter, launched during Canada’s G7 Presidency in 2018, takes a comprehensive lifecycle approach to addressing plastic pollution and waste, and lays the groundwork to ensure plastics are designed for reuse and recycling. To date, the Charter has been endorsed by almost 30 governments and over 70 companies.</li>\n\t<li>In 2016, the Government of Canada launched the $1.5&nbsp;billion&nbsp;<a href=\"https://www.tc.gc.ca/en/initiatives/oceans-protection-plan/report-canadians-investing-coasts-oceans-protection-plan.html\">Oceans Protection Plan</a>, the largest investment ever to make Canada’s coasts and waterways safer and healthier, partnering with coastal and Indigenous communities.</li>\n\t<li>Canada is committed to conserving 25 per cent of its land and waters by 2025, and 30&nbsp;per cent by 2030, and has made a historic investment of nearly $3.5&nbsp;billion to advance these goals.</li>\n\t<li>Every year, plastic pollution costs up to $2.5&nbsp;trillion in ecological, economic, and social impacts.</li>\n\t<li>Canada’s proposed ban on harmful single‑use plastics would prevent more than 23,000 tonnes of plastic pollution from entering the environment over a ten-year period – the equivalent of one million garbage bags of litter.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://oneoceansummit.fr/en/\">One Ocean Summit 2022</a></li>\n\t<li><a href=\"https://ellenmacarthurfoundation.org/global-commitment/overview\">New Plastics Economy Global Commitment</a></li>\n\t<li><a href=\"https://www.dfo-mpo.gc.ca/campaign-campagne/bes-seb/index-eng.html\">Blue Economy Strategy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/reduce-plastic-waste.html\">Plastic waste and pollution reduction</a></li>\n\t<li><a href=\"https://www.oceandecade.org/ocean-decade-alliance/\">Ocean Decade Alliance</a></li>\n\t<li><a href=\"https://www.tc.gc.ca/en/initiatives/oceans-protection-plan/report-canadians-investing-coasts-oceans-protection-plan.html\">Oceans Protection Plan</a></li>\n</ul></div>\n      "
}