{
  "path": "/en/news/readouts/2021/09/22/prime-minister-justin-trudeau-attends-global-covid-19-summit-hosted",
  "pageTitle": "Prime Minister Justin Trudeau attends the Global COVID-19 Summit hosted by the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated in a virtual Global COVID-19 Summit hosted by the President of the United States of America, Joe Biden, entitled Ending the Pandemic and Building Back Better Health Security to Prepare for the Next.</p>\n\n<p>Speaking live during the Summit, Prime Minister Trudeau joined other world leaders in committing to vaccinate at least 70 per cent of the world by this time next year. The Prime Minister also spoke about Canada’s commitment to support equitable access to COVID-19 vaccines, tests, and treatments, including through significant financial support for vaccines and donations to countries.</p>\n\n<p>In order to get this done, Canada will build on the important progress we have made so far, and focus on increasing the production, availability, and delivery of vaccines. To date, Canada has contributed more than $2.5&nbsp;billion to help address this crisis globally. We have also committed to sharing tens of millions of vaccine doses with the rest of the world, including through the COVAX Facility.</p>\n\n<p>Prime Minister Trudeau affirmed Canada’s willingness to continue working with its international partners to strengthen global health security, and ensure that the world can better respond to and recover from pandemics and other health crises in the future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/09/21/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/19/prime-minister-concludes-productive-g7-leaders-meeting\">Prime Minister concludes productive G7 Leaders’ meeting</a></li>\n</ul></div>\n      "
}