{
  "path": "/en/news/readouts/2023/04/28/prime-minister-justin-trudeau-meets-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau meets with the President of the European Commission, Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of the European Commission, Ursula von der Leyen, at the Global Citizen NOW Summit in New York City, United States of America.</p>\n\n<p>The leaders discussed Russia’s ongoing illegal and unjustifiable invasion of Ukraine and its impact on the global cost of living and food insecurity. They agreed to continue to pursue joint efforts with Allies and G7 partners to support those most affected by the consequences of Russian aggression, including in the Global South.</p>\n\n<p>The Prime Minister and President also discussed avenues to further advance Canada-European Union collaboration in the Indo-Pacific and agreed on the importance of transatlantic unity in the region.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen reaffirmed their strong commitment to continued and close cooperation.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/07/joint-press-release-occasion-visit-canada-european-commission-president-ursula-von-der-leyen\">Joint press release on the occasion of the visit to Canada of European Commission President Ursula von der Leyen</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/21/prime-minister-justin-trudeau-meets-president-european-commission-ursula\">Prime Minister Justin Trudeau meets with President of the European Commission Ursula von der Leyen</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.globalcitizen.org/en/info/now/\">Global Citizen NOW</a></li>\n</ul></div>\n      "
}