{
  "path": "/en/news/readouts/2022/05/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy,<strong> </strong>to reconfirm Canada’s strong ongoing support for Ukraine against Russia’s military aggression.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for his recent visit to Kyiv and expressed his gratitude for Canada’s unwavering support.</p>\n\n<p>The Prime Minister and President discussed Russia’s ongoing indiscriminate attacks and the immense suffering they have imposed on both Ukrainian soldiers and civilians. President Zelenskyy thanked Prime Minister Trudeau for today’s announcement that Canada would send significant amounts of artillery ammunition to Ukraine.</p>\n\n<p>The two leaders discussed how Canada could continue to support Ukraine while working with like-minded partners to address the broader global impacts of Russia’s illegal and unjustifiable war. This includes sharply rising fuel prices and an unfolding global food security crisis.</p>\n\n<p>The Prime Minister commended the President’s personal leadership in defence of our shared values. He highlighted the courage of the Ukrainian people in coming together to defend their country and their freedoms against Russia’s war of aggression. The two leaders agreed to keep in close touch.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/09/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/08/prime-minister-visits-kyiv-ukraine\">Prime Minister visits Kyiv, Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/agriculture-agri-food/news/2022/05/pathways-towards-sustainable-food-systems-in-times-of-crises.html\">Pathways towards sustainable food systems in times of crises</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}