{
  "path": "/en/news/readouts/2020/06/12/prime-minister-justin-trudeau-speaks-prime-minister-fiji-frank-bainimarama",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Fiji Frank Bainimarama | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today,&nbsp;Prime Minister Justin Trudeau spoke with the Prime Minister of Fiji, Frank Bainimarama.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Bainimarama reaffirmed the close and&nbsp;longstanding friendship between Canada and Fiji. This partnership is anchored in strong people-to-people ties, a commitment to multilateralism, and shared priorities, including fighting climate change, responsible oceans governance, and economic security for all.</p>\n\n<p>The leaders spoke of opportunities to deepen this relationship and enhance cooperation on these shared priorities.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Bainimarama&nbsp;also discussed the COVID-19 pandemic, including the impact of the virus on the Pacific region.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_fiji-fidji.aspx?lang=eng\">Canada - Fiji Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launched the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}