{
  "path": "/en/news/news-releases/2018/06/07/prime-minister-announces-even-closer-collaboration-france",
  "pageTitle": "Prime Minister announces even closer collaboration with France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau announced that the President of the French Republic, Emmanuel&nbsp;Macron, today concluded the bilateral portion of his first visit to Canada as president. The two leaders will now travel to the Charlevoix region of Quebec to take part in the G7 Summit.</p><p>During the visit, Prime Minister Trudeau and President Macron further strengthened our two countries’ close and historic relationship and worked together on issues that matter to Canadians and French people alike. The two leaders committed to set up the Fonds Transatlantique (Transatlantic Fund), which will invest just over $120&nbsp;million (€75&nbsp;million) in French and Canadian companies that want to develop their business on the other continent. The fund will promote economic growth and create good, middle class jobs on both sides of the Atlantic.</p><p>Prime Minister Trudeau and President Macron also announced the signing of the Canada-France Statement on Artificial Intelligence, which calls for the creation of an international study group on artificial intelligence made up of experts from government, industry, and civil society. The group will be mandated to become the global reference on issues related to artificial intelligence, a field that is increasingly affecting all human activities and that will continue to have a significant influence on economic growth and the labour market.</p><p>Prime Minister Trudeau and President Macron also established the Canada-France Action Plan on International Assistance and Sustainable Development, guided by Canada’s Feminist International Assistance Policy and France’s international strategy on gender equality. This action plan will launch a periodic and in-depth bilateral dialogue on international assistance issues. The plan will help our two countries to promote issues of mutual importance within international organizations, as well as to identify and bring to life initiatives that advance shared priorities.</p><p>Through a joint statement on multilateralism, the two leaders reaffirmed the strong ties between Canada and France, as well as their commitment to shared values like liberty, democracy, respect for human rights, and the rule of law. They also restated their commitment to fight climate change and to promote democratic values, free and open trade, and gender equality.</p><p>Science, technology, and innovation are essential for economic growth and the prosperity of both countries, and international cooperation in research plays a key role. That is why Canada and France have agreed to work together to increase the mobility of students and researchers between the two countries. Canada and France also signed a letter of intent to launch discussions and establish official agreements in the future, to encourage more students, researchers, and industry partners from both countries to take advantage of the programs in place.</p><p>To continue deepening our bilateral ties and maintain this momentum at the highest political level, France and Canada committed to create a Franco-Canadian Council of Ministers, working with the President of the French Republic and the Prime Minister of Canada. The Council of Ministers will meet every two years to report on strengthened cooperation and develop joint initiatives.</p><p>The Prime Minister also used his discussion with President Macron to reiterate Canada’s support of Michaëlle Jean as the Secretary General of the Organisation Internationale de la Francophonie (OIF), emphasizing her leadership in the OIF’s efforts to advance gender equality, support young people, and promote democratic values.</p><h2>Quote</h2><blockquote><p>“My discussions with President Macron over the past few days are a testament to Canada and France’s strong and historic relationship. From the economy to jobs to the environment, our countries share an ambitious vision for a better future for everyone. Thanks to the Canada-European Union Comprehensive Economic and Trade Agreement, as well as new common initiatives, our collaboration is even stronger. I look forward to working even more closely with President Macron to grow the middle class and build economies that work for everyone.”<br> — <cite> Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Highlights</h2><ul><li>Prime Minister Trudeau and French President Macron first met at the NATO Summit in Brussels in May 2017. Their first bilateral meeting took place on the margins of the G7 Summit in Taormina, Italy, the same month.</li><li>Canada and France enjoy excellent bilateral relations based on a common history, culture, and values.</li><li>France is Canada’s ninth largest merchandise trading partner and its fourth&nbsp;largest export market in the European Union. In 2017, bilateral trade between the two countries totalled $9.6 billion, with Canadian exports to France rising to $3.4&nbsp;billion.</li><li>At the end of 2017, Canadian direct investment in France was valued at $8&nbsp;billion, while French direct investment in Canada was valued at $8.2&nbsp;billion.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/europe/2018-06-07-france_ai-ia_france.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-France Statement on Artificial Intelligence</span></a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/europe/2018-06-07-france-multilateral-multilaterales.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-France Statement on Multilateralism</span></a></li><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/europe/2018-06-07-france_ap-pa_france.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-France Action Plan on International Assistance and Sustainable Development</span></a></li><li><a href=\"/en/news/backgrounders/2018/04/16/canada-france-climate-and-environment-partnership\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-France Climate and Environment Partnership</span></a></li><li><a href=\"/en/news/backgrounders/2018/04/16/joint-declaration-cultural-diversity-and-digital-space\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Joint Declaration on Cultural Diversity and the Digital Space</span></a></li><li><a href=\"http://international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Comprehensive Economic and Trade Agreement</span></a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\"><span lang=\"EN-CA\" xml:lang=\"EN-CA\">Canada-France Relations</span></a></li></ul></div>\n      "
}