{
  "path": "/en/news/readouts/2020/04/09/prime-minister-justin-trudeau-speaks-newfoundland-and-labrador-premier",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Newfoundland and Labrador Premier Dwight Ball | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Newfoundland and Labrador Premier Dwight Ball to discuss the evolving COVID-19 situation.</p>\n\n<p>Both leaders reaffirmed their commitment to continued collaboration and coordination between their respective governments to address COVID-19. They discussed the measures announced by the Government of Newfoundland and Labrador and the Government of Canada, including Canada’s COVID-19 Economic Response Plan, to support workers and businesses.</p>\n\n<p>They also discussed Newfoundland and Labrador’s fiscal and economic situation and the actions taken by the Government of Canada and the Bank of Canada to support Canadian financial markets. The Government of Canada is working around the clock on the situation and will continue to support provinces and territories to ensure that all governments can respond to the COVID-19 crisis.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of Newfoundlanders and Labradorians and all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}