{
  "path": "/en/news/readouts/2022/09/18/prime-minister-justin-trudeau-meets-prime-minister-australia-anthony",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Australia Anthony Albanese | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Australia, Anthony Albanese. Both were in London for the State Funeral for Her Majesty Queen Elizabeth II. The leaders noted the Queen’s exceptional life-long commitment to service that inspired people around the world.&nbsp;</p>\n\n<p>The two prime ministers condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and discussed their commitment to further supporting the country.</p>\n\n<p>The prime ministers reaffirmed their shared commitment to combatting climate change. The leaders agreed to strengthen their cooperation on climate action, including to ensure a successful 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, and in the lead up to the 27th meeting of the Conference of the Parties (COP27) to the United Nations Framework Convention on Climate Change. The prime ministers also discussed cooperation on the global supply of critical minerals.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Albanese discussed recent developments in China and the broader Indo-Pacific region. They reaffirmed the importance of working together with partners and allies to promote regional stability, and uphold the rules-based international order, including within the G20.</p>\n\n<p>The two leaders committed to continue their close cooperation on shared priorities, including advancing gender equality, achieving meaningful reconciliation with Indigenous Peoples, and securing economic growth that benefits everyone.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/australia-australie/relations.aspx?lang=eng\">Canada-Australia relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/08/statement-prime-minister-passing-her-majesty-queen-elizabeth-ii\">Statement by the Prime Minister on the passing of Her Majesty Queen Elizabeth&nbsp;II</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/commemoration-her-majesty-the-queen/book.html\">Book of condolences for Her Majesty Queen Elizabeth II</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/07/01/prime-minister-justin-trudeau-meets-prime-minister-australia-anthony\">Prime Minister Justin Trudeau meets with Prime Minister of Australia Anthony Albanese</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN conference on biodiversity: COP15 in Montréal</a></li>\n</ul></div>\n      "
}