{
  "path": "/en/news/news-releases/2018/12/07/prime-minister-meets-national-indigenous-leaders-and-first-ministers",
  "pageTitle": "Prime Minister meets with National Indigenous Leaders and First Ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with national Indigenous leaders and hosted a meeting of First Ministers with national Indigenous leaders.</p><p>The Prime Minister first met privately with National Chief of the Assembly of First Nations Perry Bellegarde, President of Inuit Tapiriit Kanatami Natan Obed, and President of the Métis National Council Clément Chartier. The national Indigenous leaders spoke to the Prime Minister about their respective socio-economic priorities for First Nations, Inuit, and Métis peoples.</p><p>The three national Indigenous leaders then attended a meeting of First Ministers hosted by the Prime Minister. First Ministers and Indigenous leaders discussed opportunities for concrete federal, provincial, and territorial actions to support economic development, growth, and prosperity for Indigenous communities and businesses.</p><p>In his opening remarks, the Prime Minister stressed that the economic inclusion of Indigenous peoples is fundamental to Canada’s future. He also noted that the economic growth and prosperity of Indigenous peoples is integral to reconciliation and essential for the self-determination of Indigenous communities.</p><p>After an open discussion among First Ministers and the national Indigenous leaders, the Prime Minister closed the meeting by highlighting that economic reconciliation with Indigenous peoples will require partnerships with federal, provincial, territorial, and Indigenous governments, as well as collaboration between Indigenous communities, all orders of government, and the private sector.</p><p>Today’s meetings with the national Indigenous leaders are in addition to the Permanent Bilateral Mechanisms with the Assembly of First Nations and First Nations, the Inuit Tapiriit Kanatami and the four Inuit Nunangat Regions, and the Métis National Council and its governing members.</p></div>\n      "
}