{
  "path": "/en/news/statements/2017/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p><p><span lang=\"EN\" xml:lang=\"EN\">“Happy New Year, Canada!</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“This past year, we marked the 150<sup>th</sup> anniversary of Confederation, and loo</span>ked back on <span lang=\"EN\" xml:lang=\"EN\">the remarkable achievements Canadians have made </span>throughout our history<span lang=\"EN\" xml:lang=\"EN\">. We recommitted ourselves to our shared values, and we celebrated the diversity that makes us </span>strong<span lang=\"EN\" xml:lang=\"EN\">. Millions of people – of every background, origin, culture, and faith – have come together to make Canada the diverse, open, and prosperous country it is today.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">“The 150<sup>th</sup> anniversary of Confederation was also a chance to reflect on the </span>moments Canada has not lived up to its ideals. Indigenous Peoples, and many Canadians, have faced prejudice and oppression in our history. In the New Year and the years to come, we must continue to work to right these wrongs, and make sure everyone has a real and fair shot at success.</p><p>“In 2017, we made real progress toward these goals. Our government took action to build a better future for families across Canada – from taking steps to strengthen the Canada Child Benefit and investing in early learning and child care, to creating new opportunities for young people, to advancing reconciliation with Indigenous Peoples and protecting the rights of LGBTQ2 communities. We made gender equality a priority at home and abroad, <span lang=\"EN\" xml:lang=\"EN\">and </span>took strong steps to fight climate change and protect our environment, for generations to come. We launched Canada’s first ever National Housing Strategy and lowered the small business tax rate – and together, we continued to create jobs, grow our economy, and strengthen the middle class.</p><p>“But we still have a lot of hard work left to do. In 2018, let’s continue to celebrate the values that unite us – openness, compassion, equality, and inclusion. Let’s move forward together, put those values into practice, and work to build a better future for all of us.</p><p><span lang=\"EN\" xml:lang=\"EN\">“On behalf of the Government of Canada, Sophie and I wish you a wonderful night and all the best in 2018.”</span></p></div>\n      "
}