{
  "path": "/en/news/news-releases/2020/04/28/prime-minister-releases-joint-statement-first-ministers-restarting",
  "pageTitle": "Prime Minister releases joint statement by First Ministers for restarting the economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since the start of the COVID-19 pandemic, all orders of government have been working together to slow and contain the spread of the virus. As the first wave of the virus’ activity passes, provincial and territorial governments will move at their own pace to safely restore economic activity within their jurisdictions, while protecting the health of Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the federal, provincial, and territorial governments have come together and agreed to a set of common principles for restarting the Canadian economy, based on shared understanding and appreciation of what science and experts are telling us. This statement identifies the criteria that need to be in place before we can go back to work and school, or see neighbours and friends.</p>\n\n<p>This statement acknowledges the importance of restarting the economy through a gradual approach that protects the health of Canadians, including high-risk groups, as well as the need to ensure public health capacity for future waves of the virus, while at the same time continuing to support a range of economic sectors and Canadian workers.</p>\n\n<p>The statement acknowledges that provinces and territories will take different steps at different times in order to ease restrictions, reflecting the specific circumstances in each jurisdiction. The statement identifies four main principles, including taking a science and evidence-based approach to decision-making, coordination and collaboration between all jurisdictions, continued accountability and transparency of all governments, and flexibility and proportionality as information changes over time.</p>\n\n<p>This statement also identifies the criteria and measures that need to be in place in order to begin to take steps to restart the economy:</p>\n\n<ul>\n\t<li>COVID-19 transmission is controlled, so new cases are contained at a level that our health care system can manage.</li>\n\t<li>Sufficient public health capacity is in place to test, trace, isolate, and control the spread of the virus.</li>\n\t<li>Expanded health care capacity exists to support all needs, including COVID-19 and non-COVID-19 patients.</li>\n\t<li>Supports are in place for vulnerable groups, communities, and key populations. This includes the protection of seniors, residents of group living facilities, workers in close quarters, homeless people, and Indigenous people and those living in remote locations, health care workers and other essential workers, and inmates.</li>\n\t<li>Support and monitoring of workplace protocols are in place to keep Canadians safe at their jobs, and prevent the introduction and spread of COVID-19.</li>\n\t<li>Restrictions on non-essential travel are&nbsp;eased and managed in a coordinated manner.</li>\n\t<li>Communities are supported in managing local disease activity, including in child care, schools, and public transportation, and industry and economic sectors are engaged to support the health of Canadians, reduced viral activity, and protection of the economy as it restarts.</li>\n</ul>\n\n<p>As we continue to work collaboratively to get things back to normal, our top priority is keeping all Canadians safe during this challenging time.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Our priority is keeping all Canadians safe, while getting back to normal as much as we can. That’s why First Ministers have worked on a set of shared principles to gradually restart the economy, based on science and evidence-based decision-making. Together, we will continue to work collaboratively to keep Canadians safe and healthy, and protect our economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our response to this pandemic has been a true Team Canada effort. All orders of government have been working closely together to keep Canadians safe. Restarting Canada’s economic engine will require a coordinated approach, given different parts of the country are at different points in the fight against COVID-19. We will not squander the gains we have fought for, and sacrificed so much for. We must base our decisions on science and we must put the safety of Canadians first.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2020/04/24/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address\">Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19</a></li>\n</ul></div>\n      "
}