{
  "path": "/en/news/readouts/2020/03/25/prime-minister-justin-trudeau-speaks-president-senegal-macky-sall",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Senegal Macky Sall | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Senegal, Macky Sall, about the latest developments in the COVID-19 pandemic.</p>\n\n<p>President Sall wished Sophie Grégoire Trudeau a speedy recovery.</p>\n\n<p>Prime Minister Trudeau expressed solidarity with President Sall and all Senegalese as they take the necessary measures to contain COVID‑19 and protect the health and safety of people in the country.</p>\n\n<p>The two leaders spoke about the need for early and aggressive action, both domestically and internationally, to change the trajectory of the disease.&nbsp;They also agreed on the importance of reinforcing health, financial, and economic systems in Africa.</p>\n\n<p>The Prime Minister offered Canada’s support through advice and international assistance to help vulnerable countries respond to COVID-19’s devastating impacts.</p>\n\n<p>This call builds upon the strong relationship between Canada and Senegal, recently strengthened through Prime Minister Trudeau’s productive visit to Senegal in February.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/21/prime-minister-announces-efforts-bring-canadians-home-abroad\">Prime Minister announces efforts to bring Canadians home from abroad</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}