{
  "path": "/en/news/news-releases/2016/09/05/prime-minister-participates-g20-summit-hangzhou-china",
  "pageTitle": "Prime Minister participates in G20 Summit in Hangzhou, China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, concluded a three-day visit to Hangzhou, China, where he participated in the G20 Leaders’ Summit.</p>\n<p>Canada places great importance on working with its G20 partners to help address some of the world’s most pressing challenges – from building prosperity for the middle class to promoting open and free trade and investment.</p>\n<p>At the Hangzhou Summit, G20 leaders discussed concrete ways they can boost global economic growth and investment, foster innovation, create jobs, grow the middle class, strengthen the resilience of the global financial system, and increase trade.</p>\n<p>Prime Minister Trudeau highlighted the need for strong, sustainable, and balanced growth to respond to today’s global economic challenges. To this end, he called for the full and timely implementation of the G20 members’ growth strategies aimed at increasing their collective gross domestic product by two percent by 2018. He also stressed the need to keep a strong focus on inclusive growth that supports the middle class and those working hard to join it, with a particular emphasis on the needs of youth and women.</p>\n<p>The Prime Minister underlined the importance of ensuring that the benefits of free and open trade and investment are broadly shared and evenly distributed among all citizens. He emphasized that the benefits of growth cannot only be felt by the wealthiest one percent, and that countries can promote inclusive growth by supporting and encouraging the social and economic integration of refugees and migrants.</p>\n<p>Prior to the start of the G20 Summit, the Prime Minister participated in the B20 Summit, an annual meeting of global business leaders, where he promoted Canada’s advantages as an investment destination.</p>\n<p><strong>Quote</strong></p>\n<p>“I had a productive Summit with my G20 colleagues, where we discussed how to build an innovative, interconnected, invigorated and inclusive world economy. Throughout the Summit, I encouraged fellow global leaders to focus on inclusive growth that supports the middle class and those working hard to join it. The benefits of growth cannot only be felt by the wealthiest one percent – they need to be felt by everyone.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The G20 Summit brings together the leaders of major advanced and emerging economies.</li>\n<li>Together, the members of the G20 account for more than 85 percent of the world’s GDP and two-thirds of the world’s population.</li>\n<li>Canada continues to play a leadership role in the G20 as the co-chair of the Framework Working Group, which is responsible for steering the G20’s overall growth targets and country-specific growth strategies.</li>\n<li>In 2016, Canada became the co-chair of the newly created G20 Trade and Investment Working Group, which is responsible for implementing the G20’s commitments in the area of trade and investment as vital engines for growth and job creation.</li>\n<li>The G20 was first established in the wake of the Asian financial crisis of the late 1990s as a meeting of finance ministers and central bank governors.</li>\n<li>With the onset of the global financial crisis in 2008, the G20 was seen as the most effective forum to lead global efforts to stem the crisis and mitigate its effects.</li>\n<li>Members of the G20 are Argentina, Australia, Brazil, Canada, China, the European Union (EU), France, Germany, India, Indonesia, Italy, Japan, Mexico, Russia, Saudi Arabia, South Africa, South Korea, Turkey, the United Kingdom, and the United States.</li>\n</ul></div>\n      "
}