{
  "path": "/en/news/news-releases/2016/02/03/governor-general-canada-visit-united-states",
  "pageTitle": "Governor General of Canada to visit the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Excellency the Right Honourable David Johnston, Governor General of Canada, will travel to Washington, D.C., from February 10 to 11, 2016.</p>\n<p>During the visit, the Governor General will meet with innovation, research, and education leaders – from both the public and private sectors – to reinforce the importance of strong international collaboration between Canada and the United States. &nbsp;</p>\n<p>The Governor General will also pay his respects to the fallen at the Canadian Cross of Sacrifice in Arlington Cemetery – a tribute to the many American citizens who died while serving in the Canadian Armed Forces during the First World War, the Second World War, and the Korean War.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada’s relationship with the United States of America is one of the longest, most peaceful, and mutually-beneficial relationships of any two countries in the world. We face many of the same challenges, and continental growth in our science, innovation, and research sectors is a key priority that will help us continue to grow, together.”</p>\n<p>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>This will be His Excellency’s first time to Washington, D.C., as Governor General. His Excellency has previously visited cities in the states of Massachusetts, New York, California, Washington, Minnesota, Illinois and Michigan.</li>\n<li>The U.S. is Canada’s largest trading partner, with nearly $2.4 billion worth of goods and services crossing the border every day accounting for $870.1&nbsp;billion in annual two way trade.</li>\n</ul></div>\n      "
}