{
  "path": "/en/news/news-releases/2023/03/31/getting-canadians-dental-care-they-need",
  "pageTitle": "Getting Canadians the dental care they need | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone should be able to put good food on their tables <em>and</em> see a dentist when they need to. But many Canadians are struggling with the impacts of global inflation, which is making the cost of living a real challenge. That’s why we acted last year to provide targeted support to those who need it most – and Budget&nbsp;2023 continues to deliver much-needed relief.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted how <em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future </em>will help people get the dental care they need and make life more affordable for Canadians.</p>\n\n<p>By the end of this year, we will begin rolling out the Canadian Dental Care Plan. The plan will be fully implemented by 2025, providing dental coverage for up to nine million Canadians. This was supported by an investment in Budget&nbsp;2023 of $13&nbsp;billion over five years starting in 2023-24, and $4.4&nbsp;billion in ongoing, permanent funding. These investments build on the launch of the Canada Dental Benefit for kids last year, which has already helped more than 250,000 kids across Canada get the dental care they need and deserve.</p>\n\n<p>To deliver better health care for Canadians, the federal government is also increasing health investments by more than $198&nbsp;billion over 10 years and working with the provinces and territories to get people access to family health care teams, clear backlogs, and support front-line health care workers.</p>\n\n<p>Budget&nbsp;2023 lays out our plan to continue to be there for people when they need it most, make life more affordable, and build a healthy future for Canadians from coast to coast to coast.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“No one should have to choose between taking care of their teeth and paying their bills. Budget&nbsp;2023 will help millions of Canadians see a dentist and provide much-needed relief for families.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>In 2023, the Canadian Dental Care Plan will become available to uninsured Canadians under 18, persons with disabilities, and seniors who have an annual family income of less than $90,000. There will be no co-pays for those with an annual family income under $70,000. By 2025, the Canadian Dental Care Plan will be fully implemented to cover all uninsured Canadians with an annual family income under $90,000.</li>\n\t<li>Budget&nbsp;2023 also proposes to invest:&nbsp;\n\t<ul class=\"bulletOutline\"><li>$250&nbsp;million over three years, starting in 2025-26, and $75&nbsp;million ongoing to establish an Oral Health Access Fund, which will address oral health gaps among vulnerable populations and reduce identified barriers to accessing dental care, including in rural and remote communities, complementing the Canadian Dental Care Plan.</li>\n\t\t<li>$23.1&nbsp;million over two years, starting in 2023-24, to collect data on oral health and dental care access in Canada and help the government’s ability to support those who need it most through the Canadian Dental Care Plan.</li>\n\t</ul></li>\n\t<li>To make life more affordable while global inflation drove up the cost of living, the government has made significant investments and implemented key initiatives in the past year alone, including:\n\t<ul class=\"bulletOutline\"><li>Doubling the Goods and Services Tax Credit (GSTC) for six months to help 11&nbsp;million individuals and families with the rising cost of living – with couples with two children receiving up to an extra $467 and seniors receiving an extra $225 on average;</li>\n\t\t<li>Launching the Canada Dental Benefit, which provides up to $1,300 over two years to help get kids the dental care they need;</li>\n\t\t<li>Providing low-income renters with $500 to make life more affordable;</li>\n\t\t<li>Enhancing the Canada Workers Benefit for our lowest-paid – and often most essential – workers, to provide up to $1,428 for a single worker without children, up to $2,461 to a family, and an additional $737 for workers with disabilities;</li>\n\t\t<li>Increasing Old Age Security (OAS) benefits for seniors age 75 and older by 10 per cent as of July 2022, which is providing more than $800 in additional support to full pensioners; and</li>\n\t\t<li>Delivering $10-a-day child care or reducing child care fees by at least 50 per cent on average in every province and territory, and strengthening the child care system in Quebec with more child care spaces.</li>\n\t</ul></li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/stronger-public-health-care.html\">Budget&nbsp;2023 Backgrounder: Stronger Public Health Care</a></li>\n</ul><h2><strong>Associated Links</strong></h2>\n\n<ul><li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2023/03/28/government-canada-releases-budget-2023\">Government of Canada releases Budget&nbsp;2023</a></li>\n\t<li><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\"><em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/services/canada-health-care-system.html\">Canada’s health care system</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/01/delivering-dental-care-children-now\">Delivering dental care for children now</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/dental-benefit.html\">Canada Dental Benefit</a></li>\n</ul></div>\n      "
}