{
  "path": "/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address",
  "pageTitle": "Governments and international organizations come together to address economic challenges and sustainability | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2 class=\"text-align-center\">High-level event on financing solutions related to COVID-19</h2>\n\n<p>United Nations Secretary-General António Guterres, the Prime Minister of Canada Justin Trudeau, and the Prime Minister of Jamaica Andrew Holness, will convene world leaders and international organizations today in a joint initiative to sharpen and accelerate our global response to the significant economic and human impacts of COVID-19, and advance concrete solutions to the development emergency.</p>\n\n<p>This pandemic requires a large-scale, coordinated, comprehensive multilateral response to support countries in need, enabling them to recover better for more prosperous, resilient and inclusive economies and societies.</p>\n\n<p>With more than 50 Heads of State and Government participating, the<strong> High-Level Event on Financing for Development in the Era of COVID-19 and Beyond </strong>is the most inclusive gathering of countries to focus on the socio-economic recovery and financing needs from the pandemic. We must continue to coordinate these efforts to avoid a devastating impact on people’s lives and livelihoods.</p>\n\n<p>We all face economic strain in responding to this pandemic, particularly low- and middle-income countries, many of which are seeing their efforts to achieve the Sustainable Development Goals (SDGs) set back.</p>\n\n<p>“The pandemic has demonstrated our fragility,” said UN Secretary-General Antonio Guterres. “We are in an unprecedented human crisis, because of a microscopic virus. We need to respond with unity and solidarity, and a key aspect of solidarity is financial support.”</p>\n\n<p>Jamaica’s Prime Minister Andrew Holness said, “the COVID-19 pandemic demands that we take immediate action to address its impacts on the economies of all countries, in every region of the world and at every stage of development.” He added that he welcomes the six thematic areas of focus, including the “necessity to address the urgent need for increased liquidity, particularly for low- and middle-income countries.”</p>\n\n<p>Canada’s Prime Minister Justin Trudeau said that “all countries are being tested by the COVID-19 pandemic, and it threatens to undermine our hard-won development gains. We know the best way to help all our people and economies rebound is to work together as a global community. We want to support collective and individual actions to enable a recovery that leads to more inclusive, sustainable and resilient economies, where no one is left behind.”&nbsp;</p>\n\n<p>The High-Level Event looks at six urgent areas of action to mobilize the financing needed for the response and recovery. These include expanding liquidity across the global economy; addressing debt vulnerabilities; stemming illicit financial flows; increasing external finance for inclusive growth and job creation; and strategies for countries to recover better, achieve the SDGs, address climate change and restore the balance between the economy and nature.</p>\n\n<h3>The cost of the pandemic</h3>\n\n<p>World Health Organization (WHO) figures show that the COVID-19 pandemic has already claimed more than 340,000 lives, with more than 5.4&nbsp;million cases globally. Unless we act now, UN projections indicate that the pandemic could slash nearly $US8.5 trillion from the global economy over the next two years, forcing 34.3&nbsp;million people into extreme poverty this year, and potentially, an additional 130&nbsp;million people during this decade.</p>\n\n<p>Failing businesses are already causing a surge in unemployment. The International Labour Organization (ILO) expects that global working hours in the second quarter of 2020 will be 10.5 per cent lower than before the crisis, equivalent to 305&nbsp;million full-time jobs. Women are particularly affected, as they are overrepresented in sectors that have been the most affected with initial job losses. They are also the majority of those employed in the informal sector globally and on the whole tend to hold less secure jobs with fewer protections, less savings, and are more likely to live in, or close to, poverty.</p>\n\n<p>The pandemic is causing economic distress even in countries that have not yet experienced the health impact in large numbers. Falling exports and growth are rapidly undermining the debt sustainability of many developing countries, particularly those that are heavily dependent on commodities, tourism revenues or remittances. Growing debt distress poses an enormous challenge to these countries, further constraining their ability to implement stimulus measures.</p>\n\n<p>Even prior to the outbreak of the pandemic, almost half of all least developed and other low-income countries were in, or close to, debt distress. Debt servicing costs for these countries more than doubled between 2000 and 2019, to 13 per cent of government revenue, and reached more than 40 per cent in a quarter of all Small Island Developing States (SIDS).</p>\n\n<p>Effective domestic resource mobilization will be crucial for rebuilding economies. Yet trillions of dollars are thought to be held in undeclared offshore financial holdings. The cost of money laundering has been estimated at around $US1.6 trillion a year.</p>\n\n<h3>Meeting the challenges</h3>\n\n<p>In the face of this unprecedented health, social and economic crisis, many governments across the world have rolled out large fiscal stimulus measures equivalent to an estimated 10 per cent of national gross domestic product (GDP). But most developing economies are finding it difficult or impossible to implement sufficiently large fiscal packages, which have so far averaged less than 1 per cent of their GDP.</p>\n\n<p>In April 2020, the G-20 agreed to suspend debt service on bilateral official debt to 76 low-income developing countries to help increase liquidity to deal with the impacts of the crisis. The International Monetary Fund (IMF) offered further debt service relief to 25 of the poorest countries, and the World Bank has been coordinating with regional banks to discuss COVID-19 support, joint initiatives, co-financing, and ways to maximize net flows to the poorest and most vulnerable countries.</p>\n\n<p>But far more is needed, and quickly.</p>\n\n<p>The High-Level Event will discuss a wide range of inclusive solutions, seeking input from the countries feeling the most impacted.</p>\n\n<h3>Rebuilding sustainably</h3>\n\n<p>In the initial containment and crisis phase of the pandemic, nations have prioritized the health of people before turning to the economic and labour market consequences. As each nation charts its own course to recovery, countries are seeking to limit the economic fallout by taking steps to protect enterprises, jobs and incomes, and to stimulate the economy, and to do so in a way that protects women and families, young people, and the most vulnerable in our societies.&nbsp;</p>\n\n<p>We must raise our ambitions in order to recover better, by building more prosperous, inclusive, resilient and sustainable economies and societies. Countries cannot afford to leave unattended the underlying fragilities at the core of our current economic and social systems. We cannot wish away systemic risks, from the climate crisis to high and persistent inequality. Everyone will benefit if we address these risks by investing up front.&nbsp;</p>\n\n<p>The Event will include a High-Level Segment in which Heads of State and Government will express their commitment to finding multilateral solutions to the global economic crisis and its effects on the most vulnerable. In addition, a High-Level Panel of leaders from international institutions will discuss the challenges and opportunities for urgent, decisive action. Following the Panel, the High-Level Segment among Heads of State and Government, and partners will continue.</p>\n\n<h3>Six critical areas of focus</h3>\n\n<p>The Event will also launch a collaborative effort to enable discussions on concrete proposals to overcome challenges in six areas, and progress will be reported back at the margins of the High Level Political Forum (HLPF) in July, the General Assembly in September, and at the end of the year that include:</p>\n\n<ol>\n\t<li>The need to expand liquidity in the global economy and maintain financial stability to safeguard development gains.&nbsp;</li>\n\t<li>The need to address debt vulnerabilities for all developing countries to save lives and livelihoods for billions of people around the world.&nbsp;</li>\n\t<li>The need to create a space in which private sector creditors can proactively engage in effective and timely solutions.</li>\n\t<li>Prerequisites for enhancing external finance and remittances for inclusive growth and creating jobs.</li>\n\t<li>Measures to expand fiscal space and foster domestic resource mobilization by preventing illicit financial flows.</li>\n\t<li>Ensuring a sustainable and inclusive recovery by aligning recovery policies with the Sustainable Development Goals.</li>\n</ol>\n\n<p>The outcomes of the High-Level Event include the formation of six discussions groups, a collaborative effort that aims at providing concrete proposals by mid-July.</p>\n\n<p>There is no time to lose. Solutions cannot wait, and decisive action is required.</p>\n\n<h3>Related Product</h3>\n\n<ul>\n\t<li>Webcast<strong>: </strong><a href=\"http://webtv.un.org\">http://webtv.un.org</a> from 8&nbsp;a.m. to 12&nbsp;p.m. (EDT), May 28</li>\n</ul>\n\n<h3>Associated Link</h3>\n\n<ul>\n\t<li>Event website <a href=\"https://www.un.org/en/coronavirus/financing-development\">https://www.un.org/en/coronavirus/financing-development</a></li>\n</ul></div>\n      "
}