{
  "path": "/en/news/statements/2019/11/05/statement-prime-minister-veterans-week",
  "pageTitle": "Statement by the Prime Minister on Veterans’ Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on Veterans’ Week, which runs from November 5 to 11, 2019:</p>\n\n<p>“Generations of brave Canadians from all walks of life have stepped forward to serve and sacrifice for our country. Hundreds of thousands have fought – and many continue to serve – so we may live in peace.</p>\n\n<p>“In the days leading up to Remembrance Day, <a href=\"https://www.veterans.gc.ca/eng/remembrance/get-involved/remembrance-day\">Veterans’ Week</a> is an opportunity for us all to learn from the stories of Canadians who answered the call of duty. Confronted with extraordinary circumstances during times of conflict, these ordinary people became the honoured heroes we remember today.</p>\n\n<p>“This year, we recognize a number of milestones in the history of our armed forces. Together with our Allies, we mark the 75th anniversaries of the <a href=\"https://www.veterans.gc.ca/eng/remembrance/events/italian-campaign-75th-anniversary\">Italian Campaign</a> and the <a href=\"https://www.veterans.gc.ca/eng/remembrance/events/scheldt-75th-anniversary\">Battle of the Scheldt</a> in Belgium and the Netherlands, where more than 168,000 Canadians played an important role in the liberation of Europe. We also commemorate the 5th anniversary of the end of the <a href=\"https://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/afghanistan-remembered\">mission in Afghanistan</a>, the largest deployment of Canadians since the end of the Second World War.</p>\n\n<p>“We owe an immeasurable debt of gratitude to our veterans, and we will always be there for those who have given so much in service to our country. That is why the Government of Canada will continue to make sure every veteran gets the help they need, including mental health services.</p>\n\n<p>“Throughout this week, I invite everyone to participate in <a href=\"https://www.veterans.gc.ca/eng/remembrance/get-involved/remembrance-day/guide-to-commemorative-services\">ceremonies of remembrance</a> and wear red poppies in honour of those who gave their lives in service to our country. Let us all pay tribute to our veterans, Canadians in uniform, and their families.</p>\n\n<p>“To the Canadians who have served and sacrificed to defend our country and to promote peace in the world: we are forever thankful, and we will always remember.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}