{
  "path": "/en/news/readouts/2020/06/11/prime-minister-trudeau-speaks-his-royal-highness-prince-wales-and",
  "pageTitle": "Prime Minister Trudeau speaks with His Royal Highness The Prince of Wales and the Commonwealth group of Permanent Representatives to the United Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with His Royal Highness The Prince of Wales and the Commonwealth group of Permanent Representatives to the United Nations regarding financing for development and the Great Reset initiative. The Prime Minister thanked His Royal Highness for initiating the discussion at such a critical time and for championing the Great Reset initiative to build a better and more sustainable future for all.</p>\n\n<p>Prime Minister Trudeau highlighted the importance of the Commonwealth as a space for dialogue and collective action on global issues related to sustainable development. He addressed the ongoing challenge posed by COVID-19 and the need to build back stronger, more resilient, and greener economies. The Prime Minister also noted the importance of multi-stakeholder partnerships between governments, the private sector and civil society in shaping the future global economy in a way that supports social inclusion, fairness, equality, and sustainability.</p>\n\n<p>The Prime Minister, His Royal Highness, and the Permanent Representatives discussed economic recovery and sustainability initiatives that will support the objectives of the Great Reset. The Prime Minister also underscored Canada’s continued commitment to climate action, and announced a new $9.5 million contribution to the Climate Finance Access Network. This contribution will help some of the most climate-vulnerable countries, notably Pacific small island developing states, to more easily access international climate finance. It will complement other recent initiatives supporting partnerships on climate action, including with Caribbean and African states.</p>\n\n<p>The Prime Minister also spoke about the joint initiative he recently launched with the United Nations Secretary-General and the Prime Minister of Jamaica to accelerate the global response to the pandemic. This initiative emphasizes the need to improve access to critical development financing, including by low- and middle-income countries, to help them recover and “build back better”, creating more prosperous, resilient and inclusive economies and societies.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with international partners to minimize the economic impact of the virus and to ensure that the global recovery is focused on building back stronger, more sustainable economies.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launched the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance.html\">Canada's international climate finance</a></li>\n</ul></div>\n      "
}