{
  "path": "/en/news/news-releases/2019/05/03/prime-minister-launches-canadas-youth-policy",
  "pageTitle": "Prime Minister launches Canada’s Youth Policy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Young Canadians are the most educated, connected, and diverse generation this country has ever seen. They are actively serving their communities and advocating for a more fair, diverse, and inclusive Canada. Their participation in civic life, including government decision-making, is crucial to Canada’s continued success.</p>\n\n<p>The Prime Minister and Minister of Youth, Justin Trudeau, launched Canada’s first-ever youth policy during the Canada Youth Summit, which brought together young Canadians to discuss what matters most to them.</p>\n\n<p>Canada’s Youth Policy – created for youth, by youth – will help the voices of young people better guide government priorities and actions. Input from more than 5,000 young people shaped this new, whole-of-government policy. This policy will go a long way to lift up diverse youth voices and make sure more young people have the chance to take part in federal decision-making.</p>\n\n<p>To support young Canadians who want to be more active in their communities, the Government of Canada proposes to expand the Canada Service Corps youth service program. The program would provide up to 15,000 service placements for young Canadians annually by 2024, helping them gain valuable skills and leadership experience.</p>\n\n<p>The Government of Canada is working to help young people reach their full potential and feel empowered to create positive change for themselves, their communities, their country, and the world.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Youth issues are Canada’s issues, and Canada’s issues are youth issues. Young people care deeply about their country and its future, and we need them at the table if we want to build a stronger and more inclusive society. I thank every young person who shared their perspectives on what actions we can, and should take, to solve the complex challenges we face. Their drive, creativity, and determination will make a difference, to the benefit of all Canadians.”<br>\n—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“Through Canada Service Corps, young people are building a better Canada by getting involved and making a real difference in their communities. Hundreds of young people from coast to coast to coast have already made meaningful contributions while gaining leadership and work experience&nbsp;–&nbsp;and they are just getting started.”<br>\n—<cite>The Hon. Patricia Hajdu, Minister of Employment, Workforce Development and Labour</cite></p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The two-day Canada Youth Summit brought together young people, between the ages of 16 and 24, from across the country to discuss issues that matter to them.</li>\n\t<li>During the Summit, participants explored themes inspired by Canada’s Youth Policy, including health and wellness, jobs and skills development, truth and reconciliation, the environment and climate change, and the importance of civic participation and service in our communities. Their input will continue to help inform the development of the Canada Service Corps, the Youth Digital Gateway, and the State of the Youth Report.</li>\n\t<li>Carbon credits were purchased to offset the carbon footprint of the Summit and to support the ongoing commitment young Canadians have shown toward fighting climate change.</li>\n\t<li>Four young Canadians were invited based on their participation in the Youth Video Challenge, which encouraged people to post a video on social media using the hashtag #InspiredToServe, capturing what service means to them and how it benefits their community.</li>\n\t<li>Budget 2019 proposes new programs and investments that will continue to prepare young Canadians for their future, and help them thrive in every stage of life. These investments include:\n\t<ul>\n\t\t<li>$314.8 million over five years, and $83.8 million per year ongoing, to make the Canada Service Corps a signature national youth service program. The program will be expanded with additional service placements, grants, program supports and incentives co-created with young people, so that everyone who wants to make an impact has the opportunity to do so.</li>\n\t\t<li>$49.5 million over five years to modernize the Youth Employment Strategy and improve services and supports for young people facing barriers to employment. The investment will support work placements, build partnerships with stakeholders, and support the ongoing development of the Youth Digital Gateway—an online, interactive, user-friendly platform to help youth access federal supports.</li>\n\t</ul>\n\t</li>\n\t<li>We have set a goal that, within the next ten years, every young Canadian who wants a work-integrated learning opportunity while they are a student, should get one. In total, Budget 2019 sets a target of creating 84,000 new student work placements across Canada, by investing:\n\t<ul>\n\t\t<li>$631.2 million over five years to support up to 20,000 new work placements per year for post–secondary students.</li>\n\t\t<li>$150 million over four years to create partnerships with businesses to add up to 20,000 more work-integrated learning opportunities.</li>\n\t\t<li>Up to $17 million over three years to support the Business/Higher Education Roundtable in creating an additional 44,000 work-integrated learning placements and opportunities per year in 2021.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html?utm_campaign=CanadaServiceCorps&amp;utm_source=SocialMedia_Print_Poster&amp;utm_medium=VanityUrl&amp;utm_term=en&amp;utm_content=canada-ca_canada-service-corps\">Canada Service Corps</a></li>\n\t<li><a href=\"https://www.canada.ca/en/youth/services/canada-youth-summit.html\">Canada Youth Summit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/youth/programs/policy.html\">Canada Youth Policy</a></li>\n\t<li><a href=\"https://www1.canada.ca/en/contact/youth_engagement.html\">Youth Engagement Sign Up</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/youth-jeunes/youth-jeunes-en.html\">Budget 2019 - Investing in Young Canadians</a></li>\n</ul></div>\n      "
}