{
  "path": "/en/news/readouts/2020/05/13/prime-minister-justin-trudeau-speaks-prime-minister-saint-lucia-allen",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Saint Lucia Allen Chastanet | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Saint Lucia, Allen Chastanet,&nbsp;to discuss the latest developments in the COVID-19 pandemic in&nbsp;each of their&nbsp;countries and&nbsp;around the world.</p>\n\n<p>The prime ministers exchanged information on their respective national efforts to fight the pandemic&nbsp;and protect the health, safety, and economic well-being of their citizens, especially the most vulnerable.</p>\n\n<p>Prime Minister Trudeau recognized COVID-19’s devastating impact across the region, and its amplification of many long-standing vulnerabilities of small island state economies, including to climate change, limited access to financing, and heavy reliance on international tourism.</p>\n\n<p>Prime Minister Trudeau commended Prime Minister Chastanet for his leadership in seeking longer term financing solutions for the region. The prime ministers agreed on the importance of continued&nbsp;close collaboration&nbsp;and concerted international action to address the unique challenges faced by small island states.</p>\n\n<p>Prime Minister Trudeau underscored the strong friendship between Canada, St. Lucia, and many Caribbean nations, built on enduring people-to-people ties.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial,&nbsp;territorial, and international&nbsp;partners&nbsp;to minimize&nbsp;its&nbsp;health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/saint_lucia-sainte_lucie/relations.aspx?lang=eng\">Canada-Saint Lucia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}