{
  "path": "/en/news/readouts/2020/06/16/prime-minister-justin-trudeau-speaks-prime-minister-spain-pedro-sanchez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Spain Pedro Sánchez | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Spain, Pedro Sánchez.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sánchez discussed COVID-19 and the wide-ranging measures being taken in Canada and in Spain to protect health and safety and to support families, workers, and businesses who are feeling the economic impacts of the pandemic. They agreed on the need for an inclusive and sustainable approach and for coordinated international action to work together for recovery, to protect the most vulnerable, and to build economic resilience. Prime Minister Trudeau spoke about the joint initiative he recently launched with the United Nations Secretary-General and the Prime Minister of Jamaica to accelerate the global response to the pandemic and to better address the economic implications.</p>\n\n<p>The two leaders reaffirmed the strong friendship between Canada and Spain. They looked forward to continuing to work together to advance common priorities, including in international organizations such as the United Nations.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/spain-espagne/bilateral_relations_bilaterales/canada-spain-espagne.aspx?lang=eng#:~:text=Political%20and%20defense%20relations,on%20shared%20interests%20and%20values.&amp;text=A%20Canada%2DSpain%20Cooperation%20Agenda,international%20peace%20and%20global%20security.\">Canada - Spain Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}