{
  "path": "/en/news/news-releases/2017/05/08/prime-minister-welcomes-clerks-report-public-service-canada",
  "pageTitle": "Prime Minister welcomes Clerk’s report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Twenty-Fourth Annual Report on the Public Service of Canada from the Clerk of the Privy Council and Head of the Public Service, Michael Wernick.</p><p>The Clerk’s report outlines how the Public Service has performed over the last twelve months in providing services to Canadians and supporting the Government. It also sets out expectations and priorities going forward.</p><p>As we mark the 150<sup>th</sup> anniversary of Confederation, the report also recounts how the Public Service has evolved and served Canadians through our history.&nbsp;&nbsp;</p><p>The report is available online at <a href=\"https://www.canada.ca/en/privy-council/corporate/clerk/publications/2017-annual-report-landing-page.html?utm_source=PM_NR&amp;utm_campaign=AnnualReport\">www.canada.ca/clerk-report</a>.</p><h2>Quote</h2><blockquote><p>“Canada’s professional and non-partisan Public Service is one of the great strengths of our country. I know first-hand how hard our public servants work on behalf of the people of Canada. Together, the Clerk and I will continue our work to strengthen the public service and make sure it is ready to meet the challenges and opportunities that lie ahead.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Prime Minister appointed Michael Wernick as the 23<sup>rd</sup> Clerk of the Privy Council on January 22, 2016, to help the government deliver its agenda and renew the Public Service.</li><li>Mr. Wernick will take part in an <a href=\"http://www.csps-efpc.gc.ca/events/discussion-clrk/index-eng.aspx\">armchair discussion</a> about the #ClerkReport on May 15, 2017.</li><li>The Annual Report to the Prime Minister on the Public Service of Canada was first produced in 1992 and is required under section 127 of the <i>Public Service Employment Act</i>.</li><li>The Public Service of Canada is the country’s largest employer, with nearly 260,000 employees. It is also the country’s most diverse workforce, including administrative, scientific, engineering, medical, and enforcement professionals.</li></ul></div>\n      "
}