{
  "path": "/en/news/news-releases/2020/05/05/supporting-canadas-farmers-food-businesses-and-food-supply",
  "pageTitle": "Supporting Canada’s farmers, food businesses, and food supply | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In uncertain times, it is more critical than ever for Canadians to have access to good, high quality, and nutritious food. That is why the Government of Canada is taking steps to support the farmers and businesses who provide Canadians with the food they need to keep themselves and their families healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced important measures within agriculture programs and an investment of more than $252&nbsp;million to support farmers, food businesses, and food processors who provide essential services to Canadians every day by ensuring a safe and reliable food supply. He also announced that the government intends to propose an additional $200 million in borrowing capacity&nbsp;for the sector.</p>\n\n<p>The Government of Canada will provide targeted support to farmers, ranchers, agricultural producers, and food processors by:</p>\n\n<ul>\n\t<li>Creating a $77.5 million Emergency Processing Fund to help food producers access more personal protective equipment (PPE), adapt to health protocols, automate or modernize their facilities, processes, and operations, and respond to emerging pressures from COVID-19 so they can better supply Canadians with food during this period.</li>\n\t<li>Launching national AgriRecovery initiatives of up to $125 million in funding to help producers faced with additional costs incurred by COVID-19. This includes set-asides for cattle and hog management programs to manage livestock backed-up on farms, due to the temporary closure of food processing plants. This new federal funding will help beef and pork producers and processors adapt to a changing market, and help farmers and ranchers keep their animals longer before marketing.</li>\n\t<li>Announcing the intention to increase the Canadian Dairy Commission’s borrowing limit by $200 million to support costs associated with the temporary storage of cheese and butter to avoid food waste. The government will work with opposition parties to achieve the required legislative change. &nbsp;</li>\n\t<li>Launching a first-ever Surplus Food Purchase Program with an initial $50 million fund designed to help redistribute existing and unsold inventories, which could include products such as potatoes and poultry, to local food organizations who are serving vulnerable Canadians.</li>\n\t<li>Working with provinces and territories to increase interim payments from 50 per cent to 75 per cent through AgriStability, a federal, provincial and territorial program that supports producers who face significant revenue declines. This change has already been enacted in some provinces.</li>\n\t<li>Working with provinces and territories to explore possibilities for expanding the AgriInsurance program to include labour shortages as an eligible risk for the horticulture sector. This work with provincial and territorial partners would insure against lost production due to an insufficient workforce, should producers be unable to find enough labour to harvest.</li>\n</ul>\n\n<p>The Government of Canada recognizes all workers across our food supply chain who&nbsp;provide an essential service to our country. We will continue to monitor and respond to the wide-ranging impacts of COVID-19, and take additional actions as needed to protect the health and safety of Canadians, and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians count on farmers and producers to provide them with the food they need to feed themselves and their families. Today, we are giving them the support they need to keep their workers safe and food systems running during this challenging time, for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic has had a profound impact on Canadians in all communities and in all sectors of the economy. With this announcement, we are giving agricultural producers and food processors more resources to adapt to the many challenges brought on by the COVID-19 pandemic and, above all, to keep workers safe. Canada’s agricultural sector is interconnected. So the new investments we are making will have a positive impact up and down the production chain.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“I want to reassure all our farmers and agri-business owners across the agri-food industry that our government fully understands that they are essential to our communities and that we are fully engaged to help them through this unprecedented period. We are grateful for the dedication of our hard working food workers – from the farm to the retail store – every day to ensure we continue to have food on our family tables. This support will help food producers and processors to continue providing the food Canadians need, and help ensure food availability for all Canadians in these uncertain times.”</p>\n\n<footer class=\"default\">The Hon. Marie-Claude Bibeau, Minister of Agriculture and Agri-Food</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Federal, provincial and territorial governments invest, on average, close to $1.6 billion annually in business risk management programs to help producers remain viable under difficult circumstance. These programs include AgriInsurance, AgriStability, AgriInvest, and AgriRecovery.</li>\n\t<li>The enrolment deadline for the 2020 AgriStability program has been extended to July 3, 2020. The federal, provincial, and territorial governments agreed to the change to help producers deal with current market disruption and production challenges. British Columbia, Quebec, Saskatchewan, Prince Edward Island, and Alberta have&nbsp;all already agreed to the 75 per cent AgriStability interim payment.</li>\n\t<li>AgriRecovery funding is normally cost shared between federal, provincial, and territorial governments. This program will become more flexible so that the federal government can directly provide its share of the funding to producers, regardless of whether provinces and territories are able to contribute.</li>\n\t<li>The government has already committed significant resources to ensure industry has the support and tools needed to manage through these difficult times, including:\n\t<ul>\n\t\t<li>$50 million to ensure farmers can safely welcome temporary foreign workers with measures necessary to follow the <em>Quarantine Act</em>, by assisting with the incremental costs of the mandatory 14-day isolation period. In April, sector partners, in close collaboration with the federal government, successfully brought in over 80 per cent of the normal amount of Temporary Foreign Workers to Canada, compared to the previous year.</li>\n\t\t<li>New measures to the Temporary Foreign Worker Program to help mitigate a shortfall in the workforce.</li>\n\t\t<li>$20 million to bolster services of the Canadian Food Inspection Agency.</li>\n\t\t<li>$100 million to organizations addressing food insecurity such as food banks.</li>\n\t\t<li>$25 million through Nutrition North to ensure food security for Canada’s most vulnerable.</li>\n\t\t<li>An additional $5 billion lending capacity for Farm Credit Canada, which has already resulted in loan deferrals valued at over $3 billion.</li>\n\t\t<li>$173 million in deferred Advanced Payment program loans for grain, cattle, and flower producers.</li>\n\t\t<li>$62.5 million for a new Canadian Seafood Stabilization Fund to help Canada’s fish and seafood processing sector.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/05/05/support-canadas-food-supply-system\" tabindex=\"115\">Support for Canada’s food supply system</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/foreign-workers/notice-covid-19.html\">Temporary Foreign Worker Program – COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/prime-minister-announces-support-farmers-and-agri-food-businesses\">Prime Minister announces support for farmers and agri-food businesses under Canada’s response to COVID-19</a></li>\n</ul></div>\n      "
}