{
  "path": "/en/news/readouts/2022/04/23/prime-minister-justin-trudeau-meets-manitoba-premier-heather-stefanson",
  "pageTitle": "Prime Minister Justin Trudeau meets with Manitoba Premier Heather Stefanson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Premier of Manitoba, Heather Stefanson.</p>\n\n<p>The Prime Minister and Premier spoke about the significance of the ceremony earlier that day and of the historic transfer of the Hudson’s Bay Company’s building in downtown Winnipeg to the Southern Chiefs’ Organization (SCO) in helping to advance reconciliation. They underlined the importance of making housing more affordable for all Canadians, and highlighted that this project will help create almost 300 new, affordable homes through a joint federal-provincial investment, in cooperation with the SCO.</p>\n\n<p>They discussed Manitoba’s strong Ukrainian community, and the Prime Minister expressed gratitude for the province’s generous support and close collaboration in helping Ukrainians as they arrive in Canada and settle in their new communities.</p>\n\n<p>The Prime Minister and Premier discussed the significant shared investments being made to support infrastructure and economic growth in Winnipeg and across the province. Prime Minister Trudeau underlined the federal government’s commitment to deliver water infrastructure and public transit improvements for Manitobans.</p>\n\n<p>The two leaders also discussed health care, in particular the federal government’s investments to support Canadians through the pandemic and the recent commitment in Budget&nbsp;2022 to provide $2&nbsp;billion through a top-up of the Canada Health Transfer to address surgical backlogs.</p>\n\n<p>Prime Minister Trudeau and Premier Stefanson agreed to stay in close touch and continue collaborating on shared priorities, including flood mitigation and climate change, economic growth, and health care.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/22/creating-affordable-homes-indigenous-peoples-winnipeg\">Creating affordable homes for Indigenous Peoples in Winnipeg</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/03/canada-expands-settlement-support-for-ukrainians-coming-to-canada.html\">Canada expands settlement support for Ukrainians coming to Canada</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.budget.gc.ca/2022/report-rapport/chap6-en.html\">Budget&nbsp;2022, chapter&nbsp;6: Strong Public Health Care</a></li>\n</ul></div>\n      "
}