{
  "path": "/en/news/news-releases/2018/06/15/canada-and-metis-nation-move-forward-canada-metis-nation-accord",
  "pageTitle": "Canada and the Métis Nation move forward on Canada-Métis Nation Accord | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the President of the Métis National Council (MNC), Clément Chartier, and the Presidents of the MNC Governing Members at the annual Crown-Métis Nation Summit. Together, they reviewed progress made during the first year of the Canada-Métis Nation Accord and confirmed priorities for the coming year.</p><p>The priorities identified during today’s meeting include education, health, Métis veterans, the new fiscal relationship, child and family services, economic development, environment, clean growth, and infrastructure. Participants will work together over the next year to advance these priorities, and will report on progress made at the next Crown-Métis Nation Summit.</p><p>The Canada-Métis Nation Accord reflects Canada’s commitment to work with the Métis Nation to co-develop policies and programs, and drive progress toward the Métis Nation’s vision of self-determination.</p><h2>Quotes</h2><blockquote><p>“The signing of the Canada-Métis Nation Accord last year was the first step toward a renewed relationship with the Métis Nation. These meetings provide an important opportunity to hear directly from leaders of the Métis Nation about their unique needs and concerns. We will continue to work together with the Métis Nation as partners to address these needs, and strengthen the Canada-Métis Nation relationship for the benefit of our country and all Canadians.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Canada-Métis Nation Accord is enabling the Métis Nation to make significant strides toward our social and economic development. We look forward to working with the Prime Minister and his ministers on this year’s priorities.”<br>—<cite>Clément Chartier, President of the Métis National Council</cite></p></blockquote><blockquote><p>“Today’s meeting with the Prime Minister and key federal ministers was a very valuable exchange between the leadership of the Métis Nation and Canada. These meetings are helping us to make a difference in the lives of all Métis people in British Columbia and throughout the Métis Nation. Full credit goes to the Prime Minister and the Canada-Métis Nation Accord. The Accord was signed in April last year, and it really has established a nation-to-nation, government-to-government relationship between Canada and the Métis Nation.”<br>—<cite>Clara Morin Dal Col, President of Métis Nation British Columbia</cite></p></blockquote><blockquote><p>“Today’s meeting with Prime Minister Trudeau was positive, and I thank him for his commitment to a distinctions-based approach. The work we are doing nationally will benefit Métis citizens in Alberta.”<br>—<cite>Audrey Poitras, President of the Métis Nation of Alberta</cite></p></blockquote><blockquote><p>“I am proud to have a renewed relationship with Canada—working together&nbsp;nation-to-nation and government-to-government toward social and economic prosperity for the Métis Nation.”<br>—<cite>Glen McCallum, President of Métis Nation-Saskatchewan</cite></p></blockquote><blockquote><p>“Today, I am very pleased to meet with a Prime Minister and a Cabinet that keeps their promises. The Métis people have always contributed to the betterment of Canada but for generations we have been ignored and denied our place. Our Métis veterans and our 60’s Scoop survivors deserve to be addressed and today I know this will happen. Our children and our youth are being made a priority and Métis Nation housing will become a reality. These and other high level issues will continue to be priorities in the immediate future.”<br>—<cite>David Chartrand, President of Manitoba Metis Federation</cite></p></blockquote><blockquote><p>“The Métis Nation of Ontario is pleased with the progress made over the past year and we look forward to advance on areas of priority that respect and address the unique needs of Métis throughout Ontario and create real positive change for families and communities.\"<br>—<cite>Margaret Froh, President of Métis Nation of Ontario</cite></p></blockquote><blockquote><p>“I am proud to see the implementation of the Canada-Métis Nation Accord and further movement on the priorities under the Métis Nation Accord.”<br>—<cite>Melanie Omeniho, President of the Women of the Métis Nation</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Earlier in the day, Minister of Employment, Workforce Development and Labour Patricia Hajdu and the Métis Nation leadership signed the Métis Nation Skills and Employment Accord, which provides a framework for working together to implement the new Métis National Labour Market Strategy. The strategy focuses on enhanced employment services, skills development, and job training to improve the overall well-being of Métis Nation.</li><li>This is the third meeting of ministers and Métis Nation leaders, and the second meeting with the Prime Minister, since the signing of the Accord on April&nbsp;13,&nbsp;2017.</li><li>The Métis Nation is represented by the Métis National Council and its governing members: the Métis Nation of Ontario, Manitoba Métis Federation, Métis Nation-Saskatchewan, Métis Nation of Alberta, and Métis Nation British Columbia.</li><li>Budget 2018 provided $516 million in funding over 10 years to respond to the unique needs and concerns of the Métis Nation, including:<ul><li>$500&nbsp;million over 10 years to support a Métis Nation housing strategy</li><li>$10&nbsp;million in 2018-19 to support Métis Nation post-secondary education</li><li>$6&nbsp;million over five years to support the Métis Nation in gathering health data and developing a health strategy</li></ul></li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/canada-metis-nation-accord\">Canada-Métis Nation Accord</a></li><li><a href=\"http://www.metisnation.ca/index.php/who-are-the-metis/mnc\">Métis National Council</a></li><li><a href=\"https://www.canada.ca/en/employment-social-development/news/2018/06/metis-nation-skills-and-employment-training-accord-signed.html\">Métis Nation Skills and Employment Training Accord signed</a></li><li><a href=\"/en/news/news-releases/2017/04/12/prime-minister-canada-and-president-métis-national-council-welcome\">The Prime Minister of Canada and President of the Métis National Council welcome the Signing of the Canada-Métis Nation Accord</a></li></ul><p>&nbsp;</p></div>\n      "
}