{
  "path": "/en/news/statements/2018/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p><p>“Today we begin Black History Month, a time to honour and celebrate the many achievements and contributions that Black Canadians have made to our country.</p><p>“The theme for this year’s Black History Month is ‘Black Canadian Women: Stories of Strength, Courage and Vision’. Jean Augustine, Viola Desmond, Michaëlle Jean, Jully Black, Afua Cooper – these are just a few women of African descent who have shaped Canada into the country it is today. Yet all too often their stories go untold.</p><p>“Earlier this week, the Government of Canada announced that <a href=\"/en/news/news-releases/2018/01/30/prime-minister-announces-government-canada-will-officially-recognize\">Canada will officially recognize</a> the UN International Decade for People of African Descent. This International Decade, which spans from 2015 to 2024, is an opportunity to highlight and celebrate the important contributions that Black Canadians have made to Canadian society.</p><p>“The International Decade also offers a framework to better address the very real and unique challenges that Black Canadians face. By working together, we can combat anti-black racism and discrimination, and deliver better outcomes for Black Canadians.</p><p>“This month, I invite all Canadians to take part in community events for <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a>, and learn more about the vital role that Black Canadians have played – and continue to play – in shaping the diverse, compassionate, and prosperous country we know today.”</p></div>\n      "
}