{
  "path": "/en/news/statements/2022/10/04/statement-prime-minister-1000th-day-egregious-downing-flight-ps752",
  "pageTitle": "Statement by the Prime Minister on the 1,000th day since the egregious downing of Flight PS752 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 1,000th day since the egregious downing of Ukraine International Airlines Flight&nbsp;752:</p>\n\n<p>“One thousand days ago today, the Iranian regime unlawfully and horrifically shot down passenger Flight&nbsp;PS752, cutting short the lives of the 176 innocent people on board – including 55 Canadians, 30 permanent residents, and a total of 138 people en route to Canada. They were mothers, fathers, sons, daughters, educators, and students – and most of all, they were loved.</p>\n\n<p>“In the 1,000 days since, people across Canada have mourned their loved ones. As Canadians, we mourn with them. Yesterday, I met with the families of the victims of PS752 to express my deepest condolences. In the wake of this crime, Canada has, and will continue to, support them. We opened new pathways to permanent residency for families of survivors, provided mental health supports, and continue to reaffirm Canada’s steadfast commitment to holding the Iranian regime responsible for its horrific actions.</p>\n\n<p>“Canada and its Coordination Group partners are committed to holding Iran accountable, in accordance with international law. At the International Civil Aviation Organization, Canada continues to advance the Safer Skies Initiative and to address gaps in the accident investigation process to make sure this never happens again. We remain relentless in our pursuit of justice for the families of these victims, and we will stop at nothing to ensure the regime is held accountable.</p>\n\n<p>“Today, the regime continues to crack down on courageous Iranian women protesting the tragic killing of Mahsa Amini at the hands of Iran’s so-called ‘morality police.’ Dozens of protesters have been killed. Once again, the Iranian regime is demonstrating its blatant disregard for human rights and human life. Canada unequivocally stands with the brave women who are marching in the streets of Iran and in the streets of cities right around the world in solidarity.</p>\n\n<p>“This unacceptable pattern of gross and systematic human rights violations and brutal murders must end. That’s why yesterday, we imposed new sanctions against Iran by targeting 34 individuals and entities. This includes the Iranian regime’s ‘morality police’ and senior members of the regime, including in the Islamic Revolutionary Guard Corps. These sanctions build on our existing sanctions and measures – some of the toughest any country has taken against Iran. They also complement the fact that Canada recognizes Iran as a State supporter of terrorism.</p>\n\n<p>“Today, we remember the innocent victims of PS752, and we stand with all those defending human rights here at home and around the world. The Iranian regime will be held accountable for its horrific actions.”</p></div>\n      "
}