{
  "path": "/en/news/itineraries/2023/03/02/prime-ministers-itinerary-friday-march-3-2023",
  "pageTitle": "Prime Minister’s itinerary for Friday, March 3, 2023 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Winnipeg, Manitoba</h2>\n\n<p><strong>9:45 a.m.&nbsp;</strong>The Prime Minister and the Premier of Manitoba, Heather Stefanson, will meet with parents to discuss the importance of affordable, high-quality child care. The Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency, Dan Vandal, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>10:15 a.m.&nbsp;</strong>The Prime Minister will make a child care announcement with the Premier of Manitoba, Heather Stefanson. A joint media availability will follow. The Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency, Dan Vandal, will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 9:15 a.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul>\n\n<p><strong>12:45 p.m.&nbsp;</strong>The Prime Minister will visit health care workers at a local hospital. He will be joined by the Minister of Northern Affairs, Minister responsible for Prairies Economic Development Canada and Minister responsible for the Canadian Northern Economic Development Agency, Dan Vandal.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity</li>\n</ul>\n\n<p><strong>Media appearances</strong></p>\n\n<p><strong>7:45 a.m.</strong> An interview with the Prime Minister will air on Radio-Canada Manitoba’s 6 à 9 with&nbsp;Patricia Bitu Tshikudi.</p>\n\n<p><strong>8:10 a.m.</strong>&nbsp;An interview with the Prime Minister will air on CBC Radio One Winnipeg’s Information Radio with Marcy Markusa.</p></div>\n      "
}