{
  "path": "/en/news/statements/2022/10/17/statement-prime-minister-international-day-eradication-poverty",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Eradication of Poverty | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Eradication of Poverty:</p>\n\n<p>“Ending poverty and making life more affordable for people is a top priority for the Government of Canada. Today, on the <a href=\"https://www.un.org/en/observances/day-for-eradicating-poverty\">International Day for the Eradication of Poverty</a>, we reflect on the progress we have made toward this crucial goal, and the work we still need to do.</p>\n\n<p>“Here in Canada, we have helped lift millions of Canadians out of poverty and given them a real and fair chance at success through initiatives like the <a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html\">Canada Child Benefit</a>, which puts more money in the pockets of nine out of 10 Canadian families, and our <a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Canada-wide Early Learning and Child Care Plan</a>, which is cutting regulated child care fees in half on average this year, and will deliver $10-a-day child care on average in the coming years. These are key drivers toward achieving our goal of reducing poverty in Canada by 50 per cent by 2030, as set out in Canada’s first-ever <a href=\"https://www.canada.ca/en/employment-social-development/programs/results/poverty-reduction.html\">Poverty Reduction Strategy</a>.</p>\n\n<p>“Right now, the rising cost of living is making it harder for families to make ends meet. That’s why we are making life more affordable for those who need it most this year. Recently, we enhanced the Canada Workers Benefit for low- and modest-income workers to put up to an additional $2,400 in their pockets and we increased Old Age Security for seniors 75 years and older, providing up to $800 this year for full pensioners. We also introduced legislation to provide a one-time top-up of $500 to the Canada Housing Benefit for low-income renters, $1,300 over two years for dental care for children under 12 who do not have access to dental insurance, and up to $467 for families with two children by doubling the Goods and Services Tax Credit for six months. To keep pace with the rising cost of living, the Canada Child Benefit, the Canada Pension Plan, Old Age Security, and the Guaranteed Income Supplement, among other federal support programs, are guaranteed to be indexed to inflation. We are supporting families who need it most, when they need it most.</p>\n\n<p>“Poverty knows no borders, and Canada is committed to ending poverty everywhere, in all its forms, in line with the first United Nations’ Sustainable Development Goal (SDG) – a goal I will continue to drive progress toward as Co-Chair of the UN SDGs Advocates Group. <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a> ensures our international development efforts focus on advancing gender equality, because when we eliminate barriers and empower women and girls, we drive economic growth that benefits everyone.</p>\n\n<p>“On this day, we recommit to a Canada – and a world – without poverty. Together, we will build a better future for everyone.”</p></div>\n      "
}