{
  "path": "/en/news/news-releases/2020/02/27/prime-minister-host-first-ministers-meeting-and-meeting-national",
  "pageTitle": "Prime Minister to host First Ministers’ Meeting and meeting with national Indigenous leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the next First Ministers’ Meeting will take place in Ottawa on March 13, 2020. This will be the sixth First Ministers’ Meeting the Prime Minister has hosted since 2015. The Deputy Prime Minister, Chrystia&nbsp;Freeland, will join the Prime Minister.</p>\n\n<p>During the meeting, First Ministers will focus on keeping our economy competitive and making progress on issues that matter to all Canadians. They will discuss ways to create clean growth and mitigate climate change, while at the same time developing our natural resources sustainably and creating good, middle class jobs. They will also focus on health care and infrastructure needs, transfers to provinces and territories, and Northern priorities.</p>\n\n<p>First Ministers will also meet with leaders of the Assembly of First Nations, the Inuit Tapiriit Kanatami, and the Métis National Council on March 12, 2020. They will discuss how they can work together to advance the priorities of First Nations, Inuit, and the Métis Nation.</p>\n\n<h2><strong>Quotes</strong></h2>\n\n<blockquote>\n<p>“Canadians have been clear about the importance of working together to address the issues that matter most to them. I look forward to working with the premiers so we can create jobs and economic growth, build healthy and safe communities, fight climate change, and make life more affordable for Canadians. With cooperation, we can create new opportunities for all Canadians and continue to build a country that works for everyone.” &nbsp;</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“There is no relationship more important to me and to Canada than the one with Indigenous peoples. This meeting will focus on how we can work together to make a real difference for Indigenous families and communities across the country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since the last election, the Prime Minister and I have been speaking regularly with provincial and territorial leaders from across the country. We’re focused on how we can continue to build an economy that works for everyone. We are committed to working collaboratively with provincial, territorial, and Indigenous leaders in the interests of all Canadians.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Previous First Ministers’ Meetings focused on the settlement of Syrian refugees, clean growth and climate change, economic competitiveness, and international and internal trade.</li>\n\t<li>This year, the Government of Canada is transferring $81.6 billion to provinces and territories to support important health and social services for Canadians. This includes $41.9 billion for the <a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/canada-health-transfer.html\">Canada Health Transfer</a>, $15 billion for the <a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/canada-social-transfer.html\">Canada Social Transfer</a>, $20.6 billion in <a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/equalization.html\">equalization payments</a>, and $4.2 billion under the <a href=\"https://www.canada.ca/en/department-finance/programs/federal-transfers/territorial-formula-financing.html\">Territorial Formula Financing</a> program.</li>\n\t<li>Budget&nbsp;2017 committed $11 billion over 10 years in targeted funding for provinces and territories to improve access to mental health and addiction services, as well as for home and community care, in support of the Common Statement of Principles on Shared Health Priorities. &nbsp;</li>\n\t<li>Through its Investing in Canada plan, the Government of Canada is investing more than $180 billion over 12 years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities, to create long-term economic growth, support a low-carbon, green economy, and build inclusive communities.</li>\n\t<li>The Government of Canada is committed to work with provinces and territories to reduce trade barriers. In 2019, the Government of Canada amended the <em>Importation of Intoxicating Liquor Act</em>, removing all remaining barriers to interprovincial trade of alcohol.&nbsp;</li>\n\t<li>Federal, provincial, and territorial partners are working to implement the Pan-Canadian Framework on Clean Growth and Climate Change. The Framework includes more than 50 actions to reduce emissions, grow the economy, and adapt to a changing climate.</li>\n\t<li>Since 2015, First Ministers have met with national Indigenous leaders of the Assembly of First Nations, the Inuit Tapiriit Kanatami and the Métis National Council, in advance of the First Ministers’ Meeting.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadaspremiers.ca/about/\">Canada’s Premiers</a></li>\n</ul></div>\n      "
}