{
  "path": "/en/news/statements/2017/10/10/statement-prime-minister-world-mental-health-day",
  "pageTitle": "Statement by the Prime Minister for World Mental Health Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for World Mental Health Day:</p><p>“Today Canadians and people around the world reflect on the central role that mental health plays in our lives. On <a href=\"http://www.who.int/mental_health/world-mental-health-day/2017/en/\">World Mental Health Day</a>, we raise awareness about how to better address the mental health issues that affect us, our loved ones, our workplaces, and our communities.</p><p>“Mental health is a vital part of our overall wellbeing, and everyone deserves access to the mental health care and support they need. Today is a chance to celebrate the people who are working to make mental health care a reality around the world – and a reminder that all of us have a role to play to fight stigma and create cultures where we can talk openly about mental health. We also recognize the importance of the lived experience of those directly affected by a mental health issue, and of their loved ones. Their stories and voices must be at the core of efforts to improve mental health care for all.</p><p>“This year’s theme – <i>Mental Health in the Workplace</i> – reminds us that for many people, work can be a source of stress and lead to mental health challenges. It is up to all of us to create workplaces that promote mental health and respond to employees’ diverse needs. As an employer, the government is working to ensure workplaces are healthy and safe. We also recognize that women face particular challenges in the workplace, and bear a disproportionate responsibility for mental health care. We all benefit when women participate fully in our economy and our communities, and we must do more to build workplaces that are free of discrimination, and safe and healthy for people of all gender identities.</p><p>“Canada has made important advances in mental health care, and our Government is committed to continue to promote care, support, and services. Budget 2017 includes $5 billion over 10 years to support mental health initiatives across Canada – the first time the federal government has prioritized mental health in health agreements with provinces and territories. Last week, we launched a new suicide prevention strategy for our active service members and veterans, to make sure we are providing them with the best care possible. We are making major investments in housing and in jobs and skills training – because access to safe, adequate, and affordable housing and a well-paying job are critical factors in our health, both physical and mental. Budget 2017 also pledges over $200 million over the next five years to increase support for mental health services for First Nations and Inuit, building on Indigenous-led initiatives.</p><p>“Today, I especially want to thank all those who have shared their stories and experiences around mental health – including my mother, Margaret. Their courage and openness have helped to fight stigma and made it easier for us to talk openly about mental health. Together, we can build on their efforts, and support the mental health of Canadians for generations to come.”</p></div>\n      "
}