{
  "path": "/en/news/statements/2018/10/17/statement-prime-minister-international-day-eradication-poverty",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Eradication of Poverty | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Eradication of Poverty:</p><p>“Today, on the <a href=\"http://www.un.org/en/events/povertyday/\">International Day for the Eradication of Poverty</a>, we join people around the world to reflect on the progress we have made to end poverty, and acknowledge the work that we have left to do to improve the well-being of all, here in Canada and around the world.</p><p>“This year’s theme is ‘Coming together with those furthest behind to build an inclusive world of universal respect for human rights and dignity.’ As we mark the 70th anniversary of the proclamation of <a href=\"http://www.un.org/en/universal-declaration-human-rights/\">Universal Declaration of Human Rights</a>, this theme urges us to work together to overcome poverty and ensure no one is left behind.</p><p>“The Government of Canada has taken a number of steps to extend the ladder of opportunity to more people, and help families who are working hard to make ends meet. In 2016, we introduced the Canada Child Benefit (CCB) – a simpler, tax-free, new child benefit better targeted to those who need it most. Since then, the CCB has helped lift more than half a million people – including 300,000 children – out of poverty.</p><p>“We recently launched <a href=\"https://www.canada.ca/en/employment-social-development/news/2018/08/government-of-canada-launches-first-poverty-reduction-strategy.html\">Opportunity for All – Canada’s First Poverty Reduction Strategy</a>, which builds on investments to tackle poverty and help more Canadians join the middle class. This strategy commits to reduce poverty in Canada by 20 per cent by 2020, and 50 per cent by 2030. These specific targets reflect our commitment to implement the United Nations Sustainable Development Goals at home and abroad, and will make Canada a world leader in poverty reduction.</p><p>“We are also working with provinces, territories, municipalities, Indigenous peoples, and community groups who are actively combatting poverty in Canada, to make sure our programs and policies are effective, complementary, and benefit those who need them most.</p><p>“Beyond our borders, Canada has taken a leadership role to create a fairer world for the most vulnerable, especially women and girls. We adopted a <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, which seeks to eradicate poverty and makes empowering women and girls the focus of all our international assistance. During the <a href=\"https://g7.gc.ca/en/\">2018 G7 Summit</a>, Canada and partners announced nearly $3.8 billion CAD in education for women and girls in crisis and conflict situations. This historic investment is the largest of its kind ever made, and will make a major difference in the lives of millions of people in the most vulnerable situations. At this year’s United Nations General Assembly, Canada welcomed an additional $527 million CAD from partners to help developing countries give every child access to quality education and modern skills training.</p><p>“A successful country is one in which everyone can work hard and build a better future for themselves and their kids. Over the last three years, we have made historic and meaningful investments across the country – and our plan is working. The unemployment rate is at a 40-year low. Wages are growing faster than they have in a decade. We will continue to make real progress for the middle class and people working hard to join it, and build an economy that gives every hardworking Canadian a fair shot at success.”</p></div>\n      "
}