{
  "path": "/en/news/statements/2017/10/16/statement-prime-minister-small-business-week",
  "pageTitle": "Statement by the Prime Minister on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Small Business Week, which runs from October 15 to 21, 2017:</p><p>“This week is Small Business Week, a time to celebrate and thank Canada’s small and medium sized businesses for their immense contributions to our country’s prosperity. It is also an opportunity for current and aspiring entrepreneurs to connect, share experiences, and learn new ways to make their businesses even more successful.</p><p>“Small business owners move Canada forward. They invest in our communities, transform new ideas into market-ready products and services, and unlock economic opportunities that create jobs and grow the middle class.</p><p>“Small businesses are the backbone of our economy. They make up 98 per cent of all business operations in Canada, employ over 70 per cent of the total labour force in the private sector, and contribute more than 30 per cent to our gross domestic product.</p><p>“We know that when small businesses prosper, so does Canada. That is why Budget 2017 introduced the Innovation and Skills Plan to remove barriers and help small and medium sized businesses reach new markets, and to ensure that they have the technology, talent, and tools they need to thrive, grow, and prosper. That is also why we have been meeting with small businesses and listening to their feedback as we work toward making Canada’s tax system more fair and competitive.</p><p>“Today, I joined Ministers Morneau and Chagger to announce that the <a href=\"http://www.fin.gc.ca/n17/17-097-eng.asp\">Government intends to lower the small business tax rate</a> to ten per cent in 2018 and to nine per cent in 2019. These tax cuts will fulfill a promise we made to Canada’s small business owners and, more importantly, make sure that they can keep more of their hard-earned money to invest back into their businesses, their employees, and their communities.</p><p>“On behalf of the Government of Canada, I invite all Canadians to participate in events across the country to celebrate Small Business Week. I thank the Business Development Bank of Canada for their annual organization of this special week and wish them every success with this year’s activities.”</p></div>\n      "
}