{
  "path": "/en/news/statements/2020/12/10/statement-prime-minister-mark-start-hanukkah",
  "pageTitle": "Statement by the Prime Minister to mark the start of Hanukkah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the start of Hanukkah:</p>\n\n<p>“Today at sundown, Jewish communities in Canada and around the world will welcome the beginning of Hanukkah, also known as the Festival of Lights.</p>\n\n<p>“Hanukkah is a time to commemorate the rededication of the Second Temple in Jerusalem, and celebrate the resilience of the Jewish people and their triumph over great hardship.</p>\n\n<p>“For eight nights, families and loved ones would normally gather to sing, spin dreidels, eat latkes and sufganiyot, and light the candles of the hanukkiah, one by one. This year’s celebrations will look different due to the global COVID-19 pandemic, but the essence of Hanukkah remains the same. Stories about the power of hope, optimism, and perseverance will continue to remind us that it is always possible to find positivity in difficult times.</p>\n\n<p>“Today, we recognize the important contributions that Jewish Canadians and Jewish community organizations make to our country every day and especially since the start of the pandemic. These community organizations are supporting seniors, ensuring that our most vulnerable have food on the table, helping those with mental health challenges, providing employment services, and much more. There are also many Jewish Canadians who have been working on the front lines to support and protect us. To all of you: thank you.</p>\n\n<p>“Let’s also take this opportunity to recommit ourselves to combatting antisemitism and hatred because they have no place in Canada – or anywhere else. The Government of Canada will always stand with the Jewish community. Together, we will continue to build a better Canada where we can celebrate our diversity and promote inclusion.</p>\n\n<p>“On behalf of all Canadians, Sophie and I wish all those celebrating a happy, peaceful, and blessed Hanukkah.</p>\n\n<p>“Chag Hanukkah Sameach.”</p></div>\n      "
}