{
  "path": "/en/news/news-releases/2023/02/27/creating-good-jobs-health-research-and-innovation",
  "pageTitle": "Creating good jobs in health research and innovation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>When innovation and investments in health research come together to create good middle-class jobs, everyone benefits. That’s why we are supporting researchers and companies in Canada to deliver vaccines, conduct cutting-edge research in life sciences and biomanufacturing, and promote health and safety at home and around the world.</p>\n\n<p>Today, the Prime Minister, Justin Trudeau, participated in the announcement that AstraZeneca has chosen Canada for a major expansion of their research activities, at their hub located in Mississauga, Ontario. The company’s significant global investment in Canada’s life sciences and biomanufacturing sectors will create 500 highly skilled jobs and support the development of treatments for complex diseases like cancer.</p>\n\n<p>In recent years, Canada has built a strong and competitive environment for the life sciences and biomanufacturing sectors, thanks to government investments, highly skilled workers, and world-class students and researchers. Over the last two years, the federal government has committed more than $1.8&nbsp;billion to 33 projects in biomanufacturing, vaccines, and therapeutics, strengthening our domestic ability to respond to pandemics, supporting innovations in life sciences, and creating and maintaining thousands of highly skilled jobs.</p>\n\n<p>Improving health care is top of mind for many Canadians across the country right now. That’s why we recently announced that the Government of Canada will increase health funding by $198.6&nbsp;billion over 10 years, while working with the provinces and territories to ensure that new funding delivers real results like better access to family health teams and mental health services.</p>\n\n<p>By supporting the health of Canadians and the growth of the biomanufacturing and life sciences sectors in Canada, we are reversing decades of declining capacity and positioning Canada as a global leader in health research and new technology platforms that will protect Canadians and people around the world. We will continue to grow the economy, create good jobs, and improve the health of Canadians now and into the future.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“To deliver better healthcare, it’s important to invest in our public, universal system – and it’s also important to continue rebuilding our biomanufacturing capacity and investing in research and development. That’s exactly why we’re here today: We’re positioning Canada as a world leader in the sector, delivering better health outcomes for Canadians, and creating good jobs now and into the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In order to protect Canadians’ health, our government has taken every action possible to be equipped with the best tools possible. That’s why we have worked closely with companies like AstraZeneca over the years. This investment shows that our efforts and hard work in the Canadian health sector are paying off by attracting major new investments from innovative global health leaders. We’re proud to see the results of our Biomanufacturing and Life Sciences Strategy, whilst creating hundreds of well-paying jobs in Mississauga.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Launched in 2021, the Government of Canada’s Biomanufacturing and Life Sciences Strategy presents a long-term vision to protect Canadians against future pandemics and other health emergencies.</li>\n\t<li>Budget&nbsp;2021 provided a total of $2.2&nbsp;billion over seven years toward growing a vibrant domestic life sciences sector and securing pandemic preparedness. This funding is helping to build Canada’s talent pipeline and research systems, as well as fostering the growth of Canadian life science firms.</li>\n\t<li>The Government of Canada has helped significantly bolster domestic biomanufacturing capacity across the country in recent years.\n\t<ul class=\"bulletOutline\">\n\t\t<li>An investment of $126&nbsp;million announced in August 2020 to build a new Biologics Manufacturing Centre at the National Research Council Canada’s Royalmount site in Montréal, which will be capable of producing approximately 24&nbsp;million vaccine doses annually;</li>\n\t\t<li>Signing a memorandum of understanding with Moderna to build a state-of-the-art mRNA vaccine production facility in Laval, Quebec, which will produce up to 100 million made-in-Canada mRNA vaccine doses annually;</li>\n\t\t<li>Through the <a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a>, the government has supported projects from coast to coast to coast. This includes up to $415 million to support Sanofi in building an end-to-end influenza vaccine manufacturing facility in Toronto, Ontario; up to $175.6 million for AbCellera toward its antibody therapy research and the construction of an antibody production facility in British Columbia; $39.8 million for BioVectra to build a state-of-the-art facility in Prince Edward Island and reconfigure their facilities in Nova Scotia.</li>\n\t</ul>\n\t</li>\n\t<li>AstraZeneca is a global biopharmaceutical company headquartered in Cambridge, United Kingdom, employing more than 83,000 people worldwide. The company focuses on cardiovascular, renal, and metabolism; oncology, respiratory, and immunology; rare diseases; infection and vaccines.</li>\n\t<li>AstraZeneca employs over 1,200 staff in Canada, including 700 employees at its head office and clinical research hub in Mississauga, Ontario. In 2021, the company reported $135&nbsp;million in research and development investment in Canada. Its Mississauga site is a strategic Global Clinical Hub, leading more than 100 clinical studies worldwide.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://ised-isde.canada.ca/site/biomanufacturing/en/overview-canadas-biomanufacturing-and-life-sciences-strategy\">Canada’s Biomanufacturing and Life Sciences Strategy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/07/producing-vaccines-creating-good-jobs-and-building-economy-works-all\">Producing vaccines, creating good jobs, and building an economy that works for all Canadians</a></li>\n\t<li><a href=\"http://www.canada.ca/en/innovation-science-economic-development/news/2022/03/government-of-canada-advances-domestic-life-sciences-sector-by-supporting-canadian-companies-talent-and-research-and-development.html\">Government of Canada advances domestic life sciences sector by supporting Canadian companies, talent, and research and development</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/02/07/working-together-improve-health-care-canadians\">Working together to improve health care for Canadians</a></li>\n\t<li><a href=\"https://www.astrazeneca.com/\">AstraZeneca</a></li>\n</ul></div>\n      "
}