{
  "path": "/en/news/statements/2019/12/31/statement-prime-minister-mark-new-year",
  "pageTitle": "Statement by the Prime Minister to mark the New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the New Year:</p>\n\n<p>“Happy New Year, Canada!</p>\n\n<p>“Tonight, from coast to coast to coast, Canadians will gather with family and friends to celebrate the holidays and reflect on the accomplishments of 2019. While we count down to midnight, we look forward to a new year—and a new decade—full of promise and hope.</p>\n\n<p>“The new year brings fresh opportunities, and making the most of them means finding common ground and shared purpose. In 2019, together, we made important progress for all Canadians, from lifting 900,000 people out of poverty to moving forward with trade and investment deals like the new NAFTA that work for the middle class. This year we announced that we are protecting our planet by taking action to ban harmful single-use plastics where science warrants it, and reaching for the stars by joining the mission to the Moon. As we ring in 2020, let’s remember that this spirit of teamwork is what got us here today, and that it remains our path forward.</p>\n\n<p>“In the coming year, our government will continue to focus on the issues that matter most to Canadians across the country, from fighting climate change and strengthening the middle class, to walking the road of reconciliation, keeping people safe and healthy, and positioning Canada for success in an uncertain world.</p>\n\n<p>“Let’s begin this next decade by recommitting ourselves to the values of respect, openness, and compassion that define us as Canadians. By coming together as neighbours and putting community first, we will build a brighter tomorrow for everyone.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish you and your loved ones a wonderful night and all the very best in 2020.”</p></div>\n      "
}