{
  "path": "/en/news/news-releases/2021/12/10/prime-minister-welcomes-twenty-eighth-annual-report-public-service",
  "pageTitle": "Prime Minister welcomes the Twenty-Eighth Annual Report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Twenty-Eighth Annual Report to the Prime Minister on the Public Service of Canada, which was presented by Ian Shugart, Clerk of the Privy Council and Head of the Federal Public Service.</p>\n\n<p>The report outlines the important role the federal Public Service has played in supporting the Government of Canada’s response to the COVID-19 pandemic. It highlights the many ways that public servants have helped keep their fellow Canadians safe and healthy, while continuing to provide services and deliver the Government of Canada’s agenda.&nbsp;</p>\n\n<p>The report emphasizes that while early progress has been made, much more needs to be done to foster a more diverse and inclusive Public Service. Earlier this year, Clerk Shugart issued a Call to Action on Anti-Racism, Equity, and Inclusion in the Federal Public Service, which established expectations for leaders at all levels, to continue and accelerate meaningful change.</p>\n\n<p>Additionally, the report reflects on the lessons learned since the start of the pandemic, and sets the stage for considering which practices to sustain going forward, to create lasting change in the Public Service for the benefit of all Canadians.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada’s Public Service has played a central role in the Government of Canada’s response to the COVID-19 pandemic. I encourage Canadians to read the Clerk’s Report to get a better sense of just how much our country’s public servants have accomplished over the past year despite incredibly challenging circumstances. In the months and years ahead, I know we can count on Canada’s world-class Public Service to continue to innovate and get the job done, as we finish the fight against COVID-19 and build back a better Canada for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Fact</h2>\n\n<ul>\n\t<li>The Government of Canada first introduced the Annual Report to the Prime Minister on the Public Service of Canada in 1992 – a requirement under section&nbsp;127 of the <em>Public Service Employment Act</em>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/corporate/transparency/annual-report-prime-minister-public-service/28th.html\">Twenty-Eighth Annual Report to the Prime Minister on the Public Service of Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/corporate/clerk/call-to-action-anti-racism-equity-inclusion-federal-public-service.html\">Call to Action on Anti-Racism, Equity, and Inclusion in the Federal Public Service</a></li>\n</ul></div>\n      "
}