{
  "path": "/en/news/statements/2022/05/23/statement-prime-minister-anniversary-komagata-maru-incident",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the Komagata Maru incident | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the Komagata Maru incident:</p>\n\n<p>“In the spring of 1914, 376 Sikhs, Muslims, and Hindus of South Asian origin arrived in Vancouver’s harbour aboard the <em>Komagata Maru</em> steamship. Like millions of others before and after them, they hoped to settle into Canada and build a better life for themselves and their families.</p>\n\n<p>“Due to the racist and discriminatory laws of the time, most of the passengers were refused entry into Canada and detained on board. For two months, Canadian immigration officials confined them to the ship and denied them sufficient access to medical aid, food, or water. Despite the best efforts of the local South Asian community, the passengers lost their appeal in Canadian court and were forced to return to India, where some were killed and many others imprisoned.</p>\n\n<p>“We will never forget the pain and suffering of those who lived through these shameful events at the hands of the Canadian government. Six years ago, I stood in the House of Commons to apologize on behalf of the Government of Canada to all those affected by the Komagata Maru incident. Today and every day, what happened more than a century ago serves as a reminder to all Canadians of the importance of treating each other with dignity and respect, fighting racism and discrimination in all its forms, and promoting equity and inclusion. We will continue to learn from the mistakes of our past to ensure they never happen again.</p>\n\n<p>“As we pay tribute to the victims of the Komagata Maru incident and their descendants, I&nbsp;encourage everyone to reflect on the many contributions Canada’s South Asian communities have made and continue to make to our country. Today, we reaffirm our commitment to build a better country for everyone. Canada is strong, not in spite of our differences, but because of them.”</p></div>\n      "
}