{
  "path": "/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-meets-prime-minister-barbados-mia-mottley",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Prime Minister of Barbados Mia Mottley | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of Barbados, Mia Mottley, on the margins of the Summit of the Americas.</p>\n\n<p>The two leaders discussed how the Russian invasion of Ukraine undermined the international rules-based order and fostered the food security crisis experienced around the world. They also exchanged on the multiple pressures bearing down on countries across the globe, including climate change, the COVID-19 pandemic, and sharply rising food and energy costs. Prime Minister Trudeau recognized that certain countries, including small island and low-lying coastal states, experience these pressures more acutely, and without timely and adequate access to sustainable financing, will not be able to meet the needs of their citizens. The prime ministers noted that poverty, including inequality and deep pockets of impoverishment in middle-income countries, hinder countries’ ability to achieve the United Nations Sustainable Development Goals (SDGs). They also discussed their <a href=\"https://pm.gc.ca/en/news/statements/2022/06/08/building-sustainable-resilient-and-equitable-future-through-sustainable\">priorities as Co-Chairs of the United Nations Secretary-General’s SDGs Advocates group</a> over the next two years.</p>\n\n<p>The two leaders agreed on the need for sustained, inclusive, collective responses to these challenges that will meet the urgency of the moment. Prime Minister Trudeau highlighted Canada’s engagement with key actors in support of greater financial inclusion, including the private sector, international financial institutions, and multilateral development banks.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Mottley agreed to remain in close touch and to meeting again in person soon.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/27/prime-minister-justin-trudeau-speaks-prime-minister-barbados-mia-mottley\">Prime Minister Justin Trudeau speaks with Prime Minister of Barbados Mia Mottley</a></li>\n</ul></div>\n      "
}