{
  "path": "/en/news/statements/2022/04/22/statement-prime-minister-death-guy-lafleur",
  "pageTitle": "Statement by the Prime Minister on the death of Guy Lafleur | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Guy Lafleur:</p>\n\n<p>“I was saddened to hear of the passing of hockey legend, Guy Lafleur. He was unlike anyone else on the ice – his speed, skill, and scoring were hard to believe.</p>\n\n<p>“Throughout the 1970s and 1980s, Mr. Lafleur enthralled fans across the country and throughout North America in the old Montreal Forum, winning five Stanley Cup championships while playing with the Montreal Canadiens. He went on to play with the New York Rangers and Quebec Nordiques, becoming only the second player to play in the National Hockey League after induction into the Hockey Hall of Fame.</p>\n\n<p>“As a child, Mr. Lafleur loved the game so much that he would sleep in his hockey equipment so that he could jump on the rink as soon as he woke up. Later in life, his impressive shot and skating prowess earned him the nickname le ‘Démon blond’, and won his adversaries’ admiration, winning him three Lester B. Pearson Awards for most outstanding player, as decided by fellow players. To this day, he remains the all-time points leader of all those who have worn ‘la Sainte-Flanelle’ of the 24-time Stanley Cup champion Montreal Canadiens.</p>\n\n<p>“In 1980, Mr. Lafleur was appointed an Officer of the Order of Canada. He was also inducted into Canada’s Sports Hall of Fame in 1996, and appointed a Knight of the Ordre national du Québec in 2005.</p>\n\n<p>“On behalf of all Canadians, Sophie and I wish to express our deepest sympathies to Guy Lafleur’s family and friends. My thoughts are with all who are mourning this tremendous loss – in Quebec, across Canada, and around the world. We’ll miss you, Number 10.”</p></div>\n      "
}