{
  "path": "/en/news/statements/2022/06/08/statement-prime-minister-world-oceans-day",
  "pageTitle": "Statement by the Prime Minister on World Oceans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Oceans Day:</p>\n\n<p>“Today, we join people around the world in celebrating World Oceans Day. With the longest coastline in the world, our oceans are part of who we are as Canadians from coast to coast to coast. They support our workers, our communities, and our local economies.</p>\n\n<p>“This year’s theme, ‘<a href=\"https://unworldoceansday.org/un-world-oceans-day-2022/\">Revitalization: Collective Action for the Ocean</a>’, invites us all to work together to keep our oceans and coasts healthy. Over the past six years, the government has taken historic action to do just that. From keeping plastic pollution out of our waters to protecting more of our coasts than ever before, we are working together with Canadians, Indigenous Peoples, coastal communities, and our international partners every step of the way.</p>\n\n<p>“The government has stepped up its actions to tackle plastic pollution. No one wants to see plastic litter on their local beaches or in their communities, which is why we are banning harmful single-use plastics that far too often end up in our marine environments and harm wildlife. We are committed to ending plastic waste by 2030 through improving plastic recycling, and we’re working with our international partners through championing the <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a>.</p>\n\n<p>“We have also made major progress in protecting our oceans. Since 2015, we have gone from protecting less than one per cent of Canada’s marine coastal areas to over 14 per cent today – exceeding our conservation goal ahead of schedule. There’s more work to be done to protect a quarter of our oceans by 2025, and 30 per cent by 2030, which is why we invested a historic $1 billion just last year to get there.</p>\n\n<p>“That is why, in Budget&nbsp;2022, we proposed an additional $2 billion over nine years to renew and expand the <a href=\"https://tc.canada.ca/en/campaigns/protecting-our-coasts-oceans-protection-plan\">Oceans Protection Plan</a>. Since its launch in 2016, it has made shipping safer, protected marine animals and coasts, improved Canada’s ability to prevent and respond to marine incidents, and strengthened meaningful partnerships with Indigenous Peoples and coastal communities.</p>\n\n<p>“As we do this work at home, we’re also teaming up with international partners. Just this week, ahead of the Summit of the Americas this week, I announced that Canada will co-sponsor Chile’s Americas for the Protection of the Ocean Declaration. This initiative will bring countries together to keep the Pacific Ocean clean and healthy.</p>\n\n<p>“On behalf of the Government of Canada, I encourage everyone to celebrate World Oceans Day. Today and every day, we all share the collective responsibility to keep our oceans and coasts healthy and the Government of Canada will continue working together with all Canadians, Indigenous Peoples, and partners around the world to create a brighter future for our children and grandchildren.”</p></div>\n      "
}