{
  "path": "/en/news/news-releases/2021/12/09/prime-minister-focuses-protecting-democracy-summit-democracy",
  "pageTitle": "Prime Minister focuses on protecting democracy at Summit for Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Respecting human rights and freedoms, holding free and fair elections, and adhering to the rule of law are essential for our democracies to thrive. By protecting, promoting, and expanding our democratic values and institutions, we will create a more secure, stable, and prosperous world for future generations.</p>\n\n<p>The Prime Minister, Justin Trudeau, today joined leaders from government, civil society, and the private sector at the Summit for Democracy, to take collective action to strengthen and revitalize democracy, and tackle the greatest threats facing our democracies. The virtual event, hosted by the President of the United States of America, Joe Biden, comes at a time when democracies around the world are facing unprecedented challenges.</p>\n\n<p>In Canada’s national statement, Prime Minister Trudeau will emphasize that democracy is not something countries can take for granted, and that leaders need to work together to constantly renew our democracies so that they continue to deliver for people. He will also affirm that Canada remains committed to working collaboratively with governments and defenders of democracy, including journalists, civil society leaders, academics, and beyond, to promote democratic renewal at home and abroad.</p>\n\n<p>To advance democracy and defend against authoritarianism, the Prime Minister announced the establishment of a new Canadian centre to better support democracy and good governance around the world. Canada will also strengthen its capacity to provide fast and flexible support to fragile or emerging democracies through international assistance and diplomatic efforts. This will improve the timeliness, flexibility, and agility of responses to sudden democratic and human rights crises.</p>\n\n<p>To continue to advance respect for human rights, the Prime Minister announced that Canada will provide $5 million in additional funding to the Office of the United Nations (UN) High Commissioner for Human Rights in 2021. Canada will also increase support for the US State Department’s emergency assistance and capacity building programs focused on protecting LGBTQ2 persons, religious minorities, and civil society organizations (CSO) through contributions of $1 million each to the Global Equality Fund, the International Religious Freedom Fund, and the Lifeline Embattled CSO Fund.</p>\n\n<p>The Prime Minister also highlighted Canada’s strong global leadership to address arbitrary detention by establishing the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/arbitrary_detention-detention_arbitraire.aspx?lang=eng#a1\">Declaration Against Arbitrary Detention in State-to-State Relations</a>, which has been endorsed by more than 65 states. In 2022, Canada will continue to demonstrate leadership to advance shared democratic values and ideals as Chair of the <a href=\"https://www.idea.int/about-us\">International Institute for Democracy and Electoral Assistance</a> (IDEA), Chair of the <a href=\"https://freedomonlinecoalition.com/\">Freedom Online Coalition</a>, and Co-chair of the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/freedom_expression_media-liberte_expression_medias.aspx?lang=eng\">Media Freedom Coalition</a>.</p>\n\n<p>The Government of Canada recognizes that for democracy to prosper, it must be inclusive. That is why the Prime Minister announced that Canada will increase its support for women’s leadership and political participation through a new contribution of $1 million to the Westminster Foundation for Democracy with a focus on ASEAN countries.</p>\n\n<p>Digital technologies possess enormous potential for public good, but we must ensure that the rights and freedoms that individuals enjoy offline are also protected online. Canada has been a champion for digital inclusion and human rights online, including the freedoms of expression, association, and peaceful assembly, as well as online privacy. The Prime Minister announced a call for proposals, with a value of $3 million to support innovative initiatives to ensure that technology supports democracy and open societies.</p>\n\n<p>Preventing and fighting corruption remains a critical component of democratic renewal. To address and fight corruption globally, Canada will convene a high-level roundtable in 2022 to examine effective ways to strengthen international legal frameworks to combat corruption globally. Canada will also continue to support capacity-building initiatives to enhance the ability of foreign states to combat corruption, such as organized crime and money laundering, and ensure the transparent governance of national resources in developing countries.</p>\n\n<p>Democratic renewal begins at home, and the Prime Minister emphasized that governments must work to ensure that people in all their diversity, including marginalized people, can make their voices heard. Throughout the Summit, the Prime Minister showcased Canada’s extensive domestic action to defend democracy and safeguard our institutions, including through the <a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Plan to Protect Canada’s Democracy</a>.</p>\n\n<p>At home and abroad, the Government of Canada remains steadfast in its commitment to democracy, which is best suited to tackling the great challenges of our time and addressing the issues that matter most to Canadians. Together we will continue to advance democracy at home and around the world so we can build a better future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We must work together to meet the challenges of today and tomorrow. I thank President Biden for hosting the important Summit for Democracy, which comes at a critical moment for our democracies. Together, we must continue to work to safeguard our institutions, counter the rise of authoritarianism, and protect and expand democratic rights and freedoms worldwide in order to create a more secure, stable, and prosperous world for future generations.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada reaffirms its commitment to work with our partners around the world to address threats and to demonstrate how we can safeguard our own institutions. Public trust is the cornerstone of a healthy democracy and we continue to work collaboratively to ensure Canadians have confidence in their democratic institutions and processes.”</p>\n\n<footer class=\"default\">Hon. Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Democracy, human rights, and the rule of law are central elements of Canada’s foreign policy.</li>\n\t<li>Canada launched the Declaration Against Arbitrary Detention in State-to-State Relations on February 15, 2021. The declaration aims to protect citizens of all countries who live, work, and travel abroad through a concerted commitment to core principles of human rights, consular relations, the rule of law, and the independence of the judiciary.</li>\n\t<li>The International Institute for Democracy and Electoral Assistance (IDEA) is an intergovernmental organization with the mandate to promote and advance democracy worldwide.</li>\n\t<li>The Freedom Online Coalition is a group of 34 countries deeply committed to the promotion and protection of human rights and fundamental freedoms proclaimed in the Universal Declaration of Human Rights.</li>\n\t<li>The Media Freedom Coalition is a partnership of 49 countries working together to advocate for and support media freedom, and the safety of journalists and media workers. Canada and the UK co-hosted the inaugural Global Conference for Media Freedom in 2019 during which Canada and the UK co-founded the Media Freedom Coalition that we continue to co-chair together to this day. Canada co-hosted the second Global Conference for Media Freedom with Botswana in November 2020.</li>\n\t<li><a id=\"_Hlk89709926\" name=\"_Hlk89709926\"></a><a href=\"https://www.ic.gc.ca/eic/site/062.nsf/eng/h_00108.html\">Canada’s Digital Charter</a> is a government-wide approach that encourages trust in the digital marketplace, and enables organizations to harness the power of digital and data transformation. It will ensure that our democratic institutions continue to be protected, and that Canadians will be able to take full advantage of the many new opportunities unlocked by data-driven technologies.</li>\n\t<li>In 2020-21, Canada was the inaugural chair of the Global Partnership on Artificial Intelligence (GPAI), a multi-stakeholder initiative that brings together 24 like-minded countries and the European Union to ensure AI is developed and used responsibly, in a manner consistent with human rights, fundamental freedoms, and our shared democratic values.</li>\n\t<li>The Plan to Protect Canada’s Democracy was launched in 2019 to protect our electoral system against threats. It comprises four pillars of action: enhancing citizen preparedness, improving organizational readiness, combatting foreign interference; and building a healthy information ecosystem.</li>\n\t<li>Measures to protect Canada’s democracy include the <a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy/critical-election-incident-public-protocol/cabinet.html\">Critical Election Incident Public Protocol</a>, a mechanism for communicating with Canadians during a general election in the event of an incident threatening the election’s integrity, and the <a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy/security-task-force.html\">Security and Intelligence Threats to Elections (SITE) Task Force</a>, which addresses and mitigates covert, clandestine, or criminal activities interfering with or influencing electoral processes in Canada.</li>\n\t<li>Canada co-led Principle 3 (Defend Electoral Processes) of the <a href=\"https://www.canada.ca/en/democratic-institutions/services/paris-call-trust-security-cyberspace.html\">Paris Call for Trust and Security in Cyberspace</a>, alongside Microsoft and the Alliance for Securing Democracy. The Paris Call aims to address new cyberspace threats that could endanger citizens and infrastructure through international cooperation and collaboration. This included the development of a good practice guide to support efforts to safeguard elections and democracy.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/12/09/summit-democracy-2021-submission-and-commitments-canada\">Summit for Democracy 2021 Submission and Commitments: Canada</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.state.gov/summit-for-democracy/\">The Summit for Democracy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/protecting-democracy.html\">Protecting democracy</a></li>\n</ul></div>\n      "
}