{
  "path": "/en/news/readouts/2022/02/13/prime-minister-justin-trudeau-speaks-chancellor-olaf-scholz-germany",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor Olaf Scholz of Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Chancellor of Germany, Olaf Scholz, about the Russian military build-up on Ukraine’s borders.</p>\n\n<p>The two leaders shared their concerns over Russia’s aggressive and destabilizing actions in and around Ukraine, and stressed the importance of a diplomatic resolution to the current tensions. They noted their shared commitment to the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The Prime Minister underlined the strength and unity of the Alliance, and emphasized the importance of continued coordination and dialogue between Allies and partners. The two leaders stressed that any further military incursion into Ukraine would have severe costs and consequences, including through coordinated sanctions.</p>\n\n<p>The Prime Minister and Chancellor spoke about strengthening collaboration on fighting climate change, advancing pollution pricing, and expanding the use of&nbsp;clean energy, including hydrogen. They also discussed potential future cooperation on liquefied natural gas.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz agreed to continue working together to address these and other issues of importance to both governments.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/01/canada-extends-and-expands-military-and-other-support-for-the-security-of-ukraine.html\">Canada extends and expands military and other support for the security of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}