{
  "path": "/en/news/news-releases/2017/03/30/prime-minister-canada-announces-support-ford-canada-create-and",
  "pageTitle": "Prime Minister of Canada announces support to Ford of Canada to create and maintain almost 800 jobs for Canadian workers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to making Canada a world-leading centre for innovation and a top destination for businesses to invest, to help create good, well-paying jobs, and strengthen the middle class.</p><p>That is why the Prime Minister, Justin Trudeau, today announced an investment of $102.4 million to Ford Motor Company of Canada, Ltd. The Government of Ontario will contribute an additional $102.4 million in support of this project. These investments will attract an additional $1 billion in research and development spending from Ford of Canada, and lead to the creation and maintenance of almost 800 good, middle class jobs for Canadian workers.</p><p>Today’s announcement will help Ford of Canada transform its Windsor Operations into a world-class engine facility, which will result in an all-new global engine program that will support good, middle class jobs, and ensure the facility’s long-term future.</p><p>These investments will also strengthen Ford of Canada’s research and development capacity at existing facilities, including the Powertrain Engineering Research and Development Centre in Windsor.</p><p>The funding will also help establish the new Research and Engineering Centre in Ottawa, with additional locations in Waterloo and Oakville, which will focus on connectivity research and development across infotainment, in-vehicle modems, gateway modules, driver-assist features, and self-driving cars. The Centre will support good, middle class jobs and equip Canadians working in this sector with the skills they need for the jobs of the future.&nbsp;</p><p>Together, these efforts will help keep Canada’s automotive manufacturing sector globally competitive and innovative, and ensure Ford of Canada keeps its manufacturing facilities in Canada for years to come.</p><h2>Quotes</h2><blockquote><p>“Today’s investments will help create and maintain almost 800 great jobs for Canadians in Windsor and across Ontario, while equipping Canadians with the skills they need to design and build the cars of the future. This is about positioning Canada as a global centre for automotive innovation, creating better opportunities for Canadians, and keeping Canada’s automotive manufacturing sector competitive.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“This investment demonstrates how Ford is transforming to be both an auto and mobility company. With strategic partnerships, Canada can compete and win in the global auto industry.”<br>— <cite>Mark Buzzell, president and CEO, Ford Motor Company of Canada, Ltd.</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The investment comes from the Government of Canada’s Automotive Innovation Fund.</li><li>The Powertrain Engineering Research and Development Centre will develop technologies to make vehicles lighter and more fuel efficient.</li><li>The automotive industry is the country’s second largest manufacturing sector, producing more than 2.3&nbsp;million vehicles every year and contributing $17.5 billion annually to the Canadian economy.</li><li>The auto sector employs more than half a million Canadians, and for every assembly job, it creates six spinoff jobs.</li><li>Ford Motor Company of Canada is Canada’s longest-established automaker.</li><li>Ford Motor Company of Canada operates with one head office, three regional offices, three assembly and engine plants, and two parts distribution centres.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.ic.gc.ca/eic/site/auto-auto.nsf/eng/am02257.html\">Automotive Innovation Fund</a></li><li><a href=\"http://www.budget.gc.ca/home-accueil-en.html\">Budget 2017</a></li><li><a href=\"http://www.ford.ca/\">Ford Motor Company of Canada</a></li></ul></div>\n      "
}