{
  "path": "/en/news/news-releases/2016/01/20/prime-minister-announces-change-leadership-public-service",
  "pageTitle": "Prime Minister announces change in the leadership of the public service | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, announced today that Michael Wernick will become Clerk of the Privy Council and Secretary to Cabinet, effective Friday, January 22.&nbsp;He has been empowered by the Prime Minister to move forward with the renewal of the professional, non-partisan public service.</p>\n<p>The current Clerk of the Privy Council and Secretary to the Cabinet, Ms. Janice Charette, will remain in the public service as Senior Advisor to the Privy Council Office, pending a new assignment. The Prime Minister has asked Mr. Wernick for advice on a process to fill the position on a permanent basis.</p>\n<p><strong>Quote</strong></p>\n<p>“Michael Wernick is an outstanding public service leader. He has the depth of experience and the skills we need to move full speed ahead on the implementation and delivery of our government’s agenda. I believe strongly in the vital role a modern, professional public service plays in our democracy. We will ensure its long history of achievement continues into the future and that its capacity to deliver services to Canadians and advice to government is renewed and enhanced.”</p>\n<p>“I thank Janice Charette for her exemplary service to Canada. She has had a long and distinguished career as a dedicated, hard-working and brilliant public servant, and as Clerk she guided the public service through an election year and my government through a seamless transition.&nbsp;Ms. Charette led the public service through a difficult period with distinction and Canadians should be thankful for her stewardship. Making mental health a workplace priority is a legacy of Janice’s that will better the lives of many public servants for years to come.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}