{
  "path": "/en/news/news-releases/2017/06/12/prime-minister-and-national-chief-assembly-first-nations-sign",
  "pageTitle": "The Prime Minister and the National Chief of the Assembly of First Nations sign Memorandum of Understanding on shared priorities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and the National Chief of the Assembly of First Nations (AFN), Perry Bellegarde, today signed a Memorandum of Understanding (MOU) on shared priorities during the first AFN-Crown meeting under the new permanent bilateral mechanism process.</p><p>The Prime Minister, the National Chief, and other leaders from Canada and the Assembly of First Nations also discussed the next steps in the permanent bilateral mechanism process, which was announced by the Prime Minister in December 2016.</p><p>The MOU will help guide the Government of Canada and the Assembly of First Nations as the parties discuss options to advance shared priorities, assess progress towards goals for First Nations, and facilitate the ongoing work of building a true nation-to-nation relationship between Canada and First Nations.</p><p>Today’s event is a milestone for both the Government of Canada and First Nations. In the weeks and months to come, key Cabinet Ministers will have the opportunity to discuss with First Nations leaders how Canada and the AFN can work together to advance shared priorities, co-develop policy and promote lasting and meaningful reconciliation for the benefit of First Nations members and all Canadians.</p><h2>Quotes</h2><blockquote><p>“I am committed to a renewed relationship with Indigenous Peoples, one based on the recognition of rights, respect, co-operation, and partnership. With the MOU we are signing today, Canada and the Assembly of First Nations recommit to making meaningful and timely progress on the issues that matter most to First Nations and their communities.”<br><cite>– The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“This commitment to meet at least three times a year, with one of those meetings being chaired by the Prime Minister, will help ensure that the government’s priorities are consistent with First Nations priorities. First Nations will set direction for these meetings and the AFN will ensure we are making progress on an agenda as determined by First Nations. This is about action and results for First Nations, which will benefit all Canadians.”<br><cite>– Perry Bellegarde, National Chief of the Assembly of First Nations</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Today's meeting was the third of three 2017 meetings, which are being held as part of the permanent bilateral mechanism process that was committed to by the Prime Minister on December 15, 2016, to establish shared priorities and monitor progress going forward.<ul><li>In February 2017, the Prime Minister and President of Inuit Tapiriit Kanatami signed a Declaration announcing the <a href=\"/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">Inuit-Crown Partnership Committee</a>.</li><li>In April 2017, the Prime Minister and the President of the Métis National Council and its Governing Members signed the <a href=\"/en/news/news-releases/2017/04/12/prime-minister-canada-and-president-métis-national-council-welcome\">Canada-Métis Nation Accord</a> during the first Métis Nation-Crown Summit.</li></ul></li><li>Budget 2017 proposes to invest $13.7 million over two years to support the establishment of new permanent bilateral mechanisms with the Assembly of First Nations and self-governing First Nations, the Inuit Tapiriit Kanatami and self-governing Inuit groups, and the Métis National Council and its Governing Members.</li><li>Budget 2017’s $3.4 billion, building on the historic investments of Budget 2016’s $8.4 billion, will continue to support the aspirations of Indigenous Peoples. It will help build stronger communities and close the socio-economic gap from coast-to-coast-to-coast.</li><li>The Assembly of First Nations is the national organization representing First Nations citizens in Canada.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples</a></li></ul></div>\n      "
}