{
  "path": "/en/news/news-releases/2019/06/11/united-nations-high-commissioner-human-rights-visit-canada",
  "pageTitle": "United Nations High Commissioner for Human Rights to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the United Nations High Commissioner for Human Rights, Michelle Bachelet, will visit Canada from June 16 to 19.</p>\n\n<p>During the visit, Prime Minister Trudeau and High Commissioner Bachelet will discuss efforts to protect human rights and promote gender equality around the world. They will underline the importance of the international rule of law, and emphasize how countries must continue to work together to protect the world’s most vulnerable and make sure everyone’s rights are equally respected.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“High Commissioner Bachelet is a long-standing defender of human rights and a champion for gender equality around the world. I look forward to meeting with her to discuss how we can continue to advance human rights, protect those most vulnerable, and build a world where all people are equally safe and free.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On September 1, 2018, Michelle Bachelet became the seventh United Nations High Commissioner for Human Rights.</li>\n\t<li>Prior to her appointment, High Commissioner Bachelet served two terms as President of Chile, the first from 2006 to 2010 and the second from 2014 to 2018.</li>\n\t<li>The Office of the High Commissioner for Human Rights leads the United Nations’ global human rights efforts and seeks to promote and protect human rights for all. It also provides a forum to identify, highlight, and develop responses to today's human rights challenges and speaks out objectively in the face of human rights violations worldwide.</li>\n\t<li>Canada maintains a strong relationship with the Office of the High Commissioner for Human Rights. In 2016, Canada announced up to $15 million over three years for the organization. Canada has also provided additional targeted funding for country missions and specific programs, including the Human Rights up Front initiative.</li>\n\t<li>Canadian John Humphrey was a principal drafter of the Universal Declaration of Human Rights, which was adopted by the UN General Assembly on December 10, 1948.</li>\n\t<li>The Universal Declaration of Human Rights has been translated in over 500 languages, making it the most translated document in the world.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/canada-united-nations-system/about.html\">Canada and the United Nations human rights system</a></li>\n\t<li><a href=\"https://www.ohchr.org/EN/pages/home.aspx\">Office of the High Commissioner for Human Rights</a></li>\n</ul></div>\n      "
}