{
  "path": "/en/news/news-releases/2020/06/11/prime-minister-announces-appointment-new-chief-justice-quebec",
  "pageTitle": "Prime Minister announces appointment of new Chief Justice of Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Manon Savard, a judge of the Court of Appeal of Quebec, as the new Chief Justice of Quebec.</p>\n\n<p>Chief Justice Savard replaces the Honourable Nicole Duval Hesler, who was the first woman Chief Justice of Quebec. Chief Justice Hesler retired effective April 8, 2020.<strong>&nbsp; &nbsp;&nbsp; &nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Manon Savard continued success as she takes on her new role of Chief Justice of Quebec. Chief Justice Savard brings 23 years of experience practising law in Montréal and, more recently, over 10 years of service as a judge in Quebec. I am confident she will serve Quebecers well in her new position.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial service in the superior courts of Canada.</li>\n\t<li>Chief Justices are appointed by the Governor General, on the advice of Cabinet and on the recommendation of the Prime Minister.</li>\n\t<li>The Chief Justice of Quebec is a judge of the Court of Appeal and exercises the duties of that office as part of a team of 21 other regular judges. The Court also includes a variable number of supernumerary judges, not exceeding 20.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/06/11/honourable-manon-savard\">The Honourable Manon Savard</a></li>\n</ul></div>\n      "
}