{
  "path": "/en/news/news-releases/2018/08/20/amazon-creates-hundreds-jobs-ottawa",
  "pageTitle": "Amazon creates hundreds of jobs in Ottawa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every time you click to buy something online, the many people working behind the scenes help get that product to your doorstep. From receiving orders to packaging and shipping, e‑commerce provides new job opportunities for the middle class and people working hard to join it.</p><p>The Prime Minister, Justin Trudeau, today visited the future site of Amazon’s new 92,900&nbsp;square-metre warehouse in Ottawa’s east end. The facility will create over 1,500&nbsp;construction jobs, and over 600&nbsp;full-time jobs once it opens.</p><p>With the fastest-growing economy in the G7, Canada is a top destination for businesses to invest, grow, and create jobs. The Government of Canada has welcomed many important global investments that have created thousands of good, middle class jobs for Canadians. Today, the country’s unemployment rate is at its lowest level since the 1970s.</p><p>Amazon’s expansion will continue to create good, middle class jobs, and offer new opportunities for Canadians to prepare for the jobs of tomorrow.</p><h2>Quote</h2><blockquote><p>“I am thrilled that Amazon has once again chosen to invest in Canada, and build its next fulfillment centre in Ottawa. This new centre will create over 600 good, middle class jobs for Canadians while further establishing Canada as a hub of tech and innovation.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The company currently employs over 7,000 people in Canada, with corporate offices in Vancouver, Toronto, and Ottawa. It also operates six automated centres in other locations across the country.</li><li>The new facility will join Amazon’s network of fulfillment centres located in Ontario, British Columbia, and Alberta.</li><li>Amazon is considering Toronto as a location for its second headquarters in North America.</li><li>The Government of Canada recently launched <a href=\"http://www.investcanada.ca/\">Invest in Canada</a>, a new federal organization dedicated to attracting job-creating investment and simplifying the process for global businesses looking to make Canada their new home.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://phx.corporate-ir.net/phoenix.zhtml?c=176060&amp;p=irol-newsArticle&amp;ID=2357609\">Amazon to Create More than 600 Full-Time Jobs in Ottawa</a></li><li><a href=\"https://www.canada.ca/en/global-affairs/news/2018/03/government-of-canada-launches-invest-in-canada-to-attract-global-investment-and-create-jobs.html\">Government of Canada launches Invest in Canada to attract global investment and create jobs</a></li></ul></div>\n      "
}