{
  "path": "/en/news/news-releases/2016/05/04/north-american-leaders-meet-ottawa-june-2016",
  "pageTitle": "North American Leaders to meet in Ottawa in June 2016 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that he will meet with the President of the United States of America, Barack Obama, and the President of Mexico, Enrique Peña Nieto, in Ottawa on June 29, 2016, for the <a href=\"//www.international.gc.ca/world-monde/campaign-campagne/nals-slna/nals-2016-slna.aspx?lang=eng\">North American Leaders’ Summit.</a></p>\n<p>The Government of Canada has committed to put people first and deliver help to middle class Canadians. A strong middle class means that hardworking people can look forward to a good standard of living and better prospects for their children. The Prime Minister looks forward to discussing this vision with his counterparts.</p>\n<p>More specifically, the North American Leaders’ Summit will give Canada the chance to work closely with the United States and Mexico, so that each country can create jobs, strengthen their communities, and build a clean growth economy. The leaders will also take important steps to create a more integrated, sustainable, and globally-competitive North American economy.</p>\n<p>This marks the first time since 2007 that Canada will host the Summit, and highlights Canada’s commitment to rebuild the relationship with our North American partners. In the spirit of renewed cooperation, Canada, the United States, and Mexico will work together to leave our continent more prosperous and sustainable than the one we know today.</p>\n<p><strong>Quote</strong></p>\n<p>“I look forward to meeting with President Obama and President Peña Nieto to make real progress on the challenges we collectively face—whether how we can expand trade between our nations, build competitive clean growth economies, or create real help for middle-class families.”<br><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}