{
  "path": "/en/news/news-releases/2018/10/25/netherlands-endorses-canada-led-ocean-plastics-charter",
  "pageTitle": "The Netherlands endorses Canada-led Ocean Plastics Charter | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Netherlands’ endorsement of the Canada-led Ocean Plastics Charter. The <br>endorsement – another example of the leadership shown by both countries in the fight against ocean pollution – was announced during a visit by the Prime Minister of the Netherlands, Mark Rutte, to Ottawa.</p><p>Canada and the Netherlands are partners in protecting our environment, and today’s announcement builds on that partnership. A key outcome of the G7 Summit in June, the Ocean Plastics Charter was initially adopted by Canada, France, Germany, Italy, the United Kingdom, and the European Union. The Charter outlines concrete actions to eradicate plastic pollution, and recognizes the need for urgent action to address the devastating impacts of marine litter on the health and sustainability of our oceans, seas, coastal communities, and ecosystems. In addition to the Netherlands, Jamaica, Kenya, the Marshall Islands, and Norway, as well as 18 companies, have endorsed the Charter since the Summit.</p><p>Today, Canada is also confirming a contribution of $7.5&nbsp;million to support the work of the Global Commission on Adaptation, an initiative spearheaded by the Netherlands. The Commission, convened by 17&nbsp;countries including Canada, promotes the importance of climate adaptation and encourages bold solutions to climate threats. Canada will also work with the Netherlands-hosted Global Center on Adaptation to help address climate adaptation gaps. These partnerships are another example of our close collaboration, and demonstrate our shared commitment to promoting sustainable economic growth and protecting the environment.</p><p>Canada will also launch the new Canadian Centre for Climate Services, which will provide information to Canadians on how the climate is changing where they live and work to help them understand and plan for climate impacts.</p><h2>Quote</h2><blockquote><p>“Canada’s vision is a zero-plastic waste future – and that’s a goal we can only achieve by working closely together. Today, with the Netherlands’ endorsement of the historic Oceans Plastic Charter, we took an important step toward that reality. I look forward to continuing to collaborate with Prime Minister Rutte to leave a cleaner, healthier world for generations to come.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Global Commission on Adaptation was launched in The Hague on October&nbsp;16, 2018. The Commission is overseen by Ban Ki-moon, former United Nations Secretary-General; Bill Gates, co-chair and trustee of the Bill and Melinda Gates Foundation; and Kristalina Georgieva, CEO of the World Bank.</li><li>Canada has agreed to join the Commission and, in addition to providing financial support, will work with the Netherlands and others to help shape its agenda.</li><li>The Canadian Centre for Climate Services will consolidate data, tools and information online and provide support to Canadians so they can adapt to the impacts of climate change. The dedicated service will help people, communities, and businesses&nbsp;plan for climate change by providing reliable climate information – such as future projections for changes in temperature, precipitation, sea ice and snow depth – that can be applied to&nbsp;everyday&nbsp;decisions.</li><li>During the G7 Summit, Canada announced that it would invest $100 million through a marine litter mitigation fund to prevent plastic waste from entering the oceans, address plastic waste on shorelines, and better manage existing plastic resources. Canada also announced $162&nbsp;million to build stronger and more resilient coasts and coastal communities.</li><li>Canada is taking action at home to improve the health of the world’s oceans, including through the national $1.5 billion Oceans Protection Plan. We are working in partnership with Indigenous peoples and coastal communities to protect and support vital aquatic ecosystems, including endangered whale species, and to restore coastal habitats across the country.</li><li>The Government of Canada has committed $12 million for domestic plastic innovation challenges and has pledged to divert at least 75 per cent of the plastic waste from federal government operations by 2030. Canada also joined the Global Ghost Gear Initiative to tackle abandoned fishing gear.</li><li>In addition, the Government of Canada is working with provinces and territories to put a price on pollution. This week, Prime Minister Trudeau announced a new federal pollution pricing system for provinces that have not developed their own. The federal system provides a practical solution that gives all Canadians the incentive to make cleaner choices and businesses the incentive to find clean solutions.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/netherlands-pays_bas/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Netherlands Relations</a></li><li><a href=\"/en/news/news-releases/2018/10/23/government-canada-fighting-climate-change-price-pollution\">Government of Canada fighting climate change with price on pollution</a></li><li><a href=\"https://g7.gc.ca/wp-content/uploads/2018/06/OceanPlasticsCharter.pdf\">Ocean Plastics Charter</a></li><li><a href=\"https://www.tc.gc.ca/eng/oceans-protection-plan.html\">Oceans Protection Plan</a></li></ul></div>\n      "
}