{
  "path": "/en/news/statements/2021/08/08/statement-prime-minister-closing-tokyo-olympic-games",
  "pageTitle": "Statement by the Prime Minister on the closing of the Tokyo Olympic Games | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the closing of the Olympic Games in Tokyo, Japan:</p>\n\n<p>“From July 23 to August 8, 2021, Canadian athletes participated in the Tokyo Olympic Games alongside athletes from around the world. As the Games officially come to a close, I congratulate, on behalf of the whole country, our Canadian athletes on their achievements throughout the past two weeks.</p>\n\n<p>“Over the course of the Games, our athletes made us proud and showed us why Canadians are some of the best athletes in the world. While seven gold medals, six silver medals, and 11 bronze medals are impressive, all of our athletes gave their best and should take pride in their performances. From the new personal bests to the Canadian records broken, we have so much to celebrate. We will never forget Penny Oleksiak becoming the most decorated athlete in Canadian Olympic history and Team Canada winning its first-ever gold medal in women’s soccer.</p>\n\n<p>“In addition to Team Canada’s remarkable performance, our athletes embodied the best of Canada’s values, those of determination, strength, and perseverance, all the while capturing the true spirit and meaning of the Olympics.</p>\n\n<p>“Our Olympians’ performances would not have been possible without the strong support of their coaches, families, friends, and communities. On behalf of all Canadians, I thank them for their contributions. I also thank the countless sport clubs, organizations, and teams which have created a network across the country that yields so many world-class athletes.</p>\n\n<p>“This morning, our Canadian Olympic Team – led by Damian Warner, carrying our Canadian flag – joins athletes from countries around the world at the Closing Ceremony, in a celebration of the athletes’ spectacular triumphs at this year’s Games.</p>\n\n<p>“I extend my thanks to the people of Japan for hosting a successful Olympic Games, in spite of the unprecedented hurdles presented by the global COVID-19 pandemic. We look forward to joining together again for the upcoming Tokyo Paralympic Games, starting on August 24, 2021, where we will see even more great examples of athletic accomplishment.</p>\n\n<p>“I’d like to congratulate all our Olympic athletes. You represent the best of Canada, and your achievements are a testament to Canada’s resilience. Team Canada, you continue to inspire Canadians across the nation.”</p></div>\n      "
}