{
  "path": "/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous",
  "pageTitle": "Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on advancing reconciliation with Inuit, First Nations, and the Métis Nation:</p>\n<p>“Last year, I committed to a renewed relationship with Indigenous Peoples, one based on the recognition of rights, respect, co-operation, and partnership. Today, we take further steps on the journey of reconciliation.</p>\n<p>“First, we will create permanent bilateral mechanisms with the Assembly of First Nations (AFN) and First Nations, the Inuit Tapiriit Kanatami and the four Inuit Nunangat Regions, and the Métis National Council and its governing members. In this Kelowna-like process, every year, we will meet to develop policy on shared priorities, and monitor our progress going forward. Similar meetings with key Cabinet Ministers will take place at least twice each year.</p>\n<p>“Second, we will establish an Interim Board of Directors to make recommendations on the creation of a National Council for Reconciliation. The Interim Board will begin an engagement process to develop recommendations on the scope and mandate of the National Council.</p>\n<p>“Third, we will provide $10 million to support the important work of the National Centre for Truth and Reconciliation located at the University of Manitoba, as recommended in Call to Action 78. This contribution will help to ensure that the history and legacy of Canada’s residential school system is remembered.</p>\n<p>“These announcements build on progress we have made together over the past year. Work is underway on 41 of the Calls to Action outlined in the Final Report of the Truth and Reconciliation Commission that fall under federal or shared purview.</p>\n<p>“While much more remains to be done, I believe that we are making real progress towards renewing our relationship with Indigenous Peoples.”</p></div>\n      "
}