{
  "path": "/en/news/statements/2021/11/11/statement-prime-minister-polands-national-independence-day",
  "pageTitle": "Statement by the Prime Minister on Poland’s National Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Poland’s National Independence Day:</p>\n\n<p>“Today, we celebrate Poland’s National Independence Day with Polish communities in Canada and around the world.</p>\n\n<p>“At the end of the First World War, Poland became a sovereign state after more than 120 years being ruled by other countries. Regaining their independence is a testament to the dedication, strength, and resilience of the Polish people, and the struggles and sacrifices they endured to secure peace, freedom, and democracy.</p>\n\n<p>“On this day, we recognize the longstanding relationship between Canada and Poland. Canadian and Polish soldiers and pilots fought side-by-side in battle as part of the Allied forces during the Second World War. In 1998, Canada became the first NATO country to approve Poland joining the Alliance, and we have since actively contributed to their language and other training. Our countries continue to serve together, including on the Canada-led, multinational NATO enhanced Forward Presence Battle Group in Latvia to ensure a peaceful and stable Europe.</p>\n\n<p>“Today, Canada and Poland work together as members of several international organizations, including the United Nations, the World Trade Organization, and La Francophonie. We are also trading partners through the Canada‑European Union Comprehensive Economic and Trade Agreement, which is helping create new opportunities for people and businesses in both countries.</p>\n\n<p>“Polish Canadians help make Canada the strong, diverse, and inclusive country we know today. The first Polish immigrant settled into Canada in 1752 – more than 100 years before Confederation. Now, more than 1.1&nbsp;million Canadians of Polish origin reside in our country, and their many contributions continue to strengthen our country’s rich social fabric.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to everyone celebrating Poland’s National Independence Day.”</p></div>\n      "
}