{
  "path": "/en/news/news-releases/2017/06/09/prime-minister-underlines-commitment-fight-sex-crimes-and-trafficking",
  "pageTitle": "Prime Minister underlines commitment to fight sex crimes and trafficking | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to combat sexual crime and human trafficking for sexual exploitation. These crimes are global problems that have devastating impacts on their victims.</p><p>That is why the Prime Minister, Justin Trudeau, today underscored that, as part of the Government of Canada’s continued financial support for the Formula 1 Grand Prix du Canada in Montréal, he has asked the Minister of Innovation, Science and Economic Development to monitor – in collaboration with the Province of Quebec, City of Montréal, and other partners – the results of their collective efforts to combat sex crimes and trafficking during this event, and ensure progress is achieved in reducing these criminal acts.</p><p>All three orders of government are collaborating on efforts that aim to reduce sexual exploitation and ensure that the Grand Prix remains a family-friendly event and a positive reflection of all that Montréal has to offer.</p><h2>Quote</h2><blockquote><p>“Sex crimes and trafficking have no place in our country, and certainly not during the F1 Grand Prix weekend in Montréal. Our government is working closely with the Province of Quebec, the City of Montréal, and other partners to combat these activities. I believe these efforts will go a long way to protect some of our most vulnerable women and men. We expect a marked improvement in tackling this longstanding and pernicious problem as part of our ongoing support to the Grand Prix du Canada.”<br>̶ <cite>The Right Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Vulnerable populations at risk of becoming trafficked include migrant workers, new immigrants, youth, Indigenous women and girls, those who are socially or economically disadvantaged, or those who may have been lured to urban centres or have gone of their own free will with the hopes of bettering their lives.</li><li>The RCMP manages the Human Trafficking National Coordination Centre, which provides a focal point for law enforcement in their efforts to combat and disrupt individual and criminal organizations involved in human trafficking activities.&nbsp;</li></ul><h2>Associated Link</h2><ul><li><a href=\"https://www.canada.ca/en/economic-development-quebec-regions/news/2017/06/extension_of_theformula1grandprixducanadainmontrealuntil20290.html\">Extension of the Formula 1 Grand Prix du Canada in Montréal until 2029</a></li></ul></div>\n      "
}