{
  "path": "/en/news/statements/2021/05/03/statement-prime-minister-mental-health-week",
  "pageTitle": "Statement by the Prime Minister on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p>\n\n<p>“Today, we mark the first day of <a href=\"https://mentalhealthweek.ca/\">Mental Health Week</a>. It is an opportunity for Canadians to come together to talk freely about mental health issues without stigma or judgement, listen to others’ stories, and offer support to each other.</p>\n\n<p>“After more than a year, the global COVID-19 pandemic has taken a serious toll on many Canadians’ mental health. As we deal with the uncertainty of new variants and increasing case counts in many parts of the country, people are worried about their health and that of their family and loved ones. Some may be overwhelmed or stressed about the loss of a job, and many are feeling isolated or lonely due to increased public health measures that are keeping us safe. &nbsp;</p>\n\n<p>“Access to reliable, quality mental health care has never been more important, yet, too many Canadians are still unable to get the help they need when they need it most. That is why the Government of Canada continues to take action to strengthen access to mental health services in our country. We have proposed new investments in Budget 2021 to help set national standards for mental health services and to support the <a href=\"https://wellnesstogether.ca/en-CA\">Wellness Together Canada</a> portal that provides 24-hour, free, and confidential mental health and substance use tools and resources. Budget 2021 also proposes new investments for mental health care supports, including for front-line workers and those most affected by COVID-19, veterans, and Indigenous peoples. This builds on the work we have done during the pandemic to invest in mental health services and supports that have made a real difference in the lives of Canadians, including by providing funding to Kids Help Phone.</p>\n\n<p>“Most importantly, we need to be there for each other during this time, and normalize talking about our mental health openly. Everyone around us is facing challenges that we cannot often see or fully understand, and taking time to show empathy for others can make a big difference. Whether you are a parent trying to balance working from home while helping your children learn, an essential worker worried about the risks to yourself and to your family, or missing your routine and feeling separated from your support networks – we see you, and you are not alone.</p>\n\n<p>“Today, and every day, our mental health matters. We can all be part of building healthier communities where we can discuss our mental health with empathy and break down stigma surrounding it. As we continue our fight against COVID-19, let’s recommit to supporting each other, and to reaching out when we need help. Together, we will get through this.”</p></div>\n      "
}