{
  "path": "/en/news/news-releases/2017/09/13/uk-prime-minister-theresa-may-visit-canada",
  "pageTitle": "UK Prime Minister Theresa May to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that Theresa May, Prime Minister of the United Kingdom, will visit Canada on September 18, 2017.</p><p>During the visit, Prime Minister Trudeau will meet with Prime Minister May to further deepen the strong and historic bonds between our two countries, as well as to discuss issues of mutual interest, including innovation, security, climate change, the importance of trade, and advancing gender equality. The two leaders will also discuss our countries’ common commitment to our shared democratic values, as well as ways to ensure ongoing prosperity for citizens of Canada and the UK alike.</p><h2>Quote</h2><blockquote><p>“Canada and the UK enjoy a deep and enduring relationship, forged by centuries of shared history, traditions, and family ties. I look forward to meeting with Prime Minister May again to build on our economic partnership and set the stage for even closer cooperation and greater opportunities for all of our citizens.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Justin Trudeau last met with UK Prime Minister Theresa May at the G7 Summit in May 2017 in Italy.</li><li>In 2011, over 11.3 million Canadians claimed British ancestry. The United Kingdom was the 9th-largest source of new permanent residents in Canada in 2015.</li><li>Tourism is a key industry for both our countries, with 850,000 UK visitors to Canada in 2016, making it the largest source of non-U.S. tourists to Canada, and 1.2 million Canadian visitors to the UK, making it the leading European destination for Canadians in 2015.</li><li>Canada and the UK enjoy a productive commercial relationship. Two-way merchandise trade between Canada and the UK totalled over $25.3 billion in 2016, with Canadian exports being over $17 billion, making the UK Canada’s fifth-largest merchandise trade partner.</li><li>The two countries share a sovereign, and have among the oldest continuous traditions of parliamentary democracy.</li><li>Canada has a number of bilateral agreements with the UK, including agreements on carbon capture and storage technology, taxation, defence training, social security, judicial matters, drug trafficking, film production, and polar research.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom</a></li></ul></div>\n      "
}