{
  "path": "/en/news/readouts/2020/10/27/prime-minister-justin-trudeau-speaks-president-south-korea-moon-jae",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of South Korea Moon Jae-in | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of South Korea, Moon Jae-in.</p>\n\n<p>The two leaders discussed ongoing efforts in Canada and South Korea to address the impacts of COVID-19. Prime Minister Trudeau commended President Moon and the South Korean people for their handling of the pandemic. The leaders committed to keep working together and agreed on the importance of continued global cooperation to fight COVID-19.</p>\n\n<p>The Prime Minister and President noted important milestones in the relationship between Canada and South Korea, including the 70th anniversary of the start of the Korean War. Prime Minister Trudeau thanked President Moon for South Korea’s efforts to honour Canada’s Korean War veterans. The leaders also discussed the fifth anniversary of the Canada-Korea Free Trade Agreement and their strong commitment to rules-based trade.</p>\n\n<p>The leaders agreed to continue their close cooperation to address global and regional challenges.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/korea-coree/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the Republic of Korea (South Korea)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/korea-coree/overview-apercu.aspx?lang=eng\">Canada-Korea Free Trade Agreement (CKFTA)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/10/minister-ng-to-lead-virtual-trade-mission-to-south-korea.html\">Minister Ng to lead virtual trade mission to South Korea</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}