{
  "path": "/en/news/readouts/2021/06/08/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the President of Ukraine, Volodymyr Zelenskyy, ahead of the Prime Minister’s participation in the upcoming G7 Summit and NATO Summit.</p>\n\n<p>The two leaders exchanged views on Russia’s&nbsp;destabilizing actions in the Donbass and Crimea, with the Prime Minister emphasizing Canada’s unwavering commitment to support Ukraine’s sovereignty, security, and territorial integrity. The Prime Minister highlighted Canada’s continuing support for Ukraine’s Euro-Atlantic aspirations.&nbsp;</p>\n\n<p>The two leaders discussed the latest developments on Ukraine International Airlines Flight 752, including the need to continue working closely together to ensure full transparency, accountability, and justice for the victims of the tragedy and their families. The Prime Minister and the President also discussed the situation in Belarus following the forced landing of Ryanair Flight 4978 in Minsk under false pretenses and the subsequent arrest of journalist Raman Pratasevich.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy underlined the close friendship and strong people-to-people links between Canada and Ukraine. They looked forward to continue deepening the relationship between their two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/05/g7-statement-on-belarus.html\">G7 statement on Belarus</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/canada-imposes-new-sanctions-on-individuals-and-entities-involved-in-illegal-annexation-of-crimea.html\">Canada imposes new sanctions on individuals and entities involved in illegal annexation of Crimea</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-canada-mark-first-anniversary-downing-ukraine\">Statement by the Prime Minister of Canada to mark the first anniversary of the downing of Ukraine International Airlines Flight&nbsp;752</a></li>\n</ul></div>\n      "
}