{
  "path": "/en/news/statements/2019/06/20/statement-prime-minister-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/refugeeday/\">World Refugee Day</a>, we stand with people around the world who have been forced to flee their homes. We recognize their resiliency and courage, and come together as an international community to support refugees and displaced people.</p>\n\n<p>“This year marks a somber milestone. Recent <a href=\"https://www.unhcr.org/news/press/2019/6/5d03b22b4/worldwide-displacement-tops-70-million-un-refugee-chief-urges-greater-solidarity.html\">UN counts</a> put the world’s forcibly displaced population at over 70 million – including over 25 million refugees. <a href=\"https://www.unhcr.org/news/stories/2019/6/5d08b6614/global-forced-displacement-tops-70-million.html\">Millions</a> were forced to flee their homes last year, while many more have been unable to return home for years.</p>\n\n<p>“These numbers are staggering. Each represents a story of escape from conflict, insecurity, or persecution. And when people are driven from their homes, that’s often only the beginning of a journey marked by trauma, barriers, and loss. But they want the same thing we all do: to be able to live in peace and raise their families, to rebuild their lives and create a better future for themselves and their communities.</p>\n\n<p>“This is what generations of people have done in Canada. As a country that has welcomed refugees throughout its history, we know first-hand the important contributions they make. The millions of refugees who have resettled here have shaped who we are as a country, and helped build the strong, open, prosperous Canada we know today.</p>\n\n<p>“In 2019, we mark the 40th anniversary of <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2019/04/canada-celebrates-40-years-of-the-refugee-sponsorship-program.html\">Canada’s Private Sponsorship of Refugees Program</a> and celebrate the many Canadians who have provided a safe haven for more than 327,000 refugees since the program launched. Their dedication and compassion are an example to the world. We continue to build on this legacy today, from communities coming together to welcome Syrian refugees, to last year’s historic investment in education for women and girls in conflict and crisis situations, a commitment made under Canada’s G7 presidency.</p>\n\n<p>“People flee home when they have no other choice. Those of us who are more fortunate share a responsibility to help them find refuge and build a new life. That’s why we’ll continue to come to the aid of the most vulnerable, to show openness, and to choose compassion – the foundation for a stronger Canada, and a better world.”</p>\n\n<p>&nbsp;</p></div>\n      "
}