{
  "path": "/en/news/news-releases/2022/03/24/prime-minister-concludes-successful-visit-belgium-and-announces",
  "pageTitle": "Prime Minister concludes successful visit to Belgium and announces additional support for Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today successfully concluded his trip to Brussels, Belgium. The Prime Minister addressed the European Parliament, and participated in an extraordinary North Atlantic Treaty Organization (NATO) Summit and a G7 Heads of State and Government Meeting.</p>\n\n<p>To further build on Canada‘s coordinated response to Russia’s illegal, unprovoked, and unjustifiable aggression against Ukraine, the Prime Minister today announced additional measures to support Ukraine and hold Russia accountable for its invasion, including:</p>\n\n<ul>\n\t<li>Imposing new sanctions under the <em>Special Economic Measures (Russia) Regulations</em> on 160 members of the Russian Federation Council for having facilitated and enabled violations of Ukraine’s sovereignty, independence, and territorial integrity;</li>\n\t<li>Imposing in the coming days new prohibitions under the <em>Special Economic Measures (Russia) Regulations</em> to prohibit the export of certain goods and technologies to Russia, with the aim of undermining and eroding the capabilities of the Russian military;</li>\n\t<li>Allocating the remaining $50 million, from Canada’s $100 million contribution for humanitarian aid to Ukraine and neighbouring countries, including Moldova, to: the World Food Programme, the World Health Organization (WHO), the UN Refugee Agency, the Canadian Red Cross and People in Need to provide immediate assistance where it is needed most; and</li>\n\t<li>Allocating a total $4.8 million to UNESCO to protect Ukraine’s cultural and heritage sites.</li>\n</ul>\n\n<p>On March 23, the Prime Minister addressed the European Parliament where he condemned President Putin’s war of choice and reaffirmed Canada’s steadfast commitment to Euro-Atlantic security, including by calling for further coordinated strong support for Ukraine in response to Russia’s aggression. He spoke of the need to continue working together to promote international peace and security and defend democracy. During his address, the Prime Minister highlighted the close partnership between Canada and the European Union based on our shared values.</p>\n\n<p>On March 24, the Prime Minister met with leaders from Allied countries at the NATO Summit to build on our coordinated response to Russia’s illegal invasion of Ukraine. They discussed the continued coordination of strong support for Ukraine and its people, and further strengthening NATO’s deterrence and defence measures in response to the new security reality in Europe.</p>\n\n<p>The Prime Minister reaffirmed Canada’s steadfast commitment to the Alliance and NATO’s principle of collective defence. He highlighted Canada’s renewed commitment to defending NATO’s eastern flank and supporting eastern Allies through Operation REASSURANCE and Canada’s pledge to deploy additional troops, as part of NATO’s Response Force, if requested by NATO.</p>\n\n<p>The Prime Minister also attended the G7 Heads of State and Government Meeting, where the leaders discussed strengthening G7 cooperation in light of Russia‘s unjustified, unprovoked and illegal invasion of an independent and sovereign Ukraine, and the ensuing global impacts. The Prime Minister reaffirmed Canada’s unwavering support for Ukraine and highlighted that Canada is ready to continue imposing additional economic measures in coordination with partners and allies worldwide.</p>\n\n<p>While in Brussels, the Prime Minister also held bilateral meetings with the President of the European Commission, Ursula von der Leyen, the President of the European Council, Charles Michel, the President of the European Parliament, Roberta Metsola, and the Prime Minister of Finland, Sanna Marin.</p>\n\n<p>The Prime Minister continues to engage with partners and allies on a regular basis to hold President Putin and his military accountable for this illegal and unjustifiable invasion, and to support Ukraine as it defends its people, its sovereignty, and its territorial integrity.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada has been working in lockstep with our NATO, G7, and European Union allies and other partners around the world to hold Russia accountable for its ongoing, illegal, and unjustifiable invasion of Ukraine. Together, we will continue to support Ukraine as it defends its people, sovereignty, territorial integrity and independence, including through further coordinated economic sanctions and delivering critical humanitarian aid where it is needed most.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s illegal annexation of Crimea in 2014, Canada has sanctioned 804 individuals and 203 entities, many in coordination with our allies. These include sanctions against Russian President Vladimir Putin, members of the Russian Federation Council, ministers of Foreign Affairs Sergey Lavrov, Defence Sergei Shoigu, Finance Anton Siluanov, Justice Konstantin Chuychenko and entities in the defence and financial sectors. Today’s sanctions bring this total to 964 individuals. Canada’s sanctions impose asset freezes and dealings prohibitions.&nbsp;</li>\n</ul>\n\n<ul>\n\t<li>The Restricted Goods and Technologies List will aim to undermine and erode the capabilities of the Russian military by prohibiting the export of a broad range of items to Russia, including in the areas of electronics, computers, telecommunications, sensors and lasers, navigation and avionics, marine, aerospace and transportation.</li>\n</ul>\n\n<ul>\n\t<li>Since January 2022, Canada has committed $180 million in humanitarian and development assistance to Ukraine. Of this, $50 million was allocated to the World Food Programme, the UN Refugee Agency, the World Health Organization, the International Federation of the Red Cross and Red Crescent Societies, the Ukraine Humanitarian Fund, HelpAge, Save the Children, SOS Children’s Villages, and others to provide immediate assistance where it is needed most.</li>\n</ul>\n\n<ul>\n\t<li>Canadian Heritage, Parks Canada, and the Canada Council for the Arts (responsible for the Canadian Commission for UNESCO) are uniting to help Ukraine through UNESCO’s Heritage Emergency Fund. Their combined contribution of $4.8 million to the fund will support UNESCO’s efforts to quickly respond to crises resulting from armed conflicts and disasters, and in particular to the severe threats facing Ukraine.</li>\n</ul>\n\n<ul>\n\t<li>On March 8, 2022, Prime Minister Trudeau announced Canada will renew its multi-year commitment to Operation REASSURANCE, the Canadian Armed Forces support to NATO’s assurance and deterrence measures in Central and Eastern Europe, since 2014. This announcement is a year ahead of schedule and is in response to the changing security situation in Eastern Europe.</li>\n</ul>\n\n<ul>\n\t<li>Canada has up to 3,400 troops pledged to the NATO Response Force (NRF), to be deployed if directly requested by NATO. This is a mix of Army, Air Force and Maritime capabilities.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/official_texts_193719.htm?selectedLocale=en\">Statement by NATO Heads of State and Government</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/03/24/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/23/joint-statement-prime-minister-trudeau-and-president-von-der-leyen\">Joint statement with President of the European Commission</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions – Russian invasion of Ukraine</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/21/prime-minister-travel-belgium-meet-allies-and-partners-continue\">Prime Minister to travel to Belgium to meet with allies and partners to continue addressing Russia’s invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\" title=\"Operation REASSURANCE\">Operation REASSURANCE</a></li>\n</ul></div>\n      "
}