{
  "path": "/en/news/statements/2017/02/09/inuit-nunanganirmiut-sulinirarutingit-inuit-gavamakkut",
  "pageTitle": "ᐃᓄᐃᑦ ᓄᓇᖓᓂᕐᒥᐅᑦ ᓱᓕᓂᕋᕈᑎᖏᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᑕ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>ᐃᒪᐃᒻᒪ:</strong><strong> </strong>ᐃᓄᐃᑦ ᓄᓇᖃᖅᑳᕐᓯᒪᔫᓂᕐᒥᒃᑎᒍᑦ ᐱᔪᓐᓇᐅᑎᓂᒃ ᑎᒍᒥᐊᖅᑎᐅᒻᒪᑕ ᒪᓕᒡᓗᒋᑦ ᑲᓇᑕᐅᑉ ᐱᖁᔭᕐᔪᐊᖁᑎᖏᑦ. ᑖᒃᑯᓄᖓᓗ ᐱᓕᕆᐊᖃᖃᑎᒌᓐᓂᐅᔪᓄᑦ ᑐᖖᒐᕝᕕᖃᖅᑐᑎᒃ ᐃᓄᐃᑦ ᑕᒪᒃᑮᖕᓄᑦ ᐊᖏᕈᑎᑎᒍᑦ ᐱᓕᕆᖃᑎᖃᕐᓂᐊᕐᓂᕐᒥᒃ ᑲᓇᑕᐅᑉ ᒐᕙᒪᖓᓐᓂᒃ ᐱᓕᕆᐊᖑᓕᖁᓪᓗᒋᑦ ᑕᒪᕐᒥᐅᓪᓗᑎᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᐅᖁᔭᐅᓯᒪᔪᑦ;</p>\n\n<p><strong>ᐃᒪᐃᒻᒪᑦ</strong> ᑲᓇᑕᐅᑉ ᒐᕙᒪᖓᑦ ᐱᓕᕆᐊᒃᓴᖃᓕᖅᓯᒪᒻᒪᑕ ᓄᑕᐅᓕᖅᑎᑦᑎᒋᐊᕐᑎᐅᓂᐊᕐᓗᑎᒃ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᐊᖃᖃᑎᒌᓐᓂᖏᓂᒃ ᑐᖖᒐᕝᕕᖃᖅᑎᑕᐅᓯᒪᔪᓄᑦ ᐃᓕᑕᖅᓯᓯᒪᓂᕐᒧᑦ ᐱᔪᓐᓇᐅᑎᒋᔭᐅᔪᓂᒃ, ᐅᐱᒋᔭᐅᔭᕆᐊᖃᕐᓂᖏᓐᓂᒃ, ᐃᑲᔪᖃᑎᒌᒃᓗᑎᒃ, ᐊᒻᒪᓗ ᐱᓕᕆᖃᑎᒌᔭᐅᔭᕆᐊᖃᕐᓂᖏᑦ ᐃᓚᐅᑎᑕᐅᔭᕆᐊᖃᕐᓂᖏᑕ ᐊᒥᓱᐃᓕᖓᓪᓗᑎᒃ ᑐᕌᕐᕕᒃᓴᕆᔭᐅᔪᓄᑦ ᐱᓯᒪᓕᕆᐊᕐᓂᕐᒥᒃ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕐᓂᒃᓴᖏᑕ ᒐᕙᒪᑐᖃᒃᑯᓐᓂ ᒐᕙᒪᖏᔭᐅᔪᑦ ᐊᒻᒪᓗ ᓄᓇᖃᖅᑳᕐᓯᒪᔪᑦ. ᐋᖅᑭᒃᑕᐅᓯᒪᓕᕐᓂᖏᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᔪᑦ, ᐊᒻᒪᓗ ᐋᖅᑭᒃᑕᐅᓯᒪᓕᕐᓂᖏᑦ ᑲᑐᔾᔭᐅᓯᒪᓪᓗᑎᒃ ᐱᔾᔪᑕᐅᔪᓄᑦ, ᐱᒻᒪᕆᐅᓪᓗᓂ ᓯᕗᒻᒧᒋᐊᕈᑎᐅᓯᒪᓕᕐᒪᑕ ᑐᕌᕐᕕᐅᔪᒪᔪᒧ;</p>\n\n<p><strong>ᐃᒪᐃᒻᒪᑦ </strong>ᑲᓇᑕᐅᑉ ᒐᕙᒪᖓᑦ, ᐃᓄᐃᑦ ᑕᐱᕇᑦ ᑲᓇᑕᒥ, ᐃᓄᕕᐊᓗᐃᑦ ᐊᕕᒃᑐᖅᓯᒪᓂᕐᒥ ᑯᐊᐳᕇᓴᖓᑦ, ᒪᑭᕕᒃ ᑯᐊᐳᕇᓴᖓᑦ, ᓄᓇᑦᓯᐊᕗᑦ ᒐᕙᒪᖓᑦ, ᐊᒻᒪᓗ ᓄᓇᕗᑦ ᑐᖖᒐᕕᒃ ᑎᒥᖁᑎᖓᑦ ᐱᓕᕆᐊᖃᖅᑎᒋᔭᐅᒻᒪᑕ ᐃᓄᐃᑦ ᐊᒃᖢᐃᓕᕈᑎᔅᓴᖏᓐᓄᑦ ᐃᑲᔪᕈᑎᐅᓯᒪᓕᕐᓂᐊᖅᑐᓄᑦ ᑲᓇᑕᒥᐅᓕᒫᓄᑦ;.</p>\n\n<p><strong>ᐃᓕᑕᕆᔭᐅᓯᒪᓪᓗᑎᒃ</strong> ᐃᓗᐃᒃᑲᐅᑦᑎᐊᖅᑐᑎᒍᑦ ᐊᒻᒪᓗ ᐱᑦᓯᐊᖅᓯᒪᓗᒋᑦ ᐊᑐᓕᖅᑎᑕᐅᓂᒃᓴᖏᑦ ᐱᓕᕆᐊᒃᓴᐅᑎᑕᐅᔪᑦ ᐊᒻᒪᓗ ᑐᕌᕐᕕᒃᓴᐅᑎᑕᐅᔪᑦ ᐃᓄᐃᑦ ᓄᓇᓕᕆᓂᕐᒧᑦ ᐊᖏᕈᑎᒋᔭᐅᓯᒪᔪᓂᒃ ᑐᖖᒐᕝᕕᐅᔭᕆᐊᖃᕐᒪᑕ ᐋᖅᑮᓯᒪᓕᕐᓂᒃᓴᒧᑦ ᐊᒃᖢᐃᓕᕈᑎᐅᓇᔭᖅᑐᓄᑦ ᐃᓅᖃᑎᒌᒃᑐᓂ ᑕᐃᒪᓗ ᑕᒪᕐᒥᓗᒃᑖᖅ ᑲᓇᑕᒥᐅᑦ ᐃᑲᔪᖅᑕᐅᓯᒪᓕᕈᑎᒋᔭᕐᒪᒋᑦ;</p>\n\n<p><strong>ᐃᓕᑕᕆᔭᐅᓯᒪᒋᓪᓗᑎᒃ</strong> ᓈᒻᒪᖖᒋᑦᑐᓕᕝᕕᐅᖃᑦᑕᖅᓯᒪᓂᖏᑦ ᐃᓅᓯᓕᕆᓂᕐᒥ ᑮᓇᐅᔭᓕᐅᕋᓱᐊᖃᑦᑕᕐᓂᕐᓂᓗ ᐊᒻᒪᓗ ᐱᐅᓯᑐᖃᖏᑎᒍᑦ ᐃᓄᐃᑦ ᐃᓱᒪᒋᓗᒋᑦ ᐊᓯᖏᑦ ᐊᒥᓲᓂᖅᓴᐅᓪᓗᑎᒃ ᑲᓇᑕᒥᐅᖃᑎᒋᔭᖏᑦ, ᐊᒻᒪᓗ ᐱᓕᕆᐊᒃᓴᖃᓕᖅᓯᒪᓪᓗᑎᒃ ᐱᓕᕆᐊᖃᖃᑎᖃᓕᕐᓂᐊᕐᓂᕐᒥᒃ ᐋᖅᑮᓯᒪᓕᕈᑎᒃᓴᓂᒃ ᐃᓅᓯᓕᕆᓂᕐᒥ ᑮᓇᐅᔭᓕᐅᕋᓱᐊᖃᑦᑕᕐᓂᕐᓂᓗ ᐊᒻᒪᓗ ᐃᓕᖅᑯᓯᑐᖃᖏᑎᒍᑦ ᓇᓕᖅᑲᕇᒃᑎᑕᐅᔭᕆᐊᖃᕐᓂᖏᑦ ᐃᓄᐃᑦ ᐊᒻᒪᓗ ᐊᓯᖏᑦ ᑲᓇᑕᒥᐅᖑᖃᑕᐅᔪᑦ. ᑖᒃᑯᓂᖓ ᐱᓕᕆᖃᑎᒌᓕᕐᓂᐊᕐᓂᖅ ᐃᓚᖃᕐᐳᖅ ᐱᓕᕆᓂᖃᓪᓚᑦᑖᓕᕋᔭᕐᓂᕐᒥᒃ ᐊᒻᒪᓗ ᐃᓱᒪᒃᓴᖅᓯᐅᕈᑎᐅᓯᒪᑦᑎᐊᖅᑐᑎᒍᑦ ᐱᓯᒪᓕᖅᑎᑦᑎᓇᔭᕐᓂᕐᒧᑦ ᐃᓅᓯᓕᕆᓂᕐᒥ ᑮᓇᐅᔭᓕᐅᕋᓱᐊᖃᑦᑕᕐᓂᕐᓂᓗ,ᐃᓕᖅᑯᓯᑐᖃᒥᓐᓂ, ᐊᒻᒪᓗ ᐊᕙᑎᓕᕆᓂᕐᒥ ᐃᓕᖓᓐᓂᐅᔪᑦ ᐃᖏᕐᕋᑦᑎᐊᕐᓂᖃᓕᖅᑎᑕᐅᖁᓪᓗᒋᑦ ᐃᓗᐃᒃᑲᐅᔪᑎᒍᑦ ᐊᑐᓕᖅᑎᑦᑎᓯᒪᓂᖅᑎᒍᑦ ᓄᓇᓕᕆᓂᕐᒧᑦ ᐊᖏᕈᑎᒋᔭᐅᓯᒪᔪᑦ, ᐃᓅᓯᓕᕆᓂᕐᒥ ᑮᓇᐅᔭᓕᐅᕋᓱᐊᖃᑦᑕᕐᓂᕐᒥᓗ ᐱᕙᓪᓕᐊᑎᑦᑎᓯᒪᓕᕐᓂᒃᑯᑦ ᐃᓚᖃᖅᑎᓪᓗᒋᑦ ᓴᐃᒻᒪᖃᑎᒌᒃᓯᒪᓕᕋᔭᕐᓂᕐᓂᒃ;</p>\n\n<p><strong>ᑕᐃᒪᓕ, ᑕᐃᒪᐃᒻᒪᑦ,</strong> ᑲᓇᑕᐅᑉ ᒐᕙᒪᖓᑦ, ᐃᓄᐃᑦ ᑕᐱᕇᒃᑯᑦ ᑲᓇᑕᒥ, ᐃᓄᕕᐊᓗᐃᑦ ᐊᕕᒃᑐᖅᓯᒪᓂᕐᒥ ᑯᐊᐳᕇᓴᖓᑦ, ᒪᑭᕕᒃ ᑯᐊᐳᕇᓴᖓᑦ, ᓄᓇᑦᓯᐊᕗᑦ ᒐᕙᒪᖓᑦ, ᐊᒻᒪᓗ ᓄᓇᕗᑦ ᑐᖖᒐᕕᒃᑯᑦ ᑎᒥᖁᑎᖓᑦ, ᑖᒃᑯᑎᒎᓇᖅ ᓱᓕᓂᕋᕈᑎᑎᒍᑦ, ᑕᒪᕐᒥᐅᓪᓗᑎᒃ ᓂᕈᐊᖅᖠᓯᒪᓕᕐᒪᑕ ᐱᔾᔪᑎᒋᓪᓗᒋᑦ ᐋᖅᑮᓯᒪᓕᕐᓂᐊᕐᓂᕐᒧᑦ ᐃᓄᐃᑦ-ᒐᕙᒪᒃᑯᑦ ᐱᓕᕆᖃᑎᒌᓐᓂᖏᓐᓄᑦ ᑲᑎᒪᔨᕋᓛᖑᓂᐊᖅᑐᓂᒃ ᑲᑐᔾᔨᓂᖃᕐᓗᑎᒃ ᓇᓗᓇᐃᔭᐃᔨᐅᓂᐊᖅᑐᓂᒃ ᐊᒻᒪᓗ ᐱᓕᕆᓂᖃᓕᕐᓗᑎᒃ ᐊᔾᔨᒌᒃᑐᓂᒃ ᓯᕗᓪᓕᖅᐸᐅᑎᑕᒃᓴᖁᑎᒋᔭᐅᔪᓂᒃ ᐊᒻᒪᓗ ᓇᐅᑦᓯᖅᑐᐃᔨᐅᓂᐊᖅᑐᓂᒃ ᐱᓕᕆᐊᖑᓂᖏᑕ ᓯᕗᒻᒧᒋᐊᖅᑎᑕᐅᕙᓪᓕᐊᓂᖏᓐᓂᒃ.<br>\n<br>\n<br>\nᐊᑎᓕᐅᖅᑕᐅᔪᑦ ᐃᖃᓗᐃᑦ, ᓄᓇᕗᒻᒥ ᕕᑉᕈᐊᕆ 9, 2017-ᒥ.</p></div>\n      "
}