{
  "path": "/en/news/news-releases/2021/10/07/governor-general-travel-germany-state-visit",
  "pageTitle": "Governor General to travel to Germany for a State visit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General of Canada, Her Excellency the Right Honourable Mary May Simon, will travel to Germany from October 17 to 21, 2021. She will undertake a State visit to Berlin and Frankfurt, and will represent Canada at the 2021 Frankfurt Book Fair.</p>\n\n<p>In Berlin, the Governor General’s program will include meetings with the President of Germany, Frank-Walter Steinmeier, and the Chancellor of Germany, Angela Merkel.</p>\n\n<p>This year, Canada is Guest of Honour at the Frankfurt Book Fair. The Canadian program, entitled ‘Singular Plurality’, will focus on innovation in creative industries, the promotion of women and youth, and reconciliation with Indigenous peoples. The Governor General will attend the opening ceremony and the opening of the Canadian pavilion.</p>\n\n<p>The Governor General will also attend a roundtable discussion about Arctic exploration, which will be held at the Frankfurt Archaeological Museum.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Germany are connected by both our diversity and our shared values. The Governor General’s State visit to Germany will reinforce Canada’s commitment to diversity and inclusion, climate and the environment, women and youth empowerment, and reconciliation. Her Excellency’s participation at the Frankfurt Book Fair will be an opportunity to highlight and celebrate Canadian cultural and literary works internationally.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Her Excellency’s first visit abroad since being installed as the 30th Governor General of Canada on July 26, 2021.</li>\n\t<li>The Frankfurt Book Fair is the world’s largest marketplace for trading in publishing rights and licenses.</li>\n\t<li>Canada and Germany are longstanding friends and allies, with strong people-to-people ties and shared values.</li>\n\t<li>More than 3.3 million Canadians have some German ancestry.</li>\n\t<li>In October, Canadians celebrate German Heritage Month and the nine-day Oktoberfest period to recognize the outstanding contributions of people of German descent to Canadian society. German Canadians have played, and continue to play, a vital role in the growth and development of Canada’s social, economic, political, and cultural fabric.</li>\n\t<li>Canada and Germany work closely together in the G7,&nbsp;G20, NATO and at the United Nations, to advance our common interests to achieve a more peaceful and prosperous world.</li>\n\t<li>Canada and Germany also work together, and with other like-minded democracies, to address threats to democracy and the rules-based international order and to foster respect for human rights.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/exporting-creative-industries/frankfurt-book-fair.html\">Frankfurt Book Fair 2021: Canada as Guest of Honour</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/09/27/statement-prime-minister-results-german-federal-election\">Statement by the Prime Minister on the results of the German federal election</a></li>\n</ul></div>\n      "
}