{
  "path": "/en/news/news-releases/2021/07/15/governments-quebec-and-canada-driving-recovery-quebecs-aerospace",
  "pageTitle": "Governments of Quebec and Canada driving recovery for Quebec’s aerospace sector | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Quebec and the Government of Canada are providing financial assistance of up to $685&nbsp;million to companies Pratt &amp; Whitney Canada, Bell Textron Canada, and CAE.</p>\n\n<p>The Prime Minister of Canada, the Rt. Hon.&nbsp;Justin Trudeau, the Premier of Quebec, François Legault, the Minister of Innovation, Science and Industry, the Hon. François-Philippe Champagne, the Minister of Economic Development and Official Languages, the Hon. Mélanie Joly, and Quebec’s Minister of Finance and Minister of Economy and Innovation, Eric Girard, made the announcement today.</p>\n\n<p>The funding will support projects totalling $2&nbsp;billion in investments in Canada, including close to $1.6&nbsp;billion in Quebec. It will also create more than 1,000&nbsp;jobs in the Quebec aerospace industry, and co-op placements for more than 6,200&nbsp;students.</p>\n\n<p>This financial support is being provided as follows: $245.5&nbsp;million from the Government of Quebec’s Economic Development Fund through Investissement Québec, and $439.8&nbsp;million from the Government of Canada through the Strategic Innovation Fund.</p>\n\n<p><strong>Pratt &amp; Whitney Canada </strong></p>\n\n<p>Up to $49&nbsp;million from the Government of Canada and $20.5&nbsp;million in loans from the Government of Quebec to Pratt &amp; Whitney Canada to support a $163&nbsp;million project that will generate $115&nbsp;million in investments in Quebec and create more than 115&nbsp;well-​paying jobs.</p>\n\n<p>Carried out in collaboration with various partners, including De Havilland Aircraft, this project aims to develop all the technological components to design the first hybrid-electric propulsion demonstrator plane within four years. A grant of $8.3&nbsp;million was already awarded to support part of the development work under the future aircraft collaborative projects.</p>\n\n<p><strong>Bell Textron Canada</strong></p>\n\n<p>Up to $200&nbsp;million in federal funding for Bell Textron Canada to support their Viridis project, which aims to develop and commercialize environmentally friendly aviation technology. The provincial government will provide $75&nbsp;million in loans to support the project.</p>\n\n<p>This joint investment is valued at $825&nbsp;million. It could create up to 320&nbsp;jobs, and co-op placements for a total of 350&nbsp;students.</p>\n\n<p><strong>CAE</strong></p>\n\n<p>CAE will receive up to $190&nbsp;million from the Government of Canada and up to $150&nbsp;million in loans from the Government of Quebec. The goal is to implement a global research and development program in digital technology, electric aviation, and health care over the next five years. In total, 700&nbsp;well‑paid jobs will be created in Canada, including 600 in Quebec alone.</p>\n\n<p>The company will develop technology for new and existing products and training services. This project totals $1&nbsp;billion in investments, including $850&nbsp;million directed to Montréal. CAE’s plans include investing in the development of electric aircraft technologies and solutions by upgrading its fleet of light trainer aircraft to reduce its carbon footprint.</p>\n\n<p><strong>ARRI</strong></p>\n\n<p>The Prime Minister also announced the launch of the Aerospace Regional Recovery Initiative (ARRI) through a federal investment of $250&nbsp;million over three years. Introduced in Budget 2021, this new initiative will help Canada’s aerospace industry prepare for the post-pandemic economic recovery and remain globally competitive by providing funding to small and medium-sized businesses and organizations in the sector to help them become cleaner, more innovative, and more productive. The ARRI will prioritize projects that promote inclusivity and diversity in human resource processes, improve the sector’s resilience and competitiveness, and contribute to the transition to greener and more environmentally sustainable products and practices.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we foster innovation in Canadian industries, we help them stay globally competitive, we create good middle class jobs, and we fuel our green recovery. The aerospace industry is undergoing a profound transformation and is accelerating the green shift it embarked on over the past few decades, which will allow it to maintain its highly sought-after ecosystem of world-class talent. As we accelerate our transition to a clean‑growth economy, the Government of Canada will continue to make smart, strategic investments that support job creation and help us build a cleaner future for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“These are major projects that will propel Quebec into the future! We are going to design the helicopters and planes of tomorrow, right here in Quebec. These aircraft will create wealth and reduce greenhouse gas emissions around the world. The aerospace industry will be back in full force, and your government will be there to strengthen our leadership status and to ensure a bright future for Quebec’s aerospace industry.”</p>\n\n<footer class=\"default\">François Legault, Premier of Quebec</footer>\n</blockquote>\n\n<blockquote>\n<p>“The aerospace sector is a cornerstone of the Canadian economy that supports good jobs for Canadian workers from coast to coast to coast. It is critical for us to support the sector’s long-term growth and help make Canada a world leader in greener, more innovative technologies. Today’s investments will help the aerospace sector step up its efforts in innovative research and development so that greener, more sustainable aircraft can be built for decades to come, right here in Canada. This will create good jobs for Canadian workers.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Small and medium-sized aerospace companies have a vital role to play in the economic recovery of our regions and of Canada. That is why the Government of Canada is proud to announce today the Aerospace Regional Recovery Initiative. The aerospace sector is a key driver of Canada’s economy and innovation. This support is critical for the thousands of workers this sector employs and for the good jobs that strengthen the economic fabric of regions across the country and help the industry remain globally competitive.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Economic Development and Official Languages</footer>\n</blockquote>\n\n<blockquote>\n<p>“The aerospace sector in Quebec is essential to achieving our ambitions in terms of sustainable economic development. By focusing on new technologies and innovation, our industry will shine. With the projects announced today by Bell Textron Canada, CAE, and Pratt &amp; Whitney Canada, Quebec will be in a better position to capture new markets, bolster productivity, and promote transportation electrification.”</p>\n\n<footer class=\"default\">Eric Girard, Quebec’s Minister of Finance and Minister of Economy and Innovation</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are pleased the governments of Canada and Quebec intend to strengthen the aerospace sector through investments in green technologies. For 35 years, Bell Textron Canada Ltd. has partnered with governments to develop breakthrough innovation which has shaped the global market. We are excited about what this investment could mean for greener aircraft designed, built, and certified in Canada.”</p>\n\n<footer class=\"default\">Steeve Lavoie, President, Bell Textron Canada Ltd.</footer>\n</blockquote>\n\n<blockquote>\n<p>“Project Resilience will allow us to reinforce our leadership in training by creating digitally immersive solutions to make the world a safer place and to expand into exciting new markets such as advanced air mobility, green light aircraft technologies, and next generation health care equipment and services. We would like to thank the Government of Canada and the Government of Quebec who will be partnering with us to open up these new markets for CAE, and for Quebec and Canada.”</p>\n\n<footer class=\"default\">Marc Parent, President and Chief Executive Officer, CAE Inc.</footer>\n</blockquote>\n\n<blockquote>\n<p>“Pratt &amp; Whitney Canada is delighted that the governments of Canada and Quebec are supporting the advancement of our hybrid-electric propulsion technology and flight demonstrator program. This secures Canada’s role in the global drive to innovate new, green technologies. With a long-time commitment to sustainability and as Canada’s top aerospace investor in research and development, we are contributing to the country’s economic growth, innovation, and workforce expertise to benefit the environment.”</p>\n\n<footer class=\"default\">Maria Della Posta, President, Pratt &amp; Whitney Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li><a href=\"https://www.pwc.ca/en/\">Pratt &amp; Whitney Canada</a> is the world leader in small and mid-size turbine aircraft engines. Headquartered in Longueuil, the company employs 4,600 people in Quebec.</li>\n\t<li><a href=\"https://www.bellflight.com/company/canada\">Bell Textron Canada</a>, a subsidiary of Bell Textron, produces four models of Bell’s civil helicopters (the 407, 412, 429 and 505) in Quebec and Canada. It employs nearly 1,300 people across the country.</li>\n\t<li><a href=\"https://www.cae.com/\">CAE</a> is a high-tech company at the leading edge of digital immersion, providing solutions to make the world a safer place. CAE is a global leader in providing training for the civil aviation, defense and security, and health care sectors. It employs 3,800 people at its Montreal facility.</li>\n\t<li>To accelerate recovery in the aerospace industry, the Government of Quebec announced an investment of $100&nbsp;million over two years in its <a href=\"http://www.finances.gouv.qc.ca/MAJ2020/index_en.asp\">fall&nbsp;2020 economic update</a>.</li>\n\t<li>In its <a href=\"http://www.budget.finances.gouv.qc.ca/budget/2021-2022/en/index.asp\">2021-22 budget</a>, the Government of Quebec committed to invest $95&nbsp;million by 2024 to renew the 2016-26 Quebec Aerospace Strategy.</li>\n\t<li>The Aerospace Regional Recovery Initiative (ARRI) will be taking applications starting today, July 15, 2021, until March&nbsp;31, 2024. Funding will be delivered by <a href=\"https://www.ic.gc.ca/eic/site/icgc.nsf/eng/h_07662.html\">Canada’s regional development agencies</a> (RDAs) as follows:\n\t<ul>\n\t\t<li>$12.5&nbsp;million for the Atlantic provinces through the <a href=\"https://www.canada.ca/en/atlantic-canada-opportunities/campaigns/covid19/arri.html\">Atlantic Canada Opportunities Agency</a>.</li>\n\t\t<li>$92.5&nbsp;million for Quebec through the <a href=\"https://ced.canada.ca/eng/programs/regi/arri/index.html\">Canada Economic Development Agency for Quebec Regions</a>.</li>\n\t\t<li>$67.5&nbsp;million for Southern Ontario through the <a href=\"http://www.feddevontario.gc.ca/ARRI\">Federal Economic Development Agency for Southern Ontario (FedDev Ontario)</a>.</li>\n\t\t<li>$12.5&nbsp;million for Northern Ontario through the <a href=\"https://fednor.gc.ca/eic/site/fednor-fednor.nsf/eng/h_fn04622.html\">Federal Economic Development Initiative for Northern Ontario (FedNor).</a></li>\n\t\t<li>$65&nbsp;million for the Western provinces through <a href=\"https://www.wd-deo.gc.ca/eng/20184.asp\">Western Economic Diversification Canada</a>.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<ul>\n\t<li>The ARRI is open to businesses operating in the aerospace industry and the organizations that support them. This includes small and medium-sized enterprises (SMEs), not-for-profit organizations providing services to SMEs, and Indigenous-led not-for-profits organizations. Under the initiative, RDAs can contribute up to 100 per cent of eligible costs for projects from Indigenous applicants. For more information and details on how to apply, businesses and organizations can visit their local regional development agency’s website.</li>\n</ul>\n\n<p><strong>Associated Links</strong></p>\n\n<ul>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget&nbsp;2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n</ul></div>\n      "
}