{
  "path": "/en/news/statements/2022/02/04/statement-prime-minister-opening-2022-olympic-winter-games",
  "pageTitle": "Statement by the Prime Minister on the opening of the 2022 Olympic Winter Games | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the opening of the 2022 Olympic Winter Games:</p>\n\n<p>“Today marks the start of the <a href=\"https://olympic.ca/games/beijing-2022/\">2022 Olympic Winter Games</a>. This event represents an opportunity for all of us to celebrate the dedication, hard work, and sportsmanship of athletes in Canada and across the world.</p>\n\n<p>“Over the next two weeks, 215 <a href=\"https://olympic.ca/team-canada-roster/\">Team Canada</a> athletes will boldly and bravely compete in 15 sports to make their mark in Olympic history. Hailing from across the country, they represent the diversity that Canada so proudly stands for and remind us that excellence isn’t restricted by age, background, or geography – excellence can come from anywhere.</p>\n\n<p>“Since the beginning of the COVID-19 pandemic, our athletes have overcome many obstacles that have challenged both their physical and mental health, including uncertainty surrounding their training plans and future competitions. Despite these challenges, they never stopped exemplifying the Canadian and Olympic values of bravery, determination, and integrity. I hope that their perseverance and resilience, and their performances at these Winter Olympics, will inspire a new generation of Canadians to take up sports and be physically active.</p>\n\n<p>“On the international stage, Canada has been a consistently strong voice for protecting and advancing human rights, and we remain extremely concerned by reports of human rights violations in China, including the persecution of Uyghurs. As a result, Canada is not sending any diplomatic representation to the 2022 Olympic Winter Games. However, our Team Canada athletes have our full support as they compete on the world stage.</p>\n\n<p>“On behalf of all Canadians, I wish our athletes the best of luck. We will all be cheering for Team Canada, and I know you will make us proud!”</p></div>\n      "
}