{
  "path": "/en/news/news-releases/2016/09/06/prime-minister-concludes-successful-first-official-visit-china",
  "pageTitle": "Prime Minister concludes successful first official visit to China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>China is playing an increasingly important role in shaping world politics and driving global economic growth. Renewing Canada’s relationship with China will help to grow the economy and strengthen the middle class.</p>\n<p>The Prime Minister, Justin Trudeau, today, in Hong Kong, wrapped up a successful first official visit to China. Over the last eight days, the Prime Minister visited Beijing, Shanghai, Hangzhou, and Hong Kong, and connected with Chinese leaders in government, business, and the public at large. He also participated in the G20 Leaders’ Summit.</p>\n<p>Canada’s principal goals for this visit were to build the foundation for a stronger, more stable Canada-China relationship, and to explore how both countries could harness the untapped potential and benefits that closer relations could provide—especially in the areas of trade and investment, collaboration on environmental issues, and growing the middle class. The Prime Minister emphasized the importance of building closer ties between Canadian and Chinese citizens and participated in discussions between women entrepreneurs.</p>\n<p>The Prime Minister met with political and business leaders, as well as Chinese students and entrepreneurs, and promoted a deeper understanding and goodwill between both countries. Canada and China have agreed to engage in more regular high-level dialogue on a range of issues. As well, new initiatives were announced in priority areas for Canada that will strengthen trade and investment, legal and judicial cooperation, and cultural and people-to-people ties and exchanges.&nbsp;</p>\n<p>Prime Minister Trudeau was impressed by the warm welcome he was shown by Chinese leaders. The Prime Minister intends to continue regular, respectful and frank discussion with China, including on issues like good governance and the rule of law.</p>\n<p>At the G20 Summit, the Prime Minister worked with his colleagues to promote strong, sustainable, and balanced global growth. In his meetings, the Prime Minister advocated for coordinated G20 action to help address some of the world’s most pressing challenges—from building prosperity for the middle class to promoting open and free trade and investment.</p>\n<p>One of the trip highlights for the Prime Minister was seeing Canadian and Chinese entrepreneurs come together to forge new business relationships. More than 50 deals were announced or signed in Shanghai worth $1.2 billion, and an additional 10 were announced in Hong Kong.</p>\n<p>In Hong Kong, the Prime Minister met with Hong Kong’s Chief Executive CY Leung to discuss the importance of the rule of law, human rights, and individual freedoms. They also discussed how to increase trade and maximize investment, and announced the entry into force of the Canada-Hong Kong Foreign Investment Promotion and Protection Agreement (FIPA). The FIPA sets out a clear framework governing foreign investments between Canada and Hong Kong, including rules under which investment disputes are resolved.</p>\n<p>The Prime Minister was also moved during a wreath-laying in Hong Kong to commemorate the 1,975 Canadian soldiers who bravely fought to defend Hong Kong during the Second World War, and pay tribute to the 550 who died in battle or captivity.</p>\n<p><strong>Quotes</strong></p>\n<p>“I believe my official visit to China has placed the Canada-China relationship on a renewed and stable track that will foster greater economic and social benefits for both our peoples, especially the middle class. I would like to thank my Chinese hosts for their warm welcome, for sharing their views on all issues in a respectful and productive way, and for facilitating the exciting new bilateral initiatives announced in priority areas for Canada during the trip.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“I am pleased with the progress made by leaders at the G20 Summit towards strong global economic growth that is inclusive, cleaner, and more sustainable. I especially welcomed efforts aimed at giving every member of society—including women and youth—an opportunity to contribute and benefit from this growth which will help build the prosperity of the middle class. The agenda put forward by China—moving together toward an innovative, invigorated, interconnected, and inclusive world economy—was both timely and on point.”<br><em>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>China is the world's second largest economy, and Canada's second-largest single-country trading partner.</li>\n<li>Two-way merchandise trade between Canada and China amounted to nearly $85.8 billion in 2015.</li>\n<li>Canada's two-way foreign direct investment relationship with China reached $33 billion at the end of 2015.</li>\n<li>Together, the members of the G20 account for more than 85 per cent of the world's GDP and nearly two-thirds of the world's population.</li>\n<li>Canadians of Chinese descent make up approximately 4.5 per cent of Canada's population.</li>\n<li>Two-way merchandise trade between Canada and Hong Kong amounted to $4.2 billion in 2015.</li>\n<li>Hong Kong is a major investment partner for Canada. The stock of Canadian direct investment in Hong Kong amounted to $7.3 billion in 2015—making Hong Kong the third most popular destination in Asia for Canadian Foreign Direct Investment. The total stock of Hong Kong direct investment in Canada amounted to $16.4 billion in 2015.</li>\n<li>There are approximately 200 Canadian firms with offices in Hong Kong.</li>\n<li>The Canadian business community in Hong Kong is active and dynamic, as demonstrated by the over 1,100 members of the Canadian Chamber of Commerce.</li>\n<li>Hong Kong also has one of the largest Canadian communities abroad (an estimated 300,000). This community, along with some 500,000 people of Hong Kong descent in Canada, plays a dynamic role in building vibrant bilateral relations.</li>\n</ul>\n<p><strong><br>Related Products</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/09/06/entry-force-canada-hong-hong-foreign-investment-promotion-and\">Entry into force of the Canada-Hong Kong Foreign Investment Promotion and Protection Agreement</a></li>\n<li><a href=\"/en/news/backgrounders/2016/09/06/strengthening-canada-hong-kong-commercial-relationship\">Strengthening of Canada-Hong Kong commercial relationship</a></li>\n</ul>\n<p><strong><br>Associated Links</strong></p>\n<ul>\n<li><a href=\"/en/news/news-releases/2016/09/01/prime-minister-deepens-understanding-and-ties-between-canada-and\">Prime Minister deepens understanding and ties between Canada and China during first days of his official visit</a></li>\n<li><a href=\"/en/news/news-releases/2016/09/01/prime-minister-strengthens-commercial-ties-china-during-successful\">Prime Minister strengthens commercial ties with China during successful visit to Shanghai</a></li>\n<li><a href=\"/en/news/news-releases/2016/09/02/prime-minister-trudeau-and-jack-ma-chairman-alibaba-group-announce\">Prime Minister Trudeau and Jack Ma, Chairman of the Alibaba Group, announce initiatives to strengthen Canadian business presence on world’s largest e-commerce platform</a></li>\n<li><a href=\"/en/news/news-releases/2016/09/05/prime-minister-participates-g20-summit-hangzhou-china\">Prime Minister participates in G20 Summit in Hangzhou, China</a></li>\n</ul></div>\n      "
}