{
  "path": "/en/news/statements/2020/06/26/statement-prime-minister-75th-anniversary-signing-charter-united-nations",
  "pageTitle": "Statement by the Prime Minister on the 75th anniversary of the signing of the Charter of the United Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75th anniversary of the signing of the Charter of the United Nations:</p>\n\n<p>“On this day 75 years ago, Canada and 49 other countries signed the <a href=\"https://www.un.org/en/charter-united-nations/index.html\">Charter of the United Nations</a>. This historic moment created the United Nations (UN), an international organization that promotes cooperation, dialogue, and peace around the world – a mission it held in 1945 and still does today.</p>\n\n<p>“As the world grappled with the harsh lessons of the Second World War, people representing over 80 per cent of the global population – and the diversity of the human family – gathered in San Francisco to sign the UN Charter and create an organization that would help build a better world.</p>\n\n<p>“The UN Charter lays out the fundamental purpose of the UN as an organization committed to peace and security, social progress, better living standards, and human rights. The UN now includes 193 Member States that have committed to these shared values and goals. A truly universal global organization, the UN knows that these goals can only be achieved by coming together as an international community. By bringing together a diversity of views, ideas, and experiences in a spirit of cooperation and collaboration, we can better address the major challenges of our time.</p>\n\n<p>“Every day, the UN defends human rights by promoting freedom and equality for all people regardless of origin, gender, language, or religion. As Canadians, we must recognize that systemic discrimination and racism still exist in our communities and in our institutions, and that we need to take action to dismantle barriers and to create a fairer, more equitable, and more just society for racialized communities and Indigenous peoples in Canada and around the world.</p>\n\n<p>“In response to the global pandemic, Canada joined the UN Secretary-General and the Prime Minister of Jamaica last month to launch an initiative to address the economic and human impacts of COVID-19, and advance solutions for a sustainable recovery. In these uncertain times, we need to work together – more than ever – to solve the problems we face as a global community, so that no one is left behind.</p>\n\n<p>“As a proud founding member of the UN, Canada will also continue to play a productive and collaborative role at the UN and on the international stage. This includes as the 2020 Chair of the UN Peacebuilding Commission and through our commitment to the&nbsp;<a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">Sustainable Development Goals</a>&nbsp;at home and abroad. Canada is dedicated to building a better future, by advancing economic security and gender equality, building and sustaining peace, addressing the impacts of climate change, and strengthening international cooperation. We believe that real change is possible if we continue to engage with international partners to reach these goals – together.</p>\n\n<p>“On this day, let us reflect on the indispensable role of the UN in bringing the international community together, and recommit to our values of peace, justice, human dignity, inclusion, and cooperation as we continue on our path toward a better world for everyone.”</p></div>\n      "
}