{
  "path": "/en/news/statements/2017/01/17/statement-prime-minister-canada-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul Wallenberg Day in Canada:</p>\n<p>“Today, we pay tribute to Raoul Wallenberg, a remarkable hero and humanitarian who saved tens of thousands of Hungarian Jews from almost certain death in Nazi extermination camps.</p>\n<p>“As a Swedish diplomat in Nazi-occupied Hungary, Mr. Wallenberg issued a special ‘protective passport’ to Jews, the Schutz-Pass, which identified its bearers as Swedish subjects and conferred some protection on them. He distributed these passports indiscriminately, saving tens of thousands of Jews from deportation.</p>\n<p>“He also created a network of safe havens operating under the Swedish flag. These safe houses, hospitals, child care centres, and soup kitchens offered shelter to those fleeing persecution and protected many Schutz-Pass holders and other Jews. He helped diplomats from other neutral powers – such as Switzerland and the Vatican – to do the same, protecting even more lives.</p>\n<p>“Over the course of six months, Mr. Wallenberg’s heroism and ingenuity saved more Jews from the horrors of the Holocaust than any single organization or government.</p>\n<p>“Tragically, Mr. Wallenberg disappeared after being captured by Soviet forces near the end of the war. Although his fate remains unknown, his legacy lives on through the many awards, monuments, institutions, forests, and anti-racism campaigns that bear his name.</p>\n<p>“In 2001, the Government of Canada designated January 17 as Raoul Wallenberg Day to honour Canada’s first honorary citizen, and to mark the day he disappeared in 1945.</p>\n<p>“Today, I encourage all Canadians to celebrate the courage and compassion of Mr. Wallenberg. He demonstrated the best of humanity, and showed that it only takes one individual to change the world for the better. May his life and legacy inspire us all.”</p></div>\n      "
}