{
  "path": "/en/news/news-releases/2019/03/04/investments-cutting-edge-bioscience-manufacturing-prince-edward",
  "pageTitle": "Investments in cutting-edge bioscience manufacturing in Prince Edward Island and Nova Scotia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians have made countless medical discoveries that have saved lives and improved the quality of life for hundreds of millions of people around the world. The Government of Canada is investing in cutting-edge research and facilities to pave the way for new medical breakthroughs, make medical treatments better and more effective, and create more jobs for hard working Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced a $37.5 million investment for BioVectra Inc., a Charlottetown-based biotechnology company that manufactures pharmaceutical products used in the treatment of serious illnesses, including cancer, kidney disease, cardiovascular disease, and multiple sclerosis.</p>\n\n<p>The funding will help BioVectra create over 150 new jobs and maintain 300 more by supporting the company’s $144.6 million project to expand its facilities in Charlottetown, Prince Edward Island, and Windsor, Nova Scotia. The project will increase BioVectra’s contribution to medicine production capacity and support the research and development of advanced pharmaceutical products not currently manufactured in Canada.</p>\n\n<p>The investment will also help the company improve collaboration with Canadian universities, colleges, and research institutions, establish annual scholarships for women and Indigenous students, and support annual student hiring in the pharmaceutical industry in Canada.</p>\n\n<p>Investments like this anchor Canada’s position as a leader in biomanufacturing and life sciences, attract international investors to Canada, and help drive innovation while creating good, well-paying jobs for Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Thanks to innovations in life sciences, Canadians are living longer, healthier lives than ever before. Canadian companies like BioVectra are creating new jobs and establishing themselves as global leaders in producing lifesaving treatments for serious illnesses that affect millions of people around the world. Today, we are not only investing in an innovative Canadian business, but also in Canadians and the future prosperity of our country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is investing in BioVectra’s project for more environmentally friendly pharmaceutical manufacturing that will drive innovation in the biologics industry for years to come. Together we’re helping BioVectra to scale up and create well-paying jobs right here on Prince Edward Island and in Nova Scotia. This project demonstrates the growing potential of Atlantic Canada’s biotechnology cluster to be a world leader.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Economic Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Based in Charlottetown, BioVectra is the oldest and largest biotechnology firm in Atlantic Canada. The company owns four internationally accredited facilities – three in Prince Edward Island and one in Nova Scotia.</li>\n\t<li>In addition to the jobs created by their project, the company will also increase the number of students it hires, up to 125 students for the next five years.</li>\n\t<li>The new facilities will be built with zero emission construction materials to reduce the company’s impact on the environment.</li>\n\t<li>Canada’s life sciences sector represents approximately 900 firms, accounts for over $7.8 billion in GDP, $13 billion in exports, $1.9 billion in research and development, and employs over 90,000 people, mostly highly skilled and qualified personnel.</li>\n\t<li>This investment is being made through the Strategic Innovation Fund, a program designed to attract and support high-quality business investments across all sectors of the economy by encouraging research and development that will accelerate technology transfer and the commercialization of innovative products, processes and services and will facilitate the growth of innovative firms.</li>\n\t<li>In 2016, the Government of Canada launched the Atlantic Growth Strategy, a set of pan-Atlantic, federal-provincial initiatives that are designed to create jobs for Atlantic Canadians, grow the middle class, and strengthen the region’s economy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://www.biovectra.com/\">BioVectra</a></li>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"http://www.acoa-apeca.gc.ca/ags-sca/Eng/atlantic-growth.html\">Atlantic Growth Strategy</a></li>\n</ul></div>\n      "
}