{
  "path": "/en/news/news-releases/2020/04/22/support-students-and-new-grads-affected-covid-19",
  "pageTitle": "Support for students and new grads affected by COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Post-secondary students are feeling the economic impacts of COVID-19. Many students were preparing to start a summer job in May, and are now worried about how to pay rent and cover basic living expenses, while recent graduates are struggling to find meaningful work. This is a critical point in their lives, and we must do everything possible to support their future.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced comprehensive support of nearly $9 billion for post-secondary students and recent graduates. This plan will help provide the financial support they need this summer, help them continue their studies in the fall, and help many get the experience they need to start their careers. These measures include launching:</p>\n\n<ul>\n\t<li>the proposed Canada Emergency Student Benefit, which would provide support to students and new graduates who are not eligible for the Canada Emergency Response Benefit. This benefit would provide $1,250 per month for eligible students or $1,750 per month for eligible students with dependents or disabilities. The benefit would be available from May to August 2020.</li>\n\t<li>the new Canada Student Service Grant, which will help students gain valuable work experience and skills while they help their communities during the COVID‑19 pandemic. For students who choose to do national service and serve their communities, the new Canada Student Service Grant will provide up to $5,000 for their education in the fall.&nbsp;</li>\n</ul>\n\n<p>The Government of Canada will expand existing federal employment, skills development, and youth programming to create up to 116,000 jobs, placements, and other training opportunities to help students find employment and develop valuable skills this summer and over the coming months. In addition, to help students continue their studies in the fall, the government will:</p>\n\n<ul>\n\t<li>double the Canada Student Grants for all eligible full-time students to up to $6,000 and up to $3,600 for part-time students in 2020-21. The Canada Student Grants for Students with Permanent Disabilities and Students with Dependents would also be doubled.</li>\n\t<li>broaden eligibility for student financial assistance by removing the expected student’s and spouse’s contributions in 2020-21, in recognition that many students and families will struggle to save for school this year.</li>\n\t<li>enhance the Canada Student Loans Program by raising the maximum weekly amount that can be provided to a student in 2020-21 from $210 to $350.</li>\n\t<li>increase existing distinctions-based support for First Nations, Inuit, and Métis Nation students pursuing post-secondary education by providing an additional $75.2&nbsp;million in 2020-21.</li>\n\t<li>extend expiring federal graduate research scholarships and postdoctoral fellowships, and supplement existing federal research grants, to support students and post-doctoral fellows, by providing $291.6 million to the federal granting councils. In addition, the government intends to enhance work opportunities for graduate students and post-doctoral fellows through the National Research Council of Canada.</li>\n</ul>\n\n<p>Taken together, these programs will not only help ensure more students get the financial support they need, but the opportunities and experience many students were counting on.</p>\n\n<p>The government will continue to monitor and respond to the health, social, and economic impacts of COVID-19. We are ready to take additional actions as needed to stabilize the economy and mitigate the impacts of the pandemic on Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The future of our economy and our country relies on the opportunities and support we provide to Canadian students today. To promote a sustainable economic recovery, we need a strong workforce and good job opportunities for young people. That means giving them the support they need to continue their studies and encouraging them to serve their communities. Together, we will get through this difficult time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s COVID-19 Economic Response Plan is providing Canadians and businesses in all sectors across the country with the help they need to get through the current challenges and position them for success as we emerge from the crisis. The significant new supports we are providing for students and recent graduates are a reflection of the central role they will play in ensuring that Canada emerges from these challenges stronger than ever.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<blockquote>\n<p>“In order to ensure that post-secondary students are able to confidently continue their studies in the fall, our government is proposing significant measures to support them. From students who were counting on summer employment to pay their tuition to recent graduates who were planning to start their careers, our government has their back during this challenging time.”</p>\n\n<footer class=\"default\">The Hon. Mona Fortier, Minister of Middle Class Prosperity and Associate Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our young people have the energy and skills to help heal Canadian communities from coast to coast to coast. Our government is committed to providing enhancements to programs such as the Canada Service Corps to ensure our greatest resource – our people – can contribute and succeed. Because young people are not only the leaders of tomorrow, they are the leaders of today.”</p>\n\n<footer class=\"default\">The Hon. Bardish Chagger, Minister of Diversity and Inclusion and Youth</footer>\n</blockquote>\n\n<blockquote>\n<p>\"Having spent most of my career teaching students and trying to prepare them for life outside of the classroom, I understand how difficult and stressful the current situation must be for them. These are challenging times, but with today's announcement, as promised, our government is providing Canadian students with the support and opportunities they need to get through this and keep moving forward.\"</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, President of the Treasury Board</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As part of this initiative, the Government of Canada will introduce legislation to be considered by Parliament.</li>\n\t<li>Approximately 700,000 students received support from the Canada Student Loan Program in 2019-20, except in Quebec, the Northwest Territories, and Nunavut, where the province or territory operates student financial assistance programs with Government of Canada support. Of these, 71 per cent received some form of the means-tested Canada Student Grant, indicating that they were more likely to come from lower- and middle-income families.</li>\n\t<li>Additional compensation will be offered for Quebec, the Northwest Territories, and Nunavut.</li>\n\t<li>On March 30, 2020, the Government of Canada placed a six-month interest-free moratorium on the repayment of Canada Student Loans for all individuals currently in the process of repaying.</li>\n\t<li>On April 8, 2020, the Government of Canada announced temporary changes to the Canada Summer Jobs program that will help employers hire summer staff and provide young Canadians with access to the jobs they need during this unprecedented time. This program will help create up to 70,000 jobs for youth between 15 and 30 years old.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"http://canada.ca/en/department-finance/news/2020/04/support-for-students-and-recent-graduates-impacted-by-covid-19.html \">Backgrounder: Support for students and recent graduates impacted by COVID-19</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/08/changes-canada-summer-jobs-program-help-businesses-and-young\">Changes to Canada Summer Jobs program to help businesses and young Canadians affected by COVID-19</a></li>\n</ul></div>\n      "
}