{
  "path": "/en/news/statements/2022/06/28/g7-leaders-communique",
  "pageTitle": "G7 Leaders’ Communiqué | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><h2>Preamble</h2>\n\n<p>1. We, the Leaders of the Group of Seven (G7), met in Elmau on 26-28 June 2022, at a critical juncture for the global community, to make progress towards an equitable world. As open democracies adhering to the rule of law, we are driven by shared values and bound by our commitment to the rules-based multilateral order and to universal human rights. As outlined in our Statement on support for Ukraine, standing in unity to support the government and people of Ukraine in their fight for a peaceful, prosperous and democratic future, we will continue to impose severe and immediate economic costs on President Putin’s regime for its unjustifiable war of aggression against Ukraine, while stepping up our efforts to counter its adverse and harmful regional and global impacts, including with a view to helping secure global energy and food security as well as stabilising the economic recovery. At a time when the world is threatened by division, we will jointly assume our responsibility and work with partners around the world to find solutions to pressing global challenges such as tackling climate change, and securing a just transition as well as addressing the current and future pandemics and achieving gender equality.</p>\n\n<p>2. We were joined in Elmau by the Leaders of Argentina, India, Indonesia, Senegal and South Africa, with whom we are united in our commitment to protect and strengthen our democracies, and to jointly address global challenges in close cooperation with other international partners and organisations. The commitments we make today will shape our path towards a sustainable development and inclusive economic recovery, and a prosperous and peaceful future, in line with the Agenda 2030.</p>\n\n<h2>A sustainable planet</h2>\n\n<h3>Climate and Energy</h3>\n\n<p>3. We reaffirm our unwavering commitment to the Paris Agreement, and its strengthened implementation. Informed by the Intergovernmental Panel on Climate Change (IPCC), we note with concern that currently neither global ambition nor implementation is sufficient to achieve the goals of the Paris Agreement. We highlight the increased urgency to act to reduce global greenhouse gas emissions by around 43 per cent by 2030, relative to the 2019 level, in light of the latest findings of the IPCC, in order to limit global warming to 1.5 °C. As a response and in the run up to COP 27, we commit to urgent, ambitious, and inclusive action in this decade and urge others to do so as well. We also commit to keep a limit of 1.5 °C temperature rise within reach, to enhance resilience and adaptive capacity to the impacts of climate change, and to align financial flows with the goals of the Paris Agreement. We will fully play our part in urgently implementing the Glasgow Climate Pact. We strongly support and recall its request to Parties to revisit and strengthen the 2030 targets in their Nationally-Determined Contributions (NDCs) as necessary to align with the Paris Agreement temperature goal by the end of 2022. We urge all countries – especially major emitters – whose 2030 NDC targets are not yet aligned to increase their ambition and align 2030 NDC targets with a 1.5 °C pathway well before COP 27.</p>\n\n<p>4. We will effectively implement domestic mitigation measures to achieve our NDC targets and commit to increase our ambition, including for example, by adopting or strengthening sectoral targets, non-CO<sub>2</sub> sub-targets, or stringent implementation measures. We commit to enhance our support for developing countries in updating and implementing their NDCs and Long-Term Strategies, including through our contribution to multilateral funds or bilateral support. Enhancing action and support for adaptation and resilience in vulnerable countries, we will work towards ambitious results for a global goal on adaptation. We recognise the adverse effects of climate change and environmental degradation on peace, stability, and security, and will work together with the global community to counter these impacts. We will continue to coordinate on the most appropriate economic and fiscal policies to support decarbonisation in an efficient, effective, and equitable way.</p>\n\n<p>5. We recognise the importance of innovation in driving deep decarbonisation. We commit to a highly decarbonised road sector by 2030 including by, in this decade, significantly increasing the sales, share and uptake of zero emission light duty vehicles, including zero emission public transport and public vehicle fleets. We recognise the range of pathways that we are adopting to approach this goal. We commit to support a Paris-compatible global goal on net-zero emissions from international aviation no later than 2050, to strengthen global efforts to achieve zero emissions from international shipping by 2050 at the latest. We will continue to be mindful with regards to our long-term drive towards alternative fuels for transport, to our objectives on climate and biodiversity and food security. We commit to reduce emissions of hydrofluorocarbons (HFC) throughout the life cycle and welcome international efforts and knowledge sharing initiatives in this regard. Reaffirming our commitment to the Global Methane Pledge, we will step up efforts to collectively reduce global anthropogenic methane emissions by at least 30 per cent below 2020 levels by 2030.</p>\n\n<p>6. We recognise that combating climate change, biodiversity loss, and pollution requires mobilising private and public, domestic, and international financial resources. To this end, we commit to implementing with others clear policies and strategies to align financial flows with our climate and biodiversity objectives and are committed to mobilising resources from all sources.</p>\n\n<p>7. We renew our strong commitment and will intensify our efforts to delivering on the collective USD 100 billion climate finance mobilisation goal as soon as possible and through to 2025. Building upon the Climate Finance Delivery Plan, we will demonstrate progress on the report’s collective actions ahead of COP 27 to reinforce confidence that it will be met in 2023. We commit to working alongside others towards the implementation of the Glasgow Climate Pact’s call to collectively at least double the provision of climate finance for adaptation to developing countries from 2019 levels by 2025. We highlight the importance of improving access to climate finance, with a specific focus on poor and most vulnerable countries.</p>\n\n<p>8. We recognise the urgent need for scaling-up action and support to avert, minimise, and address loss and damage particularly in vulnerable developing countries. We commit to scale up climate and disaster risk finance and insurance (CDRFI) and will work towards a Global Shield against Climate Risks, building on the InsuResilience Global Partnership and other initiatives. We ask our Development Ministers to make progress on the Global Shield by COP 27.</p>\n\n<p>9. We are committed to mobilising resources from all sources and to substantially increasing our national and international funding for nature by 2025 to support the implementation of an ambitious global framework. We encourage countries beyond the G7 to join us in this endeavor. We commit to enhance synergies between finance for climate and biodiversity, including increased funding for Nature-based Solutions. We commit to ensure our international development assistance does no harm to nature by 2025, and delivers positive outcomes overall for people, climate, and nature.</p>\n\n<p>10. We call on multilateral development banks (MDBs) to further strengthen ambitious climate and biodiversity action. To this end, we call upon MDBs to develop methodologies for Paris alignment before UNFCCC COP 27, to enhance the mobilisation of private finance, to support regulatory reforms via development policy operations, and to increase and disclose their finance for nature, pledging concrete amounts to international biodiversity finance before CBD COP 15.2.</p>\n\n<p>11. We stress that fossil fuel subsidies are inconsistent with the goals of the Paris Agreement and reaffirm our commitment to the elimination of inefficient fossil fuel subsidies by 2025. Those G7 members party to the Convention on Biologial Diversity also commit to redirect or eliminate incentives including subsidies harmful to biodiversity by 2030 at the latest, taking initial steps without delay. We emphasise the importance of resilient financial markets for mobilising private sector finance to facilitate the transition of the whole economy towards sustainability, net-zero and nature-positive outcomes. We support the implementation of the G20 Sustainable Finance Roadmap and urge others in adopting its actions to scale up sustainable finance. We support the Financial Stability Board Roadmap for Addressing Climate-related Financial Risks. We welcome the inauguration of the International Sustainability Standards Board’s (ISSB) and its progress of work on the global baseline of sustainability reporting standards. We support mandatory climate-related financial disclosures and look forward to the recommendations of the Taskforce on Nature-related Financial Disclosures.</p>\n\n<p>12. We endorse the goals of an open and cooperative international Climate Club, and will work with partners towards establishing it by the end of 2022, as laid out in our stand-alone statement.</p>\n\n<p>13. The Russian war of aggression against Ukraine impacts energy markets and supply security globally. We are committed to counter these impacts and risks to the energy supply security of G7 members and beyond. We are working to make sure Russia does not exploit its position as an energy producer to profit from its aggression at the expense of vulnerable countries. While taking immediate action to secure energy supply and stop the increases in energy prices driven by extraordinary market conditions, we will not compromise our climate and biodiversity goals including the energy transition nor on our commitments to phase out our dependency on Russian energy, including by phasing out or banning the import of Russian coal and oil.</p>\n\n<p>14. We are concerned about the burden of energy price increases and energy market instability, which aggravate inequalities nationally and internationally and threaten our shared prosperity. In coordination with the IEA, we will explore additional measures to reduce price surges and prevent further impacts on our economies and societies, in the G7 and globally. In our own societies, we are providing short-term fiscal support to the most vulnerable groups to support affordability, as well as to businesses and industry. We will also provide assistance to developing countries, and will intensify our steps to support global energy market stability, through short term increase in our collective production, appropriate use of our energy reserves and by working with international partners to do the same. We encourage producer countries to increase their production to decrease the tension in energy markets, and in this context welcome OPEC’s recent responses to tightening international markets. We call on them to continue action in this regard. We will increase coordination with partners committed to bolster efficiency, stability and transparency in energy markets.</p>\n\n<p>15. We reaffirm our commitment to phase out our dependency on Russian energy. In addition, we will explore further measures to prevent Russia from profiting from its war of aggression. As we phase out Russian oil from our domestic markets, we will seek to develop solutions that meet our objectives of reducing Russian revenues from hydrocarbons, and supporting stability in global energy markets, while minimising negative economic impacts, especially on low- and middle-income countries. In this respect, we welcome the decision of the European Union to explore with international partners ways to curb rising energy prices, including the feasibility of introducing temporary import price caps where appropriate. We will further reduce reliance on civil nuclear and related goods from Russia, including working to assist countries seeking to diversify their supplies. We task our relevant Ministers to evaluate the feasibility and efficiency of these measures urgently.</p>\n\n<p>16. As for oil, we will consider a range of approaches, including options for a possible comprehensive prohibition of all services, which enable transportation of Russian seaborne crude oil and petroleum products globally, unless the oil is purchased at or below a price to be agreed in consultation with international partners. In considering this and other options, we will also consider mitigation mechanisms alongside our restrictive measures to ensure that most vulnerable and impacted countries maintain access to energy markets including from Russia. We invite all likeminded countries to consider joining us in our actions. We task our relevant Ministers to continue to discuss these measures urgently, consulting with third countries and key stakeholders in the private sector, as well as existing and new suppliers of energy, as an alternative to Russian hydrocarbons.</p>\n\n<p>17. We will reduce our overall reliance on fossil fuels and accelerate the clean energy transition towards achieving net-zero emissions no later than 2050, keeping energy security and affordability at the core of our action. We will support partners in developing countries and emerging markets to also make their just transitions to clean energy through ambitious new development partnerships and accelerating access to financing, including through Just Energy Transition Partnerships (JETPs), supported by the G7 Partnership for Global Infrastructure and Investment (PGII).</p>\n\n<p>18. We have ended new direct government support for unabated international thermal coal power generation by the end of 2021. In addition, recognising the importance of national security and geostrategic interests we commit to end new direct public support for the international unabated fossil fuel energy sector by the end of 2022, except in limited circumstances clearly defined by each country consistent with a 1.5°C warming limit and the goals of the Paris Agreement. In this context and with a view to accelerating the phase out of our dependency on Russian energy, we stress the important role increased deliveries of LNG can play, and acknowledge that investment in this sector is necessary in response to the current crisis. In these exceptional circumstances, publicly supported investment in the gas sector can be appropriate as a temporary response, subject to clearly defined national circumstances, and if implemented in a manner consistent with our climate objectives and without creating lock-in effects, for example by ensuring that projects are integrated into national strategies for the development of low-carbon and renewable hydrogen.</p>\n\n<p>19. We also emphasise the central role of and confirm our strong financial commitment for the market ramp-up of low-carbon and renewable hydrogen and its derivatives, for hard-to-abate sectors and zero-emission thermal power generation, shifting towards a world economy based on low-carbon and renewable energy sources. We will work with all partners to ensure stable and sustainable global energy supplies. We acknowledge that a greenhouse gas neutral energy supply with strong reliance on energy efficiency and renewable energy is economically sensible, technically feasible, reliable and safe. To this end, we commit to achieving a fully or predominantly decarbonised power sector by 2035. Recognising that coal power generation is the single biggest cause of global temperature increase, we commit to prioritising concrete and timely steps towards the goal of accelerating phase-out of domestic unabated coal power generation. We will increase electricity generated by renewable energies, as well as the use of renewables in all sectors, and commit to remove barriers and obstacles that currently hinder or slow down the expansion of renewable energies and to reduce energy consumption. Those countries that opt to use it reaffirm the role of nuclear energy in their energy mix. Those countries recognise its potential to provide affordable low-carbon energy and contribute to the security of energy supply as a source of baseload energy and grid flexibility. They state their assessment that the development and deployment of advanced nuclear technologies including small modular reactors within the next decade will likely contribute to more countries around the world adopting nuclear power as part of their energy mix. The G7 underlines that the highest standards of nuclear safety and security are important to all countries and their respective publics.</p>\n\n<p>20. Conserving and making efficient use of energy and resources yields multiple benefits across environmental, economic and social dimensions. We will increase energy efficiency in all sectors through regulatory frameworks and incentive-based policy instruments, public and private finance, as well as public guarantees to de-risk private investments. We ask Energy Ministers to identify areas of action to enhance gender equality and diversity in the energy sector by the end of the year.</p>\n\n<h2>Environment</h2>\n\n<p>21. To our deep concern, biological diversity is being lost at unprecedented and alarming rates, jeopardising sustainable economic development and human health and well-being. Reaffirming the G7 2030 Nature Compact, we remain committed and will, leading by example, intensify ambitious action to achieve the global mission to halt and reverse biodiversity loss by 2030. We also commit to conserve or protect at least 30 per cent of land and 30 per cent of the ocean by 2030, nationally and globally, according to national circumstances and approaches. We stress the urgency of adopting a transformative Global Biodiversity Framework in 2022 and its timely implementation. We will advocate for an ambitious and effective Framework, to be adopted at the 15<sup>th</sup> Conference of the Parties of the Convention of Biological Diversity (CBD COP 15), with ambitious goals and targets, strengthened implementation, and enhanced mechanisms for review and accountability. We will act right away to implement this, submitting revised and enhanced National Biodiversity Strategies and Action Plans by CBD COP 16. We continue to support the UN Decade on Ecosystem Restoration, and will increase ambitious restoration initiatives nationally, regionally, and globally. We restate our commitment to achieving land degradation neutrality. We commit to mainstreaming, enhancing, and scaling up the implementation of Nature-based-Solutions (NbS), and will advance the implementation of integrated One Health approaches.</p>\n\n<p>22. Recognising that the global crises of climate change, biodiversity loss and pollution are mutually reinforcing, we will intensify our actions in an integrated and holistic manner. We commit to stopping and reversing the overexploitation of natural resources, ending illegal, unreported, and unregulated fishing, and the degradation of the marine environment; to combating pollution including through the sound management of chemicals and waste; and to reversing biodiversity loss and tackling climate change. A clean, healthy, and productive ocean, with resilient marine ecosystems, is essential for all life on earth. We commit to leading the global effort on the protection, conservation, restoration, and sustainable and equitable use of the global ocean including by the conclusion in 2022 of the legally binding instrument under the UN Convention on the Law of the Sea (BBNJ). We commit to fight plastic pollution worldwide by committing to the rapid progression of negotiations towards an internationally legally binding instrument initiatied under the UNEA 5.2 resolution 5/14. To this end, we endorse the G7 Ocean Deal and ask Environment Ministers to report back on progress by the end of the year. We are committed to increase resource efficiency and a circular economy to reduce environmental pressures and yield multiple benefits. To this end, we endorse the Berlin Roadmap on Resource Efficiency and Circular Economy. Through a more circular economy, we contribute to resilient and sustainable supply chains in particular with regard to critical minerals and raw materials.</p>\n\n<p>23. As key stakeholders in the global agricultural sector, we are committed to spearheading its transformation towards sustainability and resilience. Strongly determined to halt and reverse land degradation and forest loss by 2030, we will work collaboratively, share best practices and foster dialogue with all relevant stakeholders to ensure that we reach joint solutions along whole supply chains. We are committed to improving the quality and, where possible, coherence of G7 policy measures to promote sustainable supply chains. As a means to this end, we look forward to the results of the OECD inventory of G7 voluntary and mandatory due diligence measures for sustainable agricultural supply chains. We will strengthen the agricultural sector’s contribution to food security and to fighting climate change and biodiversity loss. We share the conviction that enhanced soil carbon sequestration activities improve climate stewardship and biodiversity conservation while at the same time increasing agricultural productivity and creating a source of income for farmers, in particular smallholder farmers.</p>\n\n<h2>Economic stability and transformation</h2>\n\n<h3>Global Economy and Finance</h3>\n\n<p>24. Russia’s war of aggression against Ukraine has exacerbated the economic impact of the COVID-19 pandemic crisis and impeded the recovery that began in the second half of 2021, by dragging down growth, causing significant increases in commodity, energy and food prices, and thereby pushing up inflation to levels not seen for decades in the G7 and beyond, particularly for some emerging markets and developing countries. Against this backdrop, we remain committed to continued coordination to minimise the impact of the war globally, as well as on our own economies and population, including by providing well-targeted support, where necessary. We reaffirm our existing G7 exchange rate commitments.</p>\n\n<p>25. We continue to strive for a strong, sustainable, balanced, gender-equal, and inclusive global recovery. We remain committed to a stability- and growth-oriented macroeconomic policy mix, which ensures medium-term sustainability of public finances and preserves the resilience of the financial sector. We will maintain and strengthen a safe, resilient, equitable, and rules-based open global economic system. We are united in our strategic response to the structural economic changes made evident by the COVID-19 pandemic and Russia’s war of aggression.</p>\n\n<p>26. We remain committed to jointly addressing challenges to long-term growth, including facilitating the net-zero and digital transitions, and the massive investments required. We commit to mobilise high levels of private and public investments, including those in human capital, to unleash the potential for innovation, productivity gains and emission reduction. In doing so, we recognise the importance of diversity and that the full, equal and meaningful participation of women and under-represented groups is crucial for the long-term success of our economies. This includes the need to remove structural barriers to gender equality, including through inclusive and supportive economic and fiscal policy frameworks.</p>\n\n<p>27. Given the deteriorating and highly challenging debt situations of many developing countries and emerging markets – with more than half of low-income countries in debt distress or at high risk of debt distress – we recognise the urgency of improving the multilateral frameworks for debt restructuring and to address debt vulnerabilities. We underscore our commitment to successfully implementing the G20 Common Framework for Debt Treatments beyond the Debt Service Suspension Initiative. We encourage further efforts to ensure an accelerated implementation of the G20 Common Framework and increased predictability. We call on all G20 partners to join us in this regard. We urge all relevant creditors, including non-Paris Club countries such as China, with large outstanding claims on low-income countries facing debt sustainability challenges, and private creditors in line with the comparability of treatment principle and mutual accountability to contribute constructively to the necessary debt treatments as requested. We reaffirm our commitment to promoting transparency across all debtors and creditors, including private creditors, for improved debt sustainability.</p>\n\n<p>28. We reiterate our strong political commitment to the timely and effective implementation of the Organisation for Economic Co-operation and Development (OECD) / G20 Inclusive Framework Two-Pillar Solution, to address the tax challenges arising from globalisation and the digitalisation of the economy with a view to bringing the new rules into effect at the global level. We will continue to provide support to developing countries for the implementation of this historic agreement.</p>\n\n<h3>Trade and Supply Chains</h3>\n\n<p>29. We stand united in out commitment to free and fair trade as foundational principles and objectives of the rules-based multilateral system with the World Trade Organization (WTO) at its core, which proves more important than ever in the current geopolitical environment. It should reflect our shared values, which include openness, transparency, and market-oriented competition, grounded in the rule of law. In a joint effort with others, we have acted over the last months to suspend the Most-Favoured-Nation treatment to products and services from the Russian Federation. We will continue to remove unnecessary trade barriers, including by working against trade-restrictive measures and non-market practices to maintain open and transparent markets, and call on others to do likewise. We renew our commitment to reform the WTO to achieve a fair, predictable, and stable trade environment. Our global trade rulebook must enable economic transformation, sustainable, inclusive, and resilient growth, and be responsive to the needs of global citizens. This includes reforming the WTO’s functions of monitoring, negotiation, and the dispute settlement mechanism. We underscore the importance of plurilateral initiatives to negotiating meaningful and relevant outcomes at the WTO, including by fostering creative and practical approaches. To this end, we applaud the outcome of the 12<sup>th</sup> WTO Ministerial Conference in response to major global issues such as fisheries subsidies, the emerging food security crisis and equitable access to vaccines and the commitment to work to towards necessary reform of the WTO. With a revived multilateral trading system, we look forward to matching this ambitious progress at the 13<sup>th</sup> WTO Ministerial Conference, by advancing negotiations on E-Commerce and finding a permanent solution for the moratorium on E-Commerce customs duties, closing the gap in the fisheries negotiations, addressing agricultural reform, and making concrete progress on WTO reform. We will further step up our efforts working towards a level playing field through more effective use of existing tools, as well as developing stronger international rules and norms on non-market policies and practices, for example harmful industrial subsidies and trade-distorting actions by state-owned enterprises, notably those that lead to excess capacity. We will support structured discussions at the WTO, on facilitating trade in environmental goods and services, and on how trade-related climate and environmental measures can contribute to meeting our Paris and Glasgow commitments while being consistent with WTO rules and principles.</p>\n\n<p>30. Trade flows play an important role for the green and just transition and for the diffusion of environmental goods, services, technologies and innovations. Through a mix of binding and non-binding measures, we commit to advancing sustainable supply chains that are net-zero aligned and climate resilient, decouple agricultural production from forest loss and land degradation, use resources sustainably, reduce environmental impact, foster circularity, and promote decent work. We will coordinate to maximise the coherent implementation of and compliance with international standards relating to human rights, environment, and labour across global supply chains. We are committed to tackling child labour, and to ensuring decent work, including fair wages, working closely with the private sector. We are concerned by the use of all forms of forced labour in global supply chains, including state-sponsored forced labour of vulnerable groups and minorities, including in the agricultural, solar, and garment sectors. We agree on the importance of upholding human rights and of international labour standards, including those deriving from International Labour Organisation (ILO) membership, throughout global supply chains and tackling instances of forced labour. We commit to accelerating progress including through our own available domestic means and multilateral institutions with a view to remove all forms of forced labour from global supply chains, including state-sponsored forced labour. We commit to taking measures to strengthen our cooperation and collective efforts towards eradicating the use of all forms of forced labour in global supply chains, including through increased transparency and business risk advisories, and other measures to address forced labour globally.We will align with the UN Guiding Principles on Business and Human Rights (UNGPs), the ILO Tripartite Declaration of Principles concerning Multinational Enterprises and Social Policy (MNE Declaration) and the OECD guidelines relating to responsible business conduct, and call on others to join us in these efforts. We are committed to working towards an international consensus on business and human rights to strengthen compliance with international standards, including through mandatory measures that protect rights-holders, provide for greater multilateral cooperation to address abuses, and support remedy, thus enhancing predictability and certainty for business.</p>\n\n<p>31. Recent crises have highlighted systemic vulnerabilities to chronic risks and acute market shocks, affecting our supply chains and economic security. We stand firmly for the principles of openness, inclusivity, and competition in a rules-based environment which facilitates sustainable, transparent, diverse, and secure global supply chains through ambitious, values-led trade policy. We recognise that diverse, competitive, and dynamic global supply chains not only guard against monopolisation and economic vulnerability, but also foster interconnectedness, improved welfare, and shared prosperity. Recognising where our markets are vulnerable, we will enhance collaboration, including with industry, to understand vulnerabilities and to strengthen security of critical supplies, particularly in key raw materials and critical minerals. We will focus on promoting market circularity and support diversification by exploring investment in alternative resources, processing capabilities, sustainable practices, and new technologies. We will also coordinate to share insights and best practice on mechanisms for identifying, monitoring and minimising vulnerabilities and logistical bottlenecks in advance of shocks, including cooperative scenario-based stress-testing. To inform this, we welcome the OECD’s work on the Security of Supply for Critical Raw Materials. We ask our relevant Ministers, across their areas of expertise to intensify work towards building responsible, sustainable, and transparent critical minerals supply chains, and establishing a forward strategy via international cooperation‚ policy, and financial tools. This should include addressing export restrictions and trade barriers at the international level, and consider all parts of critical minerals supply chains, including processing, refining and the circular economy.</p>\n\n<p>32. More generally, and taking stock of our existing cooperation on economic security in the face of external shocks and wider risks, we commit to ongoing strategic coordination as the G7 on this matter. We will increase our vigilance to threats, including economic coercion, that are meant to undermine global security and stability. To this end, we will pursue enhanced cooperation and explore mechanisms to improve assessment, preparedness, deterrence, and response to such risks, drawing upon best practice to address exposure both across and beyond the G7.</p>\n\n<h3>Employment and Just Transition</h3>\n\n<p>33. We commit to promoting decent and high-quality work, particularly in light of the impacts of the COVID-19 pandemic, as well as the digital and net-zero transformation on labour markets and associated demands on companies and workers. To this end, we will spare no effort to train and equip all working-age adults to meet the needs of a changing labour market for a green and digital economy. We therefore commit to significantly strengthening our efforts to foster continuing education training (CET) with a focus on low-skilled adults, as well as those who face systemic barriers. We ask the OECD to monitor this progress. By 2025, we will increase the share of our ODA employment and skills promotion programmes that is directed specifically towards green sectors and greening traditional sectors in alignment with our emerging and developing partner countries’ strategies, and subject to our budgetary processes.</p>\n\n<p>34. We recognise the importance of effective occupational safety and health (OSH) measures to protecting workers, ensuring decent work, maintaining high productivity and promoting employability, including in the face of new challenges due to structural reasons and climate change. We endorse the G7 Roadmap towards Safe and Healthy Work in a Green Economy, underline the importance of close cooperation with social partners, and reaffirm our commitment to improving OSH in global supply chains including by supporting the Vision Zero Fund in its work.</p>\n\n<p>35. To promote continuity and prioritise coordinated action across the G7 on critical labour, social, and employment issues, we will establish a standing Employment Working Group within the G7.</p>\n\n<p>36. We emphasise the value of social protection, particularly in times of crises and in the face of climate change and environmental degradation, and underscore the human right to social security. The effects of climate change disproportionately affect the marginalised and most vulnerable in society, exacerbating poverty and economic, gender and other social inequalities. To address these effects, we will accelerate progress towards universal, adequate, adaptive, shock-responsive, and inclusive social protection for all by 2030 in line with the UN Secretary-General’s initiative for a “Global Accelerator on Jobs and Social Protection for a Just Transition”, which aims to create 400 million jobs and to extend social protection. We will moreover continue our intensive efforts to mitigate the social impacts of the rising energy and food prices, which have been exacerbated as a result of Russia’s unprovoked and unjustifiable war of choice in Ukraine, paying special attention to disproportionately affected households. We strive to shape the transition towards net-zero, nature positive economies and societies in a manner which contributes to our objectives of achieving decent work for all, social inclusion, the eradication of poverty, and ensuring that no one is left behind.</p>\n\n<h2>Healthy Lives</h2>\n\n<h3>Pandemic Prevention, Preparedness and Response</h3>\n\n<p>37. To overcome the COVID-19 pandemic now, we reaffirm our commitment to enabling equitable global access to and delivery of safe, effective, quality-assured and affordable vaccines, therapeutics, diagnostics, and other essential medical goods. We have successfully exceeded last year’s commitment of sharing 870 million vaccine doses; in fact we have made available a total of over 1.175 billion vaccine doses. We underline our support for all four pillars of the Access to COVID-19 Tools Accelerator (ACT-A), including its COVAX facility and recognise that supporting ACT-A by all means, including with adequate funding and through in-kind contributions, is central to ending the acute phase of the pandemic. The G7 has already provided and pledged USD 18.3 billion for the Accelerator, corresponding to 83 per cent of the structure, including USD 4.1 billion since the start of the current budget cycle in October 2021.</p>\n\n<p>38. We further commit to support health sovereignty globally through the expansion of sustainable local and regional manufacturing capacity for vaccines, therapeutics, and other essential medical products in developing countries, including through technology transfer hubs, and to strengthen regulatory frameworks critical for equitable access to vaccines and other therapeutics in current and future pandemics. To limit the emergence of new variants of concern and support the World Health Organization’s (WHO) global and countries’ individual vaccination strategies, we stand ready to support strengthening rollout capacities and efforts to increase vaccine confidence and demand in implementing countries, especially to turn vaccines into vaccinations, and endorse the Action Plan on COVID-19 to this end.</p>\n\n<p>39. We recognise the need to foster R&amp;D preparedness, as illustrated by the table top exercise Every Day Counts: A Pandemic Vaccine Exercise to accelerate vaccine development against current and future pandemic threats. In this context, we welcome the progress made on the 100 Days Mission to support science to develop safe and effective vaccines, therapeutics, and diagnostics. We will step up, align, and track our efforts on pandemic preparedness in close cooperation with WHO. In this regard, we acknowledge the criticality of open and timely sharing of health data and biological samples. To gather further evidence, we welcome the work to strengthen genomic sequencing and explore options implement national wastewater surveillance systems by 2024 to identify potential outbreaks earlier. We are also committed to spearheading research on post COVID conditions in view of their individual, social and economic repercussions.</p>\n\n<p>40. In order to avoid devastating consequences of future pandemics, regain lost ground and attain universal health coverage (UHC) per the 2030 Agenda , we reaffirm our commitment to work in partnership to strengthen health systems worldwide and step up our efforts in pandemic prevention, preparedness, and response under the One Health approach, as well as ensuring that our collective investments and measures to end COVID-19 contribute to enhancing improvements in health systems performance and global health security capacities, including in biosafety and biosecurity.</p>\n\n<p>41. Acknowledging the rapid rise in antimicrobial resistance (AMR) at the global scale, we reiterate that we will spare no efforts to continue addressing this silent pandemic. We will continue to promote the prudent and responsible use of antibiotics in human and veterinary medicine, raise awareness on sepsis, lead in the development of integrated surveillance systems based on a One Health approach, concurrently advance access to antimicrobials, strengthen research and innovation for new antibiotics in international partnerships, and incentivise the development of new antimicrobial treatments with a particular emphasis on pull incentives.</p>\n\n<p>42. We acknowledge the key role of the health sector in climate adaptation, and commit to making our health systems environmentally sustainable and climate-neutral at the latest by 2050, as well as more resilient.</p>\n\n<h3>Global Health Architecture</h3>\n\n<p>43. We will strengthen global pandemic readiness including by enhancing collaborative surveillance and predictable rapid response, based on a highly qualified and trained public health workforce at all levels, and endorse the G7 Pact for Pandemic Readiness to this end. Within the framework of the G7 Pact for Pandemic Readiness, we will provide support to assist at least one hundred low- and middle-income countries (LMICs) in implementing the core capacities required in the International Health Regulations (IHR) for another 5 years until 2027. We welcome the ongoing negotiations on a WHO convention, agreement or other international instrument on pandemic prevention, preparedness, and response as well as the efforts to strengthen the IHR.</p>\n\n<p>44. We reaffirm our strong belief in a cross-sectoral and multilateral approach to global health, including for pandemic prevention, preparedness, and response. We applaud the decision at the 75<sup>th</sup> World Health Assembly to work towards increasing the share of assessed contributions to 50 per cent of WHO’s base budget by the 2028-2029 biennium, taking into account budgetary proposals and progress on reforms, with a view to sustainably finance the organisation to fulfill its leading and coordinating role in global health. We support the work of the WHO Hub on Epidemic and Pandemic Intelligence, including with a view to improving strategic foresight. In light of lessons learned from COVID-19, there is no doubt that global health capacities must be underlaid with sufficient, reliable and sustainable funding. We welcome the outcomes of the Second Global COVID-19 Summit on 12 May 2022, incuding the support for the establishment of a new financial intermediary fund, housed at the World Bank, to catalyse investments in pandemic prevention, preparedness and response and support the ongoing work of the G20 Joint Finance Health Taskforce in this regard. We also acknowledge the role of the WHO Scientific Advisory Group on the Origins of Novel Pathogens (SAGO).</p>\n\n<p>45. We will support a successful Seventh Replenishment of the Global Fund for AIDS, Tuberculosis and Malaria (Global Fund) with the goal of ending the three diseases, while contributing to achieving UHC. We are strongly committed to strengthening primary health care, continuing to address noncommunicable diseases including mental health, recognising the need for accessible and effective mental health services, and Neglected Tropical Diseases, and increasing our collective<em> </em>efforts to achieve comprehensive Sexual and Reproductive Health and Rights (SRHR) for all. We also reiterate the crucial importance to put gender equality at the core of our multilateral contributions to global health, and reiterate our efforts to address the particular needs of the most marginalised and those in vulnerable situations. We reaffirm our continuous efforts to improve women's, children's and adolescents' health by contributing to relevant funds such as the Global Financing Facility for women, children and adolescents (GFF). We will continue to support polio eradication through the Global Polio Eradication Initiative (GPEI).</p>\n\n<h2>Investment in a better future</h2>\n\n<h3>Sustainable Infrastructure</h3>\n\n<p>46. Building on our commitments in Carbis Bay, we have further shaped and implemented our Partnership for Global Infrastructure and Investment (PGII) as a joint offer to narrow the investment gap for sustainable, inclusive, climate resilient, and quality infrastructure in emerging markets and developing countries, based on intensified cooperation, democratic values, and high standards. We will mobilise the private sector for accelerated action to this end. Over the last year we have made concrete progress in fostering investments in local vaccine and medicine production as well as on Just Energy Transition Partnerships (JETPs) in emerging markets and developing countries. We launched the first JETP with South Africa at COP26 and welcome the progress set out in the update to Leaders and are currently working towards further JETPs with India, Indonesia, Senegal, and Vietnam. Building on these important steps we underscore our commitment to country-led partnerships in close dialogue with interested partner countries, aligning with existing initiatives and using existing coordination mechanisms.</p>\n\n<p>47. We will continue to operationalise, implement, and promote high international standards for transparency, good governance, environmental, and climate as well as financial and debt sustainability, such as the G20 Principles for Quality Infrastructure Investment. We call on all international public and private actors to further align and join our efforts towards putting these standards into practice at policy and operational levels, strengthening the necessary capacities and improving enabling environments.</p>\n\n<p>48. Recognising the importance of mobilising private capital for sustainable infrastructure and the key role of Multilateral Development Banks (MDBs) and Development Finance Institutions (DFIs) in leveraging private capital and shaping and implementing country-led partnerships, we will further intensify dialogue and joint action with interested partners, in particular MDBs, DFIs and private investors, to better align efforts and consolidate a pipeline of bankable projects including flagship projects reflecting G7 collaboration to narrow the infrastructure gap and drive transformational progress globally.</p>\n\n<p>49. Building on our initiatives and strong commitment, and using all financial instruments at our disposal, we aim at collectively mobilising up to USD 600 billion in public and private investments with a particular focus on quality infrastructure over the next five years. We welcome the Joint Action Proposal of the MDB/DFI Expert Group on Infrastructure and Investment, and look forward to a concrete proposal for developing an investment platform for sustainable infrastructure projects by the end of the year. We also welcome further steps to deepen collaboration among MDBs and DFIs, by pooling forces with a particular focus on project preparation capabilities and aligning support for policy and regulatory frameworks for sustainable infrastructure investments.</p>\n\n<p>50. We welcome the Emerging Market Climate Action Fund as an example of a concrete innovative and market-led approach to mobilise private investments for climate relevant infrastructure and to enhance multilateral finance and collaboration.</p>\n\n<h3>Sustainable Development</h3>\n\n<p>51. Recognising the particular strain multiple crises have put on developing countries we reaffirm our strong commitment to put the 2030 Agenda for Sustainable Development and the Addis Ababa Action Agenda at the center of our agendas to mainstream sustainable development across all policy priorities. We will accelerate our efforts to achieve the Sustainable Development Goals by 2030 by mobilising all sectors and levels of society.</p>\n\n<p>52. We will spare no effort to increase global food and nutrition security and to protect the most vulnerable whom the food crisis threatens to hit the hardest, as laid out in our Statement on Global Food Security.</p>\n\n<p>53. Guided by the objectives of the African Union (AU) Agenda 2063, we are determined to deepen our partnerships with African countries and organisations in compliance with multilateralism and the rules-based international system. We reiterate our support to initiatives to strengthen the business environment and sustainable infrastructure investments in Africa.</p>\n\n<p>54. With the support of our partners we have made significant progress towards and are approaching the targets agreed last year by the G7 and G20 to complement the 2021 general SDR allocation for countries most in need, especially in Africa, including through voluntarily channelling SDRs or budget loans, to reach a total global ambition of USD 100 billion. We call on others to join us in the endeavour to increase the amount of total support to the most vulnerable countries, including through pledges to the IMF’s Poverty Reduction and Growth Trust and Resilience and Sustainability Trust. We welcome the independent review of the Multilateral Development Banks’ capital adequacy frameworks. We call on MDBs to urgently assess how to step up their policy and financial support, and maximise the pace of their disbursement, including of USD 170 billion committed by the World Bank Group to respond to the current crisis, to help vulnerable countries and households in response to compounding crises while preserving their credit ratings.</p>\n\n<p>55. In the spirit of feminist development, foreign and trade policies and to empower women and girls, we will strengthen the rights, resources and opportunities for women and girls in all their diversity in every sphere. We are deeply concerned about the deepening learning crisis generated by emerging conflicts and chronic emergencies worldwide, particularly for the most marginalised learners, and stand steadfast in our commitment to protecting and prioritising girls’ education.</p>\n\n<p>56. Cities are places of diversity and identity, exchange and integration, creativity, and solidarity. They are crucial to driving prosperity and ensuring equal opportunities for all. We acknowledge the significant role of cities, their associations, and networks as actors in our transformation towards sustainable development. We commit to foster exchange among and with cities. We task our relevant Ministers to develop a joint understanding of good urban development policy to be adopted at the first ever G7 Ministerial Meeting for Sustainable Urban Development, and to decide on joint initiatives for unlocking the full potential of cities to promote social, cultural, technological, climate-neutral, economic, and democratic innovation for the common good.</p>\n\n<p>57. We endorse the Elmau Progress Report 2022, following up on our development-related commitments in previous years.</p>\n\n<h3>Foreign and security policy</h3>\n\n<p>58. We reiterate the importance of maintaining a free and open Indo Pacific, which is inclusive and based on the rule of law. We re-emphasise our support for ASEAN unity and centrality and commit to explore concrete cooperation in line with the ASEAN Outlook on the Indo-Pacific. We remain seriously concerned about the situation in the East and South China Seas. We strongly oppose any unilateral attempts to change the status quo by force or coercion that increase tensions. We emphasise the universal and unified character of the United Nations Convention on the Law of the Sea (UNCLOS), and reaffirm UNCLOS’s important role in setting out the legal framework that governs all activities in the ocean and the seas. We stress that there is no legal basis for China’s expansive maritime claims in the South China Sea. In this regard, we urge China to fully comply with the arbitral award of 12 July 2016 and to respect navigational rights and freedoms enshrined in UNCLOS. We urge all parties to resolve disputes over maritime claims through peaceful means consistent with international law and support using the dispute settlement mechanisms established by UNCLOS. We underscore the importance of peace and stability across the Taiwan Strait and encourage a peaceful resolution of cross-Strait issues.</p>\n\n<p>59. In the context of our cooperation with the largest economies, including in the framework of the G20, it is necessary to cooperate with China on shared global challenges, in particular addressing climate change and biodiversity loss and other relevant multilateral issues. We continue to call on China to uphold its obligations under international law and to contribute to international security. We remind China of the need to uphold the principle of the UN Charter on peaceful settlement of disputes and to abstain from threats, coercion, intimidation measures or use of force.</p>\n\n<p>60.<em> </em>As Russia is waging its unjustifiable, unprovoked and illegal war against Ukraine, we call on China to press Russia to immediately comply with the legally binding order of the International Court of Justice of 16 March 2022 and to abide by the relevant resolutions of the UN General Assembly and stop its military aggression – and immediately and unconditionally withdraw its troops from Ukraine.</p>\n\n<p>61. We call on China to honour its commitments made in the Sino-British Joint Declaration and the Basic Law, which enshrine rights, freedoms and a high degree of autonomy for Hong Kong.</p>\n\n<p>62. We remain committed to upholding fair and transparent competition in the global economy and strengthening international rules in this regard. With regard to China’s role in the global economy, we are continuing to consult on collective approaches, also beyond the G7, to challenges posed by non-market policies and practices which distort the global economy. We will build a shared understanding of China's non-transparent and market-distorting interventions and other forms of economic and industrial directives. We will then work together to develop coordinated action to ensure a level playing field for our businesses and workers, to foster diversification and resilience to economic coercion, and to reduce strategic dependencies.</p>\n\n<p>63. We are gravely concerned about the human rights situation in China. We will continue to promote universal values, including by calling on China to respect universal human rights and fundamental freedoms, including in Tibet and in Xinjiang where forced labour is of major concern to us.</p>\n\n<p>64. We continue to condemn in the strongest terms the military coup in Myanmar and express deep concern about the political, humanitarian and human rights situation. We call on the military regime immediately to end the use of violence, free all political prisoners and those arbitrarily detained and return the country to a democratic path. We will continue to support all efforts by ASEAN and the implementation of ASEAN’s Five-Point Consensus in all its dimensions. We also remain fully supportive of all efforts by the United Nations, and encourage strong coordination between the ASEAN Special Envoy and the Special Envoy of the United Nations Secretary-General on Myanmar.</p>\n\n<p>65. We strongly condemn the continued, unlawful testing of ballistic missiles by the DPRK, including the Intercontinental Ballistic Missile (ICBM) launches conducted on 24 March and 25 May 2022. We demand that the DPRK abandon its unlawful weapons of mass destruction and ballistic missile programs in a complete, verifiable and irreversible manner in accordance with the UN Security Council resolutions. We further call on all states to fully and effectively implement these resolutions, and to remain vigilant for sanctions evading activity. We urge the DPRK to engage in diplomacy and to resume dialogue towards complete denuclearisation. We reiterate the urgent need for the DPRK to improve the humanitarian and human rights situation, address its COVID situation effectively, facilitate access for international humanitarian organisations, and resolve the abductions issue immediately.</p>\n\n<p>66. We reiterate our clear commitment that Iran must never develop a nuclear weapon. We regret that, despite intense diplomatic efforts to restore full implementation of the Joint Comprehensive Plan of Action (JCPoA), Iran has not yet seized the opportunity to conclude a deal. The G7 commits to working together, and with other international partners, to address the threat posed to international security by Iran’s nuclear escalation. A diplomatic solution remains the best way to restrict Iran’s nuclear programme. We urge Iran to cooperate substantively with the IAEA and to act on an urgent basis to fulfill its legal obligations by providing technically credible information that the Agency requires to clarify and resolve outstanding issues related to nuclear safeguards, as called upon with an overwhelming majority by the resolution adopted by the IAEA Board of Governors on 8 June.</p>\n\n<p>67.<em> </em>We strongly condemn Iran’s continued destabilising activity in the region. We call upon Iran to stop all ballistic missile activities and proliferation inconsistent with UNSCR 2231 and other UNSC resolutions. Iran’s threats to maritime security further impair regional stability. We welcome regional initiatives to improve bilateral relations between partners in the region and call on Iran to contribute actively and constructively to fostering regional peace and security in the Middle East. We reiterate our shared profound concern over the continued human rights violations and abuses in Iran, including arbitrary arrest and detention, and condemn Iran’s increased use of capital punishment. We call on Iran to end arbitrary arrest and detention of foreign and dual nationals for the purposes of political leverage. We continue to support international efforts to hold Iran to account for the unlawful shooting-down of Ukraine International Airlines Flight 752.</p>\n\n<p>68. We express our deep concern about the political situation and the deterioration of the humanitarian and economic situation in Afghanistan since the Taliban take-over. We reassure the people of Afghanistan of our principled support and continued humanitarian assistance and assistance to cover basic human needs, based on the respect for humanitarian principles and fundamental human rights, including women’s rights. We also reassure the people of Afghanistan the provision of swift relief, in coordination with the UN, to the communities struck by the recent earthquake. We are united in our strong condemnation of the ongoing violence with recurring terrorist attacks particularly targeting members of ethnic and religious minority groups. We call upon the Taliban to respect human rights, especially the rights of women and girls and members of minority groups, including the right to education for all without discrimination. We urge the Taliban to take significant steps in support of creating inclusive and representative governance of Afghanistan, and to ensure safe, rapid and unhindered humanitarian access, combat terrorism in line with their relevant commitments including the Doha agreement, and allow safe passage for all Afghans in need of protection travelling abroad. The type and scope of our engagement that goes beyond humanitarian assistance and assistance to cover basic needs are to be informed by the concrete achievements of the Taliban to meet these expectations widely shared by the international community.</p>\n\n<p>69. We reaffirm our strong commitment to the UN-facilitated, Libyan-led and Libyan-owned political process and the sovereignty, independence, territorial integrity and national unity of Libya. We recall that free and fair presidential and parliamentary elections need to be held as soon as possible, leading to a representative and unified government. We underline the continuing need to observe and implement in full the 23 October 2020 ceasefire agreement, including the withdrawal of all foreign forces and mercenaries, such as the Wagner Group. Progress must be made on justice and accountability for human rights abuses, including conflict-related sexual violence and regarding refugees and migrants. We urge the full resumption of oil production in Libya and call upon all actors to refrain from using it as an instrument of political confrontation.</p>\n\n<p>70. We reiterate that there is no alternative to an inclusive political solution on the basis of UN Security Council Resolution 2254 in Syria, and therefore we reaffirm our full support to the UN Special Envoy Pedersen. We will not normalise relations with the Assad regime until we witness enduring and meaningful progress in the UN-facilitated political process. We urge continued humanitarian and development support for Syrian refugees and host countries, until Syrians can voluntarily return home with safety and dignity according to UN standards. We also strongly support the re-authorisation and expansion of cross-border humanitarian assistance by the UN Security Council in July. Moreover, we urge the regime to comply with its international obligations. We remain firmly committed to pursue accountability for the Syrian regime’s use of chemical weapons, human rights violations and abuses and other violations of international law, including humanitarian law. We welcome ongoing efforts by national jurisdictions to prosecute crimes committed in Syria, and underscore the urgent need for progress on the fate and whereabouts of tens of thousands forcibly disappeared or arbitrarily detained Syrians and recall that accountability and justice for victims is essential for a stable, peaceful Syria. We underline the importance of maintaining the ceasefire in northern Syria, which ensures collective efforts to fight Daesh can continue and if broken, risks exacerbating an already dire humanitarian situation including through the further displacement of people. We reaffirm our shared commitment to work towards a sustainable solution to the Syrian crisis.</p>\n\n<p>71. We are encouraged by recent developments in Yemen and welcome the two month extension of the truce, brokered by the United Nations. We urge all parties to implement the associated confidence building measures, especially the opening of roads in and around Taiz. We call on the parties to the conflict to make use of the extension to engage in constructive talks under the leadership of the United Nations, to convert this truce into a lasting ceasefire and to ultimately reach a durable peace.</p>\n\n<p>72. We are deeply concerned by the continuing deterioration of the political and security situation in the Sahel, the threat of terrorism in the Gulf of Guinea and littoral states, continuing attacks against civilian populations, as well as the worsening food and humanitarian crisis. The intervention of the Wagner Group in Mali and atrocities linked to their presence are of great concern and we call for accountability of those responsible for violations or abuses. We urge all actors to respect human rights and international humanitarian law. We support the efforts of the Economic Community of West African States in response to the events in Mali, Burkina Faso and Guinea and the African Union in Chad. We call for free and fair elections in order to allow for a durable return to constitutional rule. We recognise the efforts in Niger and Mauritania to consolidate democratic institutions strengthen the rule of law and good governance including migration governance and foster stabilisation. We reiterate our strong commitment to support the populations of the Sahel countries, help stabilise the region and tackle the root causes of terrorism and instability as outlined within the Sahel Coalition.</p>\n\n<p>73. The G7 remains concerned about peace, security, and humanitarian challenges in the Horn of Africa. Democratic achievements, economic reforms, and above all the well-being of the populations in the region are threatened by political instability, weak governance, armed conflicts, militias and terrorist groups as well as by the effects of climate change and natural disasters. Country health systems continue to be stressed by the COVID-19 pandemic which has negative implications for overall health service delivery as well as health capacity building efforts. Human rights violations and abuses, including sexual and gender-based violence, and a lack of accountability remain major concerns.</p>\n\n<p>74. Russia’s war of aggression against Ukraine has compounded food insecurity worldwide, especially in the Horn of Africa, where worsening drought is affecting over 18 million people in Ethiopia, Somalia and Kenya. We emphasise our commitment to work with countries and institutions in the region to foster peaceful and sustainable development in the Horn of Africa, and will support as a priority efforts to tackle one of the worst droughts in its history. We welcome the peaceful conclusion of the electoral process in Somalia and reiterate our commitment to work alongside the African Union and Somali authorities to counter violent extremism and other significant challenges. We are also encouraged by the humanitarian truce in Ethiopia and call on all parties to begin talks toward a durable ceasefire and a political solution to the crisis that lays the foundation for durable peace. Safe, rapid and unhindered humanitarian access has to continue. It is essential to address human rights issues and provide transparent accountability. In Sudan, a swift return to a civilian-led government and democratic transition process is urgently needed. We fully support the tripartite efforts by UNITAMS, AU and IGAD and call on all stakeholders to engage actively in a constructive dialogue.</p>\n\n<p>75. In view of the 10<sup>th</sup> Review Conference of the Non-Proliferation Treaty (NPT) in August 2022, we are united in our resolve to comprehensively strengthen the NPT, promote its universalisation, re-inforce the importance of commitments made at past Review Conferences and advance implementation of the Treaty across all three of its mutually reinforcing pillars. We underline the authority and primacy of the NPT as the cornerstone of the nuclear non-proliferation regime and the foundation for the pursuit of nuclear disarmament and peaceful uses of nuclear technology. The G7 reaffirms its commitment to the ultimate goal of a world without nuclear weapons with undiminished security for all, achieved through concrete, practical, and purposeful steps. The overall decline in global nuclear arsenals must be sustained and not reversed. We welcome the Joint Statement of the Leaders of the Five Nuclear-Weapon States on Preventing Nuclear War and Avoiding Arms Races of 3 January 2022, including the important affirmation that a nuclear war cannot be won and must never be fought. However, we condemn Russia’s provocative statements which signal the threat of use of nuclear weapons. This undermines the credibility of Russia’s commitment to the Joint Statement. Any use of chemical, biological or nuclear weapons or related materials by Russia in Ukraine would be met with severe consequences.</p>\n\n<p>76. The Russian war against Ukraine and other conflicts have pushed the number of people worldwide forced to flee war, violence, human rights violations and persecution to a record high of 100 million, evidencing the urgent need to address the root causes of refugee movements and internal displacement, as well as to provide safe, dignified, and sustainable solutions. We reaffirm our commitment to protecting refugees, supporting forcibly displaced persons and supporting host countries and communities, ensuring the full respect for human rights and fundamental freedoms of refugees, and addressing the particular needs of women and children in conflict, crisis, and displacement. Recalling the commitment of the Global Compact on Refugees to share responsibility more equitably, we will continue to promote international solidarity with refugees and host countries, including by expanding resettlement programmes. We also call upon the international community to follow suit and increase their protection of refugees and support to forcibly displaced persons and for host countries, in an effort towards global responsibility-sharing. We affirm the importance of, combating human trafficking and related illicit financial flows, smuggling of migrants, and countering related disinformation.</p>\n\n<p>77. Russia’s devastating war in Ukraine, the wholesale rollback of women’s and girls’ rights in Afghanistan since the forceful take-over of power by the Taliban, and the impact of war, conflict, and forced displacement worldwide clearly demonstrate that women, girls, and those most vulnerable based on gender identity, sexual orientation, or disability are disproportionately affected, and yet at the same time severely underrepresented in decision making roles. We will further promote and implement the Women, Peace and Security Agenda. We will improve documentation and accountability for human rights violations and abuses, such as sexual and gender-based violence, including in conflict situations. We reiterate the need to strengthen the implementation of international architecture to prevent and respond to conflict related sexual violence, and will support the empowerment of women and girls as critical agents for conflict prevention, crisis management, conflict resolution, relief and recovery, and long-term peacebuilding.</p>\n\n<h2>Stronger Together</h2>\n\n<p>78. We are convinced that democratic values make us stronger in tackling global challenges and working towards an equitable and prosperous world for all. We will work together with civil society and our partners internationally to strengthen the resilience of our democracies, as laid out in the 2022 Resilient Democracies Statement.</p>\n\n<h3>Gender Equality</h3>\n\n<p>79. Achieving gender equality is imperative as we strive for resilient, inclusive democratic societies, and to counter the rising tide of authoritarianism and backlash against women’s and girls’ rights across the globe. We reaffirm our full commitment to a sustained focus on realising equality between women and men as well as transgender and non-binary people, and to ensuring that everyone – independent of their gender identity or expression or sexual orientation – has the same opportunities and is protected against discrimination and violence. To this end, we commit to redoubling our efforts to overcome longstanding structural barriers and to addressing harmful gender norms, stereotypes, roles, and practices. We seek to ensure full, equal and meaningful participation of women and girls in all their diversity as well as LGBTIQ+ persons in politics, economics, education and all other spheres of society, and to consistently mainstream gender equality into all policy areas. Building on the recommendations by the Gender Equality Advisory Council as well as Women 7 we will introduce a mechanism to continuously monitor G7 commitments and progress towards achieving gender equality. To this end, we endorse the G7 Dashboard on Gender Gaps which covers key indicators across a range of policy areas that are relevant to the progression of gender equality, and look forward to its regular annual update. In addition, we look forward to receiving the first implementation report from the OECD and will continue to reach out to partners.</p>\n\n<p>80. As we strive to tackle the global challenges of our time, we recognise that they are far from gender-neutral and are determined to address their gendered impacts. We commit to make every effort to collectively increase the share of G7’s bilateral allocable ODA advancing gender equality and women’s and girls’ empowerment over the coming years.</p>\n\n<p>81. The COVID-19 pandemic has disproportionately affected women and girls and has highlighted the essential role of care work – both paid and unpaid – for the functioning of our societies and economies, but also as a key cause of gender inequalities due to its unequal distribution. It is of paramount importance to recognise, reduce, and redistribute unpaid care work, and to reward paid care work adequately, guaranteeing care workers representation. To that end, we will support efforts to expand global access to quality childcare infrastructure including through our collective support of USD 79 million for the Childcare Incentive Fund, thereby improving women’s economic empowerment, child outcomes, family welfare, and overall economic growth. The pandemic has also deprived millions of women of sexual and reproductive health services – putting at risk the progress made in the past 20 years on sexual and reproductive health and rights (SRHR) for all. We reaffirm our full commitment to achieve comprehensive SRHR of all individuals, and stress the importance of access to emergency sexual and reproductive health services in humanitarian crises. We recognise the essential and transformative role of SRHR in gender equality and women’s and girls’ empowerment, and in supporting diversity, including of sexual orientations and gender identities.</p>\n\n<h3>Extremism, Disinformation, Foreign Interference and Corruption</h3>\n\n<p>82. We are committed to providing security to all our citizens in an open and pluralistic society. To this end, we will intensify our cooperation to fight all forms of violent extremism and terrorism.</p>\n\n<p>83. To halt democratic backsliding and undermining of our fundamental values, we will coordinate closely across the G7 and with our partners to strengthen democracies and our institutions against disinformation, including foreign information manipulation. In light of Russia’s war of aggression against Ukraine, we remain committed and enhance our cooperation through the G7 Rapid Response Mechanism (RRM) in order to protect our democratic systems and open societies from foreign threats, such as information manipulation and interference, including disinformation. We welcome the immediate response by the G7 RRM, including its collaboration with the Carnegie Endowment for International Peace, in establishing a multi-stakeholder crisis network comprised of G7 governments, social media platforms and civil society to support the integrity of the Ukrainian information environment in the face of Russia’s unprecedented information war. To this end, we will further develop the G7 RRM through an expanded focus on hybrid threats and will enhance its capabilities to respond to foreign interference also at the sub-national level. More broadly, we will also enhance the resilience of public actors and institutions, business, academia, and civil society through a whole-of-society-approach as well as cooperation within the OECD.</p>\n\n<p>84. We also commit to further strengthening our internal security in light of transnational threats including those posed by Russia and other authoritarian regimes, particularly in the field of cyber security, illicit finance and law enforcement. To further ensure the security of our citizens, we will intensify our fight against transnational organised crime, including cybercrime and environmental crime, particularly in fragile contexts, in close cooperation with civil society and international actors such as Interpol and United Nations Office on Drugs and Crime.</p>\n\n<p>85. The pandemic, the war against Ukraine and further international conflicts, including in Afghanistan, have exacerbated the threat of trafficking in human beings, aimed at sexual and labour exploitation and abuse, particularly of children and women. We commit to step up our fight against trafficking in human beings and our efforts to prevent and combat child sexual abuse and exploitation globally, both online and offline. We ask our Interior Ministers to take forward the implementation of the Action plan to combat Child Sexual Exploitation and Abuse from September 2021.</p>\n\n<p>86. Corruption and related illicit finance and proceeds of crime drain public resources, can often fuel organised crime, enable kleptocratic systems to accumulate wealth and power at the expense of citizens, undermine democratic governance. The Russian war against Ukraine has highlighted how kleptocracies pose an immediate threat to the freedom and national security of our societies. In order to defend the integrity and transparency of democratic systems, we will continue to step up our fight against corruption in all relevant bodies, and accelerate work on implementing and strengthening our beneficial ownership transparency registers, including by improving their accuracy, adequacy, and timeliness. In this regard, we also welcome the recently strengthened standards on beneficial ownership transparency of legal persons by the Financial Action Task Force (FATF) and look forward to their swift implementation. To hold kleptocrats, criminals and their enablers to account globally, we will broaden our global fight against cross-border corruption, including by supporting African partners in setting up 15 additional beneficial ownership registers. Also, building on the work of the Russia Elites Proxies and Oligarchs Task Force, we will further intensify our cooperation and ask the Task Force to report back to us by the end of the year on potential additional measures to be taken.</p>\n\n<h3>Digitalisation</h3>\n\n<p>87. We will work together to help shape an inclusive and global digital ecosystem that fosters an open, free and secure Internet, competition and innovation, protects privacy and personal data, and promotes respect for human rights and fundamental freedoms, as reflected in the G7 Resilient Democracy Statement.</p>\n\n<p>88. Everyone should feel safe online. We affirm our commitment to empower citizens, especially vulnerable groups to use the Internet and digital technologies safely and securely. We will continue our efforts to combat any forms of online harm and protect people online. Global digital cooperation is key to our common agenda. In this endeavour, we will build on already existing frameworks such as the Christchurch Call, the Paris Call for Trust and Security in the Cyberspace, and the outcomes of the Future Tech Forum. We welcome the Declaration for the Future of the Internet and invite like-minded partners to join us in advancing its vision, thereby opposing the trend of rising digital authoritarianism.</p>\n\n<p>89. Russia’s aggression against Ukraine poses widespread threats, including to our critical infrastructure. We are therefore taking steps to increase cyber resilience of digital infrastructure within and across our respective countries. We endorse the Joint Declaration on Cyber Resilience of Digital Infrastructure in response to the Russian war against Ukraine in this regard.</p>\n\n<p>90. We reaffirm our commitment to the framework of responsible state behaviour in cyberspace, and are working together to develop and implement robust international cyber norms. We are taking steps to strengthen our collective cyber defences, including in response to new and disruptive digital technologies, such as quantum computing, and will continue to work in close cooperation against the malicious use of cyberspace by both state and non-state actors. We will continue to discuss implementation of international norms and review of lessons-learned from existing efforts to include the attribution of cyber incidents, including by intensifying and elevating our cooperation on cyber within the relevant G7 Working Group. We will also continue to discuss ways to cooperate on emerging technologies, including new quantum-resistant cryptographic standards.</p>\n\n<p>91. We will support other states to increase digital access while ensuring that security, interoperability and respect for human rights are built into global connectivity.</p>\n\n<p>92. Digitalisation can significantly contribute to combating climate change and protecting the environment. At the same time, the rising demand for energy and resources resulting from the increasing use of digital technologies and services must be significantly reduced, and negative environmental impacts fostered by the use of digital technologies must be addressed. In this regard, we will better harness digital technologies for a net-zero, nature-positive, and resource-efficient economy and digital ecosystem. We reaffirm our support for international cooperation within the G7 and with like-minded partners to support the development of standards - based on inclusive multi-stakeholder approaches in line with our open, democratic values, and principles – and to further discussion on supporting standardisation towards digital and green transformations. To this end we look forward to building upon the work of a number of multilateral dialogues and fora to deliver democratic and market-oriented standards in technology, trade and innovation to improve the lives of our citizens and be a force for greater prosperity, such as the Trade and Technology Council (TTC), the Quad, the Future Tech Forum and the Global Partnership on Artificial Intelligence (GPAI). In this context, we also acknowledge the EU Declaration on Digital Rights and Principles.</p>\n\n<p>93. We strengthen our efforts to facilitate data free flow with trust across borders, continue to harness opportunities, and to address challenges raised in particular in relation to security, privacy, data protection, and the protection of intellectual property rights. To this end, we endorse the Action Plan for Promoting Data Free Flow with Trust. Furthermore, we are commited to advancing the e-commerce Joint Statement Initative.</p>\n\n<p>94. We will continue the discussion on competition in digital markets, including with regards to platforms regulation and its implementation, and look forward to the G7 Digital Ministers’ comprehensive overview of legislative approaches to competition, contestability, and fairness on digital markets within the G7, with a view to fostering greater coordination to support competitive digital markets.</p>\n\n<h2>Conclusion</h2>\n\n<p>95. Under the German Presidency, the engagement and exchange with civil society has been instrumental for the G7 as a group of democracies. To this end, we thank the G7 Engagement Groups – Business 7, Civil 7, Labour 7, Science 7, Think 7, Women 7 and Youth 7 – for their important input to our deliberations. We are furthermore grateful for the valuable contributions from the Heads of the International Energy Agency (IEA), the International Labour Organization (ILO), the International Monetary Fund (IMF), the Organisation for Economic Co-operation and Development (OECD), the World Bank (WB), the World Health Organization (WHO) and the World Trade Organization (WTO) as well as the Chair of the Gender Equality Advisory Council (GEAC) who joined us in Elmau. We stand ready to reconvene whenever necessary. We will support the Indonesian G20 Presidency in finding solutions to the most pressing global issues.</p>\n\n<p>96. We welcome the offer of the Prime Minister of Japan to host our next Summit in Hiroshima in 2023.</p></div>\n      "
}