{
  "path": "/en/news/statements/2022/06/01/statement-prime-minister-national-indigenous-history-month",
  "pageTitle": "Statement by the Prime Minister on National Indigenous History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous History Month:</p>\n\n<p>“Today, we mark the start of <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1466616436543/1534874922512\">National Indigenous History Month</a>, an opportunity for us all to learn more about the distinct histories of First Nations, Inuit, and Métis. This month, and every month, we have a collective responsibility to honour the stories and contributions of Indigenous Peoples, who have lived on – and cared for – these lands since time immemorial.</p>\n\n<p>“From the Maliseet in Atlantic Canada, to Inuit across Inuit Nunangat, from the Métis across the Prairies and beyond, to the Haida people of the Pacific Northwest, Indigenous communities have diverse histories, customs, spiritualities, and languages. This month is an opportunity for us all to learn about local Indigenous history, and to truly walk the path of reconciliation.</p>\n\n<p>“Only by acknowledging the truths of the past, can we begin to dress the wounds they created, and begin the journey of healing. Right across the country, the findings of unmarked burial sites near former residential schools has confirmed what Survivors and Indigenous communities have known about for decades, providing a tragic reminder of the painful and lasting impacts of colonialism. Over the past year, I’ve had the opportunity to visit many communities and hear directly from Survivors and their families how the painful legacy of residential schools lives with them every day. The Government of Canada will continue to provide the funding and resources communities need to search for unmarked burial sites, uncover the truth of what happened at residential schools, and continue on their healing journey. We are also fully committed to implementing the Truth and Reconciliation Commission’s Calls to Action.</p>\n\n<p>“By learning about Indigenous history in our communities and across the country, we can all play a role in dismantling the systemic racism, inequality, and discrimination that Indigenous Peoples continue to face today. This month, and every month, let us celebrate the resiliency of First Nations, Inuit, and Métis, and work together to build a better future for everyone.”</p></div>\n      "
}