{
  "path": "/en/news/statements/2022/04/01/statement-prime-minister-apology-his-holiness-pope-francis-regarding",
  "pageTitle": "Statement by the Prime Minister on the apology from His Holiness Pope Francis regarding the residential school system in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><em>If you need someone to talk to, please reach out to the National Indian Residential School Crisis Line, which is available 24 hours a day at 1-866-925-4419.</em></p>\n\n<p>The Prime Minister, Justin Trudeau, today issued the following statement on the apology from His Holiness Pope Francis for the Roman Catholic Church’s role in the residential school system in Canada:</p>\n\n<p>“I acknowledge His Holiness Pope Francis’ apology to Indigenous Peoples for the Roman Catholic Church’s role in operating the residential school system in Canada. Today is about the Survivors, their families, and those who never came home.</p>\n\n<p>“This week, First Nations, Inuit, and Métis leaders, Survivors, and youth travelled to the Vatican to continue urging the Catholic Church for an apology, which was an immense display of bravery and determination. This apology would not have happened without the Survivors who told their truths directly to one of the institutions responsible, and recounted and relived their painful memories.</p>\n\n<p>“For decades, First Nations, Inuit, and Métis have been calling on the Pope to recognize the spiritual, cultural, emotional, physical, and sexual abuse their children endured while attending these residential schools. For decades, they have been waiting for an apology.</p>\n\n<p>“Canada’s history will forever be stained by the tragic reality of the residential school system, which forcibly separated at least 150,000 Indigenous children from their families and communities, often at great distances, where they were prohibited from practising their culture and traditions, and speaking their languages. For Survivors, their families, and communities, the painful legacy of the residential school system lives with them every day.</p>\n\n<p>“Last year, the findings of unmarked graves at the sites of former residential schools across the country forced Canadians to reflect on our country’s failures and their impacts that continue to be felt today. As a country, we must never forget the unthinkable tragedies that took place and we must honour the children who went missing and never came home.</p>\n\n<p>“Today’s apology is a step forward in acknowledging the truth of our past. We cannot separate the legacy of the residential school system from the institutions that created, maintained, and operated it, including the Government of Canada and the Catholic Church. Today’s apology will resurface strong emotions of hurt and trauma for many. The government will continue to support Indigenous communities across the country with the funding and resources they need to continue to search for unmarked burial sites, uncover the truth of what happened at residential schools, and continue on their healing journey.</p>\n\n<p>“An apology by the Pope to residential school Survivors and their families delivered in Canada will specifically respond to the Truth and Reconciliation Commission’s Call to Action #58. I look forward to His Holiness Pope Francis apologizing in Canada at the request of First Nations, Inuit, and Métis peoples. The Government of Canada is fully committed to implementing the Truth and Reconciliation Commission’s Calls to Action.</p>\n\n<p>“Today, let us all reflect on the part we can play in walking the shared path of reconciliation and charting a new and better path forward – for Indigenous Peoples and for everyone in Canada.”</p></div>\n      "
}