{
  "path": "/en/news/statements/2023/04/28/statement-prime-minister-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Mourning:</p>\n\n<p>“Today, on the National Day of Mourning, we come together to remember all Canadians who were killed, injured, or became ill because of workplace accidents. Our thoughts go to those who live with the trauma of these tragedies, including the families carrying the weight of a loved one’s absence.</p>\n\n<p>“Established more than 30 years ago, this day invites us to reaffirm our commitment to creating safer and healthier workplaces for everyone. The Government of Canada has stepped up to improve workplace safety standards and practices, including by modernizing our compliance and enforcement regime under the <em>Canada Labour Code, </em>which protects federally regulated workers. These changes are helping to ensure there are strong consequences for employers who violate workplace safety standards and put hardworking Canadians in harm’s way.</p>\n\n<p>“Canadian workers drive our economy. They are helping to attract historic investments and strengthening Canada’s position as a global leader across a range of industries, including critical minerals and electric vehicle manufacturing. As the federal government invests to support projects and create new opportunities across the country, we are making sure the safety of workers is a top priority, including for those who work in particularly difficult conditions. For example, we recently announced an investment to help critical mineral producer BHP improve worker safety as it develops a world-leading potash mine in Saskatchewan.</p>\n\n<p>“We also continue to support the important work of the <a href=\"https://www.ccohs.ca/ccohs.html\">Canadian Centre for Occupational Health and Safety</a>, to end work-related illnesses and injuries through a range of accessible safety services and resources for workers and employers alike, and to combat workplace harassment and violence. We have also made 10 days of paid sick leave a reality in all federally regulated private sector workplaces — because no one should have to choose between staying home when they are sick or paying their bills.</p>\n\n<p>“On this sombre day, I invite all Canadians to join me in honouring the workers who lost their lives or have been injured on the job, and keeping their loved ones in our thoughts. As we mourn, we recommit to creating healthier workplaces where everyone can feel safe to go to work.”</p></div>\n      "
}