{
  "path": "/en/news/news-releases/2022/09/21/prime-minister-attend-funeral-abe-shinzo",
  "pageTitle": "Prime Minister to attend the funeral of Abe Shinzo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will travel to Japan, from September 24 to 28, to attend the funeral of former Japanese Prime Minister Abe Shinzo. The Prime Minister will convey Canadians’ condolences for the loss of a strong ally and friend, and reaffirm Canada’s commitment to our partnership with Japan.&nbsp;</p>\n\n<p>During his visit, the Prime Minister will also meet with the Prime Minister of Japan, Kishida Fumio, to advance shared priorities as Japan prepares to assume the G7 Presidency in 2023. The meeting will also reaffirm and strengthen the strategic partnership between Canada and Japan, most notably our joint commitment to a free and open Indo-Pacific region. The prime ministers will also discuss regional security issues, including the threat of North Korea’s nuclear weapons and ballistic missile programs. While there, the Prime Minister will meet with Canadians who are supporting security and peace in the region.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Mr. Abe was a dedicated, visionary leader who brought Canada and Japan closer together during his time as Prime Minister. On behalf of all Canadians, I extend my deepest condolences to former Prime Minister Abe’s family and friends, and to the Japanese people. His presence and influence will be missed.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prime Minister Trudeau welcomed Prime Minister Abe to Canada in 2019 and they cooperated closely over several years within the G7,G20, Asia-Pacific Economic Cooperation (APEC), and in other international forums.</li>\n\t<li>Canada and Japan are also members of the Asian Development Bank, the International Monetary Fund, and the Organisation for Economic Co-operation and Development.&nbsp;</li>\n\t<li>Prime Minister Trudeau met with Prime Minister Kishida in Germany this past June.</li>\n\t<li>Japan is the world’s third-largest national economy. With a gross domestic product of $6.2 trillion in 2021, it is one of Canada’s most important economic and commercial partners and Canada’s largest source of bilateral foreign direct investment (FDI) in Asia. Foreign direct investment from Japan into Canada was valued at $46 billion in 2021.</li>\n\t<li>Japan is also Canada’s fourth-largest partner in two-way merchandise trade. Canada’s exports of merchandise to Japan totalled $14.5 billion in 2021, while imports from Japan were $15.5 billion. Canada and Japan are partners in the CPTPP. The CPTPP entered into force for the first six countries to ratify the Agreement, including Canada and Japan, on December 30, 2018.</li>\n\t<li>There are over 120,000 people of Japanese origin residing in Canada and before the COVID-19 pandemic, approximately 300,000 Japanese and Canadians travelled to each other’s country annually.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/07/08/statement-prime-minister-assassination-former-japanese-prime-minister\">Statement by the Prime Minister on the assassination of former Japanese Prime Minister Shinzo Abe</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/japan-japon/relations.aspx?lang=eng\">Canada-Japan relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/photos/2019/04/28/prime-minister-justin-trudeau-welcomes-prime-minister-japan-shinzo-abe-parliament\">Prime Minister Justin Trudeau welcomes Prime Minister of Japan Shinzo Abe to Parliament Hill</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/06/27/prime-minister-justin-trudeau-meets-prime-minister-japan-kishida-fumio\">Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio</a></li>\n</ul></div>\n      "
}