{
  "path": "/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan on the Omicron variant of concern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier John Horgan to discuss the impact of the COVID-19 Omicron variant of concern in Canada.</p>\n\n<p>The two leaders agreed on the urgency of the situation, particularly with the holidays fast approaching. They reaffirmed the importance of accelerating the rollout of booster vaccine doses across the country as well as continuing to make progress on vaccinating children. The Prime Minister indicated that the federal government will continue to work very closely with provinces and territories, as well as First Nations, Inuit, and Métis, to reduce the impact of Omicron.</p>\n\n<p>The Prime Minister indicated his intention to convene a call with all First Ministers later today to further discuss how governments can best collaborate to keep Canadians safe.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/statement-from-minister-duclos-on-first-cases-of-omicron-variant-of-concern-in-canada.html\">Statement from Minister Duclos on first cases of Omicron variant of concern in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/government-of-canada-introduces-additional-measures-to-address-covid-19-omicron-variant-of-concern.html\">Government of Canada introduces additional measures to address COVID-19 Omicron variant of concern</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/16/prime-minister-justin-trudeau-holds-34th-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 34th call with premiers on COVID-19 response</a></li>\n</ul></div>\n      "
}