{
  "path": "/en/news/statements/2021/10/05/statement-prime-minister-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p>\n\n<p>“‘Educator only begins to scratch the surface of a teacher’s job description. Every day, they step into many other roles as well, including as coaches, mentors, and advocates. They inspire our students to think outside the box, dream big, and persevere. Their wisdom and guidance help students find and develop their strengths and pursue their unique career paths. Teachers – including those in post-secondary institutions, such as adult educators, teaching assistants, and professors – play an important role in bringing out the best in us and strengthening our communities and society. Today, on <a href=\"https://en.unesco.org/commemorations/worldteachersday\">World Teachers’ Day</a>, we celebrate all teachers and thank them for sharing their time and energy so our students have the best experience possible to learn and grow.</p>\n\n<p>“Since the start of the COVID-19 pandemic, teachers’ workloads and pressures have drastically increased. Over the past year and a half, educators around the world have had to adapt their teaching styles, juggle in-person and virtual school, and project their voices louder through masks. We commend our teachers for their efforts to go above and beyond to engage every child in learning. This year’s theme – Teachers at the heart of education recovery – focuses on the support teachers need to contribute to the recovery from the COVID-19 crisis.</p>\n\n<p>“The Government of Canada has taken concrete steps to help teachers during these challenging times. Last year, we announced an investment of up to $2 billion through the Safe Return to Class Fund for provinces and territories. This funding has helped schools adapt learning spaces, improve air ventilation, increase hand sanitation, purchase personal protective equipment and cleaning supplies, and provide health and safety training for staff. We also announced an additional $224 million over two years in funding for First Nations to support community measures to ensure a safe return to school on reserves. As part of our continued commitment to educators, we will work to increase the Eligible Educator School Supply Tax Credit from 15 to 25 per cent, and expand the eligibility criteria to include tech devices and supplies purchased when teaching is virtual or from home.</p>\n\n<p>“We recognize the world is a stronger and better place when teachers around the globe have the resources to provide a quality education – to all children. That is why, at the Generation Equality Forum in June, we allocated $50 million from Canada’s pledge to the Global Partnership for Education to address social and institutional barriers to girls’ education in partner countries.</p>\n\n<p>“I know first-hand the sacrifices teachers make and the dedication they have to their students. Across the country, we have exceptional teachers that prepare our young people for future success. The <a href=\"https://www.ic.gc.ca/eic/site/pmate-ppmee.nsf/eng/home\">Prime Minister's Awards for Teaching Excellence</a>, <a href=\"https://www.ic.gc.ca/eic/site/pmate-ppmee.nsf/eng/home\">Teaching Excellence in STEM</a>, and <a href=\"https://www.ic.gc.ca/eic/site/pmaece-ppmepe.nsf/eng/home\">Excellence in Early Childhood Education</a> honour some of the many educators that demonstrate leadership and make a difference in the lives of their students.</p>\n\n<p>“On behalf of the Government of Canada, I thank all teachers and educators in Canada and around the world for the essential work you do every day. You are a key pillar in building the leaders of today and tomorrow. I encourage all Canadians to take a moment to thank a teacher who has positively shaped their world.”</p></div>\n      "
}