{
  "path": "/en/news/statements/2020/11/11/statement-prime-minister-remembrance-day",
  "pageTitle": "Statement by the Prime Minister on Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Remembrance Day:</p>\n\n<p>“Today, on <a href=\"https://www.veterans.gc.ca/eng/remembrance\">Remembrance Day</a>, we honour the brave Canadians in uniform who have served, and continue to serve, our country in times of war, conflict, and peace. To those who have been injured in the line of duty, who have lived with the physical and mental scars of war, and who have made the ultimate sacrifice – we remember. We also honour their family members – parents, siblings, children, and spouses – who have given up time with their loved ones, in the name of our country.</p>\n\n<p>“In the face of hardship and fear, our veterans and service members have always shown immense courage and selflessness. From Vimy Ridge and Juno Beach to Korea, Cyprus, and Afghanistan, their commitment to protecting the rights of others and to defending the principles of peace, freedom, and democracy has never faltered. These ordinary Canadians became honoured heroes and made extraordinary sacrifices to ensure a better, safer, and brighter future for people in Canada and around the world.</p>\n\n<p>“We honour all those who risked their lives for our freedom and those we lost in service of their country this year, including Sub-Lieutenant Abbigail Cowbrough, Sub-Lieutenant Matthew Pyke, Master Corporal Matthew Cousins, Captain Maxime Miron-Morin, Captain Kevin Hagen, Captain Brenden Ian MacDonald, Captain Jennifer Casey, and Corporal James Choi. Like those who have gone before them, those who may have been facing their own battles, and those whose names Canadians may not know, they gave their lives in service of a better Canada.</p>\n\n<p>“Even if we are not able to gather in person today, we can still take the time to honour and remember our veterans and the fallen, especially this year as we mark the 75th anniversary of the end of the Second World War. To show our gratitude and respect for the depth of their sacrifice, we hold them close to our hearts in the form of a poppy. Everyone is also invited to watch the ceremony taking place at the National War Memorial, which is being <a href=\"https://www.facebook.com/CanadaRemembers\">livestreamed on Facebook</a> today, and to consult the <a href=\"https://www.veterans.gc.ca/eng/remembrance\">online resources</a> to mark this day.</p>\n\n<p>“This year, we should also highlight that the global COVID-19 pandemic has negatively impacted veterans and their families and the organizations that serve them. Yesterday, we announced $20 million in new funding to create a temporary Veterans Organizations Emergency Support Fund. This investment will provide much needed financial support to veterans organizations that have been hit hard by the pandemic.</p>\n\n<p>“At 11:00 a.m. today, I encourage all Canadians to observe two minutes of silence, and solemnly remember all those who have fought for us and our country. We owe them an immeasurable debt of gratitude for helping to make Canada the prosperous, free, and secure country we enjoy.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}