{
  "path": "/en/news/news-releases/2016/08/16/prime-minister-canada-and-premier-nova-scotia-reach-agreement-under",
  "pageTitle": "The Prime Minister of Canada and the Premier of Nova Scotia reach agreement under new federal infrastructure funding programs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to making significant investments in infrastructure that will improve our public transit systems, keep our water clean, and strengthen our communities.</p>\n<p>Today, the Prime Minister, Justin Trudeau, and the Honourable Stephen McNeil, Premier of Nova Scotia, announced that they had reached a bilateral agreement that will result in more than $238 million being invested in wastewater and public transit projects across the province.</p>\n<p>The agreement will ensure that the harbours and rivers across Nova Scotia are pristine, that existing water systems can withstand extreme weather events, and that our kids have plenty of safe drinking water.</p>\n<p>The investment announced today will also mean a greater number of buses on the road – as well as the increased accessibility of those buses – so that Nova Scotians spend less time waiting at bus stops, and more time spent with their loved ones.</p>\n<p>Investing in infrastructure is vital for creating middle class jobs today, and sustained economic growth for years to come.</p>\n<p><strong>Quotes</strong></p>\n<p>“We are committed to investing in infrastructure that will help make our towns and cities better, healthier and safer places in which to live, work and play. The investments announced today will help provide the people of Nova Scotia with clean and reliable water sources and help them get home to their loved ones sooner via enhanced public transit. The funding will also generate new jobs – helping grow the middle class – and lay solid foundations for the sustainable economy of the future.”<br>—&nbsp;<em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>‎\"Having the three levels of government work together to improve critical clean water and wastewater systems ‎means these projects can be completed sooner for the benefit of our citizens. This work will make our communities stronger, healthier and more sustainable. I am also pleased to see funding for public transit. Public transportation gives Nova Scotians more mobility; it's good for the environment and the economy.\"<br>—&nbsp;<em>Stephen McNeil, Premier of Nova Scotia</em></p>\n<p><strong>Quick facts</strong></p>\n<ul>\n<li>This funding is part of the first phase of&nbsp;<em>Investing in Canada</em>, the Government of Canada’s historic $120-billion plan to support public infrastructure across the country over the next 10 years.</li>\n<li>Phase 1 of&nbsp;<em>Investing in Canada</em>&nbsp;will provide $11.9 billion in investments to support public transit systems, green infrastructure projects, and social infrastructure projects. Details on Phase 2 of&nbsp;<em>Investing in Canada</em>&nbsp;will be announced over the next year.</li>\n<li>The funding available under the Public Transit Infrastructure Fund and the Clean Water and Wastewater Fund will be managed through agreements between the Government of Canada and provincial and territorial governments.</li>\n<li>Under this agreement, the Government of Canada has made its funding retroactive to April 1, 2016, so projects can proceed without delay to ensure a productive construction season.</li>\n<li>The announcement made today includes funding provided not only by the Government of Canada, but the province of Nova Scotia and numerous municipalities in the province, as well.</li>\n<li>It will allow Nova Scotia municipalities and public transit organizations to access $119 million in federal funding to undertake water and waste water projects ($86,869,027) and public transit projects ($32,200,000) across the province. Combined with funding from the province and municipalities, this figure increases to $238 million.</li>\n<li>The two leaders also announced an initial 96 projects that have been approved under the two new funding programs which include a new wastewater treatment system for Parrsboro, important upgrades to the sewer system in Bridgetown and transit upgrades in Halifax.</li>\n</ul>\n<p><strong><br>Related products</strong></p>\n<p><a href=\"/en/news/backgrounders/2016/08/16/government-canada-and-government-nova-scotia-reach-agreement-under\">Complete list of identified projects in Nova Scotia</a></p>\n<p><strong>Associated links</strong></p>\n<p><a href=\"http://www.infrastructure.gc.ca/map-carte/ns-eng.html\">Federal infrastructure investments in Nova Scotia</a><br><a href=\"http://infraconsults.ca/\">Have your say on Infrastructure</a><br><a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\">Investing in Canada: The $120 Billion Infrastructure Plan</a><br><a href=\"http://www.infrastructure.gc.ca/plan/cwwf-fepeu-eng.html\">The Clean Water and Wastewater Fund</a><br><a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">The Public Transit Infrastructure Fund</a></p></div>\n      "
}