{
  "path": "/en/news/news-releases/2015/11/24/prime-minister-travel-united-kingdom-attend-commonwealth-meeting",
  "pageTitle": "Prime Minister to travel to the United Kingdom, attend Commonwealth meeting in Malta, and climate conference in France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Europe for various bilateral and multilateral meetings. In London, United Kingdom, the Prime Minister will have an audience with Her Majesty Queen Elizabeth II at Buckingham Palace, and will meet with his counterpart David Cameron, Prime Minister of the United Kingdom, on November 25, 2015. He will then travel to Valletta, Malta, to attend the Commonwealth Heads of Government Meeting (CHOGM), being held from November 27 to 29, 2015.</p>\n<p>Following CHOGM, the Prime Minister will travel to Paris, France, from November 29 to 30, 2015, for a bilateral meeting with President François Hollande. Finally, while in Paris, the Prime Minister will attend the Leaders’ Event of the 21<sup>st</sup> session of the Conference of the Parties (COP 21) under the United Nations Framework Convention on Climate Change. He will be joined by the Minister of the Environment and Climate Change, Catherine McKenna, and the Minister of Foreign Affairs, Stéphane Dion.</p>\n<p>During their meeting in London, the Prime Minister and his U.K. counterpart will discuss key issues including the coalition against the Islamic State of Iraq and Syria, the situation in Syria, the refugee crisis, and Ukraine. They will also discuss the implementation of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p>\n<p>At CHOGM 2015, the Prime Minister will participate in discussions focused on ways to make a positive difference to the lives of the more than two billion people living in Commonwealth countries. Topics will include climate change, economic opportunity, violent extremism and radicalization, migration, gender equality and women’s empowerment, as well as the implementation of “Transforming our World: The 2030 Agenda for Sustainable Development.”</p>\n<p>In Paris, during his meeting with President François Hollande prior to COP 21, the Prime Minister will discuss the implementation of CETA, pressing global issues such as the situation in Syria and the migration crisis, and he will reiterate Canada’s priorities for the COP 21 climate conference in Paris.</p>\n<p>For the first time in over 20 years of United Nations negotiations, COP 21 is expected to result in the adoption of a new international climate change agreement in which all countries will commit to action. The Prime Minister will deliver a national statement highlighting Canada’s commitment to working with international partners to reduce carbon emissions and grow a climate-resilient global economy.</p>\n<p>The Prime Minister has invited Premiers to accompany him to Paris, demonstrating Canada's intention to work in partnership with the provinces and territories to reduce greenhouse gas emissions and position Canada as a global leader in the fight against climate change.</p>\n<p><strong>Quotes</strong></p>\n<p>“The Commonwealth plays a key role in promoting democracy, peaceful pluralism, inclusive and accountable governance, and sustainable development around the world. I look forward to working with my fellow Commonwealth leaders to address important issues affecting our societies, including climate change, economic opportunity, violent extremism and radicalization, and ending child, early, and forced marriage.”<br><em>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Climate change is an immediate and significant threat to our communities and our economy. Canada will demonstrate real leadership in addressing this challenge.&nbsp;I look forward to partnering with provinces and territories – and all parties – to achieve an ambitious international climate agreement at COP 21 for our and all future generations.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Commonwealth is the world’s oldest political association of sovereign states. The organization brings together 53 countries that account for a combined population of 2.3 billion and almost 30 per&nbsp;cent of the world’s population.</li>\n<li>CHOGM takes place every two years, where leaders address issues affecting the Commonwealth and international community. Canada hosted CHOGM 1973 in Ottawa and CHOGM 1987 in Vancouver.</li>\n<li>At CHOGM 2015, under the theme “The Commonwealth: Adding Global Value,” Heads of Government will reaffirm their commitment to upholding the <em>Commonwealth Charter</em>, which focuses on democracy, human rights, the rule of law, as well as economic opportunity and sustainable development. It will also be a venue to discuss how the Commonwealth can add value in addressing global challenges.</li>\n<li>The United Nations Framework Convention on Climate Change was adopted in 1992 at the Rio Earth Summit to coordinate international efforts to address climate change. Canada is one of 195 countries that are parties to this convention.</li>\n<li>COP 21 is the culmination of four years of negotiations toward a new global climate change agreement, with the aim of keeping global warming below two degrees Celsius.</li>\n<li>As the host of COP 21, France has launched an active, inclusive agenda that brings both state and non-state actors together to accelerate cooperative climate change action.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://www.international.gc.ca/commonwealth/index.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n<li><a href=\"https://chogm2015.mt\">CHOGM Malta 2015</a></li>\n<li><a href=\"http://thecommonwealth.org/\">The Commonwealth</a></li>\n<li><a href=\"http://www.cop21paris.org/\">COP 21</a></li>\n<li><a href=\"http://unfccc.int/2860.php\">United Nations Framework Convention on Climate Change</a></li>\n</ul></div>\n      "
}