{
  "path": "/en/news/statements/2020/06/05/statement-prime-minister-world-environment-day",
  "pageTitle": "Statement by the Prime Minister on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p>\n\n<p>“Today, we join the global community to celebrate <a href=\"https://www.un.org/en/observances/environment-day\">World Environment Day</a>, a day to appreciate nature and to reflect on the positive actions we can take to leave a cleaner, healthier planet for generations to come.</p>\n\n<p>“This year’s theme – <a href=\"https://www.worldenvironmentday.global/about/biodiversity\">Biodiversity</a> – demonstrates the importance of our natural world, from the insects in our backyards and the birds in our neighbourhood parks, to the water lilies in our lakes and the trees in our forests. With our environment increasingly under threat from climate change, it is clear that we need to do more to restore the balance of nature, protect plant and animal species, and sustain our planet.</p>\n\n<p>“Canada is stepping up as a world leader in biodiversity and nature conservation. In 2018, we made a $1.3-billion investment in nature conservation in Canada – the single largest investment to protect nature in our history – to help us meet our international commitments for biodiversity, sustainable development, and climate change. We exceeded our 2020 target of protecting 10 per cent of Canada’s marine areas ahead of schedule, and we are working on a plan to conserve 25 per cent of Canada’s land and 25 per cent of Canada’s oceans by 2025, and 30 per cent of each by 2030. This work will be grounded in science, Indigenous knowledge, and local perspectives. Canada also has taken important steps to ban harmful single-use plastics, and recently committed to plant two billion trees over the next ten years as part of nature-based solutions to fight climate change. We need to act now and be ambitious if we want to leave a cleaner and more sustainable world for our children and grandchildren.</p>\n\n<p>“Biodiversity and healthy ecosystems are vital to our health and continued prosperity. This year, as we practice physical distancing and spend more time than usual in our homes to keep our families and communities safe during COVID-19, we are reminded of how important nature is to our well-being and everyday lives. As we look toward restarting our economy, we need to continue investing in the protection of our natural surroundings and the fight against climate change—because if you do not have a plan for the environment, you cannot have a plan for the economy. I encourage Canadians to do their part in creating a more equitable and sustainable world, and to take action to protect our environment. To take care of ourselves, we must take care of nature.</p>\n\n<p>“Together, we can build a world that is cleaner, healthier, and more sustainable – today and for future generations.”</p></div>\n      "
}