{
  "path": "/en/news/statements/2021/07/11/statement-prime-minister-imamat-day",
  "pageTitle": "Statement by the Prime Minister on Imamat Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Imamat Day:\n</p>\n<p>“Today on Imamat Day, we join Ismaili Muslims in Canada and around the world to celebrate the 64th anniversary of the accession of His Highness Prince Karim Aga Khan&nbsp;IV as the 49th hereditary Imam – spiritual leader – of Shia Ismaili Muslims. This year, due to the global COVID-19 pandemic, people will mark this day a bit differently with loved ones at home, but as always, with immense joy.\n</p>\n<p>“Since becoming Imam, the Aga Khan has worked tirelessly to improve the quality of life of both the Shia Ismaili community and the many places they live around the world. His contributions, through the Aga Khan Development Network, have helped advance humanitarian causes and civil society, promote health and education, and encourage people to be more active and engaged in their communities. Today, his work is widely recognized by governments, international institutions, and non-profit organizations globally, including here in Canada.\n</p>\n<p>“Canada shares the values that the Aga Khan promotes – compassion, pluralism, human rights, and respect for diversity. We recognize the important role that these values play in building the diverse, generous, and prosperous country that we call home. We are proud to have bestowed honorary Canadian citizenship on the Aga Khan and honoured to host both the Aga Khan Museum in Toronto and the Global Centre for Pluralism in Ottawa.\n</p>\n<p>“Ismaili Muslims have enriched our national fabric in countless ways over the years. Today, as we work together to fight the global pandemic, they are stepping up by donating cloth masks to essential workers, providing non-perishable food items to food banks, and making vital blood donations in support of National Blood Donor Week. I hope all Canadians take time to recognize the many contributions Ismaili Canadians have made – and continue to make – to our country.&nbsp;&nbsp;&nbsp;\n</p>\n<p>“On behalf of our family, Sophie and I extend our heartfelt congratulations to His Highness on the anniversary of his accession as Imam, and thank him for his noble and important work.\n</p>\n<p>“Khushali Mubarak!”\n</p></div>\n      "
}