{
  "path": "/en/news/statements/2016/11/14/statement-prime-minister-canada-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister of Canada on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark Global Entrepreneurship Week, which runs from November 14 to 20, 2016:</p>\n<p>“Canadian entrepreneurs work hard every day to transform new ideas into market-ready products and services that they export to the world, while creating job opportunities here at home that grow our middle class, strengthen our communities, and shape the course of our country’s future.</p>\n<p>“Global Entrepreneurship Week celebrates their ingenuity, hard work, and enormous contributions to our nation’s prosperity and economic security. This week is also an opportunity for aspiring entrepreneurs to connect with collaborators, mentors, and investors, and explore ways to turn their dreams into reality.</p>\n<p>“The Government of Canada is committed to helping Canadian entrepreneurs grow their businesses and thrive – here at home and abroad. We know that our entrepreneurs and small business owners are essential to creating the economy – and the well-paying jobs – of the future. That is why we are investing in programs that support innovation and skills training, including for women, Indigenous, and young entrepreneurs. That is also why we are negotiating new trade agreements with traditional and new partners around the world. The recently signed Canada-European Union Comprehensive Economic and Trade Agreement will create new job opportunities and help grow our middle class and those working hard to join it.</p>\n<p>“On behalf of the Government of Canada, Sophie and I invite all Canadians to celebrate our entrepreneurs by participating in events during this important week. We thank the official host of Global Entrepreneurship Week in Canada – Futurpreneur Canada – and wish them every success with this year’s activities.”</p></div>\n      "
}