{
  "path": "/en/news/news-releases/2016/11/16/prime-minister-justin-trudeau-concludes-successful-first-official",
  "pageTitle": "Prime Minister Justin Trudeau concludes successful first official visit to Cuba | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a productive first official visit to Cuba, where he reinforced Canada’s longstanding relationship with Cuba and identified a number of areas where the two countries could work even closer together.</p><p>In his meetings with President Raúl Castro, Prime Minister Trudeau agreed to collaborate on climate change, gender equality, regional safety and security issues, as well as take steps to grow both economies and strengthen the middle class.</p><p>The Prime Minister also delivered remarks and responded to questions at the University of Havana, where he emphasized the importance of Canadian values related to gender equality, and building a stronger, more inclusive society.</p><p>During his visit, the Prime Minister participated in a roundtable with civil society organizations to discuss diversity, race, gender, and LGBTQ2 issues. He also laid a wreath at the José Martí Monument, in memory of the Cuban national hero who became a symbol of liberty for Cuba and Latin America.</p><h2>Quote</h2><blockquote><p>”I would like to thank President Castro and the Cuban people for their warmth and hospitality. It is no wonder that so many Canadians keep returning every year to this beautiful country. The visit showed me how much we have in common, the tremendous opportunities that exist to build closer social and economic ties between our nations, and Cuba’s openness to frank and respectful exchanges on governance, human rights and other important social issues.”<br>— <cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Cuba are long-standing partners, with a friendship based on respectful engagement. This year marks the 71st anniversary of diplomatic relations.</li><li>Cuba is Canada’s top market in the Caribbean/Central American sub-region and bilateral merchandise trade between the two countries is over one billion dollars annually. Canadian companies have significant investments in mining, power, oil and gas, agri-food and tourism.</li><li>Canada’s longstanding development cooperation program in Cuba is contributing to the modernization of the state and encouraging economic liberalization with projects focused on stimulating sustainable economic growth and increasing food security.</li><li>Former Prime Minister Pierre Trudeau’s historic visit to Cuba in 1976 was the first visit by a Western leader since 1960. The visit set the tone for an enduring Canada-Cuba relationship.</li></ul><h2>Related Link</h2><ul><li><a href=\"/en/news/backgrounders/2016/11/16/fact-sheet-–-strengthening-canada-cuba-relations\">Fact sheet – Strengthening Canada-Cuba relations</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/cuba/index.aspx?lang=eng\">Embassy of Canada to Cuba</a></li></ul></div>\n      "
}