{
  "path": "/en/news/readouts/2022/06/14/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy,<strong> </strong>to express Canada’s ongoing support for Ukraine against Russia’s military aggression and to discuss a range of possible measures of Canadian assistance ahead of the upcoming Commonwealth, G7, and NATO summits.</p>\n\n<p>President Zelenskyy highlighted front-line challenges, specifically in and around Severodonetsk, to the east of Ukraine, and outlined the military assistance required by Ukraine as Russian armed forces continue to attack in the Donbass region. The two leaders discussed what further assistance Canada could provide to support Ukraine, and President Zelenskyy expressed his gratitude for Canada’s unwavering support for Ukraine’s sovereignty and territorial integrity.</p>\n\n<p>The Prime Minister and President discussed Russia’s persistent indiscriminate bombings and destruction of civilian infrastructure in Donbass, highlighting the gravity of the humanitarian crisis. They also discussed how Canada could engage other leaders at the upcoming Commonwealth summit in an effort to effectively counter Russia’s disinformation in the Global South and address the broader global impacts of Russia’s illegal and unjustifiable invasion.</p>\n\n<p>President Zelenskyy sought Prime Minister Trudeau’s views on longer-term reconstruction in Ukraine, including on the pressing needs for educational infrastructure, as students look to resume classroom activities in the fall.</p>\n\n<p>The leaders also discussed expectations for the upcoming European Council and NATO summits. The Prime Minister expressed his support for Ukraine’s progress toward closer integration into the European Union, and both leaders agreed to stay in close touch.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/05/24/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n</ul></div>\n      "
}