{
  "path": "/en/news/news-releases/2017/12/18/prime-minister-announces-appointment-honourable-sheilah-l-martin",
  "pageTitle": "Prime Minister announces appointment of the Honourable Sheilah L. Martin to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Sheilah L. Martin to the Supreme Court of Canada effective immediately.</p><p>First appointed as a judge in 2005, Justice Martin served on the Court of Queen’s Bench of Alberta in Calgary until June 2016 when she was appointed as a judge of the Courts of Appeal of Alberta, the Northwest Territories, and Nunavut. She has also served as a Deputy Judge for the Supreme Court of Yukon since 2009.</p><p>Throughout her thirty-year career, she has maintained a strong focus on education, equality rights, and increasing the number of under-represented groups in law schools and the legal profession, including Indigenous Peoples.</p><p>This appointment is the second under the Government of Canada’s new Supreme Court selection process, which promotes greater openness, transparency, and accountability.</p><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2017/11/29/honourable-sheilah-l-martin\">The Honourable Sheilah L. Martin</a></li></ul><h2>Associated Links</h2><ul><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"/en/news/news-releases/2017/11/29/prime-minister-announces-nomination-honourable-sheilah-l-martin\">Prime Minister announces nomination of the Honourable Sheilah L. Martin to the Supreme Court of Canada</a></span></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/nominee-candidat-eng.html\">Candidate questionnaire filled out by Justice Sheilah L. Martin</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/qualifications-eng.html\">Qualifications and Assessment Criteria for Supreme Court of Canada appointments</a></li><li><a href=\"http://www.fja-cmf.gc.ca/scc-csc/index-eng.html\">Supreme Court of Canada appointments</a></li></ul></div>\n      "
}