{
  "path": "/en/news/statements/2022/06/23/statement-prime-minister-national-day-remembrance-victims-terrorism",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Terrorism:</p>\n\n<p>“Today, I join all Canadians to pay tribute and remember those we have lost to terrorist attacks. I extend my deepest sympathies to the families and friends who are without their loved ones, and to everyone living with pain and trauma caused by these senseless acts of violence.</p>\n\n<p>“On this day in 1985, 329 innocent people, including 280 Canadians, were killed by a terrorist attack on Air India Flight 182 bound for the United Kingdom from Canada. This remains the deadliest terrorist attack in Canadian history. To honour the victims of this tragedy and of terrorist attacks across the world, the government declared June 23 of every year as a National Day of Remembrance for Victims of Terrorism.</p>\n\n<p>“As a country, we cannot become desensitized to violence and we cannot accept it as normal. Terrorism has no place in this country and the Government of Canada condemns all forms of terrorism. We work with our allies at home and abroad to stop the spread of violent extremism and terrorism, and to strengthen the resilience and inclusiveness of our society against terrorist and violent extremist ideologies. Canada continues to uphold the values of inclusion, respect for diversity, and pluralism – values that are stronger than fear, hatred, and intolerance.</p>\n\n<p>“On this day, we also express solidarity with the survivors and those injured in terrorist attacks. The impacts of these incidents are wide-ranging, and we would like to thank the essential service providers who respond to terrorist incidents and are key to providing support for survivors. From security and law enforcement agencies, diplomats, members of the intelligence community, to health care professionals, prevention practitioners, and civil society organizations, these local engagements are key to help victims and survivors of terrorism, and to foster community resilience.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I honour those we have lost to acts of terrorism. As Canadians, we choose compassion over hate and we embrace diversity and equality as we work to build a safer Canada for everyone.”</p></div>\n      "
}