{
  "path": "/en/news/news-releases/2021/02/02/new-support-produce-covid-19-vaccines-and-treatments-canada",
  "pageTitle": "New support to produce COVID-19 vaccines and treatments in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since the beginning of the global COVID-19 pandemic, the Government of Canada has worked quickly to strengthen and expand our capacity to manufacture safe and effective vaccines, treatments, and related supplies across the country. This includes investing in made-in-Canada projects to protect Canadians from COVID-19 and ensure our country is well-positioned to fight future pandemics here at home.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the government has signed a memorandum of understanding with Novavax to pursue the production of its COVID-19 vaccine at the National Research Council of Canada’s Biologics Manufacturing Centre in Montréal.</p>\n\n<p>The Prime Minister also announced investments to support vaccine, therapeutic, and biomanufacturing projects in Canada. These include:</p>\n\n<ul>\n\t<li>Up to $25.1 million to Precision NanoSystems Incorporated (PNI), a Vancouver-based biotechnology company, to expand our ability to produce ribonucleic acid vaccines and future genetic medicines in Canada. PNI will build a $50.2 million biomanufacturing centre to produce vaccines and therapeutics for the prevention and treatment of diseases such as infectious diseases, rare diseases, cancer and other areas of unmet need.</li>\n\t<li>Up to $14 million to Edesa Biotech Inc. (Edesa), a biopharmaceutical company based in Markham, Ontario, to advance work on a monoclonal antibody therapy for acute respiratory distress syndrome, which is the leading cause of COVID-19 deaths. Edesa’s $18.7 million project has received Health Canada approval to conduct its phase 2 clinical trials, and has begun administering its treatment to clinical trial participants in Canada.</li>\n</ul>\n\n<p>The Government of Canada will always rely on science- and evidence-based decision-making. This is why the investments and the actions of the government are informed by the recommendations of the COVID-19 Vaccine and Therapeutics Task Forces and COVID-19 Joint Biomanufacturing Subcommittee. We will continue to partner with Canadian industry and businesses to protect Canadians from COVID-19, and to build our biomanufacturing capacity as part of our recovery plan. Together, we can build a country that is healthier and safer for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since the beginning of the pandemic, our top priority has been the health and safety of all Canadians. Today, we are investing in our biomanufacturing capacity so that we have the made-in-Canada vaccines and treatments we need to protect Canadians, now and in the future, and recover from the impacts of COVID-19.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is bringing back the vaccine manufacturing capacity that Canadians expect and need. These investments will help to ensure that Canada has modern, flexible vaccine manufacturing capabilities now and in the future. With the investments announced today, our government is helping Canadian companies advance made-in-Canada vaccines and therapies, while securing domestic manufacturing options for international vaccine candidates. This is all part of our government’s commitment to protect the health and safety of all Canadians today, and in the future.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is working with domestic suppliers, partnering with leading international vaccine developers, and building biomanufacturing capacity to secure safe and effective vaccines for Canadians. These investments are a great complement to our diverse portfolio of seven agreements, and will further ensure Canada’s access to vaccines for COVID-19 and future pandemics.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are working hard to ensure Canadians have access to safe and effective COVID-19 vaccines and treatments. Through these partnerships, we are supporting and partnering with innovative Canadian companies – something that will help keep Canadians safe and healthy”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada has already approved vaccines to prevent COVID-19, which are being distributed across the country. The Pfizer-BioNTech COVID-19 vaccine was approved by Health Canada on December 9, 2020, and the Moderna COVID-19 vaccine was approved on December 23, 2020.</li>\n\t<li>The memorandum of understanding with <a href=\"https://www.novavax.com/\">Novavax</a> enables the government to pursue options to produce the Novavax COVID-19 vaccine at the National Research Council’s Biologics Manufacturing Centre in Montréal, once both the vaccine candidate and the facility receive Health Canada approvals. Novavax recently initiated the rolling submission process for regulatory approval to Health Canada.\n\t<ul>\n\t\t<li>The Government of Canada currently has an agreement with Novavax to purchase up to 76 million doses of the Novavax COVID-19 vaccine candidate.</li>\n\t</ul>\n\t</li>\n\t<li><a href=\"https://www.precisionnanosystems.com/\">Precision NanoSystems Incorporated </a>is a global leader in innovative solutions for the discovery, development, and manufacturing of nanomedicines to treat infectious diseases and cancer. Its project proposal was reviewed by the COVID-19 Joint Biomanufacturing Subcommittee.\n\t<ul>\n\t\t<li>Once the biomanufacturing centre is completed, targeted for March 2023, PNI will have the capacity to produce up to 240&nbsp;million doses of its self-amplifying ribonucleic acid (RNA) COVID‑19 vaccine every year.</li>\n\t\t<li>PNI will create and maintain up to 125 highly-skilled jobs and invest $120 million on research and development in Canada, thanks in part to today’s investment by the Government of Canada.</li>\n\t\t<li>On October 23, 2020, the government invested $18.2 million in PNI to support the development of its promising COVID-19 self-amplifying RNA vaccine candidate through clinical trials.</li>\n\t</ul>\n\t</li>\n\t<li><a href=\"https://www.edesabiotech.com/\">Edesa Biotech Inc.</a> is a biopharmaceutical company founded by experts in the fields of inflammation and infectious diseases. It has a strong record in biologics, and has demonstrated success in its ongoing clinical development programs. Its project proposal was reviewed by the COVID-19 Therapeutics Task Force.\n\t<ul>\n\t\t<li>Today’s investment will help Edesa advance its monoclonal antibody therapy (EB05). In addition to its potential to treat acute respiratory distress syndrome and mitigate inflammation complications in COVID-19, Edesa’s therapy has the potential to also treat other pathogens known to cause pandemics, such as influenza.</li>\n\t</ul>\n\t</li>\n\t<li>There is also progress on the biomanufacturing facilities under construction in Quebec and Saskatchewan.\n\t<ul>\n\t\t<li>The University of Saskatchewan’s Vaccine and Infectious Disease Organization received federal contributions of $46 million in 2020 to help strengthen its COVID-19 research and vaccine development as well as complete the construction of its pilot scale manufacturing facility to good manufacturing practice (GMP) standards. The construction of the GMP facility is on track to be completed by the end of 2021. This facility will be able to produce up to 40 million doses annually depending on the production efficiency of specific vaccines.</li>\n\t\t<li>The National Research Council’s new Biologics Manufacturing Centre at its Royalmount site in Montréal received a $126 million investment in August 2020. Once built, the new centre will be capable of large-quantity, end-to-end production of vaccines – approximately 24 million made-in-Canada doses per year – depending on the vaccine candidate. Construction remains on schedule and is anticipated to be completed in July 2021. The ultimate timeline for production at the facility depends on reaching a full production agreement with an approved vaccine producer and Health Canada approval of the manufacturing process for the specific product.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2021/02/backgrounder--government-of-canada-investments-in-covid-19-vaccines-and-biomanufacturing-capacity.html\">Government of Canada investments in COVID-19 vaccines and biomanufacturing capacity</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/10/23/prime-minister-announces-funding-advance-development-canadian-covid\">Prime Minister announces funding to advance the development of Canadian COVID‑19 vaccine technologies</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n</ul></div>\n      "
}