{
  "path": "/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-holds-35th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 35th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc held the 35th call with Canada’s provincial and territorial premiers to discuss their ongoing collaboration to address the COVID-19 pandemic.</p>\n\n<p>The Prime Minister started by welcoming Nunavut Premier P.J. Akeeagok to the First Ministers’ table.</p>\n\n<p>First Ministers discussed the COVID-19 Omicron variant of concern, which is rapidly spreading around the world. They expressed concern over this variant and the epidemiological outlook, noting the potential for a rapid and strong resurgence of COVID-19 cases in Canada that could put a strain on our health care systems. The Prime Minister consulted premiers on additional border and travel measures that could help slow community spreading, and First Ministers discussed other potential measures to keep Canadians safe.</p>\n\n<p>First Ministers discussed the importance of remaining vigilant with strong public health guidelines, and premiers noted the measures they are implementing in their respective jurisdictions. The Prime Minister and premiers agreed that the key to moving beyond this pandemic is ensuring that as many Canadians as possible, including children, get vaccinated and have access to booster shots, particularly our most vulnerable. The Prime Minister noted that the federal government has secured enough vaccine doses for all eligible Canadians to receive first, second, and third doses.</p>\n\n<p>The Prime Minister reiterated that the federal government will continue to provide the tools provinces and territories need to contain the spread of COVID-19, including rapid tests, support for improved ventilation, and COVID-19 therapeutics. He highlighted investments announced in today’s federal Economic and Fiscal Update to further support provinces and territories in protecting the health and safety of Canadians. This includes $1.7&nbsp;billion to secure rapid testing supplies, in addition to the millions of rapid tests already provided to provinces and territories in the last year, and $2&nbsp;billion for the procurement of COVID-19 therapeutics. The Prime Minister emphasized that Canada is well positioned to ensure a reliable supply of therapeutics, with contracts in place with Merck and Pfizer, pending Health Canada approval of their anti-viral treatments.</p>\n\n<p>The Prime Minister recognized the impact the pandemic has had on Canadians, and that this new surge in cases would be particularly difficult for families and communities given the time of year. As we enter the holiday season, First Ministers reiterated their commitment to saving lives and protecting Canadians by limiting the spread of COVID-19 as much as possible. The Prime Minister reiterated that the federal government, as it has done since the start of the pandemic, will continue to have Canadians’ backs every step of the way as we all work together to finish the fight against COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Canada’s vaccine supply</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/statement-from-minister-duclos-on-first-cases-of-omicron-variant-of-concern-in-canada.html\">Statement from Minister Duclos on first cases of Omicron variant of concern in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/11/government-of-canada-introduces-additional-measures-to-address-covid-19-omicron-variant-of-concern.html\">Government of Canada introduces additional measures to address COVID-19 Omicron variant of concern</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-services-procurement/news/2021/12/government-of-canada-signs-agreements-for-covid-19-oral-antiviral-treatments.html\">Government of Canada signs agreements for COVID-19 oral antiviral treatments</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/efu-meb/2021/home-accueil-en.html\"><em>Economic and Fiscal Update&nbsp;2021</em></a></li>\n</ul></div>\n      "
}