{
  "path": "/en/news/readouts/2020/04/28/prime-minister-justin-trudeau-speaks-ontario-premier-doug-ford",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Ontario Premier Doug Ford to discuss the ongoing fight against COVID-19.&nbsp;The Prime Minister and Premier Ford discussed the actions being taken by the governments of Ontario and Canada to ensure the health and safety of Ontarians and all Canadians, and to support workers and businesses.&nbsp;</p>\n\n<p>The Prime Minister and Premier Ford agreed that continued collaboration between all governments will be key to defeating COVID-19 and progressively reopening the Canadian economy. They also discussed ongoing efforts to mobilize industry to fight COVID-19, and reaffirmed their commitment to continue to work with Canadian businesses and manufacturers to find solutions that will support medical professionals and protect the health and safety of all Canadians.</p>\n\n<p>The Prime Minister and Premier Ford also agreed to continue discussions on other priorities, including manufacturing and procurement of personal protective equipment, supports for individuals, families and businesses, and investments in infrastructure. &nbsp;&nbsp;&nbsp;</p>\n\n<p>The Prime Minister and Premier Ford agreed to continue working collaboratively to respond to COVID-19 and to coordinate economic recovery efforts.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories\">Prime Minister announces partnerships with provinces and territories to deliver the Canada Emergency Commercial Rent Assistance for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/17/prime-minister-announces-new-support-protect-canadian-jobs\">Prime Minister announces new support to protect Canadian jobs</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and\">Prime Minister announces production of more medical supplies and equipment in Canada</a></li>\n</ul></div>\n      "
}