{
  "path": "/en/news/news-releases/2018/06/21/prime-minister-and-pacific-north-and-central-coast-first-nations",
  "pageTitle": "Prime Minister and Pacific North and Central Coast First Nations welcome agreement for ocean protection | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada has some of the most spectacular oceans and coastlines in the world, and is home to rich biodiversity and ecosystems. Indigenous coastal communities have stewarded the Pacific North and Central Coast waters for generations. They bring valuable experience and expertise to protect and manage this unique ocean region.</p><p>The Prime Minister, Justin Trudeau, with First Nations leaders, welcomed today a new agreement between the Government of Canada and 14 Central and North Coast First Nations to work together to protect the Pacific North Coast.</p><p>The Reconciliation Framework Agreement for Bioregional Oceans Management and Protection represents an important commitment by the Government of Canada and First Nations to collaborate and partner on marine initiatives that will help advance reconciliation and protect a large geographic area spanning about two-thirds of British Columbia’s coast.</p><p>The Government of Canada and First Nations have agreed to coordinate ongoing efforts in the management and conservation of oceans, including marine spatial planning and developing a network of marine protected areas. They have also reiterated their commitment to work together to improve waterway management, increase emergency preparedness, and boost the response capacity of local First Nations. Many of these initiatives are already underway as part of Canada’s $1.5 billion Oceans Protection Plan, the largest investment ever made to protect Canada’s coasts and waterways.</p><h2>Quotes</h2><blockquote><p>“The First Nations of the Pacific North and Central Coast have been protecting Canada’s waters for millennia. The Reconciliation Framework Agreement will help us deliver on the promise of ocean collaborative management. Working together, we will protect and preserve the Pacific North Coast, and we will advance reconciliation along the way.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“This agreement is an encouraging and positive step forward in our journey toward nation-to-nation collaboration and reconciliation. Now we have the opportunity to work with Canada to ensure efficient and sustainable marine management and protection initiatives, which promise to preserve healthy and resilient marine ecosystems for all future generations, while supporting coastal communities and economic opportunities today.”<br>—<cite>Chief Marilyn Slett, Heiltsuk First Nation and President of the Coastal First Nations-Great Bear Initiative</cite></p></blockquote><blockquote><p>“The Reconciliation Framework Agreement for Bioregional Oceans Management and Protection represents a transformative new relationship between Canada and Indigenous peoples. We are thrilled to have achieved consensus on a new governance model for managing and protecting our oceans. This is a significant achievement and demonstrates the innovative work being done in partnership with Indigenous peoples to protect Canada’s coasts.”<br>—<cite>The Hon. Marc Garneau, Minister of Transport</cite></p></blockquote><blockquote><p>“Keeping our oceans safe and clean, and healthy for future generations is a commitment shared by the Government of Canada and First Nations partners. The governance model established to improve the collaborative management of our oceans is an important step toward delivering on the Pacific North Coast Integrated Management Area Plan. Working together, we will continue to build on our successes in the areas of marine spatial planning, conservation, and marine safety.”<br>—<cite>The Hon. Dominic LeBlanc, Minister of Fisheries, Oceans and the Canadian Coast Guard</cite></p></blockquote><blockquote><p>“We are working to fundamentally transform our relationship with Indigenous peoples, based on recognition, respect, cooperation, and partnership. Indigenous voices must be included in the conversations on what Canada’s future will look like, including the management and protection of our oceans. This agreement demonstrates a strong example of working together to advance reconciliation. Making this shift is fundamental to the growth and prosperity of Canada.”<br>—<cite>The Hon. Carolyn Bennett, Minister of Crown-Indigenous Relations and Northern Affairs</cite></p></blockquote><blockquote><p>“Indigenous traditional knowledge plays a vital role in ensuring the long-term protection and preservation of healthy oceans and our environment as a whole. This agreement represents an important step as we work towards a renewed nation-to-nation relationship with Indigenous peoples and a new model for effective collaboration based on the recognition of rights, respect and cooperation.”<br>—<cite>The Hon. Catherine McKenna, Minister of Environment and Climate Change Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Agreement will help protect Canada’s Northern Shelf bioregion, which includes four sub regions: Haida Gwaii, the North Coast, the Central Coast, and North Vancouver Island.</li><li>Marine Spatial Planning is an internationally recognized approach to ocean planning and management that brings together partners from federal, provincial, territorial, and Indigenous governments and organizations to make informed decisions and manage oceans in a more open and practical way.</li><li>A marine protected area network plan for the Northern Shelf bioregion is being developed, jointly with partners, to help protect the marine biodiversity of this unique ecosystem.</li><li>This Agreement builds on the partnerships already established through the Pacific North Coast Integrated Management Area Plan endorsed by Canada, First Nations and the Province of British Columbia in February 2017.</li><li>Work under the Agreement has already begun on the Proactive Vessel Management initiative with a pilot project to address issues related to vessel traffic in local waterways. This national initiative will help identify measures, such as speed and routing controls, to improve safety and reduce environmental impacts.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2018/06/21/reconciliation-framework-agreement-bioregional-oceans-management-and\">Backgrounder: Reconciliation Framework Agreement</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://dfo-mpo.gc.ca/oceans/publications/backgrounder-fiche/marinespatialplanning-planificationespacemarin/index-eng.html\">Marine spatial planning</a></li><li><a href=\"http://dfo-mpo.gc.ca/oceans/publications/backgrounder-fiche/pacificnorthernshelf-plateaunord/index-eng.html\">Marine Protected Area Networks: Pacific Northern Shelf</a></li><li><a href=\"http://www.tc.gc.ca/en/services/marine/navigation-marine-conditions/proactive-vessel-management.html\">Proactive Vessel Management</a></li><li><a href=\"http://www.tc.gc.ca/en/campaigns/protecting-coasts.html\">Protecting our coasts: Oceans Protection Plan</a></li><li><a href=\"http://www.dfo-mpo.gc.ca/oceans/management-gestion/pncima-zgicnp-eng.html\">Pacific North Coast Integrated Management Area</a></li><li><a href=\"https://letstalktransportation.ca/OPP\">Let’s Talk – Oceans Protection Plan</a></li></ul></div>\n      "
}