{
  "path": "/en/news/statements/2017/04/22/statement-prime-minister-canada-earth-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement for Earth Day:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, we join the global community to celebrate <a href=\"https://earthday.ca/\">Earth Day</a> – a time to connect with nature and reaffirm our commitment to build a cleaner, more sustainable world for our children. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“As Canadians, we have a responsibility to safeguard our planet and natural treasures. I am proud of the steps our Government has taken to protect the environment and promote clean growth. These steps include historic <a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">domestic</a> and <a href=\"http://unfccc.int/2860.php\">international</a> agreements that will help us respond to pressing environmental challenges, grow the economy, and build a cleaner, healthier tomorrow.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On Earth Day, we recognize Indigenous cultures that have long understood the intricate links that exist between land, water, air, and all living things. Ensuring that decisions today serve generations tomorrow requires an active effort from all of us.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span>Canada looks forward to hosting <a href=\"http://www.un.org/en/events/environmentday/background.shtml\">World Environment Day</a> <span lang=\"EN-US\" xml:lang=\"EN-US\">on June 5 this year</span><span lang=\"EN\" xml:lang=\"EN\">. Like Earth Day, it will be an occasion to celebrate our connections to our environment and to each other.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, Sophie and I encourage all Canadians to take a moment today to go outside, find renewal in nature, and appreciate the environment that connects us all.”</span></p></div>\n      "
}