{
  "path": "/en/news/news-releases/2017/11/24/prime-minister-delivers-apology-former-students-newfoundland-and",
  "pageTitle": "Prime Minister delivers apology to former students of Newfoundland and Labrador residential schools | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We need to acknowledge our past – including its most dark and shameful chapters – to address the historical wrongs and ongoing intergenerational trauma that affect so many Indigenous Peoples.</p><p>The Prime Minister, Justin Trudeau, today apologized on behalf of the Government of Canada&nbsp;and all Canadians to former students of Newfoundland and Labrador residential schools. He also apologized to the families, loved ones, and communities for the painful and tragic legacy the residential schools left behind.</p><p>While delivering the apology, Prime Minister Trudeau acknowledged the many Innu, Inuit, and NunatuKavut children who were neglected and abused, and who suffered <span lang=\"EN\" xml:lang=\"EN\">lasting damage to their culture and language </span>because of the residential school system. He also highlighted the exceptional courage and strength of survivors who came forward to share their experiences.</p><p>This apology is a crucial, necessary step on our journey to reconciliation. The Government of Canada will continue to work to truly renew the relationship between Indigenous and non-Indigenous people, to the benefit of all.</p><h2>Quote</h2><blockquote><p>“For every Innu, Inuit, and NunatuKavut child in Newfoundland and Labrador who suffered discrimination, mistreatment, abuse, and neglect in residential schools – we are sorry. While this long overdue apology will not undo the harm done, we offer it as a sign that we as a government and as a country accept responsibility for our failings. It is our shared hope that we can learn from this past and continue to advance our journey of reconciliation and healing. We have the power to be better and to do better.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>At the turn of the twentieth century, the Moravian Mission and the International Grenfell Association established schools with dormitory residences for Indigenous children, with the support of the province of Newfoundland and Labrador. The last school closed in 1980.</li><li>On June 11, 2008, on behalf of the Government of Canada and all Canadians, then-Prime Minister Stephen Harper stood in the House of Commons to deliver an apology to students of Indian residential schools, their families, and communities. This apology did not include students from provincially run residential schools in Newfoundland and Labrador.</li><li>On September 28, 2016, the Supreme Court of Newfoundland and Labrador approved a negotiated settlement to provide compensation to those who attended residential schools in Newfoundland and Labrador and those who may have suffered abuse. The settlement also includes provisions for healing and commemoration activities identified by former students.</li><li>This apology also addresses Call to Action #29 outlined in the Final Report of the Truth and Reconciliation Commission, which calls upon the federal government 'to work collaboratively with plaintiffs not included in the Indian Residential Schools Settlement Agreement'.</li></ul><h2>Related products</h2><ul><li><a href=\"/en/news/backgrounders/2017/11/24/statement-apology-behalf-government-canada-former-students\">Statement of apology on behalf of the Government of Canada to former students of the Newfoundland and Labrador residential schools</a> (also available in&nbsp;<a href=\"/en/news/backgrounders/2017/11/24/kaujititsiutik-kakialiutigijaujumut-pijumik-kiggannikut-canadaup\">Inuttitut</a> and <a href=\"/en/news/backgrounders/2017/11/24/tshishe-utshimau-aimieu-nenu-ka-utinakananit-katshishkutamuakanishat\">Innu-Aimun</a>)</li><li><a href=\"/en/news/speeches/2017/11/24/remarks-prime-minister-justin-trudeau-apologize-behalf-government-canada\">Remarks by Prime Minister Justin Trudeau to apologize on behalf of the Government of Canada to former students of the Newfoundland and Labrador residential schools</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/indigenous-northern-affairs/news/2016/05/statement-regarding-the-government-of-canada-and-survivors-of-newfoundland-and-labrador-residential-schools-class-action-settlement.html\">Statement regarding the Government of Canada and survivors of Newfoundland and Labrador residential schools class action settlement</a></li><li><a href=\"/en/news/statements/2015/12/15/statement-prime-minister-release-final-report-truth-and-reconciliation\">Statement by Prime Minister on release of the Final Report of the Truth and Reconciliation Commission</a></li></ul></div>\n      "
}