{
  "path": "/en/news/readouts/2023/02/18/prime-minister-justin-trudeau-speaks-president-turkiye-recep-tayyip",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Türkiye Recep Tayyip Erdoğan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Türkiye, Recep Tayyip Erdoğan.</p>\n\n<p>Prime Minister Trudeau expressed his condolences to the people of Türkiye for the loss of lives. His thoughts are with those who are injured and displaced as a result of the February 6, 2023, earthquake.</p>\n\n<p>The Prime Minister offered Canada’s steadfast support in the recovery efforts and noted Canada’s commitment to provide airlift for the transport of NATO humanitarian supplies to Türkiye. Prime Minister Trudeau informed the President that the Canadian Armed Forces also stand ready to provide any additional support to Turkish authorities, if required.</p>\n\n<p>President Erdoğan thanked Prime Minister Trudeau for Canada’s assistance to date, including $20 million in humanitarian assistance and a significant contribution of supplies to support the International Federation of Red Cross and Red Crescent Societies (IFRC) operations in Türkiye, which is being used to respond rapidly to urgent needs. Prime Minister Trudeau indicated more financial assistance from Canada and Canadians would follow the previously announced funds. President Erdoğan thanked the Prime Minister for the generosity of Canadian support.</p>\n\n<p>Prime Minister Trudeau and President Erdoğan reaffirmed their commitment to the cooperation between Canada and Türkiye as long-standing NATO Allies and strong bilateral partners.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/turkiye/relations.aspx?lang=eng\">Canada-Türkiye relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/05/prime-minister-justin-trudeau-speaks-president-turkey-recep-tayyip-erdogan\">Prime Minister Justin Trudeau speaks with President of Turkey Recep Tayyip Erdoğan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2023/02/canada-provides-humanitarian-assistance-in-response-to-earthquakes-in-turkiye-and-syria.html\">Canada provides humanitarian assistance in response to earthquakes in Türkiye and Syria</a></li>\n</ul></div>\n      "
}