{
  "path": "/en/news/news-releases/2018/06/10/prime-minister-concludes-successful-g7-summit-focused-creating",
  "pageTitle": "Prime Minister concludes successful G7 Summit focused on creating economic growth that benefits everyone | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As the 2018 G7 President, Canada put forward a progressive agenda that reflects our values and ambitions. This week, G7 leaders met in the Charlevoix region of Quebec to find real, concrete solutions to pressing global challenges—the type of solutions that will make a real difference in the lives of people in our countries and around the world.</p>\n\n<p>At the Summit, G7 leaders talked about investing in economic growth that works for everyone and preparing people for the jobs of the future. They reaffirmed their commitment to advance gender equality, defend their democracies against foreign threats, and build a more peaceful and secure world. They also discussed climate change, oceans, and clean energy.</p>\n\n<p>Yesterday, Canada, along with the European Union, Germany, Japan, the United Kingdom, and the World Bank, announced an investment of nearly $3.8 billion CAD to support quality education for women and girls living in crisis, conflict-affected and fragile states. This funding represents the single largest investment of its kind in history. In the fight for greater equality, education is key—it gives women and girls the tools they need to make their own decisions about their future and live the life they want for themselves.</p>\n\n<p>Throughout the Summit, leaders discussed the future of the economy and their shared responsibility to create sustainable economic growth that works for everyone, particularly those at risk of being left behind. They endorsed the <em>Charlevoix Commitment on Equality and Economic Growth,</em> which reinforces a common commitment to fight poverty, achieve gender equality, reduce income inequality, and ensure better access to financial resources so that everyone has a chance to earn a decent living. They also committed to build a common vision for the future of artificial intelligence and to champion innovative financing that supports international development and reinforces gender equality and women’s empowerment.</p>\n\n<p>G7 leaders discussed how to tackle climate change, and the importance of investing in clean energy, and protecting our oceans and coastal communities. Recognizing that plastics pose a significant threat to our oceans, five countries have agreed to the <em>Oceans Plastics Charter</em>, which speaks to our common resolve to eradicate plastic pollution. This is a positive step for the environment and for businesses that will benefit from reducing the cost associated with plastic use.&nbsp;Building on this initiative, Canada will invest $100 million to rid our oceans of global marine litter and plastic pollution.</p>\n\n<p>G7 leaders agreed to the <em>Charlevoix Blueprint for Healthy Oceans, Seas and Resilient Coastal Communities</em>, which will promote sustainable oceans and fisheries, and support resilient coasts and coastal communities. Canada will invest $162 million to support these goals, and preserve the health and resilience of our oceans and coasts.</p>\n\n<p>To build a more peaceful and secure world, leaders committed to take strong action in response to foreign actors who seek to undermine our democratic societies and institutions, our electoral processes, and our sovereignty. G7 leaders agreed to establish a G7 rapid response mechanism, which will strengthen coordination among our countries to identify and respond to these diverse and evolving threats. Through this initiative, G7 countries will share information and analysis, and identify new opportunities where we can work together to defend our democracies.</p>\n\n<p>As leaders, we will ensure all workers have access to the skills and education they need to adapt and prosper in our rapidly changing global economy. In particular, we will expand training and education programs for women and girls in science, technology, engineering, and mathematics (STEM), to ensure that we <span class=\"bl1\">build a forward-looking economy for future generations.</span></p>\n\n<p>On the margins of the G7 Summit, the Prime Minister also met with several world leaders and the Secretary-General of the United Nations, António Guterres, to promote increased cooperation and collaboration on global issues of mutual concern. They discussed gender equality, climate change, peace and security, as well as economic growth—themes that were at the forefront of Canada’s G7 Presidency.</p>\n\n<p>Canada hopes that this year’s G7 marks the start of a new tradition where gender equality will continue to be a cross-cutting theme of G7 presidencies. In the coming months and years, we must continue to work together to spur innovation, put people first, and deliver growth that works for everyone. Together, the leaders have a real opportunity to improve the lives of their citizens and build stronger communities and economies. The discussions they had over the past two days will help address some of the world’s most pressing challenges, and Canada looks forward to continue working with its partners to deliver meaningful solutions for people around the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We are facing pressing social, economic and environmental challenges that transcend all borders. Only by working together will we find the innovative solutions we need to deliver meaningful results to people around the world. Canada is committed to working with other countries to fight inequalities, create economic growth that benefits everyone, and leave a better, healthier planet for future generations.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Prior to meeting with Prime Minister Trudeau, world leaders and heads of international organizations participated in a special G7 Summit outreach session focused on healthy oceans and resilient coastal communities.</li>\n\t<li>In addition to meeting with the G7 leaders, the Prime Minister held bilateral meetings with the following leaders:\n\t<ul>\n\t\t<li>Mauricio Macri, President of Argentina and Chair of the G20</li>\n\t\t<li>Sheikh Hasina, Prime Minister of Bangladesh</li>\n\t\t<li>Uhuru Kenyatta, President of Kenya</li>\n\t\t<li>Paul Kagame, President of Rwanda and Chair of the African Union</li>\n\t\t<li>Macky Sall, President of Senegal</li>\n\t\t<li>Cyril Ramaphosa, President of South Africa</li>\n\t\t<li>Nguyễn Xuân Phúc, Prime Minister of Vietnam</li>\n\t</ul>\n\t</li>\n\t<li>The Prime Minister also held a roundtable discussion with leaders of Small Island Developing States.</li>\n\t<li>On June 7, Prime Minister Trudeau released a report – <a href=\"https://g7.gc.ca/en/official-documents/achieving-growth-works-everyone/\"><span lang=\"EN\" xml:lang=\"EN\">Achieving Growth that Works for Everyone</span></a> – to highlight economic challenges faced by our citizens and identify ways we can work together to address them.</li>\n\t<li>The G7 is an informal grouping of seven of the world’s advanced economies consisting of Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States. The European Union was first invited to attend the G7 in 1977, but is not part of the hosting rotation.</li>\n\t<li>In 2019, France will hold the G7 Presidency.</li>\n\t<li>The previous Canadian-hosted Summits were held in Muskoka, Ontario (2010); Kananaskis, Alberta (2002); Halifax, Nova Scotia (1995); Toronto, Ontario (1988); and Ottawa-Montebello, Ontario and Quebec (1981).</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li>Backgrounder: <a href=\"/en/news/backgrounders/2018/06/10/investing-growth-works-everyone\">Investing in growth that works for everyone</a></li>\n\t<li>Backgrounder: <a href=\"/en/news/backgrounders/2018/06/10/preparing-jobs-future\">Preparing for jobs of the future</a></li>\n\t<li>Backgrounder: <a href=\"/en/news/backgrounders/2018/06/10/advancing-gender-equality-and-women’s-empowerment\">Advancing gender equality and women’s empowerment</a></li>\n\t<li>Backgrounder: <a href=\"/en/news/backgrounders/2018/06/10/working-together-climate-change-oceans-and-clean-energy\">Working together on climate change, oceans, and clean energy</a></li>\n\t<li>Backgrounder: <a href=\"/en/news/backgrounders/2018/06/10/building-more-peaceful-and-secure-world\">Building a more peaceful and secure world</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-summit-communique-sommet.aspx?lang=eng\"><span>The Charlevoix G7 Summit Communiqué</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-economic_growth-croissance_economique.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Commitment on Equality and Economic Growth</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-innovative_financing-financement_novateur.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Commitment on Innovative Financing for Development</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-artificial-intelligence-artificielle.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Common Vision for the Future of Artificial Intelligence</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-sexual-violence-sexe.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Commitment to End Sexual and Gender-Based Violence, Abuse and Harassment in Digital Contexts</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-quality-education-qualite.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Declaration on Quality Education for Girls, Adolescent Girls and Women in Developing Countries</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-healthy_oceans-sante_oceans.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Blueprint for Healthy Oceans, Seas and Resilient Coastal Communities</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/documents/2018-06-09-defending_democracy-defense_democratie.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Charlevoix Commitment on Defending Democracy from Foreign Threats</span></a></span></span></span></span></span></span></li>\n\t<li><span><span><span><span><span><span><a href=\"https://pm.gc.ca/en/news/news-releases/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and\"><span lang=\"EN\" xml:lang=\"EN\">Canada and partners announce historic investment in education for women and girls in crisis and conflict situations</span></a></span></span></span></span></span></span></li>\n</ul></div>\n      "
}