{
  "path": "/en/news/news-releases/2023/03/02/president-european-commission-ursula-von-der-leyen-visit-to-canada",
  "pageTitle": "President of the European Commission Ursula von der Leyen to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the President of the European Commission, Ursula von der Leyen, will visit Canada from March 6 to 8, 2023. Her visit will include stops in Ottawa, Ontario, and Kingston, Ontario.</p>\n\n<p>During the visit, Prime Minister Trudeau and President von der Leyen will build on the close, enduring transatlantic relations between Canada and the European Union (EU) and drive progress on shared priorities, including continuing to work together on advancing clean energy and clean technologies, creating good middle-class jobs, and driving economic growth that benefits everyone, most notably through the Canada-EU Comprehensive Economic and Trade Agreement (CETA) and the Canada-EU Strategic Partnership Agreement (SPA). The leaders will also continue to collaborate on ongoing solidarity and support for Ukraine as the Ukrainian people continue to courageously defend themselves from Russia’s illegal and unjustifiable full-scale invasion.</p>\n\n<p>On March 7, the Prime Minister and the President will travel to Kingston, where they will hold a bilateral meeting to further drive trade and investment, and cooperation under CETA, which are all key to building strong economies and creating good jobs, while delivering on their shared commitment to fight climate change. The leaders will also discuss Russia’s ongoing aggression against Ukraine and its global consequences as well as Canada and the EU’s efforts to uphold the rule of law; further promote peace and security, democracy, and human rights; and promote women’s empowerment and gender equality around the world.</p>\n\n<p>While in Kingston, the leaders will visit the Canadian Forces Base to meet with Canadian Armed Forces personnel who have deployed to Central and Eastern Europe as part of Operation REASSURANCE to support humanitarian efforts for Ukrainian refugees through Task Force Poland.</p>\n\n<p>Following their bilateral meeting, Prime Minister Trudeau and President von der Leyen will highlight their collaboration on critical minerals – the building blocks of the clean and digital economy – and Canada’s potential to be a reliable supplier in a net-zero economy. They will visit an innovative Canadian clean technology company.</p>\n\n<p>Following their visit to Kingston, the leaders will return to Ottawa, where President von der Leyen, as the first woman President of the EU Commission, will address Parliament in the House of Commons to highlight the unique ties between our countries and to mark International Women’s Day, the following day on March 8.</p>\n\n<p>Finally, Prime Minister Trudeau will host a reception for Canadian and European businesses and industry leaders to encourage them to take advantage of the investment conditions created by CETA and contribute to strengthening transatlantic supply chains.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the European Union enjoy a longstanding relationship rooted in shared values, strong ties between our peoples, and a history of friendship and close cooperation. I look forward to welcoming President von der Leyen to Canada to further strengthen our bilateral ties and advance our efforts to create good jobs for the middle class and build a clean economy that works for everyone – on both sides of the Atlantic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be President von der Leyen’s first official visit to Canada.</li>\n\t<li>Prime Minister Trudeau last met with President von der Leyen on September 21, 2022, on the margins of the 77th Session of the United Nations General Assembly in New York City.</li>\n\t<li>The Canada-EU relationship is the oldest formal relationship the EU has with any industrialized country, dating back to 1959.</li>\n\t<li>The EU is the world's largest trading bloc. In 2022, Canada and the EU celebrated the fifth anniversary of the provisional application of the Canada-EU Strategic Partnership Agreement (SPA) and the Canada-EU Comprehensive Economic and Trade Agreement (CETA), which is creating opportunities for businesses and good, middle-class jobs for workers on both sides of the Atlantic. In 2021, Canada-EU bilateral merchandise trade was $100&nbsp;billion (67.5&nbsp;billion euros), an increase of more than 33 per cent since CETA’s provisional application in 2017.</li>\n\t<li>The EU is Canada’s second-largest environmental goods export market (excluding waste and scrap goods), with Canadian environmental goods exports to the EU almost doubling between 2016 and 2021.</li>\n\t<li>The Canada-EU Strategic Partnership on Raw Materials, signed in 2021, focuses on enhancing security and sustainability of trade and investment, the integration of raw material supply chains, science, technology and innovation collaboration, and environmental, social, governance criteria and standards.</li>\n\t<li>Critical minerals like nickel and lithium are key components in everything from batteries that power electric vehicles to permanent magnets that are essential components of wind turbines and cell phones.</li>\n\t<li>Launched in December 2022, Canada’s Critical Minerals Strategy will increase the supply of responsibly sourced critical minerals and support the development of domestic and global value chains for the green and digital economy. The Strategy is backed by up to $3.8&nbsp;billion in federal support. The proposed funding covers a range of industrial activities of the critical minerals value chain, from geoscience and exploration to mineral processing, manufacturing, and recycling applications, including support for research, development, and technological deployment.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/spa-aps.aspx?lang=eng\">Strategic Partnership Agreement (SPA)</a></li>\n</ul>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/21/prime-minister-justin-trudeau-meets-president-european-commission-ursula\">Prime Minister Justin Trudeau meets with President of the European Commission Ursula von der Leyen</a></li>\n</ul>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadian-critical-minerals-strategy.html\">The Canadian Critical Minerals Strategy</a></li>\n</ul></div>\n      "
}