{
  "path": "/en/news/news-releases/2015/11/19/prime-minister-announces-support-reduce-poverty-vietnam",
  "pageTitle": "Prime Minister announces support to reduce poverty in Vietnam | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>Introduction</strong></p>\n<p>The Prime Minister, Justin Trudeau, today announced support for the Vietnam Cooperative Enterprise Development project that will help reduce poverty and contribute to equitable economic growth in Vietnam.</p>\n<p>The Government of Canada will partner with Société de coopération pour le développement international on this project, providing $12.9 million over five years (2015-2020) to help increase the competitiveness and productivity of Vietnamese agricultural cooperatives.</p>\n<p>Activities will include establishing new market-oriented agricultural cooperatives, strengthening the knowledge, skills and competitiveness of Vietnamese farmers, improving cooperative management practices, and developing a policy and regulatory environment that promotes cooperatives. Up to 10,000 farm households in five Vietnamese provinces are expected to benefit from this initiative.</p>\n<p><strong>Quotes</strong></p>\n<p>“Canada is very pleased to help the Vietnamese strengthen their agricultural sector, which will contribute to sustainable economic growth and poverty reduction in the country.”<br><em>–&nbsp;Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“Canada is a country with a great deal to offer. Our expertise in agricultural cooperatives will help ensure that Vietnam is able to apply production techniques that are environmentally-friendly and sustainable. This will unlock shared prosperity for families and individuals now and into the future.”<br> –&nbsp;<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>SOCODEVI is a Canadian not-for-profit international development corporation that has over 13 years of experience working in Vietnam. The corporation is recognized globally for its expertise in agri-food sector development, strengthening cooperatives, and supporting governments to improve the policy and regulatory framework for cooperatives.</li>\n<li>The capacity-building project will support dairy and fruit cooperatives from production to sales. It aims to improve the Vietnamese cooperative sector’s contribution to gender-equitable economic growth and to the livelihoods of women and men farmers.</li>\n<li>Canada and Vietnam have strong diplomatic relations that were established in 1973. In September 2014, Canada and Vietnam signed a bilateral letter of intent to deepen collaboration on human rights, people-to-people ties, education, development cooperation, trade and investment, and regional and global security.</li>\n<li>Canada and Vietnam are increasingly important bilateral partners, with Vietnam being a country of focus for our exports and for development cooperation.</li>\n<li>Over 220,000 people of Vietnamese origin call Canada home, and there are more Vietnamese students studying in Canada than from any other country in Southeast Asia.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.international.gc.ca/development-developpement/countries-pays/vietnam.aspx?lang=eng\">Canada in Vietnam</a></li>\n<li><a href=\"http://www.canadainternational.gc.ca/vietnam/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Vietnam Relations</a></li>\n<li><a href=\"http://international.gc.ca/global-markets-marches-mondiaux/markets-marches/vietnam.aspx?lang=eng\">Vietnam Fact Sheet</a></li>\n<li><a href=\"/en/news/backgrounders/2015/11/19/vietnamese-cooperative-enterprise-development-project\">Vietnamese Cooperative Enterprise Development project</a></li>\n</ul></div>\n      "
}