{
  "path": "/en/news/statements/2022/09/21/statement-prime-minister-international-day-peace",
  "pageTitle": "Statement by the Prime Minister on the International Day of Peace | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Peace:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/en/observances/international-day-peace\">International Day of Peace</a>, we reflect on the efforts we have made to make peace a reality around the world. In the face of rising violence, authoritarianism, and threats to democracy globally, more work needs to be done to build a stable world for everyone.</p>\n\n<p>“According to the United Nations (UN), our planet is witnessing the largest number of violent conflicts in over 75 years. As of May of this year, the UN estimates a record 100&nbsp;million people have been forcibly displaced around the world, fleeing conflict, violence, human rights violations, and persecution. This number will only increase as Russia’s illegal invasion of Ukraine continues – a conflict that is having far-reaching impacts on the world’s most vulnerable, including through food shortages, the rising cost of food and fuel, and conflict-related sexual violence.</p>\n\n<p>“Canada has long been a leader in international efforts to advance peace, and continues to be a strong voice for human rights. Along with liked-minded partners in the UN, we are working to promote the rule of law, build effective, accountable and inclusive institutions at all levels, and provide access to justice as part of our ongoing commitment to fulfill the UN’s <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">Sustainable Development Goals</a> (SDG). As Co-Chair of the UN SDG Advocates group, I will continue to work closely with our global partners to address the world’s biggest challenges and help create a more peaceful and prosperous future for people in Canada and around the world.</p>\n\n<p>“Canada provides strong support to the UN to advance peace globally – through investments in peacebuilding, including the UN Peacebuilding Fund, and continued support for UN peacekeeping. We have also taken a leading role to increase women’s full, equal, and meaningful participation in formal peace processes and to support peacebuilding in many fragile and conflict-affected states.</p>\n\n<p>“This year, the Ukrainian people continue to defend their country against Russia’s illegal and unjustifiable invasion – one of the greatest threats to peace and stability in a generation. Canada continues to be a steadfast supporter of Ukraine, and we will keep providing financial, military, humanitarian, and development aid as needed.</p>\n\n<p>“On this International Day of Peace, we recommit to building a better, more stable world for all.”</p></div>\n      "
}