{
  "path": "/en/news/readouts/2021/06/13/prime-minister-justin-trudeau-meets-prime-minister-japan-suga-yoshihide",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Japan Suga Yoshihide | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Japan, Suga Yoshihide, on the margins of the G7 Summit in Carbis Bay, United Kingdom. This was their first in-person meeting since Prime Minister Suga’s inauguration.</p>\n\n<p>The two leaders reaffirmed the strategic partnership between Canada and Japan, including a shared vision for a free and open Indo-Pacific. They welcomed recent steps to deepen our cooperation on peace and security in the region, including the extension of Operation NEON, Canada’s contribution to multinational efforts to support the implementation of United Nations Security Council sanctions against North Korea.</p>\n\n<p>The prime ministers discussed the importance of more ambitious international action to fight climate change, including the phasing out of coal, and ways of rebuilding a more sustainable and resilient global economy. The two leaders noted Canada and Japan’s respective commitments to reach carbon neutrality by 2050, and welcomed our growing bilateral cooperation on environmental and sustainability issues. They agreed on the importance of investing in innovation as a way to tackle climate challenges.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Suga discussed the strong trade ties and economic cooperation between the two countries, including through the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which they hailed as a high-standard trade agreement. Prime Minister Trudeau also expressed support for Japan’s chairing of the CPTPP Commission in 2021.</p>\n\n<p>The two leaders discussed ongoing collaboration between Canada and Japan to support the global response to COVID-19. Prime Minister Trudeau commended Prime Minister Suga for his leadership in hosting the COVAX Advance Market Commitment (AMC) Summit on June 2. Prime Minister Suga thanked Prime Minister Trudeau for his commitment to provide an additional $220 million to enable low- and middle-income countries to access vaccines, thus doubling Canada’s contribution to the AMC.</p>\n\n<p>The leaders also spoke about relations with China. Prime Minister Trudeau raised the arbitrary detention of Canadians Michael Kovrig and Michael Spavor, and expressed support for Prime Minister Suga’s efforts to secure the return of Japanese citizens abducted by North Korea. The prime ministers agreed to continue working together in the G7 and other international forums to uphold the rules-based international order.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Suga underscored the strong partnership between Japan and Canada, including shared values and vibrant people-to-people ties.</p>\n\n<p>Prime Minister Trudeau expressed support for Japan’s efforts to hold safe and secure Olympic and Paralympic Games this summer.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan Relations</a></li>\n\t<li><a href=\"https://www.g7uk.org/\">G7 UK 2021</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-neon.html\">Operation NEON</a></li>\n</ul></div>\n      "
}