{
  "path": "/en/news/readouts/2020/06/18/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their fourteenth weekly call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.&nbsp;First Ministers also discussed the need to take measures to&nbsp;fight&nbsp;racism and discrimination in order to build a&nbsp;stronger country.</p>\n\n<p>First Ministers continued their discussion on measures being taken to safely restart the economy, including a contribution of $14 billion the Government of Canada is putting toward a federal-provincial-territorial agreement to address critical needs across the country over the next six to eight months. This will help Canada minimize the impact of future waves of COVID-19, including by significantly ramping up testing and contact tracing, securing a sufficient supply of personal protective equipment, and ensuring health care systems have the capacity to manage future outbreaks. These investments will also provide support for vulnerable populations, help ensure the safety of child care centres for both children and educators, support essential municipal services, and provide paid sick leave.</p>\n\n<p>First Ministers discussed the unique challenges facing Canada’s northern communities. While territorial governments have successfully contained the spread of COVID-19, it was recognized that continued vigilance and supports are necessary to prevent the spread of the virus to remote and vulnerable communities.&nbsp;</p>\n\n<p>First Ministers discussed the steps they are taking to reopen their economies. The Prime Minister highlighted the upcoming&nbsp;launch of a new nation-wide mobile app to provide notifications of exposure to COVID-19, which will help Canadians and public health officials identify and isolate the spread of the virus more quickly. &nbsp;The Prime Minister also highlighted federal measures to ensure the safety and wellbeing of Canadians, including continued efforts to procure personal protective equipment, the extension of the closure of the Canada-U.S border, and the extension of the Canada Emergency Response Benefit for an additional eight weeks.</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, and the need to closely coordinate their efforts, moving forward.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/18/prime-minister-announces-new-mobile-app-help-notify-canadians-covid\">Prime Minister announces new mobile app to help notify Canadians of COVID-19 exposure</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/06/16/prime-minister-announces-extension-canada-emergency-response-benefit\">Prime Minister announces extension of the Canada Emergency Response Benefit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/29/prime-minister-announces-additional-funding-health-economic-and\">Prime Minister announces additional funding for health, economic, and social support for Indigenous peoples and communities</a></li>\n</ul></div>\n      "
}