{
  "path": "/en/news/statements/2022/04/15/statement-prime-minister-passover",
  "pageTitle": "Statement by the Prime Minister on Passover | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the occasion of Passover:</p>\n\n<p>“Tonight, Jewish communities in Canada and around the world will celebrate the beginning of Passover.</p>\n\n<p>“An eight-day festival, Passover commemorates the Exodus and liberation of the Israelites from slavery in ancient Egypt. It celebrates freedom, the power of faith and hope, and the strength and perseverance of the Jewish people, who have prevailed in the face of persecution.</p>\n\n<p>“Traditionally, families and loved ones gather around the Seder table to enjoy festive meals and wine, read from the Haggadah, and recite the four questions in celebration of freedom.</p>\n\n<p>“These past two years have been challenging for all of us. Now, as we recover from the pandemic, we have an important opportunity to reflect on Passover’s story of hope, strength, and determination – values that will continue to inspire all Canadians as we look to the future with optimism.</p>\n\n<p>“For all Canadians, Passover is also an opportunity to celebrate Canada’s Jewish community and the many contributions that Jewish Canadians have made – and continue to make – to our country.</p>\n\n<p>“Today, let us all reaffirm our commitment to stand against antisemitism, oppression, and hatred in all its forms and to work to build a better world for all. In Budget 2022, we took significant steps to advance this commitment, including by providing ongoing funding to support Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism and investments in the renewal of Canadian Holocaust museums. We also proposed amendments to the <em>Criminal Code </em>that would prohibit denying or downplaying the Holocaust in Canada.</p>\n\n<p>“On behalf of our family, I wish peace, health, and joy to all those celebrating Passover in Canada and around the world.</p>\n\n<p>“!חג פסח שמח</p>\n\n<p>“Chag Pesach Sameach.”</p></div>\n      "
}