{
  "path": "/en/news/news-releases/2018/01/25/prime-minister-concludes-his-participation-world-economic-forum-davos",
  "pageTitle": "Prime Minister concludes his participation at the World Economic Forum in Davos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today wrapped up his participation at this year’s World Economic Forum (WEF) annual meeting.</p><p>At the WEF, the Prime Minister met with several world leaders and global business leaders to promote Canada as a partner of choice for trade and investment. The Prime Minister also participated in a roundtable with key U.S. industry leaders to discuss how we can strengthen trade between Canada and the U.S., and modernize NAFTA to the benefit of the middle class in North America.</p><p>During his keynote address, the Prime Minister underscored the importance of women’s economic empowerment. He noted that much of the economic and labour force growth in the last decades is because of more women entering into – and changing – the workforce. He also highlighted how organizations with women in key leadership positions perform better than those without, and that everyone benefits when women can participate more freely and fully in the workplace.&nbsp;</p><p>The Prime Minister also took part in a panel discussion with Malala Yousafzai on girls’ education. He underscored the importance of education and how it breaks down barriers, empowers women and girls, and gives them more opportunities to prosper.</p><p>Before the panel discussion, the Prime Minister announced Canada’s pledge of $180 million to the Global Partnership for Education (GPE) for 2018-2020. This pledge represents a doubling of Canada’s annual contribution to the GPE, and will help strengthen education systems in developing countries while providing targeted support for girls’ education.</p><p>The Prime Minister also chaired a roundtable discussion on oceans, where he highlighted Canada’s ambitious Oceans Protection Plan, and emphasized the importance of taking coordinated global action to protect the health of our oceans.</p><h2>Quote</h2><blockquote><p>“It’s time to close the gender gap in our workplaces. The hiring, promotion, and retention of women is something we can make happen today – and it’s up to all of us, especially those in positions of leadership, to make sure women have the opportunities they need to influence change and realize their potential.”<br> — <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>During his keynote address, the Prime Minister also announced that Canada and the ten other remaining members of the Trans-Pacific Partnership concluded discussions on a new Comprehensive and Progressive Agreement for the Trans-Pacific Partnership (CPTPP).</li><li>The Prime Minister also highlighted the agenda and priorities that will guide Canada’s G7 presidency, and announced that the co-chairs for the G7 Gender Equality Advisory Council will be Melinda Gates and Isabelle Hudon.</li><li>The Global Partnership for Education Replenishment Conference will take place February 1 and 2, 2018, in Dakar, Senegal. Canada is among the top 10 donors to the GPE, an organization which Canada helped to launch in 2002.</li><li>The Prime Minister met with several world leaders, including: President of Argentina Mauricio Macri; Chancellor of Germany Angela Merkel; Prime Minister of India Narendra Modi; Prime Minister of Israel Benjamin Netanyahu; and Prime Minister of Italy Paolo Gentiloni.</li><li>Since mid-2016, Canada’s economy has grown on average by 3.6% over previous years.</li><li>Canada has implemented a‎ series of actions such as the Global Skills Strategy to develop and attract talent and the Canada Infrastructure Bank to invest in and support innovation and infrastructure.</li><li>The World Economic Forum brings together the world’s private, public, and civil society leaders in collaborative activities focused on shaping global, regional, and industry agendas.</li></ul><h2>Associated links</h2><ul><li><a href=\"https://www.weforum.org/events/world-economic-forum-annual-meeting-2018\">World Economic Forum annual meeting</a></li><li><a href=\"/en/news/news-releases/2018/01/25/prime-minister-announces-funding-global-partnership-education\">Prime Minister announces funding for the Global Partnership for Education</a></li><li><a href=\"/en/news/speeches/2018/01/23/prime-minister-keynote-speech-world-economic-forum-2018\">Prime Minister keynote speech at the World Economic Forum 2018</a></li></ul></div>\n      "
}