{
  "path": "/en/news/news-releases/2017/06/07/prime-minister-announces-support-peace-process-and-humanitarian",
  "pageTitle": "Prime Minister announces support for peace process and humanitarian assistance in Myanmar | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with Her Excellency Daw Aung San Suu Kyi, State Counsellor of the Republic of the Union of Myanmar, as part of her visit to Canada.</p><p>Prime Minister Trudeau expressed condolences for the tragic loss of life after a Myanmar military plane carrying servicemen and their families crashed near Dawei earlier today.</p><p>The two leaders discussed Myanmar’s transition to democracy and Canada’s support for ongoing reforms in Myanmar. The Prime Minister encouraged Myanmar to accelerate its efforts to uphold human rights, particularly with respect to women, youth, and protecting ethnic and religious minorities, including the Rohingya. They also discussed good governance, development cooperation, humanitarian issues, economic growth, and regional security.</p><p>Following the meeting, Prime Minister Trudeau announced $8.8 million in support for humanitarian assistance and the advancement of peace and stability in Myanmar. These contributions will help protect human rights, support peacebuilding, and promote women’s participation in the national peace process. They will also support a range of life-saving services, including emergency food assistance, shelter and health care, to vulnerable populations.</p><p>Canada supports Myanmar’s ongoing efforts to secure an inclusive and lasting peace after decades of civil war. Since 2010, the Government of Myanmar has taken steps towards democratization, economic liberalization and national reconciliation.</p><h2>Quote</h2><blockquote><p>“Canada’s ties with Myanmar grow every day, and we are <span lang=\"EN\" xml:lang=\"EN\">committed to support this country as its people progress towards true peace and stability. </span>We encourage an inclusive peace process that respects human rights and meets the needs of all people in Myanmar, especially those of traditionally vulnerable populations, including ethnic and religious minorities, women and children.”<br> <cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Canada and Myanmar established diplomatic relations when the Southeast Asian country became independent in 1948.</li><li>Since 2013, Canada has disbursed over $95 million to Myanmar in official development assistance.</li><li>Daw Aung San Suu Kyi spent more than 15 years in detention from 1989 to 2010. She was awarded a Nobel Peace Prize in 1991 in recognition for her non-violent struggle for democracy and human rights.</li><li>In November 2015, Daw Aung San Suu Kyi was democratically elected. She was subsequently nominated State Counsellor of theRepublic of the Union of Myanmar and is now leading the ongoing reforms and the peace process in her country.</li><li>She is one of just six people to receive honorary Canadian citizenship. The others are Raoul Wallenberg, Nelson Mandela, the 14<sup>th</sup>&nbsp;Dalai Lama, the Aga Khan, and Malala Yousafzai.<b><br></b></li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/06/07/funding-advance-peace-stabilization-and-humanitarian-assistance\">Funding to advance peace, stabilization and humanitarian assistance in Myanmar</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/burma-birmanie/bilateral_relations_bilaterales/index.aspx?lang=eng\"><b>Canada-Myanmar relations</b></a></li><li><a href=\"http://www.international.gc.ca/development-developpement/countries-pays/burma-birmanie.aspx?lang=eng\"><b>Canadian international assistance to Myanmar</b></a></li><li><a href=\"https://www.jointpeacefund.org/\"><b>Joint Peace Fund</b></a></li><li><a href=\"http://www.peacesupportfund.org/gpswindow.html\"><b>Peace Support Fund – Gender, Peace and Security Funding Window</b></a></li><li><a href=\"http://international.gc.ca/world-monde/world_issues-enjeux-mondiaux/psop.aspx?lang=eng&amp;_ga=2.243603461.1672710386.1496351892-2097045564.1496351892\"><b>The Peace and Stabilization Operations Program</b></a></li></ul></div>\n      "
}