{
  "path": "/en/news/readouts/2022/03/09/prime-minister-justin-trudeau-meets-chancellor-germany-olaf-scholz",
  "pageTitle": "Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Chancellor of Germany, Olaf Scholz, in Berlin, Germany. He was joined by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland, and the Minister of Foreign Affairs, Mélanie Joly.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz strongly condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine. They called for Russia’s immediate withdrawal of military forces, and the urgent need for civilians to be able to access humanitarian corridors and assistance.</p>\n\n<p>The two leaders insisted on the need to continue imposing severe costs on Russia and to continue to support Ukraine. The Prime Minister congratulated the Chancellor for Germany’s leadership in this effort and for its significant contribution to NATO’s enhanced deterrence posture. The leaders discussed the strong international consensus against this illegal Russian aggression, as demonstrated by the recent vote in the United Nations General Assembly, and they agreed to expand coordination among countries providing military, financial, and humanitarian support to Ukraine.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz discussed the close ties between Canada and Germany, and tasked their officials to further deepen bilateral cooperation in areas of common interest, including on climate leadership, clean energy, and natural resources. The leaders discussed the priorities of Germany’s G7 presidency and agreed to cooperate to further advance the adoption of carbon pricing policies globally, including through Canada’s Global Carbon Pricing Challenge and Germany’s Climate Club. The leaders also agreed to strengthen the resilience of democracies to disinformation and foreign interference, including through the G7 Rapid Response Mechanism.</p>\n\n<p>Prime Minister Trudeau and Chancellor Scholz agreed to stay in close contact and looked forward to the upcoming G7 Summit to be hosted by Germany in June 2022.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}