{
  "path": "/en/news/statements/2019/04/07/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week:</p>\n\n<p>“During <a href=\"https://volunteer.ca/index.php?MenuItemID=388\">National Volunteer Week</a>, we take time to recognize Canadians who give their time and skills to help build up their communities and make a difference in the lives of others.</p>\n\n<p>“This year’s theme, ‘The volunteer factor – lifting communities,’ highlights how volunteers change their communities for the better. We see the results of this every day, from tutors helping students succeed in school, to volunteer firefighters rushing to help neighbours in need.</p>\n\n<p>“By celebrating volunteers’ leadership, we can help empower more Canadians to create positive change. On April 8, 2019, nominations for <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards.html\">Canada’s Volunteer Awards</a> will open. I encourage all Canadians to nominate an exceptional individual or organization that has made a difference in their community.</p>\n\n<p>“The Government of Canada is supporting young Canadians who want to make change and build a new culture of service. Launched in January 2018, the <a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html\">Canada Service Corps</a> gives young people the chance to hone their leadership skills, develop their strengths, and gain essential experience. Through Budget 2019, the Government of Canada proposes to significantly expand this initiative with new placements and opportunities for young people. These measures are helping support the next generation of leaders, who will carry the values of community service and civic engagement throughout their lives. &nbsp;</p>\n\n<p>“Everyone, no matter their age, can play a role in shaping their community and building a better Canada. Even the smallest act of kindness – shoveling someone’s driveway or helping a neighbour carry their groceries – can make a big difference. On behalf of the Government of Canada, I thank all volunteers for their selfless service to their communities and to our country.”</p></div>\n      "
}