{
  "path": "/en/news/statements/2015/11/20/statement-prime-minister-canada-national-child-day",
  "pageTitle": "Statement by the Prime Minister of Canada on National Child Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on National Child Day:</p>\n<p>“I think that one of the most rewarding things about being Prime Minister of Canada is having the ability to make a real difference in the lives of children in our own country and around the world.&nbsp;</p>\n<p>“Each child deserves to be raised in a world free of discrimination, violence, and exploitation, and each one deserves to grow up with proper nutrition and health care, a good education, and safe communities.</p>\n<p>“As we look back exactly 26 years to when the United Nations Convention on the Rights of the Child was adopted and opened for signature, we can see that real progress has been made in moving the markers forward for young people around the globe. But there is still an enormous amount of work to be done, from reducing preventable diseases to feeding the undernourished, from freeing those being forced to do child labour to ending child, early, and forced marriage, and from rehabilitating former child soldiers to sheltering the millions displaced as a result of conflicts and hunger.</p>\n<p>“These children need our help. The Government of Canada will continue to sponsor programs around the world that help boys and girls grow up healthy and reach their full potential. That is also why Canada is taking in families of Syrian refugees.</p>\n<p>“Here at home, the Government of Canada will give families more money to help with the high cost of raising their kids. We will provide direct help to students from low- and middle-income families to help them pay for their education and ensure that debt loads are manageable. We will also do our part to help Canadian children live healthier lives, with less exposure to known health risks.</p>\n<p>“By encouraging our nation's most valuable asset – our youth – to be agents of positive change, we are helping them become the leaders of today and tomorrow.</p>\n<p>“As a father and a former school teacher, I know that one of our greatest responsibilities is to help our children become engaged, healthy, and successful. As Prime Minister, I remain committed to helping all of our children achieve their potential.”</p></div>\n      "
}