{
  "path": "/en/news/statements/2021/07/27/statement-prime-minister-korean-war-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Korean War Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Korean War Veterans Day:</p>\n\n<p>”On June 25, 1950, Communist North Korean forces invaded South Korea. This was the first open act of aggression since the creation of the United Nations (UN) and the end of the Second World War. Alongside fellow UN Member States, Canadian Forces came together to defend South Korea’s sovereignty.</p>\n\n<p>“Today, we mourn our 516 service members who never made it home, and honour the more than 26,000 Canadians who served during the Korean War, including those who were injured in the line of duty, and lived with the physical and mental scars of war. They bravely put their lives at risk to uphold the ideals of peace and freedom. Our troops fought against opposing forces in often horrible conditions – from sweltering heat, to frigid cold, to monsoon rains. Through this, they remained valiantly at their posts, until the steadfast determination of the UN coalition led to the Korea Armistice Agreement, ending open conflict 68 years ago today.</p>\n\n<p>“The conflict brought untold devastation to the Korean Peninsula; infrastructure was destroyed; millions died, and many found themselves displaced or homeless. To help lay the foundations for peace and provide support to South Korea, Canadian Forces served in the region as part of the UN Command in the years after the armistice, and continue to do so today. The sacrifices made by Canadians who served during the Korean War helped shape world history, built a lasting bond between our two countries, and helped make South Korea the prosperous country we know today.</p>\n\n<p>“Today, on Korean War Veterans Day, I encourage all Canadians to reflect on the contributions of those who served and put themselves in harm’s way to help protect the people of South Korea, and defend democracy around the world. For their sacrifices, we owe them an immense debt of gratitude.”</p></div>\n      "
}