{
  "path": "/en/news/readouts/2021/07/14/prime-minister-justin-trudeau-speaks-prime-minister-new-zealand-jacinda",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of New Zealand Jacinda Ardern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of New Zealand, Jacinda Ardern.</p>\n\n<p>The prime ministers discussed the health and economic impacts of the COVID-19 pandemic. They committed to continue working closely together to ensure timely and equitable supply and access to vaccines domestically and internationally.</p>\n\n<p>The leaders discussed the upcoming Asia-Pacific Economic Cooperation (APEC) Informal Leaders’ Retreat on COVID-19, which Prime Minister Ardern is hosting on July 16, 2021. They agreed to continue working closely together through APEC and other international fora to promote a green and sustainable economic recovery that benefits everyone. The prime ministers also exchanged views on the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, which will help businesses and workers succeed, grow the middle class, and create more jobs and opportunities for people in both countries.</p>\n\n<p>Recalling the Christchurch Call to Action to eliminate terrorist and violent extremist content online, the leaders discussed their shared priority of combatting hate and violent extremism. Prime Minister Trudeau noted that Canada will host the National Summit on Antisemitism on July 21, and the National Summit on Islamophobia on July 22, to continue working with communities to combat racism and discrimination and keep people safe across Canada.</p>\n\n<p>The prime ministers exchanged views on Indigenous issues and reconciliation, including the appointment of an Indigenous Governor General in both countries. Prime Minister Trudeau reaffirmed his commitment to addressing the terrible legacy of residential schools and continuing to chart the path forward on reconciliation with Indigenous peoples of Canada.</p>\n\n<p>The prime ministers welcomed the strong and ever-growing ties between Canada and New Zealand and looked forward to deepening collaboration on shared priorities, such as promoting gender equality, addressing climate change, and upholding the rules-based international order. They also agreed to keep working closely together to address common interests and challenges in the Asia-Pacific region.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_new_zealand-nouvelle_zelande.aspx?lang=eng\">Canada-New Zealand Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/07/prime-minister-announces-additional-support-equitable-access-new\">Prime Minister announces additional support for equitable access to new COVID-19 medical solutions</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/news/2021/07/statement-by-minister-chagger-on-the-national-summit-on-antisemitism-and-the-national-summit-on-islamophobia.html\">Statement by Minister Chagger on the National Summit on Antisemitism and the National Summit on Islamophobia</a></li>\n</ul></div>\n      "
}