{
  "path": "/en/news/statements/2017/10/11/statement-prime-minister-international-day-girl",
  "pageTitle": "Statement by the Prime Minister on International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the International Day of the Girl:</p><p>“Today, we celebrate girls everywhere. <a href=\"http://www.swc-cfc.gc.ca/commemoration/idg-jif/index-en.html\">International Day of the Girl</a> draws attention to the importance of girls’ rights, and shines a light on the power of girls around the world.</p><p>“There are over one billion girls in the world. Each one has the potential to shape our world for the better – and each one has a right to live, learn, and work without fear of discrimination or violence, to pursue her life goals, and to reach her full potential. Girls make our communities stronger – and all of us benefit when all people, no matter their gender identity, are able to dream without limits.</p><p>“This year’s United Nations theme – <a href=\"http://www.un.org/en/events/girlchild/\">EmPOWER Girls: Before, during and after crises</a> – marks the beginning of a year-long effort to address the challenges girls face before, during, and after crises. Girls experience different and disproportionate effects of crises, and we must work globally to respond to this reality.</p><p>“Our world has made important progress to advance girls’ rights – but we have much further to go to make sure the rights of girls everywhere are respected and protected. In Canada and around the world, far too many girls are subjected to sexual and gender-based violence, and struggle to get the quality education, health care, and economic opportunities they need. All of us have the power – and the responsibility – to work together to break down the barriers girls face, and to help girls make their voices heard.</p><p>“Everyone benefits when women and girls can participate freely and fully in our economies and societies, and advancing girls’ rights is a top priority for our Government. Canada’s <a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/iap-pai/index.aspx?lang=eng\">Feminist International Assistance Policy</a> makes empowering women and girls a focus in all our international aid.</p><p>“At home, we are supporting schools and early childhood education, health care, and jobs and skills training – and these investments help girls and young women get the support and opportunities they need. We are also encouraging young women’s leadership, including on the <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a>. Young women make up more than half of the council, where they have a strong voice in issues that matter to them and to our country.</p><p>“On behalf of the Government of Canada, Sophie and I ask Canadians to join us to celebrate the power of girls. Girls in Canada and around the world are building a better future for all of us – and all of us have a role to play to help them succeed and thrive.”</p></div>\n      "
}