{
  "path": "/en/news/news-releases/2019/07/02/canada-and-ukraine-further-strengthen-cooperation",
  "pageTitle": "Canada and Ukraine further strengthen cooperation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the President of Ukraine, Volodymyr&nbsp;Zelenskyy, during the third Ukraine Reform Conference. The conference is co-hosted by Canada and Ukraine and is taking place in Toronto this week.</p>\n\n<p>During the meeting, Prime Minister Trudeau reiterated Canada’s steadfast support for the people of Ukraine and its sovereignty and territorial integrity. The two leaders also discussed Ukraine’s efforts to advance democratic reforms on its path to Euro-Atlantic integration, as well as the security situation in the region. The Prime Minister stressed the need to stand together in the face of Russia’s attempts to undermine Ukraine’s sovereignty.</p>\n\n<p>The two leaders also explored ways to further deepen Canada-Ukraine trade relations. They highlighted the Canada-Ukraine Free Trade Agreement, and agreed to expand the agreement to create even more new opportunities and good, middle class jobs for Canadians and Ukrainians alike.</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy also welcomed two new agreements which will lead to even closer people-to-people ties between our two countries. The Audiovisual Coproduction Treaty will help promote Canadian content in Ukraine and provide significant opportunities to expand audiences for Canadian feature film, television, and digital productions. The Joint Declaration on a Youth Mobility Arrangement is a welcome step towards a revitalized agreement, which would strengthen our ties and support travel and work opportunities for young Canadians and Ukrainians.</p>\n\n<p>Later this afternoon, Prime Minister Trudeau will speak at the Ukraine Reform Conference, and will highlight the importance of inclusive and accountable governance, the rule of law, and respect for human rights as guiding principles in Ukraine’s democratic development. He will also stress that citizen-focused reforms are key to building a more resilient, prosperous Ukraine.&nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Ukraine share a deep friendship, built on common values and strong people-to-people ties. Today, we took the next step to deepen those ties and create good, middle class jobs for Canadians and Ukrainians alike. Canada will always stand with the people of Ukraine, and will continue to support its efforts on the path to greater democracy, security, and prosperity.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Ukraine Reform Conference takes place in Toronto from July 2 to 4, 2019, and brings together key international friends and partners to support Ukraine. It is an opportunity to boost progress in Ukraine’s ambitious reform path, designed to bring security and prosperity to the people of Ukraine.</li>\n\t<li>Canada and Ukraine have enjoyed a close bilateral relationship since Canada became the first Western nation to recognize Ukraine’s independence on December 2, 1991.&nbsp;</li>\n\t<li>Canada and Ukraine’s strong people-to-people ties are strengthened by the more than 1.3&nbsp;million-strong Canadians of Ukrainian descent.&nbsp;</li>\n\t<li>Since January 2014, Canada has committed more than $785 million in support to Ukraine, covering a broad range of financial, development, stabilization, and security, non-lethal military and humanitarian assistance.</li>\n\t<li>On March 31 and April 21, over 200 Canadians participated as election observers for each round of the Ukrainian presidential elections. Canada will also support the deployment of over 300 observers for the Parliamentary elections scheduled for July 21, 2019.</li>\n\t<li>Since 2015, the Canadian Armed Forces have trained more than 12,500&nbsp;members of the Ukrainian security forces as part of Operation UNIFIER, Canada’s military training mission in Ukraine.</li>\n\t<li>Canada and Ukraine work together in a range of international organizations, including the United Nations, the Organization for Security and Co-operation in Europe, and La Francophonie.</li>\n\t<li>The Canada-Ukraine Free Trade Agreement came into force on August&nbsp;1, 2017. The agreement is an important achievement in the countries’ bilateral relationship, and provides a framework for promoting new private sector partnerships and generating economic benefits for Canada and Ukraine.</li>\n\t<li>Canada's two-way merchandise trade with Ukraine totalled&nbsp;$346&nbsp;million&nbsp;in 2018.</li>\n</ul>\n\n<h2>Related product</h2>\n\n<ul>\n\t<li><a href=\"http://parallel.live.b.net/en/news/backgrounders/2019/07/02/canada-and-ukraine-strengthen-cooperation-ukraine-reform-conference\">Canada and Ukraine strengthen cooperation at the Ukraine Reform Conference</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2019/06/25/ukrainian-president-volodymyr-zelenskyy-visit-canada\">Ukrainian President Volodymyr Zelenskyy to visit Canada</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\" tabindex=\"110\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ukraine_reform-reformes/index.aspx?lang=eng\">Ukraine Reform Conference</a></li>\n</ul></div>\n      "
}