{
  "path": "/en/news/news-releases/2021/11/29/prime-minister-announces-reappointment-special-envoy-preserving",
  "pageTitle": "Prime Minister announces reappointment of Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the reappointment of the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism. This reappointment is for a term of up to one year.</p>\n\n<p>Mr. Cotler was first appointed as Special Envoy on November 23, 2020, after a long career dedicated to fighting racism, antisemitism, and hate, including as Minister of Justice and Attorney General of Canada, a Parliamentarian, a recognized scholar, and an international human rights lawyer.</p>\n\n<p>As Special Envoy, Mr. Cotler plays a critical role in advancing our work on combatting antisemitism at home and abroad and preserving Holocaust remembrance. This includes his leadership of the Government of Canada’s delegation to the International Holocaust Remembrance Alliance (IHRA). In the first year of his role, Mr. Cotler moved forward on a number of priorities, including co-convening the National Summit on Antisemitism and supporting the Canadian delegation to the Malmö International Forum and Canada’s Pledges on Holocaust Remembrance and Combatting Antisemitism. In this continued role, he will contribute his vast experience to the strengthening and promotion of Holocaust education, remembrance, and research, at home and abroad. He will also keep advocating and supporting outreach efforts with Canadians, civil society, Parliamentarians, and academia to advance the adoption and implementation of the IHRA’s working definition of antisemitism in Canada and internationally.</p>\n\n<p>The Government of Canada created the position of Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism last year, as part of its commitment to reinforce national and international efforts to preserve the memory of the Holocaust and the stories of survivors while combatting antisemitism, hatred, and racism. This work is part of the government’s commitment to promote and defend democracy, pluralism, inclusion, and human rights.</p>\n\n<p>Antisemitism is still a lived experience for Jewish communities in Canada and around the world, and its new and resurgent forms require constant vigilance and action. The Government of Canada remains unwavering in its commitment to challenge antisemitism, hatred, and racism wherever and whenever they occur. By learning from our past, we can build a more just and inclusive future for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Antisemitism has no place in Canada or anywhere else, and we will always stand with Jewish communities to fight hatred in all its forms. As Special Envoy, Mr.&nbsp;Cotler will continue to ensure that the painful lessons of the Holocaust and the memories of those who lived through it are never forgotten. Only through effective education, research, and remembrance can we foster a society free of prejudice and discrimination.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism works with the Minister of Foreign Affairs, the Minister of Canadian Heritage, the Minister of Housing and Diversity and Inclusion, and other implicated ministers to inform and advance Government of Canada policy and programming.</li>\n\t<li>The IHRA is an intergovernmental organization dedicated to strengthening, advancing, and promoting Holocaust education, research, and remembrance. It&nbsp;includes 35 member countries and eight partner organizations with Holocaust‑related issues as part of their mandate.</li>\n\t<li>Canada joined the IHRA in 2009, and adopted the IHRA’s working definition of antisemitism in 2019, as part of Canada’s Anti-Racism Strategy by the government, which will be renewed in 2022 and include a National Action Plan on Combatting Hate.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a data-entity-type=\"node\" data-entity-uuid=\"3961419e-7b08-4a83-b2fb-2f0496776c32\" href=\"/en/news/backgrounders/2021/11/29/honourable-irwin-cotler\">Irwin Cotler</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/canada-holocaust/canada-pledges.html\">Canada’s Pledges on Holocaust Remembrance and Combatting Antisemitism</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement.html\">Canada’s Anti-Racism Strategy</a></li>\n\t<li><a href=\"https://www.holocaustremembrance.com/\">International Holocaust Remembrance Alliance</a></li>\n</ul></div>\n      "
}