{
  "path": "/en/news/news-releases/2018/02/15/prime-minister-announces-appointment-two-senators",
  "pageTitle": "Prime Minister announces the appointment of two Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent Senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/02/15/martha-deacon\">Martha Deacon</a> (Ontario)</li><li><a href=\"/en/news/backgrounders/2018/02/15/robert-black\">Robert Black</a> (Ontario)</li></ul><p>Ms. Deacon is an outstanding leader who has dedicated her life to education and sport. In addition to a career in education that spanned over 30 years, she served Team Canada as an apprentice coach, team leader, and Chef de Mission for various major international competitions.</p><p>Mr. Black is a distinguished leader in Ontario’s agricultural community, who has spent most of his career championing agricultural and rural causes. He has actively served his community as a public servant and as a member and leader of various local, provincial, and national volunteer organizations.</p><p>Both of these remarkable individuals were chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“I am delighted to welcome these accomplished Ontarians to the Senate. I am confident that Parliament will benefit from Ms. Deacon and Mr. Black’s knowledge and experience, and that they will be great ambassadors for their region and communities.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>There have been 32 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Since 2016, the selection process for Senators has been opened to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides the Prime Minister with recommendations. From the recommended pool of candidates, the Prime Minister selects the individuals he then recommends to the Governor General for appointment to the Senate.</li><li>The Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan and merit-based criteria to identify highly qualified candidates.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial and minority interests –important functions in a modern democracy.</li></ul><h2><b>Biographical </b><b>Notes</b></h2><ul><li><a href=\"/en/news/backgrounders/2018/02/15/robert-black\">Robert Black</a></li><li><a href=\"/en/news/backgrounders/2018/02/15/martha-deacon\">Martha Deacon</a></li></ul><h2><b>Associated Links</b></h2><ul><li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/7/minister-of-democratic-institutions-announces-launch-of-the-permanent-phase-of-the-independent-senate-appointments-process.html\">Minister of Democratic Institutions announces launch of the permanent phase of the Independent Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/1/minister-of-democratic-institutions-announces-establishment-of-the-independent-advisory-board-for-senate-appointments.html\">Minister of Democratic Institutions announces establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2015/12/government-announces-immediate-senate-reform.html\">Government announces immediate Senate reform</a></li></ul></div>\n      "
}