{
  "path": "/en/news/statements/2022/08/01/statement-prime-minister-emancipation-day",
  "pageTitle": "Statement by the Prime Minister on Emancipation Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Emancipation Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/emancipation-day.html\">Emancipation Day</a>, we acknowledge the painful history of slavery here in Canada and celebrate the strength and determination of Black communities, who fought – and continue to fight – for freedom, justice, and equality.</p>\n\n<p>“Officially designated last year by a unanimous vote in the House of Commons, Emancipation Day falls on the day in 1834 that slavery was abolished in the British Empire. This historic day paved the way to freeing over 800,000 enslaved Africans and their descendants in Canada, parts of the Caribbean, Africa, and South America. Since then, August 1 has been commemorated in many parts of the world, including through celebrations of freedom across Canada.</p>\n\n<p>“Although slavery was abolished nearly 200 years ago, its effects continue to live on today. The legacy of systemic anti-Black racism is still embedded throughout our society, including in our institutions. That’s why today, on Emancipation Day, we pay tribute to the countless changemakers who have worked hard to ensure all members of Black communities in Canada can fully participate in society – it’s thanks to their perseverance and resolve that we have made real progress toward creating a better future for all.</p>\n\n<p>“Through <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti‑Racism Strategy</a>, the government continues to tackle all forms of racial discrimination in Canada, including anti-Black racism and systemic inequities, while working to design more effective legislation, policies, programs, and services that benefit all Canadians. We have also made important progress in developing a new, whole‑of‑government action plan to improve the well‑being of Black communities, including through our commitment to implement a Black Justice Strategy to address inequities in the criminal justice system and our continued efforts to eliminate anti-Black hate and systemic racism in all its forms. This work is in line with the themes of recognition, justice, and development from the United Nations’ International Decade for People of African Descent, which Canada recognized in 2018.</p>\n\n<p>“Today, we also celebrate the many achievements and contributions that Black individuals in Canada have made – and continue to make – to our society, and the important role they play in strengthening the country we all call home.</p>\n\n<p>“On Emancipation Day, I invite all Canadians to <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/emancipation-day.html\">learn more about Canada’s history of enslavement and segregation</a>, and its lasting impacts, which are still felt by members of Black communities today. We must acknowledge the truths of the past and recommit day after day to combatting anti-Black hate and systemic racism in order to build a better, more inclusive Canada for all.”</p></div>\n      "
}