{
  "path": "/en/news/news-releases/2016/06/28/prime-minister-welcomes-education-cooperation-mexico",
  "pageTitle": "Prime Minister welcomes education cooperation with Mexico | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to ensuring that young Canadians receive the education and training they need to prepare for the jobs of today and tomorrow.</p>\n<p>International education is at the heart of Canada’s current and future prosperity and will help to strengthen the middle class and those working to join it.</p>\n<p>Today, President Enrique Peña Nieto and Prime Minister Justin Trudeau announced their intention to make it easier for students to travel back and forth between Canada and Mexico on exchange.</p>\n<p>The two leaders welcomed new partnerships between Canadian and Mexican educational institutions that will increase the flow of students, ideas, and opportunities between the two countries.</p>\n<p>As part of this new partnership, the President and the Prime Minister announced their intent to foster international work-integrated learning opportunities for students from Canada and Mexico, which will allow more young Canadians and Mexicans to have access to meaningful work at the beginning of their careers.</p>\n<p><strong>Quote</strong></p>\n<p>“Education is a passport to greater opportunities, stronger relationships, and a better future. Today’s announcement will expand our people-to-people ties for generations to come, and give young Canadians and Mexicans the opportunities they need for the future they want.”<br><em>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>In 2015, 5,140 Mexican students (holding a six months or more study permit) were in Canada, making Mexico the 10th largest source of international students for Canada.</li>\n<li>There are currently over 400 inter-institutional agreements between Canadian and Mexican higher education institutions.</li>\n<li>Canada is a leader in higher education, ranking first among Organisation of Economic Cooperation and Development (OECD) countries with 50 percent of our adult population having a post-secondary diploma or degree.</li>\n<li>A consortium of Canadian postsecondary institutions including Lakehead University, Cape Breton University, First Nations University of Canada, Nicola Valley Institute of Technology, Nipissing University, Trent University, University of Lethbridge, University of Manitoba, University of Northern British Columbia, University of Regina, University of Winnipeg and Vancouver Island University have formalized their relationship with Mexican universities to better support Indigenous youth and women.</li>\n</ul>\n<p><strong>Related product</strong></p>\n<ul>\n<li>Backgrounder – <a href=\"/en/news/backgrounders/2016/06/28/canada-mexico-education-cooperation\">Canada-Mexico education cooperation</a></li>\n</ul></div>\n      "
}