{
  "path": "/en/news/statements/2021/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/development/desa/disabilities/international-day-of-persons-with-disabilities-3-december.html\">International Day of Persons with Disabilities</a>, we join people from across Canada and around the world to celebrate the contributions of persons with disabilities. From our family and friends, to our neighbours and colleagues, millions of Canadians have a disability. On this day, we commit to continue to work to identify, remove, and prevent barriers that still exist and increase the opportunities available to persons with disabilities, to build a Canada that is fairer, more inclusive, and accessible for everyone.</p>\n\n<p>“The Government of Canada remains committed to doing everything it can to support persons with disabilities. With the adoption of the <a href=\"https://www.canada.ca/en/employment-social-development/programs/accessible-canada/act-summary.html\"><em>Accessible Canada Act</em></a>, the government will continue to work toward the realization of an accessible Canada. We are also working with provinces and territories, as well as partners, disability communities, and persons with disabilities, to improve accessibility and promote inclusion for everyone in Canada.</p>\n\n<p>“The COVID-19 pandemic has highlighted some of the long-standing barriers Canadians with disabilities have faced for decades. From the onset of the pandemic, we have taken important steps to help remove barriers and promote inclusion. In the spirit of ‘Nothing Without Us’, we created the <a href=\"https://www.canada.ca/en/employment-social-development/corporate/disability-advisory-group.html\">COVID-19 Disability Advisory Group</a> to advise the government on how it could put a disability lens on its emergency response to ensure the real-time lived experience of Canadians with disabilities were considered. We made unprecedented investments in employment through the <a href=\"https://www.canada.ca/en/employment-social-development/programs/opportunity-fund-disability.html\">Opportunities Fund for Persons with Disabilities</a>, and investments to improve accessibility in communities and workplaces through the <a href=\"https://www.canada.ca/en/employment-social-development/programs/enabling-accessibility-fund.html\">Enabling Accessibility Fund</a>.</p>\n\n<p>“Moving forward, there is much more work to be done. This includes implementing an ambitious Disability Inclusion Action Plan, with concrete actions the government will take to improve the lives of Canadians with disabilities. The plan will be informed through consultation and engagement with the disability community, and will focus on key areas including financial security, employment, inclusive spaces, and taking a modern approach to disability in government programs and services. At the heart of this plan will be the design and delivery of the Canada Disability Benefit that will address the longstanding financial hardship felt by persons with disabilities and create a more disability-inclusive economy and society.</p>\n\n<p>“This year’s theme is ‘Leadership and participation of persons with disabilities toward an inclusive, accessible, and sustainable post-COVID-19 world.’ As we build back better from the pandemic, this theme urges us to work together, and ensure the perspectives of persons with disabilities are considered as we develop and implement strategies that protect and empower human rights, to achieve the United Nations’ (UN) <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">2030 Agenda and the Sustainable Development Goals</a>.</p>\n\n<p>\"On the international stage, Canada is working to protect and promote the rights of persons with disabilities to help build a more peaceful, inclusive, and prosperous world for all. Canada signed the UN <a href=\"https://www.ohchr.org/EN/HRBodies/CRPD/Pages/ConventionRightsPersonsWithDisabilities.aspx\">Convention on the Rights of Persons with Disabilities</a>, acceded to the Optional Protocol, and appointed the Canadian Human Rights Commission to monitor the government’s implementation of the Convention. We also announced a Canadian candidate for the 2022 election of the UN Committee on the Rights of Persons with Disabilities. We will continue to work closely with our partners, including as part of the <a href=\"https://www.internationaldisabilityalliance.org/content/global-action-disability-glad-network\">Global Action on Disability Network</a>, to address the unique challenges faced by persons with disabilities around the world, and to ensure their full inclusion and participation in society. Canada is proud to participate in the second Global Disability Summit, which will be co-hosted by the governments of Norway and Ghana and the International Disability Alliance in 2022, to ensure persons with disabilities can contribute to and benefit from our international development and humanitarian efforts.</p>\n\n<p>“Together, we can remove and prevent barriers to accessibility and make a difference with and for people with disabilities. On behalf of the Government of Canada, I invite all Canadians to learn more about how we can all work to create a more inclusive country and world.”</p></div>\n      "
}