{
  "path": "/en/news/news-releases/2020/05/29/prime-minister-announces-additional-funding-health-economic-and",
  "pageTitle": "Prime Minister announces additional funding for health, economic, and social support for Indigenous peoples and communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>COVID-19 has further highlighted many existing challenges already facing Indigenous peoples, particularly those who live in remote areas. The Government of Canada is working with First Nations, Inuit, and Métis communities to support their immediate public health response, with the flexibility to address their specific needs through community-led solutions, while also identifying opportunities to provide longer-term support.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new funding to provide critical support to Indigenous families and communities during this crisis, based on needs that have been identified. The funding includes:</p>\n\n<ul>\n\t<li>$285.1 million to support the ongoing public health response to COVID-19 in Indigenous communities. The investment will fund community-led responses to the pandemic, and provide targeted increases in primary health care resources for First Nations communities. In case of outbreaks, this funding can be drawn upon to provide surge capacity and additional support for community-based services in First Nations, Inuit, and Métis communities.&nbsp;</li>\n\t<li>$270 million to supplement the On-Reserve Income Assistance Program to address increased demand on the program, which will help individuals and families meet their essential living expenses. It will also help hire additional staff to better serve First Nations communities and connect individuals to other government programs.</li>\n\t<li>$44.8 million over five years to build 12 new shelters, which will help protect and support Indigenous women and girls experiencing and fleeing violence. This funding will help build 10 shelters in First Nations communities on reserve across the country, and two in the territories, to support Indigenous women and children. The government will also provide $40.8 million to support operational costs for these new shelters over the first five years, and $10.2&nbsp;million annually ongoing. We are also announcing $1 million a year ongoing, starting this year, to support engagement with Métis leaders and service providers on shelter provision and community-led violence prevention projects for Métis women, girls, and LGBTQ and two-spirit people.</li>\n</ul>\n\n<p>Today’s investment builds on the work already being done through the $305 million Indigenous Community Support Fund, and the additional $75 million provided for communities and organizations working with Indigenous peoples living in urban areas and off-reserve. The Government of Canada is taking a distinctions-based approach to address the needs of Indigenous peoples and communities. Where needed, the government has also provided additional support, including in northwestern Saskatchewan, where funding has supported a collective effort between First Nations, the Métis Nation of Saskatchewan, the Government of Saskatchewan, and other partners to coordinate the COVID-19 response in the region.</p>\n\n<p>We will continue to work with Indigenous partners as we move forward to support their efforts to respond to COVID-19 and its health, social, and economic impacts.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“COVID-19 has further highlighted the unique challenges that already exist for Indigenous peoples and communities. We are listening to Indigenous peoples, and are working with them to ensure they have the support they need to get through this crisis.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada has been clear since the beginning of this crisis that we will ensure Indigenous communities have the support they need. We continue to work closely with them to identify and meet their unique needs during these challenging times. Today’s announcement will help us to continue to support the health and safety of these communities, while ensuring that individuals and families who rely on income assistance for the basic essentials are not left behind during this pandemic.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“The challenges Indigenous women face are unique, complex, and multifaceted. This new funding will help us continue investing in more safe shelter spaces in Indigenous and Northern communities.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Funding for additional health care resources in First Nations communities will support:\n\t<ul>\n\t\t<li>increasing the number of health care providers to provide surge capacity</li>\n\t\t<li>delivering up to 160 temporary assessment, screening and isolation units, which includes retooling of existing facilities, ready-to-move trailers, and mobile structures</li>\n\t\t<li>medical supplies and equipment in health care facilities</li>\n\t</ul>\n\t</li>\n\t<li>First Nations administer the On-Reserve Income Assistance Program. Program staff members play an important role in helping individuals with other needs, including providing referrals to mental health and addictions counselling, and helping families find and apply for appropriate government benefits, such as Employment Insurance, the Canada Emergency Response Benefit, and the Canada Child Benefit.</li>\n\t<li>Ten new shelters in First Nations communities on reserve&nbsp;will be funded through Canada Mortgage and Housing Corporation’s Shelter Enhancement Program, and two new shelters in the territories will be funded through the National Housing Co-Investment Fund. Both programs will offer forgivable loans for up to 100 per cent&nbsp;of the total eligible capital costs of construction.</li>\n\t<li>The process to access the funding for the shelters will be through an Expression of Interest. First Nations on reserve across the country and Indigenous governments and/or organizations in the territories will be eligible to submit proposals.</li>\n\t<li>As of March 2020, the Family Violence Prevention Program provides operational funding for a network of 46 shelters for women and children living on reserve and in Yukon that provides places of refuge and services for women and children fleeing violence. The additional investments will bring the number of program-funded shelters to 58.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1581964230816/1581964277298\">Coronavirus (COVID-19) and Indigenous communities</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1100100035256/1533307528663\">On-Reserve Income Assistance Program</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs/co-investment-fund\">National Housing Co-Investment Fund</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/developing-and-renovating/funding-opportunities/on-reserve-renovation-programs/shelter-enhancement-program\">Shelter Enhancement Program</a></li>\n\t<li><a href=\"https://www.sac-isc.gc.ca/eng/1100100035253/1533304683142\">Family Violence Prevention Program</a></li>\n</ul></div>\n      "
}