{
  "path": "/en/news/statements/2018/06/05/statement-prime-minister-canada-world-environment-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World Environment Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Environment Day:</p><p>“Today, on <a href=\"http://worldenvironmentday.global/\">World Environment Day</a>, we join the international community to celebrate the natural world around us and reflect on our shared responsibility to safeguard the environment for generations to come.</p><p>“The theme for this year’s World Environment Day – Beat Plastic Pollution – calls on all of us to make changes in our lives that help eliminate plastic waste and pollution, and protect our planet.</p><p>“Plastic pollution is a global challenge that does not respect borders – it litters our streets, accumulates in our landfills, and contaminates our rivers and oceans. To help reduce waste and fight climate change, the Government of Canada has taken significant steps and is planning important new measures to protect the environment and promote clean growth, here at home and abroad.</p><p>“Today, we announced the appointment of Patricia Fuller as Canada’s new Ambassador for Climate Change to help advance Canada’s clean growth and climate change priorities on the world stage. Later this week at the G7 Summit, we will bring world leaders together to discuss how we can reduce plastic pollution, tackle climate change, and improve the health of the world’s oceans.</p><p>“The Government of Canada will continue to drive progress on the environmental challenges we face as a global community, and protect the clean air and water we share.</p><p>“On behalf of the Government of Canada, I encourage everyone to take action and #BeatPlasticPollution. I also invite Canadians to <a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/consultations/moving-toward-zero-plastic-waste.html\">share their ideas on how we can move Canada toward zero plastic waste</a>. From changing how we create plastics to making sure they are reused and recycled, together, we can make a real difference for our planet’s future.”</p></div>\n      "
}