{
  "path": "/en/news/statements/2022/07/01/statement-prime-minister-canada-day",
  "pageTitle": "Statement by the Prime Minister on Canada Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canada Day:</p>\n\n<p>“Today, we celebrate the country we love, and the people we share it with. Canada is home to over 38 million people: Canadians who live in cities and towns – big and small; people who are indigenous to this land; and those who’ve been here for weeks, months, years, or for generations.</p>\n\n<p>“Canada is strong because of our diversity. No matter what our faith is, where we were born, what colour our skin is, what language we speak, or who we love – we are all equal members of this great country.</p>\n\n<p>“Today, we celebrate the place we all call home. I know for some, our country’s historic wrongs can make that difficult. But while we can’t change history, we can put in the work to build a better future; one that reflects our values of hope, resilience, kindness, respect, and generosity.</p>\n\n<p>“Generation after generation, Canadians have shown that we can deliver on those values. We did it when we adopted our charter in 1982, we did it when we took care of each other during the pandemic, and we do it every day when we welcome refugees with open arms.</p>\n\n<p>“Today is an opportunity for us all to recommit ourselves to those values – values that the Maple Leaf represents. Because our flag is more than a symbol, it’s also a promise. A promise of opportunity. A promise of safety for those fleeing violence and war. And a promise of a better life.</p>\n\n<p>“As we come together today, let’s think about what this country means to us – and tomorrow, let’s challenge ourselves to find new ways to live up to the great promise of Canada. From my family to yours, happy Canada Day!”</p></div>\n      "
}