{
  "path": "/en/news/news-releases/2018/05/30/french-president-emmanuel-macron-visit-canada",
  "pageTitle": "French President Emmanuel Macron to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today announced that Emmanuel Macron, President of France, will travel to Canada from June 6 to 9, 2018, for a working visit and to attend the 2018 G7 Leaders’ Summit in Charlevoix, Quebec.</p><p>During the visit, President Macron will meet with Prime Minister Trudeau to discuss ways to work even more closely together on global issues, including strengthening multilateralism, advancing progressive trade, and defending and promoting our shared democratic heritage. They will also exchange views on how to leverage opportunities created by the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), which is already creating economic growth and good, middle class jobs for people on both sides of the Atlantic.</p><p>Additionally, the two leaders will discuss how our two countries can work together to further promote gender equality, fight climate change, advance peace and security, and create economic growth that benefits everyone – themes that will be at the forefront of the 2018 G7 Leaders’ Summit in Charlevoix, Quebec.</p><p>President Macron will also meet with Quebec Premier Philippe Couillard. On June 7, President Macron will travel to Charlevoix to participate in the G7 Leaders’ Summit.</p><h2>Quote</h2><blockquote><p>“Canada and France are historic partners and longtime friends, who share a common language, history, and set of values. As G7 partners, we share a responsibility to ensure that everyone benefits from our global economy, and that we leave a healthier, more peaceful, and more secure world for our children and grandchildren. I look forward to working with President Macron to build on our exceptional relationship, and create more opportunities for the middle class on both sides of the Atlantic.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>As a permanent member of the United Nations Security Council, NATO, the G7 and G20, a founding nation of the European Union (EU) and a leading partner in La Francophonie, France is a key ally for Canada on the international stage.</li><li>France is Canada’s ninth-largest merchandise trading partner globally and fourth-largest export market in the EU, with Canadian merchandise exports to France of $3.4 billion, and total bilateral merchandise trade of $9.6 billion, in 2017.</li><li>Canadian direct investments in France were valued at $8.0 billion at the end of 2017, and French direct investments in Canada were valued at $8.2 billion.</li><li>Canada assumed the presidency of the G7 on January 1, 2018, and will host the G7 Leaders' Summit in the Charlevoix region of Quebec from June 8-9, 2018.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\"><span lang=\"EN\" xml:lang=\"EN\">Canada-France Relations</span></a></li><li><a href=\"http://international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">Comprehensive Economic and Trade Agreement (CETA)</a></li><li><a href=\"/en/news/backgrounders/2018/04/16/canada-france-climate-and-environment-partnership\">France-Canada Partnership on climate and the environment</a></li></ul></div>\n      "
}