{
  "path": "/en/news/news-releases/2018/03/09/prime-minister-announces-new-commissioner-designate-royal-canadian",
  "pageTitle": "Prime Minister announces new Commissioner Designate of the Royal Canadian Mounted Police | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Brenda&nbsp;Lucki as the new Commissioner Designate of the Royal Canadian Mounted Police (RCMP). This appointment is effective April 16, 2018.</p><p>A proven leader, Ms. Lucki brings with her a diverse background and the expertise needed to keep our communities safe and secure while addressing the needs of the RCMP. She will play a vital role in advancing reconciliation with Indigenous Peoples, promoting gender equity, supporting mental wellness across the RCMP, addressing workplace harassment, and protecting the civil liberties of all Canadians.</p><p>Ms. Lucki has enjoyed a long and distinguished career at the RCMP. In her nearly 32 years with the national police force, she has served in Divisions in Quebec, Ontario, Manitoba, Alberta, and Saskatchewan, worked with the United Nations in the former Yugoslavia, and helped train and select police units for the UN Civilian Police Mission in Haiti.</p><p>Since October 2016, Ms. Lucki has served as the Commanding Officer of “Depot” Division, ensuring cadets receive the best possible training – including diversity training – before they begin to serve our communities.</p><p>The Prime Minister made this announcement during an event at the RCMP Academy, “Depot” Division. On behalf of all Canadians, the Prime Minister also thanked Daniel Dubeau for assuming leadership of the RCMP after the retirement of former Commissioner Bob&nbsp;Paulson. Both Mr. Dubeau and Mr. Paulson were recognized for their efforts to modernize and strengthen Canada’s national police force.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce the appointment of Brenda Lucki as the 24<sup>th</sup> Commissioner of the Royal Canadian Mounted Police. She is an exceptional leader who is known for being a hard worker, a dedicated officer, and someone who is constantly looking for ways to improve the status quo. We look forward to working with her to help keep all Canadians safe.”<br><cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Ms.&nbsp;Lucki was chosen through the Government’s open, transparent, and merit-based appointment process.</li><li>When Ms. Lucki takes her new post on April 16, 2018, she will be the 24<sup>th</sup> Commissioner in the RCMP’s history, and the first woman to serve as Commissioner in a permanent role.</li><li>Ms. Lucki has received numerous awards for her excellent service. Most notably, she is a member of the Order of Merit of the Police Forces in recognition of the work she did to improve the relationship between Indigenous communities and the RCMP in Northern Manitoba.</li><li>In February 2016, the Government of Canada announced a new, more rigorous approach to <a href=\"https://www.appointments-nominations.gc.ca/prsnt.asp?page=approt&amp;lang=eng\">Governor in Council appointments</a>. To this end, selection committees are established to assess and recommend candidates for appointment to various Governor in Council positions.</li><li>A Selection Committee for the position of Commissioner of the RCMP was established as an independent, non-partisan body whose mandate is to provide recommendations to the Minister of Public Safety and Emergency Preparedness on a list of highly qualified candidates for this position.&nbsp;&nbsp;</li></ul><h2>Biographical notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/03/09/brenda-lucki\">Brenda Lucki</a></li></ul><h2>Related product</h2><ul><li><a href=\"/en/news/backgrounders/2018/03/09/budget-2018-investing-keep-canadians-safe\">Budget 2018: Investing to keep Canadians safe</a></li></ul></div>\n      "
}