{
  "path": "/en/news/readouts/2022/02/20/prime-minister-justin-trudeau-convenes-eighth-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the eighth Incident Response Group meeting on the illegal blockades and occupations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the eighth meeting of the Incident Response Group where ministers and senior officials provided updates on the current situation and an assessment of the progress being made.</p>\n\n<p>The group was briefed on the ongoing efforts by police in Ottawa, where law enforcement agencies from across Canada have worked together to restore order in the Parliament Precinct and the city’s downtown core. The group discussed the methodical and complex law enforcement effort that was carried out involving the Royal Canadian Mounted Police, the Ontario Provincial Police, and the Ottawa Police Service.</p>\n\n<p>The group acknowledged the comments from the police today highlighting that this operation in Ottawa directly benefitted from the <em>Emergencies Act</em>, noting that provisions of the Act have allowed them to maintain the perimeter, restrict travel and ensure that they continue to restrict financial support and other assistance to protesters. Over the past few days, there have been close to 200 arrests, 389 criminal charges have been laid and a total of 76 vehicles were towed. The job is not done yet and work is expected to continue to bring an end to the illegal blockades and occupations.</p>\n\n<p>The group was briefed on the law enforcement actions being taken elsewhere in Canada to avoid further blockades and protect jobs and the economy. They reconfirmed the goal to see order restored as soon as possible to ensure the safety of Canadians, as well as to continue to assess the use of the <em>Emergencies Act</em> to ensure that, as intended, it is time limited, reasonable, and proportionate to the threats it is meant to address.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/19/prime-minister-justin-trudeau-convenes-seventh-incident-response-group\">Prime Minister Justin Trudeau convenes the seventh Incident Response Group meeting on the illegal blockades and occupations</a></li>\n\t<li><a href=\"https://blockade.rcmp.ca/index-en.html?fe\">Blockades news</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/02/15/canada-invokes-emergencies-act-limit-funding-illegal-blockades-and\">Canada invokes the <em>Emergencies Act</em> to limit funding of illegal blockades and restore public order</a>&nbsp;&nbsp;</li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/02/federal-government-declares-a-public-order-emergency-under-the-emergencies-act-to-end-disruptions-blockades-and-the-occupation-of-the-city-of-ottawa.html\">Federal government declares a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades, and the occupation of the city of Ottawa</a></li>\n</ul></div>\n      "
}