{
  "path": "/en/news/statements/2022/10/05/statement-prime-minister-world-teachers-day",
  "pageTitle": "Statement by the Prime Minister on World Teachers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Teachers’ Day:</p>\n\n<p>“Today, on <a href=\"https://www.unesco.org/en/days/teachers\">World Teachers’ Day</a>, we recognize and honour the crucial role teachers and educators play in building better communities.</p>\n\n<p>“During my time as a teacher, I saw firsthand the important work Canadian teachers do, often under challenging conditions. Today, I am launching the nomination period for the 2023 <a href=\"https://pmate-ppmee.ised-isde.canada.ca/site/pm-awards-teaching-excellence-stem/en/nominate-teacher\">Prime Minister’s Awards for Teaching Excellence and Teaching Excellence in STEM</a> and <a href=\"https://pmaece-ppmepe.ised-isde.canada.ca/site/pm-awards-excellence-ece/en/nominate-early-childhood-educator\">Prime Minister’s Awards for Excellence in Early Childhood Education</a>. These awards are given to exceptional elementary and secondary school teachers and early childhood educators. I encourage Canadians to recognize an outstanding teacher or educator who has made a real difference in their community by nominating them for these awards.</p>\n\n<p>“This year’s theme – The transformation of education begins with teachers – reminds us that teachers and educators deserve to work in a supportive environment, have access to professional development, and be empowered to be innovative and creative to ensure their students can succeed.</p>\n\n<p>“From critical thinking to coding and literacy, educators are helping the next generation develop the skills they need to adapt to our rapidly changing world, succeed in tomorrow’s economy, and find solutions to future challenges. Teachers go above and beyond their basic job descriptions. On any given day, they serve as mentors, advocates, and counsellors to their pupils. Educators act as guides who inspire students of all ages to give the best of themselves while learning and growing as individuals.</p>\n\n<p>“The Government of Canada continues to take meaningful action to ensure teachers and educators across the country have the tools they need and are able to work in a safe environment. We transferred an additional $100&nbsp;million to provinces and territories in July as part of the Safe Return to Class Fund, building on our previous investment of $2&nbsp;billion. Together, this funding is helping improve learning spaces, including air ventilation upgrades, and allowing for the purchase of personal protective equipment and cleaning supplies.</p>\n\n<p>“Beyond our borders, the Government of Canada works with global partners and ministries of education around the world to ensure every classroom has a qualified, motivated, and well-supported teacher who can unleash children’s learning potential, including in crisis contexts.</p>\n\n<p>“On behalf of the Government of Canada, I thank all teachers and educators for the incredible work they do and their adaptability every day on the job. Thanks to your dedication and commitment, you continue to change lives and communities for the better.”</p></div>\n      "
}