{
  "path": "/en/news/statements/2017/04/17/statement-prime-minister-canada-35th-anniversary-canadian-charter-rights",
  "pageTitle": "Statement by the Prime Minister of Canada on the 35th anniversary of the Canadian Charter of Rights and Freedoms | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the <a href=\"http://www.justice.gc.ca/eng/csj-sjc/charter-charte/index.html\">35<sup>th</sup> anniversary of the <i>Canadian</i> <i>Charter of Rights and Freedoms</i></a>: &nbsp;<br> </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“For the past 35 years, the Charter has helped build a country where people from all over the world can come together as equals and create opportunities for one another. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Charter protects the rights and freedoms that are essential to our identity as Canadians. It allows us to express ourselves as individuals and to celebrate our differences, while bringing us closer as a country. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year, we also mark the 35<sup>th</sup> anniversary of <a href=\"http://laws-lois.justice.gc.ca/eng/Const/page-16.html\">Section 35 of the <i>Constitution Act, 1982</i></a>, which recognizes and affirms Aboriginal and treaty rights. There is no relationship more important to our government than the one with Indigenous Peoples. We are committed to a renewed nation-to-nation, Inuit-to-Crown, and government-to-government relationship based on recognition of rights, respect, co-operation, and partnership. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The spirit and substance of the Charter are at the heart of Canada’s success, and should inspire us all as we work toward a fairer, more just and compassionate society.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Today, I remind Canadians that we have no task greater than to stand on guard for one another’s liberties. The words enshrined in the Charter are our rights, freedoms, and – above all – our collective responsibility.” &nbsp;</span></p></div>\n      "
}