{
  "path": "/en/news/statements/2020/06/08/joint-statement-role-sustainable-ocean-economy-post-covid-19-world",
  "pageTitle": "Joint Statement on the Role of a Sustainable Ocean Economy in a post-COVID-19 World | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the High Level Panel for a Sustainable Ocean Economy issued the following statement to mark World Oceans Day:</p>\n\n<p>“Today, we celebrate World Oceans Day under unprecedented circumstances, as the world battles the COVID-19 pandemic and its associated health and economic challenges. We, the members of the High Level Panel for a Sustainable Ocean Economy, propose the ocean as a solution to a more resilient and prosperous world. This will be more important than ever as we embark on post-COVID-19 recovery.</p>\n\n<p>“Blue nature is central to the planet and its people. The ocean covers over 70 per cent of the earth’s surface, absorbs about a quarter of all carbon emissions, and captures more than 90 per cent of the additional heat they generate. A fundamental building block of the global economy, it contributes over $2.5 trillion annually in value-added services, feeds over three billion people, provides a livelihood for over three billion people, and transports around 90 per cent of world trade. It is also a source of renewable energy and key ingredients for fighting disease. And it can do more if we sustainably manage it.</p>\n\n<p>“World leaders must value the ocean in recovery from the COVID-19 crisis. In a sustainable ocean economy, effective protection, sustainable production and equitable prosperity go hand-in-hand. Investing in a sustainable ocean economy is an excellent deal: it has considerable benefits for the global economy, the ocean and societal well-being.</p>\n\n<p>“The High Level Panel for a Sustainable Ocean Economy is committed to the transition to a sustainable ocean economy, which is essential for jobs, food security, healthy people and ecosystems, a low-carbon world, equity, and resilience. Our nations are currently working on a set of recommendations to enable this transition, which is also vital for a sustainable relationship between people and planet—the entire blue planet. We cannot let this opportunity escape us.”</p>\n\n<p><strong>Scott Morrison</strong>, Prime Minister of Australia</p>\n\n<p><strong>Justin Trudeau</strong>, Prime Minister of Canada</p>\n\n<p><strong>Sebastian Piñera</strong>, President of Chile</p>\n\n<p><strong>Frank Bainimarama</strong>, Prime Minister of the Republic of Fiji</p>\n\n<p><strong>Nana Akufo-Addo</strong>, President of the Republic of Ghana</p>\n\n<p><strong>Joko Widodo</strong>, President of the Republic of Indonesia</p>\n\n<p><strong>Shinzō Abe</strong>, Prime Minister of Japan</p>\n\n<p><strong>Andrew Holness</strong>, Prime Minister of Jamaica</p>\n\n<p><strong>Uhuru Kenyatta</strong>, President of the Republic of Kenya</p>\n\n<p><strong>Andrés Manuel López Obrador</strong>, President of Mexico</p>\n\n<p><strong>Hage G. Geingob</strong>, President of the Republic of Namibia</p>\n\n<p><strong>Erna Solberg</strong>, Prime Minister of Norway</p>\n\n<p><strong>Tommy Remengesau, Jr.</strong>, President of the Republic of Palau</p>\n\n<p><strong>António Costa,</strong> Prime Minister of Portugal</p>\n\n<p>We, the members of the High Level Panel for a Sustainable Ocean Economy, lead nations of highly diverse oceanic, economic and political perspectives. Driven by a commitment to partnership, shared knowledge and science-informed policy, we aim to advance the values underpinning a sustainable ocean economy—effective protection, sustainable production and equitable prosperity.</p></div>\n      "
}