{
  "path": "/en/news/news-releases/2018/01/22/prime-minister-announces-new-lieutenant-governor-saskatchewan",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Tom&nbsp;Molloy as the next Lieutenant Governor of Saskatchewan.</p><p>Mr. Molloy is a respected negotiator, lawyer, strategic advisor on Indigenous issues, and author from Saskatoon, Saskatchewan. He negotiated numerous agreements and treaty settlements with Indigenous Peoples that have changed the face of the country.</p><p>Mr. Molloy led the team that negotiated the Nisga’a Final Agreement, the first modern-day treaty in the history of British Columbia, and was the Chief Negotiator for the Government of Canada in negotiations with the Inuit of Nunavut in the Nunavut Land Claim Agreement, which led to the creation of the Territory of Nunavut in 1999. In addition, he served as Chancellor of the University of Saskatchewan from 2001 to 2007.</p><p>The Prime Minister took the opportunity to thank the outgoing Lieutenant Governor, the Honourable Vaughn&nbsp;Solomon Schofield, for her work and dedication in serving citizens across the province since taking office in 2012.</p><h2>Quote</h2><blockquote><p>“Mr. Molloy is an outstanding negotiator who has played a central role in numerous agreements and treaty settlements with Indigenous Peoples. His contributions are felt from coast to coast to coast, and have helped reshape this country. He is an excellent choice as Saskatchewan’s next Lieutenant Governor, and I know that he will represent the people of this province well.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, and visiting communities.</li><li>Lieutenant Governors are appointed by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li></ul><h2>Biographical notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/01/22/tom-molloy\">Tom Molloy</a></li></ul><h2>Associated link</h2><ul><li><a href=\"http://canada.pch.gc.ca/eng/1444999464310\">The Lieutenant Governors</a></li></ul></div>\n      "
}