{
  "path": "/en/news/news-releases/2017/05/27/canada-host-2018-g7-summit-charlevoix-quebec",
  "pageTitle": "Canada to host 2018 G7 Summit in Charlevoix, Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the 2018 G7 Summit will be held at Le Manoir Richelieu in La Malbaie, Quebec. Located in the Charlevoix region, this unique and idyllic area highlights our country’s vast and diverse natural beauty and evokes the historical significance of the St.&nbsp;Lawrence River.</p><p>Next year’s summit will allow Canada to showcase both its domestic and international priorities: to strengthen the middle class, advance gender equity, fight climate change, and promote respect for diversity and inclusion.</p><p>It will also be an important opportunity for Canada to engage G7 counterparts on pressing global challenges, and pursue further collaboration on innovative and clean economic growth.&nbsp;</p><p>A parallel announcement was also made today at Le Manoir Richelieu by Minister of Families, Children and Social Development Jean-Yves Duclos, and Minister of National Revenue Diane Lebouthillier.</p><h2>Quote</h2><blockquote><p>“Canada is proud to host the 2018 G7 Summit in Charlevoix. This vibrant region captures everything that our country is about – from bilingualism, to cultural diversity, to stunning scenery in every season. I look forward to welcoming my counterparts next year in beautiful Charlevoix. I’m sure they will fall in love with the region, just as Canadians have done for generations.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the sixth summit hosted by Canada, and the first in Quebec since 1981.</li><li>The previous Canadian summits were held in Muskoka, Ontario (2010), Kananaskis, Alberta (2002), Halifax, Nova Scotia (1995), Toronto, Ontario (1988) and Ottawa-Montebello, Ontario and Quebec (1981).</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li><li><a href=\"https://youtu.be/sgLr9_umxOY\">Video – G7 Charlevoix</a></li><li><a href=\"http://www.fairmont.com/richelieu-charlevoix/hotel-history/\">Fairmont Le Manoir Richelieu Hotel History</a></li></ul></div>\n      "
}