{
  "path": "/en/news/news-releases/2020/05/16/prime-minister-announces-annual-increase-canada-child-benefit",
  "pageTitle": "Prime Minister announces annual increase to the Canada Child Benefit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Since it was introduced four years ago, the Canada Child Benefit (CCB) has helped put more money in the pockets of 9 out of 10 Canadian families, and played a key role in reducing child poverty across the country. Now, more than ever, hard-working, middle-class families are counting on this benefit to help them keep up with the added expenses of raising children.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the CCB will be increased once again in July, to help families keep up with the costs of living and raising their children.</p>\n\n<p>This additional tax-free support will help families pay for things such as food, clothes, and activities they can do together at home. The increase will be in place for the 2020-21 benefit year, and will raise the maximum benefit to $6,765 per child under age 6, and $5,708 per child aged 6 through 17.</p>\n\n<p>This increase is in addition to the one-time special CCB payment announced by the Prime Minister earlier this month, to help families deal with the added pressures of COVID-19. On May 20, 2020, this special measure will give families currently receiving the CCB an additional $300 per child with their May payment, and deliver almost $2 billion in extra support across the country to help families during this challenging period.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Raising children is expensive. That’s why we created the Canada Child Benefit, to help parents pay for what their families need. Whether it’s used for groceries, new clothes, or at home activities, this extra support will make things easier on them as they deal with regular everyday expenses and the extra challenges caused by COVID-19.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We are putting more money in the pockets of Canadian families to help deal with the impacts of COVID-19 and the cost of raising their children. This increase to the CCB shows the Government’s commitment to ongoing support for families and the high value we put on investing in those who really need it most – our children.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In 2016, the Government of Canada introduced the CCB, a simpler, tax-free, and more generous child benefit better targeted to those who need it most.</li>\n\t<li>The CCB is a monthly payment made to eligible families to help with the cost of raising children under 18 years of age.</li>\n\t<li>Examples of payments for the 2020-21 benefit year:\n\t<ul>\n\t\t<li>A single-parent family with one child under the age of 6 and earning $25,000 will receive an additional $126, bringing their new yearly total benefit to $6,765.</li>\n\t\t<li>A two-parent family with two children aged 4 and 9 and earning $55,000 will receive an additional $174, bringing their new yearly total benefit to $9,329.</li>\n\t\t<li>A two-parent family with two children under the age of 6 and earning $90,000 will receive an additional $136, bringing their new yearly total benefit to $7,322.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/campaigns/covid-19-update/covid-19-ccb-payment-increase.html\">Canada child benefit (CCB) payment increase</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/03/families-receive-increased-support-through-canada-child-benefit\">Families to receive increased support through the Canada Child Benefit</a></li>\n</ul></div>\n      "
}