{
  "path": "/en/news/readouts/2021/11/09/prime-minister-justin-trudeau-speaks-mayors-quebec",
  "pageTitle": "Prime Minister Justin Trudeau speaks with mayors of Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Mayor of Montréal Valérie Plante, Mayor of Quebec City Bruno Marchand, Mayor of Laval Stéphane Boyer, Mayor of Gatineau France Bélisle, Mayor of Longueuil Catherine Fournier, Mayor of Sherbrooke Évelyne Beaudin, and Mayor of Trois-Rivières Jean Lamarche.</p>\n\n<p>The Prime Minister began each call by congratulating the mayor on his or her election or re‑election, following the municipal elections in Quebec on Sunday.</p>\n\n<p>The Prime Minister and the mayors look forward to working together to finish the fight against COVID‑19 and build a strong economic recovery that works for everyone across all regions of Quebec and Canada. They spoke about the importance of a collaborative approach to tackling climate change and protecting natural habitats and wildlife areas.</p>\n\n<p>The Prime Minister and the mayors also discussed other shared priorities, including affordable housing, public transit, and economic development. They agreed on the importance of ensuring Canadians and businesses continue to be protected from COVID-19 and receive the support they rely on as the economy reopens, including in the tourism and cultural sectors.</p>\n\n<p>The federal government supported Quebec municipalities throughout the pandemic, including through accelerated funding of over $990 million under the Canada Community-Building Fund, a joint investment of $2.3 billion with the Government of Quebec under the Safe Restart Agreement, and additional funding under the Rapid Housing Initiative to create new affordable housing units in municipalities across the province.</p>\n\n<p>The Prime Minister and the mayors look forward to continuing their collaboration for the benefit of the people of Quebec and Canada.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">Coronavirus disease (COVID-19): Canada’s response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/03/government-announces-additional-pandemic-support-for-vaccines-health-care-and-municipalities.html\">Government Announces Additional Pandemic Support For Vaccines, Health Care, and Municipalities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/03/support-for-municipalities.html\">Support for Municipalities</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/prog/gtf-fte-tab-eng.html\">Canada Community-Building Fund Allocation Table</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n</ul></div>\n      "
}