{
  "path": "/en/news/readouts/2022/11/20/prime-minister-justin-trudeau-meets-president-niger-mohamed-bazoum",
  "pageTitle": "Prime Minister Justin Trudeau meets with the President of Niger, Mohamed Bazoum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Niger, Mohamed Bazoum, on the margins of the 18th Summit of La&nbsp;Francophonie.</p>\n\n<p>The two leaders discussed the global situation and the growing food and energy security issues facing the world and the Sahel region. Prime Minister Trudeau stressed Canada’s commitment to working together with African countries to address the global challenges resulting from Russia’s illegal invasion of Ukraine, notably by providing assistance to address food insecurity at the global and regional levels.</p>\n\n<p>Prime Minister Trudeau congratulated President Bazoum on his leadership in the Sahel region, including his efforts to help resolve the political, security, and humanitarian crisis. The two&nbsp;leaders expressed their support for the return to constitutional order in countries of the region, particularly Mali and Burkina Faso, as well as for the mediation efforts of the Economic Community of West African States (ECOWAS) and the African Union. The Prime Minister reiterated the importance of ensuring political stability and inclusive governance throughout the region.</p>\n\n<p>The two leaders welcomed the growing bilateral cooperation between the two&nbsp;countries, including in the areas of counterterrorism, humanitarian assistance, and development assistance. They also underscored the importance of continuing reforms to ensure inclusive and sustainable growth that benefits everyone, and they agreed on the importance of education in that regard, especially girls’ education. Prime Minister Trudeau commended President Bazoum’s efforts in the areas of girls’ school enrolment and the fight against climate change.</p>\n\n<p>The two&nbsp;leaders stressed the urgent need to take action to address climate change, which is disproportionately affecting African countries. They also discussed Canada’s commitment to support Niger and African states in their climate change mitigation and adaptation strategies.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/niger/relations.aspx?lang=eng\">Canada-Niger relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/francophonie/index.aspx?lang=eng\">Canada and La Francophonie</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/africa-afrique/index.aspx?lang=eng\">Canada and Sub-Saharan Africa</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.francophoniedjerba2022.tn/fr\">Official website of the 18th Summit of La Francophonie in Djerba</a> (in French only)</li>\n</ul></div>\n      "
}