{
  "path": "/en/news/news-releases/2020/02/11/prime-minister-travel-barbados-meet-caribbean-community-leaders",
  "pageTitle": "Prime Minister to travel to Barbados to meet with Caribbean Community leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Bridgetown, Barbados on February 17 and 18, to participate in the Conference of Heads of Government of the Caribbean Community (CARICOM) to build even stronger ties with the region.</p>\n\n<p>The Caribbean region and Caribbean states are important political, economic and cultural partners of Canada, and the visit will serve as an opportunity to further strengthen its partnership with this regional grouping of 20 Caribbean member states and Associate Members, and nearly 20 million people.</p>\n\n<p>The Prime Minister will discuss challenges of mutual interest, including protecting oceans and the environment in the fight against climate change – in a region that is particularly vulnerable to its impacts, as well as creating good jobs for the middle class and sustainable economic growth.</p>\n\n<p>Prime Minister Trudeau will participate in group discussions and bilateral meetings with CARICOM leaders. He will be received by the Prime Minister of Barbados, Mia Mottley – the current Chair of CARICOM and host of this meeting.</p>\n\n<p>As Canada pursues its candidacy for election to the United Nations Security Council in 2021-2022, we will continue to advance shared interests to benefit people and businesses in Canada, the Caribbean, and around the world.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Caribbean countries have always had strong relationships and almost one million people of Caribbean descent live in Canada. These relationships are based on shared values and partnerships in the fight against climate change, the promotion of democracy, trade, economic growth, and security. I look forward to meeting the leaders of CARICOM to discuss how we can work together to strengthen the Caribbean, and build a better world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Over two million Canadians travel to CARICOM countries annually.</li>\n\t<li>Canada has long-standing ties with many CARICOM countries on a wide range of issues, including trade, security and defence, and governance.</li>\n\t<li>CARICOM is comprised of 15 Member States and five Associate Members. The Member States are Antigua &amp; Barbuda, the Bahamas, Barbados, Belize, Dominica, Grenada, Guyana, Haiti, Jamaica, Montserrat, Saint Lucia, Saint Kitts &amp; Nevis, Saint Vincent &amp; the Grenadines, Suriname, and Trinidad &amp; Tobago. The overseas territories of Anguilla, Bermuda, the British Virgin Islands, Cayman Islands, and Turks &amp; Caicos Islands are Associate Members.</li>\n\t<li>The Conference of the Heads of Government meets twice a year at Regular (summer) and Inter-Sessional (winter) meetings to provide CARICOM its policy direction.</li>\n\t<li>In 2017, Prime Minister Trudeau announced Canada’s $100 million Pledge for Caribbean Reconstruction and Climate Resilience to support regional and country-specific activities that address all the stages of the disaster management cycle. Pledge initiatives enhance disaster risk management systems, promoting climate change adaptation and mitigation, and supporting climate-resilient reconstruction.</li>\n\t<li>At the Asia-Pacific Economic Cooperation (APEC) Leaders’ Meeting in 2018, Prime Minister Trudeau announced $20 million for technical assistance in support of public financial management for Small Island Developing States including in the Caribbean.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/barbados-barbade/relations.aspx?lang=eng\">Canada-Barbados Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada – Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2018/04/14/canada-further-strengthens-its-support-caribbean-region\">Canada further strengthens its support for the Caribbean Region</a></li>\n</ul></div>\n      "
}