{
  "path": "/en/news/statements/2018/04/26/statement-prime-minister-gender-equality-top-priority-canadas-g7",
  "pageTitle": "Statement by the Prime Minister on gender equality as top priority of Canada’s G7 Presidency | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on gender equality as a top priority of Canada’s G7 Presidency:</p><p>“Women’s empowerment is a key driver of economic growth that works for everyone. All of us benefit when women can participate freely, fully, and equally in our economies and society, and supporting and empowering women and girls must be at the heart of the decisions we make.</p><p>“That is why we made gender equality and women’s empowerment a central theme of Canada’s G7 Presidency – and created the <a href=\"https://g7.gc.ca/en/g7-presidency/gender-equality-advisory-council/\">Gender Equality Advisory Council</a> for Canada’s G7 Presidency. Thanks to the Council, we will make sure a focus on gender equality guides the work done at the G7 Leaders’ Summit – and set a precedent for the G7 going forward.</p><p>“In discussions with the Council and the Women 7 (W7), a formal G7 engagement group, as well as other feminist leaders, we explored ways we can promote gender equality and women’s empowerment through the G7 and beyond. The W7 and the Council bring together feminist leaders and advocates from around the world who are trailblazers in their communities. Thanks to their work and to generations of feminist leadership, we have made important progress toward a world where everyone, no matter their gender identity, can realize their full potential.</p><p>“Gender equality must play a key role in creating lasting solutions to the challenges we face as a world – whether building economies that work for everyone, preparing for jobs of the future, fighting climate change, or advancing peace and security. Investing in girls’ education, especially in crisis situations, is a vital part of making that a reality.</p><p>“I thank both the W7 and the Council for their important work and for sharing their knowledge and expertise. I look forward to examining how we can implement their recommendations at the upcoming G7 Leaders’ Summit in Charlevoix, Quebec.”</p></div>\n      "
}