{
  "path": "/en/news/statements/2019/05/29/statement-prime-minister-international-day-united-nations-peacekeepers",
  "pageTitle": "Statement by the Prime Minister on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of United Nations Peacekeepers:</p>\n\n<p>“Today, we recognize UN peacekeepers, past and present, who have served at great personal risk to promote peace, restore stability, and protect those most in need. We also pay tribute to the 115 peacekeepers and UN staff from around the world who, between January 2018 and March 2019, gave their lives in the service of peace.</p>\n\n<p>“The work of a UN peacekeeper has never been more demanding. They uphold human rights, advance democracy and the rule of law, protect the most vulnerable from the ravages of war, and help people rebuild their lives when conflict ends. Every day, they put their lives on the line to pave the way forward for peace.</p>\n\n<p>“The dedication, professionalism, and perseverance of UN peacekeepers are a testament to how the international community can work together to resolve conflicts. Canada is proud to have contributed, together with our global partners, to over seven decades of UN peacekeeping efforts. Today, we are continuing this tradition, serving with UN missions in Cyprus, the Democratic Republic of Congo, Haiti, South Sudan, the Middle East, and Mali, where Canadians in uniform are deployed to provide medical evacuation, transportation, and logistical support to UN forces.</p>\n\n<p>“Canada has taken a leadership role to meet the changing nature of conflict and prepare for the future of peacekeeping. Our contributions will help make peace operations more efficient and effective, including by developing new training for civilians, police, and military. We are also working to involve more women, youth, Indigenous peoples, and under-represented groups in political processes, conflict prevention, and mediation efforts.</p>\n\n<p>“Canada recognizes the strong link between women’s involvement in peace operations and the achievement of long-term, sustainable peace. Women bring different perspectives and priorities into conflict prevention and peacebuilding, making it more inclusive and effective. Earlier this year, we participated in the launch of the UN’s <a href=\"https://international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative</a> Fund for Uniformed Women in Peace Operations to increase the deployment of trained and qualified women to UN peacekeeping, and empower more women to help prevent, manage, and end conflict.</p>\n\n<p>“On behalf of all Canadians, I thank UN peacekeepers and their families for their courageous service and immense sacrifice, as they work around the world to help make the difficult transition from conflict to peace.”</p></div>\n      "
}