{
  "path": "/en/news/readouts/2022/03/22/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy. The call took place in advance of several high-level meetings in Europe later this week, including with the European Union, NATO and G7 leaders, which are set to build on Canada’s coordinated response to Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>The Prime Minister and President discussed the continuing Russian military aggression and the increasing number of civilian casualties due to Russia’s bombings of civilian infrastructure. Both leaders called on Russia to stop targeting civilians, to withdraw its military forces from Ukraine, and to engage in diplomacy with Ukraine. Prime Minister Trudeau reaffirmed Canada’s steadfast support for the territorial integrity, sovereignty, and independence of Ukraine, and vowed to continue to back Ukraine wholeheartedly.</p>\n\n<p>President Zelenskyy thanked Prime Minister Trudeau for Canada’s assistance, and the two leaders discussed further international assistance ahead of the upcoming NATO and G7 meetings.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/21/prime-minister-travel-belgium-meet-allies-and-partners-continue\">Prime Minister to travel to Belgium to meet with allies and partners to continue addressing Russia’s invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/16/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n</ul></div>\n      "
}