{
  "path": "/en/news/statements/2018/07/18/statement-prime-minister-nelson-mandela-international-day",
  "pageTitle": "Statement by the Prime Minister on Nelson Mandela International Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Nelson Mandela International Day:</p><p>“Today, on&nbsp;<a href=\"http://www.un.org/en/events/mandeladay/\">Nelson Mandela International Day</a>, we join people around the world to reflect on the life and legacy of the anti-apartheid revolutionary and former South African President. As we mark 100 years since Nelson Mandela’s birth, we celebrate his contributions to peace and justice, and carry forward his call for equality and freedom.</p><p>“Nelson Mandela devoted his life to the liberation struggle in South Africa. Against the brutal oppression and entrenched discrimination of apartheid, he was a voice for justice that never faltered. Serving 27 years in prison for his efforts, he brought the resistance inside and continued to lead the movement even as a political prisoner. By the time he was released, he was a symbol for freedom struggles everywhere.</p><p>“Nelson Mandela’s leadership was instrumental in bringing apartheid to an end, and in 1993 he was awarded the Nobel Peace Prize in recognition of his work to advance civil rights and lay the foundation for a new democratic South Africa. He continued to champion democracy and justice for South Africans as the country’s first black President and until the end of his life.</p><p>“Canada is deeply proud of its historical friendship with Nelson Mandela. Our country played a leading role in the international fight against apartheid, helping to force economic sanctions against the regime. We were honoured when Mr. Mandela spoke before a special joint session of the House of Commons and the Senate shortly after his release. In 2000, he was the first foreign leader invested into the Order of Canada as an Honorary Companion, and in 2001, he became the first living person to receive honorary Canadian citizenship.</p><p>“As Canadians, we know that our success as a country rests on equality, inclusion, and justice. Mandela showed us what it means to spend a life in service to those ideals. He taught us that one person can make an extraordinary difference – and that it’s in our hands to make our world a better one.</p><p>“Today, I encourage everyone to celebrate Nelson Mandela’s legacy as a beacon to all those who struggle for freedom and justice around the world. It’s up to all of us to carry his work forward. Let’s fight injustice, stand with the oppressed, and build a future where freedom is a reality for all.”</p></div>\n      "
}