{
  "path": "/en/news/statements/2022/06/20/statement-prime-minister-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p>\n\n<p>“Today, on World Refugee Day, we recognize people from around the world who are forced to leave their homes and communities in search of a better life. We honour their courage and bravery, and here in Canada, we reaffirm our commitment to keeping our borders and hearts open to those fleeing violence and persecution.</p>\n\n<p>“This year’s theme is ‘<a href=\"https://www.unhcr.org/world-refugee-day.html\">Whoever. Wherever. Whenever. Everyone has the right to seek safety</a>’. Canada has a proud and longstanding tradition of welcoming people seeking safety, no matter who they are or where they come from. Last year, Canada was the top country in the world to resettle refugees, helping them establish roots and start a new life here. Since 1980, Canada has welcomed one million refugees, and <a href=\"https://budget.gc.ca/2022/report-rapport/chap4-en.html#2022-2\">Budget 2022</a> proposes major investments to continue welcoming and supporting newcomers.</p>\n\n<p>“In response to global conflicts, Canada will continue to step up to provide safe haven for people fleeing for their safety. Canada has one of the largest commitments in the world to resettle Afghan refugees and we have welcomed over 16,000 Afghans since August 2021. In response to Russia’s illegal invasion of Ukraine, we have welcomed over 43,200 Ukrainian nationals in Canada. The government continues to work closely with provinces and territories, settlement organizations, and NGOs across the country to support Ukrainians and their family members before, during, and after their arrival in Canada. We organized three federal charter flights, which brought more than 950 Ukrainians and their family members to Canada in recent months, and we are also working closely with key partners in Ukraine’s neighbouring countries to assist those who have been forced to flee their homes.</p>\n\n<p>“Today, I invite all Canadians to reflect on the values that make our country a top destination for those in search of a better life: peace, freedom, equality, and above all, hope for a better future. We will continue to show the world what it means to be Canadian by continuing to provide those in need with a safe place to call home. Refugees are integral to the fabric of our communities across the country; they start businesses, volunteer to help those who need it, and contribute fully to our local economies. Canada is better for it.”</p></div>\n      "
}