{
  "path": "/en/news/statements/2021/04/17/statement-prime-minister-celebrating-life-duke-edinburgh",
  "pageTitle": "Statement by the Prime Minister celebrating the life of The Duke of Edinburgh | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement celebrating the life of His Royal Highness The Duke of Edinburgh:</p>\n\n<p>“Canadians were deeply saddened to hear last week of the passing of The Duke of Edinburgh. Our thoughts continue to be with Her Majesty and the members of the Royal Family as they mourn the loss of a beloved husband, father, grandfather, and great-grandfather.</p>\n\n<p>“The Duke of Edinburgh was a lifelong companion to our Queen and a dear friend to Canada. He was also a devoted public servant whose contributions changed countless lives around the world, especially those of young people.</p>\n\n<p>“To pay tribute to Prince Philip, and honour his commitment to the success of future generations, I am announcing that Canada will donate $200,000 to the <a href=\"https://www.dukeofed.org/\">Duke of Edinburgh’s International Award (Canada)</a>. Since 1963, this award has helped over 500,000 young Canadians gain valuable skills and experiences, and become leaders of today and tomorrow. It has not only transformed the future of many Canadians, but also many communities from coast to coast to coast.</p>\n\n<p>“I encourage young Canadians to find out more about the Duke of Edinburgh’s International Award. Whether you want to develop a new skill, give back to your community, or set out on an adventure, this program is as much a personal challenge as it is a global opportunity.</p>\n\n<p>“The Duke of Edinburgh leaves behind a legacy that lives on in the millions of people who pursued a ‘Duke of Ed’ and bettered their lives and the lives of those around them. As we mourn his loss, we pay tribute to his remarkable life and public service. His lifetime dedication to youth will continue to lift generations to come.”</p></div>\n      "
}