{
  "path": "/en/news/statements/2017/08/28/statement-prime-minister-canada-changes-ministry",
  "pageTitle": "Statement by the Prime Minister of Canada on changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on changes to the Ministry:</p><p><a href=\"/en/minister/honourable-carolyn-bennett\"><b>Carolyn Bennett</b></a>, currently Minister of Indigenous and Northern Affairs, becomes Minister of Crown-Indigenous Relations and Northern Affairs.</p><p><a href=\"/en/minister/honourable-jane-philpott\"><b>Jane Philpott</b></a>, currently Minister of Health, becomes Minister of Indigenous Services.</p><p><a href=\"/en/minister/honourable-kent-hehr\"><b>Kent Hehr</b></a>, currently Minister of Veterans Affairs and Associate Minister of National Defence, becomes Minister of Sport and Persons with Disabilities.</p><p><a href=\"/en/minister/honourable-carla-qualtrough\"><b>Carla Qualtrough</b></a>, currently Minister of Sport and Persons with Disabilities, becomes Minister of Public Services and Procurement.</p><p><a href=\"/en/minister/honourable-ginette-petitpas-taylor\"><b>Ginette Petitpas Taylor</b></a>, currently Parliamentary Secretary to the Minister of Finance, becomes Minister of Health.</p><p><a href=\"/en/minister/honourable-seamus-oregan\"><b>Seamus O’Regan</b></a>,&nbsp;becomes Minister of Veterans Affairs and Associate Minister of National Defence.</p><p>The Prime Minister thanked retiring Minister Judy Foote for her exemplary public service and for her enduring commitment to Canada and Canadians. He also thanked Minister of Natural Resources James Carr for serving as acting Minister of Public Services and Procurement.</p><h2>Related product</h2><ul><li><b>Backgrounder</b>: <a href=\"/en/news/backgrounders/2017/08/28/new-ministers-support-renewed-relationship-indigenous-peoples\">New Ministers to support the renewed relationship with Indigenous Peoples</a></li></ul></div>\n      "
}