{
  "path": "/en/news/news-releases/2021/03/15/major-investments-canada-and-quebec-electric-vehicle-battery-assembly",
  "pageTitle": "Major investments by Canada and Quebec in electric vehicle battery assembly | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, and the Premier of Quebec, François Legault, announced on Monday an equal investment totalling nearly $100&nbsp;million to Lion&nbsp;Electric, for the establishment of a highly automated battery-pack assembly plant in Saint‑Jérôme, in the Laurentians. This project, valued at nearly $185&nbsp;million, will create 135&nbsp;jobs when construction of the plant is completed in 2023. It is also expected that 150&nbsp;additional jobs will be created over the longer term.</p>\n\n<p>For the announcement, Mr. Trudeau and Mr. Legault were accompanied by the Minister of Innovation, Science and Industry, François-Philippe Champagne, by Quebec’s Minister of Economy and Innovation, Pierre Fitzgibbon, and by Marc Bédard, President and Founder of Lion Electric.</p>\n\n<p>The battery packs assembled at the new plant will be used in Lion Electric vehicles. This strategic investment will allow the company to improve its cost structure, and better control the design and shape of its batteries, making it more competitive in the heavy-duty electric vehicle market. Ultimately, the company will be able to increase the volume of its vehicle production. Lion Electric will be the first Canadian manufacturer of medium and heavy-duty vehicles to have state-of-the-art, automated battery-pack manufacturing facilities.</p>\n\n<p>The company will also establish a research and development innovation centre within its manufacturing plant, which will allow it to test and refine products for future use, including batteries for emergency vehicles such as ambulances. The company will test innovations from research and development, including energy storage capacity and battery performance. The results will make these products more competitive in the North American market.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“With today’s announcement, we are continuing to take steps to support our Canadian businesses, invest in innovation, and protect the environment. It is because of companies like Lion&nbsp;Electric that we are accelerating our transition to a resilient and competitive clean growth economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>&nbsp;“With Lion and a number of other companies, Quebec is building expertise in electric transportation. This is yet further proof that we have the know-how to produce batteries. Our government is ready to make investments that will put Quebec on the right side of history in terms of the economy. We are prepared to take risks so that our companies can become champions in growth industries. We are building a new and even more powerful economy, a new economy where Quebec will be a leader. The economy of a greener, more prosperous and, above all, prouder Quebec.”</p>\n\n<footer class=\"default\">François Legault, Premier of Quebec</footer>\n</blockquote>\n\n<blockquote>\n<p>“Lion is synonymous with innovation and bold entrepreneurship, and a key player in Canada’s journey toward a sustainable, green growth future. Investments like the one announced today support job creation and our long-term prosperity, and position Canada as a leader in electric transportation. The electrification of transportation is a major driver for achieving our economic and climate objectives. That is why we are proud to support and assist Lion in this major milestone.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“With its new battery assembly plant, Lion is moving toward automation and focusing on innovation to become even more competitive on the international market. This project represents a major step forward in the development of our battery production capacity in Quebec. With critical minerals, world‑class research, promising technologies, and, above all, clean, renewable electricity, we have everything we need in Quebec to become a leader in the global electric revolution.”</p>\n\n<footer class=\"default\">Pierre Fitzgibbon, Quebec’s Minister of Economy and Innovation</footer>\n</blockquote>\n\n<blockquote>\n<p>“Lion is an important player in the Quebec and Canadian transportation electrification ecosystem. This plant will allow Lion to consolidate a key element of our electric vehicles supply chain. Thanks to loans from the federal and provincial governments, we will now be able to manufacture in Canada what we previously imported. Lion, Quebec, and Canada will benefit, both economically and environmentally, and so will our future generations.”</p>\n\n<footer class=\"default\">Marc Bédard, President and Founder of Lion Electric</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li><a href=\"https://thelionelectric.com/en\">Lion Electric</a> is a Quebec-based company that designs and manufactures 100 per cent&nbsp;electric school buses and trucks. It currently employs over 465&nbsp;people at its plant in Saint-Jérôme, in the Laurentians, Quebec.</li>\n\t<li>When the project announced today is completed, the company will have the capacity to produce 2,500&nbsp;vehicles per year.</li>\n\t<li>The Government of Canada’s nearly $50&nbsp;million investment comes from the Strategic Innovation Fund, while the Government of Quebec’s $50&nbsp;million contribution, granted through Investissement Québec, comes from the Economic Development Fund.</li>\n\t<li>The company’s project is in line with two&nbsp;objectives of the Quebec government’s strategy for developing the battery industry, namely, to manufacture battery components and to produce commercial electric vehicles in Quebec.</li>\n\t<li>The project will promote the use of commercial electric vehicles in Canada and Quebec, thereby reducing greenhouse gas emissions.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://www.economie.gouv.qc.ca/bibliotheques/strategies/strategie-quebecoise-de-developpement-de-la-filiere-batterie/\">Quebec’s strategy for developing the battery industry</a> (French only)</li>\n</ul></div>\n      "
}