{
  "path": "/en/news/statements/2021/06/06/statement-prime-minister-canadian-armed-forces-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Armed Forces Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Canadian Armed Forces Day:</p>\n\n<p>“Today, we thank the brave members of the Canadian Armed Forces, past and present, for their tremendous courage, service, and sacrifice. We owe them and their families a debt of gratitude that can never be repaid.</p>\n\n<p>“Canadian Armed Forces members serve our country in many capacities at home and throughout the world, representing our most cherished values of peace, freedom and democracy. Every day, our military personnel contribute to international peace and security and defend our country, including by responding to natural disasters.</p>\n\n<p>“This year, our Canadian Armed Forces members have responded to the call to help fight COVID-19 and protect lives. Through <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-vector.html\">Operation VECTOR</a>, they are providing support to the federal, provincial, and territorial governments for the distribution of COVID-19 vaccines, while helping fight the global pandemic across Canada through <a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/laser.html\">Operation LASER</a>. Given the challenges of working in a pandemic, the Canadian Armed Forces have worked hard to mitigate health risks to their members, while ensuring their ability to continue to serve around the world, with approximately 2,000 personnel deployed in more than 20 different operations.</p>\n\n<p>“On this day, we are also mindful that we must improve the culture and working conditions for our military. Our government is working hard to help achieve long-overdue culture change in the Canadian Armed Forces through measures to eliminate unacceptable conduct, toxic culture, discrimination, violence, and harassment. Since 2015, we’ve taken important steps to do this, including introducing clear policies around hateful conduct, as well as the establishment of the Sexual Misconduct Response Centre, but there’s still much work to do. That’s why we recently appointed former Supreme Court Justice Louise Arbour to lead an external review into the causes of sexual harassment and misconduct within the Forces, and why Lieutenant-General Jennie Carignan will serve as the military’s Chief of Professional Conduct and Culture. We are also taking concrete steps to address sexual misconduct and gender-based violence in the military, and to better support survivors, through new investments in Budget 2021. Together, we will build a Defence Team that reflects the best of Canada, and ensures a safe and inclusive working environment for all.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me in extending our heartfelt gratitude and appreciation to the members of the Canadian Armed Forces and their families, past and present, for their service to Canada. Our brave soldiers, sailors, and aviators have stepped up to help Canadians and vulnerable populations around the world get through this crisis, and we owe them our sincere thanks.”</p></div>\n      "
}