{
  "path": "/en/news/statements/2021/01/22/statement-prime-minister-fifth-anniversary-shootings-la-loche",
  "pageTitle": "Statement by the Prime Minister on the fifth anniversary of the shootings in La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the fifth anniversary of the deadly shootings in La Loche, Saskatchewan:</p>\n\n<p>“Five years ago today, a senseless attack in the community of La Loche, Saskatchewan, killed four Canadians and seriously injured seven more. &nbsp;</p>\n\n<p>“On this solemn anniversary, I join Saskatchewanians and all Canadians to remember and pay tribute to those whose lives were lost. We offer our deepest sympathies to their families and loved ones, to the survivors, and to everyone living with the pain and trauma caused by this attack. We also honour the first responders, Indigenous communities, and frontline service providers whose courage helped save lives at Dene High School and prevented greater tragedy.</p>\n\n<p>“The hearts of all Canadians were broken five years ago and we have continued to heal together ever since. I personally met the community of La Loche and saw their incredible resilience, strength, and courage. To each member of the community: you will never be forgotten. The Government of Canada will always be there to support you, to listen to you, and to prevent such tragedies from happening again.</p>\n\n<p>“To ensure the safety and security of all Canadians, including people of La Loche, we announced last year a <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">ban of more than 1,500 models</a> of assault-style firearms and their variants. In addition, we provided recently <a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2020/08/government-of-canada-is-responding-to-immediate-indigenous-mental-wellness-demands-during-the-covid-19-pandemic.html\">$82.5 million</a> to help Indigenous communities adapt and expand mental health and wellness services, improving access and addressing growing demand. We will continue to work in partnership with Indigenous, municipal, territorial, and provincial governments to ensure a better future for Indigenous youth. We will also continue to work with communities across Canada, in a way that supports their needs. Together, we can better support healing and address the issues facing La Loche and other communities.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to take time today to remember the victims and survivors of the horrible attack, and reaffirm our unwavering support for the people of La Loche.”</p>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2021/01/22/ta-koldere-nedhe-prime-minister-beyatie-si-ediri-ki-nitelas-tue-la-loche\">Statement in Denesuline</a></li>\n\t<li><a href=\"/en/news/statements/2021/01/22/weestamakaywin-ouschi-kischee-li-ministr-avek-saenk-laniversayr-ouschi\">Statement in Michif</a></li>\n</ul></div>\n      "
}