{
  "path": "/en/news/news-releases/2022/03/26/stand-ukraine-european-commission-and-government-canada-team-global",
  "pageTitle": "Stand Up for Ukraine: European Commission and Government of Canada team up with Global Citizen to mobilize support for refugees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today the European Commission and the Government of Canada announced the launch of a global campaign to raise funding in support of people fleeing the invasion of Ukraine, in partnership with international advocacy organization <a href=\"https://www.globalcitizen.org/en/\">Global Citizen</a>.<em> </em></p>\n\n<p>The President of Ukraine Volodymyr Zelenskyy called on the international community on behalf of his citizens who have been displaced by the war, saying: “On 9 April, the biggest online event ‘Social Media Rally’ will support people who were forced to flee Ukraine. I'm inviting everybody: musicians, actors, athletes, businessmen, politicians, everybody. Everyone who wants to join this movement and ‘Stand Up for Ukraine’.”</p>\n\n<p>The<em> “Stand Up For Ukraine</em>” campaign<em> </em>seeks to mobilize governments, institutions, artists, companies and individuals to direct funding to support humanitarian efforts in Ukraine and in neighbouring countries. Global Citizen will announce more details in the coming days about how people can support.</p>\n\n<p>It will culminate in a pledging event on 9 April, co-hosted by President of the European Commission Ursula von der Leyen and Prime Minister Justin Trudeau. The aim is to raise funds and mobilize support more broadly, to cater for the needs of internally displaced people and of refugees.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today, our message to the Ukrainian people is this: we are standing with you. Whether you need food, water, shelter, or medical aid – we are rallying the world to continue to have your backs and provide critical assistance where it is needed most. When we all work together, we can achieve the best outcomes for those displaced by Putin’s illegal and unjustifiable invasion of Ukraine.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Millions of people are fleeing the bombs falling on Ukrainian cities. They are leaving their homes and their lives behind, to reach safety in other parts of Ukraine or in neighbouring countries. A Ukrainian child has become a refugee every second since the start of the war. The world must stand up for them. The European Union is catering for the needs of the millions of refugees it hosts. And we will further step up. But so much is needed – and the brave people of Ukraine deserve solidarity from citizens and governments around the globe. Together, we can give them a safe home and bring some light in their lives at this dark hour.”</p>\n\n<footer class=\"default\">Ursula von der Leyen, President of the European Commission</footer>\n</blockquote>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-canada-helping-aide.aspx?lang=eng\">How Canada is helping – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_en\">EU solidarity with Ukraine</a> – available in <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_uk\">Ukrainian</a> and <a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/stronger-europe-world/eu-solidarity-ukraine_ru\">Russian</a></li>\n</ul></div>\n      "
}