{
  "path": "/en/news/news-releases/2020/04/17/prime-minister-announces-new-support-protect-canadian-jobs",
  "pageTitle": "Prime Minister announces new support to protect Canadian jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is taking action to help Canadian businesses and organizations keep their doors open, keep their employees on the payroll, and recover quickly when Canada bounces back from this crisis.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced new actions to protect Canadian jobs and provide more support to businesses and organizations dealing with the economic impacts of COVID-19. The Government of Canada will provide over $1.7&nbsp;billion for targeted measures, including:</p>\n\n<ul>\n\t<li>$675 million to give financing support to small and medium-sized businesses that are unable to access the government’s existing COVID-19 support measures, through Canada’s Regional Development Agencies.</li>\n\t<li>$287 million to support rural businesses and communities, including by providing them with much-needed access to capital through the Community Futures Network.</li>\n\t<li>$500 million to establish a COVID-19 Emergency Support Fund for Cultural, Heritage and Sport Organizations to help address the financial needs of affected organizations within these sectors so they can continue to support artists and athletes. This measure is consistent with the government’s other existing COVID-19 support measures for wages and fixed costs for organizations.</li>\n\t<li>$250 million to assist innovative, early-stage companies that are unable to access existing COVID-19 business support, through the National Research Council of Canada’s Industrial Research Assistance Program.</li>\n\t<li>$20.1 million in support for Futurpreneur Canada to continue to support young entrepreneurs across Canada who are facing challenges due to COVID-19. The funding will allow Futurpreneur Canada to provide payment relief for its clients for up to 12 months.</li>\n</ul>\n\n<p>The government recognizes some sectors are disproportionally affected by COVID-19, such as Canada’s energy sector, which is dealing with low prices caused by a surge in global crude oil supply and a decline in demand due to the economic effects of the pandemic. That’s why the government is announcing new measures to help retain and create approximately 10,000 well-paying jobs in the energy sector. To support Canadians working in this sector, the Government of Canada will:</p>\n\n<ul>\n\t<li>provide up to $1.72 billion, including funding to the governments of Alberta, Saskatchewan, and British Columbia, and the Alberta Orphan Well Association, to clean up orphan and/or inactive oil and gas wells – creating thousands of jobs and having lasting environmental benefits.</li>\n\t<li>provide up to $750 million to create a new proposed Emissions Reduction Fund to reduce emissions in Canada’s oil and gas sector, with a focus on methane. This fund will provide primarily repayable contributions to conventional and offshore oil and gas firms to support their investments to reduce greenhouse gas emissions. Of this amount, $75 million will be allocated to the offshore sector.</li>\n\t<li>expand eligibility for the new Business Credit Availability Program announced on March 13, 2020, to help Canadian businesses get the financing they need during this period of uncertainty. The support will be available to medium-sized businesses with larger financing needs, beginning with companies in Canada’s energy sector, to help them maintain operations and keep their employees on the job.</li>\n</ul>\n\n<p>These measures are part of the Government of Canada’s comprehensive economic plan to help Canadians and businesses through this period of uncertainty. We will continue to monitor this evolving situation closely, and take additional actions as needed to protect our health and safety, and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Many Canadian businesses are facing economic hardships and uncertainty during the COVID-19 pandemic. They give hardworking Canadians the jobs they rely on to provide for their families and they need our help in these difficult times. We will continue to take decisive action to support Canadian businesses, protect Canadian jobs, and keep our economy strong.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic has had a profound impact on the Canadian economy. That is why we are taking unprecedented measures today to protect Canadian jobs. We are working in close consultation with all impacted businesses across the country to take action where it is required, and are prepared to take further targeted action as needed.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada’s Regional Development Agencies help businesses and innovators grow and succeed. They focus on advancing and diversifying regional economies and helping communities thrive.</li>\n\t<li>There are six Regional Development Agencies across the country: the Canadian Northern Economic Development Agency, Western Economic Diversification Canada, FedNor, FedDev Ontario, Canada Economic Development for Quebec Regions, and the Atlantic Canada Opportunities Agency.</li>\n\t<li>The Community Futures Program is a community-driven, economic development program designed to help communities in Canada’s rural areas develop and implement strategies to deal with a changing economic environment.</li>\n\t<li>The COVID-19 Emergency Support Fund for Cultural, Heritage and Sport Organizations will provide $500 million to help address the financial needs of affected organizations within these sectors. The Fund will be administered by Canadian Heritage with the support of its partners.</li>\n\t<li>The National Research Council of Canada’s Industrial Research Assistance Program provides advice, connections, and funding to help Canadian small and medium-sized businesses increase their innovation capacity and take their ideas to market.</li>\n\t<li>The Government of Canada will provide funding to clean up orphan and/or inactive oil and gas wells, including:\n\t<ul>\n\t\t<li>up to $1 billion to the Government of Alberta</li>\n\t\t<li>up to $400 million to the Government of Saskatchewan</li>\n\t\t<li>up to $120 million to the Government of British Columbia</li>\n\t\t<li>$200 million to the Alberta Orphan Well Association. The Association will fully repay this amount.</li>\n\t</ul>\n\t</li>\n\t<li>On March 13, 2020, the Government of Canada announced $65 billion in additional support to businesses through a new Business Credit Availability Program. Under the program, Export Development Canada and the Business Development Bank of Canada are providing direct lending and other types of financial support at market rates to viable businesses and organizations whose access to financing would otherwise be restricted.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"http://www.canada.ca/en/department-finance/news/2020/04/canadas-covid-19-economic-response-plan-new-support-to-protect-canadian-jobs.html\">Canada’s COVID-19 Economic Response Plan: New Support to Protect Canadian Jobs</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}