{
  "path": "/en/news/statements/2022/01/17/statement-prime-minister-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul Wallenberg Day:</p>\n\n<p>“Today, we pay tribute to Raoul Wallenberg, a remarkable hero and humanitarian who put his life in jeopardy to save some hundred thousand Hungarian Jews from persecution and death during the Holocaust.</p>\n\n<p>“Working as a Swedish diplomat in Budapest, Mr. Wallenberg conducted one of the most extensive and successful rescue efforts during the Second World War. Shortly after his arrival in Hungary in July 1944, he issued special protective passports – Schutz-Passes – to thousands of Jews, giving them diplomatic immunity and saving them from deportation to death camps. Under increasingly dangerous circumstances, Mr. Wallenberg also established dozens of safe houses that served as hideouts for Jews fleeing persecution, which were operating under the protection of the Swedish flag. His commitment to this humanitarian cause did not end there – he went on to organize a network of hospitals, soup kitchens, and orphanages that provided Jews with safety and security in Nazi-occupied Hungary in 1944 and the beginning of 1945.</p>\n\n<p>“Over the course of six months, Mr. Wallenberg saved more Jews from the Holocaust than any other individual, group, or government. Tragically, he disappeared in 1945, following his arrest by Soviet forces toward the end of the war. While his fate remains unknown, Mr. Wallenberg’s legacy lives on through the stories of survivors and lives saved, and the several monuments, institutions, awards, and honours around the world that now bear his name. In 1985, the Government of Canada named Mr. Wallenberg its first honorary citizen, and in 2001, designated January 17 – the day of his disappearance in 1945 – as Raoul Wallenberg Day to ensure that his personal example of heroism, courage, and decency is always remembered. In addition, at the Malmö International Forum on Holocaust Remembrance and Combating Antisemitism on October 13, 2021, the Government of Canada pledged to use the legacy of Raoul Wallenberg as an inspirational role model to educate and raise awareness about the Holocaust and antisemitism in Canada.</p>\n\n<p>“Mr. Wallenberg’s work served as a beacon of light during the darkest days of the Second World War. The Government of Canada will always continue to fight – and reject – antisemitism, hatred, and racism in all of their forms. This past November, we reappointed the Honourable Irwin Cotler as Canada’s Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism. The government will also keep honouring Mr. Wallenberg, as well as the victims and survivors of the Holocaust, by defending our core principles of peace, freedom, democracy, and human rights when they are threatened.</p>\n\n<p>“On this day, I encourage all Canadians to find inspiration in Mr. Wallenberg’s legacy. His undeniable bravery serves as a reminder to us all to protect our most vulnerable and fight against discrimination as we work to build a more just, inclusive, and compassionate society – here at home and around the world.”</p></div>\n      "
}