{
  "path": "/en/news/readouts/2020/11/11/prime-minister-justin-trudeau-speaks-speaker-united-states-house",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Speaker of the United States House of Representatives Nancy Pelosi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with&nbsp;the&nbsp;Speaker&nbsp;of the&nbsp;United States House of Representatives,&nbsp;Nancy Pelosi,&nbsp;to congratulate her on her election win.</p>\n\n<p>The Prime Minister and the Speaker agreed on the importance of Canada and the United States working together bilaterally and internationally to address the health and economic impacts of the&nbsp;COVID-19 pandemic, strengthen international&nbsp;security, promote human rights&nbsp;and&nbsp;fight&nbsp;climate change.&nbsp;They also agreed on the importance of job creation and economic recovery and growth that benefits everyone.</p>\n\n<p>The Prime Minister looked forward to engaging with Speaker Pelosi and&nbsp;President-elect&nbsp;Biden’s&nbsp;administration on key issues, including trade, Buy America&nbsp;provisions,&nbsp;and energy cooperation.</p>\n\n<p>The Prime Minister and Speaker discussed the cases of&nbsp;Canadians&nbsp;Michael&nbsp;Kovrig&nbsp;and Michael&nbsp;Spavor, who have been arbitrarily detained in China.</p>\n\n<p>The Prime Minister and Speaker recognized the shared sacrifice of veterans from both countries in the service of peace and democracy on this day of remembrance. They also highlighted&nbsp;the depth of friendship between the two countries as demonstrated by Canadian firefighters’ support&nbsp;to&nbsp;California&nbsp;in the state’s&nbsp;battle against wildfires.</p>\n\n<p>The Prime Minister and the Speaker looked forward to working together to advance bilateral cooperation and shared values.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/11/07/statement-prime-minister-canada-result-us-presidential-election\">Statement by the Prime Minister of Canada on the result of the U.S. presidential election</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://www.cer-rec.gc.ca/en/applications-hearings/view-applications-projects/keystone-xl/project-information.html\">Keystone XL Pipeline – Project Information</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canadaextremelyconcerned-by-formal-charges-being-laid-against-michael-kovrig-and-michael-spavor.html\">Canada extremely concerned by formal charges being laid against Michael&nbsp;Kovrig&nbsp;and Michael&nbsp;Spavor</a></li>\n</ul></div>\n      "
}