{
  "path": "/en/news/statements/2017/04/28/statement-prime-minister-canada-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister of Canada on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Mourning: &nbsp;&nbsp;&nbsp;<br> </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Every year on this day, we join people in many countries around the world to honour and remember workers who have been killed, injured, or suffered illness because of workplace hazards and accidents.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Unfortunately, not all workplaces are safe, and some jobs require people to put themselves in harm’s way. Each year in Canada, thousands of employees suffer workplace-related illnesses, are injured, or lose their lives while on the job. Workplace hazards can affect not only workers themselves, but also their families and communities.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Next month, we will mark the 25th anniversary of the Westray mine disaster. In remembering that terrible day, our government commits to working to ensure the Westray Law is applied effectively, and negligent employers are held responsible. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Government of Canada is committed to the health, safety, and wellbeing of all workers across the country. We will continue to work closely with organized labour, employers, employees, stakeholders, and provincial and territorial partners to educate and raise awareness about work-related dangers, and to help prevent accidents, injuries, and illnesses in the workplace. Part of this commitment includes our <a href=\"http://news.gc.ca/web/article-en.do?nid=1169979\">pledge to ban the manufacturing, importing, exporting and use of asbestos</a> in Canada by 2018.</span></p><p>“On this sombre day, I encourage all Canadians to take a moment to pause and honour those workers who have lost their lives, been injured, disabled, or became sick while on the job. Together, let us renew our commitment to making Canada a healthier and safer place to work and live.”</p><p><b>Associated Link</b></p><ul><li><a href=\"http://www.ccohs.ca/events/mourning/\">Canadian Centre for Occupational Health and Safety – Day of Mourning</a></li></ul></div>\n      "
}