{
  "path": "/en/news/news-releases/2016/04/18/prime-minister-travel-new-york-sign-paris-agreement-climate-change",
  "pageTitle": "Prime Minister to travel to New York to sign the Paris Agreement on Climate Change | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City from April 20 to 22, 2016, &nbsp;to sign the Paris Agreement on climate change.</p>\n<p>Canada has committed to play a positive and constructive role in the world, and to make meaningful contributions to important global challenges such as climate change.</p>\n<p>In November 2015, Canada and 194 other countries reached the Paris Agreement— an international agreement to address climate change that is ambitious, durable, and applicable to all parties. It recognizes the important role of subnational governments, civil society, and the private sector, and it highlights Indigenous, community, human, and gender rights.</p>\n<p>During his visit, the Prime Minister will also discuss the issues of climate change and youth engagement with students at New York University, and meet with counterparts.</p>\n<p>Canada has resolved to be an international leader in the low carbon global economy over the coming decades. The government will continue to work with our provincial, territorial, and international partners to develop a more coordinated approach to climate change, so that our children and our grandchildren can enjoy a world more prosperous and sustainable than the one we know today.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada is a country whose greatest strength is its respect for diversity and pluralism.&nbsp; We have much to contribute to the international community – from combatting climate change to helping build a more peaceful and prosperous world.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p></div>\n      "
}