{
  "path": "/en/news/news-releases/2017/11/02/prime-minister-travel-vietnam-and-philippines",
  "pageTitle": "Prime Minister to travel to Vietnam and Philippines | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Vietnam and the Philippines from November 6 to 14, 2017.</p><p>The trip provides an opportunity for the Prime Minister to meet with partners in the Asia-Pacific region, and promote a progressive trade agenda that creates good, middle class jobs and more opportunities for people on both sides of the Pacific.</p><p>Prime Minister Trudeau will undertake an official visit in Vietnam. In Hanoi, he will meet with the President of Vietnam, Trần Đại Quang, the Prime Minister, Nguyễn Xuân Phúc, the President of the National Assembly of the Socialist Republic of Vietnam, Nguyễn Thị Kim Ngân, as well as the Secretary General of the Communist Party of Vietnam, Nguyễn Phú Trong.</p><p>The Prime Minister will then head to Ho Chi Minh City, where he will meet with Vietnamese business leaders, and participate in an armchair discussion at Ton Duc Thang University. Finally, he will travel to the city of Da Nang to attend the Asia Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting. At the Economic Leaders’ meeting, the Prime Minister will promote Canada as a partner of choice for trade and investment in the region, and deepen economic cooperation with APEC economies.&nbsp;</p><p>After the Economic Leaders’ Meeting, Prime Minister Trudeau will travel to the Philippines to attend the 31st Association of Southeast Asian Nations (ASEAN) Summit in Manila. While at the Summit, the Prime Minister will take part in the Canada-ASEAN Commemorative Summit to review relations between Canada and the 10 ASEAN countries and identify areas where we can increase collaboration.</p><h2>Quotes</h2><blockquote><p>“Canada and Vietnam’s relationship is anchored in strong people-to-people connections, and has expanded greatly in the last forty years. I look forward to meeting with Vietnam’s leaders to advance important issues like good governance and human rights, strengthen our trade and investment cooperation, and create more opportunities for our middle class.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Everyone – including women, youth, and Indigenous Peoples – should have the opportunity to benefit from the opportunities that flow from the global economy. That is the message I will bring to the APEC Economic Leaders’ Meeting and the ASEAN Summit. Canada will continue to promote a progressive trade agenda that benefits the middle class, and look for more opportunities to engage the Asia-Pacific region.”<br> — <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau previously met with President Quang on the margins of APEC in November 2016, and with Prime Minister Phúc on the margins of the G7 in Japan in May 2016.</li><li>Vietnam has been Canada’s largest trading partner in the ASEAN region since 2015.</li><li>Two-way merchandise trade between Canada and Vietnam totaled $5.5 billion in 2016, up from $4.7 billion in 2015. Since 2011, overall bilateral merchandise trade between the two countries has more than tripled.</li><li>Canada exported close to $528 million in merchandise to Vietnam, including fish, crustaceans, cereals, fertilizers, grains, seeds, and fruit. Merchandise imports were nearly $5 billion, led by mechanical and electrical products, footwear, knit apparel, woven apparel, and furniture.</li><li>Canada is a founding member of APEC. Established in 1989, it has since become the pre-eminent economic forum in the Asia-Pacific region. APEC’s primary purpose is to facilitate economic growth and prosperity in the region. APEC includes economies critical to Canada's future economic prosperity and security interests.</li><li>Canada has been a Dialogue Partner of ASEAN for 40 years, and supports the organization’s goal of maintaining the peace, stability, and security to allow Southeast Asia – and the wider Asia-Pacific region – to further develop and prosper.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/vietnam/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Vietnam Relations</a></li></ul></div>\n      "
}