{
  "path": "/en/news/statements/2019/04/06/statement-prime-minister-first-anniversary-tragic-bus-crash-involving",
  "pageTitle": "Statement by the Prime Minister on the first anniversary of the tragic bus crash involving the Humboldt Broncos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the first anniversary of the tragic bus crash involving the Humboldt Broncos in Saskatchewan:</p>\n\n<p>“One year ago, a devastating highway crash took sixteen lives and forever changed the lives of many more.</p>\n\n<p>“Today, we remember the members of the Humboldt Broncos we lost, and offer our support to all those who lost loved ones, and continue to live with trauma, pain, anger, and grief. We also honour the first responders – the RCMP, the Provincial Response Team, and medical personnel – who responded to this extremely difficult situation with courage and professionalism.</p>\n\n<p>“In the face of irreparable loss and injury, Humboldt showed us what resilience and community mean. When we think of Humboldt, we cannot forget pictures of the wreckage – but what will stay in our hearts forever are images of compassion and strength: players clasping hands, united, in the hospital ward; young men learning to stand, walk, and take to the ice again; hockey sticks leaned up against thousands of Canadian front doors.</p>\n\n<p>“The outpouring of love and support from across the country lifted all of our hearts. It was a vivid reminder that in this country, when kindness is most needed, we will be there for each other.</p>\n\n<p>“A tragedy like this should never happen again. We are working with the Canadian Council of Motor Transportation Administrators to develop a standard for entry-level training for truck drivers across Canada, so they have the knowledge and skills they need to operate their vehicles safely. We will also make it mandatory, as of September 2020, for all new medium and large highway buses to have seat belts for passengers, and we are encouraged by community-based efforts to promote their use.</p>\n\n<p>“To the people of Humboldt and all those affected by this tragedy: we are with you. Today, and every day, 37 million Canadians continue to cheer you on.”</p></div>\n      "
}