{
  "path": "/en/news/news-releases/2022/06/17/prime-minister-supports-climate-action-initiatives-major-economies",
  "pageTitle": "Prime Minister supports climate action initiatives at Major Economies Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in the Major Economies Forum (MEF) on Energy and Climate, chaired by the U.S., to advance collective action on climate change. During the meeting, Canada endorsed new initiatives to cut pollution, while creating jobs and growing the economy, and called on major economies to strengthen or adopt pollution pricing.</p>\n\n<p>The Forum, hosted by the President of the United States, Joe Biden, focused on garnering support from the major economies of the world in five key areas: accelerating sales of zero-emission vehicles, reducing methane emissions from oil and gas, supporting clean energy technology demonstration projects, greening international shipping, and strengthening food security.</p>\n\n<p>One of the best ways to cut pollution – while helping people save money and enhancing energy security – is getting more zero-emission vehicles (ZEVs) on the road. At the MEF, Canada helped to advance a collective 2030 zero-emission vehicle goal that ZEVs should make up at least half of passenger vehicle sales by 2030. Canada’s own goal surpasses this target and aims to ensure that at least <a href=\"https://www.canada.ca/en/transport-canada/news/2022/04/minister-of-transport-announces-the-expansion-of-the-incentives-for-zero-emission-vehicles-program.html\">20 per cent of new light-duty vehicles offered for sale will be ZEVs by 2026, at least 60 per cent by 2030, and 100 per cent by 2035</a>. &nbsp;</p>\n\n<p>Today, as part of Canada’s $5.3 billion climate finance commitment, Prime Minister Trudeau announced that Canada will provide $2 million over the next four years, starting this year, to fund methane mitigation projects in developing countries. &nbsp;Canada is also leading the way on reducing methane emissions from oil and gas – a critical climate solution. Canada was one of the first countries to publish national-level regulations targeting methane emissions from the oil and gas sector and was the first country to commit to reducing methane emissions from oil and gas by at least 75 per cent by 2030.</p>\n\n<p>In addition to these initiatives, Prime Minister Trudeau called all countries to implement pollution pricing, which in Canada is reducing emissions while making life more affordable for families. As part of the Global Carbon Pricing Challenge, Canada continues to mobilize support around the goal of covering 60 per cent of global emissions by a price on carbon pollution by 2030.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canadians have been clear about what they want: clean air, a healthy environment, and a strong economy. We look forward to working with the U.S. and the international community in the lead up to the COP27 summit to continue to deliver on these important priorities and a better future for everyone. We’ve all committed to climate action. This is the time to deliver on those promises.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In his remarks to the MEF, the Prime Minister expressed Canada’s full support for the Clean Energy Technologies Demonstration Challenge and its collective commitment of $90 billion to complete urgent clean energy technology demonstration projects this decade.</li>\n\t<li>The Prime Minister announced that Canada supports the Green Shipping Challenge. Canada has already shown leadership on tackling marine emissions by signing on to the Clydebank Declaration and the Declaration on Zero Emissions Shipping.</li>\n\t<li>The Prime Minister also signaled Canada’s support for the goals of the Global Fertilizer Challenge and to working with other countries to further define this initiative. Canada has long been committed to strengthening global agriculture and food systems, and our efforts are increasingly aimed at reducing emissions and adapting to climate change, including through more efficient use of fertilizers.</li>\n\t<li>As of May 31, 2022, the Incentives for Zero-Emission Vehicles Program has helped Canadians purchase or lease over 150,000 new ZEVs. Budget 2022 proposed to invest $1.7 billion to continue the program.</li>\n\t<li>Canada <a href=\"https://www.canada.ca/en/environment-climate-change/news/2021/10/canada-confirms-its-support-for-the-global-methane-pledge-and-announces-ambitious-domestic-actions-to-slash-methane-emissions.html\">committed to the Global Methane Pledge</a> last fall, which set the objective of reducing global methane emissions by at least 30 percent from 2020 levels by 2030. Canada also co-chairs the <a href=\"https://www.globalmethane.org/\">Global Methane Initiative</a>. Today, the Prime Minister signaled Canada’s full support for the Global Methane Pledge Energy Pathway to catalyze methane emissions reductions in the oil and gas sector, advancing both climate progress and energy security.</li>\n\t<li>The Government of Canada’s 2030 Emissions Reduction Plan is an ambitious and achievable sector-by-sector approach for Canada to reach its climate target of cutting emissions by at least 40 to 45 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/06/17/fact-sheet-president-biden-to-galvanize-global-action-to-strengthen-energy-security-and-tackle-the-climate-crisis-through-the-major-economies-forum-on-energy-and-climate/\">FACT SHEET:&nbsp; President Biden to Galvanize Global Action to Strengthen Energy-Security and Tackle the Climate Crisis through the Major Economies Forum on Energy and Climate</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Strengthened Climate Plan: <em>A Healthy Environment and a Healthy Economy</em></a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/pan-canadian-framework.html\">Pan-Canadian Framework on Clean Growth and Climate Change</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/01/prime-minister-trudeau-announces-enhanced-and-ambitious-climate\">Prime Minister Trudeau announced enhanced and ambitious climate action to cut pollution at the COP26 summit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2021/10/canada-confirms-its-support-for-the-global-methane-pledge-and-announces-ambitious-domestic-actions-to-slash-methane-emissions.html\">Canada confirms its support for the Global Methane Pledge and announces ambitious domestic actions to slash methane emissions</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html\">2030 Emissions Reduction Plan: Clean Air, Strong Economy</a></li>\n\t<li><a href=\"https://agriculture.canada.ca/en/agriculture-and-environment/agricultural-climate-solutions\">Agricultural Climate Solutions</a></li>\n</ul></div>\n      "
}