{
  "path": "/en/news/news-releases/2022/04/08/prime-minister-announces-additional-funding-covid-19-vaccination",
  "pageTitle": "Prime Minister announces additional funding for COVID-19 vaccination in lower-income countries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A strong global response to COVID‑19 must ensure vaccines get to people who need them most. To help address the devastating health, economic and security impacts of COVID-19 on people around the world, all countries must step up to make sure that vaccination is happening as quickly as possible.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $220 million in additional funding to support COVID-19 vaccination needs in lower income countries. This additional support builds on the more than $2.7 billion Canada has provided for international assistance in response to COVID-19. It will address barriers to access to COVID-19 vaccines and improve the capacity of lower-income countries to distribute vaccines by ensuring that countries have the financial, operational and technical support they need to get people vaccinated.</p>\n\n<p>Canada is playing a lead role in ending the pandemic by working with international partners to address barriers and support equitable access to life-saving vaccines, tests, and treatments. We continue to demonstrate our commitment to the COVAX Facility through our work as the Co-Chair of the Advance Market Commitment (AMC) Engagement Group, our financial commitments, improving vaccine donation management, and by delivering the equivalent of over 100 million doses – with more to come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since the start of the pandemic, we have known that to truly end this pandemic anywhere, we have to end it everywhere. Canada will continue to be among the world leaders in improving access to COVID-19 vaccines and coordinating global action to end this pandemic to ensure everyone has a fair chance to build a better future in the years ahead.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“From the start, Canada knew that the COVAX Facility was the best way to get vaccines to countries who need them the most. We will continue to work with COVAX not only to increase vaccine supply, but also delivery so we can make sure that vaccines can get from airports into arms as quickly as possible.”</p>\n\n<footer class=\"default\">The Hon. Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Prime Minister made the announcement while participating virtually at the 2022 Gavi COVAX AMC Summit. The Summit, co-hosted by Germany, Senegal, Indonesia and Gavi has helped raise urgent financial support for the COVAX Facility to promote economic recovery, accelerate efforts to address COVID-19 in low and lower-middle income countries, and strengthen health systems in developing countries to better prepare for future pandemics and health crises.</li>\n\t<li>COVAX has delivered over 1.4 billion vaccines to 145 participating countries.</li>\n\t<li>Canada remains committed to supporting the COVAX Facility to ensure that all participating countries have rapid, fair, and equitable access to COVID-19 vaccines as well as the support they need to deliver them. Working with global partners, governments, and stakeholders, through the Access to COVID-19 Tools (ACT) Accelerator and the COVAX Facility, is the best way to ensure that the world can move beyond this pandemic together.</li>\n\t<li>Organizations and international bodies such as, Gavi, the World Health Organization, the Coalition for Epidemic Preparedness and Innovation, and UNICEF are all helping to deliver vaccines to the world’s most vulnerable. They are also supporting developing countries to build capacity to respond to COVID-19 as well as future outbreaks, which will help save millions of lives.</li>\n\t<li>Canada has mobilized more than $2.7&nbsp;billion in international assistance in response to the COVID‑19 pandemic. This includes:\n\t<ul>\n\t\t<li>approximately $1.4 billion in support of humanitarian and development assistance programming that responds to the immediate needs created by the pandemic;</li>\n\t\t<li>over $1.3&nbsp;billion for the&nbsp;<a href=\"https://www.who.int/initiatives/act-accelerator\">Access to COVID‑19 Tools (ACT) Accelerator</a>; this critical international partnership ensures equitable access to COVID‑19 tests, treatments and vaccines;</li>\n\t\t<li>Of this, Canada has contributed $580 million to the COVAX AMC to support the procurement, distribution and delivery of COVID-19 vaccines. This also includes up to $10 million for the design and implementation of COVAX’s dose sharing mechanism that is now serving as the platform for countries committing to share doses via COVAX – putting Canada among world leaders in contributions per capita.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/global_health-sante_mondiale/vaccine_donations-dons_vaccins.aspx?lang=eng\">Canada’s international vaccine donations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/global_health-sante_mondiale/response_covid-19_reponse.aspx?lang=eng\">Canada’s aid and development assistance in response to the COVID‑19 pandemic</a></li>\n\t<li><a href=\"https://nrc.canada.ca/en/corporate/covid-19-vaccine-task-force\">COVID-19 Vaccine Task Force</a></li>\n\t<li><a href=\"https://www.gavi.org/covax-facility\">Gavi – COVAX Facility</a></li>\n</ul></div>\n      "
}