{
  "path": "/en/news/statements/2016/06/20/statement-prime-minister-canada-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister of Canada on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p>\n<p>“Today, let us promise to never forget the dignity and potential in the lives of all those fleeing persecution and conflict, and honour the commitment of those who help them.</p>\n<p>“This year, World Refugee Day marks a somber milestone. An estimated 60 million people are now refugees, asylum seekers, or internally displaced persons. Over half of these people are children.</p>\n<p>“In a time of economic uncertainty and tightening security, it is easy for countries to shy away from the plight of those seeking shelter from conflict and persecution. We must do better than that, and lead with open minds and warm hearts, not closed borders and cold indifference.</p>\n<p>“Canada was built by those who fled oppression and war, who left everything behind to start anew in a strange and faraway land. We are a nation of millions of immigrants and refugees, of hundreds of cultures, languages, and religions, who are bound by one, unwavering, unshakable belief: we are stronger not in spite of our differences, but precisely because of them.</p>\n<p>“We have a proud history of opening our arms – and our borders – to those in need: from Hungarian refugees in the 1950s to Ismaili Muslim refugees in the 1970s to Vietnamese boat people in the 1980s.</p>\n<p>“Today, Canadians continue to open their homes and hearts to refugees fleeing Syria. Since December, Canada has welcomed more than 25,000 Syrian refugees into communities across the country. Another 15,000 privately-sponsored refugees will arrive in Canada by the end of the year because of the compassion and generosity of Canadians.</p>\n<p>“As a country, we have had some deeply regrettable moments, like Komagata Maru, St. Louis, and the Chinese Exclusion Act. But the history of our nation is one in which we constantly challenge ourselves, and each other, to extend our personal definitions of who is a Canadian.</p>\n<p>“As Canadians, let us recognize our responsibility to continue opening our doors and lending a welcoming hand to our most vulnerable neighbours around the world during their time of greatest need. Let us give the refugees who arrive in Canada the opportunity to build a new, more hopeful life for themselves, like Canadians did before us, and Canadians did before them.</p>\n<p>“Today, tomorrow, and all the days to come, let us show the world that Canada truly is the compassionate, generous country that we know it to be.”</p></div>\n      "
}