{
  "path": "/en/news/statements/2022/10/01/statement-prime-minister-womens-history-month",
  "pageTitle": "Statement by the Prime Minister on Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Women’s History Month:</p>\n\n<p>“Throughout our history, women have played an invaluable role in shaping Canada. This October, we mark the 30th&nbsp;anniversary of <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a>, an opportunity to celebrate the outstanding achievements of women in creating a more fair country, and to recognize the work that still needs to be done.</p>\n\n<p>“This year’s theme – She did, so now I can – honours women trailblazers who raised their voices as agents of change in fields where they were under-represented, including the arts, education, and politics, and paved the way for future generations of women and girls to succeed. From women like Rosemary Brown, the first Black woman in Canada to sit in a provincial legislature, who inspired more women to pursue politics, to Sheila Watt-Cloutier, a Nobel Peace Prize nominee and Inuk activist, who identified the link between climate change and human rights, Canada is a better place because of the hard work and determination of these trailblazers.</p>\n\n<p>“We have made a lot of progress since the first Women’s History Month 30 years ago. Thanks to the hard work of activists and feminist movements, women in Canada have the right to choose, paid parental leave, and – in federally regulated workplaces – the right to be paid the same as their counterparts. Earlier this year, the employment rate of women aged 25-54 reached a record high, which is spurring economic growth across the country.</p>\n\n<p>“We must continue to break down systemic barriers for women. That’s why the Government of Canada is delivering on our promise to build a Canada-wide Early Learning and Child Care system, which is helping reduce costs for regulated child care this year and will achieve $10-a-day child care on average from coast to coast to coast in the coming years.</p>\n\n<p>“We are also dedicated to empowering women and girls around the world, which helps reduce poverty and fosters well-being. By continuing to promote gender equality, including through Canada’s <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, we will continue to invest in addressing the root causes of inequality, including access to affordable child care and necessary sexual and reproductive health, and help break down barriers for the next 30&nbsp;years and beyond.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I encourage all Canadians to use the hashtag #WomensHistoryMonth to share and learn more about the women that have shaped, and continue to shape, our country. This month and every month, let’s celebrate the many women making history and building a better Canada for everyone.”</p></div>\n      "
}