{
  "path": "/en/news/news-releases/2017/06/14/prime-minister-announces-intention-introduce-legislation-address",
  "pageTitle": "Prime Minister announces intention to introduce legislation to address historical injustices faced by LGBTQ2 communities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to acknowledge and address the historical injustices experienced by Canadians due to their sexual orientation, gender identity, and gender expression.</p><p>The Prime Minister, Justin Trudeau, today announced that the government will introduce legislation to make it possible to erase the convictions for Canadians who were found guilty under historical, unjust laws for sexual activity with a same sex partner.</p><p>The Prime Minister made the announcement during a ceremony on Parliament Hill where the Pride, Transgender Pride, and Canada 150 Pride flags were raised. The Prime Minister was joined by his Special Advisor on LGBTQ2 issues, MP Randy Boissonnault, other Parliamentarians, and a number of individuals and organizations who play a crucial role in advancing equality.</p><p>This legislation – expected to be introduced later this year – will be another concrete step by the Government of Canada to acknowledge and address injustices faced by LGBTQ2 communities. Other steps include the introduction of legislation to end discrimination on the basis of gender identity and gender expression, and to remove discriminatory <i>Criminal Code</i> provisions regarding consensual sexual activity that are unconstitutional.</p><h2>Quotes</h2><blockquote><p>“Our government believes in equality and equal treatment for all Canadians. That is why we are moving forward on legislation that makes it possible to erase the convictions of Canadians who were unjustly convicted of a crime – simply for who they were, or who they loved.” <br> —&nbsp;<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Today our government announced another vital step in addressing the painful&nbsp;history of discrimination against the LGBTQ2 communities. As Pride season commences, Canadians will honour the many victories over the forces of exclusion, intolerance, and hate. We&nbsp;will also&nbsp;soberly acknowledge that&nbsp;there are many challenges still&nbsp;to overcome. I invite all Canadians to join in remembering the past, celebrating our progress, and working towards a better future.”<br>— <cite>M.P. Randy Boissonnault, Special Advisor to the Prime Minister on LGBTQ2 issues</cite></p></blockquote><h2>Quick facts</h2><ul><li>The Pride Flag was raised on Parliament Hill for the first time in Canada’s history on June 1<sup>st</sup>, 2016.</li><li><a href=\"http://www.parl.ca/LegisInfo/BillDetails.aspx?Language=E&amp;billId=8269852\">Bill C-16</a>, currently being considered by the Senate, would add gender identity and gender expression to the list of prohibited grounds of discrimination in the <i>Criminal Code</i> and <i>Canadian Human Rights Act</i>.</li><li>The Government of Canada has also <a href=\"http://www.parl.ca/LegisInfo/BillDetails.aspx?Language=E&amp;billId=8804045\">introduced measures</a> to repeal Section 159 of the <i>Criminal Code</i> to end its discriminatory impact on consensual same sex sexual activity.</li><li>Share your pride by following <a href=\"https://twitter.com/freetobeme_ca\">@freetobeme_ca</a> on Twitter and using the #FreeToBeMe hashtag.</li></ul><h2>Associated links</h2><ul><li><a href=\"https://www.canada.ca/en/privy-council/news/2017/06/celebrating_differencesthatmakecanadastronger.html\">Celebrating differences that make Canada stronger</a></li><li><a href=\"http://www.canada.pch.gc.ca/eng/1448633333972\">Rights of LGBTQ2 people</a></li></ul></div>\n      "
}