{
  "path": "/en/news/news-releases/2019/04/01/governor-general-canada-visit-rwanda",
  "pageTitle": "Governor General of Canada to visit Rwanda | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will travel to Rwanda from April&nbsp;4 to 9, 2019.</p>\n\n<p>At the invitation of the President of Rwanda, Paul Kagame, the Governor General will attend the ceremony for the 25th commemoration of the Genocide against the Tutsi. During an official ceremony, she will lay a wreath to honour the more than 800,000 victims – Tutsis, moderate Hutus, and others.</p>\n\n<p>Canada recognizes the members of the UN peace support mission in Rwanda, including Canadian peacekeepers and General Roméo Dallaire, who risked their lives to save others and protect those seeking refuge. We remain committed to working with partners to promote international human rights and prevent atrocities like this from ever happening again.</p>\n\n<p>During the visit, the Governor General will also tour&nbsp;the African Institute for Mathematical Sciences, to underline the importance of promoting STEM-related careers for young people so that they are prepared for the jobs of today and tomorrow.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Rwanda have a strong relationship built on a shared commitment to advancing gender equality, protecting the environment, and strengthening peacekeeping. The Governor General’s visit will reaffirm our friendship, and reinforce our shared values and common goals. The Governor General will represent all Canadians when she lays a wreath in honour of the lives lost and forever changed by the genocide against the Tutsi.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be Her Excellency’s second visit to Africa, following a visit to Burkina Faso, Côte d’Ivoire, and Nigeria in October 2018.</li>\n\t<li>During the United Nations General Assembly in September 2018, Prime Minister Trudeau and Rwandan President Kagame led a roundtable discussion with other world leaders on how to help create more good quality jobs and opportunities for young people across Africa.</li>\n\t<li>Canada and Rwanda collaborate on a wide range of issues, including trade and investment, climate change, peacekeeping, and cooperation within multilateral organizations such as the Commonwealth, the United Nations, and La Francophonie.</li>\n\t<li>Earlier this year, Canada hosted international partners to develop new guidance to implement the <a href=\"https://pm.gc.ca/eng/news/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use-child-soldiers\">Vancouver Principles On Peacekeeping and Preventing the Recruitment and Use of Child Soldiers</a>, which have now been endorsed by 79 nations, including Rwanda, around the world.</li>\n\t<li>In 2015, the Kigali Principles were established as a set of commitments on how to better protect civilians in peacekeeping operations. Canada endorsed the Kigali Principles in 2016.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_rwanda.aspx?lang=eng\">Canada – Rwanda Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/news/2017/11/canada_and_rwandaagreetocooperateonenvironmentalprotectionandcli.html\">Canada and Rwanda agree to cooperate on environment protection and climate change</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use-child-soldiers\">Vancouver Principles on Peacekeeping and the Prevention of the Recruitment and Use of Child Soldiers</a></li>\n\t<li><a href=\"http://civilianprotection.rw/\">The Kigali Principles - A Commitment to the Protection of Civilians</a></li>\n</ul></div>\n      "
}