{
  "path": "/en/news/news-releases/2018/06/08/prime-minister-nominates-new-parliamentary-librarian",
  "pageTitle": "Prime Minister nominates new Parliamentary Librarian | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Heather&nbsp;Lank as the new Parliamentary Librarian.</p><p>Dr.&nbsp;Lank has served in increasingly senior roles within the Senate of Canada administration for over 25 years. She is currently the Principal Clerk of the Senate Chamber Operations and Procedure Office, a position she has held since 2015.</p><p>Established in 1876, the Library of Parliament is a fully functioning library whose collection and services support the activities and decisions of Parliament and parliamentarians. The Parliamentary Librarian oversees the management of the Library and reports to the Speakers of the Senate and the House of Commons.</p><p>Dr.&nbsp;Lank was chosen as the nominee for the position of Parliamentary Librarian through the Government’s open, transparent, and merit-based appointment process.</p><h2>Quote</h2><blockquote><p>“Heather Lank’s extensive career in the Senate of Canada administration makes her an outstanding candidate for the position of Parliamentary Librarian. Her knowledge and understanding of Canada’s parliamentary system and services are second-to-none. I know she will do an excellent job managing this important institution that Parliament and all parliamentarians rely on.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Parliamentary Librarian is appointed by the Governor in Council under the <i>Parliament of Canada Act</i>.</li><li>The Library of Parliament contributes to Canadian parliamentary democracy by creating, managing, and delivering authoritative, reliable, and relevant information for both Houses of Parliament. The Library also collects, curates, preserves, and ensures access to historical information about Parliament.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/06/08/heather-lank\">Heather&nbsp;Lank</a></li></ul></div>\n      "
}