{
  "path": "/en/news/statements/2021/07/26/witamakaiwin-awe-kanikanakisic-kigiukuma-aipitikaiwinagin-kanata",
  "pageTitle": "ᐏᑕᒪᑫᐏᐣ ᐊᐍ ᑲᓂᑲᓇᑭᓯᐨ ᑭᒋᐅᑯᒪ ᐁᐱᑎᑫᐏᓇᒋᐣ ᑲᓇᑕ ᓂᐦᓱᒥᑕᓇ ᑲᐃᓇᑭᓯᐨ ᐊᐍ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ, ᒪᐘᐨ ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑌᐻ ᑲᓇᒋ ᒣᕑᐃ ᓴᔨᒪᐣ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓂᑲᓇᑭᓯᐨ ᑭᒋᐅᑯᒪ, ᒐᐢᑎᐣ ᐟᕑᐅᑐ, ᓄᑯᒼ ᑲᑭᔑᑲᓂᐠ ᐅᑭᐸᑭᑎᓇᐣ ᐏᑕᒪᑫᐏᓂᓂ ᐁᐱᑎᑫᐏᓇᒋᐣ ᑲᓇᑕ ᐅᐡᑭ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ, ᒪᐘᐨ ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑌᐻ ᑲᓇᒋ ᒣᕑᐃ ᓴᔨᒪᐣ:</p>\n\n<p>“ᐅᐍ ᐅᒋ ᐅᑯᒪᐏᓇᐠ ᑲᓇᑕ, ᓂᑲᓇᑌᐣᑕᐣ ᐁᑿ ᓂᑭᒋᒥᓂᑯᐢ ᒋᐱᑎᑫᐏᓇᐠ ᑲᓇᑕ ᓂᐦᓱᒥᑕᓇ ᑲᐃᓇᑭᓯᐨ ᐊᐍ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ, ᒪᐘᐨ ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑌᐻ ᑲᓇᒋ ᒣᕑᐃ ᓴᔨᒪᐣ᙮</p>\n\n<p>“ᑲᑭᑕᔑᓂᑕᐏᑯᐨ ᐃᒪ ᓄᓇᐱᐠ, ᑭᐍᑎᓄᐠ ᑯᐯᐠ, ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑲᐯᐦᐃ ᑲᐱᒪᑎᓯᐨ ᐅᑭᐊᓄᐦᑭᑕᒷᐣ ᐃᑵᓂᐘᐣ ᐊᐏᔭᐣ ᑌᑎᐸᐦᐃ ᑲᐃᔑ ᐊᔭᐨ᙮ ᐁᑲᐏᑲ ᑲᒐᑭᐨ ᐁᐊᔭᒥᑕᒷᒋᐣ ᐁᓄᐏᐟ ᐅᒥᓂᑯᓱᐏᓂᐘᓇᐣ ᐁᑿ ᐅᑎᔑᐱᒪᑎᓱᐏᓂᐘᓇᐣ, ᐅᐡᑲᑎᓴᐣ, ᐁᑿ ᐊᐦᑭᓂ, ᑭᒥᓇᑲᓄ ᒥᔑᐣ ᑲᓇᑌᓂᒧᐍᐏᓇᐣ ᐁᑿ ᐏᐣ ᐊᐦᐱᐣ ᒪᐘᐨ ᓂᐡᑕᒼ ᐁᓄᐠ ᑫᔭᐱᑕᐠ ᐃᐍᓂ ᑲᓀᑎᔭᐣ ᐅᑕᔭᒥᑕᒪᑫ᙮</p>\n\n<p>“ᒥᓯᐍ ᐱᑯ ᐃᒪ ᑲᑭᔑᑭᒋ ᐊᓄᐦᑭᐨ, ᑲᑭᒋᓀᐣᑕᒧᓯᐨ ᐅᑭᓇᑯᑐᐣ ᑲᑭᔑᑭᒋᓀᐣᑕᐠ ᐃᐍᓂ ᒋᐃᓄᓭᓂᑭᐣ ᐘᐏᒋᐏᑐᐏᓇᐣ, ᐊᓄᐦᑭᐏᐱᒧᒋᑫᐏᓇᐣ, ᐁᑿ ᐊᐏᔭᐠ ᐅᒥᓂᑯᓱᐏᓂᐘᐣ ᐃᓯᓭᐏᓇᐣ᙮ ᐅᑭᓂᑲᓂᑕᓇᐣ ᑫᐏᒋ ᒪᐡᑲᐃᒋᑲᑌᓂᑭᐣ ᑲᐃᔑᐘᐏᒋᐏᑐᐘᒋᐣ ᐃᑵᓂᐘᐠ ᐊᐏᔭᐠ ᐃᒪ ᐘᐦᓴ ᑭᐍᑎᓄᐠ ᐃᓀᑫ, ᐃᒪ ᑲᔦ ᒥᓯᐍ ᐱᑯ ᐊᐦᑭᐠ ᐁᑿ ᒥᓯᐍ ᑭᓂᑿᓂ ᐊᐦᑭᐠ᙮ ᐃᐍᓂ ᐃᓇᑭᓯᐨ ᑲᓇᑕ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ ᐁᑿ ᑲᔭᐱᑕᑭᐣ ᑭᑕᐦᑭᒥᓇᐣ ᐅᓇᑯᓂᑫᐏᓇᐣ ᐁᑿ ᐱᒧᒋᑫᐏᑲᒥᑯᐣ, ᓂᑭᑫᐣᑕᐣ ᒋᐏᒋᑢᐨ ᐃᐍᓂ ᑲᐃᔑ ᐸᐸᑲᐣ ᑿᔭᒋ ᑭᑫᐣᑕᑭᐣ ᑫᑯᓇᐣ ᐁᑿ ᑲᐃᔑᐘᐸᑕᑭᐣ ᑫᑯᓇᐣ ᑫᐏᒋ ᓂᐸᐏᑕᒷᒋᐣ ᑲᑭᓇ ᑲᓀᑎᔭᓇᐣ ᐃᒪ ᒥᓯᐍ ᑲᐃᔑ ᐸᑲᑲᓂᓇᑯᓯᐘᒋᐣ, ᐅᒪ ᑲᐃᔑᑲᐯᔑᐘᒋᐣ ᐁᑿ ᓂᑲᑌ ᑲᔦ ᑲᔭᐘᒋᐣ, ᑲᓇᑌᐣᑕᑯᓱᐏᓂᐠ ᐁᑿ ᑭᒋᓀᐣᑕᑯᓱᐏᓂᐠ, ᐁᑿ ᐃᒪ ᑲᔦ ᑲᓇᑕ ᑲᐃᔑ ᓂᔑᑭᐣ ᑲᔭᐸᑕᑭᐣ ᐃᔑᑭᔑᐍᐏᓇᐣ᙮ ᓂᑌᐻᔦᓂᒪ ᑲᔦ, ᐃᐍ ᑲᓇᑕ ᑲᓂᑲᓂ ᐅᑯᒪᐏᐘᑭᓯᐨ, ᐅᑲᔭᓄᐦᑲᑕᐣ ᒋᐏᒋᐦᐊᒋᐣ ᑲᒪᐡᑲᐍᓂᒧᓂᐨ ᐃᑵᓂᐘᐣ ᐃᒪ ᑲᓀᑎᔭᐣ ᓄᑎᓂᑫᐏᓂᐠ ᐱᒧᒋᑫᐏᐣ ᑲᐃᔑ ᑭᒋᐸᐸᑭᑎᐣᑎᓯᐘᐨ ᑫᐏᒋ ᒥᓄᓭᓂᐨ ᐁᑿ ᑫᐏᒋᒥᓄᔭᓂᐨ ᑲᑭᓇ ᐅᒪ ᑭᑕᐦᑭᒥᓇᐣ ᐁᑿ ᑭᑕᓂᔑᓂᓂᒥᓇᓇᐠ᙮</p>\n\n<p>“ᓂᑐᒋᑭᒋᓀᐣᑕᐣ ᑕᐡ ᐅᐍ ᒪᐘᐨ ᑲᐏᒋᑭᒋᓀᐣᑕᑿᐠ ᑲᐃᓯᓭᐠ ᓄᑯᒼ, ᒣᑿᐨ ᐅᐍ ᑭᑕᐦᑭᒥᓇᐣ ᐁᓇᑭᐡᑲᑯᔭᑭᐣ ᑭᒋ ᐊᓂᒥᓭᐏᓇᐣ ᑌᐻ ᑲᑭᐱ ᐃᓯᓭᑭᐣ ᐅᑕᓇᐠ ᐅᒪ᙮&nbsp; ᓂᑭᑫᐣᑕᐣ ᑕᐡ, ᐅᐘᐍ ᓂᐡᑕᒼ ᑲᓇᑕ ᐊᓂᔑᓂᓂᐏ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ, ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑕᐸᑭᑎᐣᑎᓯ ᒋᐏᒋᐦᐃᑯᔭᐠ ᓇᑭᐡᑲᒪᑭᐣ ᐅᑵᓂᐘᐣ ᑌᐻᐏᓇᐣ ᒪᒪᐅ, ᒋᒪᒪᐅ ᐱᒧᓭᔭᐠ ᐃᒪ ᒪᒥᓄᓂᑫᐏᓂᐠ, ᐁᑿ ᐊᔓᑲᓇᐠ ᒋᐏᔑᐦᐊᑲᓄᐘᒋᐣ ᑫᐏᒋ ᒪᒪᐏᐡᑲᓂᐘᐠ ᐃᑵᓂᐘᐠ ᑲᑭᓇ ᐊᐏᔭᐠ ᐅᒪ ᑭᑕᐦᑭᒥᓇᐠ ᑲᐃᔑᓂᑲᑕᒧᐘᒋᐣ ᓂᑲᐯᔑᐏᓂᓇᐣ᙮</p>\n\n<p>ᓄᑯᒼ ᑲᑭᔑᑲᐠ, ᓂᑭᑭᓇᐘᐸᒪᒥᐣ ᐊᐍ ᑲᓇᒋ ᑭᒋᐅᑯᒪᑵ ᐁᓫᐃᓴᐯᐟ II, ᐅᑯᒪᑵ ᐅᒪ ᑲᓇᑕ, ᐊᔕ ᓂᑯᑢᓱᒥᑕᓇ ᓴᑲᓱᔕᑊ ᐊᐦᑭ ᑲᑭᐱ ᐊᐱᑕᐠ ᐃᐍᓂ ᐊᐦᑭᓂ ᐁᑿ ᐊᐏᔭᐣ ᐸᔭᑕᑫᓂᒧᐏᓂᐠ, ᑲᓇᑌᓂᒧᐏᓂᐠ, ᐁᑿ ᑭᒋᑭᑫᐣᑕᒪᐏᓂᐠ᙮ ᐊᒥᐍ ᐊᔕ ᓂᐦᓱᔕᑊ ᑕᐦᓯᐣ ᐁᐘᐍᓇᐦᓴᑲᓄᐘᒋᐣ ᐃᑵᓂᐘᐠ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪᐠ ᐅᒪ ᑲᐣᑕ ᐊᐍ ᐅᒋ ᑲᓇᒋᐦᐊ ᐊᐦᐱᐣ ᑲᑭᒪᒋᐊᐱᑕᑭᐸᐣ ᐃᐍᓂ ᑭᒋ ᐅᑯᒪᐏ ᑌᓴᐳᐏᓂᓂ ᒣᑿᐨ ᑲᑭᔭᐦᑭᐘᐠ 1952᙮</p>\n\n<p>“ᓂᓇᓇᑯᒪ ᐊᐍ ᑲᑭᒋᓀᐣᑕᑯᓯᐨ ᑌᐻ ᑲᓇᒋ ᒣᕑᐃ ᓴᔨᒪᐣ ᑲᐏᑕᐱᓇᐠ ᐅᐍᓂ ᒋᔭᐱᑕᐠ ᐁᑿ ᓂᒥᓇ ᒪᐘᐨ ᐁᔕᐍᐣᑕᒷᐠ ᐁᓇᓇᑯᒪᐠ ᐃᐍᓂ ᑲᑌᐱᓇᐠ᙮ ᓂᓇᑐᒪᐠ ᑲᑭᓇ ᑲᓀᑎᔭᓇᐠ ᒋᒥᐦᑲᒧᐘᐨ ᐸᑯᓭᓂᒧᓂ ᐁᑿ ᑭᒋᓀᐣᑕᒧᐏᓂᓂ ᐅᐍᓂ ᐅᒋ ᑲᑭᒋᓀᐣᑕᑿᐠ ᓂᑲᓂᐠ ᐁᐃᔑ ᑕᑯᑭᓇᓂᐘᐠ ᐅᒪ ᑭᑕᐦᑭᒥᓇᐠ, ᐁᑿ ᐏᒋᐏᔑᐠ ᒋᐸᑯᓭᐣᑕᒷᔭᐠ&nbsp; ᒋᐏᒥᓄᓭᐨ ᒣᑿᐨ ᐱᑐᐨ ᑲᐃᔑᐘᐸᑕᐠ ᑫᐃᔑᒥᓄᓭᓂᐠ, ᑫᐃᔑ ᑕᐱᑕᐏᓭᐠ, ᐁᑿ ᐊᐘᔑᒣ ᑫᐃᔑ ᑌᐻᐏᓇᑿᐠ ᑲᓇᑕ ᐅᒪ ᑭᑕᐦᑭᒥᓇᐠ ᒪᐘᐨ ᑲᐃᔑ ᐃᐡᐸᐠ ᐁᑿ ᑫᑌᔭᐠ ᐅᑯᒪᐏᑲᒥᐠ᙮”</p>\n\n<h2>ᑲᐃᔑᓇᓇᐱᓭᑭᐣ ᑎᐸᒋᒧᐏᓇᐣ ᒪᒪᑕᐘᐱᑯᐠ</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">ᑲᓂᑲᓇᑭᓯᐨ ᑭᒋᐅᑯᒪ ᐅᐏᑕᐣ ᐅᑯᒪᑵ ᑲᑭᐏᑕᐱᓇᐠ ᐃᐍᓂ ᑲᓇᑕ ᑯᑕᐠ ᐅᑯᒪᐏᓇᐠ ᑭᒋᐅᑯᒪ</a></li>\n</ul></div>\n      "
}