{
  "path": "/en/news/news-releases/2017/05/15/prime-minister-nominates-new-commissioner-official-languages",
  "pageTitle": "Prime Minister nominates new Commissioner of Official Languages | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of <a href=\"/en/news/backgrounders/2017/05/15/biographical-notes-–-madeleine-meilleur\">Madeleine&nbsp;Meilleur</a> as the new Commissioner of Official Languages.&nbsp;</p><p>For over twenty-five years, Ms. Meilleur has dedicated herself to improving the lives, and protecting the rights, of Canadians living in official language minority communities.</p><p>As the Commissioner of Official Languages, Ms. Meilleur will be responsible for ensuring the full recognition and widespread use of English and French within Canadian society, as well as within federal institutions and other organizations subject to the <i>Official Languages Act.</i></p><p>After working as a registered nurse and earning her law degree from the University of Ottawa, Ms. Meilleur served as a member of municipal councils between 1991 and 2003. During that time, she worked tirelessly to promote Francophone rights and services. She continued this work in the provincial legislature where, among other duties, she served as Minister Responsible for Francophone Affairs from 2003 to 2016. As one of Canada’s longest-serving Ministers of Francophone Affairs, she improved conditions and services for the Francophone minority community in Ontario, and oversaw several accomplishments that were widely recognized nationally.</p><p>Under the <i>Official Languages Act</i>, this appointment must be approved by the House of Commons and the Senate. The Government today tabled, pursuant to Standing Order 111.1, this proposed appointment in the House of Commons for referral to the Standing Committee on Official Languages. <span lang=\"EN-US\" xml:lang=\"EN-US\">The Standing Committee will have 30 days to examine the proposed candidacy and report back to the House of Commons. The House will be called upon to vote on the appointment</span>. The Government will also table a motion in the Senate seeking its approval of this appointment.</p><h2>Quote</h2><blockquote><p>“Madeleine Meilleur is an outstanding choice to be Canada’s next Commissioner of Official Languages. She is a dedicated advocate for official language minority communities, and has been for over twenty-five years. With her extensive experience and accomplished track record, I know Ms. Meilleur will be a tenacious advocate for both Francophone and Anglophone minority communities. She will bring a deep understanding and enormous dedication to this position, and will hold our government to account for the full implementation of the <i>Official Languages Act</i>.”<br>— <cite>The Right Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>During her 13-year tenure as Ontario’s Minister Responsible for Francophone Affairs, Ms. Meilleur oversaw several important accomplishments, including:<ul><li>the recent expansion of the Montfort Hospital;</li><li>the creation of the position of Commissioner for French Language Services;</li><li>the establishment of a provincial Advisory Committee on Francophone Affairs,</li><li>the increased number of institutions and regions across the province designated for French language service;</li><li>the setting of a 5% target for Francophone immigration to Ontario; &nbsp;</li><li>the designation of September 25<sup>th</sup> as Franco-Ontarian Day; and,</li><li>the commemorations of the 400<sup>th</sup> anniversary of French presence in Ontario in 2015.</li></ul></li><li>The Office of the Commissioner of Official Languages was created in 1970 under the <i>Official Languages Act</i> to protect and promote linguistic duality.</li><li>The Commissioner of Official Languages reports directly to Parliament.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/05/15/biographical-notes-–-madeleine-meilleur\">Biographical notes – Madeleine Meilleur</a></li></ul></div>\n      "
}