{
  "path": "/en/news/news-releases/2023/04/01/new-support-available-today-make-life-more-affordable-canadians",
  "pageTitle": "New support available today to make life more affordable for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Across the country, families are struggling with the rising cost of living. The Government of Canada is providing targeted support to those who need it most, and we are going to keep delivering much-needed relief to the middle class and people working hard to join it.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted various federal initiatives that will help make life more affordable for Canadians today.</p>\n\n<p>As of today:</p>\n\n<ul><li>The federal minimum wage is increasing from $15.55 to $16.65 per hour, to keep pace with inflation;</li>\n\t<li>Canada Student Loans and Canada Apprentice Loans, including those currently being repaid, become permanently interest-free;</li>\n\t<li>Financial institutions can be able to start offering the Tax-Free First Home Savings Account, to help Canadians save up to $40,000 tax-free for their first home;</li>\n\t<li>Quarterly Climate Action Incentive payments increase for people in provinces where the federal price on pollution currently applies;</li>\n\t<li class=\"pf0\">Eligible low and median income homeowners can receive up to $10,000 toward a new energy efficient heat pump through the Oil to Heat Pump Affordability Program.</li>\n</ul><p>These newly available support measures build on a wide range of other investments and initiatives from the federal government to put more money back in the pockets of Canadians. These include doubling the GST Credit for six months, providing dental care for more than 250,000 kids, and delivering a one-time tax-free payment of $500 for low-income renters.</p>\n\n<p>Earlier this week, we released <em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em>, which lays out our plan to build a stronger, more sustainable, and more secure Canadian economy for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“From creating the Canada Child Benefit, which puts more money in the pockets of nine out of 10 families, to providing dental coverage for kids and making housing more affordable, our government has always been focused on putting more money back in the pockets of Canadians. The changes announced today will continue to deliver much-needed relief now.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>The federal government already provided increased support for students by temporarily doubling Canada Student Grants until July 2023. By permanently waiving interest on Canada Student Loans and Canada Apprentice Loans, an average student loan borrower will save $520 per year, based on current interest rates. New enhancements proposed in Budget&nbsp;2023 will allow students to access up to $14,400 in federal support for the upcoming school year – an increase of $1,260.</li>\n\t<li>Introduced in Budget&nbsp;2022, the Tax-Free First Home Savings Account works like a Registered Retirement Savings Plan (RRSP), offering contributions that are tax-deductible, with withdrawals to purchase a first home – including investment income – being non-taxable, like a Tax-Free Savings Account (TFSA).</li>\n\t<li>Direct proceeds from the federal pollution pricing system are returned to the jurisdictions where they were collected. Proceeds from the federal fuel charge are returned to Canadians through Climate Action Incentive payments. These payments mean about eight out of 10 families receive more money back than they pay under this system. This year a family of four can expect to receive the following quarterly payments: &nbsp;\n\t<ul class=\"bulletOutline\"><li>$386 in Alberta, $264 in Manitoba, $244 in Ontario, $340 in Saskatchewan, $328 in Newfoundland and Labrador, $248 in Nova Scotia, and $240 in Prince Edward Island.</li>\n\t\t<li>Since the federal fuel charge will only come into effect as of July 1, 2023, in Newfoundland and Labrador, Nova Scotia, and Prince Edward Island, residents of these provinces will receive&nbsp;three&nbsp;equal quarterly payments this fiscal year instead of four but will receive four payments in the following year.</li>\n\t</ul></li>\n\t<li>Heat pumps are one of the best ways for homeowners to get off home heating oil – saving money on energy bills and fighting climate change in the process. When compared with other electric home heating sources, they are also two to three times more efficient. On average, homeowners who switch from oil to cold-climate heat pumps to heat and cool their homes save between $1,500 and $4,700 per year on home energy bills.</li>\n\t<li>With these and other previously or newly announced federal government initiatives, here are some examples of how we are making life more affordable for Canadians across the country this year:\n\t<ul class=\"bulletOutline\"><li>A family with one child in Ontario, with income of $85,000, in 2023 could benefit from about $11,300 as a result of reduced child care costs, the Canada Child Benefit, the Canada Dental Benefit, tax relief from an increased Basic Personal Amount, and increased Climate Action Incentive payments.</li>\n\t\t<li>A single parent with one child in Newfoundland and Labrador, with income of $40,000 in 2023, could benefit from $7,300 as a result of reduced child care costs, the Canada Child Benefit, enhancements to the Canada Workers Benefit, the Canada Dental Benefit, the proposed Grocery Rebate, tax relief from an increased Basic Personal Amount, and increased Climate Action Incentive payments.</li>\n\t\t<li>A 76-year-old senior in British Columbia with a maximum Guaranteed Income Supplement (GIS) entitlement could receive more than $2,000 in additional support in 2023, thanks to the proposed Grocery Rebate, the GIS top-up increase for single seniors from 2016, and the increase in the Old Age Security pension for seniors aged 75 and older.</li>\n\t\t<li>A low-income student in Manitoba could receive more than $5,600 in additional support in 2023 thanks to proposed enhancements to Canada Student Grants and Canada Student Loans, the proposed Grocery Rebate, and increased Climate Action Incentive payments. If they have a disability or dependents, they could receive an additional $12,800 in specialized student grants, plus an extra $640 per dependent. After graduating, all of their federal student loans will be interest-free, with repayment assistance if their income is below $40,000 per year.</li>\n\t</ul></li>\n</ul><h2>Related Product</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/making-life-more-affordable.html\">Budget&nbsp;2023 Backgrounder: Making Life More Affordable</a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2023/03/28/government-canada-releases-budget-2023\">Government of Canada releases Budget&nbsp;2023</a></li>\n\t<li><em><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\">Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</a></em></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2023/03/federal-minimum-wage-rising-to-1665-on-april-1.html\">Federal minimum wage rising to $16.65 on April 1</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/benefits/education/student-aid.html\">Student aid</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/tax/individuals/topics/first-home-savings-account.html\">First Home Savings Account (FHSA)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/cai-payment.html\">Climate action incentive payment</a></li>\n</ul></div>\n      "
}