{
  "path": "/en/news/news-releases/2020/07/06/prime-minister-appoints-bob-rae-ambassador-united-nations",
  "pageTitle": "Prime Minister appoints Bob Rae as Ambassador to the United Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Bob Rae as the Ambassador and Permanent Representative of Canada to the United Nations (UN) in New York.</p>\n\n<p>Mr. Rae brings a wealth of experience to the role, most recently serving as Canada’s Special Envoy on Humanitarian and Refugee Issues, building on his earlier work as Canada’s Special Envoy to Myanmar. In these positions, Mr. Rae closely collaborated with the UN and the international community to help lead Canada’s efforts to address pressing humanitarian and refugee issues around the world.</p>\n\n<p>Mr. Rae will succeed Marc-André Blanchard as Canada’s Permanent Representative to the UN in New York. Mr. Blanchard, who informed the Prime Minister of his intention to leave his post earlier this year, served as a strong voice for innovation and reform at the UN. He also helped develop Canada’s leading role in international discussions on financing the UN’s Sustainable Development Goals, including most recently in the context of the global response to the coronavirus. Mr. Blanchard also sought to better integrate the UN’s work on development and security issues, and contributed to Canada’s expanded engagement with many regional partners. After more than four years of service, Mr. Blanchard leaves his role having made a significant contribution to both the UN and advancing Canada’s place in the world.</p>\n\n<p>Mr.&nbsp;Rae will build on the work of the outgoing Ambassador to help advance Canada’s interests abroad, including to further sustainable development and address the impacts of climate change. We will continue to engage our international partners and promote the Canadian values of peace, freedom, democracy, and human rights as we move forward in a time of global uncertainty.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“After more than four years of service to our country and the global community, I thank Marc-André Blanchard as he leaves his post as Canada’s Ambassador to the United Nations. His dedication played a vital role in advancing global cooperation, and helped Canada re-engage with partners to increase our place in the world and contribute to our efforts to help tackle the most important challenges of our time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Bob Rae has dedicated his life to serving Canadians and our country, and his experience and thoughtful approach will serve us well in this new role as our Ambassador to the United Nations. Together, we will strengthen our international relationships and continue to fully engage on the world stage to help build a better future that benefits everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>As a founding member of the UN, Canada is committed to the guidance provided in the UN Charter to maintain international peace and security, develop friendly relations among nations, and achieve cooperation to solve global problems.</li>\n\t<li>One of Canada’s key priorities is protecting and enhancing the rules-based international order by championing values of inclusive and accountable governance, including by promoting human rights, women’s empowerment and gender equality, peaceful pluralism, and by fighting inequalities and climate change.</li>\n\t<li>The Permanent Mission of Canada delivers on Canada’s foreign policy priorities at the UN Headquarters in New York City.</li>\n\t<li>In October 2017, Prime Minister Justin Trudeau appointed the Honourable Bob Rae as Canada’s Special Envoy to Myanmar to reinforce the urgent need to resolve the humanitarian and security crisis in the country. In March 2020, he was appointed as Canada’s Special Envoy on Humanitarian and Refugee Issues.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/07/06/honourable-bob-rae\">Bob Rae</a></li>\n</ul></div>\n      "
}