{
  "path": "/en/news/news-releases/2018/10/16/governor-general-canada-visit-burkina-faso-cote-divoire-and-nigeria",
  "pageTitle": "Governor General of Canada to visit Burkina Faso, Côte d'Ivoire, and Nigeria | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency the Right Honourable Julie Payette, Governor General of Canada, will visit Burkina Faso, Côte d’Ivoire, and Nigeria, from October 23 to 30, 2018.</p><p>The state visit is an opportunity for the Governor General to meet with national leaders, and deepen Canada’s relationships with these three countries.</p><p>The Governor General will begin the visit in Burkina Faso, where she will give an address at the National Assembly. She will also visit a school, where she will underscore the importance of inclusive, equitable, and quality education for all, and highlight how Canada and Burkina Faso are working together to build strong education systems. She will also meet with students of a scientific secondary school, as well as researchers, Canadian development workers, and Burkinabè artisans.</p><p>In Côte d’Ivoire, the Governor General will visit a Canadian-funded initiative, which helps cocoa farmers adapt to a changing climate and grow their incomes. She will also deliver remarks at a higher education institution specialized in engineering.</p><p>The visit will conclude in Nigeria, where the Governor General will take part in several science, technology, and cultural events. She will meet with young people to highlight the central role that science, technology, and innovation play in addressing the challenges we face as a world.</p><h2>Quote</h2><blockquote><p>“Canada enjoys close relationships with Burkina Faso, Côte d’Ivoire, and Nigeria. The Governor General’s visit is an excellent opportunity to deepen our partnerships,&nbsp;promote access to quality education for all, and inspire young people to become science and technology leaders.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>This will be the Governor General’s first visit to countries in Africa. The last Governor General to visit the continent was the Right Honourable David&nbsp;Johnston in 2013.</li><li>During the United Nations General Assembly in September 2018, Prime Minister Trudeau, with UK Prime Minister Theresa May, Ghana President Nana Addo Dankwa Akufo-Addo, and Rwanda President Paul Kagame led a roundtable discussion on ways to help create more good quality jobs and opportunities for young people across Africa. The Governor General will continue to carry forward momentum on the important issues discussed at this roundtable.&nbsp; &nbsp; &nbsp;&nbsp;</li><li>Canada is a top foreign private investor in Burkina Faso. In 2017, Canadian mining assets in the country were evaluated at $2.2 billion. In 2017, bilateral merchandise trade with Burkina Faso reached $59 million and is increasing. Canada and Burkina Faso partner in development assistance ($57.1 million in 2016-2017), with a particular focus on education and gender equality.</li><li>In 2017, Canadian exports to Côte d’Ivoire totaled $38.5&nbsp;million, while imports from Côte d’Ivoire reached $319.9 million, notably cocoa and petroleum products. There is a growing number of Canadian companies seeking business opportunities in Côte d’Ivoire as well as with the African Development Bank, headquartered in Abidjan.</li><li>Nigeria is Canada’s largest bilateral merchandise two-way trading partner in Sub-Saharan Africa, with two-way trade totaling $1.47 billion in 2017. Canada’s exports to Nigeria totaled $434.6 million – making Nigeria our third-largest export market in Africa. Nigeria is also the largest African investor in Canada. Nigeria is a long-standing partner of Canada in development assistance ($110 million in 2016-2017), with programming focused on the health and rights of women and girls, the promotion of growth that benefits everyone and the provision of humanitarian assistance.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/burkinafaso/bilateral_relations_bilaterales/Canada-Burkina_Faso.aspx?lang=eng\">Canada – Burkina Faso relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/cotedivoire/bilateral_relations_bilaterales/canada_cotedivoire.aspx?lang=eng\">Canada – Côte d'Ivoire relations</a></li><li><a href=\"http://www.canadainternational.gc.ca/nigeria/bilateral_relations_bilaterales/canada_nigeria.aspx?lang=eng\">Canada – Nigeria relations</a></li></ul></div>\n      "
}