{
  "path": "/en/news/news-releases/2018/11/03/prime-minister-visits-tsilhqotin-nation-personally-deliver-statement",
  "pageTitle": "Prime Minister visits Tŝilhqot’in Nation to personally deliver statement of exoneration | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Acknowledging past mistakes is an important part of renewing the relationship between Canada and Indigenous peoples. By coming together in a spirit of cooperation and affirming our respect and recognition of Indigenous rights, we can make real, meaningful progress toward reconciliation, to the benefit of all Canadians.</p><p>The Prime Minister, Justin Trudeau, yesterday met with members of the Tŝilhqot’in Nation on their title land to deliver, in person, a statement of exoneration of six Tŝilhqot’in chiefs. The statement was originally delivered by the Prime Minister in the House of Commons on March 26, 2018.</p><p>The posthumous exoneration of all six Tŝilhqot’in chiefs – Chief Lhats’asʔin, Chief Biyil, Chief Tilaghed, Chief&nbsp;Taqed, Chief&nbsp;Chayses, and Chief&nbsp;Ahan – demonstrates the Government of Canada's commitment to meaningful reconciliation.</p><p>During the visit, Prime Minister Trudeau, Minister of Crown-Indigenous Relations Carolyn Bennett, and members of the Tŝilhqot’in Nation confirmed their shared priorities and vision for the future by signing a pathway letter. The letter outlines commitments to reach milestones on the path to self-determination. Canada also commits to work with the Tŝilhqot’in Nation to address housing and infrastructure needs in the Tŝilhqot’in communities.</p><p>The visit marked an important step forward to recognize and implement the rights of the Tŝilhqot’in Nation.</p><h2>Quotes</h2><blockquote><p>“It was important to me to meet members of the Tŝilhqot’in Nation and deliver in person the statement of exoneration of six chiefs – heroes of this Nation – who were treated and tried as criminals. Together, with the Tŝilhqot’in leaders, elders, and youth, we can build a new relationship – based on respect, recognition of rights, collaboration, and partnership – and realize a better future for the Tŝilhqot’in peoples, for all of Canada, and for the generations that will follow.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“As Tŝilhqot’in representatives, we are honoured to be hosting the Prime Minister on our declared Aboriginal title lands. This event is about healing. It will be a day marked in the history books for the Tŝilhqot’in Nation and all of Canada. On March 26,<sup>, </sup>2018, we were in the Prime Minister’s government house, yesterday – for the first time in Canadian history – the Prime Minister was in our government house.”<br>—<cite>Chief Joe Alphonse, Tribal Chairman, Tŝilhqot’in National Government</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The six Tŝilhqot’in chiefs were leaders and warriors who acted in accordance with their laws and traditions. They fought against the colonial government of the time, which ultimately led to their hanging in 1864 and 1865.</li><li>Today, the Tŝilhqot’in people, including the descendants of those six war chiefs, continue to live and care for Tŝilhqot’in lands. They have continued to fight to preserve their territory and culture, right up to and since the historic Supreme Court of Canada decision of June 26, 2014, which recognized Aboriginal title for the Tŝilhqot’in Nation.</li><li>A Letter of Understanding between Canada and the Tŝilhqot’in Nation was signed in January 2017, marking another step toward reconciliation and recognition of our nation-to-nation relationship.</li><li>The Government of Canada has committed to working with the Tŝilhqot’in Nation to address housing and infrastructure needs in its communities and is continuing to work with the Tŝilhqot’in Nation on additional priorities.&nbsp;</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/03/26/prime-minister-delivers-statement-exoneration-six-tsilhqot’-chiefs\">Prime Minister delivers a statement of exoneration for six Tŝilhqot’in Chiefs</a></li><li><a href=\"https://scc-csc.lexum.com/scc-csc/scc-csc/en/item/14246/index.do\">Tŝilhqot’in Nation v. British Columbia</a></li><li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1493905807283/1529500971080\">Letter of Understanding Between the Tŝilhqot’in Nation and Canada: January 27, 2017</a></li><li><a href=\"/en/news/news-releases/2018/02/14/government-canada-create-recognition-and-implementation-rights\">Government of Canada to create Recognition and Implementation of Rights Framework</a></li></ul></div>\n      "
}