{
  "path": "/en/news/statements/2022/02/25/statement-nato-heads-state-and-government-russias-attack-ukraine",
  "pageTitle": "Statement by NATO Heads of State and Government on Russia’s Attack on Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We have met today to discuss the gravest threat to Euro-Atlantic security in decades. We condemn in the strongest possible terms Russia’s full-scale invasion of Ukraine, enabled by Belarus. We call on Russia to immediately cease its military assault, to withdraw all its forces from Ukraine and to turn back from the path of aggression it has chosen. This long-planned attack on Ukraine, an independent, peaceful and democratic country, is brutal and wholly unprovoked and unjustified. We deplore the tragic loss of life, enormous human suffering and destruction caused by Russia’s actions. Peace on the European continent has been fundamentally shattered. The world will hold Russia, as well as Belarus, accountable for their actions. We call on all states to condemn this unconscionable attack unreservedly. No one should be fooled by the Russian government’s barrage of lies.</p>\n\n<p>Russia bears full responsibility for this conflict. It has rejected the path of diplomacy and dialogue repeatedly offered to it by NATO and Allies. It has fundamentally violated international law, including the UN Charter. Russia’s actions are also a flagrant rejection of the principles enshrined in the NATO-Russia Founding Act: it is Russia that has walked away from its commitments under the Act. President Putin’s decision to attack Ukraine is a terrible strategic mistake, for which Russia will pay a severe price, both economically and politically, for years to come. Massive and unprecedented sanctions have already been imposed on Russia. NATO will continue to coordinate closely with relevant stakeholders and other international organisations including the EU.&nbsp; At the invitation of the Secretary General, we were joined today by Finland, Sweden and the European Union.</p>\n\n<p>We stand in full solidarity with the democratically elected president, parliament and government of Ukraine and with the brave people of Ukraine who are now defending their homeland. Our thoughts are with all those killed, injured and displaced by Russia’s aggression, and with their families. NATO remains committed to all the foundational principles underpinning European security, including that each nation has the right to choose its own security arrangements.&nbsp; We will continue to provide political and practical support to Ukraine as it continues to defend itself and call on others to do the same. We reaffirm our unwavering support for the independence, sovereignty and territorial integrity of Ukraine within its internationally recognised borders, including its territorial waters. This principled position will never change.</p>\n\n<p>In light of Russia’s actions, we will draw all the necessary consequences for NATO’s deterrence and defence posture. Allies have held consultations under Article 4 of the Washington Treaty. We will continue to take all measures and decisions required to ensure the security and defence of all Allies. We have deployed defensive land and air forces in the eastern part of the Alliance, and maritime assets across the NATO area. We have activated NATO’s defence plans to prepare ourselves to respond to a range of contingencies and secure Alliance territory, including by drawing on our response forces. We are now making significant additional defensive deployments of forces to the eastern part of the Alliance. We will make all deployments necessary to ensure strong and credible deterrence and defence across the Alliance, now and in the future. Our measures are and remain preventive, proportionate and non-escalatory.</p>\n\n<p>Our commitment to Article 5 of the Washington Treaty is iron-clad. We stand united to protect and defend all Allies. Freedom will always win over oppression.</p></div>\n      "
}