{
  "path": "/en/news/readouts/2022/06/27/prime-minister-justin-trudeau-meets-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of the European Commission, Ursula von der Leyen, on the margins of the G7 Summit.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen discussed Russia’s illegal and unjustifiable invasion of Ukraine and agreed on the critical importance of continued military, financial, and humanitarian support to the Ukrainian government and people as well as support for Ukraine’s reconstruction. Prime Minister Trudeau welcomed the recent decision by European Union (EU) members to grant candidate status to Ukraine.</p>\n\n<p>The leaders expressed their shared concerns for the wider impacts of Russia’s military aggression against Ukraine, including for the Global South, through shortages and rising prices of food, fuel, and fertilizer, and committed to working together to find practical ways to mitigate impacts, especially for the most vulnerable. The Prime Minister and President stressed the importance of advancing green energy transition as an essential part of the solution to reducing European dependence on Russian oil and gas.&nbsp;</p>\n\n<p>The two leaders confirmed President von der Leyen’s visit to Canada in September to secure key partnerships on energy security, critical minerals, and clean tech that will accelerate Canada and the EU’s transition toward green and sustainable economies. They discussed the significant contribution of the Canada-European Union Comprehensive Economic and Trade Agreement in facilitating bilateral trade and job creation in both Canada and the EU, and agreed to prioritize its ratification.&nbsp;&nbsp;</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}