{
  "path": "/en/news/statements/2017/04/23/statement-prime-minister-canada-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister of Canada on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week, which takes place from April 23 to 29, 2017:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Every year, almost 13 million Canadians across the country volunteer their time, energy, and talent to help improve the well-being of others and make Canada an even greater place to live.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“National Volunteer Week is a time to celebrate Canadian volunteers and thank them for the selfless work they do to help those around them. As we mark the 150th anniversary of Confederation in 2017, we honour the essential contributions volunteers make to our country, this week and throughout the year.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This year’s theme –<i>Volunteering, eh? How do you recognize volunteering in 2017?</i> –</span><span lang=\"EN-US\" xml:lang=\"EN-US\">encourages us to celebrate the many acts of generosity that Canadians carry out each day. Whether cleaning up our shorelines, tutoring young people after school, or preparing a meal for Canadians in need, volunteers remind us that our commitment to support each other makes us who we are as a country.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“The Government of Canada is proud to honour the contributions of these exceptional individuals through Canada’s Volunteer Awards. Canada’s communities are stronger and more inclusive thanks to the efforts and dedication of our countless volunteers.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, </span>I invite all Canadians to take the time this week to thank a volunteer who is making a difference in your community by using the hashtags #MakeADifference and #NVW2017.<span lang=\"EN-US\" xml:lang=\"EN-US\">”</span></p><p><b>Associated Links </b></p><p><a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards.html?utm_source=various&amp;utm_medium=vanity_url&amp;utm_campaign=cva16_17\"><span lang=\"EN-US\" xml:lang=\"EN-US\">Canada’s Volunteer </span><span lang=\"EN-US\" xml:lang=\"EN-US\">Awards</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> Program<br></span></a><a href=\"https://volunteer.ca/nvw2017\"><span lang=\"EN-US\" xml:lang=\"EN-US\">Volunteer Canada</span></a></p></div>\n      "
}