{
  "path": "/en/news/news-releases/2020/03/06/inuit-crown-partnership-committee-continues-progress-shared",
  "pageTitle": "Inuit-Crown Partnership Committee continues progress on shared priorities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau, President of Inuit Tapiriit Kanatami Natan Obed, Cabinet ministers, and the elected Inuit leadership of Inuvialuit Regional Corporation, Nunavut Tunngavik Incorporated, Makivik Corporation, and Nunatsiavut Government gathered today for a meeting of the Inuit-Crown Partnership Committee. The Committee met to review progress and to advance work on shared priorities for its fourth year.</p>\n\n<p>The Committee added two new areas of focus – economic development and procurement, and legislative priorities – to its existing priority areas. It also added a focus on developing and implementing a national action plan to address the Calls to Justice of the National Inquiry on Missing and Murdered Indigenous Women and Girls to the existing priority area of reconciliation, and merged the housing and infrastructure priority areas.</p>\n\n<p>They discussed ongoing work in several areas, including:</p>\n\n<ul>\n\t<li>Improving implementation of Inuit land claims agreements through the co-development of policy and review mechanisms</li>\n\t<li>Informing the implementation of the <em>Indigenous Languages Act</em>, and providing support for the reclamation, revitalization, maintenance, and strengthening of Inuktut in Inuit Nunangat</li>\n\t<li>Implementation of the Arctic and Northern Policy Framework, and work to modernize the co-development approach to programs, policies, and legislation</li>\n\t<li>Closing the infrastructure gap between Inuit Nunangat and the rest of Canada by addressing short, medium, and long-term housing and community infrastructure needs</li>\n</ul>\n\n<p>Over the last year, the Government of Canada and Inuit Tapiriit Kanatami have continued to take important steps towards reconciliation. These steps include the Government of Canada’s apology to Qikiqtani Inuit for the effects of federal policies in the Qikiqtani region from 1950 to 1975.</p>\n\n<p>The Inuit-Crown Partnership Committee reflects a shared commitment to a renewed Inuit-Crown relationship and reconciliation based on recognition of rights, respect, cooperation, and partnership.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Today’s meeting with Inuit leaders was productive and promising. By working in true partnership, the Committee has made important advances and found lasting and meaningful solutions to issues facing communities across Inuit Nunangat. We will continue to focus on key community-driven priorities which make a real difference for Inuit, such as housing and the revitalization of Inuktut.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today’s meeting of the Inuit-Crown Partnership Committee builds upon the strong momentum of the past three years. In this first meeting of our fourth year, we renewed our shared ambition in the areas of land claims implementation, language, infrastructure, and implementing an Inuit Nunangat policy within government. In the coming year, we will work together in 10 priority areas to bring about transformative change for Inuit, which in turn benefits all Canadians.”</p>\n\n<footer class=\"default\">President Natan Obed, Inuit Tapiriit Kanatami</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Inuit-Crown Partnership Committee was created in February 2017. It is founded on the principle that an equal partnership between Inuit and the Crown is essential to reconciliation.</li>\n\t<li>The Committee is co-chaired by the Prime Minister and the President of Inuit Tapiriit Kanatami.</li>\n\t<li>The Committee includes as observers the presidents of the National Inuit Youth Council, Pauktuutit Inuit Women of Canada, and the Inuit Circumpolar Council Canada.</li>\n\t<li>The Inuit-Crown Partnership Committee priorities are:\n\t<ul>\n\t\t<li>Inuit-Crown land claims</li>\n\t\t<li>Inuit Nunangat policy space</li>\n\t\t<li>Revitalization, maintenance, protection, and promotion of Inuktut</li>\n\t\t<li>Reconciliation measures</li>\n\t\t<li>Education, early learning, and training</li>\n\t\t<li>Health and wellness</li>\n\t\t<li>Environment and climate change</li>\n\t\t<li>Housing and infrastructure</li>\n\t\t<li>Economic development and procurement</li>\n\t\t<li>Legislative priorities</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">Prime Minister of Canada and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2017/02/09/inuit-nunangat-declaration-inuit-crown-partnership\">Inuit Nunangat Declaration on Inuit-Crown Partnership</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1560523306861/1560523330587\">Canada's Arctic and Northern Policy Framework</a></li>\n\t<li><a href=\"https://www.itk.ca/arctic-and-northern-policy-framework-inuit-nunangat/\">Arctic And Northern Policy Framework: Inuit Nunangat</a></li>\n</ul>\n\n<p>Also available in <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/06/inuit-gavamakkut-piliriqatigiinningita-katimajiralaangit\">Inuktitut</a> and <a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/06/inuit-government-kut-piliriqatigiinningita-katimajiralaangit\">Inuktut</a>.</p></div>\n      "
}