{
  "path": "/en/news/news-releases/2018/06/19/prime-minister-nominates-new-parliamentary-budget-officer",
  "pageTitle": "Prime Minister nominates new Parliamentary Budget Officer | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of <a href=\"/en/news/backgrounders/2018/06/19/yves-giroux\">Yves&nbsp;Giroux</a> as the new Parliamentary Budget Officer.</p><p>Mr. Giroux has served at the executive level for more than 15 years and has experience in fiscal, financial, and social policy areas. Since 2015, he has been the Assistant Commissioner of the Strategy and Integration Branch and the Chief Data Officer at the Canada Revenue Agency.</p><p>The Parliamentary Budget Officer provides independent, non-partisan analysis on the state of Canada’s finances, the Government’s estimates, and trends in the economy; raises the quality of parliamentary debate; and promotes greater budget transparency and accountability. The Parliamentary Budget Officer also responds to requests from political parties or independent members of the House of Commons to estimate the financial cost of any election campaign proposal that the party or member is considering making.</p><p>Mr. Giroux was chosen as the nominee for this position through the Government’s open, transparent, and merit-based appointment process.</p><h2>Quote</h2><blockquote><p>“I am delighted to announce the nomination of Yves Giroux as Canada’s new Parliamentary Budget Officer. Mr. Giroux’s senior leadership experience and knowledge of the federal budget process have made him a key expert in the field. I am confident he will do a thorough job providing the independent, easy to understand information Parliamentarians need to make decisions about our country’s future.”<br>– <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada fulfilled its commitment to make a truly independent and more democratic Parliamentary Budget Office through changes to the <i>Parliament of Canada Act</i> that came into force in September 2017.</li><li>Now recognized as an independent Officer of Parliament, the Parliamentary Budget Officer reports to Parliament through the Speakers of the Senate and the House of Commons.</li><li>These changes also expanded the Parliamentary Budget Officer’s mandate to include the costing of political party platforms, so Canadians can review the fiscal plans of political parties from an independent, non-partisan source.&nbsp;</li><li>Under the <i>Parliament of Canada Act</i>, the Parliamentary Budget Officer is appointed by the Governor in Council for a term of seven years, after consultation and approval by resolution of the Senate and House of Commons.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/06/19/yves-giroux\">Yves Giroux</a></li></ul></div>\n      "
}