{
  "path": "/en/news/readouts/2022/05/24/prime-minister-justin-trudeau-speaks-prime-minister-australia-anthony",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Australia Anthony Albanese | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Australia, Anthony Albanese, and congratulated him on his recent election victory.</p>\n\n<p>The two leaders discussed opportunities to further strengthen the close partnership between Canada and Australia. They noted their shared commitment to addressing climate change, generating economic growth that benefits everyone, promoting gender equality and inclusive growth, and advancing meaningful reconciliation with Indigenous Peoples.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Albanese agreed to advance common objectives in the Indo-Pacific region. They also discussed the importance of working with partners and allies to promote security and uphold democratic values.</p>\n\n<p>The prime ministers discussed Russia’s illegal and unjustifiable invasion of Ukraine. They agreed to continue closely coordinating efforts with international partners to stand up to Russian aggression and support the people of Ukraine.</p>\n\n<p>The two leaders agreed to stay in close touch and to work together to advance shared priorities. Prime Minister Trudeau looked forward to meeting Prime Minister Albanese in person in the coming months.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/australia-australie/relations.aspx?lang=eng\">Canada-Australia relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/05/21/statement-prime-minister-results-general-election-australia\">Statement by the Prime Minister on the results of the general election in Australia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n</ul></div>\n      "
}