{
  "path": "/en/news/statements/2020/08/23/statement-prime-minister-black-ribbon-day",
  "pageTitle": "Statement by the Prime Minister on Black Ribbon Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for the Victims of Communism and Nazism in Europe, also known as Black Ribbon Day:</p>\n\n<p>“Today, we join people around the world to pay tribute to the victims of Communism and Nazism in Europe. We express our solidarity with the survivors and their descendants, and with all those who face violence, loss of dignity, and repression from authoritarian and totalitarian regimes.</p>\n\n<p>“On this day in 1939, Nazi Germany and the Soviet Union signed the Molotov-Ribbentrop Pact. This alliance, which led to the violent political and territorial rearrangement of Eastern and Central Europe, caused immense suffering. Millions of people were murdered, countless others robbed of their basic rights, and many more forced to flee their homes and lands. &nbsp;</p>\n\n<p>“Many of those who fled found refuge and an opportunity to rebuild their lives in Canada. They, along with their descendants, have made tremendous contributions to our country, helping build the strong, diverse, and prosperous country we call home.</p>\n\n<p>“Canada condemns all violations of human rights and crimes against humanity. We will continue to work with our partners to defend and protect human rights and democracy around the world. Together, we can stop crimes like these from ever happening again, and ensure that those responsible are held accountable. &nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to remember the victims on&nbsp;Black Ribbon Day and all those who lost their lives to authoritarian and totalitarian regimes, past and present. We will honour them by continuing to fight hate and intolerance, protect the most vulnerable, and work to make Canada and the world a safer and more secure place for everyone.”</p></div>\n      "
}