{
  "path": "/en/news/news-releases/2017/05/30/prime-minister-trudeau-concludes-successful-visit-italy-and-vatican",
  "pageTitle": "Prime Minister Trudeau concludes successful visit to Italy and the Vatican | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his first official visit to Italy. The visit deepened the close relationship already shared by Canada and Italy – two countries that have enjoyed vibrant people-to-people connections for generations.</p><p>While in Rome, the Prime Minister met with Italian President Sergio Mattarella and Italian Prime Minister Paolo Gentiloni to discuss ways to strengthen cooperation on global issues and to create good middle class jobs for Canadians and Italians alike.</p><p>The Prime Minister also addressed the Italian Parliament. During his address, he recognized the compassion that the people of Italy have shown in welcoming thousands of migrants escaping poverty and conflict. He also thanked Italy for its strong support of the Canada-European Union Comprehensive Economic and Trade Agreement (CETA), a progressive trade agreement that will create good middle class jobs on both sides of the Atlantic.</p><p>Prime Minister Trudeau also met with His Holiness Pope Francis for the first time. They talked about the pressing need for leadership in a world facing unprecedented global issues such as climate change and mass migration. The Prime Minister also discussed at length Canada’s Truth and Reconciliation Commission’s Calls to Action and encouraged Pope Francis to apologize for the Catholic Church’s role in the residential school system. Finally, the Prime Minister invited Pope Francis to visit Canada.&nbsp;</p><h2>Quotes</h2><blockquote><p>“Italy is a strong ally and friend. Our relationship is built on tremendous people-to-people connections and close economic collaboration. With CETA, we can deliver promising new opportunities for middle class Canadians and Italians alike.”</p><p>“His Holiness Pope Francis' message of hope and inclusion resonates deeply with Canadians. Together, we discussed the central role that human dignity must play in global issues like migration, and the responsibility that we have for each other and the planet we share.”<br><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau also visited the town of Amatrice, an area devastated by an earthquake in August 2016, and reiterated Canada’s commitment to its friendship with Italy. The Government of Canada will match up to 2 million dollars in donations to the Italy Earthquake Relief Fund.</li><li>Canada and Italy enjoy strong and historic people-to-people connections. Canada’s large and dynamic Italian-Canadian community, almost 1.5 million strong, is particularly interested and engaged in all aspects – cultural, social, economic and political – of our bilateral relations.</li><li>Canada and Italy enjoy strong commercial relations. In 2016, two-way merchandise trade between Canada and Italy was valued at $9.8 billion, making Italy Canada’s eighth-largest trading partner.</li><li>During part of his visit to Rome, the Prime Minister was accompanied by the Minister of International Trade, the Honourable François-Philippe Champagne, and a Canadian business delegation, which included about fifty companies in the aerospace and defence, agri-food, and information and communications technology sectors.</li><li>During meetings with key Italian business leaders and investors, Prime Minister Trudeau and Minister Champagne underscored the significant economic benefits that CETA will generate for Canada and Italy, and sought support for CETA’s ratification.</li><li>While in Rome, the Prime Minister also joined Italian soccer club A.S. Roma to launch the Open Goal initiative to enhance integration between Italians, migrants and refugees.&nbsp;</li><li>During his visit to the Vatican City, Prime Minister Trudeau also met with His Eminence Cardinal Pietro Parolin, Secretary of State, and His Grace Archbishop Paul Gallagher, Secretary for Relations with States. They discussed cooperation on issues of mutual interest including migration, countering climate change, promoting human rights and religious freedoms, and advancing peaceful pluralism.</li><li>Canada established diplomatic relations with the Holy See in 1969. Through its diplomatic presence at the Vatican, Canada benefits from the perspective of an important international player, both at the regional level and on global issues.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng&amp;_ga=2.132376525.2143207736.1494958295-673960517.1475602112\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li></ul></div>\n      "
}