{
  "path": "/en/news/news-releases/2018/10/11/prime-minister-announces-appointment-two-senators",
  "pageTitle": "Prime Minister announces the appointment of two senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/10/11/josée-forest-niesing\">Josée Forest-Niesing (Ontario)</a></li><li><a href=\"/en/news/backgrounders/2018/10/11/brian-francis\">Brian Francis (Prince Edward Island)</a></li></ul><p>Ms. Forest-Niesing is a proud Franco-Ontarian, dedicated lawyer, and devoted community member who, throughout her career, has passionately defended and promoted access to justice in both official languages.</p><p>Mr. Francis is a leader and respected member of the Mi’kmaq community. He has experience with all levels of government, and has helped advance social and economic development for his community through important infrastructure development work.</p><p>These individuals were recommended by the Independent Advisory Board for Senate Appointments and chosen using the process open to all Canadians. This process ensures senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“I am pleased to welcome Parliament’s newest independent senators. I look forward to work with Ms.&nbsp;Forest-Niesing and Mr.&nbsp;Francis, and I have no doubt that their vast knowledge and experience will greatly benefit Parliament and all of Canada.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>There have been 45 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Once appointed by the Governor General and summoned to the Senate, the new senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/10/11/josée-forest-niesing\">Josée Forest-Niesing</a></li><li><a href=\"/en/news/backgrounders/2018/10/11/brian-francis\">Brian Francis</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li></ul></div>\n      "
}