{
  "path": "/en/news/statements/2022/08/15/statement-prime-minister-national-liberation-day-korea",
  "pageTitle": "Statement by the Prime Minister on the National Liberation Day of Korea | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Liberation Day of Korea:</p>\n\n<p>“Today, we join Korean communities in Canada and around the world in celebrating the 77th anniversary of Korea’s independence.</p>\n\n<p>“Also known as <em>Gwangbokjeol</em> or Restoration of Light Day, the National Liberation Day of Korea<strong> </strong>commemorates the end of the Second World War and the liberation of the Korean Peninsula after 35&nbsp;years of Japanese occupation. Exactly three years later, on August 15, 1948, the Republic of Korea was officially established, setting the country on a path to become the vibrant and prosperous democracy that we know today.</p>\n\n<p>“On this day, we celebrate the strong bonds that unite Canada and the Republic of Korea, including fighting side-by-side in the Korean War. Strengthened by our people-to-people ties, we have become close friends and partners. We have worked together to establish the Canada-Korea Free Trade Agreement, Canada’s first bilateral free trade agreement in the Indo-Pacific region, and share an unwavering commitment to democracy, the rule of law, regional stability, and free and open international trade. Next year, our countries will celebrate 60 years of our diplomatic relations – a milestone anniversary which will further deepen our strategic partnership. &nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to recognize the many contributions Korean Canadians have made, and continue to make, to our country. I extend my best wishes to all those celebrating National Liberation Day of Korea here in Canada and around the world.”</p></div>\n      "
}