{
  "path": "/en/news/statements/2021/07/26/uqausiusimajuq-kanataup-angajuqkaajjuanganut-tunngasuktittinirmut-kanaup",
  "pageTitle": "ᐅᖃᐅᓯᐅᓯᒪᔪᖅ ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᔾᔪᐊᖓᓄᑦ ᑐᙵᓱᒃᑎᑦᑎᓂᕐᒧᑦ ᑲᓇᐅᑉ 30-ᒋᔭᖓᓂᒃ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᑕ, ᐱᐅᔪᒻᒪᕆᒃ ᒪᓕᒐᓕᐅᖅᑎ ᒥᐊᔨ ᒪᐃ ᓴᐃᒪᓐ | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ, ᔭᔅᑎᓐ ᑐᕉᑐ, ᐅᓪᓗᒥ ᓴᖅᑭᑎᑦᑎᖅᑲᐅᕗᖅ ᐅᑯᓂᖓ ᐅᖃᐅᓯᐅᓯᒪᔪᓂᒃ ᑐᙵᓱᒃᑎᑦᑎᔪᒪᓪᓗᑎᒃ ᑲᓇᑕᒥᐅᑦ ᓄᑖᒥᒃ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓ, ᑖᓐᓇ ᑕᓕᖅᐱᑦᑎᐊᓐᓃᑦᑐᖅ ᒥᐅᔨ ᒪᐃ ᓴᐃᒪᓐ:</p>\n\n<p>“ᑭᒡᒐᖅᑐᖅᖢᒋᑦ ᑲᓇᑕᐅᑉ ᒐᕙᒪᒃᑯᖏᑦ, ᐅᐱᒍᓱᒃᐳᖓ ᑐᙵᓱᒃᑎᒃᑎᔪᓐᓇᕋᒪ ᑲᓇᑕᒥ 30-ᒋᔭᖓᓂ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᓂᒃ, ᐱᒃᑲᐅᓛᖑᔪᖅ ᒥᐊᔨ ᒪᐃ ᓴᐃᒪᓐ.</p>\n\n<p>“ᐃᓅᓂᑯ ᓄᓇᕕᖕᒥ, ᑯᐸᒃ ᐅᑭᐅᖅᑕᖅᑐᖓᓂ, ᐱᐅᔪᒻᒪᕆᐊᔪᖅ ᐃᓅᓯᓕᒫᖅ ᐃᖅᑲᓇᐃᔭᖃᑦᑕᖅᓯᒪᔪᖅ ᑭᒡᒐᖅᑐᖅᖢᒋᑦ ᑕᐃᒃᑯᐊ ᖃᓂᒋᔮᓃᑦᑐᑦ. ᑕᖃᓱᐃᑦᑑᓪᓗᓂ ᑭᒡᒐᖅᑐᐃᔨᐅᕗᖅ ᐃᓄᐃᑦ ᐱᔪᓐᓇᐅᑎᖏᓪᓄᑦ ᐃᓕᖅᑯᓯᖏᓐᓄᓪᓗ, ᒪᒃᑯᒃᑐᓄᑦ ᐊᕙᑎᒧᓪᓗ, ᓇᐃᓴᒐᒃᓴᐅᖏᑦᑐᓂᒃ ᐱᑎᑕᐅᓯᒪᕗᖅ ᓯᕗᓪᓕᖅᐹᖑᓪᓗᓂᓗ ᑎᒍᒥᐊᖅᑎᐅᓪᓗᓂ ᑲᓇᑕᒥ ᑭᒡᒐᖅᑐᐃᔨᐅᓂᕐᒧᑦ.</p>\n\n<p>“ᐃᖅᑲᓇᐃᔮᖃᕐᓂᓕᒫᖓᓂ, ᐱᐅᔪᒻᒪᕆᐊᓗᒃ ᑕᑯᒃᓴᐅᑎᑦᑎᕗᖅ ᐊᖏᖅᓯᒪᑦᑎᐊᕐᓂᖓᓂᒃ ᑭᒡᒐᖅᑐᐃᓪᓗᓂ ᐃᓅᖃᑎᖐᓂᒃ, ᑮᓇᐅᔭᓕᐅᕋᓱᖕᓂᕐᒧᑦ ᐊᒻᒪ ᐃᓄᐃᑦ ᐱᔪᓐᓇᐅᑎᖏᓐᓄᑦ ᐱᔾᔪᓐᓴᐅᑎᖏᓐᓄᑦ ᐱᔾᔪᑕᐅᔪᓂᑦ. ᓯᕗᓕᐅᖅᑎᐅᖃᑦᑕᖅᓯᒪᕗᖅ ᓴᙱᒃᑎᒋᐊᖅᑎᑦᑎᓪᓗᓂ ᐊᒃᑐᕐᓂᐅᔪᓂ ᐃᓄᖏᓐᓄᑦ ᐅᑭᐅᖅᑕᖅᑐᒥᐅᑦ, ᑕᒪᕐᒥᒃ ᑲᓇᑕᓕᒫᒥ ᓄᓇᕐᔪᐊᓕᒫᒥᓗ. ᑲᓇᑕᒥ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓ ᑲᒪᔨᐅᓐᓗᓂᓗ ᑲᓇᑕᒥ ᐱᖁᔭᕐᔪᐊᖏᓐᓂᒃ ᐊᒻᒪ ᐱᓕᕆᕝᕕᖏᓐᓂᒃ, ᖃᐅᔨᒪᔪᖓ ᐊᔾᔨᐅᙱᑦᑐᒥᒃ ᐱᓕᕆᖃᑦᑕᖅᓯᒪᓂᑰᐃᓐᓇᕐᓂ ᑕᐅᑐᖅᑰᖅᑕᖓᓂᒡᓗ ᑭᒡᒐᖅᑐᐃᓗᓂ ᑲᓇᑕᒥᐅᓂᒃ ᐊᔾᔨᒌᙱᕈᓘᔭᖅᑐᓂᒃ, ᑕᒪᒃᑮᒃ ᐅᕙᓂ ᐊᖏᕐᕋᒥ ᐊᒻᒪᓗ ᑲᓇᑕᐅᑉ ᓯᓚᑖᓃᑦᑐᑦ, ᐱᑦᑎᐊᕐᓂᒃᑯᑦ ᓱᓕᑦᑎᐊᕐᓂᒃᑯᓪᓗ, ᐊᒻᒪᓗ ᑕᒪᒃᑮᓐᓂ ᑲᓇᑕᒥ ᐅᖃᐅᓰᑦ ᐃᓕᓴᕆᔭᐅᓯᒪᔪᑦ. ᐅᖃᕈᓐᓇᑦᑎᐊᖅᑐᖓ, ᐊᖓᔪᖅᑳᕆᔭᐅᓪᓗᖓ, ᐱᓕᕆᓂᐊᖅᐳᖅ ᐃᑲᔪᖅᓱᐃᓗᓂ ᑲᑉᐱᐊᓱᙱᑦᑐᓂᒃ ᐃᓚᒋᔭᐅᔪᓂᒃ ᑲᓇᑕᒥ ᐅᓇᑕᖅᑐᒃᓴᒃᑯᓐᓄᑦ ᐊᒃᓱᕉᑎᖃᖅᐸᒃᑐᓄᑦ ᐊᑦᑕᕐᓇᑦᑐᒦᑎᑦᑎᑦᑕᐃᓕᓂᕐᒧᑦ ᐊᒻᒪ ᐊᑦᑕᕐᓇᖅᑐᒦᑎᑦᑐᑕᐃᓕᓂᕐᒧᑦ ᓄᓇᑦᑎᓐᓂ ᐊᒻᒪ ᐃᓄᖁᑎᑦᑎᓐᓂ.</p>\n\n<p>“ᑲᔪᖏᖅᓴᖅᑕᐅᑦᑎᐅᖅᐳᖓ ᑕᐃᔅᓱᒪᓂᑐᖃᖅ ᐊᑐᖅᑕᐅᕙᓚᐅᖅᑐᒥᑦ, ᑲᓇᑕᒥᐅᑕᐅᖃᑎᕗᑦ ᓱᓕ ᑕᐃᒍᓯᖃᖅᐸᓪᓕᐅᖏᓐᓇᖅᑎᓪᓗᑕ ᐱᔭᕆᐊᑐᔪᓂᒃ ᓱᓕᔪᓂᒃ ᑲᑐᔾᔨᖃᑎᒌᓐᓂᕆᕙᓚᐅᖅᑕᑎᓐᓂᒃ. ᖃᐅᔨᒪᓂᐊᖅᐳᖓ, ᑲᓇᑕᒥ ᓯᕗᓪᓕᖅᐸᐅᓪᓗᓂ ᓄᓇᖃᖅᑳᖅᓯᒪᔪᓄᑦ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᓄᑦ, ᐱᐅᔪᒻᒪᕆᐊᓗᒃ ᐅᕙᑦᑎᓐᓂᒃ ᐃᑲᔪᕐᓂᐊᖅᐳᖅ ᐅᕙᑦᑎᓐᓂᒃ ᓵᓚᒋᓇᓱᐊᖅᑎᓪᓗᑕ ᑕᒪᒃᑯᓂᖓ ᐱᔭᕆᐊᑐᔪᓂᒃ ᓱᓕᔪᓂᒃ ᐊᑕᐅᑦᑎᒃᑯᑦ, ᐱᓱᒡᓗᓂ ᐊᒥᖅᑳᖃᑎᒌᖏᓂᕐᒥᒃ ᐊᖅᑯᓯᓂᕆᔭᐅᕙᒃᑐᒥᒃ ᐋᕿᒋᐊᕈᑎᖃᕐᓂᕐᒧᑦ, ᐊᒻᒪᓗ ᐃᑳᕐᕕᓕᐅᕐᓗᑎᒃ ᑕᐃᒃᑯᓇᙵᑦ ᐅᖄᓚᔪᓂᒃ ᓄᓇᑦᑎᓐᓂ.</p>\n\n<p>“ᑕᕝᕙᓂ ᐅᓪᓗᕐᒥ, ᖁᔭᒋᔪᒪᖕᒥᔭᕗᑦ ᑯᐃᓐ ᐃᓕᓴᐱ ᐊᐃᑉᐸᖓ, ᑯᐃᓐ ᑲᓇᑕᒥ, ᐊᕐᕌᒍᓄᑦ 69-ᓄᑦ ᐱᔨᑦᑎᕋᖅᓯᓕᖅᑐᖅ ᑯᐃᓐ ᓄᓇᖏᓐᓄᑦ ᐃᓄᖏᓐᓂᒡᓗ ᐃᓗᕕᖃᖅᑐᓂᑦ, ᐱᑦᑎᐊᕐᓂᖅ, ᓯᓚᑐᓂᒃᑯᓪᓗ. ᑖᓐᓇ 13-ᒋᓕᖅᑕᖓ ᑎᒃᑯᐊᖅᑕᐅᓂᖓ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᑕ ᑲᓇᑕᒥ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᓄᑦ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᓄᑦ. ᑕᐃᒪᙵᑦ 1952-ᒥ ᐱᒋᐊᓚᐅᖅᓯᒪᕗᖅ.</p>\n\n<p>“ᑖᓐᓇ ᑕᓕᖅᐱᑦᑎᐊᓐᓃᑦᑐᖅ ᒥᐊᔨ ᒪᐃ ᓴᐃᒪᓐ ᐱᔨᑦᑎᕈᓐᓇᓚᐅᕐᒪᑦ ᐆᒻᒪᑎᒐᓗ ᐱᒃᑯᒋᔪᒪᓪᓗᒍ. ᑲᓇᑕᒥᐅᓕᒫᑦ ᖃᐅᖁᕙᒃᑲ ᓂᕆᐅᖕᓂᖃᖁᓪᓗᒋᑦ ᑲᔪᖏᖅᓴᐃᓂᕐᒥᒡᓗ ᑕᒪᑐᒧᖓ ᐱᒻᒪᕆᐅᔪᒧᑦ ᓯᕗᒻᒪᐊᒃᐸᓪᓕᐅᓂᕐᒧᑦ ᑲᓇᑕᒧᑦ, ᐊᒻᒪᓗ ᐱᖃᑎᒋᔪᒪᓐᓗᒍ, ᑕᐅᑐᙳᐊᖅᑕᕕᓂᒃ ᓴᖅᑭᑎᑦᑎᒻᒪᑦ ᐊᔾᔨᒌᑎᑦᑎᓂᕐᒧᑦ, ᐊᔾᔨᒌᒃᑎᑦᑎᓂᖅᓴᐅᓗᑎᒃ ᐊᒻᒪᓗ ᐱᑐᖃᐅᓂᖅᐹᒧᑦ ᑎᑎᕋᕐᕕᖕᒧᑦ.”</p>\n\n<h2>ᐊᒃᑐᐊᓂᓖᑦ ᑐᓴᖅᑕᐅᔪᒃᓴᐃᑦ</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">ᑲᓇᑕᐅᑉ ᐊᖓᔪᖅᑳᕐᔪᐊᖓ ᑐᓴᖅᑎᑦᑎᕗᖅ ᑯᐃᓐ ᐊᖏᖅᓯᓂᖓᓂᒃ ᑲᓇᑕᒥ ᑭᖑᓪᓕᕐᒥ ᑯᐃᓐ ᑭᒡᒐᖅᑐᖅᑎᖓᓄᑦ</a></li>\n</ul></div>\n      "
}