{
  "path": "/en/news/statements/2021/06/01/statement-prime-minister-national-indigenous-history-month",
  "pageTitle": "Statement by the Prime Minister on National Indigenous History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous History Month:</p>\n\n<p>“Today, as we mark the beginning of <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1466616436543/1534874922512\">National Indigenous History Month</a>, we honour the unique heritage, cultures, and traditions of First Nations, Inuit, and Métis peoples across Canada. From the Mi’kmaq in Atlantic Canada, to the Métis in the Red River Valley, the Inuit in the Inuvialuit Settlement Region, and the Coast Salish peoples of the Pacific Northwest Coast, this month provides us with an opportunity to learn more about Indigenous communities and their contributions to Canadian history and society.</p>\n\n<p>“This month is an opportunity for us to participate in virtual activities to engage with, and deepen our understanding of, Indigenous peoples’ distinct histories, customs, spiritualities, and languages. Doing so is essential to promoting a society based on mutual respect, understanding, and fairness. We all need to play a role in amplifying the voices of Indigenous peoples, dismantling systemic racism, inequalities, and discrimination, and walking the path of reconciliation together. The recent, distressing news of the remains of 215 children found near the former Kamloops Indian Residential School is a painful reminder that the impacts of residential schools are still felt today. Sadly, this heartbreaking discovery in Kamloops is not an exception or isolated incident. Over decades, thousands of Indigenous children were taken from their families and communities, and everything was stolen from them. We must all unreservedly acknowledge this truth and address these historical and ongoing wrongs, so we can build a better future.</p>\n\n<p>“The government continues to work with Indigenous peoples to build a true nation-to-nation, Inuit-Crown, government-to-government relationship – one based on the affirmation of rights, respect, cooperation, and partnership. We must continue to learn about and support the various existing governments, laws, and traditions that govern Indigenous nations to help Indigenous peoples build capacity to implement their vision of self-determination.</p>\n\n<p>“Over the past year, the global COVID-19 pandemic has revealed and deepened social, health, and economic disparities for Indigenous peoples. We are committed to addressing these inequalities through action – the government has made unprecedented investments to close gaps in housing, health, and education for Indigenous communities. We have also worked across all federal government organizations and with our partners so that 80 per cent of the Truth and Reconciliation Commission’s Calls to Action involving the Government of Canada are now completed or well underway.</p>\n\n<p>“In <a href=\"https://www.budget.gc.ca/2021/report-rapport/p3-en.html#chap8\">Budget 2021</a>, the government is proposing a historic, new investment of over $18&nbsp;billion over the next five years to support healthy, safe, and prosperous Indigenous communities, close gaps between Indigenous and non-Indigenous peoples, and advance meaningful reconciliation. These investments are the Government of Canada’s contribution to, and will accelerate work on, the implementation of the National Action Plan in response to the National Inquiry into Missing and Murdered Indigenous Women and Girls’ Calls for Justice. We need a new approach that better addresses the root causes of violence, recognizes the scope of the problem, and factors in the different experiences of Indigenous peoples across the country to end the national tragedy of violence toward Indigenous women, girls, and LGBTQ and two-spirit people.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to learn more about and reflect on how Indigenous peoples continue to shape our diverse country by joining this year’s <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1559317815424/1559317832462\">#IndigenousReads</a> conversation. Together, we must continue to walk the path of reconciliation to ensure that the rights, languages, cultures, and identities of all Indigenous peoples are recognized, honoured, and respected.”</p></div>\n      "
}