{
  "path": "/en/news/news-releases/2015/11/27/prime-minister-announces-investment-global-climate-change-action",
  "pageTitle": "Prime Minister announces investment in Global Climate Change Action | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today the Prime Minister, Justin Trudeau, announced that Canada will contribute an historic $2.65 billion over the next five years to help developing countries tackle climate change. The Prime Minister made the announcement ahead of the Paris climate conference while attending the Commonwealth Heads of Government Meeting in Malta.</p>\n<p>Canada is committed to ambitious action on climate change, and is focused on the economic opportunities of our environment and creating the clean jobs of tomorrow. The science on climate change is indisputable and its significant impacts are already being felt by economies and communities, particularly in the world’s most poor and vulnerable countries.</p>\n<p>Canada’s positive contribution will support the transition to low-carbon economies that are both sustainable and more resilient. Countries in need will receive support, in particular the poorest and most vulnerable, to respond to climate change and adapt to its impacts.</p>\n<p>This contribution will support the commitment Canada made under the 2009 Copenhagen Accord to work with partners to jointly mobilize, from a wide variety of sources, US $100 billion annually by 2020.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada is back and ready to play its part in combatting climate change, and this includes helping the poorest and most vulnerable countries in the world adapt. The investment announced today will help build a more environmentally sustainable future for generations to come. It is yet another example that Canada is once again a serious player in the international fight against climate change.”<br><em>– The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Developed countries agreed in 2009 to mobilize jointly US $100 billion a year by 2020 from various sources.</li>\n<li>The Organisation for Economic Co-operation and Development issued a report in October 2015 estimating that developed countries mobilized US $62&nbsp;billion in 2014, an increase of $10 billion from 2013.</li>\n<li>Canada’s contribution represents a substantial increase in funding, scaling up to $800 million by 2020-2021. It represents a doubling of Canada’s fast-start financing levels.</li>\n<li>Over US $10 billion was pledged to the Green Climate Fund (GCF) in 2014, including $300 million from Canada. The GCF is now fully operational and has recently approved its first projects.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://unfccc.int/cooperation_and_support/financial_mechanism/green_climate_fund/items/5869.php\">Green Climate Fund</a></li>\n<li><a href=\"/en/news/backgrounders/2015/11/27/canada’s-climate-finance-commitment\">Canada’s Climate Finance Commitment</a></li>\n</ul></div>\n      "
}