{
  "path": "/en/news/news-releases/2023/01/11/prime-minister-advances-economic-growth-and-trade-ties-north-american",
  "pageTitle": "Prime Minister advances economic growth and trade ties at North American Leaders’ Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Mexico City where he participated in the tenth North American Leaders’ Summit (NALS) with the President of Mexico, Andrés Manuel López Obrador, and the President of the United States of America, Joe Biden, to keep working in partnership to grow our economies to benefit everyone and create good, middle-class jobs across the continent. Prime Minister Trudeau was accompanied by Sophie Grégoire Trudeau, the Minister of Foreign Affairs, Mélanie Joly, the Minister of International Trade, Export Promotion, Small Business and Economic Development, Mary Ng and the Minister of Public Safety, Marco E. L. Mendicino.</p>\n\n<p>During the Summit, the leaders signed the <a href=\"https://pm.gc.ca/en/news/statements/2023/01/10/declaration-north-america-dna\">Declaration of North America</a>, a joint leaders’ statement focused on building our economy to benefit people and expanding trilateral cooperation in each of the six pillars of NALS: Diversity, Equity and Inclusion; Climate Change and Environment; Competitiveness; Health; Migration and Development; and Regional Security.</p>\n\n<p>The leaders addressed global and regional stability issues such as Iran, China, and Russia’s invasion of Ukraine, as well as hemispheric hotspots, such as Haiti, Venezuela, Nicaragua, and Cuba. The Prime Minister stressed the importance of international cooperation in supporting a robust, Haitian-led solution to the political, security, and humanitarian crises. The Prime Minister discussed extending additional support to Haiti with the U.S. and Mexico, including to increase humanitarian aid, impose sanctions, strengthen the Haitian National Police, and weaken and disable Haiti’s criminal gangs and those who support them. Today, Canada delivered two Haitian-purchased Mine-Resistant Ambush Protected (MRAP) vehicles to the Haitian National Police to assist them in restoring peace and security.</p>\n\n<p>Ahead of NALS, Canada, Mexico, and the U.S. condemned the January 8 attacks on Brazil’s democracy and on the peaceful transfer of power and underlined their support for Brazil as it safeguards its democratic institutions.&nbsp;</p>\n\n<p>Prime Minister Trudeau met with President López Obrador and the two leaders reiterated their mutual commitment to strengthening our deep economic ties and longstanding friendship. In the face of increasingly complex global challenges, Prime Minister Trudeau and President López Obrador reaffirmed the importance of a strong Canada-Mexico bilateral relationship with a new <a href=\"https://www.international.gc.ca/transparency-transparence/mexico-mexique/action-plan.aspx?lang=eng\">Canada-Mexico Action Plan</a>. The Action Plan aims to increase bilateral initiatives in a range of areas, including further strengthening and developing commercial and investment ties and advancing gender equality and sharing experiences of Indigenous reconciliation. The Prime Minister underscored the importance of continued Canadian and Mexican partnership to seize opportunities for economic cooperation and supply chain resiliency through the Canada-U.S.-Mexico Agreement (CUSMA) and the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), and build a clean economy.</p>\n\n<p>The Prime Minister also met with President Biden where the leaders highlighted extensive progress made on the <a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a>. The leaders discussed the critical importance of North American trade, competitiveness, and supply chains, including critical minerals and semiconductors. During the meeting, they also noted bilateral progress to fix the NEXUS backlog. By increasing interviews, reopening enrollment centers in Canada, and offering interviews at Canadian airport preclearance locations, we are building on our recording-breaking progress since October 2022 and continuing our close collaboration to facilitate travel across our border and generate billions in economic activity.</p>\n\n<p>Prime Minister Trudeau also reiterated Canada’s ongoing commitment to providing humanitarian, military, financial, and other assistance to the government and people of Ukraine, and announced Canada’s purchase of a National Advanced Surface-to-Air Missile System and associated munitions from the United States to donate to Ukraine. This air defence system helps protect against drone, missile, and aircraft attacks and has a high success rate. This donation, valued at approximately $406 million, comes from the additional $500 million in military aid to Ukraine announced on November 14, 2022.</p>\n\n<p>The Prime Minister also underscored Canada’s commitment to protect North American airspace and meet defence and security challenges abroad by investing in a modern fleet of fighter jets. The fighter aircraft fleet is a critical capability necessary to enforce Canada’s sovereignty, enable continental security, and contribute to international peace and stability.</p>\n\n<p>While in Mexico City, Prime Minister Trudeau and President Biden announced President Biden’s visit to Canada in March 2023.</p>\n\n<p>At NALS, the Prime Minister further demonstrated Canada’s ongoing commitment to a sustained North American partnership by announcing that Canada will host the next summit.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada’s partnership with the United States and Mexico <a name=\"_Hlk123649768\" id=\"_Hlk123649768\">advances Canadian priorities</a>, including building a clean economy, bolstering resilient supply chains, and building our economies to work for everyone. We are showing the world that our democracies will work together to address the most pressing challenges of our time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In Mexico, the Prime Minister attended the North American Business Leaders Summit, where he discussed climate change, transitioning to a clean economy, building resilient supply chains, and responding to continental, regional, and global challenges. The Summit was organized by the Consejo Coordinador Empresarial (CCE - Mexico’s Business Coordinating Council), with support from the Business Council of Canada (BCC) and the U.S. Chamber of Commerce (USCC).</li>\n\t<li>Prime Minister Trudeau delivered a keynote speech to an audience of over 200 people, including members of the CCE, the Mexico-Canada Chamber of Commerce (CanCham), and the Mexican Council on Foreign Affairs (COMEXI), on the Canada-Mexico Relationship and North American Competitiveness. He outlined the importance of NALS and its outcomes, and expanded on Canada’s vision for North America. He provided an update on Canada’s foreign and international economic policy priorities and reiterated Canada’s new Indo-Pacific Strategy and Critical Minerals Strategy, and discussed COP15 in Montreal last month. The Prime Minister also underscored the important role business leaders and foreign policy practitioners have in strengthening North America’s competitiveness and in bolstering the Canada-Mexico bilateral relationship. He strongly encouraged Mexican businesses to invest in Canada.</li>\n\t<li>In Mexico, the Prime Minister also met separately with Armando Garza Sada, Chairman of Alfa’s Board of Directors and Álvaro Fernandez Garza, President of Alfa, Daniel Servitje Montul, President and CEO of Grupo Bimbo and Jody Kuzensko, the President and CEO of Toronto-based Torex Gold where he positioned Canada as a globally innovative and competitive trade and investment partner.</li>\n\t<li>Parliamentary Secretary to the Minister of Foreign Affairs Maninder Sidhu and Member of Parliament and Chair of the Canada-Mexico Friendship Group, Julie Dzerociwz were also present at the Summit.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2023/01/10/fact-sheet-key-deliverables-2023-north-american-leaders-summit\">Key Deliverables for the 2023 North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/10/prime-minister-justin-trudeau-meets-president-united-states-america-joe\">Prime Minister Justin Trudeau meets with President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/11/prime-minister-justin-trudeau-meets-president-mexico-andres-manuel-lopez\">Prime Minister Justin Trudeau meets with President of Mexico Andrés Manuel López Obrador</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2023/01/defence-minister-anita-anand-announces-air-defence-system-donation-to-ukraine.html\">Defence Minister Anita Anand announces air defence system donation to Ukraine </a>&nbsp;</li>\n\t<li><a href=\"https://www.canada.ca/en/border-services-agency/news/2023/01/joint-statement-by-canada-and-the-united-states-on-nexus.html\">Joint Statement by Canada and the United States on NEXUS</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2023/01/09/joint-statement-president-joe-biden-president-andres-manuel-lopez-obrador\">Joint Statement by President Joe Biden, President Andres Manuel Lopez Obrador, and Prime Minister Justin Trudeau on Brazil</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2023/01/canada-delivers-haiti-purchased-vehicles-to-help-haitian-national-police-respond-to-crisis.html\">Canada delivers Haiti-purchased vehicles to help Haitian National Police respond to crisis</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/10/prime-minister-justin-trudeau-meets-chairman-and-ceo-grupo-bimbo-daniel\">Prime Minister Justin Trudeau meets with Chairman and CEO of Grupo Bimbo Daniel Servitje</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/11/prime-minister-justin-trudeau-meets-torex-gold-resources-executives\">Prime Minister Justin Trudeau meets with Torex Gold Resources executives</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/01/11/prime-minister-justin-trudeau-meets-alfa-executives\">Prime Minister Justin Trudeau meets with ALFA executives</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/20/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n</ul></div>\n      "
}