{
  "path": "/en/news/statements/2021/02/12/statement-prime-minister-vietnamese-new-year",
  "pageTitle": "Statement by the Prime Minister on Vietnamese New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the Vietnamese New Year, also known as Tết Nguyên Đán:</p>\n\n<p>“This week, Vietnamese communities in Canada and around the world will celebrate the Lunar New Year and welcome the Year of the Buffalo.</p>\n\n<p>“Tết is a time to reflect on the past year’s successes and challenges, and celebrate new beginnings. Family and friends usually join together to honour their ancestors, enjoy a special meal, and share best wishes for the year to come. Even though the celebrations will be different this year due to the global COVID-19 pandemic, we can still be inspired by what the Buffalo represents, an animal that symbolizes hard work, strength, and persistence.</p>\n\n<p>“Since the start of the pandemic, Vietnamese Canadians have contributed to the collective effort in many ways including donating personal protective equipment, helping neighbours, and following public health guidelines. To everyone: thank you for all your efforts to keep us safe and healthy.</p>\n\n<p>“Tết is also an opportunity to celebrate the important contributions Vietnamese communities have made – and continue to make – across the country. As we celebrate, we must also remember that we need to continue to fight anti-Asian racism that still exists today. By eliminating racism and discrimination in all its forms, we can build a Canada that is stronger, fairer, and more equitable for everyone.</p>\n\n<p>“On behalf of our family, Sophie and I wish health, happiness, and good fortune to everyone celebrating.</p>\n\n<p>“Chúc mừng năm mới.”</p>\n\n<p>“Ch-ook moo-n na moy.”</p></div>\n      "
}