{
  "path": "/en/news/statements/2020/12/23/statement-prime-minister-announcing-national-day-remembrance-victims-air",
  "pageTitle": "Statement by the Prime Minister announcing National Day of Remembrance for Victims of Air Disasters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, as well as the Minister of Foreign Affairs, François-Philippe Champagne, and Minister of Transport, Marc Garneau, today issued the following statement to announce that the Government of Canada will designate January 8 of every year as the National Day of Remembrance for Victims of Air Disasters:</p>\n\n<p>“On January 8, 2020, Ukraine International Airlines Flight 752 was shot down by Iran, resulting in the tragic loss of 176 innocent people, including 55 Canadian citizens, 30 permanent residents, and numerous others with ties to Canada. This national tragedy represents one of the worst loss of Canadian lives in civil aviation history, and as a country, nearly one year later, we continue to remember those who were lost, and stand in solidarity with the people they loved. We also remain committed to seeking a comprehensive and credible explanation from the Iranian regime about this tragic event, and we will continue to insist on full accountability.</p>\n\n<p>“In the wake of the downing of flight PS752, our government has taken steps to fully investigate the situation, pursue accountability, support the families of the victims, and keep Canadians safe by preventing future disasters. This includes through the appointment of Ralph Goodale as the Prime Minister’s Special Advisor for the tragedy, the welcoming of Mr. Goodale’s recent report, which will help establish best practices to respond to future air disasters, and the establishment of our Safer Skies initiative that will help keep civilian aircraft&nbsp;away from dangerous conflict zones.</p>\n\n<p>“As a country, we have also experienced prior aviation tragedies, including Ethiopian Airlines Flight 302 and Air India Flight 182, leaving too many Canadians without family members, loved ones, and friends. These events touch all Canadians, because in times of challenge and sadness, we lean on one another, and we support those going through a difficult time.</p>\n\n<p>“We are designating January 8 as a national day of remembrance to continue to pay tribute to the victims of air disasters, both at home and abroad, and to acknowledge the profound loss of the victims’ families and loved ones. Together, we will always remember these tragedies, and we will keep those who were lost in our thoughts and in our hearts.</p>\n\n<p>“We will never forget them.”</p></div>\n      "
}