{
  "path": "/en/news/news-releases/2021/10/15/prime-minister-announces-dates-cabinet-swearing-and-return-parliament",
  "pageTitle": "Prime Minister announces the dates of the Cabinet swearing-in and return of Parliament | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In September, Canadians chose to move forward for everyone. They chose to take strong action to beat the COVID-19 pandemic, create jobs and grow the middle class, put home ownership back in reach for everyone, and tackle climate change. The Government of Canada is committed to delivering on these priorities as we build back a better country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the swearing-in ceremony of the Cabinet will take place on October 26, 2021, and that Parliament will return on November 22, 2021.</p>\n\n<p>The new Cabinet will remain gender balanced, and will continue to deliver for Canadians and find real solutions to the real challenges of today and tomorrow. As announced last month, Chrystia Freeland will continue to serve as Deputy Prime Minister and Minister of Finance. With the reconvening of Parliament, the Government of Canada will also deliver a new Throne Speech, which will lay out the government’s progressive plan to finish the fight against COVID-19 and build a better future for everyone.</p>\n\n<p>Over 82 per cent of eligible Canadians are now fully vaccinated, but our fight against COVID-19 is not over. That is why the government has outlined five vaccination commitments for the first 100 days following the swearing-in of the new Cabinet.</p>\n\n<p>This month, as part of these commitments, the Prime Minister provided details on the government’s plan to ensure everyone 12 or older travelling within Canada on a plane or train is fully vaccinated. He also outlined a plan to ensure all federal employees and people in federally regulated workplaces are fully vaccinated. The government will also deliver on its commitments to establish a standardized proof of vaccination for Canadians travelling internationally while supporting provincial and territorial proof of vaccination programs, and introduce legislation to make it a criminal offence to harass or threaten health care workers.</p>\n\n<p>The Prime Minister and the new Cabinet will also continue their work to build a better and fairer Canada, including by engaging with the remaining provinces and territories who have not yet signed $10-a-day child care agreements, so we can make life more affordable for parents and create more child care spaces for our children.</p>\n\n<p>Early priorities include re-introducing legislation to ban harmful conversion therapy, moving ahead with 10-day paid sick leave for all federally regulated workers, and bringing the provinces and territories together to work on better sick leave for Canadians across the country. The new Cabinet will also get to work on putting home ownership back in reach for Canadians, accelerate climate action to build a cleaner country and create new middle class jobs, and continue to work with Indigenous partners and communities to walk the shared path of reconciliation.</p>\n\n<p>With the announcement of Parliament’s return, the Prime Minister has reached out to the opposition leaders to discuss the priorities of Canadians in phone calls to take place early next week. Among the first orders of business will be working with all parties to ensure all Members of Parliament in the House of Commons are fully vaccinated against COVID-19. Canadians expect their elected representatives to lead by example in the fight against this virus, and the Prime Minister will be raising this with other leaders.</p>\n\n<p>The government is committed to finding common ground with, and to working alongside, our parliamentary colleagues to ensure Canadians continue to be protected from the virus and receive the support they need. One of the immediate areas of focus for the next Parliament will be the COVID-19 support benefits that many Canadians and businesses still rely on, and the government will work collaboratively with other parliamentarians to continue to have Canadians’ backs.</p>\n\n<p>Since 2015, the Government of Canada has been making real progress on the issues that matter most to Canadians – but there is still so much more to do. Together, we can tackle the challenges we face and create a better future and country for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“From finishing the fight against COVID-19 to getting the job done on $10-a-day child care for families across the country, Canadians chose to move forward in September. Together, we will keep working hard to beat this virus and get Canadians vaccinated, create jobs and grow the middle class, put home ownership back in reach, accelerate climate action, and take important steps forward on the path of reconciliation. Our government will continue to be there for Canadians in this crisis, and we will work to move Canada forward – for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote></div>\n      "
}