{
  "path": "/en/news/news-releases/2016/05/13/prime-minister-announces-changes-employment-insurance-three",
  "pageTitle": "Prime Minister announces changes to employment insurance for three additional EI economic regions | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is a great country because we work hard – and we take care of each other. Whether it is recovering from a disaster like a wildfire, or helping our neighbours get back on their feet after a job loss, we lend a hand in tough times.</p>\n<p>The Prime Minister, Justin Trudeau, today announced changes to provide extended Employment Insurance (EI) benefits in three other EI economic regions.</p>\n<p>In Budget 2016, twelve EI economic regions were listed as qualifying for extended benefits due to the downturn in the commodities sector. The Government of Canada promised to monitor the economic situation following the budget, and today fulfilled that commitment by announcing three final additions to this list: Edmonton; Southern Interior British Columbia; and Southern Saskatchewan. This completes the assessment, and no more regions will be added.</p>\n<p>This extension will mean that those who are eligible for EI can claim an additional five weeks of benefits for regular claimants, and a further 20 weeks of benefits for long-tenured workers. These benefits will be available for one year – beginning July 3, 2016 – and will apply retroactively to anyone who started a claim on or after January 4, 2015, and is still unemployed.</p>\n<p><strong>Quote</strong></p>\n<p>“Today’s announcement is about helping three other EI regions facing tough economic times. The commodities downturn has been particularly difficult for many Canadian communities, and the EI provisions announced today will make it easier for claimants who are eligible for EI to collect the benefits they need. We lend a hand in tough times. It is who we are, and what we do.”</p>\n<p>- <em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Associated Link</strong></p>\n<ul>\n<li><a href=\"http://www.budget.gc.ca/2016/docs/plan/ch1-en.html#_Toc446106658\">Budget 2016 – Improving Employment Insurance</a></li>\n</ul></div>\n      "
}