{
  "path": "/en/news/news-releases/2017/06/16/prime-minister-announces-significant-funding-extend-ottawas-light",
  "pageTitle": "Prime Minister announces significant funding to extend Ottawa’s Light Rail Transit system | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>A modern public transit system means shorter commute times, less air pollution, more time with family and friends, and stronger economic growth. Now is the time to invest in building new urban transit networks.</p><p>The Prime Minister, Justin Trudeau, today announced up to $1.09 billion in funding for the Ottawa Light Rail Transit Stage 2 Project, which will better connect the east, west and south areas of Canada’s capital. The Province of Ontario has also made a similar funding commitment to the project. The City of Ottawa is responsible for the balance of the funding.</p><p>With Ottawa’s population expected to grow to 1.14 million people over the next 15 years, it is important that the city’s public transit becomes more efficient and inclusive for residents and visitors. Stage 2 of this project will see an additional 38.8 kilometres of rail and 23 new stations added to Stage 1 of the light rail transit system currently under construction. This new stage of construction will begin in 2019.</p><p>When construction is completed in 2023, 70 per cent of Ottawa residents will live within five&nbsp;kilometres of light rail transit. In addition to reducing congestion, increasing ridership, and improving safety, the expansion will allow people from Orléans, Nepean, and South Ottawa to quickly and easily get around the city.</p><h2>Quotes</h2><blockquote><p>“The expansion of Ottawa’s light rail transit system will make it easier for residents and visitors alike to get around and experience everything our capital city has to offer. This expansion will help Canadians get to work and back home to their families on time, make our air cleaner, and create good, well-paying middle class jobs.”<br> —&nbsp;<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Government of Canada is proud to be part of this important project for the National Capital Region, in partnership with the Government of Ontario and the City of Ottawa. Public transit is at the heart of our government’s vision to build strong, sustainable and inclusive communities. A project like the Ottawa LRT will make it easier for people to connect with the services they need while reducing gridlock and greenhouse gas emissions.”<br>—&nbsp;<cite>The Hon. Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><h2>Quick facts</h2><ul><li>In addition to what was announced today, over $66 million in approved federal funding through the Public Transit Infrastructure Fund has been provided for four projects related to Stage 2: $45M for early works and engineering, $20M for new light rail vehicles, $1.25M for design of a rail-to-rail grade separation, and $100K for consultation with Indigenous communities.</li><li>The Government of Canada provided up to $762 million for Stage 1 of the Ottawa Light Rail Transit Project.</li><li>The Government of Canada’s funding for this project will be provided through the Investing in Canada Plan.</li><li>The Government of Canada will provide more than $180 billion in infrastructure funding over 12 years for public transit, green infrastructure, social infrastructure, transportation that supports trade, and Canada’s rural and northern communities.</li><li>To support public transit, Budget 2017 proposed $25.3 billion. This amount includes $5 billion that will be invested in public transit systems by the Canada Infrastructure Bank.</li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2017/06/16/stage-2-expansion-ottawa’s-light-rail-transit-system\">Stage 2 expansion of Ottawa’s Light Rail Transit System</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada, the Government of Canada's new $180 billion infrastructure plan</a></li><li><a href=\"http://www.stage2lrt.ca/\">Ottawa Light Rail Transit: Stage 2 Rail</a></li></ul></div>\n      "
}