{
  "path": "/en/news/news-releases/2022/07/11/prime-minister-announces-reappointment-dr-mona-nemer-canadas-chief",
  "pageTitle": "Prime Minister announces reappointment of Dr. Mona Nemer as Canada’s Chief Science Advisor | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the reappointment of Dr.&nbsp;Mona Nemer as Canada’s Chief Science Advisor for a term of two years. Dr. Nemer’s reappointment is effective September 25, 2022.</p>\n\n<p>Scientific research and expertise are essential to ensuring Canadians are well informed and the government has the necessary tools to address the most pressing issues we face as a country. As Chief Science Advisor, Dr. Nemer will continue to provide impartial scientific advice to the Prime Minister, the Minister of Innovation, Science and Industry, and Cabinet so that science is considered in public policy decisions and that government science is fully available to Canadians.</p>\n\n<p>A distinguished medical researcher in the field of molecular cardiology, Dr. Nemer has served as Canada’s Chief Science Advisor since 2017. Prior to this role, she was Professor and Vice-President of Research at the University of Ottawa and Director of the school’s Molecular Genetics and Cardiac Regeneration Laboratory. She has served on various national and international scientific advisory committees and boards, including Canada’s COVID-19 Immunity Task Force and COVID-19 Vaccine Task Force.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As Canada’s Chief Science Advisor, Dr. Nemer has provided critical advice to the Government of Canada to ensure that decision-making is informed by science. Over the past two years in particular, she has been invaluable in helping us better understand and address the impacts of the pandemic for Canadians. I am pleased that she has agreed to continue in this role and look forward to continue working with her to keep science at the heart of what the government does.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Now, more than ever, our government understands how critical science is to inform evidence-based decisions for innovation and growing the Canadian economy. We’re grateful to have Dr. Nemer continue her important work as Canada’s Chief Science Advisor. I look forward to continue working with Dr. Nemer to cement Canada’s global leadership in science and innovation.”</p>\n\n<footer class=\"default\">The Hon. François-Philippe Champagne, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am honoured to continue serving as Canada’s Chief Science Advisor. Over the past two years, we have seen how science can benefit society as new knowledge guided policy and produced life-saving therapies. It has been the privilege of a lifetime to serve the country during these exceptional times. I look forward to working with the scientific community and policy makers to champion science nationally and internationally for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">Dr.&nbsp;Mona Nemer, Canada’s Chief Science Advisor</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Dr. Nemer was first appointed as Canada’s Chief Science Advisor in 2017, following an open, transparent, and merit-based selection process. She was reappointed to this role for a two-year term in 2020.</li>\n\t<li>The Office of the Chief Science Advisor is housed at Innovation, Science and Economic Development Canada.</li>\n\t<li>The Chief Science Advisor’s key functions include:\n\t<ul>\n\t\t<li>providing advice on the development and implementation of guidelines to ensure that government science is fully available to the public and that federal scientists are able to speak freely about their work.</li>\n\t\t<li>providing advice on creating and implementing processes to ensure that scientific analyses are considered when the government makes decisions.</li>\n\t\t<li>assessing and recommending ways to improve the existing science advisory function within the federal government.</li>\n\t\t<li>assessing and recommending ways for the government to better support quality scientific research within the federal system.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/07/11/dr-mona-nemer-cm-cq-frsc\">Dr.&nbsp;Mona Nemer, C.M., C.Q., FRSC</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/063.nsf/eng/h_97646.html\">Office of the Chief Science Advisor</a></li>\n\t<li><a href=\"/en/news/news-releases/2017/09/26/prime-minister-introduces-canadas-new-top-scientist\">Prime Minister introduces Canada’s new top scientist</a></li>\n\t<li><a href=\"/en/news/news-releases/2020/10/01/prime-minister-announces-reappointment-canadas-top-scientist\">Prime Minister announces reappointment of Canada’s top scientist</a></li>\n</ul></div>\n      "
}