{
  "path": "/en/news/readouts/2022/03/08/prime-minister-justin-trudeau-meets-prime-minister-latvia-krisjanis-karins",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Latvia Krišjānis Kariņš | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Latvia, Krišjānis Kariņš, in Riga, Latvia.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Kariņš condemned Russia’s further aggression against the territorial integrity, sovereignty, and independence of Ukraine. The two prime ministers called on Russia to facilitate the opening of a humanitarian corridor to save lives. They condemned the recent and irresponsible Russian attack on a nuclear power plant in Zaporizhzhia, Ukraine, and the utter disregard for its potential consequences.&nbsp;</p>\n\n<p>Prime Minister Kariņš thanked Canada for increasing the number of troops and military equipment in Latvia and recognized Canada’s decision to renew its commitment to Operation REASSURANCE as a reflection of Canada’s commitment to the North Atlantic Treaty Organization (NATO) and long-term regional security.</p>\n\n<p>Prime Minister Trudeau thanked Prime Minister Kariņš for Latvia’s support for the Canada-European Union Comprehensive Economic and Trade Agreement, and for Latvia’s efforts to promote ratification of the agreement within the European Union. The two leaders agreed that strong trade ties among like-minded countries are more important than ever, and both prime ministers reaffirmed their shared commitment to building partnerships between the two countries.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/latvia-lettonie/relations.aspx?lang=eng\">Canada-Latvia relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n</ul></div>\n      "
}