{
  "path": "/en/news/statements/2018/02/25/statement-prime-minister-closing-2018-winter-olympics",
  "pageTitle": "Statement by the Prime Minister on the closing of the 2018 Winter Olympics | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the closing of the 2018 Winter Olympics in PyeongChang, South Korea:</p><p>“Today, as the 2018 Olympic Winter Games draw to a close in PyeongChang, we celebrate the extraordinary athletes who represented Canada during this year’s events. Team Canada reached new heights this year and earned 29 medals – our national best.</p><p>“For the last two weeks, Canadian athletes filled us with pride, kept us up late, and took our breath away, event after event. You brought power, speed, grace, and spirit, and pushed the boundaries in every sport. You showed us what it looks like to give your all – and you taught us the true meaning of being a team.</p><p>“Our athletes’ achievements are a testament to the effort, sacrifice, and perseverance it took to make it to the Olympics – and behind every athlete stand coaches, families, friends, and communities. Their strong support over the years has helped our Canadian athletes to shine and represent us all with passion and pride on the world stage.</p><p>“I also salute the athletes from around the world on their remarkable achievements and extend my heartfelt thanks to South Korea for organizing such successful games. We look forward to the upcoming PyeongChang 2018 Paralympic Winter Games, where sport, athletes, and their stories will once again bring us all together.</p><p>“On behalf of all Canadians, I congratulate all our Olympic athletes. You represent the best of Canada’s diversity and strength, and your achievements will inspire us for generations to come. Team Canada, you make us proud.”</p></div>\n      "
}