{
  "path": "/en/news/statements/2021/11/14/statement-prime-minister-world-diabetes-day-and-100th-anniversary",
  "pageTitle": "Statement by the Prime Minister on World Diabetes Day and the 100th anniversary of the discovery of insulin | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Diabetes Day and the 100th anniversary of the discovery of insulin:</p>\n\n<p>“Diabetes is a chronic health condition experienced by hundreds of millions of people in Canada and around the world. Today on <a href=\"https://www.un.org/en/observances/diabetes-day\">World Diabetes Day</a>, we unite with the global community to raise awareness about this disease and to celebrate the 100th anniversary of the discovery of insulin.</p>\n\n<p>“In 1921, insulin was discovered by a team of four scientists at the University of Toronto – Sir&nbsp;Frederick Banting, Dr. Charles Best, Dr. James Collip, and Dr. John Macleod. Two years later, in recognition of this major scientific breakthrough, Frederick Banting and John Macleod were jointly awarded the Nobel Prize in Physiology or Medicine. Insulin has since been used as a treatment for diabetes and has helped save millions of lives. The discovery of this lifesaving drug was a defining moment for both Canada and the world. World Diabetes Day is marked every year on Sir Frederick Banting’s birthday, and the discovery of insulin has inspired generations of Canadian researchers to follow in the footsteps of these four pioneers.</p>\n\n<p>“The theme for World Diabetes Day – Access to Diabetes Care – emphasizes the importance of continuing care and support for people with diabetes, to help them manage the disease and prevent complications. The negative effects of COVID-19 on people living with this condition have also highlighted the need for further research into diabetes. Approximately 3.2 million Canadians are living with diabetes and more than 200,000 new cases are diagnosed each year, making it one of the most prevalent chronic diseases in the country. This includes Indigenous peoples, who are amongst those at highest risk for diabetes and related complications.</p>\n\n<p>“As part of Budget 2021, the Government of Canada announced $25 million in funding over five years, starting in 2021-22, to support diabetes research, surveillance, and prevention, and the development of a national framework for diabetes. We will work with Diabetes Canada, JDRF Canada, provinces and territories, Indigenous organizations, and other stakeholders to inform the development of this framework that will help deliver improved access to prevention and treatment, and better health outcomes for Canadians. The government is also investing an additional $10 million to support the creation of a new Diabetes Challenge Award, an initiative designed to advance diabetes prevention and promote the development and testing of new interventions to reduce the risks associated with type 2 diabetes.</p>\n\n<p>“The government will also invest $8.4 million in Indigenous-led and community-driven research grants to treat and prevent diabetes in Indigenous communities. This represents an important step in the development of prevention and treatment programs that aim to reverse the rise of diabetes and diabetes-related complications in First Nations, Inuit, and Métis communities. Finally, we are working with our international partners to support diabetes research, including through a joint $5.6 million initiative with the Netherlands to fund research on the prevention of type 2 diabetes.</p>\n\n<p>“The Government of Canada will continue to work with partners and stakeholders towards the prevention and treatment of diabetes. For example, since 2017, the Government of Canada has collaborated with JDRF Canada to improve the well-being of Canadians living with type 1 diabetes and to find a cure. To celebrate the 100th anniversary of the discovery of insulin, the Government of Canada is reaffirming its partnership with JDRF Canada through a $30 million joint investment over the next five years, starting in 2022-23, to help accelerate scientific advances in the prevention and treatment of diabetes.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me in recognizing World Diabetes Day and the 100th anniversary of the discovery of insulin. Today is an opportunity for us to learn more about diabetes and its associated health risks, and to reflect on the historic discovery of insulin, which has provided hope to millions globally. Together, we can move towards healthier living and improve the health and well-being of all people living with this disease, in Canada and around the world.”</p></div>\n      "
}