{
  "path": "/en/news/statements/2020/10/11/statement-prime-minister-international-day-girl",
  "pageTitle": "Statement by the Prime Minister on International Day of the Girl | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the Girl:</p>\n\n<p>“On the&nbsp;<a href=\"https://cfc-swc.gc.ca/commemoration/whm-mhf/girl-fille-en.html\">International Day of the Girl</a>, we celebrate the voices and power of girls in Canada and around the world. Every day, girls prove that they are unstoppable by breaking down barriers to help create a more equal world for all.</p>\n\n<p>“This year’s United Nations theme – <a href=\"https://www.un.org/en/observances/girl-child-day\">My Voice, Our Equal Future</a> – reminds us that everyone benefits when girls have the opportunities they need to reach their full potential. It also recognizes the work still to be done to achieve gender equality and to advance their empowerment. Now more than ever, we need to ensure that girls, in all their diversity, have the freedom and support to fulfill their dreams.</p>\n\n<p>“Every girl has the right to live a life free from violence, learn new skills, and make an impact. That’s why the Government of Canada is continuing to work to end gender-based violence, improve access to education for girls, support their career choices, and increase their political participation and leadership.</p>\n\n<p>“The safety of women and girls must be the foundation on which all progress is built. The government is accelerating investments in shelters and transition housing to support women and children fleeing violence, and moving forward on a National Action Plan on Gender-Based Violence. This year, we have invested $100 million to help organizations that provide supports and services to those experiencing gender-based violence. We also continue to work closely with our partners to co-develop a National Action Plan that will address the ongoing national tragedy of missing and murdered Indigenous women, girls, and LGBTQ and two-spirit people.</p>\n\n<p>“The Government of Canada has also announced a Skilled Trades Awareness and Readiness program to encourage Canadians, including women and youth, to pursue careers in the skilled trades. Through my Youth Council and Canada’s first-ever youth policy, we are working to ensure that girls are getting involved in issues that matter to them, coming up with solutions, and creating positive change for themselves, their communities, their country, and the world.</p>\n\n<p>“Canada knows that gender equality and the empowerment of women and girls is essential to achieving each of the 17 Sustainable Development Goals at home and abroad. This is now more crucial than ever, as the global COVID-19 pandemic threatens the progress that has so far been made in achieving these goals. Through our Feminist International Assistance Policy, Canada continues to support girls and make important investments in their health and education, in humanitarian assistance, and in work to eliminate gender-based violence. Canada has also been a global leader on actions to end child, early, and forced marriage and has supported girls to make their own choices in all aspects of their lives.</p>\n\n<p>“International Day of the Girl is an important part of <a href=\"https://cfc-swc.gc.ca/commemoration/whm-mhf/index-en.html\">Women’s History Month</a> here at home, and a reminder that women and girls can change the world. By continuing to raise their voices as well as defend and advance their rights, girls are transforming their communities and shaping a better, fairer, and more inclusive future for everyone.”</p></div>\n      "
}