{
  "path": "/en/news/statements/2019/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p>\n\n<p>“On&nbsp;<a href=\"https://earthday.ca/\">Earth Day</a>, we come together with people around the world to celebrate the planet we share. We also take stock of the significant challenges facing our environment – climate change first among them.</p>\n\n<p>“People around the globe are already facing the devastating effects of climate change. And from the&nbsp;<a href=\"https://www.ipcc.ch/sr15/\">IPCC report</a>&nbsp;last fall to the recent&nbsp;<a href=\"https://www.nrcan.gc.ca/environment/impacts-adaptation/21177\">Canada’s Changing Climate report</a>, the outlook is clear: only with ambitious, concerted action can we safeguard the environment we all depend on, for our generation and the next. Today, we come together as a world to fight for our future.</p>\n\n<p>“Climate change is already affecting us here at home. Canada’s North is heating up at three times the global average. Glaciers are shrinking. Sea levels are rising. Our oceans are warming and acidifying as they trap carbon dioxide. Floods, fires, heat waves, tornadoes – extreme weather phenomena are becoming more intense and more frequent, threatening communities across the country.</p>\n\n<p>“Canadians are stepping up to protect their communities, and taking the lead on climate action. Since 2015, the federal government has been in their corner. We put a price on pollution to reduce emissions, protect our clean air and water, and create opportunities for Canadian businesses. With&nbsp;<a href=\"https://www.budget.gc.ca/2019/docs/plan/chap-02-en.html#Part-2-Affordable-Electricity-Bills-and-a-Clean-Economy\">Budget 2019</a>, we’re making zero-emission vehicles more affordable, investing in more energy efficient buildings, and supporting communities’ environmental priorities. By working together – with provinces and territories, Indigenous peoples, and all communities – we can tackle climate change head on, and safeguard our quality of life now and for the future.</p>\n\n<p>“But this global problem needs global solutions. Canada is working with partners around the world to meet our&nbsp;<a href=\"https://www.canada.ca/en/environment-climate-change/services/climate-change/paris-agreement.html\">Paris Agreement</a>&nbsp;commitments, and fight climate change and its disastrous effects – including by helping developing countries fund adaptation and resiliency measures. Our world’s oceans and coastal communities bear particular impacts of climate change, and Canada is a leader in protecting them – from our historic <a href=\"https://www.tc.gc.ca/eng/canada-oceans-protection-plan.html\">Oceans Protection Plan</a> to the&nbsp;<a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\">Ocean Plastics Charter</a>&nbsp;launched under our G7 presidency. We are also partnering with the Government of Nunavut and the Qikiqtani Inuit Association to explore the potential protection of areas in&nbsp;Tuvaijuittuq – the last area of Canada’s High Arctic region expected to retain summer sea ice until at least 2050.</p>\n\n<p>“Climate change is bigger than any one of us. We only have one Earth, and that’s what’s on the line. Our environment is our future. We’re going to fight for it, for all of us.”</p></div>\n      "
}