{
  "path": "/en/news/news-releases/2022/01/21/prime-minister-hold-virtual-cabinet-retreat",
  "pageTitle": "Prime Minister to hold virtual Cabinet retreat | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a virtual Cabinet retreat from January 24 to 26.</p>\n\n<p>The Cabinet retreat will focus on the Government of Canada’s efforts to address the economic impacts of the COVID-19 pandemic and work toward a strong recovery that benefits all Canadians. This includes creating jobs, investing in a green economy, and supporting Canadians and businesses as we get through the Omicron wave. It also includes delivering on $10-a-day child care, getting the job done on the vaccine rollout, tackling the climate crisis, and creating affordable housing. Ministers will discuss these and other priorities as we work to grow the middle class and those who are working hard to join it.</p>\n\n<p>The Government of Canada will continue to work with the provinces, territories, municipalities, Indigenous Peoples, global partners, businesses, and other stakeholders on the outlined priorities and other important issues. As Parliament resumes at the end of the month, the government will also work with all parliamentarians to deliver positive results, support Canadians through COVID-19, and continue to find real solutions to challenges at home and abroad.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“With the start of a new year, this Cabinet retreat will be an important opportunity to discuss the government’s focus on building a more resilient economy, making life more affordable, and creating jobs and growing the middle class. Together, we will continue to build a safer, more prosperous, and fairer Canada that works for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/cabinet\">Cabinet</a></li>\n</ul></div>\n      "
}