{
  "path": "/en/news/statements/2016/03/03/communique-canadas-first-ministers",
  "pageTitle": "Communiqué of Canada's First Ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada's First Ministers today issued a joint communiqué following the First Ministers' Meeting and released a declaration on clean growth and climate change:</p>\n<p>\"In the spirit of cooperation and collaboration, we met today to discuss the economy and actions to address climate change and agreed on immediate work to support growth and create new jobs.</p>\n<p>\"Building on commitments and actions already taken by provinces and territories and the momentum from COP21 in Paris, we are moving toward a pan-Canadian framework for clean growth and climate change that will meet or exceed Canada's international emissions targets, and will transition our country to a stronger, more resilient, low-carbon economy – while also improving our quality of life.</p>\n<p>\"We know that a fair transition to a sustainable, low-carbon economy is necessary for our collective prosperity, competitiveness, health, and security. Taking smart and effective action today is essential for future generations. These decisions will put Canada at the forefront of the global clean growth economy, and will create opportunities to diversify our economies, open up access to new markets, reduce emissions, and generate good paying, long-term jobs for Canadians.</p>\n<p>\"To achieve our goals, we will build on the leadership shown and actions taken by the provinces and territories, as exemplified by the 2015 Quebec Declaration.</p>\n<p>\"For its part, the Government of Canada committed to the following:</p>\n<ul>\n<li>support climate change mitigation and adaptation through investments in green infrastructure, public transit infrastructure and energy efficient social infrastructure;</li>\n<li>work together with the provinces and territories on how best to lever federal investments in the Low Carbon Economy Fund to realize incremental emission reductions;</li>\n<li>advance the electrification of vehicle transportation, in collaboration with provinces and territories;</li>\n<li>foster dialogue and the development of regional plans for clean electricity transmission to reduce emissions;</li>\n<li>advance efforts to eliminate the dependence on diesel in Indigenous, remote, and Northern communities – and use renewable, clean energy as a replacement; and</li>\n<li>as part of Canada's participation in Mission Innovation, double investments in clean energy, research and development over five years, and work with global partners to promote cleaner energy and better environmental outcomes.</li>\n</ul>\n<p>\"We will identify measures that governments can take to grow their economies and reduce emissions in the long term.</p>\n<p>\"To this end, we directed immediate work in four areas: clean technology, innovation, and jobs; carbon pricing mechanisms adapted to each province's and territory's specific circumstances and in particular the realities of Canada's Indigenous peoples and Arctic and sub-Arctic regions; specific mitigation opportunities; and, adaptation and climate resilience. Four working groups will be established to report on these priorities. Their reports including options will be submitted to the ministerial tables charged with overseeing their work and will be made public. Ministers will review those reports and provide their recommendations to First Ministers by October 2016. Those recommendations and the reports of the working groups will be used to develop the pan-Canadian framework for clean growth and climate change, a concrete plan that will also allow us to meet our international commitments.</p>\n<p>\"In addition, federal, provincial and territorial energy ministers will collaborate on work underway on energy efficiency and clean energy technology and innovation through the Council of the Federation's Canadian Energy Strategy, in order to contribute to the pan-Canadian framework on clean growth and climate change.</p>\n<p>\"We took stock of the economy and discussed real challenges facing Canadians as well as longer-term opportunities. We have a shared objective to promote jobs and growth, address urgent economic needs, and support long-term growth in transitioning to a low-carbon economy.</p>\n<p>\"We recognize that making strategic investments in our economy to spur economic growth in the short term will benefit our economy and protect the environment. That is why the federal government committed to fast-track existing infrastructure allocations in all provinces and territories, in addition to making significant new investments in infrastructure.</p>\n<p>\"We recognize the critical importance of fostering innovation, attracting investment, encouraging trade, and developing the skills of our workforce to create good jobs and grow the economy. We have directed ministers to work together to advance these shared priorities.</p>\n<p>\"We also agreed to pursue necessary reforms to the Agreement on Internal Trade to benefit Canadians, as well as help Canadian businesses to grow their exports and be more competitive on the world stage.</p>\n<p>\"We agreed on the importance and urgency of moving Canada's resources to market in responsible, timely, predictable and sustainable ways that Canadians trust, based on robust science-based environmental assessments conducted within existing jurisdictional frameworks and that contribute to long-term economic growth and job creation.</p>\n<p>\"In the <a href=\"http://www.scics.gc.ca/english/Conferences.asp?a=viewdocument&amp;id=2401\">Vancouver Declaration</a> on Clean Growth and Climate Change, we have outlined the vision and principles that will guide our governments as we move towards sustainable and clean economic growth. Federal, provincial, and territorial governments will work together to make this vision a reality. We will work collaboratively with Indigenous peoples across the country to ensure a more sustainable and prosperous future for Canada. We also recognize that businesses, civil society, and individual Canadians should be mobilized to achieve these goals.</p>\n<p>\"Building on our progress today, we are confident that we will tackle the short-term economic challenges and set the country on a path towards long-term clean growth, emissions reductions, and a more prosperous, green, and healthy future for all Canadians.\"</p></div>\n      "
}