{
  "path": "/en/news/statements/2021/11/23/gichi-gaanada-ogimaa-odikidowin-gichi-ogimaa-desabiwining-onji",
  "pageTitle": "Gichi-Gaanada-Ogimaa odikidowin Gichi-Ogimaa-desabiwining onji | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Gichi-Gaanada-Ogimaa Justin Trudeau owe ikido noongom gaa-giizhigak Gichi-Ogimaa-desabiwining onji:</p>\n\n<p>“Midaaso-shi-zhaangaso-giizis 19 e-ayaamagak iwe gichi-aakoziwin, Gaanada Akiing gaa-ayaawaad maadakamigiziwag noongom Binaakwii-giizis gaa-izhiseg. O-gii-inaawaa’ gichi-ogimaawigamigong gaa-ayaanid aaniin ge-izhi-maamawi-anokaadegiban ji-dazhiikigaadeg iwe GOOBID-19 aakoziwin gaye ji-mikigaadeg aaniin ge-izhichigeng ji-debinigaadeg mino-bimaadiziwin Gaanada Akiing. Gaanada Aki Ogimaawiwining nin-bizindawaanaanig omaa gaa-ayaawaad ji-ozhiitaaying ji-giizhi-miigaadamang iwe GOOBID-19 aakoziwin, ji-gwayakotoo-wing gaye gaa-izhiwebak agwajiing, nawach gaye ji-aakogindesinog gegoon, gaye ji-mino-wiijiiwiindwaa Anishinaabeg, gaye ji-gashkichigaadeg ji-dibenjigaa-degin daawinan, ji-ozhichigaadeg anokiiwin gaye ji-wiiji’indwaa igi-gaa-gichi-zhooniyaakesigwaa.</p>\n\n<p>“Ji-gagwe-minoseg ge-izhiseg ani-akiiwang gi-daa-izhichigemin ji-badagonamang iwe gichi-aakoziwin gaye ji-giizhichigaadegin mashkikiin ge-aabadakin. Gi-maamawi-dazhiikaamin iwe ji-ani-minoseg. Awashime 86 endaso-ngodwaak Gaanada Akiing gaa-ayaawaad awiyag niizhwaa gii-jiitawaawag gaye nin-gii-inaakonigemin gakina ogimaawining gaa-anokiiwaad gaye gakina awiya gaa-babaamaadizid omaa Gaandada Akiing ji-jiita’ond aaniin igo izhi-bimibizod gaa-bimisemagak, ishkode-odaabaan gemaa gichi-jiimaan. Odaanaang gaa-dwaateg Mino-ayaawin Gaanada o-gii-bagidinaanaawaa mashkiki ge-aabajitoowaad abinoojiiyag naanan biinish midaaso-shi-bezhig 11 gaa-daso-biboonewaad gaye ogimaa GOOBID-19 mashkikiin gaye gaa-gaanjiseg mashkiki ji-aabadakin. Giishpin gakina Gaanada Akiing gaa-ayaawaad gashkitoowaad ji-jiita’ondwaa GOOBID-19 onji, gi-daa-onjimino-ayaamin gaye aakoziiwigamigoon ji-minosegin. Gichi-ogimaa o-da-wiiji’aa’ Gaanada Akiing gaa-ayaanid awiya nawach wiiba ji-jiita’ondwaa awiyag GOOBID-19 gii-ayaamagak, gaye akiwenziiwigamigong gaa-izhidaawaad ji-minosewaad gaye mino-inendamowin ji-anokaadeg nawach. Gaanada Akiing gaa-ayaawaad awiyag da-onji-mino-bimaadiziwag ani-akiiwang.</p>\n\n<p>“Badagonamang iwe gichi-aakoziwin, gi-ga-anokaadaamin gaye zhooniyaakewin ji-onji-mino-bimaadiziwaad gakina awiyag. Ji-gashkichigaadeg iwe, gichi-ogimaa o-da-asaa’ niigaan Gaanada Akiing gaa-ayaanid nitam ji-debinigaadeg ge-minoseg ani-akiiwang. Gi-ga-gagwe-izhichigemin ji-niisagindeg gegoon gaa-adaaweng ji-bimaadizing gaye ji-debinigaadeg izhidaawin gaye ganawenimaawasowin ji-anokiing. Gi-ga-wiiji’aanaan ji-dibendang owaakaa’igan awiya Gaanada gaa-ayaad iwe NItam Waakaa’igan Adaawewin izhichigewin gaye Ji-diba’igaadeg Biinish Dibenjigaadeg izhichigewin gaye jiwiiji’ind gaa-adaawed nitam waakaa’iganan. Wiidookawindwaa awiyag gaawiin gaa-gichi-zhooniyaakesigwaa nawach ji-gash-kitoowaad ji-mino-bimaadiziwaad gaye igi gaa-gidimaagiziwaad ji-gashki’owaad. Mii iwe gaa-gii-onji-nakobii’amaang zhaangaso ganawenimaawaso nakobii’iganan akiikaaning zhaawanong gaye giiwedinong aabita eta ji-diba’igaadeg iwe dino ani-izhiseg gikinoonowin gegaa miziwe, ji-ozhichigaadegin oshki-ganawenimaa-wasoowigamigoon omaa akiing gaye gikino’amaadiiwigamigoong ge-izhaawaad gaa-agaashiiwiwaad abinoojiiyag $10 daso-giizhig ji-diba’amowaad enokiiwaad. Gaanada Ogimaa o-da-debinaan iwe $10 endaso-giizhig ji-inangideg ganaweni-maawasowin gaye nawach ji-mino-bimaadiziwaad Gaanada Akiing eyaawaad.</p>\n\n<p>“Ji-ozhichigaadeg owe dinookaan zhooniyaake-izhichigewin, ji-ozhichigaadeg gaye anokiiwin, ji-minosewaad igi gaa-ozhooniyaamisigwaa niibiwa, Gaanada daa-gagwe-izhichige ji-maanzhidoodanziwang owe aki, gii-maanzhi-izhiwegak. Mii iwe wenji-gagwe-gibitinamaang ishpiming gii-inaabateg gaa-baashkineyaag, gii-asangid zhooniyaa basag ji-aabaji’indwaa gaawiin memwaach ji-bimibizoawad awiyag gaye waasigani-odaabaanag ji-aabaji’indwaa. Gidayaamin ge-aabajitooying gaye ge-anokiiwaad ji-ayaamagakin ge-bekangin gegoonan ji-onji-baashkineyaasinog ishpiming gaye ji-onji-zhooniiyaakeng. Gaanada Aki ogimaa o-da-wiiji’aa’ gaa-anokiinid gaye zhooniyaakewinan ji-debinamang zhooniyaakewin ani-akiiwang bekish bekichigaadeg gaa-bagidinaa-moying ji-gichi-izhiwebasinog gaye agwajiing omaa Gaanada Akiing. Maamaw gi-daa-wiijitoomin babenag ji-izhiwebak agwajiing, gaawiin wiin eta ji-onji-ganawenjigaadeg aki, ji-wiijichigaadeg gaye zhooniyaakewin ji-onji-mino-bimaadizid gakina awiya gaa-anokiid.</p>\n\n<p>“Gakina Gaanada Akiing gaa-ayaad daa-mino-bimaadizi endaad aazha dash ani-baatiinadan nishiwewin baashkiziganing onji gichi-oodenaang Gaanada Akiing. Aanawi nindinaakonigemin nawach ji-ganawenjigaadeg awenen ge-dibendang baashkizigan, giiyaabi niibiwa ayaamagan ge-izhichigenaaniwang ji-minoseg. Mii iwe gaa-onji-giiwe-adaaweyaang miigaazoo-baashkiziganan gaye ni-wiidanokiimaanaanig akiikaaning gaa-ayaawaad ji-aabajitoosigwaa gaa-dakonigaadegin baashkziganan.</p>\n\n<p>“Gaanada ogimaa gaye da-izhichige weweni ji-bimaadizid gakina awiya, ji-gashki-tood ji-debinang mino-bimaadiziwin, awenenigo inini ikwe awenenan gaye wii-zhawenimaawaad aaniindigo wenjiiwaad wegonenigo ezhigiizhwewaad aaniinigo ezhi-debweyendamowaad gemaa aaniinigo enizhagayewaad. Nin-ga-miigaadaamin gii-bakaanenimindwaa awiyag bakaan e-onjiiwaad, gaye gii-ikwewiwaad gaye gii-dabasenimindwaa gidazhiikkewininaaning gaye ji-wiiji’in-dwaa gaa-makadewizhagewaad gaye bakaan gaa-onjiiwaad gaye Anishinaabeg. Nin-ga-ishpinaanaanig gaye igi gaa-bakaanenindizowaad gaawiin ikwe gemaa inini gaa-inenindizisigwaa ji-gashkitoowaad ji-aanji’idizowaad gaye nin-ga-wiiji-aanaanig baakwaa’ishag agwajiing Quebec gaa-ayaawaad.</p>\n\n<p>“Gaawiin dash owe mino-bimaadiziwin daa-gashkichigaadesinoon baamaa nawach wiiba gagwe-anokaad gwayakosijigewin. Gaanada Akiing gaa-ayaawaad gii-gagwaanisagendamoog gii-mikigaadegin gaa-gii-izhi-ningwa’ondwaa anishinaabensag gete-gikino’amaadiiwigamigong. Omaa akiing gaye ogimaawining, gi-daa-dibaajimomin ono gagwaadagaajimo-winan ji-gwayakosijigaadeg gaa-gii-maanzhidoodawindwaa anishinaabeg mewinzha, ji-gwayakoseg gakina gegoon. Gaanada Aki ogimaa o-da-wiiji’aa’ Anishinaabe’ dazhiikewining gaa-ayaawaad ji-mino-bimaadiziwaad ji-debinigaadeg gwayak inendamowin gaye mino-ayaawin gaye ji-nakwetamang gaa-gii-ikidoomagak imaa Debwewin gaye Gwayakosijige-win mazin’aiganin gaa-gii-wiindeg aaniin ge-izhichigeng, ji-asind awiya ge-dazhii-kang ji-gwayakosijigaadeg gaa-maanzhichigemagakin gikino’amaadiiwigamigoon. Ogimaa gaye o-da-wiidanokiimaa’ Anishinaabe ji-gwayakosijigaadeg gaa-izhise-waad Anishinaabekweg, Ikwezensag gaye Gaa-bakaanenindizowaad gaa-gii-wanisewaad gaa-gii-nisindwaa ji-wiiji’indwaa gaye igi Abinoojii Wiiji’iwewin izhichigewin gaa-maanzhidoodaagowaad gii-odaapindwaa oniijaanisiwaa’. Maamaw, gi-ga-wiiji’aanaanig ji-mino-bimaadiziwaad Anishinaabeg, Eshkiimeg gaye Aabitawizhaanag gaye ji-debinamowaad minosewin ani-akiiwang.</p>\n\n<p>“Gegapii dash, ogimaa onisidawinaan gakina e-maamawi-bimaadiziying. Iwe gichi-aakoziwin gii-ayaamagak omaa ezhi-waabandamang e-gichi-inendaa-gwak ji-wiidanokiimangwaa bakaan akiing gaa-ayaawaad ji-mino-bimaadiziying. Miigaadamang iwe gaa-ani-aanjiseg gaa-izhiwebak agwajiing ji-gashkichigaadeg ji-debinigaadeg ge-aabadak ji-mino-bimaadiziyin gaye ji-wiijitooying weweni ji-wiijiiwidiwaad gakina awiyag, Gaanada Aki daa-niigaanii omaa miziwe akiing.</p>\n\n<p>“Gi-gii-zanagi’igomin iwe GOOBID-19 aakoziwin, Gaanada Aki dash obagoseni-maa’ ogimaawining gaa-anokiinid ji-wiidanokiimidiwaad weweni ji-izhichigewaad. Gaanada Ogimaa wii-wiiji’aa Gaanada Akiing gaa-ayaawaad nitam ji-gashkitoo-ying weweni ji-bimaadiziying ji-bekag ji-onizhishing ge-ani-akiiwang. Maamaw gi-ga-gaanjitoomin Gaanada Aki – gakina awiya ji-minosed.”</p></div>\n      "
}