{
  "path": "/en/news/news-releases/2022/05/16/prime-minister-announces-members-independent-advisory-board-help",
  "pageTitle": "Prime Minister announces members of the Independent Advisory Board to help select the next Supreme Court Justice | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the members of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments. The members of the Independent Advisory Board will identify candidates to fill the upcoming Supreme Court of Canada vacancy, which will be created by the retirement of the Honourable Michael J. Moldaver in September.</p>\n\n<p>The following members have been named to the Independent Advisory Board:</p>\n\n<ul>\n\t<li><strong>Paulette Senior</strong>, President and CEO of the Canadian Women’s Foundation</li>\n\t<li><strong>Konrad Sioui</strong>, former Grand Chief of the Huron-Wendat Nation</li>\n\t<li><strong>The Honourable Louise Charron</strong>, former Supreme Court of Canada Justice</li>\n\t<li><strong>Jacqueline Horvat</strong>, founding partner of the law firm Spark Law</li>\n\t<li><strong>Richard Jochelson</strong>, Dean of Law at the Faculty of Law of the University of Manitoba</li>\n\t<li><strong>Charlene Theodore</strong>, Chief Inclusion Officer at McCarthy Tétrault</li>\n\t<li><strong>David Nahwegahbow</strong>, founding partner of the law firm Nahwegahbow Corbiere</li>\n</ul>\n\n<p>Coming from diverse backgrounds, the members will work alongside the Honourable H.&nbsp;Wade&nbsp;MacLauchlan, Chair of this independent and non-partisan board, to identify candidates who are jurists of the highest calibre, functionally bilingual, and representative of the diversity of our country. The candidates will be selected from applications received during the six-week application period, which closed on May 13, 2022. The members will submit a shortlist of highly qualified candidates to the Prime Minister for consideration.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The Supreme Court of Canada is recognized internationally as a strong and independent judicial institution, and we are committed to ensuring that judges are appointed through a process that is transparent, inclusive, and accountable to Canadians. I am confident that the talented members named today to the Independent Advisory Board will recommend the most exceptional and deserving individuals for appointment to Canada’s highest court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The application period for qualified candidates to the Supreme Court of Canada was open to all qualified applicants from Ontario, in recognition of the convention of regional representation.</li>\n\t<li>Justice Moldaver was appointed to the Supreme Court of Canada from the Ontario Court of Appeal in 2011. He will retire effective September 1, 2022.</li>\n\t<li>For the first time, the Independent Advisory Board includes an additional member nominated by the Indigenous Bar Association, to advance the Minister of Justice’s mandate letter commitment to work with stakeholders to encourage more Indigenous Peoples to join the bench.</li>\n\t<li>In 2016, the Government of Canada announced a new process for Supreme Court of Canada judicial appointments. It included the creation of an independent and non-partisan advisory board to identify qualified and suitable candidates for appointment to the Supreme Court of Canada.</li>\n\t<li>The Supreme Court of Canada consists of nine judges, including a Chief Justice. They are all appointed by the Governor in Council, and must have been either a judge of a superior court or a member of at least 10 years’ standing of the bar of a province or territory.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/05/16/independent-advisory-board-members\">Biographical notes: Independent Advisory Board members</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2022/04/04/honourable-h-wade-maclauchlan-cm-opei-chairperson\">Biographical note: The Honourable H. Wade MacLauchlan, C.M., O.P.E.I., Chairperson</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/04/prime-minister-launches-process-select-next-justice-supreme-court\">Prime Minister launches process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://www.scc-csc.ca/home-accueil/index-eng.aspx\">Supreme Court of Canada</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2022/index-eng.html\">Supreme Court of Canada appointment process</a></li>\n\t<li><a href=\"http://pm.gc.ca/eng/news/2016/08/02/new-process-judicial-appointments-supreme-court-canada\">New process for judicial appointments to the Supreme Court of Canada</a></li>\n</ul></div>\n      "
}