{
  "path": "/en/news/statements/2016/11/11/statement-prime-minister-canada-remembrance-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Remembrance Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Remembrance Day:</p>\n<p>“Today, we pause to remember and honour the Canadian men and women who have served our country and fought for freedom around the world.</p>\n<p>“Time may fade, but our memories cannot. We all have a duty to hold the torch high, and to keep its flame alight. Liberty’s cause beats deeply within our hearts, and every generation of Canadians has answered the call to serve.</p>\n<p>“We must remember that, during the First and Second World Wars, Canada and Newfoundland fought side by side. This year marks the 100<sup>th</sup> anniversary of the Battle of Beaumont-Hamel, when a generation of Newfoundlanders laid down their lives in defence of the freedom, democracy, and diversity that we enjoy today.</p>\n<p>“From Ypres to Vimy Ridge, Dieppe to Juno Beach – we will not forget. From Korea to the Suez, Cyprus to Kandahar – we will not forget. We remember yesterday’s youth, far from home, who fought for reason and progress. They stood up to tyranny and stood for liberty, and sacrificed their future for the future of so many.</p>\n<p>“We honour Canada’s bravest, who stand shoulder to shoulder with our allies around the world. Every day, they face down the threat of terrorism, and protect the values we cherish most.</p>\n<p>“At 11:00 am, I encourage all Canadians – no matter where you are – to observe the two minutes of silence. When we remember, we must remember war as it was and as it is. Freedom’s terrible price is known but to the few who have fought for it.</p>\n<p>“That is why today we stand sombre and silent, with poppies close to our hearts, and take the time to remember.</p>\n<p>“Lest we forget.”</p></div>\n      "
}