{
  "path": "/en/news/statements/2017/02/03/statement-prime-minister-canada-celebrating-40-years-partnership",
  "pageTitle": "Statement by the Prime Minister of Canada celebrating 40 years of partnership with the Association of Southeast Asian Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the 40<sup>th</sup> anniversary of Canada’s status as a Dialogue Partner of the Association of Southeast Asian Nations (ASEAN):</p>\n<p>“On this day, 40 years ago, Canada became a Dialogue Partner of ASEAN.</p>\n<p>“As a Pacific nation, Canada has strongly supported ASEAN’s goal of maintaining the peace, stability, and security that have allowed Southeast Asia – and the wider Asia-Pacific region – to develop and prosper.</p>\n<p>“The ties between Canadians and the peoples of Southeast Asia have never been stronger. Canada, after all, is home to over one million people from Southeast Asia. Their communities enrich our national fabric every day, and greatly contribute to one of our country’s most fundamental strengths: our diversity. We also have strong economic links to ASEAN, with over $21 billion in two-way merchandise trade in 2015.</p>\n<p>“In recent years, we have deepened our partnership with ASEAN by expanding our resident diplomatic footprint to all ten member states, appointing a dedicated ambassador to ASEAN, and supporting many initiatives that have promoted peace and prosperity throughout the region.</p>\n<p>“Canada’s engagement with ASEAN will continue to grow as we work together to create a better, safer, and more prosperous world.</p>\n<p>“Today, as we celebrate 40 years of partnership with ASEAN, I encourage all Canadians to reflect on the tremendous contributions made by Southeast Asian Canadians to our country.”</p>\n<p><strong>Associated link</strong></p>\n<p><a href=\"http://www.international.gc.ca/asean/index.aspx?lang=eng\">Mission of Canada to the Association of Southeast Asian Nations</a></p></div>\n      "
}