{
  "path": "/en/news/readouts/2022/03/02/prime-minister-justin-trudeau-speaks-prime-minister-israel-naftali-bennett",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Israel Naftali Bennett | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Israel, Naftali Bennett, about Russia’s illegal invasion of Ukraine’s sovereign territory.</p>\n\n<p>Prime Minister Trudeau denounced the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. He expressed his steadfast support for Ukraine and its people and called for an immediate ceasefire and for the respect of international law.</p>\n\n<p>The prime ministers expressed their profound concern about the human cost of armed conflict and the unfolding humanitarian crisis. The leaders strongly condemned the attacks that have reportedly damaged the Babyn Yar Holocaust memorial site near Kyiv, and together underlined the importance of efforts to bring an end to this unnecessary conflict that will have far-reaching global impacts.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Bennett reaffirmed their commitment to the strong cooperation between Canada and Israel, and looked forward to further discussions in the very near future.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Israel Relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/readouts/2021/09/24/prime-minister-justin-trudeau-speaks-prime-minister-israel-naftali-bennett\">Prime Minister Trudeau speaks with Prime Minister of Israel Naftali Bennett</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n</ul></div>\n      "
}