{
  "path": "/en/news/news-releases/2022/08/23/prime-minister-announces-additional-support-ukraine",
  "pageTitle": "Prime Minister announces additional support for Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in the virtual Summit for Heads of State and Government of the International Crimea Platform, where he announced new sanctions against supporters of the Russian regime, as well as additional assistance for Ukraine.</p>\n\n<p>Chancellor of Germany Olaf Scholz, currently visiting Canada, also participated in this Ukraine-led initiative. The two leaders highlighted their solidarity and unwavering support for Ukraine and the Ukrainian people bravely defending their sovereignty, territorial integrity, and independence against Russia’s illegal and unjustifiable invasion.</p>\n\n<p>To increase pressure on Putin’s regime, the Prime Minister announced that Canada is imposing new measures on 62 close associates of the Russian regime and a defence sector entity that is complicit in Russia’s invasion of Ukraine. Among the individuals sanctioned are high-ranking Russian government officials, including Russian federal governors and regional heads, their family members, and senior officials of currently sanctioned defence sector entities.</p>\n\n<p>To support the Ukrainian government and people, the Prime Minister also announced allocation of&nbsp; funding for two Ukraine projects through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/psop.aspx?lang=eng\">Peace and Stabilization Operations Program</a> (PSOPs), totalling $3.85 million. This funding will provide additional support to Ukraine’s security sector institutions and includes:</p>\n\n<ul>\n\t<li>Approximately $2.9 million in additional funding for the Canada-Ukraine Police Development Project, implemented by Alinea International, that is providing targeted support to the National Police of Ukraine (NPU) and Ukraine’s Ministry of Internal Affairs and State Emergency Services, including the provision of essential equipment and supplies. Support is also being provided to improve police responses to cases of conflict-related sexual violence and expand psychological peer support for police.&nbsp;</li>\n\t<li>Approximately $950,000 in additional funding for the Promoting Reform Objectives through Technical Expertise and Capacity Transfer project, implemented by Alinea International, focusing on providing technical advice and support to Ukraine’s Ministry of Defensce. This project is strengthening the capacity of this institution that is critical to Ukraine’s ability to defend itself in the face of Russian aggression.</li>\n</ul>\n\n<p>Today, Prime Minister Trudeau also announced that Canada will continue to counter Russian state-sponsored disinformation by creating a dedicated team to help increase Canada’s capacity to understand, monitor, and detect Russian and other state-sponsored disinformation and enable deeper international collaboration, including through the G7 Rapid Response Mechanism (RRM). Canada welcomes German leadership under the G7 RRM of a working group focused on the threat of subnational foreign interference at community, municipal and regional levels.</p>\n\n<p>To respond to the urgent need to increase grain storage capacity in Ukraine due to Russia’s invasion, and help improve food security in the country, the Prime Minister announced at this year’s G7 Summit in Germany a $52 million contribution towards agricultural solutions. Canada’s contribution will be channelled through the Food and Agriculture Organization’s (FAO) Grain Storage Support Strategy. $50 million of that contribution will go towards grain storage solutions and $2 million will be dedicated for lab equipment and associated technical assistance. Canada’s support will benefit over 1,900 farmers and over 4,800 people overall, including by providing employment for, and protecting the livelihoods of, internally displaced persons in Ukraine.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Germany continue to be united in our efforts to support Ukraine. Both countries reaffirmed our shared commitment to supporting the full restoration of Ukraine’s sovereignty, territorial integrity, and independence. We will continue to work together with our partners and allies to continue standing up for and defending peace, security, human rights, and the rule of law.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s illegal occupation and attempted annexation of Crimea in 2014, Canada has imposed sanctions on more than 1,750 individuals and entities.</li>\n\t<li>Since Russia’s further invasion of Ukraine on February 24, 2022, Canada has imposed sanctions on more than 1,300 additional individuals and entities from&nbsp; Russia, Ukraine, and Belarus.</li>\n\t<li>In 2022, Canada committed over $3.4 billion in support to Ukraine, including $1.95 billion in direct financial assistance that has been fully disbursed to Ukraine, and $455 million in international assistance.</li>\n\t<li>Since February, 2022, Canada has committed or delivered $626 million in military aid. This amount includes the complete allocation of $500 million in military support for Ukraine announced in Budget 2022.</li>\n\t<li>The Crimea Platform was launched in 2021 with an inaugural Summit for Heads of State and Government.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions: Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-disinfo-desinfo.aspx?lang=eng\">Canada’s efforts to counter disinformation: Russia invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-fact-fait.aspx?lang=eng\">Countering disinformation with facts – Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.president.gov.ua/en/news/spilna-zayava-uchasnikiv-mizhnarodnoyi-krimskoyi-platformi-77241#:~:text=We%2C%20the%20Participants%20in%20the,extending%20to%20its%20territorial%20waters\">Joint statement of the International Crimea Platform</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n</ul></div>\n      "
}