{
  "path": "/en/news/news-releases/2022/11/10/prime-minister-announces-appointment-senator",
  "pageTitle": "The Prime Minister announces the appointment of a senator | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed Dr. Margo Greenwood as an independent senator to fill a vacancy for British Columbia.</p>\n\n<p>Dr. Greenwood is an internationally recognized and highly respected Indigenous scholar of Cree ancestry. She is a researcher and author with over 30 years of experience in health fields. A professor at the University of Northern British Columbia, she has worked extensively in health research, particularly in the area of Indigenous health and well-being. She is an Officer of the Order of Canada and has received many awards for her academic, community, and advocacy work.</p>\n\n<p>Dr. Greenwood was recommended by the Independent Advisory Board for Senate Appointments, and chosen using a merit-based process open to all Canadians. This process ensures senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today, I welcome Dr. Margo Greenwood as Parliament’s newest independent senator. Dr. Greenwood’s academic expertise, commitment to health and education, and dedication to the well-being of Indigenous communities will make her a strong voice for British Columbians. I look forward to working with her, and with all senators, as we continue to make life more affordable for people and build an economy that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Senate is the Upper House in Canada’s parliamentary democracy. It unites a diverse group of accomplished Canadians in service of their country. Created to counterbalance representation by population in the House of Commons, the Senate not only defends regional interests, it also creates space for the voices of historically underrepresented groups like Indigenous Peoples, racialized communities, and women.</li>\n\t<li>With today’s announcement, there have been 63 independent appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, senators are appointed on the advice of the Prime Minister.</li>\n\t<li>In 2016, the selection process for senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n\t<li>The Board is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General, new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial and territorial, and minority interests – important functions in a modern democracy.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/10/dr-margo-greenwood\">Dr. Margo Greenwood</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Senate Appointments Process – Questions and Answers</a></li>\n\t<li><a href=\"https://sencanada.ca/en\">Senate of Canada</a></li>\n</ul></div>\n      "
}