{
  "path": "/en/news/readouts/2022/06/17/prime-minister-justin-trudeau-speaks-president-ghana-nana-addo-dankwa",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ghana Nana Addo Dankwa Akufo-Addo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ghana, Nana Addo Dankwa Akufo-Addo, about the upcoming Commonwealth Heads of Government Meeting and key regional and global issues.</p>\n\n<p>The two leaders exchanged views on the importance of strong leadership and organizational reform to promote the modernization and renewal of the Commonwealth. The Prime Minister underlined that the Commonwealth needs to clearly demonstrate that it stands for the values of democracy, respect for human rights, and pluralism.</p>\n\n<p>Prime Minister Trudeau congratulated President Akufo-Addo on Ghana’s principled stance in support of Ukraine. The Prime Minister recognized that Russia’s illegal invasion of Ukraine has clouded the prospects of a post-pandemic economic recovery in Ghana and across Africa and the global south. He noted in particular the consequences for food and fuel prices and for the blockage of fertilizer shipments from Ukraine.</p>\n\n<p>Prime Minister Trudeau sought President Akufo-Addo’s insights as previous Co-Chair, along with former Prime Minister of Norway Erna Solberg, of the Sustainable Development Goals (SDG) Advocates group. Both leaders acknowledged the importance of accelerating action to achieve the SDGs.</p>\n\n<p>The two leaders looked forward to seeing each other in person at next week’s meeting in Kigali, Rwanda.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/ghana/bilateral_relations_bilaterales/canada_ghana.aspx?lang=eng\">Canada-Ghana Relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030/moving-forward.html\">Moving forward together: Canada’s 2030 Agenda National Strategy</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}