{
  "path": "/en/news/readouts/2023/04/21/prime-minister-justin-trudeau-speaks-president-brazil-luiz-inacio-lula-da",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Brazil Luiz Inácio Lula da Silva | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Brazil, Luiz Inácio Lula da Silva.</p>\n\n<p>Prime Minister Trudeau and President Lula spoke of the friendship and historical ties between Canada and Brazil. The two leaders underscored the importance of working together to advance the shared priorities of democracy and human rights, promoting gender equality, advancing reconciliation with Indigenous Peoples and fostering inclusive and sustainable economic growth for all. The two leaders expressed interest collaborating on ambitious climate action, including on biodiversity and environmental protection.</p>\n\n<p>The Prime Minister emphasized Canada’s commitment to working with regional partners within the Americas to address the global impacts of Russia’s illegal invasion of Ukraine, supporting Ukraine in the face of this aggression, and preserving Ukraine’s sovereignty, independence, and territorial integrity. The two leaders agreed on supporting a robust Haitian-led solution to the current crisis in Haiti.</p>\n\n<p>Prime Minister Trudeau and President Lula agreed to stay in close contact and work closely together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/brazil-bresil/relations.aspx?lang=eng\">Canada-Brazil relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/07/statement-prime-minister-200th-anniversary-brazils-independence\">Statement by the Prime Minister on the 200th anniversary of Brazil’s independence</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/venezuela.aspx?lang=eng\">Canada’s response to the Venezuela crisis</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}