{
  "path": "/en/news/itineraries/2022/11/07/prime-ministers-itinerary-tuesday-november-8-2022",
  "pageTitle": "Prime Minister’s itinerary for Tuesday, November 8, 2022 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<p><a name=\"_Hlk113634803\" id=\"_Hlk113634803\"></a></p>\n\n<h2>Oromocto, New Brunswick</h2>\n\n<p><strong>11:15 a.m.&nbsp;</strong>The Prime Minister will visit the 5th Canadian Division Support Base Gagetown. Minister of National Defence Anita Anand, Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc, Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay, and Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency Ginette Petitpas Taylor will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled coverage</li>\n</ul>\n\n<p><strong>2:00 p.m.&nbsp;</strong>The Prime Minister will participate in a wreath-laying ceremony. Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc, Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay, and Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency Ginette Petitpas Taylor will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 1:15 p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul>\n\n<p><strong>2:30 p.m.&nbsp;</strong>The Prime Minister will make an announcement about connecting more Canadians to high-speed internet and hold a media availability. Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc and Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency Ginette Petitpas Taylor will also be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 1:45 p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul>\n\n<p><strong>3:45 p.m.&nbsp;</strong>The Prime Minister will meet with the Premier of New Brunswick, Blaine Higgs.</p>\n\n<p class=\"Indent2\"><em>Closed to media</em></p></div>\n      "
}