{
  "path": "/en/news/news-releases/2022/04/28/prime-minister-announces-appointment-new-associate-chief-justice",
  "pageTitle": "Prime Minister announces appointment of new Associate Chief Justice of the Supreme Court of Newfoundland and Labrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Rosalie McGrath, a judge of the Supreme Court of Newfoundland and Labrador, as the new Associate Chief Justice of the Supreme Court of Newfoundland and Labrador.</p>\n\n<p>Associate Chief Justice McGrath fills the new position which was authorized by the <em>Budget Implementation Act, 2021, No. 1</em>.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I wish the Honourable Rosalie McGrath every success in her new role as Associate Chief Justice of the Supreme Court of Newfoundland and Labrador. She brings a wealth of experience to the position, with many years practising law and 10 years as a judge on the Supreme Court of Newfoundland and Labrador. I am confident Associate Chief Justice McGrath will continue to serve Newfoundland and Labrador well.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Chief Justices and Associate Chief Justices in Canada are responsible for the leadership and administration of their courts. They also serve as members of the Canadian Judicial Council, which works to improve the quality of judicial services in the superior courts of Canada.</li>\n\t<li>Chief Justices and Associate Chief Justices are appointed by the Governor General on the advice of Cabinet and the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/04/28/honourable-rosalie-mcgrath\">The Honourable Rosalie McGrath</a></li>\n</ul></div>\n      "
}