{
  "path": "/en/news/statements/2022/12/18/statement-prime-minister-mark-start-hanukkah",
  "pageTitle": "Statement by the Prime Minister to mark the start of Hanukkah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the start of Hanukkah:</p>\n\n<p>“At sunset today, Jewish communities in Canada and around the world will mark the beginning of Hanukkah, also known as the Festival of Lights.</p>\n\n<p>“For eight nights, families and loved ones will gather to sing, spin dreidels, fry latkes, eat sufganiyot, light the candles of the Hanukkiah one by one, and tell the story of the Maccabees’ successful revolt.</p>\n\n<p>“Hanukkah commemorates the liberation of the Jewish people and the rededication of the Second Temple in Jerusalem. It celebrates the miracle of the oil, which was only enough to burn for one night, but instead lasted for eight days.</p>\n\n<p>“Since then, Hanukkah has celebrated the strength and perseverance of Jewish people and their triumph over adversity. The candles of the Hanukkiah serve as a reminder that, just as light drowns out the dark, love conquers hate. For us all, Hanukkah is an opportunity to celebrate the contributions that Jewish Canadians have made – and continue to make – to a strong, prosperous, and inclusive Canada.</p>\n\n<p>“Today, we also reflect on the incredible resilience Jewish people have shown in the face of exile and persecution, and reaffirm our commitment to combat antisemitism wherever it occurs. Together, we will continue to build a better country where all Canadians can live their lives free from hatred, and where we continue to celebrate the diversity that makes us strong.</p>\n\n<p>“On behalf of all Canadians, Sophie and I wish everyone celebrating a blessed and joyful Hanukkah.</p>\n\n<p>“Chag Hanukkah Sameach.”</p></div>\n      "
}