{
  "path": "/en/news/readouts/2021/10/31/prime-minister-justin-trudeau-participates-summit-global-supply-chain",
  "pageTitle": "Prime Minister Justin Trudeau participates in Summit on Global Supply Chain Resilience | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated in the Summit on Global Supply Chain Resilience hosted by&nbsp;the President of the United States of America,&nbsp;Joe Biden, on the margins of the G20 Leaders’ Summit in Rome, Italy.</p>\n\n<p>At the Summit, the Prime Minister underlined that the global COVID-19 crisis resulted in a shock to supply chains, and has demonstrated the importance of collaborating with trusted partners to protect our respective populations. He noted that building and fostering secure and sustainable environmental supply chains and trade for critical minerals, batteries, and electric vehicles is essential for the future.</p>\n\n<p>The Prime Minister stressed that countries must work together to ensure a predictable trade environment and uphold the application of, and respect for international trade rules. On this, he noted Canada’s efforts to deepen co-operation through the Canada-led Ottawa Group. He highlighted Canada’s many bilateral and multilateral free trade agreements as well as Canada’s desire to continue to develop free trade relationships with trusted partners.</p>\n\n<p>The Prime Minister cautioned that protectionist and discriminatory measures only work to disrupt the supply chains that support our industries and workers, and will only make it harder to achieve our goals. He stated that Canada is committed to working with like-minded partners to build resilient supply chains and address unfair and non-market trade practices.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/31/prime-minister-concludes-successful-g20-leaders-summit-italy\">Prime Minister concludes successful G20 Leaders’ Summit in Italy</a></li>\n\t<li><a href=\"https://www.g20.org/\">G20 Italy 2021</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2019/05/ottawa-group-and-wto-reform.html\">Ottawa Group and WTO reform</a></li>\n</ul></div>\n      "
}