{
  "path": "/en/news/statements/2023/04/26/statement-prime-minister-israel-independence-day",
  "pageTitle": "Statement by the Prime Minister on Israel Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Yom Ha’atzmaut, Israel Independence Day:</p>\n\n<p>“Today, we join Israelis, Jewish communities, and others in Canada and across the world to celebrate the 75th anniversary of the establishment of the State of Israel.</p>\n\n<p>“Canada is proud to have been one of the first countries to recognize Israel when it was founded in 1948, and our countries formally established diplomatic relations the following year. We have since cultivated a strong bilateral friendship rooted in deep ties between our people and shared commitment to democratic values. As we celebrate this milestone anniversary, we reaffirm the ties that unite our two countries, and we recognize Israel’s significant contributions to the world, in areas ranging from science and innovation to culture and the arts.</p>\n\n<p>“The history of the Jewish people is one of resilience and triumph. Their story, from centuries of persecution to the establishment of the state we celebrate today, is an inspiration for people around the globe, particularly here in Canada. With some 400,000 people, the Canada’s Jewish community is an integral part of our country’s cultural fabric, and its ongoing contributions help make our society more inclusive, prosperous, and vibrant.</p>\n\n<p>“As we mark Israel Independence Day, the Government of Canada reaffirms its commitment to speaking out and fighting antisemitism and hatred in all their forms, wherever and whenever they occur, including through the work of the Special Envoy on Preserving Holocaust Remembrance and Combatting Antisemitism, the Honourable Irwin Cotler. We will continue to support and promote the International Holocaust Remembrance Alliance’s definition of antisemitism, which we adopted in 2019 as part of Canada’s Anti-Racism Strategy. Today, we also condemn the spate of attacks on civilians in recent weeks. We will continue to stand for the right of Israel and its neighbours to coexist in peace – a pillar of Canada’s Middle East Policy since 1948 – and reaffirm our ongoing commitment to supporting a two-state solution in which Israelis and Palestinians can live in peace, security, and dignity.</p>\n\n<p>“On behalf of the Government of Canada, I wish Israelis, Jewish communities across Canada, and all those celebrating this important milestone, a Yom Ha’atzmaut Sameach!”</p></div>\n      "
}