{
  "path": "/en/news/readouts/2022/06/30/prime-minister-justin-trudeau-meets-prime-minister-sweden-magdalena",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Sweden Magdalena Andersson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of Sweden, Magdalena Andersson, on the margins of the NATO Summit.</p>\n\n<p>Prime Minister Trudeau reiterated Canada’s support for Sweden’s accession to NATO membership and Canada’s commitment to strengthen defence cooperation.</p>\n\n<p>The two leaders underscored the strong alignment between Canada and Sweden on public safety, gender equality, and climate action, and agreed to further promote bilateral trade and investment to facilitate job creation in both countries.</p>\n\n<p>The prime ministers discussed Russia’s illegal and unjustifiable invasion of Ukraine. They emphasized the importance of unity and continued military, financial, and humanitarian support to the government and people of Ukraine. The leaders expressed their shared concerns for the wider global impacts of Russia’s military aggression against Ukraine, through shortages and rising prices of food, fuel, and fertilizer. They committed to working together with like-minded partners to come up with practical solutions to mitigate these impacts, particularly for the most vulnerable.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Andersson spoke of the urgency of accelerating efforts to address climate change, underscoring the importance of carbon pricing as well as access to critical minerals to facilitate the transition to renewables and decarbonisation of our economies. Prime Minister Andersson welcomed Canada’s hosting of the United Nations Summit on Biodiversity (COP 15) in Montréal, and both leaders agreed on the need for ambitious outcomes from the event.</p>\n\n<p>The leaders also expressed their intent to stabilize and closely collaborate in the Arctic region.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Andersson agreed to continue working together to advance shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.canadainternational.gc.ca/sweden-suede/bilateral_relations_bilaterales/canada_sweden-suede.aspx?lang=eng\">Canada-Sweden relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/statements/2022/06/29/statement-prime-minister-natos-invitation-finland-and-sweden-join\">Statement by the Prime Minister on NATO’s invitation to Finland and Sweden to join the Alliance</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}