{
  "path": "/en/news/news-releases/2022/05/19/prime-minister-marks-end-successful-royal-tour",
  "pageTitle": "Prime Minister marks end to successful Royal Tour | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today marked the end of a successful three-day Royal Tour to Canada by Their Royal Highnesses The Prince of Wales and The Duchess of Cornwall. The Royal Tour was part of Canada’s celebrations of the Platinum Jubilee of Her Majesty Queen Elizabeth&nbsp;II, marking the 70th anniversary of her accession to the Throne.</p>\n\n<p>The Royal Tour included visits to St. John’s, Newfoundland and Labrador, the National Capital Region, and Yellowknife and Dettah, Northwest Territories. Over the course of the three days, their Royal Highnesses met with a diverse range of communities, heard their stories, and honoured their contributions to Canada. His Royal Highness The Prince of Wales also participated in a roundtable with Canadian leaders in the private sector on investing in the fight against climate change and building a better future for everyone.</p>\n\n<p>Canadians look forward to more celebrations throughout the year to mark Her Majesty’s Platinum Jubilee.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As we celebrate Her Majesty’s Platinum Jubilee, it has been a pleasure to host The Prince of Wales and The Duchess of Cornwall in Canada. While in Canada, Their Royal Highnesses met with inspiring Canadians from a diversity of backgrounds who are making a difference in their communities. As much as the Royal Family has been an important part of our past, I know they are committed to the work we must all do to build a better future for the next generation and the ones after that.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Fact</h2>\n\n<ul>\n\t<li>This is the 19th visit to Canada for The Prince of Wales and the fifth for The Duchess of Cornwall. Their Royal Highnesses’ most recent trip to Canada was in 2017, when they toured Nunavut, Ontario, and Quebec.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/services/culture/canadian-identity-society/monarchy-crown.html\">Monarchy and the Crown</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/news/2022/04/the-prince-of-wales-and-the-duchess-of-cornwall-to-tour-canada-this-spring.html\">The Prince of Wales and the Duchess of Cornwall to tour Canada this spring</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/2022-royal-tour.html\">The 2022 Royal Tour of Canada – The Prince of Wales and the Duchess of Cornwall</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/04/11/statement-prime-minister-upcoming-royal-tour-canada\">Statement by the Prime Minister on the upcoming Royal Tour of Canada</a></li>\n</ul></div>\n      "
}