{
  "path": "/en/news/readouts/2021/10/20/prime-minister-justin-trudeau-speaks-leader-official-opposition-erin",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Leader of the Official Opposition Erin O’Toole | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Leader of the Official Opposition and Leader of the Conservative Party of Canada, the Honourable Erin O’Toole, ahead of the return of Parliament.</p>\n\n<p>The Prime Minister emphasized the need for all Members of Parliament in the House of Commons to be fully vaccinated against COVID-19. Mr. O’Toole presented the Prime Minister with his party’s views on this topic ahead of the reconvening of Parliament on November 22.</p>\n\n<p>The Prime Minister outlined the government’s key priorities. This includes finishing the fight against the COVID-19 pandemic, creating jobs and growing the middle class, addressing affordability by investing in housing and delivering $10 a day child care, as well as advancing reconciliation for Indigenous peoples, including through the implementation of the United Nations Declaration on the Rights of Indigenous Peoples. The Prime Minister also raised the ongoing need to tackle climate change ahead of the upcoming COP26 summit and early legislative priorities, including banning conversion therapy, 10 days of paid sick leave for federally regulated workers, and making it a criminal offence to harass or threaten health care workers.</p>\n\n<p>The Prime Minister reiterated his commitment to collaborating with all Parliamentarians to ensure that Canadians and businesses continue to be protected from the COVID-19 virus, and receive the support they need and rely on.</p>\n\n<p>The meeting is part of the Prime Minister’s consultations with opposition leaders to discuss the priorities of Canadians, following the announcement of Parliament’s return.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse.html\">Coronavirus disease (COVID-19): Canada’s response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/15/prime-minister-announces-dates-cabinet-swearing-and-return-parliament\">Prime Minister announces the dates of the Cabinet swearing-in and return of Parliament</a></li>\n</ul></div>\n      "
}