{
  "path": "/en/news/statements/2020/09/16/statement-prime-minister-canada-welcome-new-prime-minister-japan",
  "pageTitle": "Statement by the Prime Minister of Canada to welcome the new Prime Minister of Japan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to welcome the new Prime Minister of Japan, Suga Yoshihide:</p>\n\n<p>“On behalf of the Government of Canada, I congratulate Suga Yoshihide on becoming the Prime Minister of Japan.</p>\n\n<p>“Canada and Japan enjoy a close relationship, based on shared interests, common values, and people-to-people ties. We collaborate closely on the world stage, including through the G7, G20, World Trade Organization, World Health Organization and other key institutions. Together, we work to uphold a rules-based international system and to create better opportunities for people in both our countries. This includes initiatives such as the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, and our shared vision for maintaining a free and open Indo-Pacific.</p>\n\n<p>“I look forward to working closely with Prime Minister Suga to further strengthen the partnership between Canada and Japan. We will address the health, social and economic impacts of the COVID-19 pandemic, promote global and regional security, and create the conditions for greater prosperity for the people of our two countries.</p>\n\n<p>“I offer my sincere appreciation to departing Prime Minister Abe Shinzo for his contributions to strengthen Canada-Japan relations, and for the global vision and leadership he displayed throughout his tenure as Japan’s longest-serving Prime Minister. I am also grateful for his personal friendship over the years, and I wish him improved health and every success in his future endeavours.”</p></div>\n      "
}