{
  "path": "/en/news/readouts/2021/06/18/prime-minister-justin-trudeau-holds-32nd-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 32nd call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the 32nd call with Canada’s provincial and territorial premiers to discuss their shared response to the global COVID-19 pandemic.</p>\n\n<p>The Prime Minister began the meeting by noting the tragic discovery of the remains of children near a residential school in British Columbia. Recognizing that there is much more to be done, First Ministers discussed the need to continue to work with Indigenous peoples, and with each other, to advance reconciliation in Canada. The Prime Minister also noted the horrific attack on the Afzaal family, a Muslim family, in London, Ontario. He reiterated that diversity is Canada’s strength and committed to continue standing up against all forms of hate.</p>\n\n<p>The Prime Minister provided premiers with an update following the G7 Leaders’ Summit, noting the commitment to share over two billion doses of vaccines with other countries, of which Canada will provide 100 million doses to support this commitment.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 situation, noting that case numbers and severe illness continues to decline across the country as vaccination rates continue to increase. The Prime Minister provided a brief update on the vaccine rollout. He also highlighted the one million doses of the Moderna vaccine that the United States is sharing with Canada. The Prime Minister noted that Canada is on its way to exceeding the goal of vaccinating 75 per cent of Canadians with their first dose and 20 per cent of Canadians with their second dose by Canada Day. He thanked premiers for their efforts in ramping up vaccinations across the country. Due to the threat posed by the Delta COVID-19 variant, the Prime Minister noted the importance of maintaining this momentum to ensure that Canadians receive their second dose.</p>\n\n<p>With the success of the vaccination campaign across the country, First Ministers engaged in a discussion on how to safely adjust border measures. The Prime Minister provided an update to premiers on Phase 1 of the framework, which represents a first step that would allow fully vaccinated individuals currently permitted to enter Canada to do so without having to stay in government-authorized accommodations.&nbsp;The Prime Minister also noted the ongoing discussions with the United States on adjustments to the Canada-U.S. land border measures. First Ministers shared views and perspectives on what additional adjustments could be introduced to safely adjust border measures. They agreed to continue to work together, including on the development of a proof of vaccination credential.</p>\n\n<p>The Prime Minister expressed his thanks to the outgoing Chair of the Council of the Federation, Premier François Legault, for his leadership during this past year and noted he looked forward to working with the incoming Chair, Premier Brian Pallister, as Canada emerges from this pandemic.</p>\n\n<p>First Ministers reiterated their commitment to a collaborative approach to ending the COVID-19 pandemic and reopening Canada’s economy.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Shipments and deliveries</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid\">COVID-19: Travel, testing, quarantine and borders</a></li>\n\t<li><a href=\"https://travel.gc.ca/travelling/health-safety/covid-19-security?utm_campaign=covid-19-travel-security&amp;utm_source=canada&amp;utm_medium=slideshow-news-en\">COVID-19: Your safety and security outside Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/13/prime-minister-concludes-productive-g7-leaders-summit-united-kingdom\">Prime Minister concludes productive G7 Leaders’ Summit in United Kingdom</a></li>\n</ul></div>\n      "
}