{
  "path": "/en/news/statements/2017/11/20/statement-prime-minister-national-child-day",
  "pageTitle": "Statement by the Prime Minister on National Child Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Child Day:</p><p>“On National Child Day, we celebrate our children and young people, and make sure they have every opportunity to succeed and reach their full potential. It is up to all of us to ensure children’s rights are protected, that they are protected from harm, and have a voice in issues that matter to them.</p><p>“The toughest issues of our time – fighting climate change, making gender equality a reality, building a fairer, more inclusive world – have no easy solutions. These challenges demand a global response, shaped across borders, involving every generation. Ultimately, success depends on our youngest leaders and their ability to lead – which starts with a safe and happy childhood.</p><p>“The Government of Canada is committed to making sure our children have the best possible start in life. Through the Canada Child Benefit (CCB), we have put more money in the pockets of Canadian families to help them with the high costs of raising their children. The CCB has helped lift 300,000 children out of poverty. We will <a href=\"http://www.fin.gc.ca/n17/data/17-103_1-eng.asp\">strengthen the CCB</a> by increasing the benefits annually to keep pace with the rising cost of living, starting July 2018.</p><p>“Last March, we committed $7.5 billion over 11 years to support early learning and child care and make high-quality, affordable child care available to more Canadian families. As part of this investment, we will establish, in cooperation with Indigenous communities, a distinct Indigenous Early Learning and Child Care Framework that reflects the unique cultures and needs of First Nations, Inuit, and Métis children.</p><p>“We remain committed to providing services to Indigenous children and families that better meet their needs. To that end, we have established a new department focused on Indigenous services. We will work together with Indigenous partners to transform services so that they are truly child-centred, community-directed, and focused on prevention, family preservation, and well-being.</p><p>“Our children deserve the very best. We will continue to help build a better quality of life for future generations through investments that give young people better access to mental health services and help them afford post-secondary education and prepare for the jobs of today and tomorrow.</p><p>“Today, organizations all over Canada will host special events to commemorate National Child Day. In Ottawa, more than 30 children and young people from across the country will gather for a National Summit to begin creating a Canadian Children’s Charter – a plan of action to respect, protect, and fulfil the rights of our children.</p><p>“Sophie and I invite all Canadians to join us in celebrating National Child Day. Together, we must make sure children everywhere get the love, safety, and support they need to live a full childhood and pursue their dreams.”</p></div>\n      "
}