{
  "path": "/en/news/news-releases/2020/10/27/new-rapid-housing-initiative-create-3000-new-homes-canadians",
  "pageTitle": "New Rapid Housing Initiative to create up to 3,000 new homes for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Everyone should be able to find a place to live, raise their families, and build their future. That’s why, since 2015, the Government of Canada has helped more than 1 million people have a safe and affordable place to call home. This work is more important than ever as communities across the country continue to deal with the impacts of COVID-19. By investing in affordable housing, we can create jobs and grow our middle class, build strong communities and fuel our economic recovery, and help reduce homelessness and support vulnerable Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the launch of the new Rapid Housing Initiative (RHI) that invests $1 billion to create up to 3,000 new permanent, affordable housing units across the country.</p>\n\n<p>The RHI will quickly develop new modular multi-unit rentals, convert non-residential buildings into affordable multi-residential homes, and rehabilitate buildings that are abandoned or in disrepair into affordable multi-residential homes. Costs to purchase land and buildings will also be eligible under the new initiative.</p>\n\n<p>The $1 billion in funding will be provided through two streams:</p>\n\n<ul>\n\t<li><strong>Major Cities Stream: </strong>$500 million in immediate support for pre-determined municipalities. The municipalities were determined based on metrics including the levels of renters in severe housing need and of people experiencing homelessness.</li>\n\t<li><strong>Projects Stream: </strong>$500 million for projects based on applications from provinces, territories, municipalities, Indigenous governing bodies and organizations, and non-profit organizations. Applications will be accepted starting today and until December 31, 2020.</li>\n</ul>\n\n<p>The RHI is part of the government’s plan to create jobs and support economic recovery, while eliminating chronic homelessness in Canada. We will continue to support all Canadians, and especially those most vulnerable, as we work to build a more resilient country that is safer, fairer, and more inclusive for everyone.</p>\n\n<p><strong>Quotes</strong></p>\n\n<blockquote>\n<p>&nbsp;“No Canadian should ever be without a place to call home. By making smart and substantial investments in affordable housing and providing funding directly to municipalities, we’re creating jobs, strengthening our communities across the country, and helping the most vulnerable.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every Canadian deserves a safe and affordable place to call home. The Rapid Housing Initiative will go a long way to effectively support those who need it most by quickly providing up to 3,000 new affordable housing units to vulnerable individuals and families to keep them safe.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every single Canadian deserves a safe place to call home, and as governments&nbsp;we have a responsibility to work together to make that a reality.&nbsp;This initiative&nbsp;will help&nbsp;keep safe some of Canada’s&nbsp;most vulnerable people and families. This is real, measurable progress toward our shared goal&nbsp;of ending&nbsp;chronic homelessness and gives us a model we can scale with the ambition required to deliver&nbsp;on that mission.”</p>\n\n<footer class=\"default\">Garth Frizzell, President, Federation of Canadian Municipalities</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The RHI will be delivered by the Canada Mortgage and Housing Corporation (CMHC), under the National Housing Strategy (NHS).</li>\n\t<li>The NHS is an ambitious, 10-year plan that will invest more than $55 billion to create 125,000 new housing units, reduce housing need for 530,000 households, and repair and renew more than 300,000 housing units.</li>\n\t<li>Funding under the Major Cities Stream is allocated as follows:\n\t<ul>\n\t\t<li>Toronto: $203.3 million</li>\n\t\t<li>Montréal: $56.8 million</li>\n\t\t<li>Vancouver: $51.5 million</li>\n\t\t<li>Ottawa: $31.9 million</li>\n\t\t<li>Region of Peel: $30.4 million</li>\n\t\t<li>Calgary: $24.6 million</li>\n\t\t<li>Edmonton: $17.3 million</li>\n\t\t<li>Surrey: $16.4 million</li>\n\t\t<li>Capital Regional District (British Columbia): $13.1 million</li>\n\t\t<li>Winnipeg: $12.5 million</li>\n\t\t<li>Hamilton: $10.8 million</li>\n\t\t<li>Halifax: $8.7 million</li>\n\t\t<li>Region of Waterloo: $8.2 million</li>\n\t\t<li>London: $7.5 million</li>\n\t\t<li>Québec City: $7.1 million</li>\n\t</ul>\n\t</li>\n\t<li>Under the Projects Stream, applications can be submitted from October 27 until December 31, 2020. CMHC will review applications within 30 days from the close of the application window. Projects must be completed within 12 months of a signed agreement, and unused funds will be re-allocated to other projects.</li>\n\t<li>The RHI takes a human rights-based approach to housing, serving people experiencing or at risk of homelessness and other vulnerable people under the NHS, including: women and children fleeing domestic violence, seniors, young adults, Indigenous peoples, people with disabilities, people experiencing mental health and addiction issues, veterans, LGBTQ2 individuals, racialized groups, and recent immigrants or refugees.</li>\n\t<li>CMHC supports the government’s efforts to improve the well-being of Canadians facing housing and homelessness challenges caused by the COVID-19 pandemic.</li>\n\t<li>Since November 2015, the Government of Canada has helped more than 1 million households in Canada through investments of more than $20 billion in housing.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/NHS/rapid-housing-initiative\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2020/canada-rapidly-create-affordable-housing-support-homeless\">Canada to Rapidly Create Affordable Housing and Support the Homeless</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}