{
  "path": "/en/news/statements/2022/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p>\n\n<p>“Today, on the&nbsp;<a href=\"https://www.un.org/en/observances/indigenous-day\">International Day of the World’s Indigenous Peoples</a>, we celebrate the vibrant and diverse cultures, languages, and traditions of Indigenous Peoples here in Canada and around the world.</p>\n\n<p>“This year’s theme, ‘The Role of Indigenous Women in the Preservation and Transmission of Traditional Knowledge’, recognizes the important role of Indigenous women as traditional keepers of their languages and cultures. Indigenous women have long been at the forefront of their communities, as matriarchs, Elders, teachers, leaders, healers, and providers. They are a driving force in helping communities heal from the devastating impacts of colonialism, which has led to the loss of traditional ways of being, and in advancing reconciliation. We will continue to support First Nations, Inuit, and Métis women as we respond to the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls through the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway</a>, a comprehensive roadmap to address the root causes of gender-based violence.</p>\n\n<p>“This year also marks the beginning of the United Nations’&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-indigenous-languages/international-decade.html\">International Decade of Indigenous Languages</a>. We know that Indigenous languages are critical to preserving culture and identity, and that they are a deeply personal tool for First Nations, Inuit, and Métis to tell their own stories, in their own voices. Through the&nbsp;<em>Indigenous Languages Act</em> and funding provided in Budget&nbsp;2021 to communities across the country, the Government of Canada continues to work to preserve, revitalize, and promote Indigenous languages. This June also marked the first anniversary of the establishment of the Office of the Commissioner of Indigenous Languages, a historic step in supporting Indigenous Peoples’ efforts to protect their languages. We will continue to be a partner for First Nations, Inuit, and Métis from coast to coast to coast to protect Indigenous languages and ensure they can be strengthened and spoken for generations to come.</p>\n\n<p>“In Canada and around the world, we must also continue to take meaningful action to advance reconciliation, including by recognizing and upholding Indigenous rights.</p>\n\n<p>“As we celebrate the contributions of Indigenous Peoples today, I encourage all Canadians to <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1621447127773/1621447157184\">learn more</a> about the diverse cultures, traditions, and languages of Indigenous Peoples in Canada and around the world.”</p></div>\n      "
}