{
  "path": "/en/news/readouts/2022/06/09/prime-minister-justin-trudeau-hosts-leaders-roundtable-key-regional-issues",
  "pageTitle": "Prime Minister Justin Trudeau hosts leaders roundtable on key regional issues at the Summit of the Americas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau convened a roundtable discussion with some of Canada’s closest partners in the hemisphere to discuss pressing issues of shared concern. Leaders from Barbados, Belize, Chile, Ecuador, and Jamaica participated in the discussion.</p>\n\n<p>The leaders discussed how they will continue to grow their economies, create good jobs, make life more affordable, and ensure nobody is left behind. They acknowledged and recognized the negative impacts the COVID-19 pandemic continues to have on the region’s economies and health systems, and that women, girls, and other vulnerable groups have and continue to suffer disproportionately. Prime Minister Trudeau spoke about Russia’s illegal, unprovoked, and unjustifiable invasion of Ukraine. He highlighted how Russia’s invasion of Ukraine has destabilized food and energy security, further exacerbating the situation at a time when economies are struggling to recover from the pandemic.</p>\n\n<p>The leaders spoke of the urgency of efforts to achieve full pandemic and economic recovery, and agreed that the consequences of inaction threaten the well-being of their people. They reaffirmed their collective engagement to fighting climate change and supporting the global transition to a green and sustainable future. They spoke of the exponential growth potential of inclusive economic growth. They emphasized the pressing need to address climate change and mitigate its impacts, including through the implementation of commitments made at the Summit of the Americas and at the United Nations Climate Change Conference (COP26) in 2021. The leaders discussed in particular the importance of providing climate financing and putting a price on pollution for meeting climate goals. They spoke of the need for accessible financing designed to support middle-income island states prepare and respond to external shocks, such as climate change events.</p>\n\n<p>The leaders discussed the importance of strong and resilient democracies in the hemisphere. They committed to collaborating to help safeguard democracy in the digital age, recognizing new technologies create opportunities for inclusion, but have also fueled disinformation. The leaders also reaffirmed their commitment to the shared values of human rights, media freedom, equality, and inclusion.</p>\n\n<p>The leaders recognized that gender equality benefits us all, and it is only when everyone has access to equal rights and opportunities that we can build stronger, more peaceful, and prosperous societies. The Prime Minister confirmed his commitment to the rights of women, girls, and LGBTQ2 individuals throughout the hemisphere, as well as those of Indigenous Peoples and all other citizens who have been historically marginalized.</p>\n\n<p>Prime Minister Trudeau emphasized the importance of collective action to address common challenges and to support the achievement of the 2030 Agenda and the United Nations Sustainable Development Goals. The leaders recognized the need to work together and with other partners in the hemisphere to advance their mutual interests for the benefit of all.</p>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/un-climate-change-conference/cop26-summit.html\">UN conference on climate action: COP26 in Glasgow</a></li>\n</ul></div>\n      "
}