{
  "path": "/en/news/readouts/2022/12/16/prime-minister-justin-trudeau-speaks-manitoba-premier-heather-stefanson",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Manitoba Premier Heather Stefanson | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Manitoba Premier Heather Stefanson to discuss opportunities to collaborate on the feasibility study of the Prairie Green Landfill. The federal government has committed to cover the costs of the feasibility study for a potential search of the site. It is believed the remains of two Indigenous women from the Long Plain First Nation who were tragically killed earlier this year are located in this landfill. The Prime Minister also conveyed his heartfelt condolences to the families of the victims and all those affected by this senseless violence.</p>\n\n<p>The two leaders discussed how their governments can provide support to and work collaboratively with Indigenous Peoples to move forward constructively with a feasibility study to be led by the Assembly of Manitoba Chiefs.</p>\n\n<p>The Prime Minister and the Premier agreed that both governments must work together and focus on healing for the community, particularly in the Long Plain First Nation.</p>\n\n<p>They also discussed the Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People National Action Plan, and how governments across the country can strengthen and advance their commitments to put an end to this ongoing tragedy.</p>\n\n<p>Prime Minister Trudeau and Premier Stefanson agreed to remain in close and regular contact on the issue.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://mmiwg2splus-nationalactionplan.ca/\">Missing and Murdered Indigenous Women, Girls and 2SLGBTQQIA+ People National Action Plan</a></li>\n\t<li><a href=\"/en/news/readouts/2022/09/01/prime-minister-justin-trudeau-meets-manitoba-premier-heather-stefanson\">Prime Minister Justin Trudeau meets with Manitoba Premier Heather Stefanson</a></li>\n</ul></div>\n      "
}