{
  "path": "/en/news/news-releases/2017/06/15/prime-minister-announces-support-montreals-reseau-electrique",
  "pageTitle": "Prime Minister announces support for Montréal’s Réseau électrique métropolitain | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in public infrastructure creates efficient, affordable and sustainable transit services that result in shorter commutes for Canadians, a cleaner environment for our children, and strong economic growth.</p><p>Prime Minister Justin Trudeau today announced support for a federal investment of $1.283 billion from the long-term <i>Investing in Canada</i> infrastructure plan to support the Réseau électrique métropolitain (REM) light rail network in Montréal, subject to necessary due diligence. Today's announcement will make it possible to finalize the financing of the project and meet the construction schedule of the Caisse de dépôt et placement du Québec.</p><p>The Prime Minister also announced today that, once the Canada Infrastructure Bank is established, it will be possible for the Province of Quebec and the Caisse de dépôt et placement du Québec to identify the project as an opportunity for independent analysis and consideration by the Bank. If the Bank decides to move forward with an investment in the REM project, it will be possible for an investment to come from the Bank rather than Quebec’s transit allocation.</p><p>The investment – provided through the <i>Investing in Canada</i> infrastructure plan – will create good, well-paying middle class jobs, and support a modern, efficient transit system, which will result in less time in traffic and more time with family for Montrealers.</p><p>Once completed, this new, automated light rail network will include 27 stations, span 67 kilometres, and operate 20 hours a day, 7 days a week. It will link Montréal’s downtown to the West Island, South Shore, North Shore, and Pierre Elliott Trudeau International Airport.</p><h2>Quotes</h2><blockquote><p>“The REM is one of the most ambitious public transportation projects in our history. In addition to making it quicker and easier for millions of Quebec residents to get around, the REM will reduce the number of cars on the roads, help ease traffic and make the air cleaner. The announcement today represents a big step toward improving the quality of life of Canadians and their families, creating good, well-paying jobs for the middle class and growing the economy.”<br>—&nbsp;<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Government of Canada is proud to be a partner in this important project for Montréal and for Quebec. Once complete, the project will help reduce traffic congestion and greenhouse gas emissions, and make it easier for residents to connect with the services they need.”<br>—&nbsp;<cite>The Hon. Amarjeet Sohi, Minister of Infrastructure and Communities</cite></p></blockquote><h2>Quick facts</h2><ul><li>Once completed, the 67 kilometre REM will be the fourth largest automated transportation system in the world after Singapore (82 km), Dubai (80 km) and Vancouver (68 km).</li><li>More than 34,000 direct and indirect jobs are expected to be created during the project’s construction, and more than 1,000 permanent jobs would be created upon completion.</li><li>Economic benefits during the construction phase are estimated to reach close to $3.7 billion.</li><li>It is estimated that REM would reduce greenhouse gas (GHG) emissions by at least 35,000 tonnes within its first year of operations.</li><li>The Government of Quebec is providing $1.283 billion for this project.</li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.budget.gc.ca/2017/docs/plan/chap-02-en.html#Toc477707375\">Government of Canada’s $180-billion+ <i>Investing in Canada</i> infrastructure plan</a></li><li><a href=\"https://www.cdpqinfra.com/en/Reseau_electrique_metropolitain\">Réseau électrique métropolitain website</a></li><li><a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">Public Transit Infrastructure Fund</a></li></ul></div>\n      "
}