{
  "path": "/en/news/statements/2022/09/23/republic-korea-and-canada-stronger-together-joint-leaders-statement",
  "pageTitle": "The Republic of Korea and Canada: Stronger Together - Joint Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, Prime Minister Justin Trudeau of Canada and President Yoon Suk Yeol of the Republic of Korea (ROK), met today in Ottawa to celebrate and strengthen a vibrant friendship that is reflected in the depth and diversity of our ties.</p>\n\n<p>On the eve of the 60th anniversary of the Canada-ROK diplomatic relationship in 2023, we acknowledge that ours is a special friendship forged together through war, people-to-people ties, a mutual commitment to multilateralism, the rules-based international order and global commerce, and sustained by a shared spirit of innovativeness, creativity, and entrepreneurship.</p>\n\n<p>Canada and the ROK have long been like-minded partners on matters of peace and stability. Canada stood with the ROK through the Korean War, defending not only its people but also the international order we were building, made real in the United Nations. Since then, we have been working together to protect and strengthen democracy, security, and human rights, including the rights of women and girls, in the region and around the world. We reiterate our common objective of the complete denuclearization of the Democratic People’s Republic of Korea (DPRK). President Yoon explained the ROK’s Audacious Initiative and Prime Minister Trudeau expressed his strong support for President Yoon’s efforts to achieve a denuclearized, peaceful and prosperous Korean Peninsula.</p>\n\n<p>Our peoples have built strong ties, too. Many Canadians and Koreans live, work, and study across their borders, creating vibrant communities, families, and businesses, becoming an essential part of our cultural fabric, and making our friendship stronger. Similarly, many of our students have lived or studied in each other’s world-class universities, creating a strong network of friends between Canada and the ROK.</p>\n\n<p>Our long friendship, highlighted by the establishment of the Canadian embassy in Korea in 1973 and the Korean embassy in Canada in 1965, was more recently reinforced when we established the Canada-ROK Strategic Partnership and subsequently signed the Canada-ROK Free Trade Agreement (FTA) and Science, Technology, and Innovation (ST&amp;I) Cooperation Agreement. These agreements have been an important part of our lasting friendship, increasing trade and economic prosperity for both of our countries and facilitating collaboration between our most innovative researchers, scientists, and entrepreneurs.</p>\n\n<p>Now more than ever, Canada and the ROK – Canadians and Koreans – are ready to modernize our bilateral relationship and to advance, through joint action, the values that we share. Today, we are upgrading our bilateral relationship to a Comprehensive Strategic Partnership, based on the following five shared priorities in the areas of values, security, prosperity, sustainability, and beyond.</p>\n\n<ol>\n\t<li>Defending the Rules Based International System, Democracy, Freedom, Human Rights, and Gender Equality</li>\n</ol>\n\n<ol start=\"2\">\n\t<li>Strengthening Security and Defense Partnerships, including Peacekeeping and Maritime Security</li>\n</ol>\n\n<ol start=\"3\">\n\t<li>Enhancing Economic Prosperity and Security, Cooperating on Supply Chains, Critical Minerals, and ST&amp;I, and Promoting Trade and Investment</li>\n</ol>\n\n<ol start=\"4\">\n\t<li>Addressing Climate Change and the Environment, Supporting Energy Security, and Developing Sustainable Energy Sources</li>\n</ol>\n\n<ol start=\"5\">\n\t<li>Deepening Partnerships in Health and Culture</li>\n</ol>\n\n<p>To begin implementing our Comprehensive Strategic Partnership, we are pleased to jointly welcome the creation of the new annual Canada-ROK Climate Change Dialogue, the renewal of the Memorandum of Understanding (MOU) on Defence Materials Cooperation between the ROK Defense Acquisition Program Administration (DAPA) and the Canadian Department of National Defence (DND), and the renewal of the MOU on Industrial Technology and Innovation Partnership between the Korea Institute for Advanced Technology (KIAT) and the National Research Council Canada (NRC).</p>\n\n<p>Today, we agreed to work towards launching a high-level dialogue on economic security involving the Ministries of Foreign Affairs and Industry. Reflecting the increasingly important nexus between economic interests and security, we also commit to address economic security challenges through enhanced cooperation and coordination. This includes deepening our strategic partnership on supply chain resiliency. We will seek to position both countries as globally competitive players in the critical minerals supply chain and battery and EV (Electric Vehicles) value chains in ways that support our collective prosperity and security, while raising labour and environmental standards. To that end, we agreed on the need to develop an MOU in the coming months to enable the building of value chains in Canada and Korea to support clean energy transition and energy security, including with respect to critical minerals. We also agreed on the need to strengthen the bilateral Joint Committee on Science, Technology, and Innovation (ST&amp;I).</p>\n\n<p>We are also committed to strengthening ST&amp;I cooperation in emerging technologies (e.g., artificial intelligence (AI), and next generation network beyond 5G) and exploring future opportunities for bilateral collaboration on AI while seeking to identify mechanisms to drive collaborative innovation for the benefit of all citizens. Furthermore, recognizing the importance of ensuring mutual economic prosperity, we commit to seeking opportunities to grow bilateral trade and investment to ensure the creation of well-paying jobs in both economies.</p>\n\n<p>We note with appreciation the contributions made by our Working Holiday Program to promoting people-to-people exchanges and will continue to explore avenues for its renewal. In recognition of the upcoming 60th anniversary of the establishment of diplomatic relations between Canada and the ROK, we have designated 2024-2025 as the Year of Cultural Exchanges between Canada and the ROK.</p>\n\n<p>During the 60th anniversary of our diplomatic relations next year, and as we strengthen cooperation through our forthcoming Indo-Pacific strategies, we look forward to working together on several important initiatives under our shared priorities to fully implement the Canada-Korea Comprehensive Strategic Partnership.</p>\n\n<p>Expressing his gratitude for Prime Minister Trudeau’s warm welcome and hospitality, President Yoon extended, and the Prime Minister accepted with gratitude, a sincere invitation to visit the ROK, an occasion that promises to mark yet another leap in the bilateral relations upon the 60th anniversary.</p></div>\n      "
}