{
  "path": "/en/news/readouts/2020/12/20/prime-minister-justin-trudeau-convenes-incident-response-group-discuss-new",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss the new COVID-19 variant identified in the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss Canada’s response to the new variant of COVID-19 identified in the United Kingdom. Minister of Health Patty Hajdu, Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Transport Marc Garneau, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs Dominic LeBlanc, and Minister of Foreign Affairs François-Philippe Champagne participated in the meeting, along with Chief Public Health Officer of Canada Dr. Theresa Tam and Government of Canada officials.</p>\n\n<p>Dr. Tam and Minister Hajdu updated the group on the variant’s properties, including its reportedly higher transmissibility. Minister Hajdu, Minister Blair, and Minister Garneau informed the group of measures to be implemented in Canada to give public health officials time to gather further evidence and conduct additional research on the new variant to keep Canadians safe. These include a 72-hour suspension of all commercial and private passenger flights from the United Kingdom effective midnight tonight, and secondary screening of all travellers who arrived in Canada from the United Kingdom in the last day. These new measures complement the robust travel restrictions and border measures that have been in place since March 2020, notably mandatory quarantine measures that require travellers to quarantine or isolate for 14 days immediately upon entry to Canada.</p>\n\n<p>Minister Champagne discussed similar measures being taken by other countries in response to the new variant, noting bans on flights from the United Kingdom in several European Union countries.</p>\n\n<p>The Prime Minister and ministers will continue to work directly with our allies and partners as part of a robust global effort to stop COVID-19 and address its devastating health, social, and economic impacts on people across the world.</p>\n\n<h2>Associated link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2020/12/canada-suspends-flights-from-the-united-kingdom-for-72-hours.html\">Canada suspends flights from the United Kingdom for 72 hours</a></li>\n</ul></div>\n      "
}