{
  "path": "/en/news/readouts/2021/06/01/prime-minister-justin-trudeau-speaks-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Prince Edward Island Premier Dennis King about the COVID-19 pandemic.</p>\n\n<p>Prime Minister Trudeau thanked Premier King for his leadership and ongoing collaboration. Premier King expressed his appreciation for the federal support provided to date to people and businesses in Prince Edward Island. The Premier also thanked the Prime Minister for his regular and ongoing engagement on the pandemic with First Ministers.</p>\n\n<p>The two leaders discussed the status of the vaccination campaign in Prince Edward Island as well as the reopening plans of the Atlantic provinces and their impact on the tourism industry. The Prime Minister reiterated his commitment to keep supporting tourism workers, and workers in all industries in the province as more vaccines are delivered and we beat COVID-19.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Premier King agreed to continue working together and to move forward on a path to grow the economy, support jobs and businesses, and build back better.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Shipments and deliveries</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/05/27/prime-minister-justin-trudeau-holds-31st-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 31st call with premiers on COVID-19 response</a></li>\n</ul></div>\n      "
}