{
  "path": "/en/news/news-releases/2019/09/05/prime-minister-announces-new-lieutenant-governor-new-brunswick",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for New Brunswick | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Brenda&nbsp;Murphy as the new Lieutenant Governor of New Brunswick.</p>\n\n<p>A long-time social justice advocate, Ms. Murphy has dedicated her life to serving the public, advancing gender equality, and ending poverty. She led a women’s empowerment network in her province for two decades, and has served on advisory councils on poverty and the status of women at the federal and provincial levels. She also served her community for three terms as a municipal councillor.</p>\n\n<p>As a volunteer, Ms. Murphy has worked with a variety of organizations and councils supporting housing, justice, and equality for women. Her appointment follows that of the former Lieutenant Governor, the Honourable Jocelyne Roy Vienneau, who passed away last month following a battle with cancer.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Ms. Murphy has decades of experience advancing gender equality and helping to lift people out of poverty. I know she will continue to make important contributions to the future of her province and our country, and serve the people of New Brunswick well as their new Lieutenant Governor.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, and visiting communities.</li>\n\t<li>Lieutenant Governors are appointed by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2019/09/05/brenda-murphy\">Brenda Murphy</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/crown-canada/lieutenant-governors.html\">The Lieutenant Governors</a></li>\n</ul></div>\n      "
}