{
  "path": "/en/news/readouts/2023/02/16/prime-minister-justin-trudeau-meets-prime-minister-haiti-ariel-henry",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Haiti Ariel Henry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Haiti, Ariel Henry.</p>\n\n<p>Prime Minister Trudeau conveyed his deep concern about the crisis in Haiti, where Haitians continue to face gang violence, including indiscriminate attacks, sexual and gender-based violence, destruction of homes, and mass displacement. Prime Minister Henry thanked Canada for providing much-needed security equipment and assistance to bolster the Haitian National Police’s capacity to combat armed gangs.</p>\n\n<p>The two leaders discussed Prime Minister Henry’s political accord of December 21, 2022, and the establishment of the High Transition Council. Prime Minister Trudeau underscored the need for inclusive political dialogue to pave the way for free and fair elections and foster democratic stability.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Henry discussed the important role of CARICOM, of which Haiti is a member, in helping to convene political dialogue in support of a Haitian-led solution to the crisis.</p>\n\n<p>The two leaders agreed to remain in contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2023/02/canada-deploys-two-kingston-class-ships-to-haiti-in-response-to-the-worsening-security-crisis.html\">Canada deploys two Kingston-class ships to Haiti in response to the worsening security crisis</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support\">Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people</a></li>\n\t<li><a href=\"https://hgc.caricom.org/#:~:text=Hyatt%2C%20Baha%20Mar.-,The%20Forty%2DFourth%20(44th)%20Regular%20Meeting%20of%20the%20Conference,The%20Bahamas%2C%20Honourable%20Philip%20Davis.\">Forty-Fourth Regular Meeting of the Conference of Heads of Government of CARICOM</a></li>\n</ul></div>\n      "
}