{
  "path": "/en/news/news-releases/2018/02/14/prime-minister-nominates-next-information-commissioner",
  "pageTitle": "Prime Minister nominates next Information Commissioner | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of <a href=\"/en/news/backgrounders/2018/02/14/caroline-maynard\">Caroline Maynard</a> as the next Information Commissioner.&nbsp;</p><p>Caroline Maynard is currently serving as Interim Chairperson and Chief Executive Officer of the Military Grievances External Review Committee. Ms. Maynard’s legal career with the Government of Canada spans 20 years during which time she assumed progressively more senior leadership and decision-making positions.</p><p>The Office of the Information Commissioner was established in 1983 under the <i>Access to Information</i> <i>Act</i>, Canada’s freedom of information legislation. The Commissioner encourages and assists federal institutions to make information more easily available to the public to keep the government accountable to Canadians, and provides oversight to ensure that Canada’s freedom of information legislation is respected.</p><p>Ms. Maynard was chosen as the nominee for the position of Information Commissioner through the Government’s open, transparent, and merit-based appointment process. Under the <i>Access to Information</i> <i>Act</i>, this nomination must be approved by the House of Commons and the Senate.</p><h2>Quote</h2><blockquote><p>“With her extensive legal background and leadership experience, Caroline Maynard would be an excellent Information Commissioner. She has a deep appreciation of the need for an open and transparent government, and I trust she would do an outstanding job on delivering the mandate of the Office of the Information Commissioner.”&nbsp;<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Information Commissioner is an independent Agent of Parliament, appointed under the <i>Access to Information Act</i> for a term of seven years.</li><li>The appointment is made by the Governor in Council after consultation with the leader of every recognized party in the House of Commons and group in the Senate, and after approval by resolution of both Houses of Parliament.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/02/14/caroline-maynard\">Caroline Maynard</a></li></ul></div>\n      "
}