{
  "path": "/en/news/news-releases/2023/01/25/governor-general-mary-simon-travel-finland",
  "pageTitle": "Governor General to travel to Finland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General of Canada, Her Excellency the Right Honourable Mary Simon, will travel to Finland for a State visit from February 6 to 10, 2023.</p>\n\n<p>In Helsinki, Her Excellency will meet with the President of Finland, Sauli Niinistö, the Prime Minister of Finland, Sanna Marin, and the First Deputy Speaker of Finland’s Parliament, Antti Rinne. These meetings will help strengthen relations between our two countries and offer an opportunity to advance important global issues, such as peace, support for democracy, and climate change. They will also reaffirm Canada’s commitment to transatlantic security and support for Finland’s accession to NATO membership.</p>\n\n<p>While in Finland, the Governor General will also visit Rovaniemi, a city located in the country’s northernmost region of&nbsp;Lapland and on the Arctic Circle. There, she will visit a school and meet with local leaders and community members to discuss education and learning systems in remote regions. She will promote cooperation for a strong and prosperous Arctic, including in the areas of climate change and sustainable development. She will also meet with Sámi youth.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Her Excellency’s visit to Finland will be an excellent opportunity to further develop our transatlantic partnership and friendship. Strengthening the relationship between our two countries is key to ensuring our collective security, advancing real climate action, and fostering a strong future for communities in the Arctic and beyond.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and Finland’s bilateral relationship is built on strong ties between our people, shared values, and 75 years of diplomatic relations. The two countries are northern parliamentary democracies with similar geography, climate, natural resources, and technology-driven economies.</li>\n\t<li>Canada and Finland work closely together on Arctic issues, including through the Arctic Council.</li>\n\t<li>Canada is represented in Finland with an embassy in Helsinki. Finland maintains an embassy in Ottawa and honorary consulates in over a dozen cities across Canada.</li>\n\t<li>Governors general undertake official international travel at the request of the Prime Minister and in support of the Government of Canada’s international foreign policy, diplomatic, and trade objectives.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/finland-finlande/relations.aspx?lang=eng\">Canada-Finland relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/04/canada-finland-joint-statement-on-bilateral-cooperation.html\">Canada-Finland joint statement on bilateral cooperation</a></li>\n</ul></div>\n      "
}