{
  "path": "/en/news/news-releases/2017/03/24/prime-minister-travel-france-100th-anniversary-battle-vimy-ridge",
  "pageTitle": "Prime Minister to travel to France for the 100th anniversary of the Battle of Vimy Ridge | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, announced today that he will travel to France from April 8 to 10, 2017, to attend commemorations for the 100<sup>th</sup> anniversary of the Battle of Vimy Ridge. He will join His Excellency the Right Honourable David Johnston, Governor General of Canada, Their Royal Highnesses The Prince of Wales, the Duke of Cambridge, and Prince Harry, as well as Kent Hehr, Minister of Veterans Affairs and Associate Minister of National Defence, Harjit Sajjan, Minister of National Defence, and General Jonathan Vance, Chief of Defence Staff for the Canadian Armed Forces.</p><h2>Quotes</h2><blockquote><p>“The Battle of Vimy Ridge was a turning point in the First World War and for Canada, when Canadians acted – and fought – as one. At Vimy Ridge, we will mark this great victory, and pay tribute to every Canadian who answered the call to serve. Canada enjoys peace and freedom today because of their sacrifices, for which we are forever grateful.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The victory at Vimy Ridge was made possible through the combined efforts of Canada and its allies. It is fitting 100 years later to walk side-by-side with our allies to reflect on our victory, commemorate this milestone, and renew friendships as we continue to work together to defend freedom and democracy around the world.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>More than 650,000 Canadians served in the First World War, which lasted from 1914 to 1918.</li><li>The Canadian assault on the German positions at Vimy Ridge began on Easter Monday, April 9, 1917.</li><li>The Battle of Vimy Ridge lasted four days, ending with an impressive Canadian victory. This was the first action in which all four divisions of the Canadian Corps – representing every region of our country – fought together side-by-side on the same battlefield.</li><li>Of the more than 10,600 Canadian casualties at Vimy Ridge, some 3,600 soldiers lost their lives.</li><li>Four Victoria Crosses were awarded to Canadian soldiers for their bravery at Vimy Ridge.</li><li>The Canadian National Vimy Memorial was designed by Canadian sculptor and architect Walter Seymour Allward. It was unveiled on July 26, 1936, by King Edward VIII. Inscribed on the base of the memorial are the names of 11,285 Canadians who lost their lives in France during the First World War and then had no known graves.</li><li>Canadians are encouraged to follow the commemorations via social media by using #Vimy100.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.gg.ca/document.aspx?id=16735&amp;lan=eng\">Members of the Royal Family to Attend Commemorations for the 100<sup>th</sup> Anniversary of the Battle of Vimy Ridge</a></li><li><a href=\"http://www.veterans.gc.ca/eng/remembrance/history/first-world-war/vimy-ridge/100-anniversary\">100<sup>th</sup> Anniversary of the Battle of Vimy Ridge</a></li></ul></div>\n      "
}