{
  "path": "/en/news/statements/2020/06/25/first-ministers-statement-anti-racism",
  "pageTitle": "First Ministers’ statement on anti-racism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>“Events at home and abroad have underscored that Black and racialized communities and Indigenous peoples continue to be harmed by the damaging impacts of racism and discrimination. Governments, communities, and all Canadians must come together to fight racism and discrimination.</p>\n\n<p>“Recognizing that one of the strengths of Canada is its diversity, First Ministers condemn all forms of racism, discrimination, intolerance, and bigotry. First Ministers are determined to combat it – including anti-Black, anti-Indigenous, and anti-Asian racism and hate, as well as antisemitism and Islamophobia. Hate has no place in Canada and will not be tolerated.</p>\n\n<p>“Acknowledging that there is a problem is only the first step; a society that is free of racism and discrimination requires an ongoing commitment. Federal, provincial, and territorial governments commit to exercise leadership and bring any required changes to their policies, initiatives, and practices to best support communities and address the root causes of inequalities. We further acknowledge that the perspectives of racialized communities and those who have lived experience of historic discrimination can best inform strong and continued action. This also includes working with Indigenous peoples to address the Truth and Reconciliation Commission’s Calls to Action and the Calls for Justice of the National Inquiry into Missing and Murdered Indigenous Women and Girls.</p>\n\n<p>“We, as First Ministers, agree to drive progress on these efforts and share best practices around the First Ministers’ table. Moving forward includes working towards enhancing information sharing – particularly disaggregated race-based and socio-economic data – to facilitate evidence-based decision-making. We need to focus on removing social and economic barriers, and providing economic opportunities and leadership roles in communities across Canada.</p>\n\n<p>“We acknowledge the urgency of addressing these complex and long-standing issues. We have a responsibility to create a more solid foundation to combat racism and discrimination in Canada and to achieve lasting change. We, First Ministers, commit to working with all Canadians to be part of the solution.”</p></div>\n      "
}