{
  "path": "/en/news/readouts/2021/03/24/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen discussed the global COVID-19 pandemic and the steps being taken in Canada and in the European Union to fight the pandemic and save lives. They agreed on the importance of rolling out safe and effective vaccines as quickly as possible, including with respect to continued close Canada-EU cooperation. The two leaders emphasized their support for international response efforts to the pandemic, including to support more vulnerable countries, and looked forward to the upcoming high-level meeting on International Debt Architecture and Liquidity at the United Nations on March 29.</p>\n\n<p>The Prime Minister and the President also spoke about other global issues. The leaders agreed on the importance of working in a coordinated manner with partners and allies, noting the recent sanctions announcements by Canada, the European Union, the United States, and the United Kingdom related to human rights abuses in Xinjiang and in Russia regarding the detention of Alexei Navalny.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/29/joint-press-release-eu-canada-leaders-virtual-meeting\">Joint press release: EU-Canada Leaders’ Virtual Meeting</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/foreign-ministers-joint-statement-on-xinjiang.html\">Foreign Ministers’ joint statement on Xinjiang</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/03/canada-imposes-new-sanctions-in-response-to-deteriorating-human-rights-situation-in-russia.html\">Canada imposes new sanctions in response to deteriorating human rights situation in Russia</a></li>\n</ul></div>\n      "
}