{
  "path": "/en/news/statements/2018/05/07/statement-prime-minister-mental-health-week",
  "pageTitle": "Statement by the Prime Minister on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p><p>“This week, I encourage all Canadians to raise their voices and #GetLoud for mental health. Led by the Canadian Mental Health Association, <a href=\"https://mentalhealthweek.ca/\">Mental Health Week</a> calls on all of us to share our stories and listen to others, and make sure those struggling with mental health issues know they are not alone.</p><p>“Mental health is an essential part of our well-being, yet too often is treated differently than other forms of health. Shame and discrimination lead many people to suffer in silence, and to not speak up and seek help. We all share a responsibility to encourage open and honest conversations, while looking out for signs of psychological and emotional distress – at home, in classrooms, and in our workplaces.</p><p>“Together, we are stronger and more resilient when we break through the stigma that surrounds mental health issues, and make sure people have the support they need. The Government of Canada is committed to doing its part, and working with provincial and territorial governments to improve access to mental health services. Budget 2018 continues to deliver on this commitment, with greater support for Indigenous Peoples, Canadians in uniform, and first responders, including those living in remote or rural areas.</p><p>“Investments made in Budget 2018 will help deliver culturally appropriate addictions treatment and prevention services in Indigenous communities, as well as provide former residential school students and their families with greater access to mental health and emotional support services. To support Canadians in uniform, Budget 2018 introduces a new Pension for Life initiative and expanded tax credits for psychiatric service dogs.Budget 2018 also provides funding for a new research consortium to help address post-traumatic stress injuries among first responders, as well as to explore Internet-based therapy for first responders in rural and remote areas.</p><p>“The Government appreciates the mental health implications of social media and internet use on Canadians. To that end, Budget 2018 proposes a new investment of $5 million to enhance and develop preventative bullying and cyberbullying initiatives. Through the <a href=\"https://www.getcybersafe.gc.ca/index-en.aspx\">Get Cyber Safe</a> campaign, we will make sure families and young people have the resources and support they need to navigate safely online and deal with internet-related addictions.</p><p>“Mental health issues have affected so many of us, including my own family. There is no shame in struggling with a mental illness. Today, I call on all Canadians to talk – freely and openly – about what mental health means to them. By joining together and raising our voices, we can help everyone live better, healthier lives.”</p></div>\n      "
}