{
  "path": "/en/news/itineraries/2023/02/06/prime-ministers-itinerary-tuesday-february-7-2023",
  "pageTitle": "Prime Minister’s itinerary for Tuesday, February 7, 2023 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>National Capital Region, Canada</h2>\n\n<p>Private meetings</p>\n\n<p><strong>9:00&nbsp;a.m.&nbsp;</strong>The Prime Minister will chair the Cabinet meeting.</p>\n\n<p><strong>12:35&nbsp;p.m.&nbsp;</strong>The Prime Minister will meet with the Premier of Alberta, Danielle Smith.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity at the beginning of the meeting</li>\n</ul>\n\n<p><strong>1:00&nbsp;p.m.&nbsp;</strong>The Prime Minister will chair a working meeting on health care with the First Ministers of Canada’s provinces and territories. He will be joined by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland, the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, the Minister of Health, Jean-Yves Duclos, and the Minister of Mental Health and Addictions and Associate Minister of Health, Carolyn Bennett.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Pooled photo opportunity at the beginning of the meeting</li>\n</ul>\n\n<p><strong>5:30&nbsp;p.m.&nbsp;</strong>The Prime Minister will hold a media availability. He will be joined by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland, the Minister of Intergovernmental Affairs, Infrastructure and Communities, Dominic LeBlanc, the Minister of Health, Jean-Yves Duclos, the Minister of Seniors, Kamal Khera, the Minister of Mental Health and Addictions and Associate Minister of Health, Carolyn Bennett, and the Minister of Indigenous Services and Minister responsible for the Federal Economic Development Agency for Northern Ontario, Patty Hajdu.</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media are asked to arrive no later than 4:45&nbsp;p.m.</li>\n\t<li>Media interested in participating can contact <a href=\"mailto:media@pmo-cpm.gc.ca\">media@pmo-cpm.gc.ca</a> for details.</li>\n</ul></div>\n      "
}