{
  "path": "/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-president-germany-frank-walter",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Germany Frank-Walter Steinmeier | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Germany, Frank-Walter Steinmeier, in Berlin, Germany.&nbsp;He was joined by the Deputy Prime Minister and Minister of Finance, Chrystia Freeland.</p>\n\n<p>Prime Minister Trudeau and President Steinmeier strongly condemned Russia’s ongoing military aggression against Ukraine and called for an immediate cease-fire and the opening of humanitarian corridors. The leaders spoke of the tragic toll of the invasion and agreed to further mobilize and coordinate economic, security and humanitarian support.</p>\n\n<p>The Prime Minister and the President discussed the challenges faced by democracies, including disinformation and foreign interference, and agreed that Canada and Germany were natural allies to lead in further strengthening the capacity of partners and allies to address such threats. The leaders discussed the close ties between Canada and Germany, and highlighted their desire to further strengthen bilateral cooperation on energy and climate change.</p>\n\n<p>Prime Minister Trudeau thanked President Steinmeier for hosting the Governor General of Canada, Her Excellency the Right Honourable Mary Simon’s state visit to Germany during the Frankfurt Book Fair 2021, and invited the President to visit Canada.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/03/09/prime-minister-justin-trudeau-meets-chancellor-germany-olaf-scholz\">Prime Minister Justin Trudeau meets with Chancellor of Germany Olaf Scholz</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/news-nouvelles/2022/2022-02-09-freedom-expression-media-liberte-expression-medias.aspx?lang=eng\">Global Conference for Media Freedom: Joint communiqué</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/07/governor-general-travel-germany-state-visit\">Governor General to travel to Germany for a State Visit</a></li>\n</ul></div>\n      "
}