{
  "path": "/en/news/news-releases/2016/01/11/prime-minister-hold-years-first-cabinet-meeting-new-brunswick",
  "pageTitle": "Prime Minister to hold year’s first Cabinet meeting in New Brunswick | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold the year’s first Cabinet meeting in St. Andrews by-the-Sea, New Brunswick. The meeting will take place over three days, from January 17 to 19, 2016.&nbsp;</p>\n<p>During the meeting, Cabinet will review all that has been accomplished since November 2015 and discuss further plans to create jobs, strengthen the middle class, and grow an economy that works for all Canadians.</p>\n<p>The meeting is being held in New Brunswick as part of the government’s ongoing efforts to show Canadians – from all regions of the country – that their needs and aspirations are being listened to and factored into decisions being taken. The Prime Minister is also keen to share his plans for real and positive change across the nation, with an emphasis on innovation, openness, and collaboration.</p>\n<p><strong>Quote</strong></p>\n<p>“It is a great pleasure to hold this year’s first Cabinet meeting in St. Andrews by-the-Sea. With its rich and storied history, New Brunswick has a unique culture that is at the centre of our Canadian identity. I have been fortunate enough to visit New Brunswick many times throughout my life. To the citizens of this great province, I say: we recognize how important you are to the future of Canada and we will work together to bring about real and positive change for you and your families.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Fact</strong></p>\n<ul>\n<li>Some of the notable accomplishments in the government’s first few months of office include: the welcoming of thousands of Syrian refugees, the proposal of a tax cut to strengthen the middle class, the launch of consultations to inform the design of the inquiry into missing and murdered Indigenous women and girls, a successful First Ministers’ meeting, re-establishing Canada’s presence at the international level, reinstatement of the mandatory long-form census, the public release for the first time of all ministerial mandate letters, and a historic investment in global climate change action.</li>\n</ul></div>\n      "
}