{
  "path": "/en/news/news-releases/2018/09/24/canada-supports-global-infrastructure-new-hub-toronto",
  "pageTitle": "Canada supports global infrastructure with new hub in Toronto | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Investing in large, transformative infrastructure projects strengthens our communities, creates good, well-paying jobs, and provides people from all walks of life with more opportunities. The Government of Canada continues to make historic investments in Canada’s towns and cities, while playing a leading role to help develop critical infrastructure projects around the world.</p><p>The Prime Minister, Justin Trudeau, today announced that Canada will contribute $20&nbsp;million to the Global Infrastructure Hub (GI Hub) to establish Toronto as the centre of its North American operations. The GI Hub brings together public and private investors to develop critical infrastructure projects that benefit people, strengthen their communities, and connect global markets. These projects fuel long-term economic growth while supporting the transition to a low-carbon economy, and making progress towards achieving the United Nations’ Sustainable Development Goals.</p><p>In particular, the GI Hub helps address some of the key challenges to sustainable economic growth that benefits everyone, including improving the representation of women and other marginalized groups in sustainable infrastructure; narrowing a persistent global infrastructure gap concentrated in emerging markets; and strengthening infrastructure resilience to mitigate the threats posed by climate change.</p><p>The GI Hub will use $5 million of the funding to establish the Global Centre for Infrastructure Excellence, underscoring Canada’s commitment to foster new partnerships for development. Located at the new GI Hub Toronto location, the Global Centre for Infrastructure Excellence will focus on making sure private investments are effectively mobilized for resilient, sustainable infrastructure that benefits everyone.</p><h2>Quotes</h2><blockquote><p>“The Global Infrastructure Hub is helping deliver transformative infrastructure projects and creating good, middle class jobs around the world. Our investment will open up new ways to share Canadian expertise, connect large investors to opportunities at home and abroad, and help the GI Hub continue to develop the resilient, sustainable infrastructure that communities need worldwide.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“As the International Monetary Fund recently noted, the Government of Canada’s investments are helping to create jobs and growth for Canadians. Canada, along with our partners at home and around the world, has an important role to play in building communities and a global economy that works for everyone. Our investment in the Global Infrastructure Hub will help better connect governments and private investors in order to unlock capital for infrastructure – such as ports, railways and water supply systems – that will make a real difference in the lives of millions of people, while strengthening the global economy for the benefit of all.”<br>— <cite>Hon. Bill Morneau, Minister of Finance</cite></p></blockquote><h2>Quick facts</h2><ul><li>The new Toronto location will be the first Global Infrastructure Hub outside of Australia.</li><li>The GI Hub was originally granted a four-year term, starting in November 2014, when it was established by G20 leaders. In July 2018, G20 Finance Ministers and Central Bank Governors endorsed the GI Hub’s second term for the period 2019-22.</li><li>Canada holds the G7 Presidency for 2018, and is advancing domestic and international priorities framed under the following five key themes:<ul><li>Investing in growth that works for everyone</li><li>Preparing for jobs of the future</li><li>Advancing gender equality and women’s empowerment</li><li>Working together on climate change, oceans, and clean energy</li><li>Building a more peaceful and secure world</li></ul></li></ul><h2>Associated links</h2><ul><li><a href=\"https://www.gihub.org/\">Global Infrastructure Hub</a></li><li><a href=\"https://g7.gc.ca/en/\">Canada's 2018 G7 Presidency</a></li></ul></div>\n      "
}