{
  "path": "/en/news/statements/2022/04/09/statement-prime-minister-vimy-ridge-day",
  "pageTitle": "Statement by the Prime Minister on Vimy Ridge Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Vimy Ridge Day:</p>\n\n<p>“Today we remember the thousands of Canadians who fought and gave their lives in the Battle of Vimy Ridge.</p>\n\n<p>“On a cold Easter Monday in 1917 in northern France, after carefully planning and preparing their attack, Canadian soldiers stormed uphill through sleet, mud, and machine gun fire to capture Vimy Ridge. They came from coast to coast to coast – Francophones, Anglophones, new Canadians, Black Canadians, and Indigenous Peoples – and battled for four days to achieve this decisive victory.</p>\n\n<p>“The Battle of Vimy Ridge was a turning point in Canada’s history, when the four divisions of the Canadian Corps fought together for the first time, achieving what no Allied army had done before. Many of them were young men in their late teens and early twenties, united in their fight for justice, peace, and freedom. The innovative fighting techniques they used at Vimy Ridge would also contribute to the final Allied victory a year and a half later.</p>\n\n<p>“While Canada was victorious at Vimy Ridge, this success did not come without great loss. Nearly 3,600 Canadians were killed, and over 7,000 more were wounded. It remains one of the bloodiest battles in our country’s military history.</p>\n\n<p>“On this day, we honour the courage and sacrifice of those who fought at Vimy Ridge. We owe an immense debt of gratitude to them – and to all Canadians in uniform, past and present. Every day, their unwavering dedication and service protects the fundamental values of peace, freedom, and democracy that define our country.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}