{
  "path": "/en/news/readouts/2022/12/12/prime-minister-justin-trudeau-meets-g7-leaders",
  "pageTitle": "Prime Minister Justin Trudeau meets with G7 Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met virtually with G7 Leaders. This was the final meeting hosted by Germany as G7 President and served as an opportunity to pass the Presidency to Japan for 2023. The President of Ukraine, Volodymyr Zelenskyy, was also in attendance. He thanked G7 Leaders for their support to Ukraine and outlined his vision for peace in the region.</p>\n\n<p>Together, G7 Leaders discussed the importance of continuing to support the Ukrainian people and government, and remaining united against Russian aggression. They welcomed the creation of the new Donor Coordination Platform to coordinate support for Ukraine’s recovery and reconstruction, and agreed to continue providing military, financial, and diplomatic support to Ukraine. As an example of Canada’s effective support to Ukraine, the Prime Minister spoke about Canada’s Ukraine Sovereignty Bond, which raised $500&nbsp;million from individuals and institutions.</p>\n\n<p>On climate change, the Leaders welcomed the establishment of the Climate Club, and reiterated the importance of inclusive and ambitious climate action at the G7. The Prime Minister reaffirmed Canada’s commitment toward an ambitious outcome at the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, which Canada is hosting until December 19.</p>\n\n<p>The Leaders also spoke about the progress made on a number of other G7 priorities in the last year, including on infrastructure, energy, food security, health, pandemic preparedness, and gender equality, including maintaining momentum on the Gender Equality Advisory Council established by Canada in 2018. They recognized the importance of engaging with the Global South in order to continue to make progress on these and other issues of common interest. The Prime Minister raised the situation in Iran – noting support for protestors, especially women – and stressed the importance of targeted sanctions. He noted the upcoming anniversary of the downing of Ukraine International Airlines Flight&nbsp;752. Canada remains committed to holding Iran accountable for its horrific actions, in accordance with international law. The Prime Minister also raised the situation in Haiti.</p>\n\n<p>The Leaders were unanimous in thanking Germany for its strong leadership throughout its G7 Presidency, which demonstrated the value of the G7 and the power of coordinated action, and they welcomed Japan’s leadership in 2023.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"/en/news/statements/2022/12/12/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/12/06/canada-welcomes-world-cop15-protect-nature\">Canada welcomes the world for COP15 to protect nature</a></li>\n\t<li><a href=\"https://www.international.gc.ca/campaign-campagne/haiti-sanction/index.aspx?lang=eng\">Sanctions: Grave breach of international peace and security in Haiti</a></li>\n</ul></div>\n      "
}