{
  "path": "/en/news/readouts/2022/03/23/prime-minister-justin-trudeau-meets-president-european-parliament-roberta",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of European Parliament Roberta Metsola | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of the European Parliament, Roberta Metsola, ahead of the Prime Minister’s address to the European Parliament.</p>\n\n<p>Prime Minister Trudeau and President Metsola denounced Russia’s unjustifiable and immoral aggression against Ukraine’s sovereignty and territorial integrity. The Prime Minister thanked the European Parliament for its steadfast support to Ukrainian people and refugees.</p>\n\n<p>The two leaders discussed the long history of cooperation between Canada and the European Union, and agreed to foster further collaboration in favour of democratic freedom, the rule of law, and human rights. They discussed the economic impacts felt by Canadians and Europeans due to rising energy and food prices, and agreed to further collaboration to create good jobs and economic opportunities, including through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p>\n\n<p>Prime Minister Trudeau and President Metsola agreed to continue working on shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/21/prime-minister-travel-belgium-meet-allies-and-partners-continue\">Prime Minister to travel to Belgium to meet with allies and partners to continue addressing Russia’s invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}