{
  "path": "/en/news/readouts/2020/06/03/prime-minister-trudeau-addresses-organisation-african-caribbean-and",
  "pageTitle": "Prime Minister Trudeau addresses the Organisation of African, Caribbean and Pacific States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with members of the Organization of African, Caribbean and Pacific States (OACPS) to discuss the global response to the COVID-19 pandemic. He was joined by leaders from Australia, France, Norway, the United Nations and the European Union.&nbsp;The Prime Minister thanked the President of Kenya, Uhuru Kenyatta, for convening this meeting at such a critical time.</p>\n\n<p>Prime Minister Trudeau highlighted Canada’s close connections to countries from the three regions of the OACPS, thanks to relationships built on shared values, bilateral friendships, and common membership in organizations like the Commonwealth, the Organisation internationale de la Francophonie and the Organization of American States.</p>\n\n<p>The Prime Minister&nbsp;recognized the challenges that developing countries face as they combat COVID-19, and emphasized the importance of a coordinated global approach to ensure the health and safety of all people, especially the most vulnerable.</p>\n\n<p>The leaders also discussed longer-term economic recovery measures to build economic resilience.&nbsp;The Prime Minister spoke about the joint initiative he recently launched with the United Nations Secretary-General and the Prime Minister of Jamaica to accelerate the global response to the pandemic. This initiative emphasizes the need to improve access to critical development financing, including by low- and middle-income countries, to help them recover and build back into prosperous, resilient, and inclusive economies and societies.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launched the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}