{
  "path": "/en/news/statements/2022/02/26/statement-prime-minister-ukraines-day-resistance",
  "pageTitle": "Statement by the Prime Minister on Ukraine’s Day of Resistance | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Ukraine’s Day of Resistance:</p>\n\n<p>“Today, we mark Ukraine’s Day of Resistance as the Ukrainian people once again fight to defend their homes and freedom from Russia’s further unwarranted and unprovoked invasion of their country.</p>\n\n<p>“The Day of Resistance now serves as a call to action for the world to remain steadfast in its support for the Ukrainian people and their right to determine their own future. We hear their message loud and clear.</p>\n\n<p>“As Russian forces are attacking Ukraine, killing innocent citizens and disrupting lives, Canada, alongside our allies and international partners, is responding to Russia’s reckless and dangerous acts. Through serious sanctions, additional military contributions to NATO, humanitarian aid, and lethal and non-lethal equipment and ammunition, we are standing with the people of Ukraine.</p>\n\n<p>“Since 2014, Russia has violated Ukraine’s sovereignty, territorial integrity and independence. Despite calls from the international community to cease its violations of international law, Russia continues to illegally occupy Crimea, destabilize Ukraine through disinformation campaigns and malicious hybrid operations, and support the conflict in eastern Ukraine.</p>\n\n<p>“Today, as President Putin attempts to illegally and unjustifiably seize Ukraine’s territory, Canada continues to be inspired by Ukraine and its people, who remain strong, resilient, and determined as they defend their country’s sovereignty.</p>\n\n<p>“In these dark hours, Canada’s message to the people of Ukraine is this: You are not alone. We are standing with you. Our support for Ukraine, for democracy, and for human rights remains unwavering.”</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/23/statement-prime-minister-russias-attack-ukraine\">Statement by the Prime Minister on Russia’s attack on Ukraine</a></li>\n</ul></div>\n      "
}