{
  "path": "/en/news/statements/2020/06/18/statement-prime-minister-30th-anniversary-nelson-mandelas-historic-first",
  "pageTitle": "Statement by the Prime Minister on the 30th anniversary of Nelson Mandela’s historic first visit to Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 30th anniversary of Nelson Mandela’s historic visit to Canada:</p>\n\n<p>“Thirty years ago on this day, only four months after being released after 27 years of incarceration, Nelson Mandela visited Canada for the first time. His decision to come to Canada was a testimony to our country’s strong support for the struggle against apartheid.</p>\n\n<p>“On June 18, 1990, Mr. Mandela delivered a powerful and historic <a href=\"http://parl.canadiana.ca/view/oop.debates_HOC3402_10/114?r=0&amp;s=1\">speech</a> before a joint session of the Canadian Parliament. He spoke about his dream of a free and inclusive South Africa, championing peace around the world.</p>\n\n<p>“The moment marked an important milestone in the friendship between Canadian and South African people. It laid the foundation for the special bond we continue to share today, anchored by our shared values of inclusion, respect for diversity, and democracy. In the years to come, Nelson Mandela would become the first foreign leader invested into the Order of Canada, and the first living person to receive honorary Canadian citizenship.</p>\n\n<p>“Today, Canada and South Africa work closely together – including through the United Nations, the G20, the Commonwealth, and other organizations – to carry Nelson Mandela’s vision forward and build a more just, peaceful, and inclusive world.</p>\n\n<p>“Nelson Mandela will always be a symbol of liberation and freedom. His struggle, alongside countless others, to advance human rights, equality, democracy, and fight injustice laid the foundation for a new, democratic South Africa and inspired freedom movements around the world.</p>\n\n<p>“As we reflect upon the legacy of Nelson Mandela, we are reminded of the power of individuals to bring about change, and the responsibility we all share to make the world a better place.”</p></div>\n      "
}