{
  "path": "/en/news/readouts/2021/07/08/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss wildfires and extreme weather in British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the wildfires and extreme weather conditions in British Columbia.</p>\n\n<p>Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Natural Resources Seamus O’Regan Jr., and Minister of Environment and Climate Change Jonathan Wilkinson provided an overview of the situation facing B.C., as well as an outlook on wildfires and flooding in Western Canada and across the country. Ministers confirmed 80 firefighters from Ontario and Quebec have arrived in B.C. to support firefighting efforts, and Parks Canada has dispatched 23 fire management specialists to B.C. and Alberta. Ministers also confirmed Canada is in discussions with international partners to prepare for the potential need for additional assistance. The Prime Minister and all ministers agreed on the continued importance of providing resources as needed to provinces to help them recover and keep people safe.</p>\n\n<p>Minister of Transport Omar Alghabra and Minister of Indigenous Services Marc Miller provided an update on the state of transportation infrastructure in B.C., including ongoing issues related to rail transportation infrastructure. Minister Miller also outlined the engagement with local First Nations leaders about recovery plans for their communities and rail traffic in the region. The Prime Minister instructed Ministers to continue working directly with impacted First Nations communities to ensure strong partnership and communication in the weeks ahead.</p>\n\n<p>Minister Blair, Minister of National Defence Harjit Sajjan, and Minister of Employment, Workforce Development and Disability Inclusion Carla Qualtrough provided an update on federal assistance being provided to B.C. They noted the federal coordination with local emergency response centres, as well as the need to continue supporting the people of B.C., and to closely monitor the wildfire situation and adapt federal response as required.</p>\n\n<p>The Prime Minister and ministers will continue to work closely with Indigenous communities, alongside the Government of British Columbia, to further deepen communications around impacts, resources, and response and recovery efforts. The Prime Minister and Ministers will also continue to prioritize federal action on climate change to mitigate exacerbating impacts to extreme conditions and protect the health and safety of communities across Canada.</p>\n\n<h2>Information for evacuees</h2>\n\n<ul>\n\t<li>Service Canada has made the Outreach Support Centre (OSC) available for evacuees to access government assistance. Any Canadians seeking to access Employment Insurance (EI) due to lost employment, replace lost documents or redirect&nbsp;existing pension or other benefits should call 1 800 O-Canada (1-800-622-6232). Under the Federal Emergency Response Plan, the Government of Canada maintains delivery of financial compensation, social benefits, and access to key programs and services such as EI, Old Age Security (OAS), and Canada Pension Plan (CPP), as well as document replacement such as SIN cards and passports, with as little disruption as possible.</li>\n</ul>\n\n<h2>Associated link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/07/government-of-canada-provides-federal-assistance-to-british-columbia-for-wildfires.html\">Government of Canada provides federal assistance to British Columbia for wildfires</a></li>\n</ul></div>\n      "
}