{
  "path": "/en/news/statements/2021/04/18/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week:</p>\n\n<p>“During National Volunteer Week, we recognize and thank the many Canadians who give back and make a difference in the lives of others. By contributing their time and efforts, they are changing lives, helping to build stronger communities, and to make tomorrow better than today.</p>\n\n<p>“This year’s theme, ‘The Value of One, The Power of Many’, highlights the importance of our individual actions, as well as our collective strength. Over the last year, we have seen Canadians from coast to coast to coast support each other through volunteer work. Some delivered groceries and medicine to neighbours, others drove seniors and people with disabilities to appointments, and many raised money and gathered resources for community initiatives.</p>\n\n<p>“As people across the country continue to fight and deal with the impacts of the global COVID-19 pandemic, we are putting a spotlight on exceptional individuals and organizations that have received <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards/2019-recipients.html\">Canada’s Volunteer Awards</a>. We look forward to announcing the next group of recipients in the fall of 2021. Volunteers often receive little recognition for their tireless service, and by acknowledging and celebrating their efforts across the country, we can promote the values of community and civic engagement.</p>\n\n<p>“Over the past year, we have all made sacrifices to keep each other safe and healthy. Millions of Canadians have also gone above and beyond to support their communities and their country. Their compassion and kindness truly exemplify the strength and resilience at the heart of our great country. On behalf of the Government of Canada, I thank them all for their selfless service, and for showing what we can accomplish when we work together.”</p></div>\n      "
}