{
  "path": "/en/news/statements/2019/11/18/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Global Entrepreneurship Week, which runs from November 18 to 24:</p>\n\n<p>“Canadian entrepreneurs push boundaries and revolutionize the way we live, work, and think. Their ingenuity and dedication creates good jobs, supports our communities, and helps our economy grow.</p>\n\n<p>“<a href=\"https://www.futurpreneur.ca/en/initiatives/gew-canada/\">Global Entrepreneurship Week</a> is a time to celebrate entrepreneurs in Canada and around the world who change our lives for the better. It is also a chance for business owners to connect, share ideas, and start new partnerships.</p>\n\n<p>“Owning a business is rewarding, but is not without its challenges. The Government of Canada is committed to making it easier and more affordable for Canadian businesses to grow, by reducing costs and red tape for small business owners, and giving them the support they need to grow.</p>\n\n<p>“We are there for Canada’s entrepreneurs every step of the way, from funding new ideas through <a href=\"https://www.ic.gc.ca/eic/site/101.nsf/eng/home\">Innovative Solutions Canada</a> to help small businesses innovate and grow, to reducing the <a href=\"https://www.canada.ca/en/department-finance/news/2018/12/2019-brings-lower-taxes-for-small-businesses-and-more-help-for-canadian-workers.html\">small business tax rate</a> in Canada to the lowest in the G7. We are also reducing the fees credit card companies charge to Canadian businesses, and helping businesses expand and access global markets through <a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/trade-diversification-commerce/index.aspx?lang=eng\">Canada’s Trade Diversification Strategy</a>.</p>\n\n<p>“Women entrepreneurs create jobs and build economies that work for everyone, yet fewer than 16 per cent of Canadian businesses are owned or led by women. Last year, we announced Canada’s first <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a>, to help women access financing, talent, networks, and expertise. The <a href=\"https://www.tradecommissioner.gc.ca/trade_commissioners-delegues_commerciaux/businesswomen-femmesdaffaires/index.aspx?lang=eng\">Business Women in International Trade</a> program also opens doors for Canadian women-owned businesses to expand into global markets.</p>\n\n<p>“To encourage the next generation of Canadian business owners, including Indigenous entrepreneurs, we are partnering with organizations that provide mentorship and start-up financing, including Futurpreneur and the National Aboriginal Capital Corporations Association.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me to recognize entrepreneurs in our communities, our country, and around the world. Canada is stronger because of their passion, creativity, and hard work.”</p></div>\n      "
}