{
  "path": "/en/news/statements/2018/11/25/statement-prime-minister-international-day-elimination-violence-against",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Violence against Women | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Violence against Women:</p><p>“Gender-based violence harms us all. It affects families, schools, and workplaces – and holds back whole communities from reaching their full potential.</p><p>“Today, on the <a href=\"http://www.un.org/en/events/endviolenceday/background.shtml\">International Day for the Elimination of Violence against Women</a>, we come together to stand up and speak out against violence against women and people of diverse gender identities. We reflect on what each of us can do, in our daily lives, to combat violence and create change.</p><p>“Trans women and gender-diverse people experience violence at staggering rates worldwide. Displaced, migrant, and refugee women are both particularly vulnerable and face greater obstacles to seeking safety and justice. The epidemic of missing and murdered Indigenous women and girls in Canada is an ongoing tragedy and our collective shame.</p><p>“As we reflect on this unacceptable reality, we also honour the activists who are on the frontlines of helping survivors reclaim their voices, autonomy, and lives. Their advocacy benefits all of us, because an attack on women’s rights is a threat to all our human rights.</p><p>“The Government of Canada has taken important steps to help end gender-based violence. Last year, we launched <a href=\"https://www.swc-cfc.gc.ca/violence/strategy-strategie/index-en.html\">It’s Time: Canada’s Strategy to Prevent and Address Gender-Based Violence</a>. The Strategy focuses on preventing gender-based violence, providing stronger support for survivors and their families, and improving the response of our justice systems.</p><p>“This year, we made gender equality and women’s empowerment the guiding theme of Canada’s G7 Presidency. During the Summit, leaders recognized the urgent need to protect the rights of women and girls around the world – especially those in conflict situations – and signed the <a href=\"https://g7.gc.ca/en/official-documents/charlevoix-commitment-end-sexual-gender-based-violence-abuse-harassment-digital-contexts/\">G7 Charlevoix Commitment to End Sexual and Gender-Based Violence, Abuse and Harassment in Digital Contexts</a>. This commitment will help us build better prevention and crisis response strategies and better support for survivors of gender-based violence.</p><p>“Building on these achievements, Canada put forward a resolution at the United Nations Human Rights Council aimed at <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/playbook-manuel_instructions.aspx?lang=eng\">preventing and responding to violence against women and girls in digital contexts</a>. Countries around the world adopted the resolution and committed to be part of the solution.</p><p>“But we can do more. Together, we need to change the culture that allows discrimination, harassment, and violence against women to continue in our communities. When women and girls come forward to tell their stories of survival, we cannot dismiss or ignore them. Their courage creates change that benefits all of us. We need to listen to women, respect them, value them, and protect their human rights.</p><p>“As we mark the beginning of the <a href=\"https://www.swc-cfc.gc.ca/commemoration/vaw-vff/index-en.html\">16 Days of Activism against Gender-Based Violence</a>, I&nbsp;ask all Canadians to do their part to protect the rights of women and take action to bring an end to gender-based violence. We all benefit when women and girls are safe and free to live their lives to the fullest.”</p></div>\n      "
}