{
  "path": "/en/news/itineraries/2020/09/01/prime-ministers-itinerary-wednesday-september-2-2020",
  "pageTitle": "Prime Minister’s itinerary for Wednesday, September 2, 2020 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Ottawa, Ontario</h2>\n\n<p><strong>8:00 a.m.&nbsp;</strong>The Prime Minister will participate in a virtual meeting of the Aqaba Process, hosted by His Majesty King Abdullah II of Jordan and attended by representatives of the United Nations, the North Atlantic Treaty Organization, and various countries.</p>\n\n<p><strong>1:00 p.m.&nbsp;</strong>The Prime Minister will participate in a Green Recovery Round Table with Minister of Environment and Climate Change Jonathan Wilkinson and stakeholders from British Columbia, to discuss ways to shape our economic recovery while meeting climate targets.</p>\n\n<p><strong>2:30 p.m.&nbsp;</strong>The Prime Minister, accompanied by Minister of Digital Government Joyce Murray, will participate in a round table hosted by the University of British Columbia to discuss their efforts to advance innovation for personal protective equipment.</p>\n\n<p><strong>3:45 p.m.&nbsp;</strong>The Prime Minister will speak with the Premier of British Columbia, John Horgan.</p>\n\n<p><strong>7:15 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual town hall with Kids Help Phone crisis responders.</p>\n\n<p><em>Closed to media.</em></p>\n\n<p><strong>Media appearances</strong></p>\n\n<p><strong>9:20 a.m.&nbsp;</strong>An interview with the Prime Minister will air on CBC Radio’s The Early Edition with Stephen Quinn.</p>\n\n<p><strong>11:00 a.m.&nbsp;</strong>An interview with the Prime Minister will air on RED FM’s The Harjinder Thind Show.</p>\n\n<p><strong>9:00 p.m.&nbsp;</strong>An interview with the Prime Minister will be broadcast on Global News Hour at 6.</p></div>\n      "
}