{
  "path": "/en/news/readouts/2020/05/27/prime-minister-justin-trudeau-speaks-president-haiti-jovenel-moise",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Haiti Jovenel Moïse | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Haiti, Jovenel Moïse, to discuss the latest developments in the COVID-19 pandemic.</p>\n\n<p>Prime Minister Trudeau and President Moïse discussed steps being taken in Canada and Haiti in response to the virus to ensure the health, safety, and well-being of their citizens, especially the most vulnerable.</p>\n\n<p>The two leaders spoke about the value of international solidarity and co-operation to address the widespread health, social, and economic impacts of the pandemic. They also agreed on the importance of ensuring that the post-COVID-19 world serves all countries well, and look forward to discussing this at the high-level event on development financing during COVID-19 that will take place on May&nbsp;28.</p>\n\n<p>Prime Minister Trudeau underscored the strong friendship between Canada and Haiti, built on enduring people-to-people ties. He acknowledged the exceptional contributions made by Haitians in Canada, including those working on the front line of the pandemic as caregivers.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with its local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/haiti/bilateral_relations_bilaterales/canada_haiti.aspx?lang=eng\">Canada - Haiti Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}