{
  "path": "/en/news/statements/2022/05/25/statement-prime-minister-africa-day",
  "pageTitle": "Statement by the Prime Minister on Africa Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Africa Day:</p>\n\n<p>“Today, we celebrate Africa Day and the founding of the Organization of African Unity 59 years ago, now the African Union (AU). We recognize the African continent’s rich mosaic of nations, peoples, and cultures, and their contributions to Canada and the world. We welcome the opportunity today to celebrate Canada’s enduring friendships with our many African partners – friendships made possible by our strong people-to-people ties.</p>\n\n<p>“Canada is a long-time supporter of the AU’s vision of African-led solutions to support economic and political development. We share a commitment to good governance, the fight against climate change, building resilience amid the COVID-19 pandemic, peace and security, and humanitarian assistance. As a permanent observer of the AU, Canada has worked – and will continue to work – with African countries to advance shared priorities, including gender equality and women’s empowerment.</p>\n\n<p>“Canada welcomes the AU’s designation of 2022 as the <a href=\"https://au.int/en/theme/2022/year-nutrition\">Year of Nutrition for Africa</a>. Ensuring that everyone has access to nutritious food remains a high priority, particularly given the disproportionate impact that food security and nutrition challenges have on women and girls and people made vulnerable through conflict.</p>\n\n<p>“We are also working with the AU to support the health and well-being of its people, including through the AU Strategy on Gender Equality and Women’s Empowerment, and the Women Peace and Security agenda.</p>\n\n<p>“We welcome the AU’s Agenda&nbsp;2063 for inclusive and sustainable development and support the implementation of an African Continental Free Trade Area as a way to drive economic growth, while reducing poverty<strong> </strong>and advancing the&nbsp;United Nations’ Sustainable Development Goals. In line with the Agenda, we are also developing a strategy for economic cooperation across the African continent, which will facilitate increased infrastructure investment and expand partnerships in research and innovation.</p>\n\n<p>“On behalf of the Government of Canada, I wish everyone a happy Africa Day. Canada is proud to work in partnership with the African continent and its people to build a better future for everyone.”</p></div>\n      "
}