{
  "path": "/en/news/readouts/2022/04/28/prime-minister-justin-trudeau-speaks-prime-minister-italy-mario-draghi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Italy Mario Draghi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Italy, Mario Draghi.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Draghi discussed Russia’s illegal and unjustifiable invasion of Ukraine and expressed concern for its global effects, notably on energy and food security. The Prime Ministers exchanged views on challenges related to diversifying energy sources and work underway to accelerate the transition to clean energy. They committed to deepen bilateral cooperation and to work together with G7 and other allies and partners, notably on tackling climate change and promoting food security around the world.</p>\n\n<p>Prime Ministers Trudeau and Draghi underlined that this year marks the 75th anniversary of bilateral relations between Canada and Italy, and the historic and vibrant relations between the Canadian and Italian people. The two leaders tasked their officials to identify concrete initiatives to further deepen bilateral cooperation in response to a range of shared priorities and objectives, and they committed to meet in person soon.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Italy Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/06/12/prime-minister-justin-trudeau-meets-prime-minister-italy-mario-draghi\">Prime Minister Justin Trudeau meets with Prime Minister of Italy Mario Draghi</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}