{
  "path": "/en/news/statements/2021/05/23/statement-prime-minister-paramedic-services-week",
  "pageTitle": "Statement by the Prime Minister on Paramedic Services Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Paramedic Services Week, which runs from May 23 to 29:</p>\n\n<p>“Today, on the first day of <a href=\"https://www.paramedicchiefs.ca/paramedic-services-week-2021/\">Paramedic Services Week</a>, we honour the brave individuals on the front lines of our health care system.&nbsp;</p>\n\n<p>“Tens of thousands of paramedics and communications officers across Canada have dedicated themselves to saving lives and helping those in need. Under ordinary circumstances, their work is remarkable; amidst the pandemic, it is extraordinary.</p>\n\n<p>“Over the last year, paramedics have been at the forefront of the fight against COVID‑19. Day and night, these hardworking health care professionals put their mental and physical health on the line. Despite the risks they face, paramedics continue to show up for Canadians, and serve their communities, with the utmost care, compassion, and professionalism.</p>\n\n<p>“We can all do our part to help keep paramedics and front-line health care workers safe if we keep following public health advice. This includes staying home as much as possible, wearing a mask, washing our hands regularly, maintaining the greatest physical distance possible from others, and downloading and using the COVID Alert app. It also includes getting a COVID-19 vaccine when it is our turn to be vaccinated. Together, we can keep our loved ones, our health care workers, and our communities safe from the virus.</p>\n\n<p>“To all paramedics: thank you. Thank you for risking your safety, sacrificing time with your loved ones, and going above and beyond every day to help keep us safe and healthy. All Canadians are grateful for your incredible dedication and service.”<em> </em></p></div>\n      "
}