{
  "path": "/en/news/news-releases/2018/01/19/prime-minister-visits-pikangikum-first-nation",
  "pageTitle": "Prime Minister visits Pikangikum First Nation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to a renewed relationship with Indigenous Peoples – one based on recognition of rights, respect, cooperation and partnership. We will continue to partner with Indigenous Peoples to advance meaningful reconciliation, and to build a more just and equal future for people across Canada.</p><p>The Prime Minister, Justin Trudeau, today visited Pikangikum First Nation. He was joined by the Nishnawbe Aski Nation Grand Chief, Alvin Fiddler, the Minister of Indigenous Services, Jane Philpott, the Parliamentary Secretary to the Minister of Indigenous Services, Don Rusnak, and the Member of Parliament for Kenora, Bob Nault.</p><p>The visit was a chance to meet with community members and reinforce our commitment to work with them to make real progress and bring about positive change.</p><p>During the visit, Prime Minister met with the Chief and Council of Pikangikum First Nation. The leaders discussed pressing social, infrastructure, and economic issues that have a unique impact on remote Indigenous communities.</p><p>The Prime Minister also met with other community members and visited a new school that opened in 2016. There, he held a question and answer session with students, and helped dedicate a plaque commemorating the school’s opening.</p><h2>Quote</h2><blockquote><p>“It is an honour to meet again with members of Pikangikum First Nation. Our government will continue to partner with Indigenous Peoples to find long-term, sustainable solutions that make a real difference in their lives and in communities across Canada.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In August 2017, the Government of Canada announced up to $60.2 million in funding for Wataynikaneyap Power to build a 117-kilometre power line with infrastructure from Red Lake into the local distribution system at Pikangikum First Nation.</li><li>This project is part of long-term collaboration with the Government of Ontario to advance electrification for First Nation communities in Northern Ontario. The project is on schedule, and negotiations continue to extend the power line to more communities.</li></ul><h2>Associated link</h2><ul><li><a href=\"https://www.canada.ca/en/indigenous-northern-affairs/news/2017/08/the_government_ofcanadainvestsinbringingcleansafeandreliableelec.html\">The Government of Canada invests in bringing clean, safe and reliable electricity to Pikangikum First Nation in northwestern Ontario</a></li></ul></div>\n      "
}