{
  "path": "/en/news/statements/2017/01/10/statement-prime-minister-canada-changes-ministry",
  "pageTitle": "Statement by the Prime Minister of Canada on changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on changes to the Ministry:</p>\n<p><a href=\"/en/minister/honourable-chrystia-freeland\"><strong>Chrystia Freeland</strong></a>, currently Minister of International Trade, becomes Minister of Foreign Affairs, and retains the Canada-U.S. relations file, including trade relations.</p>\n<p><a href=\"/en/minister/honourable-maryam-monsef\"><strong>Maryam Monsef</strong></a>, currently Minister of Democratic Institutions, becomes Minister of Status of Women.</p>\n<p><a href=\"/en/minister/honourable-patricia-hajdu\"><strong>Patricia A. Hajdu</strong></a>, currently Minister of Status of Women, becomes Minister of Employment, Workforce Development and Labour.</p>\n<p><a href=\"/en/minister/honourable-francois-philippe-champagne\"><strong>François-Philippe Champagne</strong></a>, currently Parliamentary Secretary to the Minister of Finance, becomes Minister of International Trade.</p>\n<p><a href=\"/en/minister/honourable-karina-gould\"><strong>Karina Gould, </strong></a>currently Parliamentary Secretary to the Minister of International Development, becomes Minister of Democratic Institutions.</p>\n<p><a href=\"/en/minister/honourable-ahmed-d-hussen\"><strong>Ahmed D. Hussen</strong></a> becomes Minister of Immigration, Refugees and Citizenship.</p>\n<p>The Honourable Stéphane Dion has served his country in many different roles over the last 21 years with integrity and a fierce love of Canada. I, and all Canadians, owe him a deep debt of gratitude for his service. I know I will be able to continue to count on his wisdom and his tireless service, and look forward to the next chapter of Mr. Dion's contributions to our country.</p>\n<p>The Honourable John McCallum has had a distinguished career in public service, holding many different portfolios within government and has had an extensive parliamentary career. Most recently, his work as Minister of Immigration, Refugees and Citizenship bringing in over 39,500 Syrian refugees has been an inspiration to Canadians and an example to the world. I am pleased to announce that I will be proposing the Honourable John McCallum to the Chinese government as Canada’s Ambassador to China. The Canada-China relationship will be well served by such a strong presence from our government.</p>\n<p>The Honourable MaryAnn Mihychuk has served the government with distinction and oversaw a significant expansion of the Canada Summer Jobs program and settled the Canada Post labour dispute as Minister of Employment, Workforce Development and Labour. The Honourable MaryAnn Mihychuk will continue to serve as MP for Kildonan—St. Paul.</p>\n<p></p>\n<h4>Related Products</h4>\n<ul>\n<li><a href=\"/en/canadian-ministry-order-precedence\">The Canadian Ministry</a>&nbsp;(<a href=\"/sites/pm/files/docs/cabinet.pdf\">available in PDF</a> 136 KB)</li>\n<li><a href=\"/en/cabinet-committee-mandate-and-membership\">Cabinet Committee Mandate and Membership</a>&nbsp;(<a href=\"/sites/pm/files/docs/Cab_committee-comite.pdf\">available in PDF</a> 234 KB)</li>\n</ul></div>\n      "
}