{
  "path": "/en/news/statements/2023/04/24/statement-prime-minister-armenian-genocide-memorial-day",
  "pageTitle": "Statement by the Prime Minister on Armenian Genocide Memorial Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Armenian Genocide Memorial Day, also known as Medz Yeghern:</p>\n\n<p>“Today, we join Armenian communities in Canada and around the world to mark Armenian Genocide Memorial Day. We reflect on the atrocities committed against the Armenian people between 1915 and 1923, and we remember those who lost their lives and all those who endured unspeakable suffering.</p>\n\n<p>“We also stand in solidarity with the descendants of the victims and all those who continue to live with the intergenerational trauma of this unthinkable tragedy. Their strength and resilience remind us of our collective responsibility to stand up against hatred in all its forms – whenever and wherever it occurs. Everyone deserves to live a life free of stigma, persecution, and discrimination.</p>\n\n<p>“In Canada, April is Genocide Remembrance, Condemnation and Prevention Month. This is a time for Canadians to remember all victims of genocide around the world, denounce the hatred that leads to these tragedies, and reflect on how we can prevent them from happening again. Canada will always stand up against injustice, intolerance, and xenophobia, and we will continue to promote peace and justice for everyone.</p>\n\n<p>“As we commemorate Armenian Genocide Memorial Day, I invite all Canadians to learn about this dark chapter in human history, pay tribute to the victims, and stand in solidarity with the Armenian community, including Canadians of Armenian heritage who continue to help make Canada the strong and inclusive country we know. Through learning and dialogue, we can make sure such atrocities never happen again and we can build a world free from prejudice.”</p></div>\n      "
}