{
  "path": "/en/news/readouts/2020/05/06/prime-minister-justin-trudeau-speaks-emir-qatar-his-highness-sheikh-tamim",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the Emir of Qatar, His Highness Sheikh Tamim bin Hamad Al Thani | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Emir of Qatar, His Highness Sheikh&nbsp;Tamim&nbsp;bin Hamad Al&nbsp;Thani.</p>\n\n<p>The two leaders&nbsp;discussed the latest developments in the COVID-19 pandemic,&nbsp;and the disease’s course in Canada, Qatar, and the Middle East.&nbsp;Prime Minister Trudeau thanked the Emir for Qatar’s ongoing help to repatriate many thousands of Canadians stranded in the Gulf, the Middle East, and South Asia, and for the tireless efforts shown by the employees of Qatar Airways and the many other workers who helped ensure their safe return home during this crisis.</p>\n\n<p>They agreed on the importance of global solidarity&nbsp;in addressing&nbsp;the pandemic, and of cooperation on vaccines, treatments, and testing. They discussed measures to keep people safe while building resilience to ensure a sustainable recovery&nbsp;that recognizes the interconnected nature of supply chains and global trade.</p>\n\n<p>The Prime Minister and the Emir agreed to continue cooperating&nbsp;in response to&nbsp;the pandemic, and to&nbsp;continue strengthening bilateral relations between&nbsp;Canada and Qatar.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, and territorial authorities and is collaborating internationally with countries, international organizations, development banks, and non-governmental organizations and other partners to minimize the pandemic’s health, economic, and social impacts.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/qatar/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Qatar Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}