{
  "path": "/en/news/news-releases/2020/07/03/prime-minister-hold-virtual-cabinet-retreat",
  "pageTitle": "Prime Minister to hold virtual Cabinet retreat | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a virtual Cabinet retreat and a Cabinet meeting next week.</p>\n\n<p>During the retreat, the Prime Minister and ministers will discuss how we move forward and continue to take concrete actions needed to fight racism in Canada, prepare for a potential second wave of COVID-19, and safely restart the economy.</p>\n\n<p>As the Government of Canada continues to address the health, safety, and economic impacts of COVID-19, the retreat is an opportunity to continue our work to gradually and safely restart our economy in a way that benefits all Canadians, and look at how we can make our country more resilient to future waves of the virus. The government will also look at ways to better address discrimination and systemic racism in our institutions, because we know that there is still a lot of work to do to make this country fairer and more equal for everyone.</p>\n\n<p>The Government of Canada will continue to work closely with provinces, territories, municipalities, Indigenous peoples, racialized Canadians, stakeholders, and Canadian businesses on these and other important issues.</p>\n\n<p>During this time of uncertainty, the Government of Canada is focused on building a better, more unified, and more resilient Canada for everyone, where every Canadian has an equal opportunity to succeed.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As a country, we are facing significant challenges, and this Cabinet retreat will be an important opportunity to chart a clear path forward towards a safer, more inclusive, and prosperous Canada, that works for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote></div>\n      "
}