{
  "path": "/en/news/readouts/2023/01/11/prime-minister-justin-trudeau-meets-alfa-executives",
  "pageTitle": "Prime Minister Justin Trudeau meets with ALFA executives | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Chairman of the Board of ALFA, Armando Garza Sada, and the President of ALFA, Álvaro Fernández Garza. This meeting took place on the margins of the North American Leaders’ Summit in Mexico City, Mexico.</p>\n\n<p>ALFA maintains investments in Montréal, Quebec, through its Alpek chemical division, and has a purchasing, research, and development office in Windsor, Ontario, through its Nemak automotive division.</p>\n\n<p>Prime Minister Trudeau highlighted Canada’s innovation economy, investment opportunities, skilled and diverse talent pool, and leadership in clean technology and renewable energy, which align with ALFA’s focus on sustainability. The Prime Minister and ALFA executives discussed opportunities for ALFA’s Nemak automotive division to expand its manufacturing operations in Canada. This would contribute to the development of a North American electrical vehicle industry and supply chain, leveraging Canada’s recently announced Critical Minerals Strategy. ALFA executives also thanked Export Development Canada for their close collaboration and support.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/mexico-mexique/relations.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/20/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/critical-minerals-in-canada/canadas-critical-minerals-strategy.html\">Introducing Canada’s Critical Minerals Strategy</a></li>\n</ul></div>\n      "
}