{
  "path": "/en/news/statements/2022/06/12/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Public Service Week, which runs from June 12 to 18:</p>\n\n<p>“Today, we mark the start of <a href=\"https://www.canada.ca/en/treasury-board-secretariat/services/innovation/awards-recognition-special-events/national-public-service-week.html\">National Public Service Week</a>. During this week, we take time to recognize and thank the over 300,000 public servants across the country who work hard each and every day to make life better for people.</p>\n\n<p>“Delivering on the priorities Canadians care about: $10-a-day child care, ambitious climate action, protecting our communities from gun violence, and so much more, would not be possible without the talented, skilled, and committed workforce that supports the Government of Canada. While the past two years have been challenging for everyone, public servants have continued to rise to the occasion by being flexible and hard-working, and delivering the critical programs that Canadians have relied on.</p>\n\n<p>“From Service Canada locations and national parks, to home offices and living rooms in every region of the country, the government is taking steps to foster a more inclusive public service that looks like Canada and works for all Canadians. We are supporting Black and racialized employees, Indigenous Peoples, employees with disabilities, religious minorities, and others who continue to face barriers in the workplace. We are also working to increase diversity among senior leaders of the public service. Through the <a href=\"https://www.canada.ca/en/treasury-board-secretariat/corporate/organization/centre-diversity-inclusion.html\">Centre on Diversity and Inclusion</a>, the government is developing new innovative solutions for recruitment and talent management across the public service.</p>\n\n<p>“To our federal public servants, I say thank you. Your commitment to serving Canadians from coast to coast to coast with dedication, professionalism, and creativity makes our country a better place for everyone.”</p></div>\n      "
}