{
  "path": "/en/news/readouts/2020/06/01/prime-minister-justin-trudeau-speaks-president-alejandro-giammattei",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President Alejandro Giammattei of Guatemala | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with President Alejandro Giammattei of Guatemala to discuss the latest developments in the COVID‑19 pandemic.</p>\n\n<p>Prime Minister Trudeau and President Giammattei spoke about actions being taken in Canada and Guatemala to protect the health, safety, and economic well-being of their citizens, especially the most vulnerable.</p>\n\n<p>Prime Minister Trudeau congratulated President Giammattei on his recent election. Both leaders recognized the significant health and economic impact that COVID-19 is having on their countries. They discussed the importance of coordinated efforts, within the hemisphere and globally, to ensure a sustainable, inclusive, and long-term recovery that enhances the stability and economic resiliency of all countries.</p>\n\n<p>The Prime Minister and the President discussed ways to deepen the friendship and bilateral ties between Canada and Guatemala, built on nearly 60 years of working together. They spoke of their shared priorities, including with respect to protecting human rights, strengthening justice systems, and taking action on climate change. The leaders agreed on the need to advance democracy in the hemisphere, including in Venezuela.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guatemala/bilateral_relations_bilaterales/canada_guatemala.aspx?lang=eng\">Canada - Guatemala Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}