{
  "path": "/en/news/statements/2022/11/11/statement-prime-minister-polands-national-independence-day",
  "pageTitle": "Statement by the Prime Minister on Poland’s National Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Poland’s National Independence Day:</p>\n\n<p>“Today, Polish communities in Canada and around the world celebrate Poland’s National Independence Day.</p>\n\n<p>“Since 1918, every November 11, Poland commemorates the restoration of its independence, freedom, and sovereignty following the end of the First World War.</p>\n\n<p>“Canada and Poland have a long-standing relationship rooted in a strong historical foundation and close ties between our peoples. More than 1.1 million Canadians of Polish ancestry call our country home and contribute to our social, cultural, and economic fabric every day.</p>\n\n<p>“Our countries work closely together on shared priorities such as maintaining peace and security and defending the rules-based international order. We collaborate closely within the North Atlantic Treaty Organization (NATO) – with approximately 1,000 Canadian Armed Forces members currently serving in Central and Eastern Europe to increase security and stability in the region through Operation REASSURANCE. We also cooperate on a bilateral basis and in close coordination with the Polish Armed Forces, with approximately 40 Canadian Armed Forces members providing combat engineering training to members of the Ukrainian military under Operation UNIFIER. Canada and Poland also enjoy a mutually beneficial economic relationship, with the Canada-European Union Comprehensive Economic and Trade Agreement (CETA) helping to create new opportunities and good jobs in both countries.</p>\n\n<p>“Poland has played a key role in responding to Russia’s illegal invasion of Ukraine by welcoming millions of Ukrainians this year, supporting the international humanitarian response, including through funds from Canada, and through providing extensive military assistance. Poland has also helped displaced Ukrainians relocate to Canada and countries around the world. We will keep working with and supporting Poland and other countries across the region in the face of Russia’s illegal and unjustifiable invasion of Ukraine.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to everyone celebrating Poland’s National Independence Day, here in Canada and around the world.”</p></div>\n      "
}