{
  "path": "/en/news/news-releases/2023/02/16/prime-minister-strengthens-ties-caribbean-announces-new-support",
  "pageTitle": "Prime Minister strengthens ties with the Caribbean, announces new support for the Haitian people | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Nassau, The Bahamas, where he worked with leaders of the Caribbean Community (CARICOM) to continue advancing support for the Haitian people amidst the crisis in their country, while also strengthening ties with the region, driving economic growth, creating good jobs, and fighting climate change.</p>\n\n<p>While in Nassau, the Prime Minister worked closely with leaders to help address the political, security, and humanitarian crisis in Haiti. He announced $10 million in new funding to protect Haitian women and children along the Haiti-Dominican Republic border.</p>\n\n<p>Canada has also committed $12.3 million to address the food and nutrition needs of vulnerable populations, help meet the safety and emergency sexual and reproductive health needs of vulnerable women and girls, prevent and respond to gender-based violence, and provide water, sanitation and hygiene to address and prevent cholera.</p>\n\n<p>Prime Minister Trudeau also announced that Canada has imposed additional sanctions against two Haitian elites who provide financial or operational support to gangs and are inflicting violence on the Haitian people. Canada will continue to provide support to bolster the capacity of the Haitian National Police to respond to the crisis, including by delivering three additional Haitian-purchased Mine-Resistant Ambush Protected (MRAP) vehicles. Today, Canada announced that we will <a href=\"https://www.canada.ca/en/department-national-defence/news/2023/02/canada-deploys-two-kingston-class-ships-to-haiti-in-response-to-the-worsening-security-crisis.html\">deploy two Royal Canadian Navy Kingston-Class ships to Haiti</a> in the coming weeks in response to Haiti’s request for assistance as violence continues to escalate in the country. As a steadfast partner of Haiti, Canada will continue to support an inclusive political dialogue in Haiti, lay the foundation for free and fair elections, and help Haitians restore peace and security in their country.&nbsp;During his bilateral meeting with the Prime Minister of Haiti, Prime Minister Trudeau urged Prime Minister Henry to bolster political consensus around the High Transitional Council.</p>\n\n<p>In Nassau, Prime Minister Trudeau also announced $44.8&nbsp;million in new initiatives to help support CARICOM in addressing the climate crisis by protecting more biodiversity, and improving climate resilience and disaster preparedness. Canada will continue to advocate for small island and low-lying states in the Caribbean, who are particularly vulnerable to the impacts of climate change like rising sea levels and extreme weather events.</p>\n\n<p>The Prime Minister also announced $1.8&nbsp;million in new initiatives to help tackle escalating regional security challenges, including by targeting illicit drugs, the opioid crisis, irregular migration, and strengthening border and maritime security.</p>\n\n<p>Prime Minister Trudeau also announced $11.48 million in new initiatives, including $2.5 million in Maternal, Newborn and Child Health (MNCH) services for Indigenous people and other communities residing in the remote hinterland lacking access to quality health care and $8.98 million to the Empowering the Next Generation: Agency and Gender Equality for Youth (ENGAGE) project to support the foundation of a more empowered and equal generation of young people in Guyana.</p>\n\n<p>While at the 44th Meeting of the Conference of Heads of Government of CARICOM, which he attended as special guest, Prime Minister Trudeau signaled Canada’s commitment to keep working with the region. He announced that Canada will be taking on the role of Chair of Caribbean Development Bank’s (CDB) Board of Governors in June 2023 and will host the Board’s Annual Meeting in Canada in 2024.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and CARICOM are united in longstanding partnerships and shared priorities. There are a lot of challenges we need to work together on: supporting the people of Haiti, delivering climate action and improving resilience, finding new economic opportunities for our businesses and workers, and above all, putting people at the centre of everything we do.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Caribbean Community (CARICOM) is a regional organization, now celebrating its 50th anniversary, established by the Treaty of Chaguaramas on July 4, 1973.</li>\n\t<li>Since July 2022, Canada has responded to the deteriorating security and humanitarian crisis by providing economic, humanitarian, development, and security assistance to Haiti, including deploying a CP-140 Aurora long-range patrol aircraft to provide intelligence, surveillance, and reconnaissance capability to support Canada’s efforts to disrupt the activities of gangs in Haiti, airlifting commercial deliveries of specialized vehicles to Haiti to support the efforts of the Haitian National Police to combat gang violence against Haitian citizens and providing more than $98 million in international assistance to respond to the urgent and basic needs of the population, including combatting food insecurity, improving sexual and reproductive health and rights for women and girls, to provide medical and psychosocial support to survivors of sexual and gender-based violence, to protect women and girls and to strengthen the security and judicial sectors.</li>\n\t<li>While at the Meeting of the Conference of Heads of Government of CARICOM, Prime Minister Trudeau reiterated Canada’s ongoing commitment to growing our trade ties with CARICOM countries and building on the efforts made under the Commonwealth Caribbean Countries Tariff (CARIBCAN) program.\n\t<ul class=\"bulletOutline\">\n\t\t<li>CARIBCAN was launched by Canada at the Commonwealth Heads of Government meeting in Nassau in 1985 to improve the trade and economic development prospects of the region, promote new investment opportunities, and encourage economic integration and co-operation. It provides duty-free access into Canada to most goods originating from Commonwealth Caribbean countries.</li>\n\t\t<li>CARIBCAN is legislated in Canada’s <em>Customs Tariff Act</em> and does not have an expiry date but, as a matter of administration, Canada periodically seeks and receives a waiver from the World Trade Organization for CARIBCAN.</li>\n\t</ul>\n\t</li>\n\t<li>In Nassau, Prime Minister Trudeau reiterated Canada's commitment to implementing the 2030 Agenda for Sustainable Development and accelerating progress on all SDGs to address today’s most pressing social, economic and environmental challenges.</li>\n\t<li>During his visit to Nassau, Prime Minister Trudeau met with:\n\t<ul class=\"bulletOutline\">\n\t\t<li>The Prime Minister of The Bahamas, Philip Davis</li>\n\t\t<li>The Prime Minister of Barbados, Mia Mottley</li>\n\t\t<li>The Prime Minister of Jamaica, Andrew Holness</li>\n\t\t<li>The Prime Minister of Haiti, Ariel Henry</li>\n\t</ul>\n\t</li>\n\t<li>CARICOM is comprised of 15 Full Members and five Associate Members. The Full Members are Antigua and Barbuda, The Bahamas, Barbados, Belize, Dominica, Grenada, Guyana, Haiti, Jamaica, Montserrat, Saint Lucia, Saint Kitts and Nevis, Saint Vincent and the Grenadines, Suriname, and Trinidad and Tobago.</li>\n\t<li>The Conference of Heads of Government of CARICOM meets twice a year at regular and inter-sessional meetings, in summer and winter respectively.</li>\n\t<li>In 2021, Canada’s two-way merchandise trade with CARICOM countries reached $1.9&nbsp;billion. In 2021, bilateral trade in services reached $3.9&nbsp;billion.</li>\n\t<li>The chairmanship of the Caribbean Development Bank’s (CDB) Board of Governors will be handed to Canada from Saint Lucia at this year’s meeting in June 2023. The Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada, Harjit S. Sajjan, is Canada’s Governor to the CDB.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2023/02/16/backgrounder-canada-announces-448-million-new-funding-support-caricom\">Backgrounder: Canada announces $44.8&nbsp;million in new funding to support the CARICOM in addressing the climate crisis</a></li>\n\t<li><a href=\"https://www.international.gc.ca/campaign-campagne/haiti-sanction/index.aspx?lang=eng\">Sanctions: Grave breach of international peace and security in Haiti</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/11/prime-minister-travel-bahamas-meet-caribbean-community-caricom\">Prime Minister to travel to The Bahamas to meet with Caribbean Community (CARICOM) leaders</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/bahamas/relations.aspx?lang=eng\">Canada-Bahamas relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/latin_america-amerique_latine/index.aspx?lang=eng\">Canada and Latin America and the Caribbean</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/02/11/prime-minister-travel-bahamas-meet-caribbean-community-caricom\">Prime Minister to travel to The Bahamas to meet with Caribbean Community (CARICOM) leaders</a></li>\n\t<li><a href=\"http://www.caricom.org/\">Caribbean Community (CARICOM)</a></li>\n</ul></div>\n      "
}