{
  "path": "/en/news/news-releases/2019/05/15/canada-joins-christchurch-call-action-eliminate-terrorist-and-violent",
  "pageTitle": "Canada joins Christchurch Call to Action to eliminate terrorist and violent extremist content online | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The internet bridges divides and helps us build a more open, inclusive world. But it has also increasingly become a tool for terrorism and violent extremism. The March 2019 terror attack in Christchurch was a harrowing reminder that we need to take coordinated action to prevent social media and other online platforms from being used as a tool to incite, publish and promote terrorism, violence, and hatred.</p>\n\n<p>Today, Prime Minister Justin Trudeau joined Prime Minister of New Zealand Jacinda Ardern, President of France Emmanuel Macron, other government leaders, and industry leaders to adopt the Christchurch Call to Action – a global pledge to eliminate terrorist and violent extremist content online.</p>\n\n<p>Through the Christchurch Call, governments and online services providers are making voluntary, collective commitments to prevent people from abusing the internet to promote and sensationalize acts of terrorism. These commitments include:</p>\n\n<ul>\n\t<li>Building more inclusive, resilient communities to counter violent radicalization</li>\n\t<li>Enforcing laws that stop the production and dissemination of terrorist and extremist content online</li>\n\t<li>Encouraging media to apply ethical rules when reporting on terrorist events to avoid amplifying terrorist and violent extremist content</li>\n</ul>\n\n<p>Many of the Christchurch commitments match the priorities of the <a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a>, which the Government of Canada launched in December 2018. Through the National Strategy and the Christchurch Call, the Government of Canada will continue to provide international leadership on countering radicalization to violence and eliminating terrorist and violent extremist content online.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Terrorist and extremist content online continues to spill out into the real world with deadly consequences. Today, we are stepping up to eliminate terrorist and violent extremist content online. Together, we can create a world where all people – no matter their faith, where they live, or where they are from – are safe and secure both on and offline.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In December 2018, the Government of Canada launched the&nbsp;<a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a>, which outlines Canada’s approach and priorities to prevent the kind of radicalization that leads to violence.</li>\n\t<li>The Canada Centre for Community Engagement and Prevention of Violence leads the Government of Canada’s efforts to counter radicalization to violence, and works with all levels of government, not-for-profit organizations, communities, youth, frontline practitioners, academia, law enforcement, and international organizations.</li>\n\t<li>Radicalization to violence happens when a person or group takes on extremist beliefs that lead them to promote violence and, possibly, taking part in terrorist activity.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.christchurchcall.com/call.html\">Christchurch Call to Action</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/03/15/statement-prime-minister-terrorist-attack-two-mosques-new-zealand\">Statement by the Prime Minister on terrorist attack on two mosques in New Zealand</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/video/2019/03/19/prime-minister-trudeau-delivers-remarks-terrorist-attack-christchurch-new-zealand\">Prime Minister Trudeau delivers remarks on the terrorist attack in Christchurch, New Zealand</a> (video)</li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}