{
  "path": "/en/news/readouts/2021/06/02/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with British Columbia Premier John Horgan to discuss the horrific discovery around the former Kamloops Indian Residential School&nbsp;of the children whose lives were taken.&nbsp;</p>\n\n<p>The Prime Minister expressed his deepest condolences to the survivors and their families. Prime Minister Trudeau and Premier Horgan noted that this preliminary discovery in Kamloops is part of a larger tragedy and that, from coast to coast to coast, many children forced into the residential school system disappeared without a trace.</p>\n\n<p>The two leaders spoke about the work both governments are doing to move forward on the Truth and Reconciliation Commission’s Calls to Action, notably Calls 71 to 76 and the $27 million in federal funding announced by Minister Bennett today to support Indigenous communities and partners in locating and memorializing children who died at residential schools.</p>\n\n<p>The Prime Minister and the Premier spoke about the ongoing challenges and systemic racism Indigenous peoples face. They both also committed to ensuring their work on reconciliation is centred around cultural practices and driven by local Indigenous communities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1524494530110/1557511412801\">Delivering on Truth and Reconciliation Commission Calls to Action</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2021/06/statement-by-minister-bennett-on-the-6th-anniversary-of-the-truth-and-reconciliation-commissions-calls-to-action.html\">Statement by Minister Bennett on the 6th Anniversary of the Truth and Reconciliation Commission’s Calls to Action</a></li>\n\t<li><a href=\"https://www.canada.ca/en/crown-indigenous-relations-northern-affairs/news/2021/05/statement-on-the-discovery-around-kamloops-indian-residential-school.html\">Statement on the discovery around Kamloops Indian Residential School</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/speeches/2021/06/01/prime-ministers-remarks-house-commons-tragic-legacy-residential-schools\">Prime Minister’s remarks in the House of Commons on the tragic legacy of residential schools</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/06/01/statement-prime-minister-national-indigenous-history-month\">Statement by the Prime Minister on National Indigenous History Month</a></li>\n</ul></div>\n      "
}