{
  "path": "/en/news/news-releases/2020/05/14/prime-minister-announces-new-support-canadas-fish-harvesters",
  "pageTitle": "Prime Minister announces new support for Canada’s fish harvesters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians working in the fishing industry are feeling the economic impacts of the COVID-19 pandemic. That is why the Government of Canada is taking action to support those workers, who help provide families and communities across the country with high-quality fish and seafood.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $469.4 million in new measures to support Canada’s fish harvesters, who are economically impacted by the pandemic but cannot access existing federal measures. This investment builds on the $62.5 million for the new Canadian Seafood Stabilization Fund announced last month to help Canada’s fish and seafood processing sector.</p>\n\n<p>The Government of Canada will:</p>\n\n<ul>\n\t<li>Launch the Fish Harvester Benefit, a program worth up to $267.6 million, to help provide income support for this year’s fishing seasons to eligible self-employed fish harvesters and sharespersons crew who cannot access the Canada Emergency Wage Subsidy. Support will be provided to those that experience fishing income declines of greater than 25 per cent in the 2020 tax year, compared with a reference period to be identified. This measure covers 75 per cent of fishing income losses beyond a 25 per cent income decline threshold, up to a maximum individual entitlement equivalent to what is provided under the Canada Emergency Wage Subsidy ($847 per week for up to 12 weeks).</li>\n\t<li>Launch the Fish Harvester Grant, a program worth up to $201.8 million, to provide grants to help fish harvesters impacted by the COVID-19 pandemic, and who are ineligible for the Canada Emergency Business Account or equivalent measures. This will give them more liquidity to address non-deferrable business costs. The program would provide non-repayable support of up to $10,000 to self-employed fish harvesters with a valid fishing licence. Size of the non-repayable support will vary depending on the level of fish harvesters’ historic revenue.</li>\n\t<li>Propose measures or changes to Employment Insurance (EI) that would allow self-employed fish harvesters and sharespersons to access EI benefits on the basis of insurable earnings from previous seasons (winter and summer claims).</li>\n</ul>\n\n<p>Additional details on these measures will be made available soon.</p>\n\n<p>The Government of Canada is committed to supporting the resilience of Canada’s food system and its workers. We will continue to monitor and respond to the wide-ranging impacts of COVID-19, and take additional actions as needed to protect the health and safety of Canadians, and stabilize the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Fish harvesters work hard to provide Canadians with nutritious food to put on their tables, and are a vital part of our food supply from coast to coast to coast. This investment will help ease the burden on the people and businesses at the heart of our fishing and seafood industry. We are here to support them.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The COVID-19 pandemic has resulted in reduced demand and declining prices for Canadian fish and seafood products, and has had significant impacts on the livelihoods of Canadian&nbsp;fishers. With today’s announcement we are making sure fish harvesters can get the support they need in these times of crisis.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s fish and seafood harvesters are the driving economic force behind many coastal and rural communities. While hardship and uncertainty are felt across the economy, the fishing sector faces unique challenges that require direct solutions. With this announcement, we are ensuring that Canada’s hardworking fish harvesters get the support they need now and into the future.”</p>\n\n<footer class=\"default\">The Hon. Bernadette Jordan, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada has announced targeted new initiatives to support Canadians, including Canada’s fishing, aquaculture and processing sectors, through the COVID-19 pandemic, such as:\n\t<ul>\n\t\t<li>The <a href=\"https://www.canada.ca/en/fisheries-oceans/news/2020/04/government-of-canada-announces-new-canadian-seafood-stabilization-fund-to-help-canadas-fish-and-seafood-processing-sector.html\">Canadian Seafood Stabilization Fund</a>, a new $62.5 million initiative to assist the fish and seafood processing sectors.</li>\n\t\t<li>The Canada Emergency Response Benefit (CERB), a taxable benefit of $2,000 every 4 weeks for up to 16 weeks to eligible workers who have lost their income due to COVID-19. The government also extended the eligibility of this benefit to individuals who earn up to $1,000 per month, as well as workers who have recently exhausted their EI regular or fishing benefits and are unable to find a job or return to work because of COVID-19.</li>\n\t\t<li>An <a href=\"https://www.canada.ca/en/agriculture-agri-food/news/2020/04/keeping-canadians-and-workers-in-the-food-supply-chain-safe.html\">investment of $50 million</a> to help farmers, fish harvesters, and all food production and processing employers, put in place the measures necessary to follow the mandatory 14-day isolation period required of all workers arriving from abroad. This means the Government will provide $1,500 per temporary foreign worker, to employers or those working with them to ensure the isolation requirements are fully met.</li>\n\t\t<li>The Business Credit Availability Program, which allows the Business Development Bank of Canada (BDC) and Export Development Canada (EDC) to provide $65 billion of additional support to small and medium-sized businesses. Support for mid-sized companies with larger financing needs will include loans of up to $60 million per company, and guarantees of up to $80 million.</li>\n\t\t<li>The Regional Relief and Recovery Fund (RRRF), which allows Regional Development Agencies to provide $962 million of additional support to businesses and communities economically impacted by the COVID-19 pandemic that cannot access existing measures. Covering every region of Canada, RDAs are well-suited to assist workers and businesses in sectors that are key to the regions and local economies.</li>\n\t\t<li>Small businesses in the fishing and aquaculture industry may be eligible for subsidies for employee salaries, encouraging them to keep staff on payroll through this difficult time, and businesses from across the sector may benefit from enhanced access to credit and deferred taxes.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/05/supporting-canadas-farmers-food-businesses-and-food-supply\">Supporting Canada’s farmers, food businesses, and food supply</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n</ul></div>\n      "
}