{
  "path": "/en/news/readouts/2022/01/26/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen discussed their shared concerns about Russia’s aggressive and destabilizing actions in and around Ukraine. They emphasized the importance of continued coordination and engagement between allies and partners. Prime Minister Trudeau reaffirmed Canada’s steadfast support for the sovereignty and territorial integrity of Ukraine. &nbsp;</p>\n\n<p>The two leaders underlined the need for Russia to de-escalate the situation and to engage constructively in diplomacy. They emphasized that any further military incursion into Ukraine would have serious consequences, including coordinated sanctions.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen looked forward to continuing to work together to promote security, prosperity, and the rules-based international order.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/18/prime-minister-justin-trudeau-speaks-ministers-situation-ukraine\">Prime Minister Justin Trudeau speaks with ministers on the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/government-of-canada-announces-loan-of-up-to-120-million-to-support-ukraines-economic-resilience-and-development.html\">Government of Canada announces loan of up to $120 million to support Ukraine’s economic resilience and development</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/minister-joly-concludes-trip-to-europe-in-support-of-ukraine.html\">Minister Joly concludes trip to Europe in support of Ukraine</a></li>\n</ul></div>\n      "
}