{
  "path": "/en/news/statements/2018/04/22/statement-prime-minister-earth-day",
  "pageTitle": "Statement by the Prime Minister on Earth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Earth Day:</p><p>“Today, we join the international community to celebrate <a href=\"https://earthday.ca/\">Earth Day</a> – a time to cherish and enjoy the nature all around us, while embracing our shared responsibility to leave a cleaner, healthier Earth for generations to come.</p><p>“From the Great Bear Rainforest to the Atlantic Coast to the vast and beautiful North, Canada is defined by its natural landscapes. We are blessed with soaring peaks, boundless prairies, and an endless patchwork of hills, lakes, forests, and rivers. Our geography has shaped much of our history, and our future depends on careful stewardship of the land we all call home.</p><p>“Climate change is the greatest global challenge of our time. Canada stands with countries around the world in the fight against climate change, and is taking real, concrete action to reduce emissions, transition to a low-carbon economy, and protect the clean air and water we share.</p><p>“In Budget 2018, we made one of the most significant investments in nature conservation in Canadian history. These funds will go a long way to help protect Canada’s ecosystems, landscapes, and biodiversity for future generations.</p><p>“We also recently endorsed the Commonwealth Blue Charter – a call for ambitious, coordinated action to promote the sustainable use of coastal and ocean resources, and protect and preserve our world’s oceans. Canada is already playing a leading role on oceans protection through the Oceans Protection Plan, which makes our ocean conservation and marine safety work some of the best in the world.</p><p>“Our momentum will not be stopped. We will continue to honour our Paris Agreement commitments, and help other countries do the same. Working together on climate change, oceans, and clean energy is one of the key themes of our G7 presidency. The fight against climate change must happen at an international level, because the consequences of inaction know no borders.</p><p>“On behalf of the Government of Canada, I encourage all Canadians to take time today to do their part for the environment. Together and only together, can we protect the clean air and water we share, and pass a planet on to our kids and grandkids that is better than how we found it.”</p></div>\n      "
}