{
  "path": "/en/news/news-releases/2018/08/28/prime-minister-releases-new-ministerial-mandate-letters",
  "pageTitle": "Prime Minister releases new ministerial mandate letters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today released new ministerial mandate letters that reflect recent changes to the Ministry, guide the direction of the Government of Canada’s ministerial team, and highlight the Government’s commitment to continue delivering economic growth and creating good, middle class jobs for Canadians.</p><p>Over the past three years, the Government has taken significant strides to fulfill its mandate and deliver meaningful results for Canadians. The new mandate letters reflect ongoing, top priorities – including growing the economy, strengthening the middle class, advancing reconciliation with Indigenous peoples, and fighting climate change – while establishing new goals to further position Canada for growth and success.</p><p>The new mandate letters place an even greater focus on diversifying international trade, eliminating trade barriers between provinces and territories, supporting and growing small businesses, and increasing tourism to and within Canada. They also further underscore the Government’s commitment to maintain the integrity and security of our borders, reduce gun violence and organized crime in our communities, and provide Canadian seniors and future retirees a better quality of life.</p><p>When the Prime Minister first made ministerial mandate letters public in November&nbsp;2015, he ushered in a new era of openness and transparency. Today’s announcement reaffirms the Government’s commitment to be the most open and accessible government possible, and deliver real, meaningful progress for Canadians.</p><h2>Quote</h2><blockquote><p>“Three years ago, we took the unprecedented step of publicly releasing ministerial mandate letters so Canadians could see exactly what their government was going to do to bring about real change. These new letters reflect the Government’s current priorities and outline how we will continue to grow the middle class, meet new challenges, and deliver on our ambitious agenda.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Publicly available mandate letters make it easier for Canadians to hold the Government to account for its commitments. As part of a plan for a more open and transparent government, they are an important tool that allows Canadians to see the Prime Minister’s expectations for each minister and gives them a clear idea of how the Government will deliver its agenda.</li><li>Mandate letters outline the policy objectives that each minister will work to accomplish, as well as the pressing challenges that each minister will address in their role. They are not an exhaustive list of all files a minister will work on.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/canadian-ministry-order-precedence\"></a><a href=\"/en/mandate-letters\">Mandate letters</a></li></ul></div>\n      "
}