{
  "path": "/en/news/statements/2019/06/09/statement-prime-minister-national-public-service-week",
  "pageTitle": "Statement by the Prime Minister on National Public Service Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for National Public Service Week, which runs from June 9 to 15, 2019:</p>\n\n<p>“This week, we celebrate our dedicated public servants across Canada, who work hard to deliver real results for Canadians.</p>\n\n<p>“If we look at what Canada’s Public Service has accomplished this past year, it’s easy to see why it is one of the most effective in the world. Whether supporting free trade negotiations, rolling out the successful legalization and regulation of cannabis, or delivering the essential services and benefits that Canadian families count on, public servants show day in and day out their commitment to making Canada a better place. &nbsp;</p>\n\n<p>“Federal public servants are continually improving the way they deliver services and programs to Canadians, including through <a href=\"https://www.canada.ca/en/privy-council/services/blueprint-2020/beyond-2020.html\">Beyond2020</a>, the Public Service’s renewal framework. They are advancing more open, transparent, and evidence-based decision making, and are tracking results of their work to make sure that it is benefitting Canadians. Public servants are also finding new ways to work with communities from coast to coast to coast, gathering diverse perspectives that lead to more holistic, inclusive, and effective solutions.</p>\n\n<p>“The Government of Canada is committed to a respectful and collaborative working relationship with federal public servants, and a cornerstone of this has been bargaining in good faith with Canada’s public sector unions. We hope to continue to reach agreements that are good for public servants and fair for Canadian taxpayers.</p>\n\n<p>“The Government of Canada has also taken significant steps to make the federal public service a better, more inclusive place to work. We passed legislation to help eliminate harassment and violence in the federal workplace, to restore a fair and balanced approach to federal labour relations, and to ensure equal pay for work of equal value in the federal public service. In addition, we introduced measures to make the public service more inclusive for people with disabilities, and to unmuzzle federal scientists so they can speak freely about their work and better inform Canadians.&nbsp;&nbsp;</p>\n\n<p>“We know that members of the Public Service continue to experience unacceptable challenges caused by ongoing issues with the Phoenix pay system. The Government of Canada is working to make sure that every employee is paid properly and on time. We have provided additional resources to address and reduce the likelihood of these errors, and to work with partners and identify options for a pay system that meets the future needs of Canada’s world-class public service.</p>\n\n<p>“To our public servants: Thank you. Your professionalism, creativity, efforts, and ideas are strengthening our communities and our country. I look forward to working with you to continue to tackle today’s complex challenges, for the benefit of all Canadians.”</p></div>\n      "
}