{
  "path": "/en/news/readouts/2022/05/06/prime-minister-justin-trudeau-speaks-president-elect-south-korea-yoon-suk",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President-elect of South Korea Yoon Suk-yeol | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President-elect of South Korea, Yoon Suk-yeol, and congratulated him on his recent election victory.</p>\n\n<p>The two leaders discussed opportunities to deepen the strategic partnership between Canada and South Korea, including joint efforts to promote peace, security, democracy, and the rule of law in the Indo-Pacific region. They also noted the strong trade and economic ties between our two countries, which are underpinned by the Canada-Korea Free Trade Agreement. The leaders agreed to deepen cooperation on shared priorities such as energy, emerging technologies, and climate change.</p>\n\n<p>The Prime Minister and President-elect exchanged views on Russia’s illegal and unjustifiable invasion of Ukraine. They agreed on the need for close international coordination to deter further Russian aggression, provide humanitarian assistance to the people of Ukraine, and address the crisis’ devastating impacts on food and energy security around the world.</p>\n\n<p>The two leaders discussed their concerns about North Korea’s recent ballistic missile launches, which violate successive United Nations Security Council resolutions and are a direct threat to international peace and security. Prime Minister Trudeau reiterated Canada’s continued commitment to supporting international efforts to restrain North Korea’s dangerous actions and reinforce stability in the Indo-Pacific region.</p>\n\n<p>The two leaders discussed the strong contributions that Canadians of Korean ancestry have made and continue to make to Canada. They looked forward to marking the 60th anniversary of diplomatic relations between Canada and South Korea next year.</p>\n\n<p>The two leaders agreed to stay in close touch and to work together to advance shared priorities. Prime Minister Trudeau looked forward to meeting President-elect Yoon in person later this year at the G20 Summit in Bali, Indonesia.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/republic_korea-republique_coree/index.aspx?lang=eng\">Canada and the Republic of Korea</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/statements/2022/03/09/statement-prime-minister-result-presidential-election-south-korea\">Statement by the Prime Minister on the result of the presidential election in South Korea</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/korea-coree/index.aspx?lang=eng\">Canada-Korea Free Trade Agreement</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/global-affairs/news/2022/03/canada-condemns-north-koreas-intercontinental-ballistic-missile-launch.html\">Canada condemns North Korea’s Intercontinental Ballistic Missile launch</a></li>\n</ul></div>\n      "
}