{
  "path": "/en/news/statements/2020/10/18/statement-prime-minister-small-business-week",
  "pageTitle": "Statement by the Prime Minister on Small Business Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement marking Small Business Week, which runs from October 18 to 24, 2020:</p>\n\n<p>“Small businesses are key drivers of the Canadian economy and the cornerstone of our communities. They are the day care you drop your kids off at every morning. The mom and pop corner store down the street that gave you your first job. The family-owned restaurant that knows your order off by heart. They transform ideas into new products, create good middle class jobs, and keep our country prosperous, modern, and competitive – and this year, small businesses, their workers, and their owners, need all of us more than ever.</p>\n\n<p>“As we all continue to deal with the impacts of the global COVID-19 pandemic, today we mark the beginning of <a href=\"https://www.bdc.ca/en/small-business-week/pages/home.aspx\">Small Business Week</a> in Canada. It is a time to recognize the enormous contributions that small businesses make to our country and the challenges that they have recently faced due to the pandemic. This year’s Small Business Week will also focus on what entrepreneurs across the country are doing to adapt and position their businesses for the recovery.</p>\n\n<p>“In the last year, small businesses have faced this pandemic with incredible resilience, innovation, and a recognition that we must all prioritize our health and safety to fight COVID-19. They have made sacrifices to help our communities, and have faced these challenges with a spirit of creativity and ingenuity. But we know that for many, times have been extraodinarily tough. With workers needing to stay home and businesses forced to shut down or change their operations, too many families have been left without a paycheck and too many small businesses without revenue.</p>\n\n<p>“From the beginning of this crisis, our government took immediate, significant, and decisive action to help Canadian businesses keep their doors open and their employees on the job during these critical times. We have supported over 3.7 million jobs through the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a> (CEWS) to help businesses keep workers on the payroll. We launched the <a href=\"https://ceba-cuec.ca/\">Canada Emergency Business Account</a> (CEBA) to help small businesses seriously impacted by the pandemic cover expenses as they safely navigate a period of shutdown. We continue to work with financial institutions to offer the <a href=\"https://www.edc.ca/en/solutions/working-capital/bcap-guarantee.html\">Business Credit Availability Program</a>, helping companies manage day-to-day expenses or new costs they face due to COVID-19. We deferred GST/HST remittances and custom duty payments so small businesses could have a bit more breathing room to cover operating costs or keep their workers employed. And in partnership with the provinces and territories, we created the <a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/notices/2020/canada-emergency-commercial-rent-assistance-cecra-small-businesses\">Canada Emergency Commercial Rent Assistance</a> to provide rent relief to commercial tenants from April through September, which supported over 133,000 small businesses that employ 1.2 million Canadians.</p>\n\n<p>“As we continue to deal with the health and economic impacts of the pandemic, and work towards rebuilding a more resilient economy, we will continue to be there. We recently announced the new Canada Emergency Rent Subsidy, which would help cover up to 90 per cent of rent for a business that needs to temporarily shut down due to public health orders. We have also expanded the CEBA, proposed to extend the CEWS until June 2021, and are supporting local jobs and regional economies across Canada through the <a href=\"https://www.ic.gc.ca/eic/site/icgc.nsf/eng/h_07682.html\">Regional Relief and Recovery Fund</a>. And we will continue to offer more support, for as long as necessary, because to build back better, we need to make sure that our small businesses and their employees have what they need to get back up and running.</p>\n\n<p>“On this Small Business Week, I want to say a special thank you to all the small business owners and entrepreneurs across Canada. Your business has helped raise your family, created good middle class jobs, and shaped your communities. We know the sacrifices that you have made for our country, and we will always be there to support you and your businesses – because your success will be key to getting millions of hardworking Canadians back to work.</p>\n\n<p>“I invite Canadians to join me this week in thanking the small and medium-sized businesses for contributing so much to our country. I also encourage everyone to buy local, order take out, and show as much support as you can for our small businesses. Only together can we defeat this virus and build a more resilient Canada.”</p></div>\n      "
}