{
  "path": "/en/news/news-releases/2018/07/20/prime-minister-announces-more-money-canadian-families",
  "pageTitle": "Prime Minister announces more money for Canadian families | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Two years ago, the Government of Canada introduced the Canada Child Benefit (CCB) – a simpler, tax-free, new child benefit better targeted to those who need it most. Since then, the CCB has helped lift more than half a million people – including 300,000 children – out of poverty, and nine out of 10 families now have more money in their pockets to help with the high cost of raising their kids.</p><p>The Prime Minister, Justin Trudeau, today announced that the CCB has increased to keep up with the cost of living. This change comes two years ahead of schedule and will give hardworking parents more money each month to buy the things their families need. The indexation of the CCB will provide an additional $5.6 billion in support to Canadians and their families over the next five years. When the cost of everyday essentials like groceries goes up, families will receive more in benefits each month.</p><p>For the 2018-19 benefit year, the CCB will have a maximum annual benefit of $6,496 per child under 6&nbsp;years old and $5,481 per child aged 6 to 17 years. On average, families will receive $6,800 a year, tax-free, to put healthy food on the table, pay for summer camp, and buy new clothes for the upcoming school year.</p><h2>Quote</h2><blockquote><p>“Since its introduction, the Canada Child Benefit has given much needed relief to parents across the country who are working hard to make ends meet. Starting today, Canadian families will receive even more money. We promised Canadians that we would index the CCB to inflation, and I’m proud we’ve delivered, two years earlier than expected.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Across Canada, CCB payments worth over $23 billion benefit nearly 3.7&nbsp;million Canadian families every year.</li><li>In 2017, a single parent earning $35,000 with two children received more than $11,000 tax-free through the CCB. Today, thanks to the accelerated indexation of the CCB, they will see that number go up by nearly $600 for the 2019-20 benefit year.</li></ul><h2>Associated Link</h2><ul><li><a href=\"https://www.canada.ca/en/employment-social-development/campaigns/canada-child-benefit.html\">Canada Child Benefit</a></li></ul></div>\n      "
}