{
  "path": "/en/news/readouts/2020/06/08/prime-minister-justin-trudeau-speaks-president-liberia-george-weah",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Liberia George Weah | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Liberia, George&nbsp;Weah.&nbsp;</p>\n\n<p>The Prime Minister and the President discussed the latest developments in the COVID-19 pandemic, as well as&nbsp;national measures taken to protect the health and safety of&nbsp;citizens. &nbsp;</p>\n\n<p>The Prime Minister and the President&nbsp;discussed the effects of COVID-19&nbsp;on the continent, and&nbsp;the&nbsp;importance of a coordinated approach to strengthen&nbsp;capacity&nbsp;in Africa&nbsp;to fight the pandemic and meet the needs of those most vulnerable.</p>\n\n<p>The two leaders affirmed their desire to increase ties between&nbsp;Canada and Liberia.</p>\n\n<p>The leaders also spoke about the importance of longer-term recovery measures to build economic resilience in Africa. The Prime Minister highlighted the joint initiative he recently launched with the United Nations Secretary-General and the Prime Minister of Jamaica that aims to accelerate the global response to the pandemic and improve access to critical development financing, including for low- and middle-income countries.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/cotedivoire/bilateral_relations_bilaterales/canada_liberia-liberie.aspx?lang=eng\">Canada - Liberia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/28/governments-and-international-organizations-come-together-address\">Governments and international organizations come together to address economic challenges and sustainability</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}