{
  "path": "/en/news/statements/2022/03/21/statement-prime-minister-international-day-elimination-racial",
  "pageTitle": "Statement by the Prime Minister on the International Day for the Elimination of Racial Discrimination | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for the Elimination of Racial Discrimination:</p>\n\n<p>“Today, on the&nbsp;<a href=\"https://www.un.org/en/observances/end-racism-day\">International Day for the Elimination of Racial Discrimination</a>,&nbsp;we come together to reject all forms of racism, discrimination, and hatred. While we have made progress with our efforts to fight systemic racism and injustice in Canada and globally, far too many people still face discrimination and hate based on the colour of their skin, their background, or their faith. So today, we reaffirm our commitment to building a world where everyone has an equal opportunity to succeed.</p>\n\n<p>“More work needs to be done to create a fair, equal, and inclusive society. The COVID‑19 pandemic has created and exacerbated social and economic exclusion and inequity for Indigenous Peoples, Black Canadians, and other racialized and religious minority communities. This is why the Government of Canada has supported – and continues to support – these groups during the pandemic through a robust COVID-19 Economic Response Plan.</p>\n\n<p>“The government continues to tackle and speak out against the systemic inequities and discrimination that Indigenous Peoples experience in Canada. We are working with First Nations, Inuit, and Métis to renew our nation-to-nation, Inuit-Crown, and government-to-government relationships, through healing, truth, meaningful reconciliation, and cooperation. Last June, the <a href=\"https://www.justice.gc.ca/eng/declaration/index.html\"><em>United Nations Declaration on the Rights of Indigenous Peoples Act</em></a> was passed into law in Canada, establishing a roadmap for fully recognizing, respecting, and protecting the human rights of Indigenous Peoples. As well, last November, we introduced criminal law reforms to address the overrepresentation of Indigenous Peoples, Black and marginalized Canadians in the criminal justice system.</p>\n\n<p>“As part of the Government of Canada’s ongoing commitment to combat all forms of anti‑Black racism, we officially recognized the <a href=\"https://www.un.org/en/observances/decade-people-african-descent\">United Nation’s International Decade for People of African Descent</a> (2015-24). We are also developing a whole‑of‑government action plan to eliminate systemic racism, address inequities in the criminal justice system, and improve the social, health, and economic well‑being of Black Canadians. In 2020, we launched Canada’s first-ever <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a> to support Black Canadian business owners and entrepreneurs as they grow their businesses. We also committed to developing a Black Canadians Justice Strategy, and last month, we dedicated up to $50&nbsp;million to support Black-led organizations in building housing, and providing more affordable rental housing for Black households in Canada.</p>\n\n<p>“We need to continue working together to eliminate racism in our workplaces as well as our education, health, and social systems by demonstrating leadership, empowering communities, building awareness, and changing attitudes. Whether it is anti-Indigenous, anti-Black, or anti-Asian racism, antisemitism or Islamophobia, we all have a role to play in calling out racism and discrimination – whenever and wherever we see it. As part of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti‑Racism Strategy</a>, and with the support of the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, we will keep tackling discrimination, hate, and systemic inequities in Canada, and work to design more effective legislation, policies, programs, and services that will benefit all Canadians.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to confront racism, discrimination, and xenophobia in all their forms. Together, we can build a safer, fairer, and more inclusive country for everyone.”</p></div>\n      "
}