{
  "path": "/en/news/news-releases/2018/11/26/prime-minister-attend-g20-leaders-summit-argentina",
  "pageTitle": "Prime Minister to attend G20 Leaders’ Summit in Argentina | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Buenos Aires, Argentina, to attend the G20&nbsp;Leaders’ Summit from November 29 to December&nbsp;1.</p><p>The G20 Summit – like the G7 Summit was in Charlevoix – is a key opportunity to make progress toward a world where everyone can benefit from the increasingly global and digital economy.</p><p>As the 2018 G7 President, Canada has brought countries together to create good, middle class jobs, invest in economic growth that benefits everyone, advance gender equality and women’s economic empowerment, fight climate change, protect our oceans, and promote clean energy. At the G20 Summit, the Prime Minister will continue to champion these pressing issues, and ensure G20 countries build on progress made at the G7 Summit.</p><p>The Prime Minister will underscore how creating new opportunities for the middle class, and people working hard to join it, is the best way to help people deal with the uncertainty of a changing world, and stem the spread of polarization and division.</p><p>He will also stress the need for countries to unite around a common set of rules and principles, and work together to resolve common challenges and build a more hopeful, prosperous future for people everywhere.</p><p>During the Summit, world leaders will discuss ways to achieve fair and sustainable development, and deliver economic growth that leaves no one behind. They will also focus on how best to prepare people for the future of work, ensure a sustainable food future, and advance infrastructure projects that strengthen communities around the world.</p><h2>Quotes</h2><blockquote><p>“No matter where we live, our fortunes are in some way tied together. So are the challenges we face. I look forward to joining fellow G20 leaders in Buenos Aires to build on the progress made at G7 to fight climate change, advance gender equality, and strengthen the middle class and offer real help to people working hard to join it.”<br><i><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><blockquote><p>“Canada and Argentina know that we must make globalization work for more people, and our presidencies will help do just that by addressing income inequality, strengthening financial governance, creating a fairer global tax system, and fighting corruption. This is about working together to create a more stable and prosperous world for generations to come.”<br><i><cite>— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>This is the fourth time Prime Minister Justin Trudeau will attend the G20 Leaders’ Summit.</li><li>The Minister of Foreign Affairs, Chrystia Freeland, and the Minister of Finance, Bill Morneau, will accompany the Prime Minister to the Summit.</li><li>The Summit brings together leaders of major advanced and emerging economies to address pressing global challenges.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.g20.org/en\">G20</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li></ul></div>\n      "
}