{
  "path": "/en/news/readouts/2022/02/01/prime-minister-justin-trudeau-speaks-president-france-emmanuel-macron",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of France Emmanuel Macron | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of France, Emmanuel Macron.</p>\n\n<p>Prime Minister Trudeau and President Macron shared their concerns over Russia’s aggressive and destabilizing actions in and around Ukraine, and underlined the need for Russia to engage constructively to find a diplomatic solution. Prime Minister Trudeau stated that the strength of the NATO Alliance is its unity, and emphasized the importance of continued coordination and dialogue between Allies and partners. The two leaders emphasized that any further military incursion into Ukraine would have severe costs and serious consequences, including through coordinated sanctions.</p>\n\n<p>The two leaders considered opportunities to address global security and foreign policy challenges by working together and with partners and Allies in multilateral institutions. They discussed expanding cooperation with respect to engagement in the Indo-Pacific region. The Prime Minister and President spoke about the situation in Ethiopia, and emphasized their commitment to continue working with countries in the Sahel to help restore peace, stability, and prosperity in the region.&nbsp;The leaders both expressed their support for the people of Lebanon, and discussed the importance of governmental reforms and holding elections in the country.&nbsp;Building on Canada’s recent hosting of an international ministerial meeting on Haiti, the Prime Minister and President discussed support for Haiti, including with respect to public security, open and inclusive political dialogue, governance, and humanitarian needs.</p>\n\n<p>The Prime Minister and President underlined the dynamic and deep relations between Canada and France. They agreed that continued bilateral and multilateral cooperation – including on digital issues such as artificial intelligence – is essential to further strengthening the relationship between the two countries. The two leaders looked forward to continuing to work together to make progress on shared priorities, such as protecting international peace and security, increasing trade and job creation, and promoting democracy and human rights, including through the G7 and the G20.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/18/prime-minister-justin-trudeau-speaks-ministers-situation-ukraine\">Prime Minister Justin Trudeau speaks with ministers on the situation in Ukraine</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/06/canada-joins-international-coalition-for-the-sahel.html\">Canada joins International Coalition for the Sahel</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/01/chairs-statement-ministerial-meeting-on-haiti.html\">Chair’s statement: Ministerial meeting on Haiti</a></li>\n</ul></div>\n      "
}