{
  "path": "/en/news/news-releases/2017/06/02/prime-minister-trudeau-welcome-myanmars-state-counsellor-daw-aung-san",
  "pageTitle": "Prime Minister Trudeau to welcome Myanmar’s State Counsellor Daw Aung San Suu Kyi to Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Her Excellency Daw Aung San Suu Kyi, State Counsellor of the Republic of the Union of Myanmar, will visit Canada from June 5 to 9, 2017.</p><p>Prime Minister Trudeau will meet with Daw Aung San Suu Kyi on June 7 to discuss federalism and democratic reforms in Myanmar, as well as regional peace and security and the importance of promoting democracy, good governance and human rights. While in Canada, Daw Aung San Suu Kyi will also meet with the Governor General, His Excellency David Johnston.</p><h2>Quote</h2><blockquote><p>“I am pleased to announce Daw Aung San Suu Kyi’s upcoming visit to Canada. Our country plays a strong role in promoting democracy, the rule of law and national peace in Myanmar. We will continue to advocate for further reforms in Myanmar, especially those that support ethnic and religious minorities, women, and young people.”<br>—&nbsp;<cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><i>&nbsp;</i>Quick Facts</h2><ul><li>Daw Aung San Suu Kyi spent more than 15 years in detention from 1989 to 2010. This was because of her political activism going back to 1962 in opposing the military’s control of Myanmar.</li><li>In November 2015, Daw Aung San Suu Kyi, State Counsellor of the Republic of the Union of Myanmar, &nbsp;was democratically elected and is now leading the ongoing reforms and the peace process in her country.</li><li>Daw Aung San Suu Kyi was awarded a Nobel Peace Prize in 1991 in recognition for her non-violent struggle for democracy and human rights.</li><li>She is also the recipient of many other international awards, including the Sakharov Prize from the European Parliament and the United States Presidential Medal of Freedom.</li><li>Daw Aung San Suu Kyi is one of just six people to receive honorary Canadian citizenship. The others are Raoul Wallenberg, Nelson Mandela, the 14<sup>th</sup> Dalai Lama, the Aga Khan, and Malala Yousafzai.</li></ul><h2>Associated Links</h2><ul><li><b><a href=\"http://www.canadainternational.gc.ca/burma-birmanie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Myanmar relations</a></b></li><li><b><a href=\"http://www.international.gc.ca/development-developpement/countries-pays/burma-birmanie.aspx?lang=eng\">Canadian international assistance in Myanmar</a></b></li></ul></div>\n      "
}