{
  "path": "/en/news/news-releases/2019/04/02/prime-minister-announces-even-closer-cooperation-israel",
  "pageTitle": "Prime Minister announces even closer cooperation with Israel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, met with the President of Israel, Reuven Rivlin, to celebrate the 70th anniversary of diplomatic relations between Canada and Israel, and the two countries’ long history as close friends, steadfast allies, and partners in international organizations.</p>\n\n<p>During the visit, Prime Minister Trudeau and President Rivlin discussed the benefits of progressive trade, and how the updated Canada-Israel Free Trade Agreement&nbsp;(CIFTA) will help grow our economies and create good jobs and new opportunities for people and businesses in both our countries. CIFTA will allow for expanded bilateral trade and investment and support Canada’s efforts to diversify our export markets.</p>\n\n<p>In addition, Canada and Israel have launched discussions on a youth mobility agreement. The agreement would allow young people from both countries to work when they travel to each other’s country, which would deepen our countries’ strong people-to-people ties and help more young people gain valuable international work experience.</p>\n\n<p>Prime Minister Trudeau and President Rivlin agreed on the need to always speak out in the strongest possible terms against anti-Semitism wherever it occurs, and to confront and counter all forms of hatred.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Israel are close friends and steadfast allies united by democratic values and deep people-to-people bonds. We are proud to stand with Israel. We are continually looking for new ways to expand the trade and security relationship between our two countries – and we will always stand up and speak out against anti-Semitism, wherever it occurs. By updating the Canada-Israel Free Trade Agreement, and exploring a youth mobility agreement, we are setting up both of our countries for future prosperity and growth, creating new jobs, and paving the way for an even closer Canada-Israel relationship.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On May 11, 1949, Canada officially recognized and established diplomatic relations with the State of Israel.</li>\n\t<li>There are close to 35,000 Canadians living in Israel and a large number of Canadian tourists visit Israel annually. The Canadian-Jewish community numbers more than 350,000 – the fourth largest Jewish community in the world.</li>\n\t<li>President Rivlin met with Governor General Julie Payette and planted a blue beech tree on the grounds of Rideau Hall to commemorate his visit.</li>\n\t<li>President Rivlin joined the Prime Minister at the National Holocaust Monument in Ottawa, where he laid a wreath. In Toronto, the President launched the Canada-Israel Business Forum.</li>\n\t<li>Canada and Israel have a healthy commercial relationship. In 2018, Canadian exports to Israel totalled almost $500 million. Imports from Israel totalled almost $1.4 billion. Since CIFTA’s entry into force, two-way merchandise trade between Canada and Israel has more than tripled, totaling $1.9 billion in 2018.</li>\n\t<li>In addition to CIFTA, a key element of the commercial relationship is collaboration in science, technology and innovation. Bilateral science, technology and innovation relations are strong, developed through more than 20 years of close collaboration.</li>\n\t<li>The 2014 Canada-Israel Strategic Partnership Memorandum of Understanding facilitates deeper cooperation in areas including energy, security, international aid and development, innovation and the promotion of human rights globally.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.gg.ca/en/media/news/2019/governor-general-announces-state-visit-canada-president-israel\">Governor General announces state visit Canada-President of Israel</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/israel/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada – Israel Relations</a></li>\n</ul></div>\n      "
}