{
  "path": "/en/news/news-releases/2018/07/10/prime-minister-concludes-successful-visit-latvia",
  "pageTitle": "Prime Minister concludes successful visit to Latvia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful visit to Latvia. The Prime Minister’s visit was an opportunity to meet with members of the Canadian Armed Forces (CAF) deployed on Operation REASSURANCE, reaffirm Canada’s commitment to the NATO Alliance and trans-Atlantic security, and deepen the strong ties between Canada and Latvia.</p><p>While in Latvia, Prime Minister Trudeau visited the Canadian-led multinational NATO enhanced Forward Presence (eFP) battlegroup Latvia and met with CAF members and the seven other Allied nations that make up the battlegroup. He saw firsthand the dedication and professionalism of CAF members and thanked them for their service. The Prime Minister toured the Ādaži Military Base, accompanied by Latvian Prime Minister&nbsp;Māris&nbsp;Kučinskis, as well as Canada’s Minister of Foreign Affairs, Chrystia Freeland, and Canada’s Minister of Defence, Harjit Singh Sajjan and General Jonathan Vance.</p><p>Earlier today, Prime Minister Trudeau met with Prime Minister Māris&nbsp;Kučinskis and President Raimonds Vējonis. They highlighted NATO’s important contribution to security and stability in Eastern and Central Europe, and discussed how Canada-European Union Comprehensive Economic and Trade Agreement (CETA) is opening doors for people and businesses on both sides of the Atlantic.</p><p>The Prime Minister announced that Canada will renew its contribution to NATO’s eFP through Operation REASSURANCE for another four years, from April&nbsp;2019 to March 2023. Canada will continue to lead NATO’s eFP battlegroup Latvia as the Framework Nation, and will also increase the number of CAF members deployed to Latvia from 455 to 540.</p><p>Canada’s contribution to NATO under Operation REASSURANCE will continue to include air surveillance, air policing, training, and maritime operations, in addition to the land forces deployed to Latvia.</p><p>Prime Minister Trudeau also participated in a flower laying ceremony in Riga at the Freedom Monument, a memorial honoring the soldiers that lost their lives during the Latvian War of Independence.</p><p>The Prime Minister will now travel to Belgium to attend the NATO Summit.</p><h2>Quotes</h2><blockquote><p>“It was an honour to meet with Canadian Armed Forces members deployed to Latvia on Operation REASSURANCE. I saw firsthand the contributions they are making in Latvia. All Canadians can be proud of how they are representing our country and working with our Allies to maintain security and stability in the region.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“It was a pleasure to meet with Prime Minister Kučinskis and President Vējonis to reinforce our strong bilateral relationship, and reaffirm our commitment to NATO’s defence and deterrence measures in Eastern and Central Europe. We will continue to work together to create new economic opportunities for Canadians and Latvians, and Canada will remain a strong and reliable ally, now and into the future.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is the first bilateral visit to Latvia by a Canadian prime minister.</li><li>Canada enjoys a strong relationship with Latvia. Canada was the first G7 country to recognize the restoration of Latvia's independence in 1991, and one of the first countries to ratify Latvia's accession to NATO in 2004.</li><li>This relationship is strengthened by our strong people-to-people bonds, including an active Latvian community in Canada of approximately 28,000&nbsp;people.</li><li>Operation REASSURANCE is the CAF’s support to NATO assurance and deterrence measures in Central and Eastern Europe.</li><li>Since 2014, Canada has actively worked alongside NATO Allies to maintain security and stability in Central and Eastern Europe.</li><li>Operation REASSURANCE represents Canada’s largest sustained presence in Europe in more than a decade.</li><li>The CAF members also train and exercise side-by-side with their Latvian counterparts.</li><li>Canada is proud to serve in Latvia alongside NATO Allies in the battlegroup, including Albania, the Czech Republic, Italy, Poland, Slovakia, Slovenia, and Spain.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/news-releases/2018/07/03/prime-minister-trudeau-travel-latvia\">Prime Minister Trudeau to travel to Latvia</a></li><li><a href=\"/en/news/news-releases/2018/06/25/prime-minister-trudeau-attend-nato-summit\">Prime Minister Trudeau to attend NATO Summit</a></li><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/nato-ee.page\">Operation REASSURANCE</a></li><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li></ul></div>\n      "
}