{
  "path": "/en/news/statements/2018/03/08/statement-prime-minister-international-womens-day",
  "pageTitle": "Statement by the Prime Minister on International Women’s Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Women’s Day:</p><p>“Today, on <a href=\"http://www.swc-cfc.gc.ca/commemoration/iwd-jif/index-en.html\">International Women’s Day</a>, we celebrate the achievements of women everywhere and reaffirm our collective commitment to gender equality.</p><p>“This year’s theme, #MyFeminism, reminds us that everyone has the power to lead and carry us closer to gender equality. It also recognizes feminists, from early suffragettes to activists today, who have paved the way towards justice and equality, and worked tirelessly to advance the rights of women and people with diverse gender identities. Their vision and determination have brought us a long way, but we still have a long way to go.</p><p>“Around the world and here in Canada, women continue to face barriers to achieving their full potential – from discrimination, to harassment and gender-based violence, to a lack of opportunity, freedom, and support. Not all women experience the same challenges, and certain women and girls, including Indigenous women and others whose identities are historically marginalized, face particular and disproportionate obstacles.</p><p>“None of us can move forward if half of us are held back. That is why this year, the Government of Canada released a historic federal budget that, for the first time in Canadian history, puts gender equality at its core. Budget 2018 has gone through a full <a href=\"http://www.swc-cfc.gc.ca/gba-acs/index-en.html\">gender-based analysis plus</a>. This approach factors in the lived experience of women – half of our population and workforce – and looks closely at how different groups of women, men, and gender-diverse people may experience decisions and policies.</p><p>“Budget 2018 will make a concrete difference in the lives of women of all backgrounds, in communities across Canada. It lays the groundwork to close the gender wage gap, and promotes equality by helping more parents take parental leave. It includes investments to support women entrepreneurs and women-owned business, help women enter and succeed in the trades, and end gender-based violence, including on university campuses.</p><p>“Beyond our borders, Budget 2018 provides&nbsp;for major new investments – $2 billion over five years – to strengthen the impact of the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, which puts the empowerment of women and girls at the centre of all our international assistance. Advancing gender equality and women’s empowerment is also one of the five key themes of Canada’s 2018 G7 Presidency. To that end, we announced yesterday the members of the <a href=\"https://g7.gc.ca/en/g7-presidency/gender-equality-advisory-council/\">G7 Gender Equality Advisory Council</a>, chaired by Isabelle Hudon, Canada’s Ambassador to France, and Melinda Gates, Co-chair of the Bill and Melinda Gates Foundation. This new council will recommend concrete actions on gender equality and women’s empowerment across all areas of the G7’s work.</p><p>“Every single one of us – no matter our gender identity – has a role to play in achieving gender equality. On International Women’s Day, and every day, let us celebrate women’s contributions, stand up for women’s rights, and listen to women’s voices. Together, we can build a world where women and girls no longer face high walls and glass ceilings, and are free to realize their full potential.”</p></div>\n      "
}