{
  "path": "/en/news/statements/2022/01/01/statement-prime-minister-75th-anniversary-canadian-citizenship",
  "pageTitle": "Statement by the Prime Minister on the 75th anniversary of Canadian citizenship | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75th&nbsp;anniversary of Canadian citizenship:</p>\n\n<p>“Seventy-five years ago today, the <em>Canadian Citizenship Act</em> became law, marking the start of Canadian citizenship as a legal status. This historic moment established who was – and who could become – a Canadian citizen, and stood as an important expression of our country’s national identity.</p>\n\n<p>“The Act also made Canada the first Commonwealth country to create its own citizenship, separate from the one of the United Kingdom, making us Canadians rather than British subjects. Over the years, the Act evolved to become the <em>Citizenship Act</em> and saw various amendments, leading to greater equity and improvements to Canada’s citizenship program. Today, Canadian citizens across the country and around the world proudly share freedoms and rights, while embracing the responsibilities given to them by their status. In the past decade, more than two million people have taken the oath of citizenship to become Canadian citizens.</p>\n\n<p>“The Government of Canada recognizes that investing in immigration helps strengthen and grow our economy, but we also know that the pandemic has caused delays for those looking to build a future in Canada. That is why the government is committed to increasing immigration levels and reducing wait times for applicants, while delivering a world‑leading refugee resettlement program and supporting family reunification, so that families can be together sooner. Thanks to this work, and the support of communities and Canadians across the country, Canada has welcomed more than 400,000 newcomers in 2021 – the most in a single year of our country’s history.</p>\n\n<p>“We also know that there is still work to do to make Canada a fairer, more inclusive, and more equitable place for everyone, including new Canadians. No matter their background, a Canadian is a Canadian. Unfortunately, many have faced additional barriers to social and economic participation due to the pandemic. Prejudice, discrimination, and systemic racism also continue to be a lived reality for many immigrants across the country. As we continue the fight against COVID-19, we will keep taking meaningful steps to ensure all Canadians have a real and fair chance at success.</p>\n\n<p>“As a country, we are strong thanks to our people, our diversity, and our differences. For generations, immigrants and new Canadians have embodied the values of openness, compassion, and respect that define and unite us. In calling this country home, they have shaped Canada’s identity, and their significant social, cultural, and economic contributions make us the country we are today. We must never forget or take this for granted.</p>\n\n<p>“On this day, as we mark the 75th anniversary of our shared Canadian citizenship, I invite each and every one of us to celebrate what it means to be Canadian, and to learn about the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/discover-canada.html\">rights and responsibilities of citizenship</a>. Let us reflect on the freedoms we enjoy and values we share as a Canadian family. Together, Canadians from coast to coast to coast can continue to build a stronger, more diverse, and more inclusive country.”</p></div>\n      "
}