{
  "path": "/en/news/news-releases/2019/07/17/prime-minister-announces-new-lieutenant-governor-saskatchewan",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Russell&nbsp;Mirasty as the new Lieutenant Governor of Saskatchewan.</p>\n\n<p>Mr. Mirasty has dedicated much of his life to public service. During his 36-year career in the Royal Canadian Mounted Police, he served in various roles across the country. A member of the Lac La Ronge Indian Band, he notably became the first Indigenous person to command a division of the&nbsp;national police force.</p>\n\n<p>In his retirement, Mr. Mirasty has continued to make a difference in his home province of Saskatchewan, working to improve the province’s education system. His appointment follows that of the former Lieutenant Governor, the Honourable W.&nbsp;Thomas Molloy, who passed away earlier this month after a battle with cancer.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Known as a relationship-builder, Mr. Mirasty is an outstanding leader who paved the way for Indigenous peoples in the national police force. As Lieutenant Governor of Saskatchewan, I know he will continue to make a difference for the people of his province and all Canadians, and inspire others to create change in their communities.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Lieutenant Governors are the personal representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, and visiting communities.</li>\n\t<li>Lieutenant Governors are appointed by Her Excellency the Right Honourable Julie Payette, Governor General of Canada, on the recommendation of the Prime Minister. They serve terms of at least five years.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/07/17/russell-mirasty\">Russell Mirasty</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/crown-canada/lieutenant-governors.html\">The Lieutenant Governors</a></li>\n</ul></div>\n      "
}