{
  "path": "/en/news/statements/2020/12/07/statement-prime-minister-50th-anniversary-report-royal-commission-status",
  "pageTitle": "Statement by the Prime Minister on the 50th anniversary of the Report by the Royal Commission on the Status of Women in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 50th anniversary of the tabling in Parliament of the Report by the Royal Commission on the Status of Women in Canada:</p>\n\n<p>“Fifty years ago today, the groundbreaking Report by the Royal Commission on the Status of Women in Canada was tabled in Parliament. The Commission’s report outlined 167 detailed recommendations to address challenges faced by women and to achieve gender equality in Canada.</p>\n\n<p>“The Commission, chaired by journalist and broadcaster Florence Bird, was the first‑ever to be led by a woman. Its mandate was to inquire and report on the status of women in Canada, and find ways to ensure equality for women in all aspects of society. The report addressed a number of key areas, including education and the participation of women in the economy and public life. It ultimately defined the status of women in Canada as a social issue that needed to be addressed collectively. The report’s findings opened eyes, opened ears, and opened hearts to the realities women face every day. It was a catalyst for social change and government action, and resulted in important improvements to the shelter system, child and family benefits, and reproductive rights, including access to contraception.</p>\n\n<p>“The Canada we know today is not the same place it was 50 years ago. There are now 100 women Members of Parliament, 99 more than the lone woman when the report was tabled. Every province and territory has a minister responsible for the status of women, and federal, provincial, and territorial governments have been collectively working together to advance gender equality for close to 40 years. This month also marks the second anniversary of the creation of Women and Gender Equality Canada, the first stand-alone department at the federal level dedicated to the advancement of women and people of all gender identities and expressions. But this is a work in progress, and there remains much to be done to continue tackling critically important issues like gender-based violence and discrimination against Indigenous peoples, racialized women, and members of LGBTQ2 communities.</p>\n\n<p>“This year, the global COVID-19 pandemic has significantly impacted women. It has deepened many of the inequalities and injustices women face in our society, including shouldering a disproportionate amount of unpaid work at home. The government will continue to take the necessary steps with partners, both in Canada and around the world, to address these gaps and overcome the challenges women face.</p>\n\n<p>“Canada is deeply committed to advancing gender equality and continuing to make progress on the recommendations laid out in the report. To help more women enter and remain in the workforce, the government is making historic investments in women’s and equality-seeking organizations, training opportunities, recruitment programs, child care, and parental leave. As promised in the Speech from the Throne, we are also working to create a Canada-wide early learning and child care system. In the Fall Economic Statement, we announced our proposed plan to bring partners together toward a common vision, including through the creation of a Federal Secretariat on Early Learning and Child Care. We will also work with provinces and territories to support early childhood educators. For instance, we will engage them on future sustained investments in support of an Early Childhood Educator Workforce Strategy. Finally, in Budget 2021, we will lay out a plan to provide affordable, accessible, inclusive, and high-quality child care from coast to coast to coast.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to mark this anniversary by recognizing the critical contributions women make in Canada and around the world, each and every day. Together, let us take these efforts forward as we build a fairer, more resilient Canada and a more equal and inclusive society for everyone.”</p></div>\n      "
}