{
  "path": "/en/news/statements/2018/04/15/statement-prime-minister-national-volunteer-week",
  "pageTitle": "Statement by the Prime Minister on National Volunteer Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Volunteer Week:</p><p>“During <a href=\"https://volunteer.ca/index.php?MenuItemID=326\">National Volunteer Week</a>, we recognize Canadians who improve the lives of others, and build a better country, one selfless act at a time.</p><p>“This year’s theme, ‘Celebrate the value of volunteering – building confidence, competence, connections, and community,’ reminds us that when we give our time and talent, we gain even more. We meet new people, learn valuable skills, and broaden our horizons. We draw our communities closer together, and show that even the smallest act of kindness can make our country and our world a better place.</p><p>“The Government of Canada is dedicated to making sure more young people have opportunities to serve. Earlier this year, we launched the first phase of Canada Service Corps, the country’s first national youth service initiative. We are working with young Canadians to create a program that will provide them with meaningful volunteer and service opportunities, and inspire a new culture of service across the country.</p><p>“Volunteers accomplish extraordinary things every day, often with little recognition. When <a href=\"https://www.canada.ca/en/employment-social-development/programs/volunteer-awards.html\">Canada’s Volunteer Awards</a> open for nominations later this week, I hope all Canadians take the time to nominate someone they know who is changing lives – and bettering our communities – through service.</p><p>“When we give back, we raise each other up. On behalf of the Government of Canada, I thank all volunteers, whose service and selflessness move this country forward and bring us all closer together.”</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p></div>\n      "
}