{
  "path": "/en/news/statements/2018/01/17/statement-prime-minister-raoul-wallenberg-day",
  "pageTitle": "Statement by the Prime Minister on Raoul Wallenberg Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Raoul Wallenberg Day:</p><p>“Today, we pay tribute to Raoul Wallenberg, a humanitarian and hero who saved tens of thousands of Hungarian Jews during the Holocaust.</p><p>“Working as a Swedish diplomat in Budapest, Mr. Wallenberg issued ‘protective passports’ to thousands of Hungarian Jews. Known as the Schutz-Pass, these documents served as Swedish passports and provided protection from deportation to their bearers.</p><p>“Mr. Wallenberg went to great lengths to provide these passports, risking his own life to distribute them. He also created a network of safehouses, soup kitchens, hospitals, and child care centres. Operating under the Swedish flag, these safe havens sheltered Jewish people across the city, protecting the lives of thousands more.</p><p>“Toward the end of the war, Mr. Wallenberg tragically disappeared after being taken into Soviet custody. While his fate remains unknown, his legacy lives on in monuments and institutions around the world – and in the stories of those whose lives he saved. In 1985, the Government of Canada made Mr. Wallenberg Canada’s first honorary citizen – and in 2001, it designated January 17 as Raoul Wallenberg Day, in honour of his heroism and courage.</p><p>“Mr. Wallenberg’s story is a reminder that one person can make an extraordinary difference in the world. Each one of us has the power, and the responsibility, to fight against injustice and to stand up for what is right. Today, I encourage all Canadians to honour Mr. Wallenberg’s legacy, and use our courage and compassion in the service of others.”</p></div>\n      "
}