{
  "path": "/en/news/news-releases/2020/03/03/prime-minister-announces-investment-help-young-people-get-jobs",
  "pageTitle": "The Prime Minister announces investment to help young people get jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s future depends on our young people being able to get the good, well-paying jobs they need to succeed. Creating more opportunities for young people to gain valuable skills and experience will strengthen our economy and help build a Canada where no one is left behind.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment through the Youth Employment and Skills Strategy (YESS) to help tens of thousands of young people across Canada who are facing barriers to employment. This funding will go to local and national projects that could help a single parent, a young person experiencing homelessness, visible minority groups, or a person living with disabilities gain the necessary skills to transition to the workforce.</p>\n\n<p>The investment will break down barriers for these young people and provide them flexible and personalized support, employment services, and opportunities that will have a lasting and positive impact on their careers.</p>\n\n<p>YESS supports organizations that provide paid job placements and skills development services to young people, as well as a broad range of support, such as job coaching, mental health support, clothes for job interviews, daycare services for parents, and subsidized internet access to help with job searches.</p>\n\n<p>Every young person in Canada deserves a fair chance at success. The Government of Canada will continue to invest in them, so they can access the resources, training, and services they need to jumpstart their careers and help our economy prosper.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We know that when we break down barriers for young people and give them the skills and experience they need to find a good job, our economy grows for everyone. That’s why we’re creating opportunities for all young Canadians, so they can hit the ground running to build fulfilling careers and prepare for the future.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“An investment in our youth is an investment in Canada's future. Helping break down barriers to employment and giving young Canadians the supports they need to launch meaningful careers is important to building a strong economy for everyone.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada is investing $492 million through Employment and Social Development’s Youth Employment and Skills Strategy (YESS) program for over 270 projects across Canada to help young people facing barriers to employment.</li>\n\t<li>Launched in summer 2019, the modernized YESS integrates the streams of the former Youth Employment Strategy – Skills Link, Career Focus, and Summer Work Experience – into a more integrated and flexible service delivery network.</li>\n\t<li>Young people aged between 15 and 30 are eligible to receive support, employment services and opportunities provided by organizations funded through the YESS.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2019/09/a.html\">Giving young Canadians the skills and experience they need to launch meaningful careers</a></li>\n</ul></div>\n      "
}