{
  "path": "/en/news/news-releases/2019/02/22/state-art-science-facility-supports-skills-development-memorial",
  "pageTitle": "State-of-the-art science facility supports skills development at Memorial University of Newfoundland | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada's colleges and universities are at the forefront of excellence in science, research, and innovation. They play a central role in our society, and help Canadians get the skills and training they need to succeed in the job market and tackle the great challenges of our time. That is why the Government of Canada continues to support our colleges and universities, and invest in students and their futures.</p><p>The Prime Minister, Justin Trudeau, today visited Memorial University in St. John’s, Newfoundland and Labrador, where he highlighted an investment of nearly $100 million from the Government of Canada to build a state-of-the-art science facility. The new facility will house research and laboratory teaching spaces for science and engineering students, as well as collaborative work areas for university and industry partners.</p><p>With construction expected to be completed by 2020, the project is already creating good, middle class jobs. Once opened, the Core Science Facility will attract top talent from across the country and create an integrated learning and research environment that fosters innovation and collaboration across disciplines.</p><h2>Quote</h2><blockquote><p>“Innovation begins at our colleges and universities. Our government will continue to invest in state-of-the-art projects – like Memorial University’s new Core Science Facility – to prepare Canadians for the jobs of today and tomorrow, and make Canada even more competitive on the world stage.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada is contributing nearly $100 million through the New Building Canada Fund <span lang=\"EN-US\" xml:lang=\"EN-US\">– </span>Provincial-Territorial Infrastructure Component – National and Regional Projects. The Province of Newfoundland and Labrador is investing over $25 million, and Memorial University is responsible for the remainder of the total project costs.</li><li>The Provincial-Territorial Infrastructure Component of the New Building Canada Fund provides funding to support infrastructure projects of national and regional significance that contribute to economic growth, a clean environment, and stronger communities.</li><li>Through the Investing in Canada infrastructure plan, the Government of Canada is investing more than $180 billion over 12 years in important projects across the country.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada’s Long-Term Infrastructure Plan</a></li><li><a href=\"https://www.infrastructure.gc.ca/gmap-gcarte/index-eng.html\">Investing in Canada Plan Project Map</a></li></ul></div>\n      "
}