{
  "path": "/en/news/news-releases/2017/08/15/irish-taoiseach-leo-varadkar-visit-canada",
  "pageTitle": "Irish Taoiseach Leo Varadkar to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Irish Taoiseach (Prime Minister) Leo Varadkar will visit Canada from August 19 to 22, 2017. The two leaders will meet in Montréal on August 20<sup>th</sup>. They will also take part in the Pride Parade that day.</p><p>During their meeting, Prime Minister Trudeau and Taoiseach Varadkar will continue discussions from this past July when the two leaders met for the first time in Dublin, Ireland. Their discussions will focus on issues related to diversity and inclusion, and how people and businesses in both countries can benefit from new opportunities available through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p><h2>Quote</h2><blockquote><p>“Ireland and Canada are close friends, and I look forward to meeting again with Taoiseach Varadkar in Montréal. Our two countries enjoy strong family ties, common values, and a shared history. Now we are collaborating again to ensure that CETA creates good, well-paying middle class jobs on both sides of the Atlantic.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the first time a foreign head of government walks with a Canadian prime minister in a Canadian Pride parade.</li><li>On July 4, 2017, Prime Minister Trudeau met with Taoiseach Varadkar and President of Ireland Michael D. Higgins in Dublin to deepen the close collaborative relationship between the two like-minded countries.</li><li>Canada and Ireland share a close relationship, based on strong people-to-people connections, cultural affinities, and shared democratic political traditions. Over 4.5 million Canadians claimed Irish ancestry in 2011, making the Irish-Canadian community one of the largest ethnic groups in Canada.</li><li>The two countries also enjoy very strong commercial relations with two‑way bilateral merchandise trade worth $2.4 billion in 2016, making it Canada’s tenth largest trading partner in the European Union. In that year, Canadian exports totalled $496 million and imports were over $1.9 billion.&nbsp;</li><li>In 2015, Canadian foreign direct investment in Ireland was $13.99 billion and Irish foreign direct investment in Canada was $6.28 billion.</li><li>CETA comes into effect as of September 21, 2017.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/ireland-irlande/bilateral_relations_bilaterales/canada_ireland-irlande.aspx?lang=eng&amp;menu_id=299\">Canada-Ireland Relations</a></li><li><a href=\"/en/news/news-releases/2017/07/05/prime-minister-concludes-visit-ireland-and-united-kingdom\">Prime Minister concludes visit to Ireland and the United Kingdom</a></li><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">CETA: A progressive trade agreement for a strong middle class</a></li></ul></div>\n      "
}