{
  "path": "/en/news/news-releases/2022/06/25/prime-minister-announces-new-task-force-improve-government-services",
  "pageTitle": "Prime Minister announces new task force to improve government services for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadians deserve high-quality and efficient government services that are accessible, timely, and make their lives easier. The delays in immigration application and passport processing are unacceptable and the Government of Canada is urgently working to resolve them as soon as possible.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the creation of a new task force to improve government services, with a focus on reducing wait times for Canadians. The task force, a Committee of Cabinet ministers, will review service delivery, identify gaps and areas for improvement, and make recommendations to ensure Canadians from coast to coast to coast receive the highest quality of service.</p>\n\n<p>As we recover from the pandemic and increasingly adjust to a fast-moving world where more Canadians are once again relying on government services, they have experienced delays in delivery that are far from acceptable. The task force will drive action to improve the processing of passports and immigration applications by identifying priority areas for action and outlining short- and longer-term solutions, with a focus on reducing wait times, clearing out backlogs, and improving the overall quality of services provided to Canadians. As labour shortages continue to lead to air travel delays around the world, the task force will also monitor the situation at Canadian airports.</p>\n\n<p>The Government of Canada is working hard to improve the delivery of services that Canadians rely on every day.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We know service delays, particularly in recent months, are unacceptable. We will continue to do everything we can to improve the delivery of these services in an efficient and timely manner, and this new task force will help guide the work of the government to better meet the changing needs of Canadians and continue to provide them with the high-quality services they need and deserve.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The members of the task force on Services to Canadians are:\n\t<ul>\n\t\t<li>The Hon. Marci Ien, Minister for Women and Gender Equality and Youth (Co-Chair)</li>\n\t\t<li>The Hon. Marc Miller, Minister of Crown-Indigenous Relations (Co-Chair)</li>\n\t\t<li>The Hon. Randy Boissonnault, Minister of Tourism and Associate Minister of Finance</li>\n\t\t<li>The Hon. Mona Fortier, President of the Treasury Board</li>\n\t\t<li>The Hon. Ahmed Hussen, Minister of Housing and Diversity and Inclusion</li>\n\t\t<li>The Hon. Gudie Hutchings, Minister of Rural Economic Development</li>\n\t\t<li>The Hon. Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</li>\n\t\t<li>The Hon. Diane Lebouthillier, Minister of National Revenue</li>\n\t\t<li>The Hon. Mary Ng, Minister of International Trade, Export Promotion, Small Business and Economic Development</li>\n\t\t<li>The Hon. Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada</li>\n\t</ul>\n\t</li>\n\t<li>Ministers responsible for the relevant departments, including the Minister of Families, Children and Social Development, the Minister of Immigration, Refugees and Citizenship, and the Minister of Transport, will be ex-officio members of the task force.</li>\n\t<li>Other members of Cabinet may be invited to participate in task force meetings to provide advice and recommendations on issues related to their respective portfolios.</li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}