{
  "path": "/en/news/news-releases/2018/06/06/prime-minister-announces-appointment-two-senators",
  "pageTitle": "Prime Minister announces the appointment of two Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed the following independent Senators to fill vacancies in the Senate:</p><ul><li><a href=\"/en/news/backgrounders/2018/06/06/donna-dasko-phd\">Donna&nbsp;Dasko (Ontario) </a></li><li><a href=\"/en/news/backgrounders/2018/06/06/pierre-dalphond\">Pierre Dalphond (Quebec)</a></li></ul><p>Dr.&nbsp;Dasko is a sociologist, business leader, and one of Canada’s best known and respected pollsters. A strong advocate for gender equality, Dr.&nbsp;Dasko co-founded and served as the former National Chair of Equal Voice, and helped launch the Campaign for an Equal Senate for Canada.</p><p>The Honourable Pierre Dalphond is a certified arbitrator, accredited mediator, and former senior judge of the Quebec Court of Appeal. With his extensive legal background, Mr. Dalphond is a guest lecturer at the Université de Montréal and speaks regularly at domestic and international conferences.</p><p>Both individuals were recommended by the Independent Advisory Board for Senate Appointments and chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“I am delighted to welcome these accomplished Canadians to the Senate. I look forward to working with Dr.&nbsp;Dasko and Mr. Dalphond. Their remarkable knowledge and experience will be a great benefit to our country.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>These are the 35<sup>th</sup> and 36<sup>th </sup>appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Since 2016, the selection process for Senators has been opened to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides the Prime Minister with recommendations. From the recommended pool of candidates, the Prime Minister selects the individuals he then recommends to the Governor General for appointment to the Senate.</li><li>The Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests –important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/06/06/donna-dasko-phd\">Donna Dasko</a></li><li><a href=\"/en/news/backgrounders/2018/06/06/pierre-dalphond\">Pierre Dalphond</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2018/02/minister_gould_announcesimprovementstothesenateappointmentsproce.html\">Minister of Democratic Institutions announces improvements to the Senate appointments process and launches call for applications</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/7/minister-of-democratic-institutions-announces-launch-of-the-permanent-phase-of-the-independent-senate-appointments-process.html\">Minister of Democratic Institutions announces launch of the permanent phase of the Independent Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/1/minister-of-democratic-institutions-announces-establishment-of-the-independent-advisory-board-for-senate-appointments.html\">Minister of Democratic Institutions announces establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2015/12/government-announces-immediate-senate-reform.html\">Government announces immediate Senate reform</a></li></ul></div>\n      "
}