{
  "path": "/en/news/news-releases/2021/12/16/prime-minister-releases-new-mandate-letters-ministers",
  "pageTitle": "Prime Minister releases new mandate letters for ministers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The COVID-19 pandemic has been difficult for many Canadians, but people from coast to coast to coast have overcome adversity – they adapted and helped one another when it mattered most. The Government of Canada has been there for them since the beginning and will continue to be there every step of the way. The Prime Minister, Justin Trudeau, today released new ministerial mandate letters to guide the Cabinet in moving Canada forward and building a better country for everyone.</p>\n\n<p>The mandate letters outline the government’s plan to find real solutions to the challenges facing Canadians. They reaffirm a commitment to finish the fight against COVID-19 and support a strong economic recovery that leaves no one behind. The mandate letters also outline the government’s focus on tackling climate change, creating new jobs and growing the middle class, putting home ownership back in reach for everyone, delivering on $10‑a‑day child care, and walking the shared path of reconciliation.</p>\n\n<p>The Government of Canada is committed to being open, transparent, and accountable in all its work, and that is why the Prime Minister has publicly released ministerial mandate letters since 2015. These mandate letters also ensure that the government remains focused on delivering results for Canadians, as we continue to work to build a better future where everyone has a real and fair chance at success.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“As we work to finish the fight against COVID-19 and build a better Canada, our team will continue to put Canadians first and tackle the challenges of today and tomorrow. Together, we will get the job done on vaccines, take strong climate action, put home ownership back in reach, create jobs and grow the middle class, and walk the shared path of reconciliation.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>There are, in total, 38 mandate letters, one for each Cabinet minister.</li>\n\t<li>Mandate letters outline the commitments that each minister will work to accomplish, as well as the pressing challenges they will address in their role. Mandate letters are not an exhaustive list of all files a minister will work on.</li>\n\t<li>Publicly available mandate letters help Canadians hold the government to account. They outline the Prime Minister’s expectations for each minister, and give Canadians a clear idea of how the government will deliver its agenda.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"/en/mandate-letters\">Mandate Letters</a></li>\n</ul></div>\n      "
}