{
  "path": "/en/news/statements/2020/05/05/statement-prime-minister-75th-anniversary-liberation-netherlands",
  "pageTitle": "Statement by the Prime Minister on the 75th anniversary of the Liberation of the Netherlands | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, issued the following statement today on the 75th anniversary of the Liberation of the Netherlands:</p>\n\n<p>“Today, on the 75th anniversary of the Liberation of the Netherlands, we honour the incredible courage and sacrifices of the Canadians and Newfoundlanders who fought, and those who gave their lives, to liberate the Netherlands from the tyranny of Nazi Germany.</p>\n\n<p>“The campaign to liberate the Netherlands saw two Canadian army corps fighting together for the first time. Led by Lieutenant-General Charles Foulkes, members of the 1st Canadian Corps fought alongside members of the 2nd Canadian Corps, led by Lieutenant-General Guy Simonds. Both groups battled through the country’s villages, cities, canals, and farmlands to drive out the occupying Nazi forces. Relieved Dutch citizens cheered on the Canadian troops as they welcomed their newfound freedom.</p>\n\n<p>“On this day 75 years ago today, Canadians accepted the surrender of German forces in the Netherlands, marking the end of the suffering of the Dutch people, who had endured years of unspeakable cruelty, misery, and hunger.</p>\n\n<p>“The Liberation of the Netherlands was Canada’s last major contribution to the Allied victory in Europe. But this great victory came at a terrible cost. Of the 175,000 Canadian soldiers who participated in the eight-month campaign, more than 7,600 died.</p>\n\n<p>“We still remember the close ties forged in war, and celebrate the special bond between our two countries, as we continue to promote our common goals of peace, freedom, and security. Each year, this friendship blooms anew in the colourful tulips of Ottawa, donated by the Dutch Royal family after the war as a gesture of eternal gratitude.</p>\n\n<p>“While this year’s commemorative ceremonies have moved online due to the global COVID-19 pandemic, I invite all Canadians to pay tribute to the courage and sacrifice of those who fought in the Netherlands during the Second World War. We remain forever in their debt.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}