{
  "path": "/en/news/news-releases/2017/11/14/prime-minister-concludes-his-participation-asean-summit-philippines",
  "pageTitle": "Prime Minister concludes his participation at the ASEAN Summit in the Philippines | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the 31st&nbsp;Association of Southeast Asian Nations (ASEAN) Summit in Manila, Philippines.</p><p>The Prime Minister took part in the Canada-ASEAN 40th Anniversary Commemorative Summit. This commemorative summit represents the first time a Canadian prime minister has met with all ASEAN leaders as a group.</p><p>Prime Minister Trudeau took this opportunity to promote human rights, diversity, inclusion, and the need for gender equality. He also emphasized the importance of forging progressive trade agreements that build a stronger middle class and create real benefits for everyone.</p><p>The Prime Minister expressed Canada’s desire to join the East Asia Summit and the ASEAN Defense Ministers Meeting Plus. Canada’s participation would grow our engagement with ASEAN and expand access to markets of member states.</p><p>In Manila, Prime Minister Trudeau promoted gender equality and the empowerment of women and girls. He participated in a panel discussion with partners from the&nbsp;Gender-Responsive Economic Actions for the Transformation of Women (GREAT Women, an initiative for women entrepreneurs), and visited a local women’s health clinic.&nbsp;</p><p>The Prime Minister announced that Canada will invest $17.8&nbsp;million over five years through the Sexual Health and Empowerment Project, which will be implemented by Oxfam. This funding will provide more than 85,000 women and girls in remote and disadvantaged regions of the Philippines greater access to sexual and reproductive health services.</p><h2>Quote</h2><blockquote><p>“It was an honour to take part in the Canada-ASEAN Commemorative Summit. As we move forward together, I will continue to advance Canadian values, including human rights, women’s empowerment and gender equality, and ensure a renewed economic partnership that benefits the middle class and helps more people get ahead.”<br><cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>The Association of Southeast Asian Nations (ASEAN) is a regional intergovernmental organization comprising 10 member states. It was established by Indonesia, Malaysia, the Philippines, Singapore and Thailand on August 8, 1967, and was later joined by Brunei (1984), Vietnam (1995), Myanmar (Burma), Laos (1997), and Cambodia (1999).</li><li>The ASEAN Summit and Related Summits bring together Asia-Pacific leaders to discuss political, security, economic, and social issues. The East Asia Summit includes ASEAN members, plus Australia, China, India, Japan, New Zealand, Russia, South Korea, and the United States.</li><li>ASEAN Dialogue Partners include East Asia Summit members, plus Canada and the European Union.</li><li>As a group, ASEAN is the seventh-largest economy in the world and Canada’s sixth-largest merchandise trading partner.</li><li>ASEAN represents more than 640 million people with a combined economy of $2.6 trillion.</li><li>In 2016, Canada-ASEAN merchandise trade reached $21.6 billion.</li></ul><h2>Associated link</h2><ul><li><a href=\"http://www.international.gc.ca/asean/index.aspx?lang=eng\">Mission of Canada to the Association of Southeast Asian Nations (ASEAN)</a></li></ul></div>\n      "
}