{
  "path": "/en/news/statements/2021/06/18/statement-prime-minister-reappointment-antonio-guterres-secretary",
  "pageTitle": "Statement by the Prime Minister on the reappointment of Antόnio Guterres as Secretary-General of the United Nations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the reappointment of Antόnio Guterres as Secretary-General of the United Nations:</p>\n\n<p>“On behalf of all Canadians, I congratulate Antόnio Guterres on his reappointment as Secretary-General of the United Nations (UN).</p>\n\n<p>“Over the past four and a half years, Secretary-General Guterres has advanced reforms to make the UN more effective and worked tirelessly to bring countries together to address the challenges affecting our global community – from climate change, to sustainable development, to peacebuilding.</p>\n\n<p>“As the ninth Secretary-General, his role in guiding the UN’s response to the global COVID-19 pandemic encouraged international collaboration and helped deliver comprehensive and coordinated solutions to the health, humanitarian, human rights, and socio-economic impacts of the crisis worldwide. This included the Financing for Development in the Era of COVID-19 and Beyond Initiative, which Canada co-led with the UN and Jamaica to identify concrete financing solutions to the pandemic. Through his leadership, Secretary-General Guterres helped pave the way for a strong, global economic recovery that benefits everyone.</p>\n\n<p>“Canada is a proud founding member of the UN, and will continue to partner with member states around the world to reduce poverty, advance gender equality, and promote diversity, inclusion, and respect for human rights. We will also continue to advance the 17 interconnected Sustainable Development Goals outlined in the UN’s <a href=\"https://www.un.org/sustainabledevelopment/development-agenda/\">2030 Agenda</a>, the blueprint for our collective future. As we recover from the pandemic, we remain as committed as ever to achieving this vision for a more just, peaceful, and secure world, and will seize every opportunity to build back better.</p>\n\n<p>“Canada and Canadians believe in the invaluable role a relevant and efficient United Nations can play in addressing the challenges of the 21st century, and we will continue to work with partners to make it a stronger and more effective institution. There is no better way to fight inequality, and leave a better, healthier planet for future generations.</p>\n\n<p>“I look forward to continuing to work closely with Secretary-General Guterres on these and other shared priorities, and to further strengthen the partnership between Canada and the UN in addressing global challenges.”</p></div>\n      "
}