{
  "path": "/en/news/news-releases/2021/11/26/prime-minister-and-premier-british-columbia-announce-new-committee",
  "pageTitle": "Prime Minister and Premier of British Columbia announce new committee to address extreme weather and climate resilience in the province | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Throughout British Columbia and in other parts of the country, floods, landslides, wildfires, and extreme weather conditions are affecting the lives and livelihoods of thousands of Canadians. Climate change is a real and serious threat to our communities and our country, and we must take strong action together to protect Canadians and build a better and cleaner future for everyone.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Premier of British Columbia, John Horgan, today announced a committee of federal and provincial ministers who will work together and with Indigenous leadership to guide immediate and ongoing support to British Columbia families, businesses, and communities affected by the extreme weather events.</p>\n\n<p>The new committee will ensure the people of British Columbia, including those in remote and Indigenous communities, have the immediate support and resources they need to deal with this challenging situation. It will also collaborate on recovery and rebuilding efforts, including by providing support to the sectors that have been most impacted by the crisis. The committee will work to build back from these extreme weather events in a way that better protects British Columbians from future climate events, creates cleaner and healthier communities, and supports Canada’s efforts in reaching our climate goals and net-zero emissions targets.</p>\n\n<p>The Prime Minister and the Premier also announced that the governments of Canada and British Columbia will match every dollar donated to the Canadian Red Cross’ <em>British Columbia Floods &amp; Extreme Weather Appeal</em>, which means that every $1 donated will become $3 to support those affected by the floods. Both governments will match individual and corporate donations for a period of 30 days starting today, November 26, 2021, and retroactively for donations received since November 17, 2021, when the campaign began.</p>\n\n<p>Donated funds will support the range of emergency services the Canadian Red Cross is delivering to those in need, which could include providing cots, blankets, and clean-up kits to communities, upon request by the local authorities or government. In addition, donated funds will allow the Canadian Red Cross to continue to support evacuees, as they begin to recover in the days, weeks, and months ahead.</p>\n\n<p>The Government of Canada and the Province of British Columbia, along with Indigenous partners, will continue to work together to support British Columbians through this crisis and as they rebuild. Only by taking strong and bold climate action can we better mitigate the impacts of extreme weather conditions, protect the health and safety of Canadians, and build a healthier and cleaner future for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All Canadians stand with the people of British Columbia as they continue to deal with the impacts of the recent floods, landslides, and extreme weather conditions. Together with the Province of British Columbia, we will continue to take immediate action to help all those who need it, and we will support communities and families as they rebuild from the destruction. Climate action can’t wait, and the federal government is committed to being bolder and moving faster in the fight against climate change.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The people of British Columbia are grateful for the support we have received from across the country, including the federal government. As more extreme weather comes our way, we will continue to stand together and support all those in need. By matching donations to the Canadian Red Cross, every dollar given will be tripled. We will be working closely with the federal government and the Canadian Red Cross so your donations help those who need it the most.”</p>\n\n<footer class=\"default\">The Hon. John Horgan, Premier of British Columbia</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The new committee will build on the joint Federal / Provincial Supply Chain Recovery Working Group, which was announced on November 20, 2021.</li>\n\t<li>The co-chairs of the new committee are:\n\t<ul>\n\t\t<li>The Hon. Bill Blair, President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness</li>\n\t\t<li>The Hon. Mike Farnworth, Deputy Premier and Minister of Public Safety and Solicitor General of British Columbia</li>\n\t</ul>\n\t</li>\n\t<li>The remaining members of the new committee will be confirmed in the near future.</li>\n\t<li>The Canadian Red Cross is part of the largest humanitarian network in the world and stands ready to help people and communities before, during, and after a disaster. The Canadian Red Cross contributes to relief and recovery efforts in response to emergency events in Canada, including the 2021 wildfires in British Columbia and the COVID-19 pandemic.</li>\n\t<li>Canadians wishing to make a financial donation to the Canadian Red Cross to help those impacted by the floods in British Columbia can do so online at <a href=\"https://donate.redcross.ca/page/94172/donate/1?locale=en-CA\">redcross.ca</a>, by calling 1-800-418-1111, or by texting BCFLOODS to 30333.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/11/governments-of-canada-and-british-columbia-announce-joint-supply-chain-recovery-working-group.html\">Governments of Canada and British Columbia announce joint supply chain recovery working group</a></li>\n</ul></div>\n      "
}