{
  "path": "/en/news/statements/2022/02/06/statement-prime-minister-mark-platinum-jubilee-her-majesty-queen",
  "pageTitle": "Statement by the Prime Minister to mark the Platinum Jubilee of Her Majesty Queen Elizabeth II | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the Platinum Jubilee of Her Majesty Queen Elizabeth II:</p>\n\n<p>“Seventy years ago today, Her Majesty Queen Elizabeth II acceded to the Throne and became Queen of Canada. On this anniversary, I join millions of people in Canada and across the Commonwealth in congratulating Her Majesty on her Platinum Jubilee.</p>\n\n<p>“This is the first time since Confederation that Canadians can celebrate the Platinum Jubilee of their Sovereign. This historic milestone invites us to pay tribute to Her Majesty’s lifetime of committed service to Canada, the Commonwealth, and its citizens.</p>\n\n<p>“Over the course of her reign, Her Majesty has been a constant presence in the life of Canadians, offering steadfast leadership in times of change, hardship, or uncertainty. She has shared in some of the proudest and most memorable moments in our recent history – from the celebration of the 100th anniversary of Confederation in 1967, to the Montréal Olympics of 1976, to the proclamation of the <em>Constitution Act</em> in 1982. Her Majesty is the patron of more than 600 charities and organizations, including 36 in Canada. To this day, she continues to show our country her devotion and generosity, and to champion our most cherished values of unity, peace, and freedom.</p>\n\n<p>“To mark this very special occasion and celebrate Canadian achievements over the last 70 years, the Government of Canada will host a range of activities throughout the year and support community projects and initiatives across the country. I invite all Canadians to take part in these celebrations – while continuing to follow public health guidelines – and to reflect on our unique bond with the monarchy and the many special moments we have shared with Her Majesty.</p>\n\n<p>“On behalf of all Canadians, Sophie and I offer our warmest wishes to Her Majesty on the occasion of her 70 years of reign and we thank her for her tireless service and dedication as Sovereign.”</p></div>\n      "
}