{
  "path": "/en/news/statements/2020/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Peacekeepers’ Day:</p>\n\n<p>“On <a href=\"https://www.veterans.gc.ca/eng/remembrance/history/canadian-armed-forces/peacekeeping\">National Peacekeepers’ Day</a>, we honour all Canadians, past and present, who have served as peacekeepers around the world. We thank them for their service and the sacrifices they have made to help millions of people be more safe and secure.</p>\n\n<p>“Canada has a long and proud history of peacekeeping. For decades, Canadians have put their lives on the line to advance and support global peace and security. As members of the military or police, and as civilians, they have helped prevent wars, and laid the groundwork for long-term and sustainable peace. They have also worked to advance human rights and democracy, and to help people and communities rebuild after war.</p>\n\n<p>“While former Prime Minister Lester B. Pearson played a key role in developing the concept of peacekeeping during the 1956 Suez Crisis, Canada’s involvement in these operations dates back to 1949. That year, Canadian peacekeepers helped calm a dispute between India and Pakistan over the region of Kashmir. Five years later, Major‑General E. L. M. Burns became the first of many Canadians to command a UN peacekeeping mission in the Middle East.</p>\n\n<p>“Since then, Canadians have gone on to serve in international peace operations around the world, including in the Americas, Africa, Europe, and Asia. This includes missions to conflict zones in Rwanda, Haiti, Ethiopia and Eritrea, and the Balkans. In the last few years, Canadian forces have served in the Sinai, South Sudan, the Democratic Republic of Congo, and Mali, where we provided an aviation task force, as well as in Uganda from where we are providing tactical airlift support to UN operations.</p>\n\n<p>“As the nature of conflict evolves, Canada is preparing for the future of peacekeeping. We remain a significant funder of UN peacekeeping operations, and we continue to play a leading role in promoting sustainable world peace, including as the Chair of the UN Peacebuilding Commission. With international partners, we are developing new approaches to better protect children, increase the participation of women in peace operations, and help peacekeepers meet the challenges of modern conflicts.</p>\n\n<p>“That is why, in 2017, we launched the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">Vancouver Principles</a> to help end the recruitment of child soldiers and promote the reporting of abuses and grave violations against children. That same year, we launched the <a href=\"https://pm.gc.ca/en/news/backgrounders/2017/11/15/elsie-initiative-women-peace-operations\">Elsie Initiative for Women in Peace Operations</a> to help overcome barriers to the meaningful participation of women in UN peace operations. Since then, we have also provided high-value <a href=\"https://pm.gc.ca/en/news/news-releases/2017/11/15/canada-bolsters-peacekeeping-and-civilian-protection-measures\">military capabilities</a> to UN peacekeeping missions, and Canada will continue to work with the UN and our partners to reform and modernize international peace operations to respond to our changing global environment.</p>\n\n<p>“On behalf of the Government of Canada, I invite Canadians to join me to thank our country’s peacekeepers who sacrifice so much to help make the world a better place. Today, we recognize their tireless work in the service of peace.”</p></div>\n      "
}