{
  "path": "/en/news/statements/2020/08/15/statement-prime-minister-75th-anniversary-victory-over-japan-day-and-end",
  "pageTitle": "Statement by the Prime Minister on the 75th Anniversary of Victory over Japan Day and the end of the Second World War | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75th anniversary of Victory over Japan Day and the end of the Second World War:</p>\n\n<p>“Today, we pause to honour over one million Canadians and Newfoundlanders who served during the Second World War, including those who helped our Allies in the war in Asia and the Pacific.</p>\n\n<p>“More than 10,000 Canadian service members fought courageously in Asia, with tens of thousands more volunteering to join the Pacific forces as part of the final Allied push to victory. Those plans were never carried out. Instead, the world was shaken by the mass destruction caused by the atomic bombs dropped on Hiroshima and Nagasaki. Japan’s surrender on August 15, 1945 effectively ended the Second World War.</p>\n\n<p>“With the grim struggle in both Europe and Asia over, the world mourned the steep human cost of a war that had ravaged it for almost six years. In Canada alone, we grieved and honoured more than 45,000 who had lost their lives and 55,000 who were wounded.</p>\n\n<p>“At home, the Second World War also marked a shameful episode in our history – the internment of Japanese Canadians following the attack on Pearl Harbor in 1941. Over 20,000 Canadian citizens and residents were separated from their homes and their families, forced into internment camps. Today, we are reminded of the need to always fight against the spread of intolerance and racism, wherever and whenever it occurs.</p>\n\n<p>“As we reflect on this important day during this unprecedented time, I invite everyone to join the commemorative ceremony being livestreamed on <a href=\"https://www.facebook.com/CanadaRemembers\">Facebook</a> today at 10 a.m. EDT to remember those who served. We recognize the brave Canadians in uniform, past and present, for their profound sacrifice in defence of the freedoms we enjoy today, and thank them for answering the call to make our country, and the world, a better place.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}