{
  "path": "/en/news/statements/2021/07/26/uqausiusimajuq-kanataup-angajuqqaajjuanganut-tunngasuktittinirmut-kanaup",
  "pageTitle": "Uqausiusimajuq Kanataup Angajuqqaajjuanganut Tunngasuktittinirmut Kanaup 30-Gijanganik Kuin Kiggaqtuqtingata, Piujummarik Maligaliuqti Miaji Mai Saiman | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kanataup Angajuqqaarjuanga, Jastin Turuutu, ullumi saqqitittiqqauvuq ukuninga uqausiusimajunik tunngasuktittijumallutik Kanatamiut Nutaamik Kuin Kiggaqtuqtinga, taanna taliqpittianniittuq Miaji Mai Saiman:</p>\n\n<p>“Kiggaqtuqługit Kanataup Gavamakkungit, upigusukpunga tunngasuktiktijunnarama Kanatami 30-gijangani Kuin Kiggaqtuqtinganik, Pikkaulaangujuq Miaji Mai Saiman.</p>\n\n<p>“Inuuniku Nunavingmi, Kupak ukiuqtaqtungani, piujummariajuq inuusilimaaq iqqanaijaqattaqsimajuq kiggaqtuqługit taikkua qanigijaaniittut. Taqasuittuulluni kiggaqtuijiuvuq Inuit pijunnautingilnut iliqqusinginnullu, makkuktunut avatimullu, naisagaksaungittunik pititausimavuq sivulliqpaangullunilu tigumiaqtiulluni Kanatami kiggaqtuijiunirmut.</p>\n\n<p>“Iqqanaijaaqarnilimaangani, Piujummarialuk takuksautittivuq angiqsimattiarninganik kiggaqtuilluni inuuqatingiinik, kiinaujaliurasungnirmut amma Inuit pijunnautinginnut pijjunnautinginnut pijjutaujunit. Sivuliuqtiuqattaqsimavuq sanngiktigiaqtittilluni akturniujuni inunginnut ukiuqtaqtumiut, tamarmik Kanatalimaami nunarjualimaamilu. Kanatami Kuin Kiggaqtuqtinga kamajiullunilu kanatami Piqujarjuanginnik amma pilirivvinginnik, qaujimajunga ajjiunngittumik piliriqattaqsimanikuuninganik tautuqquuqtanganiglu Kiggaqtuiluni Kanatamiunik ajjigiinngiruluujaqtunik, tamakkiik uvani angirrami ammalu Kanataup silataaniittut, pittiarnikkut sulittiarnikkullu, ammalu tamakkiinni Kanatami uqausiit ilisarijausimajut. Uqarunnattiaqtunga, angajuqqaarijaullunga, piliriniaqpuq ikajuqsuiluni kappiasunngittunik ilagijaujunik Kanatami Unataqtuksakkunnut Aksuruutiqaqpaktunut attarnattumiitittittailinirmut amma attarnaqtumiitittutailinirmut nunattinni amma inuqutittinni.</p>\n\n<p>“Kajungiqsaqtauttiaqpunga taissumanituqaq atuqtauvalauqtumit, Kanatamiutauqativut suli taigusiqaqpallianginnaqtilluta pijariatujunik sulijunik katujjiqatigiinnirivalauqtatinnik. Qaujimaniaqpunga, Kanatami sivulliqpaulluni Nunaqaqqaaqsimajunut Kuin Kiggaqtuqtinganut, piujummarialuk uvattinnik ikajurniaqpuq uvattinnik saalagiqarasuaqtilluta tamakkuninga pijariatujunik sulijunik atauttikkut, pisugluni amiqqaaqatigiinginirmik aqqusinirijauvaktumik aaqigiarutiqarnirmut, ammalu ikaarviliurlutik taikkunanngat uqaalajunik nunattinni.</p>\n\n<p>“Tavvani ullurmi, qujagijumangmijavut Kuin Ilisapi Aippanga, Kuin Kanatami, arraagunut 69-nut pijittiraqtiuliqtuq Kuin Nunanginnut inunginniglu iluviqaqtunit, pittiarniq, silatunikkullu. Taanna 13-giliqtanga tikkuaqtauninga Kuin Kiggaqtuqtingata Kanatami taimannganit 1952-mi pigialauqsimavuq.</p>\n\n<p>“Taanna Taliqpittianniittuq Miaji Mai Saiman pijittirunnalaurmat uummatigalu pikkugijumallugu. Kanatamiulimaat qaiquvakka niriungniqaqullugit kajungiqsainirmiglu tamatumunga pimmariujumut sivummuakpalliunirmut Kanatamut, ammalu piqatigijumallugu, tautunnguaqtaminik saqqitittimmat ajjigiitittinirmut, ajjigiiktittiniqsaulutik ammalu pituqauniqpaamut titirarvingmut.”</p>\n\n<h2>Aktuaniliit Tusaqtaujuksait</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Kanataup Angajuqqaarjuanga Tusaqtittivuq Kuin Angiqsininganik Kanatami Kingullirmi Kuin Kiggaqtuqtinganut</a></li>\n</ul></div>\n      "
}