{
  "path": "/en/news/statements/2022/04/06/statement-prime-minister-fourth-anniversary-tragic-bus-crash-involving",
  "pageTitle": "Statement by the Prime Minister on the fourth anniversary of the tragic bus crash involving the Humboldt Broncos | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fourth anniversary of the tragic bus crash involving the Humboldt Broncos:</p>\n\n<p>“Four years ago today, a tragic highway crash involving the Humboldt Broncos hockey team in Saskatchewan ended the lives of 16 team members and staff and injured 13 more.</p>\n\n<p>“As we always do in the face of tragedy, Canadians came together in solidarity in the days and weeks that followed. Across the country, we leaned hockey sticks against our front doors, wore the iconic white, yellow, and green Bronco jerseys in memory of the lives lost and in honour of the survivors, and we rallied around their families by contributing to one of the most successful online fundraising campaigns in history.</p>\n\n<p>“In the years since the crash and in the face of the immense grief and tragedy that followed, the Humboldt community has shown the world what it truly means to be Canadian. Their perseverance to not only remember the lives lost, but also to make the world of sport a better place for future generations, is inspiring.</p>\n\n<p>“We cannot go back in time and change what happened that day, but we owe it to the victims, the survivors, and their families to try to prevent tragedy from striking again. Since the crash occurred, seat belts are now required on all new motor coaches in Canada. A national standard for entry-level training for truck drivers has been established, so that they have the skills they need to operate safely on our roads. We have also mandated electronic logging devices to help better track drivers’ hours on the road in an effort to help reduce the risk of fatigue-related incidents.</p>\n\n<p>“Today, as we remember the lives lost, we are left with pain, sadness, and grief. But there is also hope for the survivors, some of whom have now graduated from high school, are in university, coaching hockey, or training for a chance to compete at higher levels, including the 2026 Winter Paralympics.</p>\n\n<p>“To the Humboldt community: we will always be here for you. We will not forget your loved ones, or the strength, resilience, and compassion you have shown as a community. You are forever Humboldt strong.”</p></div>\n      "
}