{
  "path": "/en/news/readouts/2022/09/28/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Ukraine, Volodymyr Zelenskyy.</p>\n\n<p>The Prime Minister and the President denounced Russia's illegitimate 'referendums' in occupied regions of Ukraine, which are a blatant violation of international law and a further escalation of Russia’s invasion. The Prime Minister reaffirmed that Canada does not and will not ever recognize the results of these sham referendums or Russia’s attempted illegal annexation of Ukrainian territories. The leaders also discussed the importance of maintaining strong unity amongst allies in continuing to support Ukraine and impose severe costs on Russia.</p>\n\n<p>The Prime Minister commended the President’s leadership in defence of Ukraine and our shared democratic values. The Prime Minister also reiterated Canada’s strong ongoing support for Ukraine, including the continued provision of military assistance. President Zelenskyy thanked Prime Minister Trudeau for Canada’s military, macroeconomic, and humanitarian support to Ukraine.</p>\n\n<p>The leaders agreed to continue engaging and mobilizing global leaders in support of Ukraine, and against Russia’s ongoing brutal actions.&nbsp;</p>\n\n<p>Prime Minister Trudeau and President Zelenskyy agreed to keep in close and regular contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/27/statement-prime-minister-results-russias-sham-referendums-occupied\">Statement by the Prime Minister on the results of Russia’s sham referendums in occupied regions of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/18/prime-minister-justin-trudeau-meets-prime-minister-ukraine-denys-shmyhal\">Prime Minister Justin Trudeau meets with Prime Minister of Ukraine Denys Shmyhal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/09/23/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n</ul></div>\n      "
}