{
  "path": "/en/news/statements/2018/08/19/statement-prime-minister-world-humanitarian-day",
  "pageTitle": "Statement by the Prime Minister on World Humanitarian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Humanitarian Day:</p><p>“<a href=\"http://www.un.org/en/events/humanitarianday/\">World Humanitarian Day</a> reminds us of a sombre reality: the world faces pressing, and increasingly complex, humanitarian crises.</p><p>“The need for humanitarian workers is unprecedented, and their work has never been more difficult or dangerous. Where people flee, humanitarian workers go. While headlines fade, humanitarian workers persist. In grave conditions, humanitarian workers provide a lifeline.</p><p>“Yet humanitarian workers have increasingly become targets of violence, abuse, and kidnapping, and shut out from where they are needed most. As an international community, we have a responsibility to uphold and promote international humanitarian law so humanitarian workers can safely reach the most vulnerable and deliver vital assistance. Humanitarian workers themselves have an obligation to reflect the highest ethical standards in this critically important work.</p><p>“Conflict and violence, natural disaster, epidemic, famine – almost every crisis disproportionally affects women and children. That is why, last year, we launched the <a href=\"https://www.canada.ca/en/global-affairs/news/2017/06/canada_launches_newfeministinternationalassistancepolicy.html\">Feminist International Assistance Policy</a>, which puts the empowerment of women and girls at the centre of our international assistance efforts. Canada will continue to work closely with the international community and the United Nations to carry out critical humanitarian work around the world.</p><p>“On behalf of the Government of Canada, I thank all humanitarian workers for their courage and selflessness. In some of the most difficult environments imaginable, you provide relief and hope for millions of people.”</p></div>\n      "
}