{
  "path": "/en/news/statements/2022/06/03/statement-prime-minister-third-anniversary-final-report-national-inquiry",
  "pageTitle": "Statement by the Prime Minister on the third anniversary of the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the third anniversary of the final report from the National Inquiry into Missing and Murdered Indigenous Women and Girls:</p>\n\n<p>“Today, we honour Indigenous women, girls, and 2SLGBTQQIA+ people who have gone missing, had their lives taken too soon, or continue to experience violence. We also honour the families and Survivors who have had the courage to share their painful experiences so we can take meaningful action to address this heartbreaking and ongoing tragedy and begin the journey of healing. Your pain is immeasurable, and I thank you for your strength and resiliency in sharing your stories.</p>\n\n<p>“Our justice system has failed Indigenous Peoples. Violence against Indigenous women, girls, and 2SLGBTQQIA+ people in Canada, is a heartbreaking national tragedy. Three years ago today, the National Inquiry into Missing and Murdered Indigenous Women and Girls presented its final report, which confirmed what Indigenous Peoples have long known – that for generations Canada has failed them. The report found the tragedy of missing and murdered Indigenous women, girls and 2SLGBTQQIA+ people is rooted in systemic violations and abuses of human rights, including inherent, treaty, and constitutional rights.</p>\n\n<p>“We need to acknowledge and confront these truths in order to respond to the Inquiry’s Calls for Justice and move forward together to empower Indigenous women, girls, and 2SLGBTQQIA+ people and address violence committed against them. The Government of Canada is committed to making the transformative change necessary to end this tragedy and is working closely with Indigenous Peoples, families, Survivors, communities, and provinces and territories as equal partners.&nbsp;</p>\n\n<p>“Last year, the <a href=\"https://mmiwg2splus-nationalactionplan.ca/\">National Action Plan</a> was launched in partnership with Indigenous families, Survivors, leaders, and partners as well as with provinces and territories, to put an end to this crisis. Truly achieving that goal takes a whole of government approach, which is why the Government of Canada is working with partners to implement the <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1617731561423/1617731691291\">Federal Pathway</a>, which outlines our commitments and contributions to the National Action Plan. The Federal Pathway focuses on making the investments necessary in four theme areas: culture, heath and wellness, human safety and security, and justice, toward ending the systemic causes of violence against Indigenous women, girls, and 2SLGBTQQIA+ people.</p>\n\n<p>“On this important anniversary, I reaffirm the Government of Canada’s commitment to continue working with Survivors, families, communities, and provinces and territories to end the tragedy of the missing and murdered. We will not forget those who never came home and we will honour their memories by working tirelessly to build a better future, where everyone is safe from violence. To Indigenous women, girls, and 2SLGBTQQIA+ people, today, and every day, we are supporting you in reclaiming your power and your place.”</p>\n\n<p><em>If you or someone you know is impacted by the tragedy of the missing and murdered, and needs immediate emotional assistance, </em><em>please call </em><em>1-844-413-6649. You can also access mental&nbsp;</em><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1548700698392/1548701361628\"><em>health support services</em></a><em>&nbsp;such as mental health counselling, community-based emotional support and cultural services and assistance with travel costs to see Elders and traditional healers away from home</em>.</p></div>\n      "
}