{
  "path": "/en/news/readouts/2022/06/30/prime-minister-justin-trudeau-meets-president-south-korea-yoon-suk-yeol",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of South Korea Yoon Suk-yeol | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of South Korea, Yoon Suk-yeol, on the margins of the NATO Summit.</p>\n\n<p>The Prime Minister and the President discussed Russia’s illegal and unjustifiable invasion of Ukraine. They agreed on the need for strong international action to counter Russian aggression and provide humanitarian and economic assistance to the people of Ukraine. Prime Minister Trudeau welcomed President Yoon’s participation in the NATO Summit as the leader of one of the Alliance’s four Asia-Pacific partner nations.</p>\n\n<p>President Yoon Suk-yeol recalled the contribution of Canadians to defend the Republic of Korea and expressed gratitude for their sacrifices. The two leaders reaffirmed their commitment to strengthen the strategic partnership between Canada and South Korea, noting opportunities to work together to promote security, democracy, and the rule of law in the Indo-Pacific region. They also pledged to deepen the already strong trade and economic ties between our two countries, which are underpinned by the Canada-Korea Free Trade Agreement. The leaders discussed emerging technology and how to strengthen digital collaboration, including through artificial intelligence.</p>\n\n<p>The two leaders expressed their concerns about North Korea’s recent ballistic missile launches, which violate successive United Nations Security Council resolutions and pose a serious threat to international peace and security. Prime Minister Trudeau reaffirmed Canada’s steadfast commitment to supporting international efforts to promote security and stability, including through Operation NEON.</p>\n\n<p>The Prime Minister and President discussed climate action and the need for protection of biodiversity. They agreed to enhance cooperation on clean technologies, sustainable growth, and critical minerals.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/country-pays/republic_korea-republique_coree/relations.aspx?lang=eng\">Canada-the Republic of Korea relations</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/korea-coree/index.aspx?lang=eng\">Canada-Korea Free Trade Agreement</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.canada.ca/en/global-affairs/news/2022/05/g7-foreign-ministers-statement-on-the-launch-of-an-intercontinental-ballistic-missile-by-north-korea.html\">G7 Foreign Ministers’ Statement on the launch of an Intercontinental Ballistic Missile by North Korea</a></li>\n</ul></div>\n      "
}