{
  "path": "/en/news/statements/2017/09/13/statement-prime-minister-canada-death-former-parliamentarian-allan-j",
  "pageTitle": "Statement by the Prime Minister of Canada on the death of former parliamentarian Allan J. MacEachen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of former Member of Parliament, Senator and Cabinet Minister Allan J. MacEachen:</p><p>“It was with sadness that I learned last night of the death of one of Canada’s most respected leaders, former Member of Parliament, Senator and Cabinet Minister the Honourable Allan J. MacEachen.</p><p>“Allan J. MacEachen – known affectionately as Allan J. – distinguished himself as a senior minister and public servant during one of the longest political careers in Canadian history. He was a true friend of my father, a great son of Cape Breton, and a peerless servant of Canada.</p><p>“Allan represented his constituents while serving in various roles in the House of Commons, including as a cabinet minister, government leader, and the first deputy prime minister. In every role, Allan endeavoured to better the lives of those he served. He succeeded. He played a pivotal role to advance many landmark social issues, including old age pensions, the labour code, and minimum wage.</p><p>“Of his many contributions, Allan will be most remembered as a champion of nationwide medicare. Through years of contentious deliberations, he never lost sight of an equitable health care system for Canadians. In 1966, as Minister of National Health and Welfare, he oversaw the passage of the Medical Care Act, and helped lay the foundation for a program that continues to define Canada today.</p><p>“In 1984, Allan joined the Senate of Canada, serving as government and then opposition leader until he retired in 1996. In recognition of his work, he was named an Officer of the Order of Canada, and awarded the Golden and Diamond Jubilee Medal. He was also honoured with the opening of the MacEachen Institute for Public Policy and Governance at Dalhousie University – a fitting tribute for a respected parliamentarian who started his career in academics.</p><p>“On behalf of all Canadians, Sophie and I offer our sincere condolences to his family, friends, and the people of Cape Breton. Canada is a stronger and more compassionate country because of Allan’s dedicated public service and unwavering commitment to Canadians.”</p></div>\n      "
}