{
  "path": "/en/news/news-releases/2021/11/12/prime-minister-announces-reappointments-government-representative",
  "pageTitle": "The Prime Minister announces reappointments to the Government Representative Office in the Senate | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that Senators Marc Gold, Raymonde Gagné, and Patti LaBoucane-Benson will be reappointed to the Government Representative Office in the Senate. They will continue serving as Government Representative in the Senate, Legislative Deputy to the Government Representative in the Senate, and Government Liaison in the Senate, respectively, during the 44th Canadian Parliament. They were first appointed to these roles in January 2020.</p>\n\n<p>Senator Gold is an accomplished lawyer and former law professor who has published extensively and lectured across Canada and around the world. He previously trained federally appointed judges on constitutional law and the&nbsp;<em>Canadian Charter of Rights and Freedoms</em>. Prior to his appointment to the Senate in 2016, he held various leadership roles in community organizations at the local, national, and international levels, including as Chair of ENSEMBLE for the respect of diversity.</p>\n\n<p>Senator Gagné worked in the field of education for over 35 years, including as a high school teacher and principal, prior to her appointment to the Senate in 2016. A former President of the University of Saint-Boniface and Chair of the Council of Presidents of Universities of Manitoba, she has contributed to numerous organizations and boards within Manitoba and across the country. She is a member of the Order of Canada and the Order of Manitoba, and a recipient of the prix Riel.</p>\n\n<p>Senator LaBoucane-Benson is a proud Métis who has dedicated her life to serving her community and helping Indigenous families in Alberta, across Canada, and around the world. She spent the majority of her career with the Native Counselling Services of Alberta. Prior to her appointment to the Senate in 2018, she sat on the Ministerial Panel on Child Intervention of Alberta, where she worked toward reducing the overrepresentation of Indigenous children in care in the province.</p>\n\n<p>As members of the Government Representative Office in the Senate, Senators Gold, Gagné, and LaBoucane-Benson will continue to guide government legislation through the Upper House, ensuring that it is thoroughly and efficiently reviewed, and to advocate for a more independent, accountable, responsible, and transparent Senate.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I welcome the reappointment of these three experienced and dedicated Senators to the Government Representative Office in the Senate. As we finish the fight against COVID-19 and build a strong economic recovery, I am confident that Senators Gold, Gagné, and LaBoucane-Benson will continue to review and advise us on legislation in a thorough and non-partisan manner, while championing a Senate that works for all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Senate is the Upper House in Canada’s parliamentary democracy. It unites a diverse group of accomplished Canadians in service of their country. Created to counterbalance representation by population in the House of Commons, the Senate has evolved from defending regional interests to creating space for the voices of historically underrepresented groups like Indigenous peoples, racialized communities, and women.</li>\n\t<li>The Government Representative in the Senate, the Legislative Deputy to the Government Representative in the Senate, and the Government Liaison in the Senate make up the Government Representative Office.</li>\n\t<li>The Government Representative in the Senate is the first point of contact between the government and the Senate, working to move government bills through the Upper House and champion renewal of the institution. They are an ex&nbsp;officio member of all Senate committees, except for the Standing Committee on Ethics and Conflict of Interest for Senators, the Standing Committee on Audit and Oversight, and the joint committees.</li>\n\t<li>The Legislative Deputy to the Government Representative in the Senate works with other Senate leaders to structure debate in the Upper House on a daily basis, which includes managing and moving government procedural motions.</li>\n\t<li>The Government Liaison in the Senate is responsible for outreach on government business in the Senate, and ensures that Senators have the information they need in anticipation of votes. They also hold certain procedural powers in relation to the timing of votes.</li>\n</ul></div>\n      "
}