{
  "path": "/en/news/statements/2023/03/13/statement-prime-minister-commonwealth-day",
  "pageTitle": "Statement by the Prime Minister on Commonwealth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Commonwealth Day:</p>\n\n<p>“Today, we join 55 other countries across the world to celebrate <a href=\"https://thecommonwealth.org/commonwealth-day\">Commonwealth Day</a>, under the theme ‘Forging a sustainable and peaceful common future’.</p>\n\n<p>“In the Commonwealth, Canada works with international partners to advance our shared values of peace, prosperity, and democracy. Together, we work to make life better for the 2.5&nbsp;billion people united by this organization.</p>\n\n<p>“Today marks the first Commonwealth Day since the passing of Her Late Majesty Queen Elizabeth&nbsp;II and represents an opportunity to remember and honour her enduring legacy.</p>\n\n<p>“Now headed by His Majesty King Charles&nbsp;III, countries in the Commonwealth build consensus through deliberation on matters of importance to its members, and advocate for the inclusion of small and vulnerable states on the world stage. Based on friendship and goodwill, we have made significant headway together on priorities such as democracy and peace, environmental issues, education, and sustainable development.</p>\n\n<p>“Canada’s enduring legacy to the Commonwealth is the Commonwealth of Learning. Based in British Columbia, the Commonwealth of Learning helps developing nations improve access to quality education and training.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to reflect on everything we have achieved as a long-standing member of this historic organization and recommit to building a better future for people together with our Commonwealth partners.”</p></div>\n      "
}