{
  "path": "/en/news/news-releases/2018/01/30/prime-minister-announces-government-canada-will-officially-recognize",
  "pageTitle": "Prime Minister announces that the Government of Canada will officially recognize the International Decade for People of African Descent | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to build a better, more inclusive country that recognizes the contributions of all, and creates better opportunities for more Canadians.</p><p>The Prime Minister, Justin Trudeau, today announced the Government of Canada will officially recognize the International Decade for People of African Descent. This Decade, which spans from 2015 to 2024, is an opportunity to highlight and celebrate the important contributions people of African descent have made to Canadian society. It also provides a framework for recognition, justice, and development to fight racism, discrimination, and the ongoing inequalities that Canadians of African descent face.</p><p>The Government of Canada has heard from concerned citizens and organizations from across Canada, including the Federation of Black Canadians, that we need to do more to work with and support Canadians of African descent.</p><p>In recognizing the International Decade, the Government of Canada commits to a better future for Black Canadians. This means learning more about the issues that affect Black Canadians, including improving research and data collection, so we can better understand the particular challenges they face. Mental health challenges and overrepresentation in the corrections system have been raised in particular by community leaders as barriers to Black Canadians experiencing full and equal participation across society.</p><p>Over the past two years, the Government of Canada has taken concrete measures to fight inequality and improve the lives of all Canadians, including those of African descent. We have helped parents with the high cost of raising kids through the Canada Child Benefit, and expanded the Canada Pension Plan so more people can retire with security and dignity. We have also made significant investments in student grant programs, mental health initiatives, and affordable child care, and introduced a National Housing Strategy that will solve housing security for many vulnerable Canadians.</p><p>The Government of Canada will continue to build on these efforts, and create a country where more Canadians have a real and fair chance at success.</p><h2>Quote</h2><blockquote><p>“Today is an important day for Canada. Our commitment to the International Decade will help us better address the very real and unique challenges that Black Canadians face, and bring us closer to a more just and inclusive country.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>The International Decade for People of African Descent, proclaimed by the UN General Assembly resolution 68/237, began in 2015 and will be observed until 2024.</li><li>The theme for the International Decade is “People of African descent: recognition, justice and development.”</li><li>The objectives of the International Decade include promoting respect, protection of the human rights and fundamental freedoms of people of African descent, as well as encouraging a greater knowledge of and respect for the diverse heritage, culture, and contributions of these communities to society around the world.</li><li>The Government of Canada also honours Canadians of African descent and their role in Canadian history and society through its annual <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a> campaign.</li></ul><h2>Associated link</h2><ul><li><a href=\"http://www.un.org/en/events/africandescentdecade/\">International Decade for People of African Descent</a></li></ul></div>\n      "
}