{
  "path": "/en/news/statements/2018/02/04/statement-prime-minister-international-development-week",
  "pageTitle": "Statement by the Prime Minister on International Development Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Development Week, which runs from February 4 to 10, 2018:</p><p>“Today marks the start of <a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/idw-sdi/index.aspx?lang=eng\">International Development Week</a>, a time to celebrate Canadian international development workers, volunteers, and partners who work hard every day to improve the lives of millions of people around the world. It is also a chance to engage Canadians, especially young Canadians, to learn more about – and be part of – these efforts.</p><p>“This year’s theme – <i>Partners for a Better World</i> – is a reminder that all of us have the power to help build a more just, equal, inclusive, and prosperous world.</p><p>“Canada has a long-standing commitment to help the poorest and most vulnerable people in the developing world, particularly women and girls. Around the globe and over generations, Canadian international development workers and volunteers have helped build hospitals, fight malnutrition, provide renewable energy, and advance human rights.</p><p>“Around the world, women and girls continue to bear the burden of hardships brought on by poverty and disease. Unequal access to education and healthcare, sexual violence, discrimination, and many other inequities hold them back. That is why, last year, we launched <a href=\"https://www.canada.ca/en/global-affairs/news/2017/06/canada_launches_newfeministinternationalassistancepolicy.html\">Canada’s new Feminist International Assistance Policy</a> – which makes the empowerment of women and girls a priority in all our international assistance. This new approach focuses on helping the poorest and most vulnerable people, and will move us closer to achieving the goals laid out in the United Nations’ 2030 Agenda for Sustainable Development.</p><p>“On behalf of the Government of Canada, I encourage all Canadians to celebrate the many people who work every day to create a more peaceful, just, and sustainable world.”</p></div>\n      "
}