{
  "path": "/en/news/news-releases/2020/01/31/prime-minister-announces-appointment-two-senators",
  "pageTitle": "The Prime Minister announces the appointment of two Senators | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General appointed Judith Keating and W. Brent Cotter as independent Senators to fill vacancies for New Brunswick and Saskatchewan.</p>\n\n<p>Ms. Keating is a legal and constitutional expert with over 30 years of senior public service experience in the Government of New Brunswick. Throughout her career, Ms. Keating has worked to advance language equality and promote reconciliation with Indigenous peoples, most notably by leading the drafting of the provincial <em>Official Languages Act</em> and serving as a provincial chair of the Working Group on Truth and Reconciliation. She is also an award-winning champion for women’s empowerment in the legal profession, and an active member of her local community.</p>\n\n<p>Mr. Cotter is one of Canada’s foremost legal ethicists. Over the course of his career, he has taught at universities across the country and chaired national associations dedicated to improving the legal system. Mr. Cotter has also served at senior levels of the Government of Saskatchewan, where he led the development and implementation of a nationally recognized program of services for First Nations and Métis peoples. He has received numerous awards for his contributions to his community and profession.</p>\n\n<p>Ms. Keating and Mr. Cotter were recommended by the Independent Advisory Board for Senate Appointments, and chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Judith Keating and W. Brent Cotter have led exceptional careers in service of their provinces. Their dedication to Canada’s regional, cultural, and linguistic diversity will make them important voices for their communities, and help the Senate better serve all Canadians. I look forward to working with them as we move forward with our plan to make life more affordable, protect and invest in our communities, fight climate change, and give every person in Canada a real and fair chance at success.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>There have been 52 independent appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li>\n\t<li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li>\n\t<li>In 2016, the selection process for Senators was opened to all Canadians. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides recommendations to the Prime Minister.</li>\n\t<li>The Board is guided by public, transparent, non-partisan, and merit-based criteria to identify highly qualified candidates.</li>\n\t<li>Once appointed by the Governor General, new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial, and minority interests – important functions in a modern democracy.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/01/31/judith-keating-qc\">Judith Keating</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2020/01/31/william-brent-cotter-qc\">W. Brent Cotter</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li>\n</ul></div>\n      "
}