{
  "path": "/en/news/statements/2019/06/20/statement-prime-minister-national-indigenous-peoples-day",
  "pageTitle": "Statement by the Prime Minister on National Indigenous Peoples Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Indigenous Peoples Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada-days/aboriginal-day.html\">National Indigenous Peoples Day</a>, we celebrate the unique heritage and cultures of First Nations, Inuit, and Métis peoples.</p>\n\n<p>“On this day, and throughout <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1466616436543/1534874922512\">National Indigenous History Month</a>, we also recognize the important contributions Indigenous peoples have made and continue to make to Canada. First Nations, Inuit, and Métis peoples have shaped our past and will continue to shape our future. Canada can only move forward if Indigenous peoples can succeed and prosper.</p>\n\n<p>“Indigenous communities and individuals continue to defend their cultures, honour their traditions, and share their stories so that they may be carried forward by generations to come. Today, Parliament will adopt legislation that will support work by Indigenous communities to protect, preserve, and revitalize their languages, which are fundamental to their cultures and heritage. It will also adopt legislation to reform child and family services, and affirm the right of Indigenous peoples to decide what is best for their children, their families, and their communities.</p>\n\n<p>“No relationship is more important to Canada than the relationship with Indigenous peoples – and we are committed to building a renewed relationship based on recognition of rights, respect, cooperation, and partnership. Advancing reconciliation means changing colonial laws, policies, and practices, and addressing their impacts on the lives of Indigenous peoples. We are facing the hardest of truths – including those outlined in the final report of the National Inquiry into Missing and Murdered Indigenous Women and Girls – so that we can move forward together.</p>\n\n<p>“We know that to rebuild trust, words must be paired with action. That is why we’ve made unprecedented investments to close gaps in housing, health, and education for Indigenous communities, and taken important steps forward on reconciliation and righting past wrongs.</p>\n\n<p>“On behalf of the Government of Canada, I encourage all Canadians to participate in <a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1100100013322/1535629803649\">events taking place across Canada</a> and celebrate the history, traditions, and cultures of Indigenous peoples.”</p></div>\n      "
}