{
  "path": "/en/news/statements/2021/04/28/statement-prime-minister-national-day-mourning",
  "pageTitle": "Statement by the Prime Minister on the National Day of Mourning | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Mourning:</p>\n\n<p>“Today marks the 30th anniversary of the National Day of Mourning. On this day, we remember and honour every worker in Canada who has died, been injured, or suffered illness because of workplace hazards, accidents, or harassment. It is also a day to renew our commitment to preventing future workplace tragedies, which requires ongoing, shared effort from workers, employers, and the organizations that support them.</p>\n\n<p>“More than a year into the pandemic, it is vital that we continue to acknowledge the great risks and challenges Canada’s front-line and essential workers are facing, and the sacrifices they have made, to keep us safe and healthy. Some have become ill, and some have died, making sure that others are cared for and protected.</p>\n\n<p>“One of the best ways we can thank and honour these everyday heroes is by continuing to take public health guidelines seriously. That means continuing to wear a mask, keeping two metres apart, downloading and using the COVID Alert app, working from home if you can, and getting the vaccine when it’s your turn.</p>\n\n<p>“The Government of Canada recognizes the toll this past year has taken on front-line and essential workers, and will continue to do everything we can to support them. That is why we have worked tirelessly to make sure they have access to the supplies they need to stay safe and healthy. That’s also why we created the Canada Recovery Sickness Benefit, to give income support to people who are unable to work because they are sick or need to self-isolate due to COVID-19. We collaborated with provinces and territories to boost wages for low-income essential workers, so they can receive the compensation they deserve. We will continue to do whatever it takes to protect their health, help them do their job, and make sure they know Canada has their backs as much as they have ours.&nbsp;</p>\n\n<p>“Today, I encourage all Canadians to pause and remember workers who have lost their lives, been injured, or become sick while on the job. We all have a role to play, especially in this challenging time, to build safer, healthier, and more dignified workplaces for everyone.”</p></div>\n      "
}