{
  "path": "/en/news/statements/2015/11/04/statement-prime-minister-canada-following-swearing-29th-ministry",
  "pageTitle": "Statement by the Prime Minister of Canada following the swearing-in of the 29th Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Right Honourable Justin Trudeau, Prime Minister of Canada, today issued the following statement after the swearing-in of the 29<sup>th</sup> Ministry:<br><br>“Canadians from all across this country sent a message that it is time for real change, and I am deeply honoured by the faith they have placed in my team and me. Canadians chose a positive and optimistic plan for the future, and we will immediately begin implementing our plan for a strong middle class.<br><br>“Today we have the pleasure of introducing the team of extraordinary Canadians who will serve in the new Ministry. This strong, diverse, and experienced team will serve all Canadians, and for the first time in our country’s history, there will be an equal number of women and men around the Cabinet table. <br><br>“Canadians expect to see their values and priorities reflected in their government, and we have listened closely to them. Canadians told us what kind of government they want, and we built the plan to make it happen. <br><br>“We are committed to investing in our economy, strengthening the middle class, and helping those working hard to join it. We will invest in job creation and broad-based prosperity to ensure every Canadian has a real and fair chance to succeed. <br><br>“We will shine more light on government to ensure it remains focused on the people it is meant to serve. Openness and transparency will be our constant companions, and we will work to restore Canadians’ trust in their government and in our democracy. We are committed to the highest ethical standards and applying the utmost care in the handling of public funds.<br><br>“We will demonstrate national leadership and work with the provinces and territories to take real action on climate change and create the clean jobs of tomorrow. <br><br>“We will further strengthen our great country with a renewed, nation-to-nation relationship with Indigenous Peoples, based on a recognition of rights, respect, co-operation, and partnership. We will fulfil our sacred obligation to Canadian veterans and their families, who have given so much in service to our country. We are committed to both the security and safety of Canadians and the protection of their rights and freedoms. We will also reinvest in our cultural and creative industries and create an immigration system grounded in both compassion and economic opportunity.<br><br>“Canada is strong not in spite of its diversity, but because of it, and we are committed to bringing new leadership and a new tone to Ottawa. We also made a commitment to pursue our goals with a renewed sense of collaboration. Most importantly, we will be a government that governs for all Canadians and brings Canadians together. <br><br>“We will work tirelessly to honour the trust Canadians have given us, and together build an even better future for our children and grandchildren.”</p><p>Additional information:<br><a href=\"/en/cabinet\" title=\"Biographies\">Biographies</a></p></div>\n      "
}