{
  "path": "/en/news/statements/2022/12/01/statement-prime-minister-world-aids-day",
  "pageTitle": "Statement by the Prime Minister on World AIDS Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World AIDS Day:</p>\n\n<p>“On World AIDS Day, we join people living with HIV and AIDS in Canada and around the world, to remember the lives lost to this epidemic and show our unwavering support to reaching our global goals of zero new HIV infections, zero AIDS-related deaths, and zero discrimination.</p>\n\n<p>“The first case of AIDS in Canada was reported in 1982, and 40 years later, there are nearly 63,000 people living with this disease in our country. In 2021, close to 40 million people globally were reported to be living with HIV, and in that same year, AIDS-related illnesses claimed the lives of an estimated 650,000 people.</p>\n\n<p>“Despite the progress Canada has made in recent years, there are many people in Canada who are not currently diagnosed or being treated. At AIDS 2022, the 24th International AIDS Conference that took place in Montréal this past summer, the Government of Canada committed a total of $17.9 million for the distribution of HIV self-testing kits and other methods of HIV testing across the country, including support for community-based organizations to make testing more accessible to the populations most affected by HIV.</p>\n\n<p>“This year’s theme for World AIDS Day, ‘<a href=\"https://www.unaids.org/en/2022-world-aids-day\">Equalize</a>’, recognizes the unequal impact this disease has across the globe. Together, the world is committed to ending AIDS as a public health threat by 2030, and we are working with partners, including the key populations most affected by HIV/AIDS, to help ensure HIV prevention, testing, and treatment are available to everyone. Earlier this fall, at the Global Fund’s Seventh Replenishment pledging conference, the Government of Canada announced a commitment of $1.21&nbsp;billion to the Global Fund to Fight AIDS, Tuberculosis, and Malaria. This commitment will help keep people around the world safe and healthy.</p>\n\n<p>“Today, on World AIDS Day, I encourage everyone to challenge the inequalities, misconceptions and stigma surrounding this global epidemic. Together, we can end AIDS and build a safer future for everyone.”</p></div>\n      "
}