{
  "path": "/en/news/statements/2021/01/08/statement-prime-minister-canada-mark-first-anniversary-downing-ukraine",
  "pageTitle": "Statement by the Prime Minister of Canada to mark the first anniversary of the downing of Ukraine International Airlines Flight 752 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the first anniversary of the downing of Ukraine International Airlines Flight 752:</p>\n\n<p>“One year ago today, a passenger jet carrying 55 Canadian citizens and 30 permanent residents, was shot down by an Iranian surface-to-air missile, in Tehran. Of the 176 innocent people who died on Ukraine International Flight 752, 138 had ties to Canada. Today, we honour those who were lost and stand shoulder to shoulder with the people they loved.</p>\n\n<p>“Over the past year, Canada has worked tirelessly to get the transparency, accountability, and justice that the victims and their families deserve. We have been unrelenting in pursuit of the truth, and Canada will not accept anything less than a comprehensive and honest explanation from the Iranian regime of what exactly happened that day. We continue to work closely with our international partners to ensure a thorough, transparent, and credible investigation into the cause of this tragedy, and to hold Iran accountable, including by ensuring that Iran makes full reparations for the victims of PS752 and their grieving families, and to ensure that those responsible are brought to justice.</p>\n\n<p>“We have also been unwavering in our commitment to support the families through this painful and tragic situation and keep Canadians safe from future disasters. Last month I welcomed a report by Special Advisor Ralph Goodale, which will help establish best practices to prevent and respond to any future air disasters if they occur, including by providing better support to the families of victims. We have also led the development of a global Safer Skies Initiative to better protect passengers from the risk of flying in or near conflict zones.</p>\n\n<p>“Going forward, the Government of Canada will continue to support the family members of the Canadians and permanent residents of Canada who were lost to the tragedies of Flight PS752 and Ethiopian Airlines Flight 302. This includes offering a pathway to permanent residence to some of the family members. Immigration, Refugees and Citizenship Canada will provide more details about who will be eligible and how to apply once the policies are implemented. In the meantime, family members who are in Canada on a temporary basis can apply to extend their stay if needed.</p>\n\n<p>“In honour of the victims of Flight 752 and other air tragedies, the Government of Canada has designated January 8 of every year as the National Day of Remembrance for Victims of Air Disasters. And, to pay tribute to the students, teachers, and all those who had ties to schools across the country, we are also establishing scholarships in memory of those on Flight 752. We will continue to consult with the families on commemoration initiatives, including a physical tribute in remembrance of those who lost their lives in air disasters.</p>\n\n<p>“Today, as a country, we remember those who were lost in this national tragedy, and we mourn with all who were left without a family member, loved one, or friend. Together, in this time of sadness and heartbreak, we will continue to honour the memory of the victims – and we will never forget them.&nbsp;</p></div>\n      "
}