{
  "path": "/en/news/readouts/2022/09/14/prime-minister-justin-trudeau-speaks-president-kenya-william-ruto",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Kenya William Ruto | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Kenya, William Ruto, to congratulate him on his election victory.</p>\n\n<p>Prime Minister Trudeau commended the peaceful nature of the elections and the strength of the Kenyan democratic institutions. The Prime Minister and the President emphasized their shared commitment to democratic values.</p>\n\n<p>The two leaders expressed their concern for the serious global impacts of Russia’s invasion of Ukraine, notably food and energy insecurity, and agreed to work together to find solutions to these complex challenges.</p>\n\n<p>The Prime Minister and the President discussed regional peace and security, including their concern with ongoing instability in the Democratic Republic of the Congo, Somalia, Ethiopia, and the Horn of Africa. Prime Minister Trudeau expressed appreciation for Kenya’s leadership role in promoting peace and security in the region. President Ruto thanked Canada for its support.</p>\n\n<p>The two leaders agreed to work together to further strengthen the partnership between Canada and Kenya. Prime Minister Trudeau looked forward to continued collaboration on such shared priorities as promoting peace and security, encouraging a sustainable ocean economy, increasing and diversifying trade, supporting the transition to clean technology, and advancing the empowerment of women and girls.</p>\n\n<p>Prime Minister Trudeau and President Ruto looked forward to meeting in person in the near future.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/kenya/relations.aspx?lang=eng\">Canada-Kenya relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">Prime Minister Trudeau announces Canadian support to address global food security crisis</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance/commitment/feminist-international-assistance-policy.html\">Canada’s Feminist International Assistance Policy</a></li>\n</ul></div>\n      "
}