{
  "path": "/en/news/statements/2022/05/09/statement-prime-minister-europe-day",
  "pageTitle": "Statement by the Prime Minister on Europe Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Europe Day:</p>\n\n<p>“Today, we join friends and allies around the world to mark Europe Day and celebrate the values of democracy, peace, and unity that have shaped modern-day Europe.</p>\n\n<p>“As Russia’s illegal and unjustifiable invasion of Ukraine continues, upholding these shared values has never been more important. Thousands of people have died, millions of others have been displaced, and the impacts of President Putin’s senseless war continue to be felt worldwide.</p>\n\n<p>“In the face of ongoing Russian aggression, people in Europe and around the world are standing up in support of Ukraine. Through continued engagement with the European Union (EU) and other international partners, Canada has worked to hold the Russian regime accountable for its illegal war and support the Ukrainian people. EU Member States have also taken decisive action to respond to the humanitarian crisis, welcoming millions of people fleeing the conflict into their homes and communities.</p>\n\n<p>“Last month, I co-convened the ‘Stand Up For Ukraine’ campaign pledging event with the President of the European Commission, Ursula von der Leyen, which helped raise over $12 billion for Ukrainian refugees and internally displaced people. Yesterday, I travelled to Ukraine to meet with President Zelenskyy and participate in the G7 Leaders’ meeting alongside him, reaffirming Canada’s unwavering support for the Ukrainian people. This ongoing close collaboration reflects our shared values of human rights, democracy, and the rule of law that lie at the heart of European and Canadian identities.</p>\n\n<p>“Canada and the EU enjoy a strong partnership based on long-standing friendship and cooperation. Our belief in multilateralism, pluralism, openness, and diversity will continue to guide our work in defence of these values that bind us together. We will also continue to collaborate to enhance energy security and accelerate the transition toward clean energy, creating opportunities for people on both sides of the Atlantic – including through the Canada-European Union Comprehensive Economic and Trade Agreement (CETA).</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians today to celebrate the strong ties that unite our country and the EU. Together, we will continue to stand up for the ideals of democracy, international security, and prosperity as we work to build a better and fairer future for everyone.”</p></div>\n      "
}