{
  "path": "/en/news/statements/2016/06/23/statement-prime-minister-canada-mark-national-day-remembrance-victims",
  "pageTitle": "Statement by the Prime Minister of Canada to mark the National Day of Remembrance for Victims of Terrorism | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the National Day of Remembrance for Victims of Terrorism:</p>\n<p>“31 years ago, our country suffered the worst mass murder in its history when 329 innocent people on board Air India Flight 182 were killed by a terrorist bomb. Canadians were directly impacted by this senseless and brutal act of violence that left them grieving parents, children, relatives, friends, and colleagues.</p>\n<p>“On this solemn day, Canadians across the country stand in solidarity with all those who have experienced first-hand the incredible pain of losing a loved one to terrorism.</p>\n<p>“The recent cold-blooded murders of fourteen Canadian Embassy security guards in Kabul, the two Canadian hostages in the Philippines, as well as the terrorist attacks which resulted in six Canadian deaths in Burkina Faso and another in Indonesia, are a stark reminder that we are not immune to the threat of terrorism – which can strike anywhere, anytime.</p>\n<p>“Terrorism is used to instill fear and designed to make us question not only our own safety, but also the democratic institutions that keep us safe.&nbsp;</p>\n<p>“This is exactly why Canada will continue to work closely with our allies – and the international community – to help fight extremism and terrorism, both at home and abroad. We remain committed and vigilant in the Global Coalition’s fight against the Islamic State of Iraq and the Levant (ISIL). We thank the brave women and men of our military, intelligence agencies, and local law enforcement that keep Canadians safe every day.</p>\n<p>“We will continue to promote and defend human rights, justice and equality – values that are vital tools in the fight against intolerance, hatred, and fear. No act of harm or destruction will ever be greater than our perseverance and resolve.&nbsp;</p>\n<p>“On behalf of the Government of Canada, Sophie and I extend our deepest condolences to those who have lost loved ones to terrorism. We mourn with you and vow to never forget those who have been lost.”</p></div>\n      "
}