{
  "path": "/en/news/readouts/2022/03/24/prime-minister-justin-trudeau-meets-prime-minister-japan-kishida-fumio",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Japan Kishida Fumio | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Japan, Kishida Fumio, on the margins of the G7 meeting in Brussels.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Kishida strongly condemned Russia’s ongoing aggression against the territorial integrity, sovereignty, and independence of Ukraine, and praised the courage and resilience of the Ukrainian people. The two leaders discussed helping each other in the Pacific and the Atlantic regions to ensure that global support for Ukraine remains strong.</p>\n\n<p>The prime ministers also discussed further collaboration to address global challenges related to rising energy costs and food security. They agreed to continue coordinating closely to bring an end to Russian President Vladimir Putin’s war, and restore peace and freedom to Ukraine.</p>\n\n<p>The leaders reaffirmed the strategic partnership between Canada and Japan, and reiterated their commitment to pursuing a shared vision for a free and open Indo-Pacific. They agreed to continue working closely together as Canada takes steps to deepen its engagement in the region through the development of its comprehensive Indo‑Pacific strategy.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/japan-japon/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Japan relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/24/prime-minister-concludes-successful-visit-belgium-and-announces\">Prime Minister concludes successful visit to Belgium and announces additional support for Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/03/24/g7-leaders-statement\">G7 Leaders’ Statement</a></li>\n</ul></div>\n      "
}