{
  "path": "/en/news/readouts/2020/05/21/prime-minister-justin-trudeau-speaks-president-mozambique-filipe-nyusi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Mozambique Filipe Nyusi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Mozambique, Filipe Nyusi, to discuss the latest developments in the COVID-19 pandemic.</p>\n\n<p>The two leaders exchanged information on the efforts within Canada and Mozambique to fight the pandemic and protect the health, safety, and economic well-being of all citizens, especially the most vulnerable. They spoke about the importance of global leadership toward a fairer and more inclusive world for all, and the need to support African countries as they fight the pandemic and reinforce their health, financial, and economic systems.</p>\n\n<p>Prime Minister Trudeau thanked President Nyusi for Mozambique’s ongoing help to repatriate Canadians seeking to return home during this crisis.</p>\n\n<p>Prime Minister Trudeau and President Nyusi also discussed ways to maintain the deep friendship between Canada and Mozambique, founded on close people-to-people ties, strong commercial relations, and extensive bilateral cooperation. They spoke about Canada’s longstanding support for development and humanitarian assistance in Mozambique, and affirmed their mutual interest in strengthening trade and investment linkages.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mozambique/bilateral_relations_bilaterales/mozambique.aspx?lang=eng\">Canada - Mozambique Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}