{
  "path": "/en/news/readouts/2020/03/20/prime-minister-justin-trudeau-speaks-prime-minister-sweden-stefan-lofven",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Sweden Stefan Löfven | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Sweden, Stefan Löfven, to discuss COVID-19.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Löfven shared their commitment to taking strong action to protect health and safety, and to address economic challenges.</p>\n\n<p>The two leaders agreed on the valuable role of international coordination to limit the spread of the virus, and to support global economic stability and global supply chains. They recognized that depending on the situation on the ground, approaches to responding to the COVID-19 outbreak will be different in countries around the world. The Prime Ministers discussed the need to support countries with weaker health, financial, and economic systems, including throughout the developing world.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Löfven also spoke about the Ukraine International Airlines Flight PS752 tragedy, and the importance of close collaboration to ensure a thorough and credible investigation.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/16/prime-minister-announces-new-actions-under-canadas-covid-19-response\">Prime Minister announces new actions under Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}