{
  "path": "/en/news/news-releases/2022/08/19/prime-minister-announces-nomination-honourable-michelle-obonsawin",
  "pageTitle": "Prime Minister announces the nomination of the Honourable Michelle O’Bonsawin to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of the Honourable Michelle O’Bonsawin to the Supreme Court of Canada.</p>\n\n<p>Justice O’Bonsawin is an accomplished jurist with expertise in the areas of mental health, <em>Gladue</em> principles,&nbsp;labour and employment law, human rights, and privacy law, and has been a judge of the Ontario Superior Court of Justice in Ottawa since 2017. Justice O’Bonsawin holds a B.A., an LL.B., and an LL.M., and completed her Ph.D. in Law earlier this year. A fluently bilingual Franco-Ontarian, she is an Abenaki member of the Odanak First Nation.</p>\n\n<p>Following today’s announcement, the House of Commons Standing Committee on Justice and Human Rights members will participate in a special committee hearing on August 24, 2022. During this hearing, they will hear from the Minister of Justice and Attorney General of Canada, the Honourable David Lametti, and the Chairperson of the Independent Advisory Board for Supreme Court of Canada Judicial Appointments, the Honourable H. Wade MacLauchlan, on the selection process and the reasons for Justice O’Bonsawin’s nomination.</p>\n\n<p>As part of the Government of Canada’s commitment to openness, transparency, and accountability, the House of Commons Standing Committee members will then participate in a question-and-answer session with the nominee. They will be joined by Standing Senate Committee on Legal and Constitutional Affairs members and a member of the Green Party of Canada. This session will be moderated by Alain Roussy, Vice-Dean of the French Common Law Program of the Common Law Section at the Faculty of Law of the University of Ottawa.</p>\n\n<p>This nomination aims to fill the vacancy created by the upcoming retirement of the Honourable Michael J. Moldaver. The Prime Minister once again thanked Justice Moldaver for his service and congratulated him on his distinguished judicial career.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“I am pleased to announce the nomination of Justice Michelle O’Bonsawin to the Supreme Court of Canada, which is recognized worldwide for its strength, excellence, and independence. Her nomination is the result of an open, non-partisan selection process. I am confident that Justice O’Bonsawin will bring invaluable knowledge and contributions to our country’s highest court.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The process to select a candidate to fill the upcoming Supreme Court of Canada vacancy was launched on April 4, 2022.</li>\n\t<li>The application process was open for six weeks to qualified applicants from Ontario, in recognition of the convention of regional representation.</li>\n\t<li>From the applications received, the Independent Advisory Board for Supreme Court of Canada Judicial Appointments members identified jurists of the highest calibre who were functionally bilingual and met the statutory eligibility requirements for an Ontario seat. They then submitted a shortlist to the Prime Minister for consideration.</li>\n\t<li>Justice Moldaver was appointed to the Supreme Court of Canada from the Ontario Court of Appeal in 2011. He will retire effective September 1, 2022.</li>\n\t<li>In 2016, the Government of Canada announced a new process for Supreme Court of Canada judicial appointments. It included the creation of an independent and non-partisan advisory board to identify qualified and suitable candidates for appointment to the Supreme Court of Canada.</li>\n\t<li>The Supreme Court of Canada consists of nine judges, including a Chief Justice. They are all appointed by the Governor in Council, and must have been either a judge of a superior court or a member of at least 10 years’ standing of the bar of a province or territory.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/08/19/honourable-michelle-obonsawin\">The Honourable Michelle O’Bonsawin</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://fja-cmf.gc.ca/scc-csc/2022/nominee-candidat-eng.html\">Candidate questionnaire filled out by the Honourable Michelle O’Bonsawin</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/04/04/prime-minister-launches-process-select-next-justice-supreme-court\">Prime Minister launches process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/16/prime-minister-announces-members-independent-advisory-board-help\">Prime Minister announces members of the Independent Advisory Board to help select the next Supreme Court Justice</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2022/index-eng.html\">Supreme Court of Canada appointment process</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2022/qualifications-eng.html\">Qualifications and assessment criteria for Supreme Court of Canada appointments</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2022/questions-eng.html\">Frequently asked questions</a></li>\n\t<li><a href=\"https://www.scc-csc.ca/home-accueil/index-eng.aspx\">Supreme Court of Canada</a></li>\n</ul></div>\n      "
}