{
  "path": "/en/news/news-releases/2020/06/16/prime-minister-announces-extension-canada-emergency-response-benefit",
  "pageTitle": "Prime Minister announces extension of the Canada Emergency Response Benefit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>More Canadians are returning to work, but many people still face challenges due to COVID-19. As we begin to take steps to safely restart our economy, we will continue to support Canadians to protect their health and economic well-being.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the government is extending the Canada Emergency Response Benefit (CERB) by eight weeks, to ensure Canadians have the help they need as they transition back to work. This extension will make the benefit available to eligible workers for up to a total of 24 weeks.</p>\n\n<p>The Government of Canada introduced the CERB to immediately help workers affected by the COVID-19 pandemic, so they could continue to put food on the table and pay their bills during this challenging time. As we begin to restart the economy and get people back on the job, Canadians receiving the benefit should be actively seeking<strong> </strong>work opportunities or planning to return to work, provided they are able and it is reasonable to do so.</p>\n\n<p>That is why the government will also make changes to the CERB attestation, which will encourage Canadians receiving the benefit to find employment and consult Job Bank, Canada’s national employment service that offers tools to help with job searches.&nbsp;Over the next few weeks, the government will monitor international best practices, the economy, and the progression of the virus and, if needed, make necessary changes to the program so more people can have the support they need. We will also look at ways to ensure all our supports, including the Canada Emergency Wage Subsidy (CEWS) and Employment Insurance (EI), are working effectively to help Canadians get back on their feet.</p>\n\n<p>The CERB is a taxable benefit of $2,000 over a four-week period for eligible workers who have stopped working or whose work hours have been reduced, due to COVID-19.</p>\n\n<p>The CERB is available to workers who:</p>\n\n<ul>\n\t<li>live in Canada and are at least 15 years old</li>\n\t<li>have stopped working because of reasons related to COVID-19, or are eligible for EI regular or sickness benefits, or have exhausted their EI regular or fishing benefits between December 29, 2019 and October 3, 2020</li>\n\t<li>had employment and/or self-employment income of at least $5,000 in 2019, or in the 12 months prior to the date of their application</li>\n\t<li>have not earned more than $1,000 in employment and/or self-employment income per benefit period while collecting the CERB</li>\n\t<li>have not quit their job voluntarily</li>\n</ul>\n\n<p>Today’s announcement builds on a number of measures, including the proposed extension of the CEWS announced on May 15. The CEWS is being extended to August 29, 2020, to protect jobs, allow businesses to keep employees on the payroll, and re-hire workers who were previously laid off.</p>\n\n<p>While parts of our economy safely begin to restart, many Canadians are still experiencing the effects of COVID-19. Both the CERB and the CEWS were introduced as part of our plan to rapidly support Canadians through this crisis. The government is committed to continuing to support Canadians across all sectors until they can consistently and safely return to work.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We know that many Canadians across the country are still facing a really tough time due to the COVID-19 pandemic, and we will continue to take action to better support them. By extending the Canada Emergency Response Benefit, Canadians will be able to continue to buy groceries and pay their bills as we work together to safely and effectively restart the economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The best way to bring the economy back quickly and efficiently is to get&nbsp;Canadians back to work safely.&nbsp;We are seeing some positive progress in the number of people returning to work. However, we also know&nbsp;that Canadians continue to face&nbsp;real challenges in terms of employment, sickness, and child care.&nbsp;We will continue to be there for Canadians in these difficult times. This&nbsp;is why we have extended the benefits available under the CERB by an extra eight weeks - for a total of 24 weeks.”</p>\n\n<footer class=\"default\">The Hon. Carla Qualtrough, Minister of Employment, Workforce Development and Disability Inclusion</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since the launch of the Canada Emergency Response Benefit in April, the Canada Revenue Agency has helped deliver urgently-needed financial aid to millions of Canadians who were impacted by COVID-19. As the economy re-opens over the coming months, Canadians can count on the CRA to continue to provide this critical benefit to workers who still need some support while they re-enter the workforce.”</p>\n\n<footer class=\"default\">The Hon. Diane Lebouthillier, Minister of National Revenue</footer>\n</blockquote>\n\n<blockquote>\n<p>“The government will continue to ensure that its programs are working as intended; filling the gaps, supporting Canada’s most vulnerable and leaving no one behind. Extending the CERB allows more breathing room for Canadians as they prepare to return to work. The government will continue to make the necessary investments to protect the health of Canadians and support the workers that have built a strong Canada.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canadians begin to receive their CERB payments by direct deposit within 3 to 5 days of applying and by mail within 10 days of applying. Canadians will have to apply every period, attesting that they continue to meet the eligibility criteria for the CERB payment.</li>\n\t<li>When submitting their first claim, workers cannot have earned more than $1,000 in employment and/or self-employment income for 14 or more consecutive days within the four-week benefit period of their claim. When submitting subsequent claims, workers cannot have earned more than $1,000 in employment and/or self-employment income for the entire four-week benefit period of their new claim.</li>\n\t<li>Application to the CERB can be made no later than December 2, 2020, for payments retroactive to the period of March 15 to October 3, 2020.</li>\n\t<li>Canadians can apply for the CERB and get more information <a href=\"https://www.canada.ca/en/services/benefits/ei/cerb-application.html\">online</a> or by calling 1-833-966-2099.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/benefits/ei/cerb-application.html\">Canada Emergency Response Benefit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n</ul></div>\n      "
}