{
  "path": "/en/news/itineraries/2021/02/22/prime-ministers-itinerary-tuesday-february-23-2021",
  "pageTitle": "Prime Minister’s itinerary for Tuesday, February 23, 2021 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>Ottawa, Ontario</h2>\n\n<p>Private meetings.</p>\n\n<p>The Prime Minister will speak with the Prime Minister of Israel, Benjamin Netanyahu.</p>\n\n<p><strong>4:00 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual bilateral meeting with the President of the United States, Joe Biden.</p>\n\n<p class=\"Indent2\">Deputy Prime Minister and Minister of Finance Chrystia Freeland, Minister of Foreign Affairs Marc Garneau, and Ambassador of Canada to the United States Kirsten Hillman will be in attendance.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent3\">\n\t<li class=\"Indent2\">Pooled photo opportunity at the beginning of the meeting</li>\n</ul>\n\n<p><strong>4:50 p.m.&nbsp;</strong>The Prime Minister will participate in a virtual expanded meeting with the President of the United States, Joe Biden.</p>\n\n<p class=\"Indent2\">Deputy Prime Minister and Minister of Finance Chrystia Freeland, Minister of Foreign Affairs Marc Garneau, Minister of National Defence Harjit Sajjan, Minister of Natural Resources Seamus O’Regan, Minister of Public Safety and Emergency Preparedness Bill Blair, Minister of Small Business, Export Promotion and International Trade Mary Ng, Minister of Environment and Climate Change Jonathan Wilkinson, Minister of Transport Omar Alghabra, and Ambassador of Canada to the United States Kirsten Hillman will be in attendance.</p>\n\n<p class=\"Indent2\"><em>Closed to media.</em></p>\n\n<p><strong>5</strong><strong>:45 p.m.&nbsp;</strong>The Prime Minister will deliver a joint statement with the President of the United States, Joe Biden.</p>\n\n<p class=\"Indent2\"><strong>Note for media:</strong></p>\n\n<ul class=\"Indent3\">\n\t<li class=\"Indent2\">Pooled coverage</li>\n</ul></div>\n      "
}