{
  "path": "/en/news/news-releases/2021/10/21/prime-minister-announces-standardized-canadian-covid-19-proof",
  "pageTitle": "Prime Minister announces standardized Canadian COVID-19 proof of vaccination for travel | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Vaccination is the best way to keep Canadians safe and healthy, get back to enjoying the things we love, and prevent future lockdowns. As new travel requirements roll out in Canada and around the world, the Government of Canada has been working closely with provinces and territories on a standardized proof of vaccination that facilitates international and domestic travel.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that, in collaboration with provinces and territories, a standardized Canadian COVID-19 proof of vaccination is now available to residents of Newfoundland and Labrador, Northwest Territories, Nova&nbsp;Scotia, Nunavut, Ontario, Quebec, Saskatchewan, and Yukon, and will be available in the other provinces soon. Canada is also engaging with international partners to obtain recognition and acceptance abroad, so the proof can also be used to facilitate travel around the world.</p>\n\n<p>The Canadian COVID-19 proof of vaccination provides Canadians a reliable and secure way to demonstrate their COVID-19 vaccination history, both in Canada and abroad. It&nbsp;is issued by provinces and territories to individuals who are vaccinated and registered with their provincial or territorial health authority. The proof of vaccination can also be used with <a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/arrivecan.html\">ArriveCAN</a>, the mobile app and website for travellers to submit mandatory information when arriving in Canada from other countries.</p>\n\n<p>This standardized proof will support Canada’s <a href=\"https://www.canada.ca/en/transport-canada/news/2021/10/mandatory-covid-19-vaccination-requirements-for-federally-regulated-transportation-employees-and-travellers.html\">new traveller vaccination requirements</a> that will come into effect on October 30, 2021. Travellers can continue to use their provincial proof of vaccination for domestic or international travel if their province is not yet issuing the standardized proof of vaccination.</p>\n\n<p>Today’s announcement is part of the five vaccination commitments that the Government of Canada will implement in the first 100 days of its new mandate. More than 83 per cent of eligible Canadians are fully vaccinated against COVID-19, but the fight against the virus continues. The government will continue to make vaccination a priority so we can keep Canadians safe, finish the fight against COVID-19, and build a better country for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians have done their part by getting vaccinated against COVID-19 to protect themselves, their families, and their communities. As new vaccine requirements roll out for travellers, we are working to ensure that those who travel have access to a reliable, secure way to demonstrate their COVID-19 vaccinations, both at home and abroad. We will continue to work with provincial, territorial, and Indigenous partners so this standardized proof is available across Canada.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Thanks to the ongoing collaboration and partnership with provinces and territories, the majority of Canadians will have access to a COVID-19 proof of vaccination they can use to travel. We are laying the groundwork now, so Canadians will have a more predictable travel experience overseas when borders fully re-open.”</p>\n\n<footer class=\"default\">The Hon. Marco E. L. Mendicino, Minister of Immigration, Refugees and Citizenship</footer>\n</blockquote>\n\n<blockquote>\n<p>“Vaccines are the best way to protect people from COVID-19 and end this pandemic. A standard proof of vaccination will further enable fully vaccinated Canadians to safely resume some of the pre-pandemic activities they enjoy. Our government will continue to work with provinces and territories to help Canadians from coast to coast to coast navigate this pandemic and keep each other safe.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>To learn more about the Canadian COVID-19 proof of vaccination and how to get it, visit <a href=\"https://canada.ca/vaccine-proof\">Canada.ca/vaccine-proof</a>.</li>\n\t<li>Most people vaccinated in Canada will be able to get a Canadian COVID-19 proof of vaccination from the province or territory where they received their vaccines. Those vaccinated outside Canada can check with their home province or territory to see if they can register their vaccine record to get a Canadian proof.</li>\n\t<li>The Government of Canada continues to engage with Indigenous partners across the country to ensure that a COVID-19 proof of vaccination respects the rights of Indigenous peoples. This includes ensuring the proof is equitable and accessible, and takes into account the needs of Indigenous communities, particularly along the Canada-U.S. border.</li>\n\t<li>Privacy remains a key priority. Provinces, territories, and Indigenous organizations are, and will remain, the custodians of Canadians’ health data. The Government of Canada has worked closely with partners to make sure the data contained within the standardized proof of vaccination only includes the minimum information needed to determine whether a traveller meets their entry and public health requirements.</li>\n\t<li>Establishing a standardized proof of vaccination for Canadians travelling internationally is part of the government’s vaccination commitments for the first 100 days following the swearing-in of the new Cabinet, to take place on October&nbsp;26, 2021. The other commitments are:\n\t<ul>\n\t\t<li>To support provincial and territorial proof of vaccination programs.</li>\n\t\t<li>To ensure everyone 12 or older travelling within Canada on a plane or train is fully vaccinated.</li>\n\t\t<li>To ensure all federal employees and people in federally regulated workplaces are fully vaccinated.</li>\n\t\t<li>To introduce legislation to make it a criminal offence to harass or threaten health care workers.</li>\n\t</ul>\n\t</li>\n\t<li>Effective October 30, 2021, travellers departing from Canadian airports, and travellers on VIA Rail and Rocky Mountaineer trains, will be required to be fully vaccinated in order to travel. To allow travellers time to become fully vaccinated, there will be a short transition period where they will be able to travel if they show a valid COVID-19 molecular test within 72 hours of travel as an alternative to providing proof of full vaccination. If travellers have not already started the vaccination process, or do not start soon, they risk not qualifying for travel as of November 30, 2021.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2021/10/canadian-covid-19-proof-vaccination.html\">Backgrounder: Using Canada’s COVID-19 proof of vaccination for travel</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/vaccines/life-after-vaccination/vaccine-proof.html\">About the Canadian COVID-19 proof of vaccination</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid\">COVID-19: Travel, testing, quarantine and borders</a></li>\n\t<li><a href=\"https://travel.gc.ca/travelling/advisories\">Travel Advice and Advisories</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/06/prime-minister-announces-mandatory-vaccination-federal-workforce-and\">Prime Minister announces mandatory vaccination for the federal workforce and federally regulated transportation sectors</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/vaccines/how-vaccinated.html\">Vaccines for COVID-19: How to get vaccinated</a></li>\n</ul></div>\n      "
}