{
  "path": "/en/news/news-releases/2019/12/12/prime-minister-welcomes-new-parliamentary-secretaries",
  "pageTitle": "Prime Minister welcomes new parliamentary secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced a new team of parliamentary secretaries.</p>\n\n<p>Our team of parliamentary secretaries will be an important link between ministers and Parliament, working closely with their colleagues to deliver real, positive results for all Canadians. They will help advance government legislation, engage directly with Canadians on key government initiatives, and represent the government in Canada and internationally.</p>\n\n<p>The parliamentary secretaries are as follows:</p>\n\n<ul>\n\t<li><strong>Omar Alghabra</strong> is Parliamentary Secretary to the Prime Minister (Public Service Renewal) and Parliamentary Secretary to the Deputy Prime Minister and Minister of Intergovernmental Affairs, and will be sworn in as a Privy Councillor</li>\n\t<li><strong>Will Amos</strong> is Parliamentary Secretary to the Minister of Innovation, Science and Industry (Science)</li>\n\t<li><strong>Gary Anandasangaree</strong> is Parliamentary Secretary to the Minister of Crown-Indigenous Relations</li>\n\t<li><strong>Terry Beech</strong> is Parliamentary Secretary to the Minister of Fisheries, Oceans and the Canadian Coast Guard</li>\n\t<li><strong>Rachel Bendayan</strong> is Parliamentary Secretary to the Minister of Small Business, Export Promotion and International Trade</li>\n\t<li><strong>Chris Bittle</strong> is Parliamentary Secretary to the Minister of Transport</li>\n\t<li><strong>Julie Dabrusin</strong> is Parliamentary Secretary to the Minister of Canadian Heritage</li>\n\t<li><strong>Pam Damoff</strong> is Parliamentary Secretary to the Minister of Indigenous Services</li>\n\t<li><strong>Ali Ehsassi</strong> is Parliamentary Secretary to the Minister of Innovation, Science and Industry (Innovation and Industry)</li>\n\t<li><strong>Neil Ellis</strong> is Parliamentary Secretary to the Minister of Agriculture and Agri-Food</li>\n\t<li><strong>Greg Fergus</strong> is Parliamentary Secretary to the President of the Treasury Board and Parliamentary Secretary to the Minister of Digital Government</li>\n\t<li><strong>Andy Fillmore</strong> is Parliamentary Secretary to the Minister of Infrastructure and Communities</li>\n\t<li><strong>Darren Fisher</strong> is Parliamentary Secretary to the Minister of Health</li>\n\t<li><strong>Sean Fraser</strong> is Parliamentary Secretary to the Minister of Finance and Parliamentary Secretary to the Minister of Middle Class Prosperity and Associate Minister of Finance</li>\n\t<li><strong>Anthony Housefather</strong> is Parliamentary Secretary to the Minister of Labour</li>\n\t<li><strong>Gudie Hutchings</strong> is Parliamentary Secretary to the Minister for Women and Gender Equality and Rural Economic Development</li>\n\t<li><strong>Yvonne Jones</strong> is Parliamentary Secretary to the Minister of Northern Affairs</li>\n\t<li><strong>Kamal Khera</strong> is Parliamentary Secretary to the Minister of International Development</li>\n\t<li><strong>Irek Kusmierczyk</strong> is Parliamentary Secretary to the Minister of Employment, Workforce Development and Disability Inclusion</li>\n\t<li><strong>Kevin Lamoureux</strong> is Parliamentary Secretary to the President of the Queen’s Privy Council for Canada and Parliamentary Secretary to the Leader of the Government in the House of Commons</li>\n\t<li><strong>Stéphane Lauzon</strong> is Parliamentary Secretary to the Minister of Seniors</li>\n\t<li><strong>Paul Lefebvre</strong> is Parliamentary Secretary to the Minister of Natural Resources</li>\n\t<li><strong>Joël Lightbound</strong> is Parliamentary Secretary to the Minister of Public Safety and Emergency Preparedness</li>\n\t<li><strong>Steven MacKinnon</strong> is Parliamentary Secretary to the Minister of Public Services and Procurement</li>\n\t<li><strong>Soraya Martinez Ferrada</strong> is Parliamentary Secretary to the Minister of Immigration, Refugees and Citizenship</li>\n\t<li><strong>Rob Oliphant</strong> is Parliamentary Secretary to the Minister of Foreign Affairs</li>\n\t<li><strong>Darrell Samson</strong> is Parliamentary Secretary to the Minister of Veterans Affairs and Associate Minister of National Defence</li>\n\t<li><strong>Peter Schiefke</strong> is Parliamentary Secretary to the Minister of Environment and Climate Change</li>\n\t<li><strong>Francesco Sorbara</strong> is Parliamentary Secretary to the Minister of National Revenue</li>\n\t<li><strong>Adam van Koeverden</strong> is Parliamentary Secretary to the Minister of Diversity and Inclusion and Youth and Parliamentary Secretary to the Minister of Canadian Heritage (Sport)</li>\n\t<li><strong>Anita Vandenbeld</strong> is Parliamentary Secretary to the Minister of National Defence</li>\n\t<li><strong>Adam Vaughan</strong> is Parliamentary Secretary to the Minister of Families, Children and Social Development (Housing)</li>\n\t<li><strong>Arif Virani</strong> is Parliamentary Secretary to the Minister of Justice and Attorney General of Canada</li>\n</ul>\n\n<p>The parliamentary secretaries responsible for assisting the Minister of Economic Development and Official Languages are as follows:</p>\n\n<ul>\n\t<li><strong>René Arseneault</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (Atlantic Canada Opportunities Agency and Official Languages)</li>\n\t<li><strong>Larry Bagnell</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (Canadian Northern Economic Development Agency)</li>\n\t<li><strong>Élisabeth Brière</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (Economic Development Agency of Canada for the Regions of Quebec)</li>\n\t<li><strong>Terry Duguid</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (Western Economic Diversification Canada) and Parliamentary Secretary to the Minister of Environment and Climate Change (Canada Water Agency)</li>\n\t<li><strong>Terry Sheehan</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (FedNor)</li>\n\t<li><strong>Kate Young</strong> is Parliamentary Secretary to the Minister of Economic Development and Official Languages (FedDev Ontario)</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>This team brings the diverse knowledge, experience, and skills that will be key to advancing the government’s ambitious agenda. Together with their ministers, they will support the work to fight climate change, strengthen the middle class, walk the road of reconciliation, keep people safe and healthy, and position Canada for success in an uncertain world. Recognizing the different and unique needs of people across the country, Canadians from each region will also have a parliamentary secretary focused on ensuring that economic growth works for everyone.</p>\n\n<p>The Prime Minister will soon release an updated version of <em>Open and Accountable Government</em>, which sets out his expectations for Cabinet ministers and parliamentary secretaries, as well as their roles and responsibilities. The updated guide will also clarify the role of the Minister of Justice and Attorney General of Canada, incorporating recommendations made by the Honourable Anne McLellan in her recent report on the issue.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“From coast to coast to coast, Canadians have chosen to continue moving forward. We have the plan and the team to do just that. Today, I can announce a dynamic and diverse team of parliamentary secretaries who will work tirelessly with their ministers and colleagues to make progress on the issues that matter most to Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Parliamentary secretaries are chosen by the Prime Minister to assist ministers.</li>\n\t<li>The responsibilities of parliamentary secretaries generally fall into two broad categories: House of Commons business and department-related duties.</li>\n\t<li>Parliamentary secretaries are not members of Cabinet and do not play a formal role in the Cabinet decision-making process. They support their ministers, but overall responsibility and accountability remains with the minister.</li>\n\t<li>Part of Terry Duguid’s responsibilities as Parliamentary Secretary will be to help advance the government’s commitment to create a new Canada Water Agency. The Agency will work with the provinces, territories, Indigenous communities, local authorities, scientists, and others to keep Canada’s water safe, clean, and well-managed.</li>\n\t<li>The new <em>Open and Accountable Government</em> will reflect recent changes, including changes to the <em>Access to Information Act</em> and <em>Privacy Act</em> that make important improvements to the openness and transparency of government.</li>\n\t<li>In March 2019, the Prime Minister sought advice from former Deputy Prime Minister and Minister of Justice and Attorney General of Canada Anne McLellan on the relationship between the federal government and the Minister of Justice and Attorney General of Canada. Her <a href=\"https://pm.gc.ca/en/news/backgrounders/2019/08/14/review-roles-minister-justice-and-attorney-general-canada\">review of the roles of the Minister of Justice and Attorney General of Canada</a> was published in August 2019.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/parliamentary-secretaries\">Parliamentary Secretaries</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2016/01/05/guide-parliamentary-secretaries\">Guide for Parliamentary Secretaries</a></li>\n</ul></div>\n      "
}