{
  "path": "/en/news/readouts/2020/03/24/prime-minister-justin-trudeau-speaks-first-ministers-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with First Ministers on efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland spoke with First Ministers to discuss COVID-19 and the ongoing collective efforts to protect the health and safety of Canadians.</p>\n\n<p>First Ministers talked about the need to move forward with measures to support families and small businesses, and Prime Minister Trudeau highlighted that the House of Commons has been recalled to consider urgent measures as part of Canada’s $82 billion COVID-19 Economic Response Plan. This plan will help stabilize the economy, and provide Canadians, workers, and businesses with the financial support they need during this crisis.</p>\n\n<p>First Ministers also talked about the collaborative actions taken by Canada and the United States to close the border to non-essential travellers, while allowing essential and business travel to continue unimpeded and preserving the vital supply chains between our two countries.</p>\n\n<p>First Ministers discussed the states of emergency enacted by a number of provinces, territories, and municipalities. They also discussed the federal <em>Emergencies Act</em>, which is a measure of last resort. The Prime Minister solicited the views of premiers on this Act and related emergency measures.</p>\n\n<p>The Prime Minister underscored the need for continued federal-provincial-territorial collaboration to minimize the health, social, and economic impacts of COVID-19, and First Ministers discussed their needs and plans to mitigate the effects of the pandemic in each of their jurisdictions. The leaders agreed on the importance of working together to ensure that all regions have what they need, including testing equipment and medical supplies.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/13/first-ministers-discuss-collective-efforts-address-impact-covid-19\">First Ministers discuss collective efforts to address the impact of COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/22/government-requests-recall-house-commons-help-workers-and-businesses\">Government requests recall of the House of Commons to help workers and businesses during COVID-19 crisis</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states\">Prime Minister announces temporary border agreement with the United States</a></li>\n</ul></div>\n      "
}