{
  "path": "/en/news/readouts/2022/03/19/prime-minister-justin-trudeau-convenes-incident-response-group-war-ukraine",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group on the war in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the war in Ukraine. Joined by ministers and senior officials, he was briefed on the latest developments in the ongoing Russian invasion of Ukraine and Canada’s response on multiple fronts.</p>\n\n<p>The group considered the impact of the latest sanctions imposed by Canada against Russia and those who are directly responsible for this unprovoked invasion or are helping to support it. This includes new sanctions on 22 senior officials of Belarus’ Department of Defence who supported the attack, notably by allowing their country to serve as a launch pad for Russia’s ongoing aggression. They discussed the impact that economic sanctions from Canada and its international partners are having on Russia’s economy, with the ruble going down in value by about 30 per cent since the start of Russia’s unjustifiable attack. They committed to continue working with other countries to coordinate further economic sanctions against key Russian elites and proxies, and their enablers and facilitators, to isolate them from the international financial system, including through the Russian Elites, Proxies, and Oligarchs Task Force announced earlier this week.</p>\n\n<p>The Prime Minister and ministers also discussed the latest military efforts from the Canadian Armed Forces to support Ukraine in the face of Russia’s illegal invasion. This includes the recent renewal – a year ahead of schedule – of Canada’s multi-year commitment to Operation REASSURANCE, the Canadian Armed Forces support to the North Atlantic Treaty Organization (NATO)’s assurance and deterrence measures in Central and Eastern Europe. It also includes an additional $50&nbsp;million in defensive military equipment to Ukraine, as announced by the Prime Minister last week during his trip to Europe. The Prime Minister and ministers decided to continue working alongside allies and international partners to support Ukraine as they seek to address the security and humanitarian challenges in the region.</p>\n\n<p>The group discussed the far-reaching impacts of the war, including on the availability of key resources, energy prices, food security, and the rapidly growing humanitarian and refugee crisis. On that last point, the Prime Minister and ministers reiterated their call on Russia to allow civilians to access humanitarian corridors. They received an update on ongoing efforts to help Ukrainians and their families get to Canada as quickly and as safely as possible, including by prioritizing and fast-tracking immigration applications and waiving application and processing fees. They also discussed the recent launch of the Canada-Ukraine authorization for emergency travel (CUAET), a special, accelerated temporary residence pathway for Ukrainians seeking safe haven in Canada, and the Job Bank’s Jobs for Ukraine webpage, which allows Canadian employers who wish to support Ukrainians with offers of employment to register these offers online. Since its launch, the site has already had over 54,000 visitors and 9,000 applications.</p>\n\n<p>The Prime Minister and ministers emphasized Canada’s unwavering commitment to support Ukraine’s sovereignty, security, and territorial integrity. They praised the exceptional courage of the Ukrainian people in the face of Russia’s ongoing aggression and the steadfast leadership of President Volodymyr Zelenskyy, who delivered a powerful speech to the Parliament of Canada on Tuesday. The Prime Minister noted he would meet with NATO, G7, and European Union partners during his trip to Europe next week to advance our shared support for Ukraine. He told the group that Canada would continue to put measures in place to support Ukraine and help restore peace in the region.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian sanctions related to Russia</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://deputypm.canada.ca/en/news/statements/2022/03/17/russian-elites-proxies-and-oligarchs-task-force-ministerial-joint\">Russian Elites, Proxies, and Oligarchs Task Force Ministerial Joint Statement</a></li>\n\t<li class=\"wordsection1\"><a href=\"https://www.jobbank.gc.ca/report_note.do?cid=18538\">Jobs for Ukraine</a></li>\n</ul></div>\n      "
}