{
  "path": "/en/news/statements/2022/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p>\n\n<p>“Today, on the <a href=\"https://www.un.org/development/desa/disabilities/news/uncategorized/international-day-of-persons-with-disabilities-2022.html\">International Day of Persons with Disabilities</a>, we recommit to building a future free of barriers, where persons with disabilities have every opportunity to thrive. We also celebrate the contributions of persons with disabilities, here in Canada and around the world.</p>\n\n<p>“More than 6.2 million Canadians have a disability – and many have disabilities that are not visible. Persons with disabilities face discrimination, incur many additional expenses, and often encounter barriers to finding meaningful and well-paid work. We recognize that disabilities are diverse in nature&nbsp;– whether physical, sensory, cognitive, or mental health-related&nbsp;– and there is no one-size-fits-all solution. But whatever a person’s needs may be, the Government of Canada is committed to making our country more accessible and more inclusive for everyone.</p>\n\n<p>“Earlier this fall, we launched Canada’s first-ever <a href=\"https://www.canada.ca/en/employment-social-development/programs/disability-inclusion-action-plan-2.html\">Disability Inclusion Action Plan</a>, which features concrete programs, policies, and critical investments that aim to improve the lives of persons with disabilities – from achieving financial security, to finding and keeping a good job, to being able to fully participate in their communities. The Action Plan was developed in partnership with the disability community and tackles their key priorities. The government has also followed through on ground-breaking legislation. The Canada Disability Benefit Act, Bill&nbsp;C-22, was tabled in Parliament this summer, and recently passed second reading in the House of Commons with unanimous consent. The goal of the proposed Canada Disability Benefit is to reduce poverty and increase the financial security of working-age persons with disabilities in our country. By the end of the year, we will reach a major milestone toward making Canada’s public service the most accessible and inclusive in the world with the publication of accessibility plans across the federal public service. These plans will help shape the future of Canada’s largest employer and service provider, so that we can build a federal public service that truly reflects the population it serves.</p>\n\n<p>“Around the world, Canada continues to protect and promote the rights of people with disabilities, including through international forums such as the United Nations (UN), the World Health Organization, and the Global Action on Disability Network. Earlier this year, Canada supported the successful election of Dr.&nbsp;Laverne Jacobs to the UN Committee on the Rights of Persons with Disabilities – the first ever Canadian to serve as a member.</p>\n\n<p>“When everyone can fully contribute to our communities, we all benefit. When persons with disabilities have equal opportunities to work, have the same quality of service from their government, can access the supports and programs they need to enjoy the same quality of life as everyone else, we build stronger communities, a stronger economy, and a stronger country. Today, and every day, I encourage all Canadians to work together to help make our country a more inclusive, equitable, and accessible place to call home.”</p></div>\n      "
}