{
  "path": "/en/news/readouts/2022/12/13/prime-minister-justin-trudeau-convenes-fourth-meeting-incident-response",
  "pageTitle": "Prime Minister Justin Trudeau convenes a fourth meeting of the Incident Response Group to discuss the situation in Haiti | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group with ministers and senior officials to discuss the evolving situation in Haiti. They were joined by the Ambassador and Permanent Representative of Canada to the United Nations in New York, Bob Rae, the Ambassador of Canada to the United States of America, Kirsten Hillman, and the Ambassador of Canada to Haiti, Sébastien Carrière. Ambassador Rae provided an overview of his recent diplomatic mission to Haiti.</p>\n\n<p>The group was briefed on the security and humanitarian situation in Haiti, which remains fragile. Haitians continue to face gang violence and blockades, including indiscriminate attacks, sexual and gender-based violence, destruction of homes, and mass displacement. The ongoing insecurity continues to exacerbate a humanitarian crisis by limiting the flow of fuel, food, water, medicine, and other essential goods. The group welcomed news that political dialogue amongst key Haitian stakeholders continues, including a recent call for consensus by the private sector.</p>\n\n<p>The group discussed further steps to be taken by Canada and its partners to support the people of Haiti. Prime Minister Trudeau directed officials to continue exploring how Canada can respond to the multidimensional crisis in Haiti with partners and support a Haitian-led solution. As part of these efforts, Canada will embed a team&nbsp;within the Embassy of Canada in Haiti to better liaise and engage with Haitian security stakeholders.&nbsp;This will help prioritize&nbsp;local voices and enable Canada to be more responsive to the needs of Haitians. Canada will also&nbsp;continue to work to hold to account those who are responsible for the unrest, including through sanctions and other tools, and will continue to encourage partners to do the same.</p>\n\n<p>The Prime Minister and ministers reiterated Canada’s commitment to further collaborating with regional and international partners to support Haiti’s security and stability, and to help facilitate a path toward free and fair elections.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/09/prime-minister-justin-trudeau-convenes-third-meeting-incident-response\">Prime Minister Justin Trudeau convenes a third meeting of the Incident Response Group to discuss the situation in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/12/canada-conducts-diplomatic-mission-in-haiti.html\">Canada conducts diplomatic mission in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/12/canada-imposes-sanctions-against-haitian-economic-elites.html\">Canada imposes sanctions against Haitian economic elites</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/11/canada-imposes-additional-sanctions-against-haitian-political-elites.html\">Canada imposes additional sanctions against Haitian political elites</a></li>\n</ul></div>\n      "
}