{
  "path": "/en/news/news-releases/2018/10/05/prime-minister-welcomes-start-full-construction-new-gordie-howe",
  "pageTitle": "Prime Minister welcomes start of full construction on the new Gordie Howe International Bridge | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada continues to support large, transformative infrastructure projects across the country. The Prime Minister, Justin Trudeau, today announced the start of full construction on the new Gordie Howe International Bridge, which will create thousands of new jobs during construction, and many permanent jobs once the bridge is operational.</p><p>The Windsor-Detroit trade corridor is the busiest commercial land border crossing between Canada and the United States, and is critical for people and goods to move across North America. The new Gordie Howe International Bridge will shorten travel times through this important corridor, and create better connections for people and businesses on both sides of the border.</p><p>Expected to open by the end of 2024, the Gordie Howe International Bridge will provide direct connections between Ontario's Highway 401 and Michigan's Interstate 75. Enhanced border infrastructure at the crossing will also protect our safety and security while making it easier and faster for people to travel and goods to flow between the two countries.</p><p>Locally, the bridge will benefit residents of Windsor and neighbouring communities by creating good, middle class jobs, reducing commercial traffic on streets, and increasing opportunities for local businesses.</p><h2>Quotes</h2><blockquote><p>“Today, full construction begins on the largest and most ambitious infrastructure project along the Canada-United States border. Canadians need infrastructure they can rely on to get where they want to go and to expand their businesses within our borders and beyond. The Gordie Howe International Bridge will help grow our economy, encourage increased trade and investment, and create good, well-paying jobs on both sides of the border.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“This project is a leading example of the strategic infrastructure investments we are making across Canada to help grow the economy, create good middle-class jobs and enhance productivity. With direct highway to highway connectivity and technologically advanced ports of entry, the bridge will better support significant commercial traffic and travellers through the Windsor-Detroit trade corridor.”<br><cite>—The Hon. François-Philippe Champagne, Minister of Infrastructure and Communities</cite></p></blockquote><blockquote><p>“Through this long process of planning, our partnership with Canada has been strengthened, and we owe them a great deal of gratitude for never wavering throughout many challenges, and for all of the work that has finally brought us to this momentous day.”<br><cite>—Rick Snyder, Governor of Michigan</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Gordie Howe International Bridge project includes the construction of a six-lane, cable-stayed design bridge with a clear span of 853 metres (0.53 miles) and a total length of approximately 2.5 kilometres (1.5 miles). It also includes new Canadian and U.S. ports of entry and approach bridges, border inspection plazas, tolling operations, and an interchange in Michigan connecting Interstate 75 to the U.S. port of entry.</li><li>Windsor-Detroit Bridge Authority (WDBA), a not-for-profit Canadian Crown corporation, is responsible for the delivery of the bridge project through a public-private partnership. In addition to managing the project agreement between itself and the project’s private sector partner, Bridging North America, WDBA will set and collect all tolls.</li><li>The Windsor-Detroit trade corridor is the busiest Canada-U.S. commercial land border crossing and is vital to the economies of Ontario, Michigan, Canada and the U.S. Approximately 7,000 trucks cross the corridor each day, and about 2.5 million trucks each year.</li><li>In 2017 over CAD$173 billion (US$133 billion) in bilateral trade passed through the Windsor-Detroit trade corridor, which is 23 per cent of the overall Canada-U.S. trade.</li><li>Canada and the U.S. share the world's longest secure border, over which about 400,000 people cross daily. The two countries also exchange goods and services worth approximately CAD$2.5 billion (US$1.9 billion) every day.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.wdbridge.com/en/project-overview-gordie-howe-international-bridge-project\">Gordie Howe International Bridge Project – Windsor Detroit Bridge Authority</a></li><li><a href=\"http://www.infrastructure.gc.ca/pont-gh-bridge/pont-gh-bridge2-eng.html\">Gordie Howe International Bridge Project – Infrastructure Canada</a></li></ul></div>\n      "
}