{
  "path": "/en/news/statements/2023/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p>\n\n<p>“As we celebrate the beginning of Black History Month, we reflect on the rich history of Black communities in Canada and commit to building an equitable future for all. This is a time for Canadians to honour the legacy of Black communities from coast to coast to coast and celebrate the contributions they have made across the country. From scientists to artists, from business owners to philanthropists, Canadians from Black communities continue to shape our country each and every day.</p>\n\n<p>“One of the many stories we celebrate this February, as part of this year’s Black History Month theme, ‘Ours to tell’, is that of the Honourable Jean Augustine. Thirty years ago, she made history as the first Black Canadian woman to be elected to the House of Commons and later when she became the first Black Canadian woman to be appointed to the federal Cabinet. Her advocacy led to the national recognition of Black History Month, and she continues to be a beacon of excellence for communities across Canada, and for others to follow in her footsteps. From Jean Augustine to medical pioneers like Dr.&nbsp;June Marion James, athletes turned successful entrepreneurs like Donovan Bailey, scientists and comedians like Boucar Diouf, and artists like Dionne Brand, this year’s Black History Month theme celebrates stories that are worth telling.</p>\n\n<p>“Last year, the Government of Canada committed $1.5&nbsp;million to support the ongoing activities of the Jean Augustine Chair in Education, Community and Diaspora at York University, which works to address systemic barriers to improve educational outcomes for Black students. We also provided funding through the Supporting Black Canadian Communities Initiative to support Black community organizations across Canada, while the <a href=\"https://ised-isde.canada.ca/site/black-entrepreneurship-program/en\">Black Entrepreneurship Program</a> continues to offer Black-led businesses, organizations, and financial institutions across Canada the financial resources to succeed now and into the future. These investments are key pieces to making sure we’re building an equitable Canada.</p>\n\n<p>“Canada has a history of anti-Black racism, and communities continue to face the impacts of systemic racism today. It is our collective responsibility to end it by listening, learning, and taking action. That is why in 2018, Canada officially recognized the United Nations International Decade for People of African Descent, which provides a global framework for recognition, justice, and development for people of African descent. Building on this framework, our government will continue to address the unique challenges that Black communities face.</p>\n\n<p>“We know that more work still needs to be done, and the Government of Canada will continue to support the advancement of Black communities. This includes our ongoing efforts, working closely with provinces, territories, and Black communities, to develop Canada’s Black Justice Strategy, which will help address systemic discrimination and the over-representation of members of Black communities in our criminal justice system. And through Canada’s Anti-Racism Strategy, we will continue fighting anti-Black racism, eliminating inequities, empowering communities, and changing attitudes by building awareness.</p>\n\n<p>“This month, I invite everyone to take part in community events for&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a>, and to listen to and actively share the stories Black communities have to tell. Let’s continue to celebrate their many past and ongoing contributions. Together, we will continue to build a stronger and more resilient country, where all Canadians can succeed, thrive, and have their voices heard.”</p></div>\n      "
}