{
  "path": "/en/news/news-releases/2022/06/25/prime-minister-drives-action-food-security-climate-change-and-gender",
  "pageTitle": "Prime Minister drives action on food security, climate change and gender equality at Commonwealth Heads of Government Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation in the 2022 Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda, where he worked closely with international partners to address key priorities, like food security, climate change and gender equality, and make life better for people.</p>\n\n<p>This is a critical time. Commonwealth member states, as well as other countries around the world, are feeling the impacts of Russia’s illegal and unjustifiable invasion of Ukraine through rising food and gasoline prices, the growing fear of famine, and more. These challenges are also compounded by the ongoing impacts of the COVID-19 pandemic and climate change.</p>\n\n<p>During the summit, the Prime Minister drove action to address these challenges and reaffirmed Canada’s unwavering commitment to the core values that must bring the countries of the Commonwealth together: free and democratic societies and the promotion of peace and prosperity to improve the lives of all people.</p>\n\n<p>While at the CHOGM, Prime Minister Trudeau announced nearly $500 million to make life better for people in the Commonwealth and beyond. This total includes $250 million to help address the global food security crisis, with a focus on Sub-Saharan Africa, as announced on June 23. It also includes an additional $246.5 million to advance action in key areas, such as global health, gender equality, and sexual and reproductive health.</p>\n\n<p>This total comprises $94&nbsp;million in funding for education, including,</p>\n\n<ul>\n\t<li>$80 million for the Canadian International Development Scholarship 2030.</li>\n\t<li>$7.8 million over three years for the renewal of long-term institutional support (LTIS) to the <a href=\"https://www.col.org/\">Commonwealth of Learning</a>, based in Burnaby, British Columbia.</li>\n\t<li>$6.2 million for Teaching and Learning in Fragile Contexts, an initiative to improve primary school learning outcomes in Liberia and Sierra Leone.</li>\n</ul>\n\n<p>It also includes $120 million for 11 initiatives that will support gender equality, empowering women and girls, sexual and reproductive health and rights in Commonwealth countries, including but not limited to the following projects:</p>\n\n<ul>\n\t<li>$27 million to Partners for Municipal Innovation - Women in Local Leadership.</li>\n\t<li>$20 million in continued support to Nigeria in sexual and reproductive health and rights, particularly in neglected regions.</li>\n\t<li>$15.5 million for Artificial Intelligence (AI) and Global Health.</li>\n</ul>\n\n<p>The Prime Minister underlined Canada’s commitment to further support efforts to tackle climate change and strengthen peace and security throughout the African continent by announcing $32.5 million.</p>\n\n<p>On the margins of the CHOGM, Prime Minister Trudeau also underscored Canada’s commitment to fostering trade and investment with its Commonwealth partners in Africa with the signing the Canada-Rwanda Air Transport Agreement (ATA). Expanding Canada’s air transport relationships improves connectivity to new and existing destinations, which benefits passengers and businesses. The Prime Minister also took the opportunity to welcome private sector agreements valued at up to $148 million in Botswana, Cameroon, Ethiopia, Kenya, and Zambia. Expanding trade and investment with African countries is crucial to our shared economic recovery, with expanded trading partnerships and more diversified supply chains that create jobs and grow the middle class.</p>\n\n<p>In Kigali, Canada announced our intention to expand Canadian representation on the African continent to further strengthen our relationships. The Canadian office in Rwanda will be converted into a High Commission, increasing its diplomatic capacity to help promote our diverse partnerships, and the broad range of our shared interests and cooperation. Canada is also establishing a dedicated mission and permanent observer to the African Union in Addis Ababa, which will bring a renewed focus to our relationship with African partners and strengthen ongoing efforts on our shared priorities.&nbsp; With complex peace and security challenges around the world, now is the time to increase our support towards regional security and peace.</p>\n\n<p>At the conclusion of the summit, heads of government issued their communiqué on “Delivering a Common Future: Connecting, Innovating, Transforming,” which affirms a renewed commitment to free and democratic societies and the promotion of peace. Commonwealth leaders also re-elected Patricia Scotland as the Commonwealth Secretary-General and also agreed to a set of reforms to modernize the Commonwealth and improve its governance, and looked forward to their timely implementation.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“This is a critical time. Now more than ever, countries need to come together to stand up for Ukraine, while addressing the global impacts of Russia’s illegal invasion – like food security and affordability. We’re also focused on growing our relationships with Commonwealth countries, including Rwanda, to create good jobs and growth for the middle class that benefit everyone, while we continue fighting climate change together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>At the summit, the Prime Minister participated in an intergenerational dialogue breakfast with the Commonwealth Youth Council.</li>\n\t<li>The Prime Minister also participated in the Commonwealth Business Forum’s Heads of Government and Business Leaders Roundtable. The Roundtable was co-chaired by President Paul Kagame and HRH the Prince of Wales.</li>\n\t<li>The Prime Minister participated in a side event entitled Keeping 1.5 Alive – The Glasgow Climate Pact and Building Momentum towards COP27, co-hosted by Rwanda and the United Kingdom.</li>\n\t<li>The modern Commonwealth is a values-based association of 54 countries, most with historic links to the United Kingdom and home to over 2.4&nbsp;billion citizens over five continents.</li>\n\t<li>Canada is the second largest donor to the Commonwealth and contributed a total of $10.86 million to the organization in 2021-22.</li>\n\t<li>This year, leaders met under the theme “Delivering a Common Future: Connecting, Innovating, Transforming” to discuss how to improve the lives of the citizens of the Commonwealth’s 54 countries.</li>\n\t<li>During the summit, Prime Minister Trudeau also held bilateral meetings with the President of Rwanda, Paul Kagame, the Prime Minister of Antigua and Barbuda, Gaston Browne, the President of Ghana, Addo Dankwa Akufo-Addo, the President of Kenya, Uhuru Kenyatta, the President of Zambia, Hakainde Hichilema.</li>\n\t<li>On June 23, 2022, Prime Minister Trudeau paid his respects to the victims of the genocide committed against the Tutsi in Rwanda at the Kigali Genocide Memorial.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/06/25/canada-announces-key-projects-while-commonwealth-heads-government\">Canada announces key projects while at the Commonwealth Heads of Government Meeting</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.chogm2022.rw/\">CHOGM RWANDA2022</a> (in English only)</li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/23/prime-minister-trudeau-announces-canadian-support-address-global-food\">Prime Minister Trudeau announces Canadian support to address global food security crisis</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/06/minister-joly-announces-expansion-of-diplomatic-relations-with-rwanda-and-appointment-of-new-ambassador-to-african-union.html\">Minister Joly announces expansion of diplomatic relations with Rwanda and appointment of new ambassador to African Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kenya/bilateral_relations_bilaterales/canada_rwanda.aspx?lang=eng\">Canada-Rwanda relations</a></li>\n\t<li><a href=\"https://au-afcfta.org/about/\">African Continental Free Trade Area</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}