{
  "path": "/en/news/statements/2017/08/19/statement-prime-minister-75th-anniversary-dieppe-raid",
  "pageTitle": "Statement by the Prime Minister on the 75th Anniversary of the Dieppe Raid | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 75<sup>th</sup>&nbsp;anniversary of the Dieppe Raid:</p><p>“75 years ago to this day, almost 5,000 Canadian soldiers, together with their British and American allies, landed in occupied France, on the shores around the town of Dieppe. Today, we remember the Canadians who sacrificed greatly in this dramatic chapter of the Second World War.</p><p>“The soldiers were there to test German defences and gather important intelligence, but the raid ended in tragedy. After nine hours, pinned down under enemy fire, the Allies withdrew. Only 2,210 Canadians returned to Great Britain, many of whom were wounded. Nearly 2,000 were taken as prisoners of war, most remaining in captivity until the end of the conflict. In total, 916 Canadians were killed in the operation.</p><p>“Despite these brutal losses, the Canadians showed extraordinary heroism that day. Honorary Captain John Weir Foote of the Royal Hamilton Light Infantry braved enemy bullets to bring wounded soldiers to first aid posts. Lieutenant Colonel Charles Cecil Merritt of the South Saskatchewan Regiment led his men in a dangerous bridge crossing, and then helped many of them to return to the beaches through a brilliant rearguard action. Both men remained behind rather than take the chance to escape. For their bravery and sacrifice, they were awarded the Victoria Cross.</p><p>“The courage and steadfastness of these soldiers, and of so many others, exemplified the Canadian and Allied response after the raid. The operation at Dieppe was the most devastating day of the entire Second World War for the Canadian military. Yet it taught the Allies invaluable lessons – which, less than two years later, they used to help turn the tide of the war on D-Day.</p><p>“As we commemorate the Dieppe Raid at events in <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/second-world-war/dieppe-raid/75-anniversary/events-in-canada\">Canada</a> and <a href=\"http://www.veterans.gc.ca/eng/remembrance/history/second-world-war/dieppe-raid/75-anniversary/events-in-france\">France</a>, I ask all Canadians to honour the people who gave so much at Dieppe, as well as their families at home who suffered the loss of their loved ones. Their story teaches us that our finest moments are often about overcoming challenges and defeats, rather than easy victories.</p><p>“On behalf of the Government of Canada, I thank all our veterans and those who gave their lives at Dieppe for their profound service, courage, and sacrifice.</p><p>“Lest we forget.”</p></div>\n      "
}