{
  "path": "/en/news/readouts/2022/02/18/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the United States of America Joe Biden and European leaders on Russia and the situation in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden, and the leaders of the United Kingdom, France, Germany, Italy, Poland, Romania, the European Commission, the European Council, and the North Atlantic Treaty Organization (NATO), to discuss the ongoing Russian military build-up on Ukraine’s borders.</p>\n\n<p>The leaders shared their concerns over ceasefire violations by Russia-backed separatists in the Donbas region, condemned Russia’s aggressive and destabilizing actions in and around Ukraine, and stressed the need for Russia to de-escalate and find a diplomatic solution to the current tensions. They expressed their collective commitment to the sovereignty and territorial integrity of Ukraine.</p>\n\n<p>The Prime Minister noted the strength and unity of the NATO Alliance. The leaders emphasized that any further military incursion into Ukraine would have severe costs and consequences, including through coordinated sanctions.</p>\n\n<p>The leaders agreed to continue coordinating closely.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/15/prime-minister-justin-trudeau-speaks-president-european-commission-ursula\">Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/12/prime-minister-justin-trudeau-speaks-president-european-council-charles\">Prime Minister Justin Trudeau speaks with President of the European Council Charles Michel</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/11/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with President of the United States of America Joe Biden and European leader on Russia and the situation in Ukraine</a></li>\n</ul></div>\n      "
}