{
  "path": "/en/news/statements/2021/01/01/statement-prime-minister-haitis-independence-day",
  "pageTitle": "Statement by the Prime Minister on Haiti’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Haiti’s Independence Day:</p>\n\n<p>“Today, we join the Haitian community in Canada and around the world in marking Haiti’s Independence Day.</p>\n\n<p>“For a long time, Canada and Haiti have been united by a strong friendship. This friendship has grown stronger over time as a result of the close ties between our people, a common language, and a long history of cooperation, especially within several international organizations. By sharing its culture and traditions, the Haitian community in Canada also continually enriches our country.</p>\n\n<p>“The current global COVID‑19 pandemic reminds us more than ever of the importance of solidarity. This is why, by working with our partners, the Government of Canada will continue to help Haiti strengthen its national systems and assist in the timely distribution of COVID‑19 vaccines.</p>\n\n<p>“In Canada, members of the Haitian community have made an exceptional contribution to the pandemic response. Many have been on the front lines helping our most vulnerable. I would like to thank them, from the bottom of my heart. We will always remember their courage and the tremendous sacrifices they have made.</p>\n\n<p>“Unfortunately, this year, we will not be able to all come together to share a traditional soup&nbsp;joumou as part of the celebrations on January&nbsp;1. However, we can still mark this important day in other ways, while following public health guidelines.</p>\n\n<p>“On behalf of the Government of Canada, I offer my best wishes to the Haitian community celebrating Haiti’s Independence Day today.”</p></div>\n      "
}