{
  "path": "/en/news/statements/2017/12/06/statement-prime-minister-100th-anniversary-halifax-explosion",
  "pageTitle": "Statement by the Prime Minister on the 100th anniversary of the Halifax Explosion | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 100<sup>th</sup> anniversary of the Halifax Explosion:</p><p>“Today, we mark the 100<sup>th</sup> anniversary of the Halifax Explosion.</p><p>“On the morning of December 6, 1917, in the midst of the First World War, the munitions ship SS <i>Mont-Blanc</i> and the freighter SS<i> Imo</i> collided in the narrows of Halifax Harbour. The SS <i>Mont-Blanc</i> caught fire and erupted in an explosion that levelled the north end of Halifax – changing the city forever.</p><p>“It was the largest human-made explosion before the atomic bomb, and remains one of the deadliest disasters in Canadian history. Nearly 2,000 people were killed in the blast, including hundreds of children. Thousands more were gravely injured. Half the city’s population was left without shelter in the immediate aftermath.</p><p>“The tragedy devastated Halifax, but Nova Scotians, like Vincent Coleman, responded with resilience and courage. A railway dispatcher, Coleman gave his life to warn incoming trains of the danger. Soldiers, sailors, police, firefighters, and hundreds of civilians rushed to the disaster zone to help the injured and rescue those trapped under debris. Communities across the province and country offered support, and help poured in from friends beyond our borders – from Massachusetts to Australia. Together, Nova Scotians recovered, rebuilt, and emerged stronger than before.</p><p>“On behalf of the Government of Canada, I invite Canadians to honour the memory of the victims of this terrible tragedy and those who came to Halifax’s aid. As the 150<sup>th</sup> anniversary of Confederation draws to a close, let us reflect on this powerful example of Canadians overcoming hardship and tragedy with perseverance and compassion.”</p></div>\n      "
}