{
  "path": "/en/news/statements/2022/01/01/statement-prime-minister-haitis-independence-day",
  "pageTitle": "Statement by the Prime Minister on Haiti’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Haiti’s Independence Day:</p>\n\n<p>“Today, we join Haitian communities in Canada and around the world to celebrate Haiti’s Independence Day.</p>\n\n<p>“This day has always been significant for Haitians, people of African descent, and many other people around the world. On this day in 1804, Haiti made history by becoming the first Black-led independent country in the world, and the first country in the Western Hemisphere to abolish slavery. Since then, the first day of the year is celebrated by the people of Haiti and Haitian communities around the world as Haiti’s Independence Day.</p>\n\n<p>“Canada and Haiti officially established diplomatic relations in 1954. Since then, our two countries have enjoyed a strong relationship, strengthened by our geographical proximity, shared language, and close people-to-people ties. Today, more than 165,000 people of Haitian ancestry call Canada home, and help make our country stronger, more prosperous, and more inclusive. This year, as we continue to follow public health guidelines to keep each other and our communities safe from COVID-19, I encourage all those celebrating to find alternative ways to mark this important day.</p>\n\n<p>“Canada and Haiti work together as part of international organizations, including the United Nations, the Organization of American States, the Caribbean Community (CARICOM), and La Francophonie. Additionally, for nearly 30 years, Canada has contributed to every United Nations peace mission to Haiti to support stabilization and reconstruction efforts. This includes financial assistance and the deployment of members of the Canadian Armed Forces and the Royal Canadian Mounted Police, and correctional officers.</p>\n\n<p>“Canada will continue to support Haiti’s efforts to strengthen its governance, the rule of law, and democracy. We will also work with Haiti to improve the well-being of its citizens, particularly women and girls, notably through support to national health, education and protection systems, and the fight against COVID-19. We will continue to encourage initiatives that foster economic growth that works for everyone and a greater resilience to climate change and natural disasters. Every day, Haitians continue to demonstrate strength in the face of adversity, and Canada remains committed to working with them as they build toward a better tomorrow.</p>\n\n<p>“On behalf of the Government of Canada, I extend my best wishes to all those celebrating Haiti’s Independence Day.”</p></div>\n      "
}