{
  "path": "/en/news/news-releases/2020/05/15/prime-minister-announces-support-research-staff-canada",
  "pageTitle": "Prime Minister announces support for research staff in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From life-saving cancer treatments to clean technologies that protect our environment, thousands of research staff in Canada are driving discoveries and innovations that support our well-being and our economy. When we need them the most, many members of Canada’s academic research community have been forced to temporarily suspend their work due to COVID-19. To ensure they can keep their jobs, safeguard their research, and continue their important work after this crisis, the Government of Canada is stepping up to support them.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced $450 million in funding to help Canada’s academic research community during the COVID-19 pandemic. The investment will:</p>\n\n<ul>\n\t<li>Provide wage supports to universities and health research institutes, so they can retain research staff who are funded from industry or philanthropic sources and are unable to access some of the government’s existing COVID-19 support measures. This would apply even if their work has been temporarily suspended. The government will provide up to 75 per cent per individual, with a maximum of $847 per week.</li>\n\t<li>Support universities and health research institutes to maintain essential research-related activities during the crisis, and to ramp back up to full research operations once physical distancing measures are lifted. This will cover up to 75 per cent of total eligible costs, and will support activities such as the safe storage of dangerous substances, and restarting data sets that were interrupted during the pandemic.</li>\n</ul>\n\n<p>This investment is part of the Government of Canada’s COVID-19 Economic Response Plan, which has helped protect Canadian jobs, and committed billions in support to Canadians and businesses facing hardship as a result of the pandemic. It will help sustain Canada’s research excellence and protect our research talent, in support of the COVID-19 response and the post-pandemic economic recovery.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Research staff in Canada are the source of new innovations and ideas that help keep us healthy, protect our environment, and drive our economy. We are fortunate to have some of the world’s brightest minds. Today, we are making sure Canadian universities and health research institutes have the support they need to sustain their research capacity through this difficult situation, and continue to attract and retain talent, for the benefit of all Canadians.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Research personnel in our universities and health research institutes are significant drivers of science, discovery, and innovation in Canada. By providing these institutions with immediate support, we continue to nurture Canada’s talent pipeline and sustain our innovation capacity, while helping to mitigate the negative impacts of COVID-19 on the research community.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada’s three federal granting agencies – the Social Sciences and Humanities Research Council (SSHRC), the Natural Sciences and Engineering Research Council (NSERC), and the Canadian Institutes of Health Research (CIHR) – support research, research training, and innovation in Canadian postsecondary institutions.</li>\n\t<li>All Canadian universities and health research institutes that are eligible for funding through these federal granting agencies, and ineligible for other COVID-19 emergency wage measures, will be able to access support through this temporary program. The funding will be delivered as a block grant, so institutions can access help quickly to address their most pressing needs.</li>\n\t<li>On April 22, 2020, the Government of Canada committed $291.6 million to maintain income support for research trainees (students and postdoctoral fellows) and research staff at Canadian universities who are supported by federal grants, to support those facing economic hardships due to pandemic-related closures and pressures.</li>\n\t<li>On March 11, 2020, the Government of Canada announced a $1-billion package to help Canadians cope with the COVID-19 outbreak, which included $275 million for coronavirus research and medical countermeasures, and $50 million to ensure adequate supplies of personal protective equipment for provinces and territories, as well as to address federal needs.</li>\n\t<li>Government of Canada investments in research capacity also include $54.2 million for 99 COVID-19 research projects that focus on medical and social countermeasures. This supports researchers across the country working on developing and implementing measures to rapidly detect, manage, and reduce the transmission of COVID-19.</li>\n\t<li>On April 23, 2020, further medical countermeasures investments were announced that flow funding to researchers across the country to conduct COVID-19 research, such as:\n\t<ul>\n\t\t<li>$23 million to the University of Saskatchewan’s Vaccine and Infectious Disease Organization-International Vaccine Centre (VIDO-InterVac)</li>\n\t\t<li>$40 million for the Canadian COVID-19 Genomics Network (CanCOGeN)</li>\n\t\t<li>support for the COVID-19 Immunity Task Force</li>\n\t\t<li>$10.3 million over two years, and $5 million ongoing, for the Canadian Immunization Research Network</li>\n\t\t<li>$114.9 million for research through the Canadian Institutes of Health Research</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/22/support-students-and-new-grads-affected-covid-19\">Support for students and new grads affected by COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/063.nsf/eng/h_FEE7261A.html\">Selecting the Appropriate Federal Granting Agency</a></li>\n</ul></div>\n      "
}