{
  "path": "/en/news/statements/2022/06/24/statement-prime-minister-la-fete-nationale-du-quebec",
  "pageTitle": "Statement by the Prime Minister on la Fête nationale du Québec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on la Fête nationale du Québec:</p>\n\n<p>“Today, my family and I join millions of Quebecers to mark la Fête nationale du Québec and to celebrate our identity and heritage.</p>\n\n<p>“As Quebecers, we can be proud of our history and our beautiful French language. These are the roots of a unique culture that binds us together, from Rimouski to Val‑d’Or, from Montréal to Sherbrooke. In order to keep this identity alive and to allow it to grow, the Government of Canada introduced a <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/canadians-official-languages-act.html\">bill</a> in March to modernize the <em>Official Languages Act</em> and achieve substantive equality between our official languages. This legislation will allow the government to strengthen, protect, and promote the French language across the country.</p>\n\n<p>“Quebec has been an integral part of Canada’s history since its founding. When it comes to equality, justice, and democracy, Quebec is often a leader. Today, Quebec talent in areas ranging from sports and cinema to artificial intelligence makes all Canadians proud.</p>\n\n<p>“This year we can once again enjoy the festivities on the Plains of Abraham in Quebec City, in the Quartier des Spectacles in Montréal, and with our loved ones throughout Quebec.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish all Quebecers a wonderful Fête nationale du Québec. Let’s be proud of who we are and what we have accomplished, and let’s continue to work together to build a more just, green, and prosperous society.”</p></div>\n      "
}