{
  "path": "/en/news/readouts/2020/03/10/prime-minister-justin-trudeau-meets-chairman-presidency-bosnia-and",
  "pageTitle": "Prime Minister Justin Trudeau meets with the Chairman of the Presidency of Bosnia and Herzegovina Željko Komšić | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Željko Komšić, Chairman of the Presidency of Bosnia and Herzegovina.&nbsp;</p>\n\n<p>Prime Minister Trudeau and Chairman Komšić spoke about the positive bilateral relationship between Canada and Bosnia and Herzegovina, including a long history of friendship and significant people-to-people ties.</p>\n\n<p>The Prime Minister and the Chairman discussed their shared interest in sustaining peace and stability in the Balkans. They agreed on the importance of continuing efforts to strengthen democracy and promote social and economic development. The leaders discussed expanding bilateral economic cooperation, including with respect to opportunities for enhanced trade and investment. Prime Minister Trudeau and Chairman Komšić also exchanged views on shared multilateral priorities and agreed on the benefits of Trans-Atlantic partnerships to advance international peace and prosperity.</p>\n\n<p>The two leaders spoke about efforts in both countries and in partnership with the international community to respond to the health and economic impacts of COVID-19.</p>\n\n<p>Prime Minister Trudeau and Chairman Komšić look forward to continuing collaboration to further strengthen Canada and Bosnia and Herzegovina relations.</p>\n\n<p>Canada has played a significant role in Bosnia and Herzegovina’s security and development, including in the areas of peacekeeping, reconstruction, and the promotion of good governance and the rule of law.</p>\n\n<p>There are approximately 25,000 Canadians of Bosnian ancestry<em>.</em></p>\n\n<p>Canada continues to work with the government of Bosnia and Herzegovina and the international community toward the full implementation of the 1995 Dayton Peace Agreement.</p>\n\n<h2>Associated links:</h2>\n\n<p><a href=\"https://www.canadainternational.gc.ca/hungary-hongrie/bilateral_relations_bilaterales/bosnia-bosnie.aspx?lang=eng\">Canada - Bosnia and Herzegovina relations</a></p></div>\n      "
}