{
  "path": "/en/news/news-releases/2019/07/29/kitsilano-coast-guard-base-enhances-ocean-protection-bc-coast",
  "pageTitle": "Kitsilano Coast Guard base enhances ocean protection on B.C. coast | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Canadian Coast Guard saves lives, protects the environment, and helps our economy grow, while keeping our waters safe, secure, and open. That is why, in 2016, the Government of Canada reopened the Coast Guard base in Kitsilano, British Columbia, and began work to modernize, expand, and improve the station. It is also why, earlier this year, we announced an investment of $15.7 billion to renew the Coast Guard fleet.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the completion of major renovations to the Coast Guard base in Kitsilano, British Columbia. With the enhanced, reopened station, the Coast Guard can respond more quickly and efficiently to emergencies on our waterways, and strengthen its environmental response operations on the West Coast.</p>\n\n<p>The crew at the Kitsilano Coast Guard base has already been working hard to keep B.C.’s waterways clean and safe. Since its reopening, the base has conducted 345 environmental response operations and over 830 search and rescue missions in the Greater Vancouver Area.</p>\n\n<p>The Prime Minister also announced today that the CG 158 response boat based permanently at Kitsilano has been named the <em>CCGS Laredo Sound</em>, after an ocean passage off the scenic central coast of B.C<em>.</em><em> </em>This vessel was added to the Coast Guard fleet in Vancouver in 2017, and significantly improves response times for environmental incidents and search and rescue missions in all weather conditions.</p>\n\n<p>These investments build on the Government of Canada’s Oceans Protection Plan, a historic, $1.5 billion investment to safeguard our oceans, coasts, and coastal communities.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The Canadian Coast Guard does essential and often life-saving work. By reopening and renovating the Kitsilano base, we’re making sure the Coast Guard has the modern facilities and equipment they need. As the climate crisis places more demand on the Coast Guard, we can count on them to keep serving Canadians – protecting our environment, growing our economy, and keeping our waters safe, secure, and open.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Since 2015, our government has made historic investments in the Canadian Coast Guard to ensure it has the tools it needs to protect our oceans and coastal waters. These investments include our $1.5 billion Oceans Protection Plan, and the renewal of the Coast Guard fleet. Today’s reopening of the Kitsilano Coast Guard base ensures that we are well equipped to serve people in the busy Vancouver harbour and surrounding areas. The improvements will also ensure the Coast Guard is able to respond quickly to marine incidents and help protect British Columbia’s beautiful coast.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The main building at the Kitsilano base underwent significant renovations, including a new roof, the replacement of exterior cladding and steel girders, and the installation of new windows. The interior building was renovated to include a training room that can also be used as an incident command post, and additional sleeping quarters for up to six crew members.</li>\n\t<li>The renovations include enhanced marine infrastructure with new and larger floating docks to house gear, heaters, and medical supplies in support of environmental response operations, equipment cleaning, and training exercises.</li>\n\t<li>The base enhances training for Indigenous first responders and other response partners in the Greater Vancouver Area. The Coast Guard will also deliver 24&nbsp;incident response training courses this year, a number of which will be delivered in the new training room at the Kitsilano base.</li>\n\t<li>In May 2019, the Prime Minister announced the renewal of the Coast Guard fleet, with up to 18 new large ships built in Canadian shipyards. The announcement also included investments in vessel life extensions, refits, and maintenance work so the fleet can continue to deliver critical missions while new ships are being built.</li>\n\t<li>The Government of Canada continues to take action across the country to keep our waters safe and our coasts clean, anchored in its historic $1.5 billion <a href=\"https://www.tc.gc.ca/eng/report-canadians-investing-coasts-oceans-protection-plan.html\">Oceans Protection Plan</a>.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/fisheries-oceans/news/2016/08/kitsilano-canadian-coast-guard-base-formally-opens-with-an-enhanced-marine-safety-mandate.html\">Kitsilano Canadian Coast Guard Base Formally Opens with an Enhanced Marine Safety Mandate</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/22/prime-minister-announces-renewal-canadian-coast-guard-fleet\">Prime Minister announces renewal of Canadian Coast Guard fleet</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}