{
  "path": "/en/news/statements/2017/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p><p>“Today, on International Youth Day, we celebrate the limitless potential of young people.&nbsp;We put a spotlight on their ideas and aspirations, which have the power to change the world. We are inspired by their courage, passion, and the positive change they make every day.</p><p>“The theme of this year’s International Youth Day – Youth Building Peace – emphasizes how young leaders can help move societies beyond conflict and violence by promoting gender equality, inclusion, and education. Earlier this year, I had the opportunity to meet one of these young peace builders, Malala Yousafzai. Her relentless and inspiring work reminds us that young people are not just the leaders of tomorrow – they are leaders today.</p><p>“Listening to and appreciating the diverse views of young people will help us turn the vision of a more peaceful and prosperous planet into a reality. That is why we have taken concrete steps like creating the <a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a> to give young people a voice in decisions that will shape their lives, their communities, and their country.</p><p>“As Minister of Youth, I know that young people everywhere are trying to make a difference. We must continue to amplify their voices, give them a seat at the table, and connect them with opportunities. Our future success depends on it.</p><p>“On behalf of the Government of Canada, Sophie and I extend our best wishes to all celebrating International Youth Day.”</p></div>\n      "
}