{
  "path": "/en/news/news-releases/2021/07/16/prime-minister-meets-apec-economic-leaders",
  "pageTitle": "Prime Minister meets with APEC Economic Leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today participated in a virtual meeting with leaders of the Asia-Pacific Economic Cooperation (APEC) ahead of the formal gathering in November, to discuss the response and the recovery to the COVID-19 health and economic crisis.</p>\n\n<p>As the pandemic continues to impact people and economies around the world, efforts to diagnose and treat COVID-19 continue to be a priority. To truly end the pandemic in our own countries, we must end it everywhere. That’s why APEC economic leaders recognized the need to speed up access to safe, effective, and affordable COVID-19 vaccines to overcome this health crisis. Together, they made a firm commitment to redouble their efforts to expand vaccine manufacturing and supply, support global vaccine sharing efforts, and encourage agreements to transfer vaccine production technologies to countries that need them most.</p>\n\n<p>Working together as APEC partners during the recovery will be vital to creating jobs and economic growth, and providing opportunities for those who have been disproportionately impacted by the pandemic, including women, racialized groups, and Indigenous peoples. The leaders underlined the importance of trade and investment and stable supply chains, to tackling the impact of the COVID-19 pandemic and building a strong economic recovery that works for everyone. &nbsp;They also agreed on the need to continue pursuing sound economic policies to sustain jobs, grow the middle class, increase economic productivity, and advance innovation.</p>\n\n<p>The APEC leaders also committed to moving toward a digital future and closing the digital gap that exists around the world. While the acceleration of new technologies brought on by the pandemic is positive, we still have work to do to ensure everyone has proper access to these technologies and skills. By strengthening digital infrastructure and technologies and supporting measures designed to foster digital transformation we will contribute to bridging the digital divide and increase digital literacy and skills.</p>\n\n<p>We can only find real solutions to the challenges of today and tomorrow if we work together. Canada will continue to engage with our global partners so we can finish the fight against COVID-19, create new jobs and grow the middle class, and build a better world for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Today’s meeting helped lay the foundation for the APEC Economic Leaders’ Meeting in November, and reaffirmed our commitment to tackle global challenges together and build back better from this health and economic crisis. Canada will continue to work closely with Asia-Pacific partners to overcome COVID-19 challenges, create jobs and growth, and build a recovery that works for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada is a founding member of APEC. Established in 1989, APEC is a multilateral forum dedicated to promoting free trade and investment, economic growth and development, and cooperation in the Asia-Pacific region.</li>\n\t<li>With a membership of 21 economies worldwide, APEC’s primary goal is to support sustainable economic growth and prosperity in the Asia-Pacific region.&nbsp;</li>\n\t<li>New Zealand chaired the informal meeting of APEC leaders ahead of a formal gathering in November. This is the first time in APEC history that such an additional meeting has been held.</li>\n\t<li>Putrajaya Vision 2040 is APEC’s vision for an open, dynamic, resilient and peaceful Asia-Pacific community, which focuses on three economic drivers: trade and investment, innovation and digitalization, and strong, balanced, secure, sustainable, and inclusive growth.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"/en/news/statements/2021/07/16/apec-economic-leaders-statement-overcoming-covid-19-and-accelerating\">APEC Economic Leaders’ Statement: Overcoming COVID-19 and Accelerating Economic Recovery</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"http://international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"http://www.apec.org/\">Asia-Pacific Economic Cooperation</a></li>\n\t<li><a href=\"https://www.apec.org/Meeting-Papers/Leaders-Declarations/2020/2020_aelm/Annex-A\">APEC Putrajaya Vision 2040</a></li>\n</ul></div>\n      "
}