{
  "path": "/en/news/news-releases/2021/06/28/prime-minister-announces-appointment-honourable-mahmud-jamal-supreme",
  "pageTitle": "Prime Minister announces the appointment of the Honourable Mahmud Jamal to the Supreme Court of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Mahmud Jamal to the Supreme Court of Canada, effective July 1, 2021.</p>\n\n<p>Justice Jamal had a distinguished career as a litigator with a deep commitment to pro bono work prior to his appointment to the Court of Appeal for Ontario in 2019. He appeared before various provincial courts and in 35 appeals before the Supreme Court of Canada, addressing a wide range of civil, constitutional, criminal, and regulatory issues. He also taught constitutional law at McGill University and administrative law at Osgoode Hall Law School. He is bilingual.</p>\n\n<p>This appointment is the fourth under the Supreme Court selection process launched by the Government of Canada in 2016. Through this process, an independent and non-partisan advisory board chaired by the Right Honourable Kim Campbell was tasked with identifying candidates.</p>\n\n<p>Justice Jamal will fill the vacancy created by the upcoming retirement of Justice Rosalie Silberman Abella.</p>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2021/06/28/honourable-mahmud-jamal\">The Honourable Mahmud Jamal</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://fja-cmf.gc.ca/scc-csc/2021/nominee-candidat-eng.html\">Candidate questionnaire filled out by the Honourable Mahmud Jamal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/06/17/prime-minister-announces-nomination-honourable-mahmud-jamal-supreme\">Prime Minister announces the nomination of the Honourable Mahmud Jamal to the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/19/prime-minister-launches-process-select-next-justice-supreme-court\">Prime Minister launches process to select the next justice of the Supreme Court of Canada</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/index-eng.html\">Supreme Court of Canada Appointment Process</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/qualifications-eng.html\">Qualifications and Assessment Criteria for Supreme Court of Canada Appointments</a></li>\n\t<li><a href=\"https://www.fja-cmf.gc.ca/scc-csc/2021/questions-eng.html\">Frequently Asked Questions</a></li>\n\t<li><a href=\"https://www.scc-csc.ca/home-accueil/index-eng.aspx\">Supreme Court of Canada</a></li>\n</ul></div>\n      "
}