{
  "path": "/en/news/news-releases/2020/08/26/prime-minister-announces-support-safe-return-school",
  "pageTitle": "Prime Minister announces support for a safe return to school | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>School is critical for kids’ development and future success. The COVID-19 pandemic has been difficult for families, with schools closed and students separated from their classmates and friends. As we gradually and safely restart our economy, parents should be able to return to work and trust that their children are learning in a healthy environment. That is why the Government of Canada is working to support provinces and territories in their efforts to ensure a safe return to school and protect the health of students and staff.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced up to $2 billion in support for provinces and territories through the Safe Return to Class Fund. This will provide the complementary funding they need, as they work alongside local school boards to ensure the safety of students and staff members throughout the school year. For example, the Fund will help provinces and territories by supporting adapted learning spaces, improved air ventilation, increased hand sanitation and hygiene, and purchases of personal protective equipment and cleaning supplies.</p>\n\n<p>The Prime Minister also announced an additional $112 million in funding for First Nations to support community measures to ensure a safe return to school on reserves. The government will continue to work with First Nation partners to help protect the health and safety of students and staff this school year.</p>\n\n<p>As we reopen our schools and restart our economy, we will continue to take leadership and work together with provincial and territorial partners to protect the health and safety of all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“As a former teacher and a parent, I know first-hand the importance of school for kids’ social development and mental well-being, not to mention their ability to learn. The return to school is also an important step to restart our economy and get parents back to work while not worrying about the health of their children. The Government of Canada will remain a close partner to provinces, territories, and First Nations as we work together to keep children, families, and all Canadians safe and healthy during this difficult time.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s children have shown immense strength throughout this global pandemic. With a new school year about to begin, our government is committed to helping ensure that Canada’s students and teachers can safely return to their classrooms.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“The past few months have been especially hard on students who have been physically separated from their friends and classmates, and on parents who have had to juggle work and childcare. Provinces and territories have all been working hard to get students, teachers, and staff safely back to school, and the federal government wants to support them in that work. This funding will help provinces and territories in their tireless efforts in creating healthy and safe learning environments for our children and educators as we start a school year unlike any other.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know that schools, students, and parents have been significantly impacted across the country as a result of the COVID-19 pandemic. This investment will enable First Nations to take action on First Nation-led plans and preparations for the safe reopening of their schools in a way that both follows public health guidance and continues to support students.”</p>\n\n<footer class=\"default\">The Hon. Marc Miller, Minister of Indigenous Services</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know families are worried about sending their children back to school. The COVID‑19 pandemic has put pressure on our schools and on families. That is why today’s announcement is so important. It will help schools across Canada have the support and equipment they need to keep kids, teachers, and families safe.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Funding will be provided to provinces and territories in two instalments, with a first disbursement in Fall 2020 and additional funding available for early 2021, to ensure that provinces and territories have support for the whole school year.</li>\n\t<li>The funding by province and territory will be allocated based on the number of children aged between 4 and 18 years old, with a $2 million base amount provided to each jurisdiction.</li>\n\t<li>Maximum total allocation by province and territory:\n\t<ul>\n\t\t<li>Alberta: $262.84 million</li>\n\t\t<li>British Columbia: $242.36 million</li>\n\t\t<li>Manitoba: $85.41 million</li>\n\t\t<li>New Brunswick: $39.79 million</li>\n\t\t<li>Newfoundland and Labrador: $26.18 million</li>\n\t\t<li>Northwest Territories: $4.85 million</li>\n\t\t<li>Nova Scotia: $47.88 million</li>\n\t\t<li>Nunavut: $5.75 million&nbsp;</li>\n\t\t<li>Ontario: $763.34 million</li>\n\t\t<li>Prince Edward Island: $10.39 million</li>\n\t\t<li>Quebec: $432.15 million</li>\n\t\t<li>Saskatchewan: $74.90 million</li>\n\t\t<li>Yukon: $4.16 million</li>\n\t</ul>\n\t</li>\n\t<li>The Safe Return to Class Fund is in addition to the more than $19 billion previously announced for the Safe Restart Agreement to help provinces and territories safely restart their economies. This agreement included funding to increase testing and contact tracing of the virus, support vulnerable Canadians, ensure the availability of safe child care, and provide income support for people who do not have paid sick leave so all Canadians can stay healthy.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/07/16/more-support-canadians-through-safe-restart-agreement\">More support for Canadians through the Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/28/prime-minister-releases-joint-statement-first-ministers-restarting\">Prime Minister releases joint statement by First Ministers for restarting the economy</a></li>\n</ul></div>\n      "
}