{
  "path": "/en/news/news-releases/2017/12/12/prime-minister-names-honourable-richard-wagner-new-chief-justice",
  "pageTitle": "Prime Minister names the Honourable Richard Wagner as new Chief Justice of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the Honourable Richard Wagner as the new Chief Justice of Canada.</p><p>Justice Wagner was called to the Quebec Bar in 1980 and practiced law until being appointed to the Quebec Superior Court in 2004. He sat in the Civil Division, the Commercial Division, and the Criminal Division of the Quebec Superior Court until 2011 when he was appointed to the Quebec Court of Appeal. He was first appointed as a Justice of the Supreme Court on October 5, 2012.</p><p>Following current Chief Justice Beverley McLachlin’s retirement on December 15, Justice Wagner will take the oath of office as Chief Justice and be sworn in as a member of the Queen’s Privy Council for Canada on December 18.</p><p><span lang=\"EN\" xml:lang=\"EN\">The Chief Justice fosters collegial decision-making on the Court, holds many leadership and administrative responsibilities, and represents the Canadian judiciary at home and abroad. </span>Before choosing the Chief Justice, the Prime Minister consulted with the Minister of Justice and Attorney General of Canada, the outgoing Chief Justice, and other leading members of the Canadian legal community.</p><h2>Quote</h2><blockquote><p>“It is an honour to name the Honourable Richard Wagner as the new Chief Justice of Canada. I have the utmost confidence in his ability to lead the highest court of Canada, an institution with a long and respected history of judicial independence and excellence. The judiciary, the legal profession, and all Canadians will be well served by his dedication to upholding the laws and Constitution upon which this country is founded.”<br>— <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Supreme Court of Canada consists of nine judges, including the Chief Justice.</li><li>The Chief Justice presides over all sittings of the Court when they are present and oversees the work of the Court by designating the panels of judges who hear the cases and motions brought before it.</li><li>In addition to their Court duties, the Chief Justice serves as chairperson of the Canadian Judicial Council, whose members include the chief justices and associate chief justices of the federal and provincial superior courts, the senior judges of the territorial superior courts, and the Chief Justice of the Court Martial Appeal Court of Canada.</li><li>The Chief Justice also chairs the committee that advises the Governor General on awards of membership in the Order of Canada and the Board of Governors of the National Judicial Institute, which develops and delivers various educational programs for judges in Canada.</li><li>Should the Governor General die, become incapacitated, be removed, or be absent from the country for a period of more than one month, the Chief Justice would also become the Administrator of Canada and exercise all the powers and authorities of the Governor General.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"http://www.scc-csc.ca/judges-juges/bio-eng.aspx?id=richard-wagner\">The Honourable Richard Wagner</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.scc-csc.ca/home-accueil/index-eng.aspx\">Supreme Court of Canada</a></li></ul></div>\n      "
}