{
  "path": "/en/news/news-releases/2019/09/04/prime-minister-announces-appointment-dominic-barton-ambassador-china",
  "pageTitle": "Prime Minister announces appointment of Dominic Barton as Ambassador to China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of Dominic Barton as Canada’s Ambassador to China.</p>\n\n<p>Mr. Barton chaired Canada’s Advisory Council on Economic Growth. He has directly advised Canada’s Cabinet, and served as a member of the Advisory Committee on the Public Service, which was established by former Prime Minister Stephen Harper. He is also the chancellor of the University of Waterloo. From 2009 to 2018, Mr. Barton was the global managing partner at McKinsey, where he gained vast experience in international business and trade – including as head of their office in Korea and as chairman in Asia, based in Shanghai.</p>\n\n<p>Mr. Barton graduated from the University of British Columbia with an Honours Bachelor of Arts in Economics, and studied as a Rhodes Scholar at Oxford University, where he obtained his Master of Philosophy in Economics. He also holds eight honourary doctorates from academic institutions around the world.</p>\n\n<p>As the senior Canadian diplomat in China, Mr. Barton will provide strategic guidance to the Prime Minister and represent the Government of Canada in the country.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I am pleased to announce Dominic Barton as Canada’s Ambassador to China. His years of experience in Asia, and the significant global economics expertise he has acquired over an impressive career, will make him a great choice to represent Canada – and Canadian interests – in China.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am pleased our government is today announcing the appointment of Dominic Barton as Canada’s Ambassador to China. An expert in the region, he is exceptionally well-suited to represent Canada and advance Canadian interests at this critical time. I would also like to thank Chargé d’Affaires Jim Nickel and the entire Canadian diplomatic team in Beijing for their incredible hard work, leadership, and continued service.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“It is an honour to be appointed as Canada’s Ambassador to China. The relationship between Canada and China is an important one, and I will work hard to represent our great country and to resolve the challenges that currently exist.”</p>\n\n<footer class=\"default\">Dominic Barton</footer>\n</blockquote>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/backgrounders/2019/09/04/dominic-barton\">Dominic Barton</a></li>\n</ul></div>\n      "
}