{
  "path": "/en/news/news-releases/2021/02/20/prime-minister-trudeau-and-president-biden-hold-first-meeting",
  "pageTitle": "Prime Minister Trudeau and President Biden to hold first meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will hold a bilateral meeting with the President of the United States of America, Joe Biden, on February 23, 2021. This will be the first bilateral meeting between Canada and President Biden’s administration. The two leaders will meet virtually.</p>\n\n<p>During the meeting, Prime Minister Trudeau and President Biden will advance shared priorities, and work together to end the global COVID-19 pandemic. They will discuss their shared vision for a strong economic recovery, growing the middle class and creating jobs, maintaining strong supply chains, climate change, our bilateral energy relationship, defence and security, and promoting diversity and inclusion. &nbsp;</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the United States share one of the strongest and deepest friendships between any two countries in the world. It is built on common values, strong ties between our people, and a shared geography. I look forward to my meeting with President Biden, where we will work together to end the COVID-19 pandemic and support people in both our countries.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the United States share one of the largest trading relationships in the world.</li>\n\t<li>Canada is the United States’ largest customer and buys more goods from the United States than China, Japan, and the United Kingdom combined.</li>\n\t<li>Canada is the top trading partner for most U.S. states.</li>\n\t<li>Canadian companies operating in the United States directly employ 725,000 Americans.</li>\n\t<li>Canada and the United States have worked side by side in the North American Aerospace Defence Command since the pact was created in 1957.</li>\n\t<li>The joint stewardship of the environment is a cornerstone of Canada-U.S. relations, from air and water quality to wildlife management. This includes at least 50 federal bilateral arrangements, more than 100 arrangements at the state and provincial level and the Boundary Waters Treaty of 1909.</li>\n\t<li>Canada is the largest supplier of all forms of energy to the U.S.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/01/22/prime-minister-justin-trudeau-speaks-president-united-states-america-joe\">Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/20/statement-prime-minister-canada-inauguration-joe-biden-president-united\">Statement by the Prime Minister of Canada on the inauguration of Joe Biden as President of the United States of America</a></li>\n\t<li><a href=\"https://www.cbsa-asfc.gc.ca/services/covid/menu-eng.html\">Coronavirus disease (COVID-19): Current border measures and requirements</a></li>\n</ul></div>\n      "
}