{
  "path": "/en/news/statements/2018/05/29/statement-prime-minister-international-day-united-nations-peacekeepers",
  "pageTitle": "Statement by the Prime Minister on the International Day of United Nations Peacekeepers | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the <a href=\"https://peacekeeping.un.org/en\">International Day of United Nations Peacekeepers</a>:</p><p>“Today, we honour United Nations (UN) peacekeepers, past and present, who have confronted instability and conflict around the globe, and sacrificed greatly in pursuit of peace, safety, and freedom for others.</p><p>“Canada has a long and proud history of peacekeeping. Our fourteenth Prime Minister, Lester B. Pearson, championed the first large-scale UN peacekeeping mission during the 1956 Suez Crisis. His leadership marked the beginning of Canada’s identity as a peacekeeping country, and paved the way for a new era of international cooperation to advance peace and stability around the world.</p><p>“Since then, the UN has established more than 70 peacekeeping missions – and Canadians have served in the majority of them. The nature of conflicts has evolved through the decades, and so too have the demands of peace operations.</p><p>“As UN peacekeepers work in increasingly difficult environments, their responsibilities have grown, become more complex, and often put them in harm’s way. Today, UN peacekeepers monitor ceasefires, supervise elections, help combatants disarm, repatriate refugees, clear landmines, and assist in the delivery of humanitarian aid. They put their lives on the line to protect those most in need, while giving societies a chance to rebuild.</p><p>“Canada has taken a leadership role to advance innovative approaches to peacekeeping and address the realities faced by peacekeepers today. Through the launch of the <a href=\"/en/news/backgrounders/2017/11/15/elsie-initiative-women-peace-operations\">Elsie Initiative</a>, and the <a href=\"/en/news/backgrounders/2017/11/15/vancouver-principles-peacekeeping-and-prevention-recruitment-and-use\">Vancouver Principles</a>, Canada is already leading the way to improve the effectiveness of UN peacekeeping missions, empower women in all aspects of peace and security, and protect children used as weapons of war.</p><p>“We have also committed new military capabilities, including an Air Task Force to the UN peacekeeping mission in Mali, and will continue to deploy civilian police officers to UN missions.</p><p>“On behalf of all Canadians, I commend UN peacekeepers for their courageous and selfless work to advance freedom, democracy, and the rule of law. We will continue to work closely with the UN to support and modernize peacekeeping operations, and find solutions to serious conflicts around the world.”</p></div>\n      "
}