{
  "path": "/en/news/statements/2021/03/08/statement-prime-minister-commonwealth-day",
  "pageTitle": "Statement by the Prime Minister on Commonwealth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Commonwealth Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days/commonwealth-day.html\">Commonwealth Day</a>, we join our Commonwealth partners around the world to celebrate the shared values and the strong bonds of cooperation and friendship that bind us together.&nbsp;&nbsp;</p>\n\n<p>“Commonwealth Day was spearheaded by Canadians and is observed every year on the second Monday in March. On this day, airports, military bases, and federal buildings will fly the Union Jack alongside the Canadian flag in recognition of our friendship with the United Kingdom and all members of the Commonwealth.</p>\n\n<p>“There are 54 members of the Commonwealth. They span from Europe, Africa, and Asia to the Caribbean, the Americas, and the Pacific, and include a diverse range of cultures. Headed by Her Majesty Queen Elizabeth II, the Commonwealth works to advance democracy, the rule of law, sustainable development, environmental protection, gender equality, and human rights. These values are critical for the prosperity and well-being of the more than 2.4 billion people who live in member countries.</p>\n\n<p>“The Commonwealth also helps our countries work together to overcome the challenges of today, and create a better future for all of our people and people of other countries. An example of this work, in line with this year’s theme – <em>Delivering a Common Future: Connecting, Innovating and Transforming</em> – is the Commonwealth of Learning, which is located in Burnaby, B.C., and helps further girls’ education around the world.</p>\n\n<p>“We look forward to the upcoming Commonwealth Heads of Government Meeting in Rwanda. The meeting will be an opportunity for Canada and other Commonwealth countries to work together to address the health, social, and economic impacts of the global COVID-19 pandemic. We will also continue to look for new, concrete ways to connect, innovate, and transform our societies so that everyone, particularly women and young people, can reach their full potential and succeed.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to celebrate Commonwealth Day and take this opportunity to learn more about our role in this organization.”</p></div>\n      "
}