{
  "path": "/en/news/statements/2022/08/31/statement-prime-minister-international-day-people-african-descent",
  "pageTitle": "Statement by the Prime Minister on the International Day for People of African Descent | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day for People of African Descent:</p>\n\n<p>“On the&nbsp;<a href=\"https://www.un.org/en/observances/african-descent-day\">International Day for People of African Descent</a>, we celebrate the rich cultures and heritage of people of African descent and the many invaluable contributions they make, here in Canada and around the world.</p>\n\n<p>“The African diaspora has shaped Canadian history and continues to strengthen our communities from coast to coast to coast. Today, we pay tribute to the trailblazers of African descent, among them retired Judge Corrine Sparks, the first African Nova Scotian appointed to the provincial judiciary and the first African Canadian woman to become a judge in Canada. Her decision in&nbsp;<em>R. v. S (R.D.)</em> called for the Supreme Court of Canada to reflect on the reality of anti-Black racism and hate in Nova Scotia.</p>\n\n<p>“Historical injustices, systemic racism, and discrimination continue to have intergenerational impacts on people of African descent. Addressing historic wrongs is an important step toward building a better future for everyone. That is why, this past July, the Government of Canada apologized to the members of No.&nbsp;2 Construction Battalion, Canadian Expeditionary Force for the anti-Black racism and hate they endured before, during, and long after the First World War, and we continue to learn from past mistakes to ensure that they never happen again.</p>\n\n<p>“Today, we also recommit to addressing the underlying inequities faced today in Canada by people of African descent, including disproportionate health disparities, driven by systemic anti-Black racism, discrimination, and hate.</p>\n\n<p>“In 2018, Canada officially recognized the <a href=\"https://www.un.org/en/observances/decade-people-african-descent\">United Nations’ International Decade for People of African Descent</a>, which spans from 2015 to 2024 and focuses on the themes of recognition, justice, and development. As part of our commitment to the Decade, we have made targeted investments to empower Canada’s Black communities, improve the well-being of Black Canadians across the country, and address systemic barriers and anti-Black racism. While we have made progress toward a more just and equitable society, more work still needs to be done. As part of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Canada’s Anti‑Racism Strategy</a>, and with the support of the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, we will continue to work to identify and eliminate systemic racism and racial discrimination in Canada.</p>\n\n<p>“On this day, I encourage all Canadians to learn more about the rich history and diverse cultures of people of African descent as well as the many important contributions they have made, and continue to make, to our national fabric. Together, we can build a stronger, safer, more diverse and inclusive society for all.”</p></div>\n      "
}