{
  "path": "/en/news/news-releases/2021/11/02/prime-minister-trudeau-concludes-productive-united-nations-climate",
  "pageTitle": "Prime Minister Trudeau concludes productive United Nations Climate Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Climate change is the greatest long-term threat of our time, but it is also the greatest opportunity for our economy and workers. Over the past two days, the Prime Minister, Justin Trudeau, participated in the 26th United Nations Climate Change Conference of the Parties (COP26) in Glasgow, United Kingdom, to outline Canada’s strong leadership on climate change and work with partners on the path forward to a cleaner future.</p>\n\n<p>Delivering Canada’s national statement, Prime Minister Trudeau advocated for increased global ambition and action to cut pollution and create new opportunities for our workers. Since 2015, Canada has been delivering on real climate action that has cut pollution, created new middle class jobs, and protected a healthy environment, including through investments of approximately $100 billion. To further this critical work, and ensure that Canada’s economy and workers benefit from the global transition to a clean economy, the government will continue to make important investments to fight the climate crisis and build a better future for everyone.</p>\n\n<p>Throughout the summit, Prime Minister Trudeau championed putting a price on pollution towards reaching global climate goals, and called on all countries to take bold action to expand the use of pollution pricing globally. Today, just over 20 per cent of the world’s emissions are covered by a price on pollution. But if significant economies around the world joined Canada by putting a meaningful price on pollution, we would have a better shot at tackling the climate crisis and building a cleaner world. To that end, the Prime Minister called for global leaders to work together to triple the global emissions covered by pollution pricing to 60 per cent by 2030.</p>\n\n<p>Canada is recognized internationally as a leader and innovator in pricing pollution. Our price trajectory to 2030 is one of the most ambitious in the world. Pricing pollution also puts more money back into the pockets of Canadians. In jurisdictions where the federal carbon pricing system applies, all direct proceeds from the federal pollution pricing system are returned to the jurisdiction where they were collected. A majority of proceeds are returned directly to Canadians through Climate Action Incentive payments, which give 8 out of 10 families more money back than they pay under the system.</p>\n\n<p>The Prime Minister also announced the Government of Canada’s proposal to deliver eligible Canadians’ Climate Action Incentive on a quarterly basis, starting in July 2022. This change will deliver cheques to Canadians more frequently. By putting a price on pollution, Canadians and businesses are encouraged to innovate, find new solutions, create middle class jobs, and be leaders in developing the technologies the world needs as we build a cleaner, green economy.</p>\n\n<p>At the Summit, Prime Minister Trudeau also highlighted Canada’s leadership in supporting developing countries as they adapt to climate change and transition to a cleaner economy. Today, the Prime Minister announced investments of up to $57.5 million to help the world’s poorest and most vulnerable countries adapt to the climate crisis and increase their resilience.</p>\n\n<p>The climate crisis has also meant that food, land, and water systems around the world are facing new challenges and threats. That is why Canada is supporting new innovation on climate-resilient agriculture and food systems. Canada will provide $55 million dollars over three years for CGIAR, a global research partnership that aims to transform these systems to not only strengthen food security and end hunger, but also promote gender equality, create new jobs and livelihoods, and deliver climate and environmental benefits around the world.</p>\n\n<p>The Prime Minister advocated for clean electricity as a key element to achieving a net-zero emissions economy. The Government of Canada is committed to accelerating its clean energy transformation by working with provinces, territories, industry, and other stakeholders to ensure that Canada’s electricity grid achieves net-zero emissions by 2035.</p>\n\n<p>The Prime Minister also announced bold new measures to assist with the clean energy transition and phasing out of thermal coal. Coal is the single largest contributor to climate change. To help accelerate the transition away from coal, the Prime Minister announced up to $1 billion for the Climate Investment Funds Accelerated Coal Transition Investment Program, through Canada’s international climate finance contribution, to help developing countries transition from coal-fired electricity to clean power as quickly as possible.</p>\n\n<p>Reducing global methane emissions is one of the fastest and lowest cost ways of fighting climate change. Prime Minister Trudeau reaffirmed Canada’s support for the Global Methane Pledge, which it officially joined today, and its objective of reducing total methane emissions by at least 30 per cent below 2020 levels by 2030. Canada has set the global pace by becoming the first country to commit to reducing methane emissions in the oil and gas sector by at least 75 per cent below 2012 levels by 2030, and to pursue methane reductions across economic sectors.</p>\n\n<p>The Prime Minister also emphasized the importance of nature-based climate solutions to help reduce pollution, adapt to the impacts of climate change, protect and restore nature and biodiversity, and strengthen people’s health and well-being. Canada has committed to protecting 25 per cent of its land and oceans by 2025, working toward 30 per cent by 2030. As a member of the <a href=\"https://www.hacfornatureandpeople.org/\">High Ambition Coalition for Nature and People</a>, Canada is strongly advocating for other countries to also commit to conserving 30 percent of the world’s lands and oceans by 2030.</p>\n\n<p>Canada recognizes that, to achieve maximum results, our actions to protect and conserve nature and our efforts to mitigate and adapt to climate change must be closely aligned. Nowhere is this truer than in the oceans. That is why today, the Prime Minister announced $9 million in additional support for the Ocean Risk and Resilience Alliance, to support their ongoing work helping Small Island Developing States and coastal developing countries increase their resilience to the impacts of climate change through nature-based solutions. He also announced $6 million for the Global Fund for Coral Reefs to support international efforts in coral reef conservation and restoration.</p>\n\n<p>Canada is already embracing the power of nature to support efforts to address the dual crises of biodiversity loss and climate change, including by planting 2 billion trees. &nbsp;As part of these nature‑based solutions, the Government of Canada has also committed to promoting the rights, knowledge, and leadership of Indigenous peoples in conservation, including by supporting Indigenous-led stewardship initiatives. These initiatives provide important cultural, health, and physical benefits for Indigenous communities, while supporting healthy ecosystems that provide conservation and climate benefits for all Canadians.</p>\n\n<p>Lastly, the Prime Minister endorsed the UK‑led Global Forest Finance Pledge, which aims to identify US$12 billion in public climate finance from 2021 to 2025, to support further ambition from forested developing countries.</p>\n\n<p>Canada is a committed partner in the global fight against climate change. That’s why the Government of Canada is leading the way by taking real climate action and developing the climate solutions that will cut pollution and create new middle class jobs for Canadians. By working with global partners, we will tackle the climate crisis and build a better and cleaner future for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Tackling the climate crisis will take all of us. Together, the global community needs to accelerate new and bold approaches to fighting climate change and building cleaner economies. Canada is committed to working with our partners to take strong climate action, create the middle class jobs of the future, and build a healthier world for our children and grandchildren.”</p>\n\n<footer class=\"default\">Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since October 2020, the Government of Canada has invested $53.6&nbsp;billion into Canada’s green recovery.</li>\n\t<li>In partnership with the Carbon Pricing Leadership Coalition (CPLC), Prime Minister Trudeau co-hosted a high-level panel discussion among global leaders on the important role of carbon pricing in achieving global net-zero emissions.</li>\n\t<li>Canada’s approach to pricing carbon pollution sets minimum national standards while allowing provinces and territories the flexibility to implement their own systems, demonstrating that we can tailor policies to local needs while also achieving collective goals.</li>\n\t<li>The government recently announced an annual increase in the benchmark carbon price of $15 per year beginning in 2023, reaching $170 per tonne in 2030.&nbsp;</li>\n\t<li>In June 2021, Canada doubled its international climate finance contribution from the $2.65 billion announced in 2015, to $5.3 billion over the next five years.</li>\n\t<li>Canada is announcing up to $57.5 million for three targeted initiatives, dedicated to building resilience in developing countries’ communities that need it most, including:\n\t<ul>\n\t\t<li>Up to $37.5 million for the Least Developed Countries Fund, to address the adaptation needs of the poorest and most vulnerable countries. The Fund focuses on sectors such as water, agriculture and food security, disaster risk management and prevention, and fragile ecosystems.</li>\n\t\t<li>Up to $10 million for the Adaptation Fund, which finances projects and programs that help vulnerable communities in developing countries adapt to climate change, including the most climate-vulnerable countries such as Small Island Developing States and least developed countries. The Fund’s support includes increasing the number of accreditation entities and enhancing the quality of project proposals.</li>\n\t\t<li>Up to $10 million for the National Adaptation Plan (NAP) Global Network, which works with developing countries to address structural drivers of climate vulnerability, as well as to empower women, marginalized groups, and those most affected by climate impacts to participate in the NAP process and shape a country’s adaptation priorities. The Network will continue and expand technical support, innovate and experiment with peer learning, and make knowledge around NAPs more accessible and compelling.</li>\n\t</ul>\n\t</li>\n\t<li>CGIAR is a global partnership that unites organizations engaged in research for a food-secure future.&nbsp;Canada is a founding member of CGIAR and has been a top-ten donor for the last decade.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2021/12/delivering-climate-action-incentive-payments-quarterly.html\">Backgrounder: Delivering Climate Action Incentive Payments Quarterly</a></li>\n\t<li><a href=\"https://fin.canada.ca/drleg-apl/2021/ita-lir-1221-eng.html\">Legislative Proposals Relating to the Income Tax Act</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/01/prime-minister-trudeau-announces-enhanced-and-ambitious-climate\">Prime Minister Trudeau announces enhanced and ambitious climate action to cut pollution at the COP26 summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/31/prime-minister-concludes-successful-g20-leaders-summit-italy\">Prime Minister concludes successful G20 Leaders’ Summit in Italy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/climate-finance/delivery-plan.html\">Climate Finance Delivery Plan: Meeting the US$100 Billion Goal</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/12/11/prime-minister-announces-canadas-strengthened-climate-plan-protect\">Prime Minister announces Canada’s strengthened climate plan to protect the environment, create jobs, and support communities</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/canada-international-action/un-climate-change-conference/cop26-summit.html\">UN conference on climate action: COP26 in Glasgow</a></li>\n\t<li><a href=\"https://ukcop26.org/the-global-forest-finance-pledge/\">Global Forest Finance Pledge</a></li>\n</ul></div>\n      "
}