{
  "path": "/en/news/statements/2017/02/13/joint-statement-president-donald-j-trump-and-prime-minister-justin",
  "pageTitle": "Joint Statement from President Donald J. Trump and Prime Minister Justin Trudeau | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>President Donald J. Trump and Prime Minister Justin Trudeau held their first official meeting today in Washington, D.C. and affirmed their longstanding commitment to close cooperation in addressing both the challenges facing our two countries and problems around the world.</p>\n\n<p>No two countries share deeper or broader relations than Canada and the United States. We are bound together by our history, our values, our economy, our environment, and our resolve to improve the lives of our citizens. Our close relationship and ongoing collaboration allow us to successfully meet any challenges we may face over the coming years, and to build a prosperous future for the people of both countries.</p>\n\n<p><strong>Neighbours in Growing our Economies</strong></p>\n\n<p>We recognize our profound shared economic interests, and will work tirelessly to provide growth and jobs for both countries. Canada is the most important foreign market for thirty-five U.S. States, and more than $2 billion in two-way trade flows across our shared border every day. Millions of American and Canadian middle-class jobs, including in the manufacturing sector, depend on our partnership. We affirm the importance of building on this existing strong foundation for trade and investment and further deepening our relationship, with the common goal of strengthening the middle class.</p>\n\n<p>The United States and Canada also recognize the importance of cooperation to promote economic growth, provide benefits to our consumers and businesses, and advance free and fair trade. We will continue our dialogue on regulatory issues and pursue shared regulatory outcomes that are business-friendly, reduce costs, and increase economic efficiency without compromising health, safety, and environmental standards. We will work together regarding labour mobility in various economic sectors.</p>\n\n<p>Given our shared focus on infrastructure investments, we will encourage opportunities for companies in both countries to create jobs through those investments. In particular, we look forward to the expeditious completion of the Gordie Howe International Bridge, which will serve as a vital economic link between our two countries.</p>\n\n<p><strong>Energy Security and Environment</strong></p>\n\n<p>U.S.-Canada energy and environmental cooperation are inextricably linked, and we commit to further improving our ties in those areas. We have built the world’s largest energy trading relationship. We share the goals of energy security, a robust and secure energy grid, and a strong and resilient energy infrastructure that contributes to energy efficiency in both countries. We collaborate closely on energy innovation, particularly in the clean energy sphere. As the process continues for the Keystone XL pipeline, we remain committed to moving forward on energy infrastructure projects that will create jobs while respecting the environment.</p>\n\n<p>We also look forward to building on our many areas of environmental cooperation, particularly along our border and at the Great Lakes, and we will continue to work together to enhance the quality of our air and water.</p>\n\n<p><strong>Partners in Keeping our Border Secure</strong></p>\n\n<p>We recognize the security of our borders as a top priority. Together, we address security at our shared border and throughout our two countries, while expediting legitimate and vital cross-border trade and travel. We demonstrate daily that security and efficiency go hand-in-hand, and we are building a 21<sup>st</sup> century border through initiatives such as pre-clearance of people and integrated cross-border law enforcement operations. In addition, our two countries are committed to a coordinated entry-exit information system so that records of land and air entries into one country establish exit records for the other.</p>\n\n<p>Recognizing the success of pre-clearance operations for travellers, we commit to establishing pre-clearance operations for cargo. We intend to accelerate the completion of pre-clearance for additional cities and continue to expand this program. Not only will these efforts enhance efficiency at our shared border, they will also strengthen our shared security. In the spirit of a more efficient and secure border, we will also examine ways to further integrate our border operations, including analysis of the feasibility of co-locating border officials in common processing facilities.</p>\n\n<p>Because we share a strong concern about the increase in opioid-related deaths, our countries will work together on common solutions to protect our people from opioid trafficking.</p>\n\n<p>Given the integrated nature of the infrastructure that supports our intertwined economies, cyber threats to either country can affect the other. We therefore commit to further cooperation to enhance critical infrastructure security, cyber incident management, public awareness, private sector engagement, and capacity building initiatives.</p>\n\n<p><strong>Allies in the World</strong></p>\n\n<p>We are indispensable allies in the defence of North America and other parts of the world, through NATO and other multilateral efforts. Our troops have time and again fought together and sacrificed their lives for our shared values. The North American Aerospace Defense Command (NORAD) illustrates the strength of our mutual commitment. United States and Canadian forces jointly conduct aerospace warning, aerospace control, and maritime warning in defence of North America. We will work to modernize and broaden our NORAD partnership in these key domains, as well as in cyber and space.</p>\n\n<p>The United States welcomes Canada’s recently announced decision to launch an open and transparent competition to replace its legacy fleet of CF-18 fighter aircraft. The United States also welcomes Canada’s decision to explore the immediate acquisition of 18 new Super Hornet aircraft as an interim capability to supplement the CF-18s until the permanent replacement is ready. Canada appreciates the cooperation of the United States to facilitate these processes.</p>\n\n<p>The United States values Canada’s military contributions, including in the Global Coalition Against Daesh, and in Latvia. Together, we are harnessing all elements of national power to achieve the goal of degrading and destroying Daesh through our military operations to deny it safe havens and to build the capacity of local partners, stop the flow of foreign terrorist fighters into the Middle East region, cut off access to financing and funding, counter the Daesh narrative, and support the stabilization of communities liberated from Daesh.</p>\n\n<p><strong>Empowering Women Entrepreneurs and Business Leaders </strong></p>\n\n<p>It is a priority of both countries to ensure equal opportunities for women in the workforce. We are committed to removing barriers to women’s participation in the business community and supporting women as they advance through it. As part of this effort, we are creating a Canada-United States Council for Advancement of Women Entrepreneurs and Business Leaders. We expect this initiative to promote the growth of women-owned enterprises and to further contribute to our overall economic growth and competitiveness, as well as the enhanced integration of our economies.</p>\n\n<p><strong>The Way Forward</strong></p>\n\n<p>We share a commitment to continue to strengthen our ties for the benefit of our mutual prosperity and security. We look forward to our cabinets following up on today’s meeting with further discussions in their respective areas of responsibility. Our countries deserve our full commitment to increased economic growth, which we will deliver. The partnership between the United States and Canada will continue to be unique and a model for the world.</p></div>\n      "
}