{
  "path": "/en/news/news-releases/2018/08/13/prime-minister-highlights-support-seniors-prince-edward-island",
  "pageTitle": "Prime Minister highlights support for seniors in Prince Edward Island | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is working hard to give Canadian seniors the support they need, and the secure and dignified retirement they deserve.</p><p>The Prime Minister, Justin Trudeau, today celebrated Prince Edward Island Old Home Week with seniors from Charlottetown and highlighted the government’s commitment to support seniors in the province and across the country.</p><p>The Government of Canada&nbsp;has&nbsp;taken a number of important steps to give seniors, their families, and future retirees greater security and a better quality of life. We have enhanced the Canada Pension Plan (CPP)&nbsp;– the most significant change in a generation – lowered&nbsp;the age of eligibility for Old Age Security benefits from 67 to 65, and boosted the Guaranteed Income Supplement by nearly $1,000 a year for vulnerable seniors who live alone.&nbsp;These changes&nbsp;allow Canadians to worry less about their savings and focus more on enjoying time with their families and loved ones.</p><p>We have also improved EI caregiver benefits to make it easier for Canadians to take a leave from work in order to care for a family member in need, and committed $6 billion in funding to provinces for better home care, including palliative care.</p><p>To further empower Canadian seniors in their retirement, the New Horizons for Seniors Program supports projects led or inspired by seniors who make a difference in their communities and the lives of others. Last year, the program provided close to $465,000 in funding for local projects in PEI related to mentorship, community involvement, and improved mental and physical health.</p><p>Driven by the new Minister of Seniors, Filomena Tassi, and the help of a strengthened National Seniors Council, the Government of Canada will continue to explore new ways to improve the well-being and quality of life for seniors now and for future generations to come.</p><h2>Quotes</h2><blockquote><p>“Seniors in PEI and across Canada have worked hard their entire lives, and deserve to feel confident about their future. I am committed to protecting benefits for seniors, and making sure they are able to enjoy a happy, healthy retirement.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Seniors are such an important part of our society. They contribute to our communities and help to build a stronger Canada. I look forward to working to ensure that seniors across the country have access to quality programs and services they deserve.”<br>—<cite>The Hon. Filomena Tassi, Minister of Seniors</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Eastern provinces in Canada have the largest proportions of seniors, averaging over 19 percent of their respective populations.</li><li>In PEI, the Government of Canada has committed $12.1 million to rebuild the Riverview Manor in Montague and build a new manor in Tyne Valley.</li><li>Yearly increases to the Guaranteed Income Supplement since 2016 have helped over 900,000 seniors and lifted 13,000 more out of poverty – 12,000 of whom are women.</li><li>The Government of Canada reached a historic agreement with provinces to enhance the CPP. The agreement – to be phased in as of January 2019 – will increase the maximum CPP retirement benefit by about 50 percent.</li><li>The New Horizons for Seniors Program provides funding for community-based projects up to $25,000 per year, per organization, or a small grant of a maximum of $5,000.</li><li>The program also supports larger pan-Canadian projects up to $750,000 for up to three&nbsp;years to meet the growing social needs of seniors, such as social isolation.</li><li>Last year, the Government of Canada created Canada’s first-ever National Housing Strategy (NHS). Safe, accessible, and affordable housing for seniors is at the heart of the NHS, which will repair and or build 12,000 units of seniors housing.</li><li>The National Seniors Council engages with seniors, stakeholders, and experts to provide advice to the Government of Canada on current and emerging issues and opportunities related to the health, well-being, and quality of life of seniors.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/employment-social-development/programs/new-horizons-seniors.html\">New Horizons for Seniors Program</a></li><li><a href=\"https://www.canada.ca/en/national-seniors-council.html\">National Seniors Council</a></li><li><a href=\"/en/news/news-releases/2018/07/18/prime-minister-announces-changes-ministry\">Prime Minister announces changes to the Ministry</a></li></ul></div>\n      "
}