{
  "path": "/en/news/itineraries/2022/09/24/update-prime-ministers-itinerary-saturday-september-24-2022",
  "pageTitle": "UPDATE – Prime Minister’s itinerary for Saturday, September 24, 2022 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p>\n\n<h2>National Capital Region, Canada</h2>\n\n<p>Private meetings</p>\n\n<p>The Prime Minister will chair a meeting of the Incident Response Group on Hurricane Fiona.</p>\n\n<p>The Prime Minister will speak with the Premier of Newfoundland and Labrador, Andrew Furey.</p>\n\n<p>The Prime Minister will speak with the Premier of Prince Edward Island, Dennis King.</p>\n\n<p>The Prime Minister will speak with the Premier of New Brunswick, Blaine Higgs.</p>\n\n<p>The Prime Minister will speak with the Premier of Nova Scotia, Tim Houston.</p>\n\n<p>The Prime Minister will speak with the Premier of Quebec, François Legault.</p>\n\n<p><strong>4:30 p.m.</strong> The Prime Minister and President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness Bill Blair will hold a media availability regarding Hurricane Fiona. Minister of National Defence Anita Anand, Minister of Rural Economic Development Gudie Hutchings, Minister of Intergovernmental Affairs, Infrastructure and Communities Dominic LeBlanc, Minister of National Revenue Diane Lebouthillier, and Minister of Labour Seamus O’Regan Jr. will also be in attendance.</p>\n\n<p class=\"Indent2\">Room 200<br>\nSir John A. Macdonald Building<br>\n144 Wellington Street<br>\nOttawa, Ontario</p>\n\n<p class=\"Indent2\"><strong>Notes for media:</strong></p>\n\n<ul class=\"Indent2\">\n\t<li>Open coverage</li>\n\t<li>Media wishing to cover the event must be accredited with the Parliamentary Press Gallery.</li>\n\t<li>A teleconference line is also available for media who wish to only listen to the event.</li>\n\t<li>Participant dial-in numbers (listen only):<br>\n\tLocal: 613-954-9003<br>\n\tToll Free: 1-866-206-0153<br>\n\tAccess Code: 2954271#</li>\n</ul></div>\n      "
}