{
  "path": "/en/news/readouts/2022/02/28/prime-minister-justin-trudeau-participates-teleconference-meeting",
  "pageTitle": "Prime Minister Justin Trudeau participates in teleconference meeting with President of the United States of America Joe Biden, Prime Minister of Japan Kishida Fumio, and European leaders on Russia and the situation in Ukraine | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau participated in a teleconference meeting with the President of the United States of America, Joe Biden, and the leaders of the European Commission, the European Council, France, Germany, Italy, Japan, the North Atlantic Treaty Organization (NATO), Poland, Romania, and the United Kingdom to discuss Russia’s invasion of Ukraine.</p>\n\n<p>The leaders strongly condemned the large-scale military aggression by Russia against the territorial integrity, sovereignty, and independence of Ukraine. They expressed grave concerns regarding reports of Russian attacks on civilian areas in a number of Ukrainian cities. The leaders stressed that Russia’s actions threaten peace and stability in Europe and around the world. The actions also threaten democracy, and are blatant violations of international law that will not be tolerated. They called on Russia to halt its invasion and withdraw its forces from Ukrainian territory immediately.</p>\n\n<p>The leaders noted the critical importance of strong collective action to support the Ukrainian government and people, and of demonstrating to Russia that it will pay an enormous cost for its unprovoked war. To this end, the leaders discussed the heavy, punitive sanctions against President Putin and others in Russia who are directly responsible for this tragedy, and their intention to continue to expand these measures should Russia’s aggression continue. They also condemned the role of Belarus in facilitating the Russian invasion.</p>\n\n<p>The leaders discussed the emerging humanitarian crisis in Ukraine and neighbouring countries, and commended Poland, Romania and other countries for their support for Ukrainians fleeing violence. They agreed to enhance efforts to strengthen the security of neighbouring countries, and the need to increase humanitarian support.</p>\n\n<p>The leaders noted that Russia’s senseless war had brought peaceful, democratic countries together in support of Ukraine, as demonstrated by the highly coordinated actions by the international community, including the G7, the European Union, and NATO. They called on all countries to join the effort to demonstrate to Russia that illegal wars of aggression have no place in the 21st century.</p>\n\n<p>The leaders agreed to continue coordinating closely.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/02/25/statement-nato-heads-state-and-government-russias-attack-ukraine\">Statement by NATO Heads of State and Government on Russia’s Attack in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Prime Minister Justin Trudeau and Deputy Prime Minister and Minister of Finance Chrystia Freeland speak with Prime Minister of Ukraine Denys Shymal</a></li>\n</ul></div>\n      "
}