{
  "path": "/en/news/statements/2016/12/10/statement-prime-minister-canada-human-rights-day",
  "pageTitle": "Statement by the Prime Minister of Canada on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p>\n<p>“Today, we commemorate the 69<sup>th</sup> anniversary of the United Nations’ adoption of the <em>Universal Declaration of Human Rights </em>and reaffirm our commitment – as individuals and as a country – to the protection and promotion of human rights worldwide.</p>\n<p>“While the international community has made significant progress on human rights in many areas, there is still an enormous amount of work to do to ensure that all human beings are treated equally and with respect, including women and girls, members of LGBTQ2 communities, Indigenous Peoples, persons with disabilities, and refugees, among others.</p>\n<p>“Within our own borders, there is also still a lot of work to be done. We all have a duty to confront the darkest chapters of our nation’s history, from residential schools and the systematic abuse of Indigenous children, to the discrimination of LGBTQ2 Canadians. Recognizing this, the Government of Canada has taken important measures to redress past wrongs and further guarantee equality for all citizens, at home and around the world.</p>\n<p>“Earlier this year, we fully adopted the UN Declaration on the Rights of Indigenous Peoples, one of 94 Calls to Action of the Truth and Reconciliation Commission. We remain committed to its implementation – and the other 44 Calls to Action under federal purview – in full partnership and consultation with Indigenous Peoples. We have also launched an independent inquiry into the national horror and continuing trauma of Missing and Murdered Indigenous Women and Girls.</p>\n<p>“In May, we introduced a Bill to recognize and reduce the vulnerability of trans and other gender-diverse persons to discrimination, hate propaganda, and hate crimes. We also appointed a Special Advisor on LGBTQ2 issues to work with LGBTQ2 communities and to address discrimination against them – both historical and current. We will continue to invest in programs to prevent gender-based violence, homophobia, and transphobia, and ensure all Canadians feel free and safe to be themselves.</p>\n<p>“Sixty-nine years ago, Canadian John Humphrey helped to draft the <em>Universal Declaration of Human Rights</em> at the UN. The following words can be found in the first article of this document: ‘All human beings are born free and equal in dignity and rights.’ On this day, I encourage Canadians to live up to the spirit of Mr. Humphrey’s efforts and ideals, and stand up for human rights wherever and whenever it is needed.</p>\n<p>“We must always endeavour to do better, and be better, in our ceaseless pursuit of equality for all.”</p></div>\n      "
}