{
  "path": "/en/news/news-releases/2016/09/23/prime-minister-announces-increased-collaboration-china",
  "pageTitle": "Prime Minister announces increased collaboration with China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada has made it a top priority to create a stronger, more stable long-term relationship with China.</p><p>In keeping with this objective, the Prime Minister, Justin Trudeau, met with the Premier of the State Council of the People's Republic of China, Li Keqiang, during his first official visit to Canada September 21 to 24, 2016.</p><p>The two leaders held their first discussions under the new Annual Dialogue between the Premier of China and the Prime Minister of Canada – a key outcome from the Prime Minister’s recent visit to China – and focused on ways to create jobs, strengthen the middle class, and build economies that work for everyone.</p><p>During the meetings, strong steps were taken to expand the bilateral economic and financial relationship. Canada and China signed a Memorandum of Understanding on trade in canola. Furthermore, the two leaders agreed to launch exploratory discussions for a possible Canada-China Free Trade Agreement; expand market access for Canadian bone-in beef; and set a goal of doubling bilateral trade by 2025.</p><p>Prime Minister Trudeau and Premier Li also met with business and community leaders, senior political figures, and members of Chinese-Canadian community in Ottawa and Montréal.&nbsp;</p><h2>Quote</h2><blockquote><p>“During his official visit, Premier Li and I again made solid progress towards a more stable and beneficial relationship between Canada and China. These efforts will promote further understanding between our countries and generate exciting new opportunities for Canadian businesses to help grow our middle class.”<br><cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In addition, the leaders announced numerous bilateral initiatives aimed at expanding Canada-China relations. The following are highlights in priority areas for Canada:<ul><li>Connecting peoples and culture: signing memoranda of understanding that will increase student and tourist flows; enhancing Canada-China air transport relations; and, strengthening cooperation in winter sports ahead of the Beijing 2022 Olympic and Paralympic Winter Games.</li><li>Expanding the economic and financial relationship: enhancing trade in agriculture; increasing collaboration between Canadian and Chinese companies working to provide goods and services in other countries; and establishing a China-Canada Innovation Dialogue.</li><li>A Strategic Dialogue: both leaders agreed to launch the Canada-China Economic and Financial Strategic Dialogue with a view to enhancing mutual prosperity going forward. They also announced new commercial signings in a range of sectors.</li><li>The leaders also announced initiatives that will facilitate cooperation in the areas of environmental protection, health and security collaboration.</li></ul></li><li>This is the first visit of a Chinese leader to Canada since 2010.</li><li>Prime Minister Trudeau travelled to China for his first official visit from August 30 to September 6, 2016 with stops in Beijing, Shanghai, Hangzhou and Hong Kong.</li><li>China is the world's second largest economy, and Canada's second-largest single-country trading partner.</li><li>Two-way merchandise trade between Canada and China amounted to nearly $85.8 billion in 2015, a 10.1 percent increase over 2014, and accounted for 8.1&nbsp;percent of Canada's total merchandise trade. In 2015, bilateral merchandise trade with Hong Kong reached $4.2 billion.</li><li>Canada's two-way foreign direct investment relationship with China reached $33 billion at the end of 2015 and two-way investment relationship with Hong Kong amounted to $23.7 billion in 2015.</li><li>Canadians of Chinese descent make up approximately 4.5 percent of Canada's population.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/statements/2016/09/23/joint-statement-between-canada-and-peoples-republic-china\">Joint Statement Between the People’s Republic of China and Canada</a></li><li><a href=\"/en/news/backgrounders/2016/09/22/strengthening-canada-china-commercial-relationship\">Strengthening of Canada-China Commercial Relationship</a></li></ul></div>\n      "
}