{
  "path": "/en/news/news-releases/2016/09/23/prime-minister-welcomes-their-royal-highnesses-duke-and-duchess",
  "pageTitle": "Prime Minister welcomes Their Royal Highnesses, the Duke and Duchess of Cambridge, to Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will participate in a number of events taking place during the Royal Tour to Canada of Their Royal Highnesses, The Duke and Duchess of Cambridge.</p><p>On Saturday, September 24, the Prime Minister and Mrs. Grégoire Trudeau will participate in the Official Welcoming to Canada and British Columbia ceremony at the Legislative Assembly of British Columbia. The Prime Minister will later have a private audience with The Duke and Duchess.</p><p>On Sunday, the Prime Minister and Mrs. Grégoire Trudeau will accompany Their Royal Highnesses on a tour of the Immigrant Services Society’s new Welcome Centre in Vancouver – the first, purpose-built facility of its kind that provides settlement, education, and employment services for thousands of immigrants and refugees each year. Later that day, the four will attend a youth reception in Vancouver where they will meet young Canadians who are helping to make a difference in their communities.</p><p>Their Royal Highnesses, the Prime Minister, and Mrs. Grégoire Trudeau will also visit Kitsilano Coast Guard Station for a first responders showcase. They will tour the station and speak to first responders about the issues they face every day in carrying out their life-saving work.</p><h2>Quote</h2><blockquote><p>“Canadians have tremendous affection for the Royal Family, and are excited to welcome The Duke and Duchess to our nation for their second official Royal Tour of Canada. Sophie and I look forward to showcasing beautiful British Columbia and to promoting awareness of both youth and mental health issues alongside Their Royal Highnesses.”<br><cite>— Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is the second official tour for The Duke and Duchess of Cambridge. Their first tour of Canada took place in 2011 as newlyweds.</li><li>The official welcome will feature full military honours, including a 21-gun salute, the raising of His Royal Highness’s Canadian Standard, and an inspection of the Guard of Honour.</li><li>During their visit to the Immigrant Services Society (ISS) of British Columbia’s new Welcome Centre, the Prime Minister and Mrs. Grégoire Trudeau will meet with a government-assisted refugee family from Syria as well as with three clients of the MAPLE 2.0 immigrant professionals program.</li><li>As part of their visit to the Kitsilano Coast Guard Station, Their Royal Highnesses, the Prime Minister, and Mrs. Grégoire Trudeau will participate in a discussion on mental health issues with representatives of first responders’ organizations, including Royal Canadian Marine Search and Rescue; North Shore Search and Rescue; Vancouver Police Department; Vancouver Fire Department; BC Ambulance Services; Coast Guard First Responders; and Do it for Daron.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.leg.bc.ca/\">Legislative Assembly of British Columbia</a></li><li><a href=\"https://issbc.org/\">Immigrant Services Society of British Columbia</a></li></ul></div>\n      "
}