{
  "path": "/en/news/statements/2021/10/18/statement-prime-minister-persons-day",
  "pageTitle": "Statement by the Prime Minister on Persons Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement for Persons Day:</p>\n\n<p>“Today, on <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month/persons-day.html\">Persons Day</a>, we remember the bravery and determination of the Famous Five, whose landmark case helped pave the way for women to participate equally in – and contribute equally to – all aspects of life in Canada. We also honour all those who in the years since have expanded, strengthened, and advocated for those fundamental rights to apply to all women.</p>\n\n<p>“Recognizing that women could not be appointed to the Senate because they were not legally considered ‘persons’, Emily Murphy, Nellie McClung, Louise McKinney, Irene Parlby, and Henrietta Muir Edwards – known as the Famous Five – joined efforts in challenging the status quo. On October 18, 1929, after a two-year legal battle, the court’s decision was a turning point in our history. Many Canadian women were recognized as persons under the law and obtained the right to serve their country as senators. Nonetheless, the decision was not extended at the time to all women. As a result, Indigenous women and those of Asian descent were denied universal suffrage, reflecting the racist attitudes of the time.</p>\n\n<p>“The actions of the Famous Five were an important step in efforts to advance gender equality and paved the way for the increased participation of women in public and political life. We have made great progress since they won their landmark case. However, we still have much work to do to ensure that women, girls, and non binary people of all backgrounds enjoy the same opportunities as men and boys. We cannot leave half of the country behind as we move forward. Everyone benefits when all women and girls have an equitable chance at success and are able to fully participate in society.</p>\n\n<p>“The Government of Canada is taking action to advance gender equality both at home and abroad, and pursues domestic and international policies that support the empowerment of all women and girls, as we know it is essential to achieve each of the <a href=\"https://www.un.org/sustainabledevelopment/sustainable-development-goals/\">17&nbsp;Sustainable Development Goals</a> and to make sure we progress towards a world that leaves no one behind. That is why we formed Canada’s first gender-balanced Cabinet. We created the <a href=\"https://women-gender-equality.canada.ca/en/gender-results-framework.html\">Gender Results Framework</a> to track and measure progress in advancing gender equality, and launched the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/policy-politique.aspx?lang=eng\">Feminist International Assistance Policy</a>, which is centered on gender equality and the empowerment of women and girls, and the <a href=\"https://www.ic.gc.ca/eic/site/107.nsf/eng/home\">Women Entrepreneurship Strategy</a> to advance women’s economic empowerment. In <a href=\"https://www.budget.gc.ca/2021/home-accueil-en.html\">Budget 2021</a>, we announced the creation of a <a href=\"https://www.canada.ca/en/department-finance/news/2021/04/budget-2021-a-canada-wide-early-learning-and-child-care-plan.html\">Canada-wide Early Learning and Child Care</a> system, which provides more options to families and supports more women to participate in the economy. We will continue to take concrete action to advance the well-being of women and girls.</p>\n\n<p>\"As we celebrate <a href=\"https://women-gender-equality.canada.ca/en/commemorations-celebrations/womens-history-month.html\">Women’s History Month</a>, Sophie and I invite Canadians to join us to learn more about the Famous Five, celebrate women’s contributions to our country, and work to ensure that everyone can have an equal chance to succeed. Together, we can build a better country for everyone.”</p></div>\n      "
}