{
  "path": "/en/news/statements/2020/05/04/statement-prime-minister-mental-health-week",
  "pageTitle": "Statement by the Prime Minister on Mental Health Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Mental Health Week:</p>\n\n<p>“Today is the first day of <a href=\"https://mentalhealthweek.ca/\">Mental Health Week</a>. It is a time for us all to talk about the importance of mental health and to reflect on our own self-care.</p>\n\n<p>“Good mental health is so critical to our well-being, and yet it is often dismissed as less urgent or deserving of our care and attention. This leaves far too many to suffer in silence, fearing discrimination or stigma.</p>\n\n<p>“During these particularly challenging times, the impacts of COVID-19 are placing an even greater strain on our mental health. The pandemic has threatened our safety, disrupted our daily lives, and disconnected us from our regular support networks. Many people are left feeling isolated, anxious, and afraid for the future. While we must continue to be physically distant, it is more important than ever to remain socially connected.</p>\n\n<p>“The Government of Canada is offering additional mental health support to all Canadians, through a new online portal called <a href=\"https://ca.portal.gs/\">Wellness Together Canada</a>. Whether you are feeling stressed or sad, dealing with substance use, or interested in learning how to maintain your mental health, I encourage everyone to explore the free resources, tools, and professional support services available.</p>\n\n<p>“To get through this, we all need to be there for each other. If you know someone who is having a hard time, send them a text or give them a call. If you are struggling, reach out and ask for help. There is no challenge that we cannot overcome together.”</p></div>\n      "
}