{
  "path": "/en/news/news-releases/2018/10/13/prime-minister-concludes-successful-visit-armenia-and-his",
  "pageTitle": "The Prime Minister concludes a successful visit to Armenia and his participation at the XVII Francophonie Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau concluded his official visit to Armenia, where he also took part in the XVII Francophonie Summit.</p><p>At the Summit, together with the Honourable Mélanie Joly, Minister of Tourism, Official Languages and La&nbsp;Francophonie, the Prime Minister reaffirmed Canada’s continued commitment to the International Organisation of La&nbsp;Francophonie (OIF) and its values, including peace, democracy, gender equality, inclusion, and respect for rights and freedoms.</p><p>The Prime Minister had discussions with his counterparts from various Francophonie member countries on issues related to the Summit’s theme, “Living together in solidarity, shared humanistic values and respect for diversity: a source of peace and prosperity in La&nbsp;Francophonie.” During the discussions, he emphasized the importance of working together to address shared challenges, including building economies that benefit everyone, fighting climate change, and strengthening democratic institutions.</p><p>In line with Canada’s Feminist International Assistance Policy, the Prime Minister also announced that the Government of Canada will contribute $43&nbsp;million to support international assistance projects in several African countries, including Mali, Senegal and the Democratic Republic of the Congo. These funds will help advance women’s empowerment, promote sexual and reproductive rights, and increase access to sexual and reproductive health services.</p><p>The Prime Minister also highlighted the exceptional work of Secretary General Michaëlle Jean as head of La&nbsp;Francophonie. He underscored her many achievements, serving as a strong voice for women and girls and as an advocate for young people and human rights. The Prime Minister also congratulated the new Secretary General of the OIF, Louise Mushikiwabo, who will officially take office in 2019.</p><p>The Prime Minister also spoke with Quebec’s premier-designate François Legault. The two leaders agreed to work together to address common challenges, attract foreign investment, and create new opportunities for all Canadians.</p><p>The Prime Minister announced that the OIF members adopted the Francophonie strategy for the promotion of gender equality and the rights and empowerment of women and girls<i>. </i>Canada took a leadership role in developing this strategy, which will make gender equality a priority in La&nbsp;Francophonie’s work in the coming years. At the Summit, members also reached a consensus in favour of the seven new applications for membership in the OIF, namely Ireland, Malta, Gambia, and Louisiana, which requested observer status, and Kosovo, Serbia, and the United Arab Emirates, which requested associate membership.</p><p>During his official bilateral visit, Prime Minister Trudeau met with Armen&nbsp;Sarkissian, President of the Republic of Armenia, and Nikol&nbsp;Pashinyan, Armenian Prime Minister, to further strengthen the strong relationship between Canada and Armenia. The leaders discussed their intention to begin talks on expanding air services between Canada and Armenia, which would facilitate travel, tourism, and trade, and strengthen the ties between the people in both countries.</p><p>Prime Minister Trudeau also launched the Arnold Chan Initiative for Democracy in Armenia. He made the announcement in the company of Member of Parliament Jean&nbsp;Yip, in memory of her husband, Member of Parliament Arnold Chan, who passed away last year and was the former co-leader of the Canada-Armenia Parliamentary Friendship Group. The initiative will help develop democratic institutions and strengthen the democratic process in Armenia. It will also support various projects aimed at protecting the right to education and the empowerment of women and girls, encouraging young people’s participation in the democratic process, and promoting the sustainable development of communities through environmental education.</p><h2>Quotes</h2><blockquote><p>“Canada is a proud member of the International Organisation of La&nbsp;Francophonie and will continue to work actively to promote and protect the French language and francophone culture. At this year’s Summit, we made significant progress to advance our shared values of peace, democracy, inclusion, diversity, gender equality, and respect for human rights.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“I was very pleased to meet the President and the Prime Minister of Armenia during my official visit. We had productive discussions and showcased the close ties between our two countries. Canada will continue to support Armenia’s efforts to strengthen its democratic progress.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada's commitment to La&nbsp;Francophonie runs deep and is rooted in the French language and the values we share. An integral part of that means promoting peace, democracy, and human rights – and we will never stop defending those values. As Minister responsible for La&nbsp;Francophonie, my mandate is to defend, strengthen, and promote our official language communities, and the French language throughout the world. That is why, as part of the XVII&nbsp;Francophonie Summit, and with support from France and other partners, Canada is committed to support dynamic francophone culture and protect its place in the digital world in a meaningful way.”<br>—<cite>The Hon. Mélanie Joly, Minister of Tourism, Official Languages and La&nbsp;Francophonie</cite></p></blockquote><h2>Quick facts</h2><ul><li>Since the Francophonie Summit in Yerevan, the International Organisation of La Francophonie is made up of 88 member states and governments; of these, 54 are full members, 7 are associate members, and 27 are observers.</li><li>Armenia joined the International Organisation of La Francophonie in 2004 as an observer, and became an associate member in 2008.</li><li>Armenia obtained full member status in the IOF in 2012.</li><li>The 18th Francophonie Summit will take place in Tunis, Tunisia, and will coincide with celebrations marking the 50th anniversary of La&nbsp;Francophonie.</li></ul><h2>Related product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2018/10/13/prime-minister-announces-significant-support-while-attending-xvii\">The Prime Minister announces significant support while attending the XVII Francophonie Summit</a></li></ul><h2>Associated links</h2><ul><li><a href=\"https://www.francophonie.org/sommet-erevan\">18th Francophonie Summit</a></li><li><a href=\"https://www.francophonie.org/Welcome-to-the-International.html\">International Organisation of La Francophonie</a></li><li><a href=\"https://www.canada.ca/en/canadian-heritage/services/international-francophonie.html\">Canada and La Francophonie</a></li></ul></div>\n      "
}