{
  "path": "/en/news/readouts/2022/03/08/prime-minister-justin-trudeau-meets-nato-secretary-general-jens",
  "pageTitle": "Prime Minister Justin Trudeau meets with NATO Secretary General Jens Stoltenberg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met today with the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg, in Riga, Latvia.</p>\n\n<p>Prime Minister Trudeau and Secretary General Stoltenberg strongly condemned Russia’s further aggression against the territorial integrity, sovereignty, and independence of Ukraine. They called for Russia’s immediate withdrawal of military forces, and the urgent need for civilians to be able to access humanitarian corridors and assistance.&nbsp;</p>\n\n<p>The two leaders insisted on the vital need to impose strong measures against Russia to stop its further aggression, while also increasing material support to the Ukrainian government, military, and people.</p>\n\n<p>Secretary General Stoltenberg welcomed Canada’s commitment to renew Operation REASSURANCE, Canada’s support to NATO’s assurance and deterrence measures, and sees the presence of NATO troops from across the organization as a strong deterrent to further Russian aggression and a powerful symbol of NATO unity.</p>\n\n<p>Prime Minister Trudeau thanked the Secretary General for his outstanding leadership throughout the crisis and looked forward to the upcoming NATO Summit to be hosted by Spain in June 2022.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-reassurance.html\">Operation REASSURANCE</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n</ul></div>\n      "
}