{
  "path": "/en/news/news-releases/2016/05/17/governor-general-canada-visit-united-states",
  "pageTitle": "Governor General of Canada to visit the United States | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Excellency, the Right Honourable David Johnston, Governor General of Canada, will travel to the United States from May 24 to 31, 2016 – with stops in Atlanta, Miami, Dallas, Oklahoma City, and Denver.</p>\n<p>During the visit, the Governor General will meet with business and political leaders, as well as with innovation, research, and academic partners to build upon the depth and diversity of Canada’s ties with the United States. &nbsp;</p>\n<p>The Governor General will also visit Tinker Air Force Base in Oklahoma City, as well as the North American Aerospace Defense Command (NORAD) in Colorado Springs during the U.S. Memorial Day weekend. The Governor General, in his capacity as Canada’s Commander-in-Chief, will pay tribute to Canadian and American active and fallen service members.</p>\n<p><strong>Quote</strong></p>\n<p>“Canada and the United States share one of the most important bilateral relationships in the world – and Canadians and Americans share the same values and the same origins. We face many of the same challenges and we are all better off when we tackle these issues together.”</p>\n<p>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>This will be His Excellency’s 6th visit to the United States. He has previously visited Hawaii in 2012, Boston and New York in 2013, the U.S. West Coast (Los Angeles, San Diego, San Francisco and Seattle) in 2014, the Midwest (Detroit, Minneapolis and Chicago) in 2015, and Washington, D.C. in 2016.</li>\n<li>The United States is Canada’s closest partner and ally. Both countries are working together on challenges they face today, on trade, energy, climate change, and international security.</li>\n<li>Canada and the United States share the largest trading relationship in the world, with $881 billion in annual two-way trade in 2015, representing over $2.4 billion worth of goods and services crossing the border every day.</li>\n</ul></div>\n      "
}