{
  "path": "/en/news/statements/2017/10/18/statement-prime-minister-canada-persons-day",
  "pageTitle": "Statement by the Prime Minister of Canada for Persons Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today issued the following statement for Persons Day:</p><p>“Today, we celebrate <a href=\"http://www.swc-cfc.gc.ca/commemoration/pd-jp/index-en.html\">Persons Day</a>, a turning point for women’s rights in Canada. On this day in 1929, women were finally recognized as ‘persons’ and won the right to be appointed to the Senate.</p><p>“Five determined women from Alberta won this groundbreaking victory that defined the future of our country. Emily Murphy, Nellie McClung, Irene Parlby, Louise McKinney, and Henrietta Muir Edwards – known as the <a href=\"http://www.swc-cfc.gc.ca/commemoration/pd-jp/five-cinq-en.html\">Famous Five</a> – fought for two years to expand women’s rights and extend the reach of their voices. In its final decision, the Judicial Committee of the Privy Council of Great Britain, Canada’s highest court of appeal at that time, rightly noted that ‘the exclusion of women from all public offices is a relic of days more barbarous than ours.’ With those words, democracy in Canada took a major step forward.</p><p>“The Famous Five were trailblazers for social justice. Their victory was one of many milestones in the push for gender equality and for a more just world. Thanks to their efforts, and to those of many others, we have made important progress – but we have much more work to do to make gender equality a reality in Canada and around the world.</p><p>“It is unacceptable that women and girls around the world do not have the same opportunities as men and boys, and struggle to receive the recognition they deserve. All of us benefit when the rights of women and girls are protected, and their voices are heard – and each of us has a role to play to build a truly gender equal world.</p><p>“That is why gender equality is a priority that drives all of our actions as a Government. It is why we are working to strengthen women’s leadership in our own Cabinet and our appointment process, while facilitating new opportunities more broadly in business and government. It is why we have committed to implement pay equity legislation, and why we have made empowering women and girls the focus of our international assistance policy. Women’s voices matter, women’s rights are human rights, and all of us are affected by the challenges we face as a world. To meet those challenges, we must ensure that all people – no matter their gender identity – feel empowered to speak up and be active in all areas of our society.</p><p>“On Persons Day, we pay tribute to five women who fought to make us a more inclusive and equal country. Their work paved the way for subsequent generations to continue their push for equality and justice. It is up to all of us, no matter our gender identity, to carry on their important work and make gender equality a reality in Canada and around the world.”</p></div>\n      "
}