{
  "path": "/en/news/statements/2019/01/22/statement-prime-minister-third-anniversary-shootings-la-loche",
  "pageTitle": "Statement by the Prime Minister on the third anniversary of the shootings in La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the third anniversary of the deadly shootings in La Loche, Saskatchewan:</p><p>“Three years ago today, a senseless attack in the community of La Loche, Saskatchewan, killed four Canadians and seriously injured seven more.</p><p>“On this solemn anniversary, we remember the victims, and offer our deepest sympathies to everyone who continues to live with the pain and trauma from that horrific day.</p><p>“In a tragedy like this one, words will never be enough. The victims were young, with their whole lives in front of them. When they were taken away from us, so were their hopes and dreams for the future. Such loss is immeasurable.</p><p>“We find comfort in the actions of first responders, Indigenous leaders, and front-line service providers whose courage and professionalism three years ago saved lives and prevented even greater tragedy.</p><p>“For the people of La Loche, difficult days, months, and years have followed. Yet, despite unimaginable grief and loss, they move forward, determined to heal and rebuild.</p><p>“We know more needs to be done so that people in Canada, Indigenous and non-Indigenous alike, feel safe and have access to the support they need within their communities. We will continue to work in partnership with Indigenous peoples, and municipal, territorial, and provincial governments, to address the issues facing La Loche and other places across the country.</p><p>“On behalf of the Government of Canada, I hope all Canadians join me today in remembrance of those we lost, and in solidarity with all those whose lives were forever changed on January 22, 2016. To the people of La Loche: you’re in our hearts, and continue to have our unwavering support.”</p></div>\n      "
}