{
  "path": "/en/news/readouts/2020/03/30/prime-minister-justin-trudeau-speaks-quebec-premier-francois-legault",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Quebec Premier François Legault | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Quebec Premier François Legault to discuss the evolving COVID-19 situation.</p>\n\n<p>Both leaders reaffirmed their commitment to continued collaboration and coordination between their respective governments in addressing COVID-19. They discussed the measures announced by the Government of Canada to support workers and businesses under Canada’s COVID-19 Economic Response Plan.</p>\n\n<p>They also discussed preparations and actions undertaken by the federal government and its provincial and territorial partners to address the evolution of COVID-19. They agreed that it is critical for governments to work together in order to obtain essential data and information.</p>\n\n<p>The Government of Canada is taking a whole-of-government, comprehensive, and coordinated approach to respond to COVID-19. The well-being and safety of Quebecers and all Canadians is the Government’s top priority.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/29/prime-minister-announces-support-vulnerable-canadians-affected-covid\">Prime Minister announces support for vulnerable Canadians affected by COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts\">Prime Minister announces support for small businesses facing impacts of COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/23/canadas-plan-mobilize-science-fight-covid-19\">Canada’s plan to mobilize science to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n</ul></div>\n      "
}