{
  "path": "/en/news/news-releases/2019/01/29/prime-minister-releases-ministerial-mandate-letter-minister-jordan",
  "pageTitle": "Prime Minister releases ministerial mandate letter for Minister Jordan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today released a new ministerial mandate letter to reflect recent changes to the Ministry and to guide the Government’s ongoing commitment to spur economic growth and create good, middle class jobs across the country.</p><p>Over the past three years, the Government has taken significant strides to fulfill its mandate and deliver meaningful results for Canadians. This month, we took another important step to ensure those results reach Canadians living in rural and remote areas by naming the new Minister of Rural Economic Development, Bernadette&nbsp;Jordan.</p><p>The mandate letter for Minister Jordan outlines the critical role that rural Canada plays to grow our economy and create good, middle class jobs. Working with Cabinet colleagues, Minister Jordan will develop a whole-of-government rural economic development strategy to diversify and strengthen rural economies, and create more opportunities for rural Canadians.</p><p>Minister Jordan will lead efforts to bring high-speed internet access to more people and businesses in rural Canada. She will also take action to help rural Canadians better access social programs that meet their needs, such as finding affordable housing and childcare.</p><p>Today’s announcement reaffirms the Government’s commitment to be the most open and accessible government possible, and deliver real, meaningful progress for Canadians.</p><h2>Quote</h2><blockquote><p>“We know that Canadians living and working in rural areas face unique challenges, and that’s why we created this new role – to make sure they have the support and resources that respond to their needs. Whether it’s securing funding for important infrastructure projects, having a reliable internet connection so their businesses can grow, or finding local childcare services, rural Canadians should have access to what they need to provide for their families and succeed in the digital economy. When our rural communities thrive, Canada thrives.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>Publicly available mandate letters make it easier for Canadians to hold the government to account for its commitments. As part of a plan for a more open and transparent government, they are an important tool that allows Canadians to see the Prime Minister’s expectations for each minister and gives them a clear idea of how the government will deliver its agenda.</li><li>Mandate letters outline the policy objectives that each minister will work to accomplish, as well as the pressing challenges that each minister will address in their role. They are not an exhaustive list of all files a minister will work on.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/mandate-letters\">Mandate letters</a></li></ul></div>\n      "
}