{
  "path": "/en/news/statements/2018/07/09/statement-prime-minister-nunavut-day",
  "pageTitle": "Statement by the Prime Minister on Nunavut Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Nunavut Day:</p><p>“Twenty-five years ago today, the Parliament of Canada passed two important pieces of legislation, which led to the creation of Nunavut as a recognized territory within Canada. Today, we join communities across Nunavut to mark this important milestone, and celebrate the unique heritage and identity of the people who call Nunavut home.</p><p>“Nunavut, which in Inuktitut means ‘our land,’ is rich in tradition, culture, and sense of community, thanks to generations of Inuit who have cared for and lived on the land for millennia. From Sanikiluaq to Grise Fiord, Nunavut is home to vast landscapes, vibrant languages, and many peoples. Forward-looking, resilient, and diverse, Canada’s youngest territory embodies our promise as a country.</p><p>“Canada is an Arctic country, and the North is at the heart of our identity as Canadians. In close collaboration with Indigenous, territorial, and provincial partners, we are working to co-develop an <a href=\"https://www.aadnc-aandc.gc.ca/eng/1503687877293/1503687975269\">Arctic Policy Framework</a> that will help us to better address the needs and priorities of the North, and create opportunities for people across the Arctic.</p><p>“As we look to Canada’s future prosperity, we know that Nunavut will continue to play a key role. The traditional knowledge held by the people in the territory – a young and growing population – will help lead the way to a more inclusive, sustainable future for all of us.</p><p>“On behalf of the Government of Canada, I wish Nunavummiut and all Canadians a happy Nunavut Day!”</p><hr><p>&nbsp;Also available in&nbsp;<a href=\"/en/news/statements/2018/07/09/ᐅᖃᐅᓯᒃᓴᕆᔭᐅᔪᖅ-ᓯᕗᓕᖅᑎᕐᔪᐊᕐᒧᑦ-ᓄᓇᕗᑦ-ᐅᓪᓗᖓᓂ\">Inuktitut</a>.</p></div>\n      "
}