{
  "path": "/en/news/news-releases/2021/07/14/strengthening-transportation-infrastructure-safety-and-well-being",
  "pageTitle": "Strengthening transportation infrastructure for the safety and well-being of the Îles-de-la-Madeleine community | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Safe and secure access to transportation infrastructure, including port facilities, is of vital importance to coastal communities and businesses in Quebec and across the country. That is why the Government of Canada is taking action to strengthen the infrastructure that businesses depend on, protect the jobs of hard-working Canadians, and support the well-being of communities. As we look to the future and prepare for our recovery from the COVID-19 pandemic, the safety and well-being of Canadians will remain our top priorities.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the next steps in the Government of Canada’s plan to ensure continued operations at the fishers’ wharf at the Port of Cap-aux-Meules in the Îles-de-la-Madeleine, Quebec. This plan will help protect wharf users while strengthening the local community and the economy of the Îles-de-la-Madeleine.</p>\n\n<p>The fishers’ wharf at the Port of Cap-aux-Meules is the Îles-de-la-Madeleine’s maritime gateway. The results of the last detailed inspection of the wharf, which were revealed in February 2021, confirmed that the structure had deteriorated significantly. Last winter, access restrictions also had to be put in place to protect the Madelinots. To ensure the safety of wharf users and allow continued operations, the Government of Canada plans to install a barge alongside the wharf by the next fishing season in April 2022 in order to provide additional moorage. The government will also conduct a study to determine what repairs are required to allow the wharf to continue to serve the local community.</p>\n\n<p>The Government of Canada will also withdraw the Port of Cap-aux-Meules from the Port Asset Transfer Program, which demonstrates its commitment to ensuring the viability of the fishers’ wharf at the Port of Cap-aux-Meules. The Government of Canada takes the economic needs of the Îles-de-la-Madeleine community and communities across the country seriously. That is why the government will continue to do whatever is necessary to find short- and longer-term solutions to ensure the safety and well-being of Canadians, protect their jobs, and rebuild a strong economy that works for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“The Madelinots, like communities across the country, have shown remarkable strength and resilience since the start of the pandemic. The Port of Cap-aux-Meules plays an essential role in the Îles-de-la-Madeleine, whether in transportation, fishing, or tourism. Today’s announcement demonstrates that the government is listening to the Îles-de-la-Madeleine community and is doing what is necessary to protect the future of the wharf and the good jobs that depend on it.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“These actions demonstrate our government's strong commitment to the wharf and the Îles-de-la-Madeleine community. We will take concrete action to find the best way to ensure a better future for the wharf.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Government of Canada conducts regular maintenance and annual inspections to ensure the safety of its facilities and of activities taking place on those sites.</li>\n\t<li>The government will consult with users as part of its study in advance of the repair work. Design details are being developed with a view to issuing a mandate for a study no later than September 2021.</li>\n\t<li>For any operational questions, Canadians can contact port management at 418‑937-7635. For all other inquiries, please send an email to&nbsp;<a href=\"mailto:TC.QUEPorts-PortsQUE.TC@tc.gc.ca\">TC.QUEPorts-PortsQUE.TC@tc.gc.ca</a>.</li>\n</ul>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/03/transport-canada-ensures-peoples-safety-and-the-continuity-of-activities-at-the-fishers-wharf-at-cap-aux-meules.html\">Transport Canada ensures peoples’ safety and the continuity of activities at the fishers’ wharf at Cap-aux-Meules</a></li>\n\t<li><a href=\"https://tc.canada.ca/en/programs/ports-asset-transfer-program\">Port Asset Transfer Program</a></li>\n</ul></div>\n      "
}