{
  "path": "/en/news/statements/2019/09/02/statement-prime-minister-labour-day",
  "pageTitle": "Statement by the Prime Minister on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p>\n\n<p>“On Labour Day, we celebrate the workers who have built our country and made workplaces from coast to coast to coast safer, more equitable, and more just.</p>\n\n<p>“This year marks the 100th anniversary of the Winnipeg General Strike, one of the most influential strikes in Canadian history. It launched a labour movement that fought for – and won – many of the benefits and protections Canadian workers can count on today. From universal healthcare to fair wages, weekends, and paid vacations, the movement transformed the lives of millions of Canadians, and laid the foundations of a growing economy and a strong middle class.</p>\n\n<p>“A century later, Canadian workers remain at the heart of building a stronger Canada and a better future. Our government is proud to be their ally and partner. Since 2015, the Government of Canada has made major strides to support Canadian workers – thanks in part to the incredible advocacy of workers and unions across the country. Together, we protected collective bargaining rights, and repealed anti-union legislation passed in 2014 and 2015. We worked with our provincial partners to strengthen the Canada Pension Plan. We passed new regulations to stop the use of new asbestos in Canada, as well as legislation to protect employees from harassment and violence, and make workplaces safer. And in the last four years, we’ve seen the creation of over a million new jobs for people from coast to coast to coast.</p>\n\n<p>“Our government has also made unprecedented investments in skills training, to help Canadians get the skills and experience they need to succeed in a rapidly changing job market and an increasingly competitive global economy. Budget 2019 announced the new <a href=\"https://www.budget.gc.ca/2019/docs/themes/good-jobs-de-bons-emplois-en.html\">Canada Training Benefit</a> to help provide workers with the time and money to improve their skills or learn new ones. We are also making post-secondary education more affordable, <a href=\"https://pm.gc.ca/en/news/news-releases/2019/08/16/new-advisory-committee-promote-well-paying-careers-skilled-trades\">promoting good-quality careers in the skilled trades</a>, and taking steps to make sure that in the future there is a work placement for every student who wants one.</p>\n\n<p>“Canadian workers are the backbone of our success, and our future. We will always stand up for workers and their families, and make sure they have the support they need to succeed in the jobs of today and tomorrow.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish all Canadians a safe and happy Labour Day.”</p></div>\n      "
}