{
  "path": "/en/news/news-releases/2022/02/03/lower-child-care-fees-manitoba-families",
  "pageTitle": "Lower child care fees for Manitoba families | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Too many families across Canada lack access to affordable, inclusive, and high‑quality child care. That is why the Government of Canada has laid out a plan to provide Canadian parents with, on average, $10‑a‑day child care for children under six years old. This plan will make life more affordable for families, create new jobs, get parents – especially women – back into the workforce, and grow the middle class, while giving every child a real and fair chance at success.</p>\n\n<p>The Prime Minister, Justin Trudeau, virtually joined the Premier of Manitoba, Heather Stefanson, today to announce that child care fees for thousands of Manitoba families with children age six and under will be reduced by up to 50&nbsp;per cent, saving them hundreds of dollars a month.</p>\n\n<p>As of February 6, 2022, Manitoba will expand eligibility for its Child Care Subsidy Program to help over 12,000 more children from low and middle-income families access affordable, inclusive, and high-quality child care. With this change, Manitoba is one step closer to the 50 per cent fee reduction, on average, for all parents by the end of the year. This is a first, important step in reducing child care fees for Manitoba families and achieving an average of $10‑a‑day care by March 2023 for children age six and under, three years ahead of our goal of achieving an average of $10‑a‑day care across Canada.</p>\n\n<p>The time for a Canada‑wide early learning and child care system is now. Last week, the governments of Canada and Nunavut took another significant step forward in ensuring this system becomes a reality by signing a historic early learning and child care agreement. The Government of Canada will continue to work with provinces, territories, and Indigenous partners across the country to ensure that all families have access to affordable, inclusive, and high‑quality early learning and child care no matter where they live.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“All families should have access to affordable child care and that is why we’re making $10‑a‑day child care a reality across the country. The reduction of fees announced today is an important step forward to delivering on our Canada‑wide early learning and child care system, which will save Manitoba families thousands of dollars each year, create jobs, grow the middle class, and give our children the best start in life.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our government is committed to working with the federal government and early childhood educators to build a community-based system of quality, affordable, and inclusive early learning and child care programs and services for Manitoba families – and today, we are taking an important step in achieving our collective goal. Improving access to affordable child care will support more Manitobans, especially women, to upgrade their training, participate in our economy, and play a key role in our pandemic recovery.”</p>\n\n<footer class=\"default\">The Hon. Heather Stefanson, Premier of Manitoba</footer>\n</blockquote>\n\n<blockquote>\n<p>“Access to affordable and high-quality child care is both an economic and social policy. It gives our children the best possible start in life, makes life more affordable for families with children, and enables both mothers and fathers to work, thereby increasing the workforce. It also creates good, well-paying jobs for educators. Today’s announcement will lower child care fees by up to 50 per cent in Manitoba this year, making life more affordable for many young families. And it will help strengthen the Manitoban and Canadian economies as we build $10-a-day child care.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Government of Canada’s goal is to ensure that by the end of March 2026, all families in Canada, no matter where they live, will have access to regulated early learning and child care for an average of $10 a day. The reduction of fees announced today in Manitoba is a meaningful step toward achieving that goal and will make a real difference for families across the province. We will continue to work with Manitoba to help ensure that children have access to the high‑quality, affordable, and inclusive early learning and child care they need to succeed.”</p>\n\n<footer class=\"default\">The Hon.&nbsp;Karina Gould, Minister of Families, Children and Social Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Canada-wide Early Learning and Child Care Agreement action plan helps to ensure an additional 12,000 children receive access to subsidized child care services and to support a strong and qualified workforce. We recognize and appreciate the dedication that has always been demonstrated by the early learning and child care sector. To further invest, strengthen, and stabilize our early childhood educator workforce, we are finalizing the new Early Childhood Workforce funding agreement in partnership with the federal government, which will offer a one‑time investment to initiate longer‑term planning and supports for the workforce.”</p>\n\n<footer class=\"default\">The Hon. Wayne Ewasko, Manitoba’s Minister of Education and Early Childhood Learning</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>To date, the Government of Canada has reached early learning and child care agreements with the governments of <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">British Columbia</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/13/nova-scotian-families-benefit-early-learning-and-child-care-agreement\">Nova Scotia</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/07/23/canada-and-yukon-announce-major-expansion-10-day-child-care\">Yukon</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/27/10-day-child-care-families-prince-edward-island\">Prince Edward Island</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/28/10-day-child-care-families-newfoundland-and-labrador\">Newfoundland and Labrador</a>, <a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">Manitoba</a>, <a href=\"https://deputypm.canada.ca/en/news/news-releases/2021/08/13/10-day-child-care-families-saskatchewan\">Saskatchewan</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/15/10-day-child-care-families-alberta\">Alberta</a>, <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/13/10-day-child-care-families-new-brunswick\">New Brunswick</a>, the <a href=\"https://pm.gc.ca/en/news/news-releases/2021/12/15/10-day-child-care-families-northwest-territories\">Northwest Territories</a>, and <a href=\"https://pm.gc.ca/en/news/news-releases/2022/01/24/10-day-child-care-families-nunavut\">Nunavut</a>. The governments of Canada and Quebec also <a href=\"https://pm.gc.ca/en/news/news-releases/2021/08/05/new-agreement-strengthen-early-learning-and-child-care-system-quebec\">reached an asymmetric agreement</a> to strengthen the early learning and child care system in the province.</li>\n\t<li>As part of the agreement with Manitoba, the Government of Canada is investing $1.2&nbsp;billion over five years to help improve regulated early learning and child care for children age six and under in the province.</li>\n\t<li>To expand eligibility for its Child Care Subsidy Program, Manitoba is increasing the net annual household income threshold and allowable deductions by 45&nbsp;per cent. Of the 38,000 spaces available in the regulated child care system, 6,000 children, or approximately 16&nbsp;per cent, currently receive a full or partial child care subsidy. With the increases in eligibility, it is estimated that 12,000 additional children will receive support to access regulated child care, particularly in low and middle-income families. It will apply to parents with children up to 12 years old, and is supported jointly by federal funding supporting children age six and under and by provincial funding supporting children ages seven to 12.</li>\n\t<li>With today’s announcement, Manitoba joins Saskatchewan, Prince Edward Island, Alberta, and Nova Scotia, who have already announced a reduction of child care fees, in working towards the commitment under the Canada‑wide early learning and child care system to reduce fees for parents with children in regulated child care spaces by 50&nbsp;per cent on average by the end of 2022. The Governments of Quebec and Yukon have already achieved an average cost of $10-a-day or lower for regulated child care.</li>\n\t<li>By the end of March 2026, Manitoba expects to create 23,000 new full‑time regulated early learning and child care spaces for children age six and under.</li>\n\t<li>As part of Budget 2021, the Government of Canada made a transformative investment of over $27&nbsp;billion over five years to build a Canada-wide early learning and child care system with provinces and territories. Combined with other investments, including in Indigenous early learning and child care, up to $30&nbsp;billion over five years will be provided in support of early learning and child care.</li>\n\t<li>Through previous investments in early learning and child care, the Government of Canada helped to create over 40,000 more affordable child care spaces across the country prior to the pandemic, including over 700 in Manitoba.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/news/2021/08/000997---hussen---elcc-agreement-with-manitoba.html\">$10-a-day child care for families in Manitoba</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10-a-day child care for Canadian families</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/05/28/making-life-more-affordable-canadian-parents\">Making life more affordable for Canadian parents</a></li>\n\t<li><a href=\"https://www.canada.ca/en/revenue-agency/services/child-family-benefits/canada-child-benefit-overview.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_canada-child-benefit\">Canada Child Benefit</a></li>\n</ul></div>\n      "
}