{
  "path": "/en/news/readouts/2019/12/11/prime-minister-and-deputy-prime-minister-speak-first-ministers-new-north",
  "pageTitle": "Prime Minister and Deputy Prime Minister speak with First Ministers on the new North American Free Trade Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau and Deputy Prime Minister and Minister of Intergovernmental Affairs Chrystia Freeland spoke today with provincial and territorial Premiers to discuss the new North American Free Trade Agreement (NAFTA).</p>\n\n<p>Canada, the United States, and Mexico have agreed to amendments that will ensure that rules-based trade between the three countries will continue to support the economic prosperity of our people and the global competitiveness of North America as a region, ultimately making NAFTA better.</p>\n\n<p>The Prime Minister, Deputy Prime Minister and Premiers noted that the modernization of NAFTA is of critical importance for the three countries and for the provinces and territories. The Prime Minister and Deputy Prime Minister highlighted that this progressive trade agreement will be profoundly beneficial for our economies, for Canadian families, and for the middle class. They noted that NAFTA is essential for hundreds of thousands of Canadian workers, preserving critical cross-border supply chains and significantly increasing workers’ rights across North America.</p>\n\n<p>The Prime Minister, Deputy Prime Minister and Premiers discussed the close collaboration between Canadian negotiators and officials from the provinces and territories. The Prime Minister thanked the Premiers for joining together in a whole-of-Canada effort, and acknowledged their hard work and support during the negotiation over the past years. The Prime Minister committed to continued engagement with Premiers as the three countries work toward ratification and implementation of the new NAFTA. The Prime Minister, Deputy Prime Minister and Premiers noted that provinces and territories will continue to play an important role in promoting Canada’s trade interests and strengthening ties with our international partners for the benefit of all Canadians.</p>\n\n<p>The Prime Minister and Deputy Prime Minister reaffirmed their commitment to work closely with the United States and Mexico to ratify and implement the new NAFTA, and to continue to vigorously defend Canadian interests internationally to obtain the best possible outcomes for Canadians.&nbsp;</p></div>\n      "
}