{
  "path": "/en/news/news-releases/2016/11/24/prime-minister-trudeau-concludes-visit-liberia",
  "pageTitle": "Prime Minister Trudeau concludes visit to Liberia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his first official visit to Liberia. The visit will help Canada meet several of its top foreign policy objectives: empowering women and girls, promoting human rights, re-engaging with Africa, and addressing the pressing challenges facing the continent.</p><p>In Monrovia, Prime Minister Trudeau met with Liberian President Ellen Johnson Sirleaf to discuss issues of mutual interest, including peace and security, gender equality, and economic growth which benefits all Liberians, particularly youth.</p><p>The Prime Minister and President Johnson Sirleaf met with prominent women leaders, including Phumzile Mlambo-Ngcuka, Executive Director of UN Women, Mahawa Kaba Wheeler, Director for Women, Gender and Development with the African Union, Zainab Hawa Bangura, Special Representative of the United Nations Secretary-General on Sexual Violence in Conflict, local community activists and youth. Prime Minister Trudeau underscored Canada’s commitment to empowering women and girls, recognizing gender equality as being essential to sustainable development and inclusive peace.</p><p>The Prime Minister also visited a local school where he saw first-hand how Canadian development assistance and Canadian partners are playing a key role in education, and in helping young Liberians gain the skills needed to participate more fully in society.</p><p>During his official visit, the Prime Minister announced over $12.5 million in new initiatives aimed at supporting democracy, peace and security, inclusion, and gender equality in Africa.</p><p>The Prime Minister will now travel to Madagascar where he will participate in the Summit of La Francophonie.</p><h2>Quotes</h2><blockquote><p>“It was a true honour today to meet with Nobel Laureate President Johnson Sirleaf and others to discuss ways that Canada can help empower young women and girls across the continent to achieve their dreams. The President’s unique perspective, as Africa’s first woman to be elected Head of State, and her accomplishments are both inspirational and a sign of things to come.\"<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Without stability, people cannot prosper and development cannot take root. As we strengthen Canada’s international engagement, Africans can count on Canada’s unwavering support in its efforts to achieve a more peaceful, safer, and prosperous continent.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Diplomatic relations between Canada and Liberia were established in 1971.</li><li>Canada and Liberia share many values including democracy, peace and security, the rule of law, and gender equality.</li><li>President Ellen Johnson Sirleaf was the first woman elected Head of State in Africa. She was awarded the Nobel Peace Prize in 2011, along with two other laureates, for her non-violent struggle for the safety of women and for women’s rights to full participation in peacebuilding work.</li><li>In 2014-2015, Canada provided more than $24 million in development assistance to Liberia, in the areas of health, education, food security, and the environment.</li></ul><h2>Related product</h2><ul><li>Backgrounder – <a href=\"/en/news/backgrounders/2016/11/24/canada-announces-new-support-gender-equality-inclusion-peace-and\">Canada announces new support for gender equality, inclusion, peace and security and democracy in Africa</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/cotedivoire/bilateral_relations_bilaterales/canada_liberia-liberie.aspx?lang=eng\">Canada-Liberia Relations</a></li></ul></div>\n      "
}