{
  "path": "/en/news/statements/2018/12/24/statement-prime-minister-christmas",
  "pageTitle": "Statement by the Prime Minister on Christmas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Christmas:</p><p>“Merry Christmas, Canada!</p><p>“Today, our family joins Christians across the country and around the world to celebrate the birth of Christ.</p><p>“It’s a time to spread joy and cheer, appreciate our blessings, and honour traditions – whether that’s opening presents, decorating the Christmas tree, sharing a meal together, or setting aside a couple of cookies for Santa.</p><p>“We’re also well into winter, from coast to coast to coast – and here in Canada, we’ve always known how to smile through the cold days and long nights. This time of year, that Canadian spirit shines through most – because this season is about bringing light to the people around us.</p><p>“We also know this is a difficult time for some families. For Canadian Armed Forces members who are far from home, it’s just one example of the many sacrifices you and your families make. We’re thinking of you, and we’re grateful for everything you do for Canadians.</p><p>“And we’re thinking too of hardworking Canadian families who might be struggling to make ends meet this Christmas. Our government is working hard to make things a little easier for you – whether by putting the first ever National Housing Strategy into action, supporting seniors, or putting more money in the pockets of nine out of ten families with the Canada Child Benefit.</p><p>“We will always stand with you, because that’s what Canadians do. We pull together – with our families, our neighbours, and folks in need anywhere. We find strength in our differences, and celebrate everything we have in common. And we do our part to take care of each other, and make life better for the people around us. That’s what Christmas – and Canada – is all about.</p><p>“This season and on into the new year, let’s stand together, celebrate each other, and keep building a brighter future for all of us. From our family to yours, Sophie, Xavier, Ella-Grace, Hadrien, and I wish you joy, health, love, and peace this holiday season. Merry Christmas.”</p></div>\n      "
}