{
  "path": "/en/news/news-releases/2018/03/26/prime-minister-delivers-statement-exoneration-six-tsilhqotin-chiefs",
  "pageTitle": "Prime Minister delivers a statement of exoneration for six Tsilhqot’in Chiefs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Canada continues its journey of reconciliation and renewal with Indigenous Peoples, we need to confront our history so we can build a new nation-to-nation relationship guided by the recognition of rights and the values of respect and partnership.</p>\n\n<p>The Prime Minister, Justin Trudeau, today delivered a statement of exoneration on behalf of the Government of Canada to the Tsilhqot’in Nation and the descendants of six Tsilhqot’in Chiefs. He confirmed the posthumous exoneration of all six chiefs – Chief Lhats’as?in, Chief Biyil, Chief Tilaghed, Chief&nbsp;Taqed, Chief&nbsp;Chayses, and Chief&nbsp;Ahan.</p>\n\n<p>These chiefs were leaders and warriors of the Tsilhqot’in&nbsp;Nation who acted in accordance with their laws and traditions, and are regarded by their people as heroes. They fought against the colonial government of the time, ultimately leading to their hanging in 1864 and 1865. Prime Minister Trudeau acknowledged that the capture, arrest, and hanging of the six Chiefs was borne of a profound lack of respect for the Tsilhqot’in people, traditions, and territory.</p>\n\n<p>The posthumous exoneration of these six leaders of the Tsilhqot'in Nation is an important symbol of the Government of Canada's commitment to reconciliation.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“I know that this posthumous exoneration cannot by itself repair the damage that has been done.It is my sincere hope, though, that it will allow healing to begin as Canada and the Tsilhqot’in Nation embark on a new journey together toward reconciliation. This is another important step forward to recognize and support the implementation of the rights of the Tsilhqot’in and all Indigenous Peoples, enshrined in our Constitution.”<br>\n—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“Our people’s journey to this place of reconciliation has been long and enduring. 154 years have passed where our truth has gone unrecognized. Under a flag of truce, our Chiefs were wrongfully shackled, tried, and hanged. We have always been proud of the sacrifices made by our Chiefs, who are heroes to our people, and continue to inspire and guide the work of the future.&nbsp;Today, Canada has finally acknowledged that our warriors did no wrong.”</p>\n\n<p>“The Chilcotin War has defined us as who we are today – building our spirit and shaping our perseverance. The deceit we faced 154 years ago can never be forgotten, but we can move forward on a different path, a new journey, one carved out by a mutual understanding and respect of our rights, title, and ways of life. We are prepared to work with Canada to transform the lives of our people and this country – in a way that ensures our children will not have to see such things as Murdered and Missing Indigenous Women, high Indigenous incarceration rates, or over representation of Indigenous children in the foster care system.”<br>\n—<cite>Chief Joe Alphonse, Tribal Chairman, Tsilhqot’in National Government</cite></p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In the spring of 1864, the Tsilhqot’in Chiefs led their nation’s war effort in response to a colonial road crew attempting to build a road through their territory without any legal agreement with the Tsilhqot’in Nation.</li>\n\t<li>In the summer of 1864, one of the leaders of the colonial militia sent the Tsilhqot'in Chiefs a sacred gift of tobacco and, with it, an invitation to discuss terms of peace. Head War Chief Lhats’as?in and his men accepted the offer and went to the colonial camp to negotiate peace. Instead, they were arrested, imprisoned, and convicted.</li>\n\t<li>On October 26, 1864, five Tsilhqot’in Chiefs were hanged for murder: Head&nbsp;War Chief Lhats’as?in, Chief&nbsp;Biyil, Chief&nbsp;Tilaghed, Chief&nbsp;Taqed, and Chief&nbsp;Chayses. They are buried in Quesnel, British Columbia. Later, Chief&nbsp;Ahan was also hanged. He is buried in New Westminster, British Columbia.</li>\n\t<li>Today, the Tsilhqot’in people, including the descendants of those six chiefs, continue to live and care for Tsilhqot’in lands. They have continued to fight to preserve their territory and culture, right up to the historic Supreme Court of Canada decision of June 26, 2014, which recognized aboriginal title for the Tsilhqot’in Nation.</li>\n\t<li>A Letter of Understanding between Canada and the Tsilhqot’in Nation was signed in January 2017, marking another step toward reconciliation and recognition of our nation-to-nation relationship.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://scc-csc.lexum.com/scc-csc/scc-csc/en/item/14246/index.do\">Tsilhqot’in Nation v. British Columbia</a></li>\n\t<li><a href=\"https://www.aadnc-aandc.gc.ca/eng/1493905807283/1493906052383\">Letter of Understanding Between the Tsilhqot'in Nation and Canada: January 27, 2017</a></li>\n\t<li><a href=\"https://www.canada.ca/en/indigenous-northern-affairs/news/2017/11/the_government_ofcanadaandthetsilhqotinnationannounceintenttooff.html\">The Government of Canada and the Tsilhqot’in Nation Announce Intent to Offer Posthumous Exonerations to Six Tsilhqot’in Chiefs</a></li>\n\t<li><a href=\"/en/news/news-releases/2018/02/14/government-canada-create-recognition-and-implementation-rights\">Government of Canada to create Recognition and Implementation of Rights Framework</a></li>\n</ul></div>\n      "
}