{
  "path": "/en/news/readouts/2020/02/11/prime-minister-trudeau-convenes-incident-response-group-update-canadas",
  "pageTitle": "Prime Minister Trudeau convenes the Incident Response Group for an update on Canada’s response to the coronavirus | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss progress on the Government of Canada’s response to the novel coronavirus, including efforts to protect the health and safety of Canadians both at home and abroad. Deputy Prime Minister Chrystia Freeland, Minister of Health Patty Hajdu, Minister of Transport Marc Garneau, Minister of Public Safety and Emergency Preparedness Bill Blair, and Minister of Immigration, Refugees and Citizenship Marco Mendicino also participated.</p>\n\n<p>The Prime Minister received an update on cases of the virus in Canada and internationally. Ministers and officials remain in close contact with our international partners, including the G7 Health Ministers. The group discussed health and safety measures taken to prevent and limit the spread of the virus into Canada.</p>\n\n<p>The Prime Minister also received an update on actions taken to repatriate Canadians from Wuhan, China. The group discussed the successful arrival of Canada’s second chartered plane from Wuhan at the Canadian Armed Forces base in Trenton, Ontario, and steps being taken in collaboration with provinces to support arriving Canadians. The Government of Canada continues to work with local, provincial, and territorial health authorities to protect the health and safety of all Canadians. The risk to Canadians remains low.</p>\n\n<p>The group highlighted support for affected Canadians quarantined aboard a cruise ship off the coast of Japan, as well as the government’s continued consular support to Canadians. The group reaffirmed that Canadians should continue to follow all travel advisories, and avoid the spread of fear, stigma, and racism.</p>\n\n<p>The group also discussed the World Health Organization’s call for donations, to which Canada has responded with $2 million to help vulnerable countries prepare for and respond to the coronavirus. Over the past week, Canada has provided 16 tonnes of personal protective equipment to China to support the ongoing response to the outbreak.</p></div>\n      "
}