{
  "path": "/en/news/news-releases/2017/06/26/prime-minister-welcomes-appointment-new-clerk-house-commons",
  "pageTitle": "Prime Minister welcomes appointment of new Clerk of the House of Commons | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the appointment of <a href=\"/en/news/backgrounders/2017/06/26/biographical-notes-–-charles-robert\">Charles Robert</a> as the new Clerk of the House of Commons.</p><p>This appointment, which was approved by the House of Commons, is effective&nbsp;July 10, 2017.&nbsp;</p><p>Mr. Robert’s public service career and his expertise in legislative procedure span more than 35 years. He recently served as interim Clerk of the Senate and Clerk of the Parliaments and Chief Legislative Services Officer. He holds a Master’s Degree in Library Science from The University of Western Ontario, and a Bachelor’s Degree in History and Philosophy from McGill University.&nbsp;</p><p>The Prime Minister took the opportunity to thank Marc Bosc for his dedicated service as the Acting Clerk of the House of Commons. During his tenure as Acting Clerk, Mr. Bosc showed exemplary leadership in the House, to the benefit of all Canadians. Marc Bosc is a lifelong servant of the House and is recognized around the world for his work to support the functioning of democracy.</p><h2>Quote</h2><blockquote><p>“Charles Robert is an excellent choice for Clerk of the House of Commons. With his vast knowledge of rules, procedures, practices and precedent, along with his decades of dedicated public service, I have no doubt that Mr. Robert will continue to serve Canadians in the tradition of his predecessors and the House of Commons.”<br>– <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The primary role of the Clerk of the House of Commons, as chief executive of the House of Commons administration, is to advise the Speaker and all Members on the interpretation of parliamentary rules, precedents, and practices. The Clerk is at the service of all Members of the House of Commons, regardless of party affiliation, and must act with impartiality and discretion. &nbsp;</li><li>As set out in Chapter 13 (111.1) of the Standing Orders of the House of Commons, the nomination for this position is referred to the appropriate standing committee (i.e. the Standing Committee on Procedure and House Affairs). The appointment to the position is made by the Governor in Council in accordance with the <i>Public Service Employment Act</i>.</li><li>The new Clerk of the House of Commons was selected through the Government’s open, transparent, and merit-based appointment process.</li></ul><h2>Related Product</h2><p><a href=\"/en/news/backgrounders/2017/06/26/biographical-notes-–-charles-robert\">Biographical Notes – Charles Robert</a></p></div>\n      "
}