{
  "path": "/en/news/readouts/2020/06/16/prime-minister-justin-trudeau-speaks-president-mexico-andres-manuel-lopez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Mexico Andrés Manuel López Obrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of Mexico, Andrés Manuel López Obrador.</p>\n\n<p>The Prime Minister and the President discussed the COVID-19 situation in Canada and Mexico,&nbsp;and the significant measures being taken to protect the health and well-being of their citizens, in particular the most vulnerable in society.</p>\n\n<p>Prime Minister Trudeau thanked the President for Mexico’s assistance in repatriating Canadian travelers during the pandemic and expressed his condolences for the two Mexican citizens who have passed away from COVID-19 while working on farms in Canada.</p>\n\n<p>The Prime Minister and the President&nbsp;agreed that entry into force of the new NAFTA will strengthen the deep economic ties and longstanding friendship between Canada and Mexico, and support economic growth and recovery in both countries.</p>\n\n<p>The two leaders&nbsp;committed to continue working closely together bilaterally and in multilateral institutions to advance shared values.</p>\n\n<p>COVID-19 is a rapidly evolving global challenge. The Government of Canada is working closely with local, provincial, territorial, and international partners to minimize its health, economic, and social impacts in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/03/statement-deputy-prime-minister-canadas-ratification-new-nafta\">Statement by the Deputy Prime Minister on Canada’s ratification of the new NAFTA</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}