{
  "path": "/en/news/news-releases/2016/06/16/prime-minister-announces-new-infrastructure-agreement-british",
  "pageTitle": "Prime Minister announces new infrastructure agreement with British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada remains committed to making significant investments in infrastructure that will improve our public transit systems, strengthen Canadian communities, and help grow the economy.</p>\n<p>Today, the Prime Minister, Justin Trudeau, and Premier Christy Clark announced that an agreement has been reached that will result in more than $900 million being invested – by the Government of Canada, British Columbia, and municipalities – in public transit projects across the province.</p>\n<p>The agreement made today will reduce congestion and commute times, so that Canadian families can spend less time on the road, and more time with their loved ones. The investments will be used to expand bus lanes, add new railcars to the SkyTrain, and deliver the fixes that our transit systems have needed for decades.</p>\n<p>Investing in public transit creates good, well-paying jobs that can help the middle class grow and prosper today. When well-planned infrastructure makes it easier for middle class Canadians to get to work on time, bring their kids to soccer practice, or go to the grocery store, the entire economy benefits. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p><strong>Quotes</strong></p>\n<p>“Canadians have asked us to reduce congestion and commute times in their cities. This investment in public transit will help the people of British Columbia get home to their loved ones faster. It will also help to grow the middle class by improving business flows in municipalities while reducing environmental damage.”<br>- <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p>“British Columbia is leading Canada, and as our economy continues to grow, transit infrastructure needs to keep pace. This investment will help meet rising demand, ease congestion, lower our carbon footprint, and enhance our quality of life.”<br>- <em>Hon. Christy Clark, Premier of British Columbia</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>This funding is part of the first phase of <em>Investing in Canada</em>, the Government of Canada’s historic $120-billion plan to support infrastructure across the country over the next 10 years.</li>\n<li>Phase 1 of <em>Investing in Canada</em> will provide over $10 billion in immediate investments to support public transit systems, green infrastructure projects, and social infrastructure projects. Details on Phase 2 of <em>Investing in Canada</em> will be announced over the next year.</li>\n<li>Phase 1 funding provided under the Public Transit Infrastructure Fund will be managed through agreements between the Government of Canada and provincial and territorial governments.</li>\n<li>Under the agreement made today, the Government of Canada has made its funding retroactive to April 1, 2016, so projects can proceed without delay to help ensure a productive construction season this year.</li>\n<li>The investment announced today – $460 million from the Government of Canada’s new Public Transit Infrastructure Fund, and $308 million from the Province of British Columbia – will help make sure that public transit is keeping pace with the rapid growth of British Columbia. Funding will modernize public transit systems – including the SkyTrain and SeaBus services, as well as the rapid transit and provincial bus systems – to help move people and commerce more efficiently through B.C. municipalities.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"/en/news/backgrounders/2016/06/16/infrastructure-agreement-british-columbia-under-new-public-transit\">Backgrounder - Infrastructure agreement with British Columbia under new Public Transit Infrastructure Fund</a></li>\n<li>Infrastructure Canada - <a href=\"http://www.infrastructure.gc.ca/plan/index-eng.html\">Investing in Canada: The $120 Billion Infrastructure Plan</a></li>\n<li>Infrastructure Canada - <a href=\"http://www.infrastructure.gc.ca/plan/ptif-fitc-eng.php\">Public Transit Infrastructure Fund</a></li>\n</ul></div>\n      "
}