{
  "path": "/en/news/statements/2018/08/19/statement-prime-minister-76th-anniversary-dieppe-raid",
  "pageTitle": "Statement by the Prime Minister on the 76th anniversary of the Dieppe Raid | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 76th anniversary of the Dieppe Raid:</p><p>“In the early morning hours of August 19, 1942, nearly 5,000 Canadian soldiers, joined by their British and American allies, approached the German-occupied ports of Dieppe, Puys, and Pourville.</p><p>“The Allies – including land, air, and sea forces – were sent to test the German defences and gather crucial intelligence. The mission turned tragic as soon as the Allied soldiers landed. Daylight had broken, and the element of surprise was already lost.</p><p>“For hours, Allied soldiers endured withering machine gun, mortar, and artillery fire. A few small groups of soldiers made it into the streets of Dieppe and Pourville, but had to retreat once it became clear the raid could not go on. Overhead, Royal Air Force and Royal Canadian Air Force fighters and bombers, supported by the Royal Canadian Navy below, waged one of the most intense air battles in the whole war.</p><p>“By nightfall, Canada had endured its bloodiest day of the Second World War. Of the nearly 5,000 Canadians who took part in the raid, more than 3,300 were killed, wounded, or taken prisoner.</p><p>“Despite the tragic loss of life, the operation at Dieppe offered hope to the people of occupied France, and laid the groundwork for future Allied amphibious assaults – including D-Day.</p><p>“On this solemn anniversary, we honour the thousands of Canadians who gave so much at Dieppe, and thank all our veterans who have dedicated their lives to the defence of our country, allies, and the peace and freedom we enjoy today.</p><p>“Lest we forget.”</p></div>\n      "
}