{
  "path": "/en/news/statements/2022/03/14/statement-prime-minister-commonwealth-day",
  "pageTitle": "Statement by the Prime Minister on Commonwealth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Commonwealth Day:</p>\n\n<p>“Today, on <a href=\"https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days/commonwealth-day.html\">Commonwealth Day</a>, we join our fellow members of the Commonwealth from around the world to honour the shared values and the strong bonds of cooperation and friendship that unite us all.</p>\n\n<p>“The Commonwealth is comprised of 54 countries – spanning from Europe, Africa, and Asia to the Caribbean, the Americas, and the Pacific. It also includes a diverse range of backgrounds, cultures, and languages. Headed by Her Majesty Queen Elizabeth II, the members of the Commonwealth work together&nbsp;to advance some of the world’s most pressing issues, including democracy and peace, environmental protection and sustainable development, support for women and girls from diverse backgrounds, and human rights. Our continued collaboration is critical to the well‑being, prosperity, and peace of the nearly 2.5 billion people who live in Commonwealth member countries.</p>\n\n<p>“This year, the day centres on the theme of ‘<a href=\"https://thecommonwealth.org/commonwealth-day\">Delivering a Common Future: Connecting, Innovating, Transforming</a>’. The longstanding bonds between the countries of the Commonwealth continue to help us overcome challenges and advance shared priorities to shape our future for the better. Canada looks forward to taking part in the upcoming Commonwealth Heads of Government meeting in Kigali, Rwanda.</p>\n\n<p>“The government is working with Commonwealth countries and international partners to address the health, social, and economic impacts of the pandemic, and ensure that no one is left behind as we recover. This is particularly true for women and girls, whose contributions are essential to global recovery efforts. We will continue to promote their empowerment through initiatives such as the Commonwealth of Learning’s <a href=\"https://www.col.org/projects/ict-leadership-women-and-girls/\">ICT Leadership for Women and Girls</a> project. Headquartered in Burnaby, British Columbia, the Commonwealth of Learning works to provide opportunities for women to thrive in the digital age.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to celebrate Commonwealth Day and learn more about our shared history, our collective accomplishments, and Canada’s role in this important organization. Together, we will continue to build a better future for everyone.”</p></div>\n      "
}