{
  "path": "/en/news/statements/2022/08/09/statement-prime-minister-national-peacekeepers-day",
  "pageTitle": "Statement by the Prime Minister on National Peacekeepers’ Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Peacekeepers’ Day:</p>\n\n<p>“Today, we honour all Canadians who have served – and continue to serve – in peacekeeping operations around the world. Their courage, perseverance, and compassion have helped strengthen the rule of law, protect civilians, uphold human rights, and advance peace and stability in many countries.</p>\n\n<p>“We also pay tribute to the brave Canadian peacekeepers who lost their lives or returned injured in pursuit of a safer, more peaceful world. National Peacekeepers’ Day is observed on the anniversary of when a Canadian Buffalo aircraft was shot down over Syria while serving with the United Nations (UN) Emergency Force&nbsp;II on August 9, 1974. The nine people killed in this attack represented the greatest single-day loss of Canadian Armed Forces members on international peacekeeping duties.</p>\n\n<p>“Canada’s long and proud history in peacekeeping spans more than seven decades, starting in the late 1940s, when the UN sent military observers, including eight Canadian officers, to ease tensions in the disputed region of Kashmir. Since then, more than 125,000 Canadians have served in international peacekeeping missions, including in the Americas, Africa, Europe, and Asia.</p>\n\n<p>“Today, Canada remains an important contributor to UN peacekeeping, including as Chair of the Working Group of the Whole of the United Nations Special Committee on Peacekeeping Operations, where we help improve the policy and implementation of peacekeeping operations. Currently, Canadian Armed Forces members are deployed on peacekeeping operations such as Op PRESENCE, Op CROCODILE, Op JADE, and Op SOPRANO in Mali, the Democratic Republic of the Congo, South Sudan, and the Middle East. Through these operations, Canada supports UN peacekeeping efforts by providing command, control, and headquarters support as well as military observers and a wide range of technical specialists, including imagery technicians, air operations personnel, logisticians, and communications and electronics personnel.</p>\n\n<p>“The Government of Canada is committed to making peacekeeping more effective and inclusive. Through the <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/gender_equality-egalite_des_genres/elsie_initiative-initiative_elsie.aspx?lang=eng\">Elsie Initiative for Women in Peace Operations,</a> we are working with like-minded partners to increase the participation of uniformed women in peacekeeping operations. Through <a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/human_rights-droits_homme/principles-vancouver-principes.aspx?lang=eng\">The Vancouver Principles</a>, we are also preventing the recruitment and use of child soldiers in peacekeeping missions.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me today in learning more about <a href=\"https://www.veterans.gc.ca/eng/remembrance/classroom/faces-of-peace\">Canadian police and military peacekeepers</a>, past and present, and thanking them and their families for their dedication and sacrifices. Their tireless work in the service of peace represents true Canadian values and leadership.”</p></div>\n      "
}