{
  "path": "/en/news/news-releases/2020/04/24/prime-minister-announces-partnerships-provinces-and-territories",
  "pageTitle": "Prime Minister announces partnerships with provinces and territories to deliver the Canada Emergency Commercial Rent Assistance for small businesses | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Small businesses across the country are the backbone of our communities, and they are now facing significant challenges. That is why the Government of Canada and provincial and territorial partners are taking strong, immediate, and effective action to protect Canadians and businesses from the impacts of the COVID-19 pandemic. We are introducing significant measures to support them and ensure they have the resources to make it through these difficult times.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the federal government has reached an agreement in principle with all provinces and territories to implement the Canada Emergency Commercial Rent Assistance (CECRA) for small businesses. This program will lower rent by 75 per cent for small businesses that have been affected by COVID-19.</p>\n\n<p>The government is also providing further details on the program:</p>\n\n<ul>\n\t<li>The program will provide forgivable loans to qualifying commercial property owners to cover 50 per cent of three monthly rent payments that are payable by eligible small business tenants who are experiencing financial hardship during April, May, and June.&nbsp;</li>\n\t<li>The loans will be forgiven if the mortgaged property owner agrees to reduce the eligible small business tenants’ rent by at least 75 per cent for the three corresponding months under a rent forgiveness agreement, which will include a term not to evict the tenant while the agreement is in place. The small business tenant would cover the remainder, up to 25 per cent of the rent.</li>\n\t<li>Impacted small business tenants are businesses paying less than $50,000 per month in rent and who have temporarily ceased operations or have experienced at least a 70 per cent drop in pre-COVID-19 revenues. This support will also be available to non-profit and charitable organizations.</li>\n</ul>\n\n<p>Today’s announcement is part of the Government of Canada’s COVID-19 Economic Response Plan, which is addressing the challenges facing Canadians and their employers during this time of global uncertainty. The government continues to assess and respond to the impacts of COVID-19, and stands ready to take additional actions as needed to stabilize the economy and mitigate the impacts of the pandemic.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“More help is on the way for our small businesses across the country. They are the backbone of our families, our communities, and our economy. That is why we will continue working closely with provinces and territories to make sure that Canadian businesses have the support they need during these difficult times.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Small businesses are an integral part of our economy, and are vital for families and communities across the country. Many businesses are facing economic hardship and uncertainty during the COVID-19 pandemic. We thank and commend the many property owners who have already taken action to help their tenants during this crisis. Today’s program will provide forgivable loans to commercial property owners who in turn will lower the rent of tenants to keep them prepared to bounce back when this crisis subsides.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Canada Mortgage and Housing Corporation will administer and deliver the CECRA, a collaboration between the federal government and provincial and territorial governments, which are responsible for property owner-tenant relationships.&nbsp;</li>\n\t<li>Provinces and territories have agreed to cost share total costs and facilitate implementation of the program. They will cost share up to 25 per cent of costs, subject to terms of agreements with the federal government.</li>\n\t<li>It is expected that CECRA will be operational by mid-May, with commercial property owners lowering the rents of their small business tenants payable for the months of April and May, retroactively, and for June.</li>\n\t<li>Further details on CECRA will be shared in the near future once final terms and conditions are available. The federal government and provincial and territorial governments urge property owners to provide flexibility to tenants facing hardship in this uncertain time.</li>\n\t<li>Under a rent forgiveness agreement, which includes a moratorium on eviction, the mortgaged commercial property owner would reduce the small business tenant’s monthly rent by at least 75 per cent. The tenant would be responsible for covering 25 per cent, the property owner 25 per cent, while the federal government and provinces would share the remaining 50 per cent. The forgivable loans would be disbursed directly to the mortgage lender.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/16/prime-minister-announces-additional-support-small-businesses\">Prime Minister announces additional support for small businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/18/prime-minister-announces-more-support-workers-and-businesses-through\">Prime Minister announces more support for workers and businesses through Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/15/prime-minister-announces-expanded-access-canada-emergency-response\">Prime Minister announces expanded access to Canada Emergency Response Benefit and support for essential workers</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/additional-support-for-canadian-businesses-from-the-economic-impact-of-covid-19.html\">Additional support for Canadian businesses from the economic impact of COVID-19</a></li>\n</ul></div>\n      "
}