{
  "path": "/en/news/news-releases/2019/01/10/prime-minister-hold-cabinet-retreat-quebec",
  "pageTitle": "Prime Minister to hold Cabinet retreat in Quebec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will hold a Cabinet retreat in Sherbrooke, Quebec, from January 16 to 18.</p><p>The Government of Canada has taken significant strides to fulfill its mandate to strengthen the middle class and support people working hard to join it.</p><p>During the retreat, the Prime Minister and ministers will discuss ways to continue to deliver real results for Canadians, build on Canada’s strong economic growth, and create good, middle class jobs across the country. Discussions will also reflect other government-wide priorities, from diversifying international trade, to fighting climate change and protecting the environment.</p><p>Six Canadian heads of missions will join a panel discussion on Canada’s place in a changing world, and underscore the strong foundation Canada has built through a modernized North American trade agreement, and by securing free trade agreements with the European Union and the growing markets of Asia.</p><p>The retreat will be held in Sherbrooke as part of the Government’s commitment to take actions that give Canadians what they need to thrive in the economy of today and tomorrow, and that fuels strong economic growth in all regions of Canada.</p><h2>Quote</h2><blockquote><p>“I look forward to meeting with Cabinet for the first time this year in beautiful Sherbrooke. Quebec is at the heart of Canada’s history and our future success, and we will continue to support the workers and industries of Quebec—and those across the country—to build a stronger economy that benefits all Canadians.”<br><i><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><h2>Quick fact</h2><ul><li>The six Canadian heads of missions are: Marc-André Blanchard, Canada’s Permanent Representative to the United Nations; Janice Charette, Canadian High Commissioner to the United Kingdom; Stéphane Dion, Canadian Ambassador to Germany and Special Envoy to the European Union; Isabelle Hudon, Canadian Ambassador to France; David MacNaughton, Canadian Ambassador to the United States; and John McCallum, Canadian Ambassador to China.</li></ul></div>\n      "
}