{
  "path": "/en/news/news-releases/2022/11/14/prime-minister-announces-additional-military-assistance-ukraine-and",
  "pageTitle": "Prime Minister announces additional military assistance for Ukraine and additional sanctions against Russia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>As Russia continues its brutal, unjustifiable invasion of Ukraine, Canada will continue to stand shoulder to shoulder with the Ukrainian people and our allies, in defence of our shared values of peace, democracy, and human rights. We will continue to use every tool at our disposal to support Ukraine and hold Russia accountable.</p>\n\n<p>Today, at the G20 Summit in Bali, Indonesia, the Prime Minister, Justin Trudeau, announced that Canada will provide $500&nbsp;million in additional military assistance for Ukraine, to assist the Armed Forces of Ukraine in defending their country against Russia’s brutal and unjustifiable invasion.</p>\n\n<p>This commitment builds on the $500&nbsp;million in military aid for Ukraine announced in Budget&nbsp;2022 and will go toward military, surveillance, and communications equipment, fuel, and medical supplies.</p>\n\n<p>Canada is also imposing additional sanctions against Russian individuals. These sanctions target 23 members of the Russian justice and security sectors, including police officers and investigators, prosecutors, judges, and prison officials, involved in gross and systematic human rights violations against Russian opposition leaders. These new measures build on the sanctions Canada has imposed on over 1,400 individuals and entities since Russia’s illegal and unprovoked invasion of Ukraine in February 2022.</p>\n\n<p>This builds on the $3.4&nbsp;billion in assistance to Ukraine Canada has committed so far this year, and we will continue our unwavering support for Ukraine as it defends its sovereignty, territorial integrity, and independence. We will continue to work with our international partners to increase pressure on Russian officials and hold Vladimir Putin accountable for his illegal invasion as well as the war crimes and human rights violations that have been committed by his regime.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canada continues to support Ukraine as it defends its territory, sovereignty, and independence from Russia. This additional military assistance will support Ukrainians as they bravely continue to fight against Vladimir Putin’s illegal invasion, while these new sanctions will put added pressure on those who support these acts of war. We, along with other members of the international community, will continue to use every tool at our disposal to hold Russia accountable for its brutal actions against Ukraine.”</p>\n\n<footer class=\"default\">&nbsp;The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Today, we are sanctioning those responsible for the persecution of the brave Russian dissident Vladimir Kara-Murza. Canada will continue to be unwavering in our support for Ukraine in its fight for freedom.”</p>\n\n<footer class=\"default\">The Hon. Mélanie Joly, Minister of Foreign Affairs</footer>\n</blockquote>\n\n<blockquote>\n<p>“Canada’s commitment to providing Ukraine with comprehensive military aid is unwavering. With today’s announcement, Canada has committed over $1&nbsp;billion worth of military aid to Ukraine, and our Canadian Armed Forces continue to transport aid, as well as train their Ukrainian counterparts under Op UNIFIER. Ukraine’s military has made incredible progress reclaiming ground and Canada’s military contributions have been integral in their counter offensive to-date. The $500&nbsp;million in new military aid announced today will ensure that we continue to meet Ukraine’s military momentum with the military aid that it needs to fight and win.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Since Russia’s invasion of Ukraine on February 24, 2022, Canada has imposed sanctions on more than 1,400 individuals and entities complicit in Putin’s invasion of Ukraine, including those announced today. Many of these sanctions have been undertaken in coordination with Canada’s allies and international partners.</li>\n\t<li>Canada has provided over $600&nbsp;million in military support to Ukraine since February 2022, including armoured vehicles, artillery and ammunition, drone cameras, and winter clothing.</li>\n\t<li>In August 2022, the Government of Canada announced the deployment of CAF members under Operation UNIFIER to provide training to the Armed Forces of Ukraine in the United Kingdom in collaboration with the United Kingdom’s Operation INTERFLEX.</li>\n\t<li>Canada was among the first of a number of Allies and partners that committed to contribute to the United Kingdom-led training initiative.</li>\n\t<li>Operation UNIFIER was launched in 2015 at the request of the Government of Ukraine, and earlier this year, was expanded and extended until March 2025.</li>\n\t<li>Since the start of Operation UNIFIER in 2015, the CAF has trained over 34,000 Ukrainian military and security personnel in battlefield tactics and advanced military skills.</li>\n\t<li>Since late March 2022, the CAF has been assisting with the delivery of military aid for Ukraine within Europe and has now transported over 4&nbsp;million pounds of donations from Canada and on behalf of our Allies and partners.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"https://www.g20.org/bali-summit/\">2022 G20 Bali Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/08/defence-minister-anita-anand-announces-deployment-of-canadian-armed-forces-to-train-ukrainian-soldiers-in-the-united-kingdom.html\">Defence Minister Anita Anand announces deployment of Canadian Armed Forces to train Ukrainian soldiers in the United Kingdom</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2022/10/defence-minister-anita-anand-visits-poland-to-strengthen-defence-cooperation-and-announces-new-training-for-ukrainian-personnel.html\">Defence Minister Anita Anand visits Poland to strengthen defence cooperation and announces new training for Ukrainian personnel</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/sanctions/russia-russie.aspx?lang=eng\">Canadian Sanctions Related to Russia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-unifier.html\">Operation UNIFIER</a></li>\n</ul></div>\n      "
}