{
  "path": "/en/news/news-releases/2019/07/10/canada-host-canada-european-union-summit-montreal",
  "pageTitle": "Canada to host Canada-European Union Summit in Montréal | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the 17th Canada-European Union Summit will be held in Montréal, Quebec, from July 17 to 18, 2019. Prime Minister Trudeau will host, European Council President Donald Tusk and European Commission President Jean-Claude Juncker for the Summit.&nbsp;&nbsp;</p>\n\n<p>During the Summit, the leaders will explore how Canada and the EU can work together on common priorities and key challenges, including building economies that work for everyone, fighting climate change, advancing gender equality, and defending the rules-based international order.</p>\n\n<p>The leaders will also highlight the Canada-EU Comprehensive Economic and Trade Agreement (CETA), which is creating new opportunities and good, middle class jobs on both sides of the Atlantic. Since coming into force in 2017, CETA has helped people and businesses prosper across Canada and the EU. Thanks to the agreement, Canadian workers and businesses now have unprecedented access to the world’s second-largest market. The leaders will also discuss the Strategic Partnership Agreement, signed together with CETA, which is further strengthening ties and deepening cooperation between Canada and the EU.</p>\n\n<p>Montréal, the host city for this year’s summit, has seen the benefits of CETA firsthand. During the first year the agreement was in force, the Port of Montréal saw a significant increase in cargo – 55% of which connects to Europe– more than doubling the average annual historical growth. The Maritime Employers Association increased its labour force by 20%, and hired 200 people to keep up with the extra dock traffic.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and the EU are close partners, allies, and friends. Our partnership is even stronger thanks to CETA, which is creating good jobs and new opportunities for Canadians and Europeans alike. I look forward to meeting with President Tusk and President Juncker at next week’s summit. We’ll discuss how we can work together on the most pressing global challenges – and make life better for people on both sides of the Atlantic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>A longstanding relationship exists between Canada and the European Union. The Canada-EU dialogue covers all areas of cooperation and includes regular meetings of Ministers, experts and officials. The culmination of these discussions is the annual Canada-EU Summit.</li>\n\t<li>The Summit provides an opportunity for the Prime Minister to exchange with the President of the European Council and President of the European Commission. Summits are held alternately in Canada or Brussels, since the entry into force of the Lisbon Treaty.</li>\n\t<li>The Minister of International Trade Diversification, Jim Carr, Special Envoy to the European Union, Stéphane Dion, and Ambassador of Canada to the European Union, Daniel Costello, will attend the Summit.</li>\n\t<li>The EU is Canada's second largest trade and investment partner and an ally on many foreign policy and international security issues.</li>\n\t<li>CETA was signed in October 2016 and came into force in September 2017, giving Canada preferential access to the EU’s more than 500 million consumers.</li>\n\t<li>In 2018, Canada’s merchandise exports to the EU were nearly $44.5 billion, an increase of 7 per cent over 2017.</li>\n\t<li>The fastest growing Canadian merchandise exports to the EU include aluminium (up 378 per cent), motor vehicles and parts (up 89 per cent), mineral fuels and oils (up 84 per cent), inorganic chemicals (up 82 per cent) and wood pulp (up 45 per cent). Exports to Ireland, the Netherlands and Latvia increased 23.8 per cent, 51.1 per cent and 42.6 per cent respectively.</li>\n\t<li>Businesses across the country are benefiting directly from CETA. Some examples include B.C.-based Steamworks Brewing Company, Ontario-based Dynamo Playgrounds, Quebec-based PBSC Urban Solutions, Nova Scotia-based Tangier Lobster, and Nunavut-based Arctic UAV, an Indigenous-owned company – all of which have seen greater opportunities, boosted sales, or increased hiring thanks to the agreement.</li>\n\t<li>With CETA, 98 per cent of EU tariff lines are now duty-free for Canadian goods.</li>\n\t<li>The Canada-EU Strategic Partnership Agreement, signed in 2016, promotes Canada-EU collaboration on a range of issues, including international peace and security, counter-terrorism, human rights, nuclear non-proliferation and climate change.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/eu-ue/bilateral_relations_bilaterales/overview-apercu.aspx?lang=eng\">Canada-EU Relations: An Overview</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">CETA: A progressive trade agreement for a strong middle class</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/spa-aps.aspx?lang=eng\">Strategic Partnership Agreement</a></li>\n</ul>\n\n<p><strong>Note to media:</strong>&nbsp;Advance accreditation will be required for media wishing to cover the Canada-EU Summit. Media may register at the following link:&nbsp;<a href=\"https://www.accreditationcanada.gc.ca/CDAEU-UECDA\">https://www.accreditationcanada.gc.ca/CDAEU-UECDA</a></p></div>\n      "
}