{
  "path": "/en/news/statements/2021/08/15/statement-prime-minister-national-acadian-day",
  "pageTitle": "Statement by the Prime Minister on National Acadian Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Acadian Day:</p>\n\n<p>“Today, we celebrate the rich Acadian heritage and the outstanding contributions that Acadians make to our national fabric.</p>\n\n<p>“The history of the Acadians is one of extraordinary resilience and perseverance. Braving exile, forced displacement, and discrimination, the Acadians have succeeded over centuries in making their culture, traditions, and language survive and flourish.</p>\n\n<p>“This unique identity is what we are celebrating today. It was 140&nbsp;years ago that the delegates of the first national Acadian convention in Memramcook chose August&nbsp;15 for their national holiday. Every year since that historic moment, Acadians – and all those passionate about Acadie – gather to celebrate this vibrant, united community, showing just how well it wears its motto ‘l’union fait la force’ – strength in numbers.</p>\n\n<p>“This year’s national holiday will be no exception. Whether held in person, virtually, or in a hybrid format, community celebrations will feature traditional meals, concerts, fireworks, and tintamarres to promote Acadian culture and French identity in Acadie.</p>\n\n<p>“These celebrations demonstrate the vitality of our communities and help shape a more open and even more diverse Canada. They are also part of our economic recovery. That's why the government will continue to support community events and invest in revitalizing tourism, so that we can all discover the great places and activities our country has to offer.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I wish a happy National Acadian Day to everyone in Canada and around the world celebrating today.”</p></div>\n      "
}