{
  "path": "/en/news/readouts/2022/10/20/prime-minister-justin-trudeau-speaks-members-caribbean-community-caricom",
  "pageTitle": "Prime Minister Justin Trudeau speaks with members of the Caribbean Community (CARICOM) | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Heads of Government of Caribbean Community (CARICOM) Member States.</p>\n\n<p>Prime Minister Trudeau and CARICOM leaders received an update from the Prime Minister of Haiti Ariel Henry on the rapidly deteriorating humanitarian and security situation in Haiti. The leaders conveyed their deep concerns about the ongoing unrest and suffering, including the violence committed by armed gangs against Haitians in Port-au-Prince and neighbouring regions.</p>\n\n<p>Prime Minister Trudeau updated CARICOM leaders on Canada’s assistance to Haiti and the assessment of the current situation. He highlighted recent support for Haiti, including joint airlift operations with the United States to deliver tactical and armoured vehicles and supplies to the Haitian National Police to help restore security and stability. He noted the creation of the Joint Programme for the Haitian National Police United Nations Development Program basket fund, with seed funding of $10 million from Canada and USD $3 million from the United States – which he encouraged CARICOM members to contribute to.</p>\n\n<p>The leaders discussed the need to remove blockades by gangs, including at the Varreux terminal, that are exacerbating the humanitarian crisis by restricting access to the fuel, water, and medicine urgently needed to respond to food insecurity and the rising number of cholera cases in Haiti. The leaders also discussed the importance of sanctions to break the cycle of corruption in Haiti, halting funding to the armed gangs, and holding those responsible for the crisis to account.&nbsp;</p>\n\n<p>The Prime Minister commended CARICOM’s leadership and focus on addressing the complex humanitarian, security, and political crises Haiti faces. In turn, CARICOM leaders underscored the value of Canada’s commitment to close collaboration with CARICOM and regional and international partners to find a durable solution to Haiti’s long-term stability and sustainable development. The leaders emphasized the need to continue working closely together in response to Haiti’s immediate humanitarian and security needs, and also to facilitate inclusive, Haitian-led political dialogue towards free and fair elections at the earliest possible opportunity.</p>\n\n<p>The Prime Minister and CARICOM leaders agreed to stay in close contact as the situation in Haiti unfolds.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/guyana/bilateral_relations_bilaterales/caricom.aspx?lang=eng\">Canada-Caribbean Community (CARICOM) Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/haiti/relations.aspx?lang=eng\">Canada-Haiti Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/18/prime-minister-justin-trudeau-convenes-incident-response-group-discuss\">Prime Minister Justin Trudeau convenes the Incident Response Group to discuss the situation in Haiti</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2022/10/canada-and-united-states-coordinate-delivery-of-haitian-national-police-equipment.html\">Canada and United States coordinate delivery of Haitian National Police equipment</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/10/14/prime-minister-justin-trudeau-speaks-president-suriname-chandrikapersad\">Prime Minister Justin Trudeau speaks with President of Suriname Chandrikapersad Santokhi</a></li>\n</ul></div>\n      "
}