{
  "path": "/en/news/readouts/2021/11/22/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Ethiopia, Abiy Ahmed, about the ongoing conflict in northern Ethiopia.</p>\n\n<p>Prime Minister Trudeau reaffirmed Canada’s strong and ongoing commitment to supporting efforts to bring a peaceful resolution to the conflict, and to advance African-led negotiations. He exchanged views with Prime Minister Abiy on developments since they last spoke on November 13, including efforts led by the President of Kenya, Uhuru Kenyatta, and the High Representative of the African Union Commission for the Horn of Africa and former President of Nigeria, Olusegun Obasanjo.</p>\n\n<p>Prime Minister Trudeau reiterated that Canada believes it is critical for all parties in Ethiopia to work toward a political solution and an inclusive national dialogue to bring the conflict to a peaceful resolution. He also underscored the need for the immediate cessation of hostilities by all parties and the necessity to ensure unhindered access to, and delivery of, humanitarian assistance for those affected by the conflict, with full respect for human rights.</p>\n\n<p>The two leaders agreed to stay in close touch.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/statement-by-minister-of-foreign-affairs-and-minister-of-international-development-on-release-of-investigation-report-on-atrocities-in-the-tigray-r.html\">Statement by Minister of Foreign Affairs and Minister of International Development on release of investigation report on atrocities in the Tigray region in Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/canada-withdraws-canadian-embassy-staffs-dependants-and-non-essential-personnel-from-ethiopia.html\">Canada withdraws Canadian embassy staff’s dependants and non-essential personnel from Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/joint-statement-on-release-of-ohchr-ehrc-joint-investigation-november-6-2021.html\">Joint Statement on release of OHCHR-EHRC joint investigation</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/13/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed\">Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed</a></li>\n</ul></div>\n      "
}