{
  "path": "/en/news/statements/2021/11/23/statement-prime-minister-speech-throne",
  "pageTitle": "Statement by the Prime Minister on the Speech from the Throne | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the <a href=\"https://canada.ca/ThroneSpeech\">Speech from the Throne</a>:</p>\n\n<p>“After 19 months of facing a once-in-a-century pandemic, Canadians chose to move forward this September. They gave Parliamentarians a clear direction to work together to put the COVID-19 crisis behind us and find the real solutions needed to build a better future for all Canadians. The Government of Canada has listened to Canadians, and we are ready to finish the fight against COVID-19, take strong climate action, make life more affordable, walk the shared path of reconciliation, put home ownership back in reach, create jobs, and grow the middle class.</p>\n\n<p>“Building a better future starts with getting the pandemic under control and finishing the job on vaccines. Together, we’ve made progress. More than 86 per cent of eligible Canadians are fully vaccinated, and we have mandated that all federal and federally regulated workers, and everyone travelling within Canada by plane, train, or cruise ship be vaccinated. Just last week, Health Canada approved vaccines for children between the ages of five and 11, and the government is securing next generation COVID-19 vaccines and booster shots. If we continue to encourage all eligible Canadians to get their COVID-19 vaccines, we can build a healthier tomorrow and a stronger health care system. The government will better support all Canadians by taking action to clear the backlog of delayed procedures caused by COVID-19, strengthening long-term care, and improving access to mental health and addiction treatment. We will keep Canadians safe and healthy now and into the future.</p>\n\n<p>“As we put the pandemic behind us, we need to rebuild an economy that truly works for everyone. To do that, the government will continue to put Canadians first and invest in their future. That means tackling the rising cost of living and taking action on housing affordability and child care. We’re going to help put home ownership back in reach for Canadians with a more flexible First-Time Home Buyer Incentive, a new rent-to-own program, and by reducing closing costs for first-time buyers. Supporting families will make life more affordable for the middle class and people working hard to join it. That’s why over the last few months, we’ve signed nine child care agreements with provinces and territories that will cut fees in half in the next year for most jurisdictions, build hundreds of thousands of new child care spaces across the country, and create an early learning and child care system that will cost, on average, $10-a-day for hard-working parents. The Government of Canada will get the job done on $10-a-day child care, and continue to make life better and more affordable for all Canadians.</p>\n\n<p>“To create a more resilient economy, create jobs, and grow the middle class, Canada must take strong and bold climate action. That’s why we’re moving forward to cap and cut oil and gas sector emissions, investing in public transit, and mandating the sale of zero-emissions vehicles. We have the raw materials and skilled work force to produce the clean products that the world will need to cut pollution and create a green economy. The Government of Canada will continue to invest in our workers and industry to help bring us into the economy of the future, while also taking action to clean the air that we breathe and protect Canadians from extreme weather events. Together, we need to go further and move faster on climate action, not just to protect our environment, but to grow our economy in a way that leaves no worker behind.</p>\n\n<p>“All Canadians deserve to feel safe in their communities, but gun violence is on the rise in Canada’s biggest cities. While we’ve already taken strong action on gun control, there’s still more to do. That’s why we will build on our progress and implement a mandatory buyback of assault-style weapons and work with the provinces and territories that want to ban handguns.</p>\n\n<p>“The government will also continue to ensure that everyone is safe and has a shot at getting ahead regardless of their gender, who they love, where they come from, what language they speak, who they pray to, or the colour of their skin. We will continue to fight systemic racism, sexism, and discrimination in our communities, and promote the empowerment of Black and racialized Canadians, and Indigenous peoples. We will also stand-up for LGBTQ2 communities while completing the ban on conversion therapy, and we will protect and support our two official languages, both inside and outside of Quebec.</p>\n\n<p>“But creating a more inclusive and equitable Canada can’t happen unless we move faster on our shared path of reconciliation. Canadians were horrified by the discovery of unmarked graves and burial sites located near former residential schools. As a country, and as a government, we must continue to tell the truths of these tragedies so we can right past wrongs and move forward in the spirit of reconciliation, for everyone. The Government of Canada will continue to support Indigenous peoples in these communities by investing in a distinction-based mental health and wellness strategy, and we will respond to the Truth and Reconciliation Commission of Canada’s Calls to Action and appoint a special interlocutor to further advance justice on the legacy of residential schools. The government will also accelerate work with Indigenous partners to address the national tragedy of Missing and Murdered Indigenous Women, Girls, and 2SLGBTQQIA+ people, and we will ensure fair and equitable compensation for those harmed by the First Nations Child and Family Services program. Together, we will close the gaps that far too many First Nations, Inuit, and Métis communities still face today and build a better and more equitable future.</p>\n\n<p>“Finally, the government recognizes that we live in a deeply connected world. The pandemic has shown us the importance of working with our global partners to tackle the challenges of today and tomorrow. From fighting the climate crisis to securing supply chains that create good middle class jobs, and standing up to reinforce international peace and security, Canada will continue to be a leader on the world stage.</p>\n\n<p>“As we build back from the challenges of the COVID-19 pandemic, Canadians expect Parliamentarians to work together and deliver on their priorities. The Government of Canada is committed to continuing to put Canadians first as we build a cleaner and healthier future. Together, we move Canada forward – for everyone.”</p>\n\n<p>Also available in the following languages:</p>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/11/23/tusagaksaq-kanataup-sivuliuqtirjuanganit-gavamakkut-tukimuagutiksangit\">Inuktitut</a></li>\n\t<li><a href=\"/en/news/statements/2021/11/23/weestamakaywin-ouschi-kischee-li-ministr-didawn-lee-plawn-ka\">Michif-Cree</a></li>\n\t<li><a href=\"/en/news/statements/2021/11/23/kihci-okimaw-o-wihtamakewin-ohci-kihci-okimawinahk-itasiwewin\">Plains Cree</a></li>\n\t<li><a href=\"/en/news/statements/2021/11/23/gichi-gaanada-ogimaa-odikidowin-gichi-ogimaa-desabiwining-onji\">Western Ojibway</a></li>\n</ul></div>\n      "
}