{
  "path": "/en/news/statements/2020/12/24/statement-prime-minister-christmas",
  "pageTitle": "Statement by the Prime Minister on Christmas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Christmas:</p>\n\n<p>“Merry Christmas, Canada! Today, our family joins Christians across the country and around the world to celebrate the birth of Christ.</p>\n\n<p>“This time of year is full of joy, light, and traditions. As a family, we usually get together to eat too much food, share laughs and stories, watch cheesy holiday movies, give each other gifts, and most importantly, spend quality time together.</p>\n\n<p>“This year, as we continue to deal with the impacts of the global COVID-19 pandemic, Christmas traditions will be different. Families aren’t getting together for big dinners and friends aren’t stopping by for cookies and eggnog, but we can, and should, give thanks for everything that unites us. Today is a time to recognize all the good that we have in our lives. It’s a time to celebrate Christ’s message of compassion and show people we love them – and right now, that message is more important than ever before.</p>\n\n<p>“2020 has been a difficult year for all of us, but through it we’ve seen Canadians meet these challenging times with generosity, kindness, and hope. Neighbours are helping neighbours, kids are giving up play dates and birthday parties, and businesses are retooling their operations, all to help in the fight against COVID-19. We’ve seen this leadership and dedication from our front line workers, who have put themselves at risk to keep all of us safe and healthy and our families fed. And we also recognize the work of our Canadian Armed Forces members, both at home and abroad, and thank them for their sacrifice and service to our country.&nbsp;&nbsp;</p>\n\n<p>“This year everyone has done their part, because as Canadians we show up for one another. And today, as many spend this holiday away from the ones they love, we need to continue to support and reach out to friends, neighbours, and those in need in our communities. As a country, we will come out of this challenging year stronger and more united, and we will continue to stand together – both today and into the New Year.</p>\n\n<p>“From our family to yours, Hadrien, Ella-Grace, Xavier, Sophie, and I wish you joy, health, and love this holiday season. Merry Christmas, everyone.”</p></div>\n      "
}