{
  "path": "/en/news/news-releases/2022/06/08/prime-minister-announces-nomination-philippe-dufresne-privacy",
  "pageTitle": "Prime Minister announces nomination of Philippe Dufresne as Privacy Commissioner of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the nomination of Philippe Dufresne as Privacy Commissioner of Canada.</p>\n\n<p>Mr. Dufresne is a leading legal expert on human rights, administrative, and constitutional law. A member of the Bars of Quebec, Ontario, and Massachusetts, he has successfully represented the Canadian Human Rights Commission as Senior General Counsel before all levels of Canadian Courts, including the Supreme Court of Canada, in some of the key human rights and constitutional cases of the last two decades. He was appointed Law Clerk and Parliamentary Counsel of the House of Commons in February 2015.</p>\n\n<p>The Office of the Privacy Commissioner of Canada (OPC) was established in 1983 following the passage of the&nbsp;<em>Privacy Act</em>, which governs the personal information handling practices of federal departments and agencies. In 2001, the duties of the OPC were extended to include private sector businesses subject to the&nbsp;<em>Personal Information Protection and Electronic Documents Act</em>, Canada’s federal private-sector privacy law.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Mr. Dufresne is a leading legal expert and has a breadth of experience on human rights, administrative, and constitutional law. I am confident that he would serve Canadians well in protecting and promoting privacy rights as Privacy Commissioner.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Privacy Commissioner is an independent Agent of Parliament, appointed under the&nbsp;<em>Privacy Act</em>&nbsp;for a term of seven years. The Privacy Commissioner is eligible to be reappointed for further terms not exceeding seven years.</li>\n\t<li>The appointment is made by the Governor in Council after consultation with the leader of every recognized party in the House of Commons and group in the Senate, and after approval by resolution of both Houses of Parliament.</li>\n\t<li>The Privacy Commissioner’s responsibilities include investigating complaints, conducting audits, and taking legal action when needed; publicly reporting on how public and private sector organizations handle personal information; and supporting research and promoting public awareness and understanding of privacy issues.</li>\n</ul>\n\n<h2>Biographical Note</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/06/08/philippe-dufresne\">Philippe Dufresne</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/privy-council/topics/appointments/governor-council.html\">Governor in Council appointments</a></li>\n\t<li><a href=\"https://www.priv.gc.ca/en/\">Office of the Privacy Commissioner of Canada</a></li>\n</ul></div>\n      "
}