{
  "path": "/en/news/news-releases/2020/10/29/joint-press-release-eu-canada-leaders-virtual-meeting",
  "pageTitle": "Joint press release: EU-Canada Leaders' Virtual Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The President of the European Council, Charles Michel, the President of the European Commission, Ursula von der Leyen, and the Prime Minister of Canada, Justin Trudeau, held a Leaders' Virtual Meeting on 29 October 2020.</p>\n\n<p>The leaders re-affirmed their determination to continue joint efforts to overcome the COVID-19 pandemic in keeping with shared principles and values of democracy, human rights and the rule of law, and based on the EU-Canada Strategic Partnership Agreement. They shared the commitment to take effective measures to protect health, ensure a robust economic recovery, and build more innovative, sustainable, inclusive and resilient economies. In this way the EU and Canada will emerge from this crisis stronger than before and in a better position to address challenges of the future.</p>\n\n<p>Stressing that solidarity, cooperation and effective multilateralism are essential to defeat the virus and accelerate the recovery, the leaders committed to continuing to work closely together in international fora including the G7, the G20, and the United Nations system. Since the start of the pandemic, the EU and Canada have been cooperating closely, including to ensure universal, equitable and affordable access to COVID-19 vaccines, treatments and tests. In this regard, the EU and Canada, alongside other donors, co-hosted a pledging event for the ACT-Accelerator and continue to collaborate to build support for the global initiative, in particular its COVAX Facility, through high-level engagement. The leaders agreed that the EU-and Canada will deepen their cooperation and exchange of information on COVID-19 vaccines including research, access, procurement and distribution. They also agreed to further advance their discussions on health matters.</p>\n\n<p>Both sides will continue to provide joint leadership in strengthening the WHO, and the global pandemic preparedness and response capacity more generally. The leaders stressed the importance of an impartial, independent and comprehensive evaluation of the international health response to COVID-19 as outlined in the World Health Assembly resolution of May 2020.</p>\n\n<p>The EU and Canada are implementing the G20 Action Plan agreed by Finance Ministers and Central Bank Governors to support the global economic recovery and achieve strong, sustainable, balanced and inclusive growth, which should continue to be reviewed and updated. Leaders emphasized their commitment to build back better by putting in place recovery plans incorporating green transition and digital transformation, while leaving nobody behind. This includes finding new ways to ensure our SMEs take full part in the COVID recovery, including facilitating their use of digital tools to expand commerce and partnerships.</p>\n\n<p>Leaders also stressed the need to make global supply chains more resilient and improve the global level playing field while maintaining open economies. They agreed to deepen their work towards a strategic partnership on critical raw materials to support the green and digital transition. Leaders also welcomed further G20 efforts to support the most affected low-income countries, including in Africa, including by the extension of the G20/Paris Club Debt Service Suspension Initiative (DSSI). Leaders also recognised that further debt treatment will be required on a case-by-case basis and called on G20 members to endorse the “Common Framework for Debt Treatment beyond the DSSI” agreed by the Paris Club.</p>\n\n<p>On environment, the leaders stressed the urgency to step up global action to tackle climate change. As investments are being made to rebuild economies hit by the COVID-19 pandemic, they called for a green recovery. They also reaffirmed their commitment to the swift, full and effective implementation of the Paris Agreement and to their shared objective of net-zero greenhouse gas emissions by 2050. The EU and Canada will demonstrate increased ambition on reducing GHG emissions when updating Nationally Determined Contributions ahead of COP26. They also reaffirmed their commitment to support developing countries transition to sustainable, climate-resilient economies, including towards the collective goal to mobilize USD$100 billion per year by 2020 from a wide variety of sources. Leaders underlined their commitment to move towards the circular economy, including through advocacy at multilateral level, and called for an ambitious global agreement to protect and restore biodiversity at the next Conference of the Parties to the UN Convention on Biological Diversity in 2021 and for a strengthened global framework for sound management of chemicals and waste, at the Inter-national Conference on Chemicals Management in 2021.</p>\n\n<p>Leaders highlighted the close collaboration, underpinned by shared values, on ensuring a human-centric digital transformation. They noted ongoing planning for joint research in Quantum technologies. As founding members of the Global Partnership on Artificial Intelligence (GPAI), the EU and Canada collaborate across multilateral fora to ensure AI and other digital technologies are advanced in a responsible manner that fosters public trust, including a focus this year on how AI can be leveraged to respond to, and recover from, COVID-19.</p>\n\n<p>The leaders celebrated the third anniversary of the provisional application of the EU-Canada Comprehensive Economic and Trade Agreement (CETA) and welcomed its positive results, noting that bilateral trade between the EU and Canada had, by end of 2019 increased by more than 20% for goods and for services over pre-CETA levels. The leaders affirmed their determination to further facilitate and promote the implementation of CETA in all areas to the benefit of both Europeans and Canadians, and as an important tool in strengthening the post-COVID economic recovery on both sides. The leaders agreed to take new concrete measures to further CETA’s implementation in the areas of Trade and Gender, Trade and Climate Change, and Trade and SMEs, and welcomed Canada’s new membership in the Enterprise Europe Network to promote SMEs taking advantage of CETA. Canada also will host a CETA Clean Tech Summit, when conditions allow, to foster partnerships and business opportunities for Canadian and EU cleantech in support of our respective green economic recoveries.</p>\n\n<p>The leaders agreed to continue working together, in the Ottawa Group and beyond, to reform the World Trade Organization (WTO) in order to protect and strengthen the multilateral rules-based trading system at a time of unprecedented crisis, and enable it to deal effectively with new global economic realities including those related to the COVID-19 pandemic. The EU and Canada will fully support the new WTO Director General. The leaders reaffirmed their commitment to reach a global and consensus-based solution on a fair, sustainable, and modern international tax system that addresses the tax challenges arising from the digitalisation of the economy.&nbsp; Leaders urged the G20 Finance Ministers to reach an agreement on the remaining issues by mid-2021.</p>\n\n<p>The leaders also discussed and agreed upon a range of foreign policy and security issues, including in relation to Belarus, Russia, Nagorno-Karabakh, Eastern Mediterranean, China, Sahel and Venezuela. On China, the EU and Canada expressed their deep concern about the continued arbitrary detention there of Canadians, EU and other foreign nationals. The leaders acknowledged the role of strong transatlantic relations in helping to better address current geopolitical challenges. Leaders also agreed to cooperate more closely in protecting their democracies against malicious cyber activities and disinformation, in tackling arbitrary detention, and in promoting the international rules based system as a whole.</p>\n\n<p>The leaders looked forward to holding the next EU-Canada Leaders’ Summit in the near future, when COVID conditions allow, in order to further advance cooperation between the EU and Canada in areas such as: foreign and security policy, international trade and the trading system, climate change and other environmental issues, clean energy, the Arctic, space, the digital transformation, research and innovation, public health, and the UN Sustainable Development Goals/development cooperation.</p></div>\n      "
}