{
  "path": "/en/news/news-releases/2018/09/04/major-rapid-transit-projects-ease-congestion-metro-vancouver",
  "pageTitle": "Major rapid transit projects to ease congestion in Metro Vancouver | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Metro Vancouver is home to some of the fastest growing cities in Canada. Modern, efficient transit systems are needed more than ever to reduce traffic congestion, connect businesses and communities, and meet the needs of a rapidly growing population.</p><p>The Prime Minister, Justin Trudeau, and the Premier of British Columbia, John Horgan, today announced more than $3 billion in federal and provincial funding for two major rapid transit projects in Metro Vancouver: the Broadway Subway project and the Surrey-Newton-Guildford Light Rail Transit project.</p><p>The Broadway Subway project will add 5.7 kilometres and six&nbsp;stations to the line, bringing frequent and reliable SkyTrain access to one of the most congested transit corridors in Metro Vancouver.</p><p>The Surrey-Newton-Guildford Light Rail Transit project (LRT) will create the first light-rail transit system in British Columbia. With 11 new stations along 10.5 kilometres of street‑level track, the LRT will provide much needed transit services in underserved areas, connect and revitalize communities, and make it easier to travel across the Lower Mainland.</p><p>These projects will create thousands of good, middle class jobs during construction. Once completed, they will meet current and future transportation needs, reduce traffic congestion and air pollution, and create more livable, connected communities.</p><h2>Quotes</h2><blockquote><p>“Bringing light rail to Surrey will transform the city, connect communities, and make getting around the Lower Mainland faster and easier. The Broadway Subway will also go a long way in reducing commute times and transit overcrowding, and making Vancouver’s Skytrain even more convenient and accessible. Our government will continue to listen to communities, and make historic investments in the infrastructure they need, today and tomorrow.”<br> —<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>\"Rapid transit is key to helping people get where they need to go quickly so we can meet the needs of a growing region. Cutting traffic and getting people and goods moving faster will unlock economic growth while making our communities more affordable, accessible and clean.”<br> —<cite>The Honourable John Horgan, Premier of British Columbia</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada will contribute $1.37 billion to the two projects, the Government of British Columbia will contribute $1.82 billion, and Translink, the City of Vancouver, and the City of Surrey will contribute $1.23 billion.</li><li>The Broadway Subway will be able to move 5,100 more passengers per hour, per direction than the existing B-Line bus service it will replace, increasing capacity by 250 per cent. It will also be built to accommodate additional future capacity increases.</li><li>In Surrey, the Light Rail Transit project will take people from one end of the line to the other in approximately 27 minutes. The line will operate within dedicated train-only lanes on the road, allowing the trains to bypass traffic queues, making it an attractive public transit choice.</li><li>Federal and provincial funding for these projects is the result of a new funding agreement signed by the governments of Canada and British Columbia in the spring of 2018, under the Investing in Canada infrastructure plan that will see $3.917 billion in federal dollars invested in British Columbian infrastructure over 10 years.</li><li>Through the Investing in Canada infrastructure plan, the Government of Canada will invest more than $180 billion over 12&nbsp;years in public transit projects, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li><li>Of this funding, $28.7&nbsp;billion will support public transit projects, including $5&nbsp;billion that will be available for investment through the Canada Infrastructure Bank.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\">Investing in Canada Plan</a></li><li><a href=\"http://www.infrastructure.gc.ca/map-carte/bc-eng.html\">Federal infrastructure investments in British Columbia</a></li><li><a href=\"https://engage.gov.bc.ca/broadwaysubway\">Broadway Subway project</a></li><li><a href=\"https://surreylightrail.ca/\">Surrey-Newton-Guildford Light Rail Transit project</a></li></ul></div>\n      "
}