{
  "path": "/en/news/statements/2017/10/01/statement-prime-minister-womens-history-month",
  "pageTitle": "Statement by the Prime Minister on Women’s History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Women’s History Month:</p><p>“Throughout our history, women have played a foundational role to shape the strong, dynamic, open country we all call home. During Women’s History Month, we celebrate the outstanding achievements of women and their remarkable contributions to our country.</p><p>“In Canada and around the world, women have been powerful agents of change throughout history, and they continue to make a difference in communities everywhere. From the sciences to the arts, business to government, women have made major contributions to every field imaginable. Women’s leadership has been essential to advancing social justice and human rights everywhere, and has helped to create a better, more equal world for all of us.</p><p>“This year’s Women’s History Month theme – <a href=\"http://www.swc-cfc.gc.ca/commemoration/whm-mhf/index-en.html\">Claim Your Place</a> – is a call to action, reminding us that we must continue to honour women’s achievements, and to push for progress on gender equality and inclusion. While we have made tremendous progress over the past 150 years, we have much more work to do. Sexism, discrimination, and gender-based violence are still a part of daily life for too many women in Canada and around the world. This is unacceptable – and it is up to all of us to build a world where all people, no matter their gender identity, have the same opportunities, where women’s rights are respected, and where their voices are heard.</p><p>“Our Government is working hard to advance gender equality and ensure that all people, no matter their gender, have the opportunity to realize their full potential. We are working to strengthen women’s leadership in business and government and to provide young women with the opportunities they need to advance their careers. With our <a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/iap-pai/index.aspx?lang=eng\">Feminist International Assistance Policy</a>, we made empowering women and girls the focus of our international aid. We also recognize that women continue to bear a disproportionate responsibility for family care, and our enhanced support for families – from the Canada Child Benefit, to improved access to funding so parents can go back to work or back to school – responds to this reality. We are proud of the steps we have taken, and we will continue to make advancing gender equality a priority.</p><p>“This month, and throughout the year, Sophie and I encourage all Canadians to join us in celebrating the courageous women – past and present – who have shaped our country. Trailblazing women have helped make Canada what it is today. Every day, women build on that history, and continue to shape our world for the better.”</p></div>\n      "
}