{
  "path": "/en/news/statements/2016/07/14/statement-prime-minister-canada-terrorist-attack-nice-france",
  "pageTitle": "Statement by the Prime Minister of Canada on the terrorist attack in Nice, France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after learning of the terrorist attack in Nice, France:</p>\n<p>“I was heartbroken to learn of the many dozens of innocent victims who were killed or injured as a result of today’s terrorist attack that targeted Bastille Day celebrations in Nice, France.</p>\n<p>“On behalf of all Canadians, I extend my deepest condolences to the families and friends of those who were killed. We also wish a speedy recovery to the many more that were injured.</p>\n<p>“Canada and France are the closest of friends, and we stand by the French people as they face this terrible ordeal. We have offered all possible assistance to the French Government.</p>\n<p>“Senseless acts like this one are not isolated events, and we will continue to work with our Allies and partners to fight terrorism in all of its forms. We will bring those who are responsible to justice, whether they be the perpetrators, or those involved in funding or organizing such attacks.</p>\n<p>“Our thoughts and prayers are with the people of France at this very difficult time. We mourn the loss of so many innocent victims.”</p>\n<p>***IMPORTANT***</p>\n<p>“We are still in the process of determining whether any Canadians have been impacted by this event with local authorities.</p>\n<p>“Canadian citizens in France requiring emergency consular assistance should contact the Embassy of Canada (<a class=\"ext\" href=\"https://travel.gc.ca/assistance/embassies-consulates/france\">https://travel.gc.ca/assistance/embassies-consulates/france</a><span class=\"ext\"></span>)&nbsp; or call Global Affairs Canada's 24/7 Emergency Watch and Response Centre collect at +1&nbsp;613&nbsp;996-8885. An email can also be sent to <a class=\"mailto\" href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a><span class=\"mailto\"></span>.</p>\n<p>“Friends and relatives in Canada of Canadian citizens known to be in the area can contact Global Affairs Canada's 24/7 Emergency Watch and Response Centre by calling 613-996-8885 or 1-800-387-3124, or by sending an email to <a class=\"mailto\" href=\"mailto:sos@international.gc.ca\">sos@international.gc.ca</a><span class=\"mailto\"></span>.”</p></div>\n      "
}