{
  "path": "/en/news/statements/2019/02/06/statement-prime-minister-death-paul-dewar",
  "pageTitle": "Statement by the Prime Minister on the death of Paul Dewar | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Paul Dewar, former Member of Parliament for Ottawa Centre:</p><p>“Ottawa lost one of its most dedicated voices today.</p><p>“I was saddened to learn of the death of former Member of Parliament Paul Dewar. On behalf of all Canadians, Sophie and I offer our deepest condolences to his wife, Julia; their two sons, Nathaniel and Jordan; and to Paul’s many friends and all those he represented.</p><p>“A teacher, politician, labour activist, and community leader, Paul dedicated his life to the service of others. Whether from his seat in the House of Commons, or at the front of a classroom, he challenged us all to dream bigger and do better to care for the people around us.</p><p>“Paul represented the people of Ottawa Centre as an NDP Member of Parliament from 2006 to 2015. During that time, he distinguished himself as a community builder, an advocate for young people, and a tenacious voice for human rights around the world. He lived up to everything a leader should be – principled, compassionate, and brave.</p><p>“Faced with a terminal diagnosis, Paul responded as he always did: he showed his love for his family and community, and encouraged those around him to take care of each other and live as lovingly and generously as possible. In the last few months of his life, Paul launched <a href=\"http://youthactionnow.ca/\">Youth Action Now</a> – an initiative to support young people and help them lead change in their communities.</p><p>“Paul Dewar brought people together, stood up for the most vulnerable, and touched lives in Canada and beyond. He showed us what stewardship looks like, and earned the love of his community and the respect of so many of us. He will be sorely missed.”</p></div>\n      "
}