{
  "path": "/en/news/news-releases/2020/04/07/prime-minister-announces-production-more-medical-supplies-and",
  "pageTitle": "Prime Minister announces production of more medical supplies and equipment in Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canadian businesses and manufacturers are stepping up in the fight against the COVID-19 pandemic. The Government of Canada is working with companies across the country to make sure that we have the medical supplies and equipment needed to keep Canadians safe and healthy.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced further progress under Canada’s Plan to Mobilize Industry to fight COVID‑19 that will help provide vital, made‑in‑Canada protective gear and medical equipment to respond to the outbreak.</p>\n\n<p>The Government of Canada is building a secure, domestic supply of needed items to protect frontline health workers as they fight this global pandemic. Nearly 5,000 Canadian companies have offered their expertise and capacity as we work together on projects that include:</p>\n\n<ul>\n\t<li>Purchasing made-in-Canada ventilators from Thornhill Medical, CAE, Ventilators for Canadians, and StarFish Medical and other manufacturing partners, including Linamar, through an accelerated process. The Government of Canada is working with these companies to produce up to 30,000 ventilators. These purchases will help secure increased domestic capacity in producing these life-saving machines.</li>\n\t<li>Working with one of Canada’s Nobel Prize-winning researchers, Dr. Art McDonald, who is leading a team of scientists at national laboratories TRIUMF, Canadian Nuclear Laboratories, and SNOLAB to develop an easy-to-produce ventilator using off-the-shelf, easily accessible parts. The goal is to develop a ventilator model to meet current needs that can be constructed quickly and reliably in Canada.</li>\n\t<li>Using innovative alternative materials, which have been authorized through Health Canada’s expedited regulatory process, to augment the supply of medical gowns. Stanfield’s Limited will use a fabric developed by Intertape Polymer Group to supply protective medical gowns. The Government of Canada has signed a purchase order with Stanfield’s, which will use its Canadian manufacturing platform to fulfill the order. The government has also signed a letter of intent to support AutoLiv as it works to repurpose material traditionally used for air bags to provide additional fabric for medical gowns. Using these alternative materials will significantly increase the number of medical gowns that can be made in Canada.</li>\n\t<li>Establishing and securing new supply chains to produce medical gowns from new Canadian sources. The Government of Canada has signed letters of intent with a total of 22 apparel manufacturers, including Arc’teryx and Canada Goose, to produce needed medical gowns for Canadian health care workers using newly-sourced Canadian material.</li>\n\t<li>Purchasing and producing masks to protect our health care workers. The Government of Canada has placed orders for millions of surgical masks from various companies, including Medicom, Surgo Surgical Supply, and Breathe Medical. The government is also supporting Medicom’s work to increase its capacity to produce tens of millions more surgical and N95 masks per year right here in Canada.</li>\n\t<li>Purchasing hand sanitizer from Canadian companies, including Fluid Energy Group Ltd. and Irving Oil. The Government of Canada is also supporting the Hand Sanitizer Manufacturing Exchange established by Cosmetics Alliance Canada, the Canadian Consumer Specialty Products Association, and Spirits Canada. In addition, the government is working to increase hand sanitizer supply by matchmaking companies, and by identifying and guiding new producers through the licencing and procurement process. In the last three weeks, Health Canada has expedited the authorization of more than 400 new hand sanitizer products to help limit the spread of COVID‑19.</li>\n</ul>\n\n<p>Complementary to these domestic efforts, the Government of Canada is also working through over 22,000 submissions to Public Services and Procurement Canada from companies interested or able to sell to Canada. All efforts are being made to secure contracts and deliveries as quickly as possible.</p>\n\n<p>The Government of Canada welcomes the cooperation of all companies who have offered to re-tool, repurpose, and innovate to fight COVID‑19. Our partnerships with Canadian industry in particular will help us produce needed supplies and equipment domestically, provide Canadians with the fastest possible access to safe and effective health products, strengthen our health care system, and better protect the health and safety of all Canadians.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadian companies are answering the call to protect our health care professionals with made-in-Canada solutions. This is exactly the kind of innovative, collaborative thinking we need to respond to this rapidly evolving pandemic. By increasing our support for secure, Canadian sources of needed materials and equipment, we will be able to help our health care workers protect themselves, treat patients, and slow the spread of this virus.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“In mobilizing industry and creating partnerships, we are moving swiftly to build up a secure domestic supply of key personal protective equipment to protect Canada’s frontline health workers as they fight this pandemic. This is about helping these real-life heroes save Canadian lives.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our first priority is getting equipment and supplies into the hands of our frontline healthcare workers. This crucial task is made more challenging by the highly competitive global environment in which we are operating. Canadian industry is stepping up in a big way to support these efforts and Canadians can be assured that we are working around the clock to ensure Canada has what it needs—made at home and abroad—as we fight COVID‑19.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of Public Services and Procurement</footer>\n</blockquote>\n\n<blockquote>\n<p>“This is what it means to be a Canadian – we are all coming together to keep our communities safe and protect frontline health care workers. We will continue to find innovative solutions to have the medical equipment and supplies we need to respond to this outbreak.”</p>\n\n<footer class=\"default\">The Hon. Patty Hajdu, Minister of Health</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>On March 31, 2020, the Government of Canada announced additional funding of $2 billion to support diagnostic testing and to purchase ventilators and protective personal equipment, including for bulk purchases with provinces and territories. Personal protective equipment includes things like more masks and face shields, gowns, and hand sanitizer.</li>\n\t<li>The Government of Canada launched a call to action under Canada’s Plan to Mobilize Industry to fight COVID‑19, and has deployed industry and innovation programming, such as a National Research Council Industrial Research Assistance Program concierge service, to support companies in rapidly scaling their production capacity in Canada. Offers have been received from companies with products:\n\t<ul>\n\t\t<li>ready to be purchased or ordered, that can be supported through procurement agreements with the Government of Canada</li>\n\t\t<li>under development, but not yet authorized, for which the Government of Canada can provide help with the expedited regulatory process through Health Canada</li>\n\t\t<li>needing technical or financial assistance to get into market, and which can be supported by the Government of Canada through the Strategic Innovation Fund, the National Research Council of Canada’s Industrial Research Assistance Program, Export Development Canada, and the Business Development Bank of Canada</li>\n\t</ul>\n\t</li>\n\t<li>Canadians have developed or contributed to the related intellectual property on ventilators, and in some cases it will be available as open source for the world to share.</li>\n\t<li>Through the Next Generation Manufacturing Supercluster (NGEN Canada), at least $50 million has been made available to develop and produce new, in‑demand technologies, equipment, and medical products such as virus screening tests, vaccines, therapeutics, and symptom management treatments. It also includes medical equipment to care for Canadians such as ventilators, peripherals, personal protective equipment, and cleaning and sterilization chemicals and equipment.</li>\n\t<li>NGEN Canada issued a call out to its members and organizations across Canada for project proposals. It has reviewed and approved seven projects to address critical health care needs and build Canadian manufacturing capacity.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19.html\">Coronavirus disease (COVID-19)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/economic-response-plan.html\">Canada’s COVID-19 Economic Response Plan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/31/prime-minister-announces-new-partnerships-canadian-industries-fight\">Prime Minister announces new partnerships with Canadian industries to fight COVID‑19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-canadas-plan-mobilize-industry-fight-covid\">Prime Minister announces Canada’s Plan to Mobilize Industry to fight COVID‑19</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}