{
  "path": "/en/news/readouts/2023/01/11/prime-minister-justin-trudeau-meets-president-mexico-andres-manuel-lopez",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Mexico Andrés Manuel López Obrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of Mexico, Andrés Manuel López Obrador, on the margins of the North American Leaders’ Summit in Mexico City, Mexico.</p>\n\n<p>The Prime Minister and the President welcomed the meeting as an opportunity to further strengthen ties and reiterate the importance of the multifaceted relationship between Canada and Mexico, including deep people-to-people ties, rich cultural connections, and an important trade and investment relationship.</p>\n\n<p>The leaders reaffirmed that a strong Canada-Mexico bilateral partnership is even more important in the face of increasingly complex global challenges. To this end, they noted the large number of shared priorities of their governments, including creating an economic recovery that works for everyone, fostering greater inclusion for all people, particularly Indigenous Peoples, and continuing to create good middle-class jobs for people in both countries.</p>\n\n<p>The Prime Minister and the President also discussed the important contributions that Canadian and Mexican investments in both directions make to our collective prosperity. The Prime Minister noted important Canadian investments in the transportation, energy, and mining sectors in Mexico, and the leaders committed to continue working together to make progress on shared priorities.</p>\n\n<p>Prime Minister Trudeau and President López Obrador underscored the importance of economic relations between their two countries, anchored in the Canada-United States-Mexico Agreement (CUSMA). The leaders agreed to maintain close cooperation on supply chains to enhance the competitiveness of their respective economies, and of North America. They discussed the importance of promoting a predictable trade and investment environment that supports economic prosperity and provides good jobs in both countries.</p>\n\n<p>Building on previous Canada-Mexico joint action plans, and on the ongoing work being done through bilateral mechanisms such as the annual Canada-Mexico Partnership, the Prime Minister and the President announced the launch of a new Action Plan for the Canada-Mexico relationship. The Action Plan includes work under nine pillars, such as: trade and investment, advancing gender equality, sharing experiences on Indigenous reconciliation, addressing inequality and racism, youth engagement, and tourism, migration, and human mobility.</p>\n\n<p>The Prime Minister and the President discussed their shared commitment to advancing on the shared path of reconciliation with Indigenous Peoples in Canada and in Mexico. They discussed ways to make progress on this commitment, including opportunities to create and foster platforms for Indigenous empowerment. The Prime Minister further reiterated Canada’s commitment to advancing reconciliation and the rights of Indigenous Peoples in Canada and across the world by working in partnership with them. In that regard, the leaders welcomed the signing of a Memorandum of Understanding by their ministers to advance bilateral Indigenous cooperation moving forward.</p>\n\n<p>The Prime Minister and the President discussed their shared commitment to advancing women’s empowerment and gender equality as well as their feminist foreign policies, and recalled they were the first two countries in the Americas to adopt these policies. They discussed opportunities to work together to advance feminist foreign policies in the Americas and share lessons learned on implementation. They agreed on the potential of deepening their partnership on these issues, and on reinforcing and supporting democracy, to demonstrate leadership regionally and globally.</p>\n\n<p>The Prime Minister and the President also agreed on the need to raise ambition around climate change. They discussed recent shared efforts and initiatives on fighting climate change, promoting nature-based solutions, addressing illegal wildlife trade, and advancing conservation and protecting biodiversity, building on progress made at the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, which Canada hosted last month.</p>\n\n<p>The Prime Minister took this opportunity to discuss Canada’s engagement with Haiti and possible areas of collaboration to enhance the security and stability of Haiti for the benefit of its citizens. The two leaders also discussed a range of issues of mutual interest in the hemisphere, including Brazil, Peru, Nicaragua, and Venezuela.</p>\n\n<p>The leaders condemned the Iranian regime’s ongoing attacks on brave women, students, and the people of Iran.</p>\n\n<p>The Prime Minister and the President recalled the longstanding friendship, shared values, and deep interests that bind their countries together, and emphasized their mutual commitment to continue to advance strategic initiatives on shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/mexico-mexique/relations.aspx?lang=eng\">Canada-Mexico relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/20/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">The Canada-United States-Mexico Agreement (CUSMA)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/transparency-transparence/mexico-mexique/action-plan.aspx?lang=eng\">Canada-Mexico Action Plan</a></li>\n\t<li><a href=\"https://www.rcaanc-cirnac.gc.ca/eng/1673385209711/1673385540244\">Memorandum of Understanding between the Department of Crown-Indigenous Relations and Northern Affairs of Canada and the National Institute of Indigenous Peoples of the United Mexican States Relating to Collaboration on Indigenous Priorities</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/06/canada-welcomes-world-cop15-protect-nature\">Canada welcomes the world for COP15 to protect nature</a></li>\n</ul></div>\n      "
}