{
  "path": "/en/news/statements/2017/09/15/statement-prime-minister-international-day-democracy",
  "pageTitle": "Statement by the Prime Minister on International Day of Democracy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the International Day of Democracy:</p><p>“Today, we join our partners in the <a href=\"http://www.un.org/en/index.html\">United Nations</a> to celebrate the <a href=\"http://www.un.org/en/events/democracyday/\">International Day of Democracy</a>. We take the opportunity to recognize the freedoms that democracy affords us – and remind ourselves of the responsibility we all share to keep our democracy strong.</p><p>“This year’s theme – Democracy and Conflict Prevention – highlights the indivisible links between peace and democracy. Canada recognizes the critical need to strengthen democratic norms and institutions around the world to promote peace and stability. In order to endure, both peace and democracy must be built through inclusive approaches that respect human rights and diversity and promote gender equality. Women and girls’ leadership and participation in political, social, and peacebuilding processes are essential to creating political systems that truly represent the voices of all members of society.</p><p>“Equality is vital to a thriving democracy, and Canada reaffirms the need to work to change the severe disparities that exist in our world. To address these gaps, Canada and all UN member states adopted the ambitious <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/priorities-priorites/agenda-programme.aspx?lang=eng\">2030 Agenda for Sustainable Development</a>. The agenda provides a framework to eradicate poverty, protect our environment, and promote human rights. Our countries – and our world – are stronger and more peaceful when all people can make their voices heard, and when everyone’s rights are protected.</p><p>“Today is also the launch of Elections Canada’s <a href=\"http://democracy-democratie.ca/content.asp?document=home\">Canada’s Democracy Week</a>, a time for all Canadians, especially young people, to get engaged in the democratic process and talk about what democracy means to them and their communities.</p><p>“On behalf of the Government of Canada, I call on all Canadians to get informed and involved. By using our voices as forces for positive change, we can strengthen democratic norms and institutions in Canada and help make democracy a reality for all people around the world.”</p></div>\n      "
}