{
  "path": "/en/news/news-releases/2019/04/26/prime-minister-announces-temporary-changes-ministry",
  "pageTitle": "Prime Minister announces temporary changes to the Ministry | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced temporary changes to the Canadian Ministry. These changes follow Minister Dominic LeBlanc’s announcement that he is taking a leave of absence from his role as Minister of Intergovernmental and Northern Affairs and Internal Trade for health reasons.</p>\n\n<p>Minister of Finance, <strong>Bill Morneau</strong>, will temporarily assume responsibilities related to intergovernmental affairs and internal trade. Minister Morneau will also act as President of the Queen’s Privy Council for Canada.</p>\n\n<p>Minister of Crown-Indigenous Relations, <strong>Carolyn Bennett</strong>, will temporarily assume responsibilities related to northern affairs.</p>\n\n<p>Prime Minister Trudeau also announced that Minister of Public Services and Procurement and Accessibility, <strong>Carla Qualtrough</strong>, will temporarily act as Vice-Chair of the Cabinet Committee on Agenda, Results and Communications.</p>\n\n<p>In addition, Minister of Democratic Institutions, <strong>Karina Gould</strong>, will temporarily become the minister responsible for the <em>Federal Public Sector Labour Relations Act</em> and the <em>Federal Public Sector Labour Relations and Employment Board Act.</em> While Minister LeBlanc is currently responsible for these acts as President of the Queen’s Privy Council for Canada, the legislation prevents the Minister of Finance from assuming these responsibilities, requiring this change.&nbsp;</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Dominic, you are a trusted Cabinet minister and a close friend – and I’m happy you made the decision to focus on your health and your family during this difficult time.&nbsp;You have our full support, and we look forward to having you back at the Cabinet table soon.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<blockquote>\n<p>“From strengthening the Canada Pension Plan to negotiating health transfers and renewing the Atlantic Accord, Minister Morneau has a proven track record with working with provincial and territorial colleagues to deliver on what matters most to Canadians. By taking a leadership role on intergovernmental affairs and internal trade, he is well placed to continue this work and implement important measures outlined in Budget 2019.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<blockquote>\n<p>“Minister Bennett has extensive experience working with northern communities to address their priorities and meet their unique needs. I have full confidence that she will provide excellent leadership on this file, while she continues to work to renew the nation-to-nation, Inuit‑Crown, and government-to-government relationship between Canada and Indigenous peoples.”</p>\n\n<p>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<p>&nbsp;</p></div>\n      "
}