{
  "path": "/en/news/readouts/2021/01/11/prime-minister-justin-trudeau-speaks-prime-minister-italy-giuseppe-conte",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Italy Giuseppe Conte | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Italy, Giuseppe Conte.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Conte spoke about efforts in Canada and Italy to fight the COVID-19 pandemic and the priority of rolling out safe and effective vaccines to enable a strong economic recovery. The two leaders agreed on the need for a sustainable recovery from the pandemic, including support for more vulnerable countries, and the importance of international coordination.</p>\n\n<p>The Prime Ministers discussed Italy’s leadership this year as President of the G20, and as co-host of the COP26 climate conference in partnership with the United Kingdom. Both leaders emphasized the need for ambitious global action that will create momentum and lead to results in tackling climate change. They shared their commitment to making progress in advancing women’s empowerment, addressing global inequality, promoting democracy, and strengthening multilateralism.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Conte highlighted the deep connections between Canada and Italy, including through the vibrant Italian-Canadian community and strong people-to-people ties. They affirmed their continued commitment to work together to advance common priorities and to strengthen relations between both countries.<strong>&nbsp;</strong></p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Italy Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/22/prime-minister-concludes-virtual-g20-leaders-summit\">Prime Minister concludes virtual G20 Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}