{
  "path": "/en/news/news-releases/2017/11/26/prime-minister-strengthen-bilateral-and-commercial-ties-trip-china",
  "pageTitle": "Prime Minister to strengthen bilateral and commercial ties on trip to China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to China from December 3 to 7, 2017.</p><p>The Government of Canada remains committed to a stronger relationship between Canada and China – one that strengthens and grows the middle class, and is based on regular, frank, and comprehensive dialogue, including on issues like good governance, human rights, and the rule of law.</p><p>During the trip, the Prime Minister will meet with Chinese government and business leaders to build on the progress that the two countries have made since the Prime Minister’s first official visit to China in September 2016.</p><p>Prime Minister Trudeau will promote a progressive trade agenda and tourism initiatives that will create good, middle class jobs and more opportunities for people in both countries. He will also highlight the considerable potential for Canada and China to strengthen their cooperation on climate action, and lead the global effort to combat climate change.</p><p>Prime Minister Trudeau will begin his visit in Beijing where he will be officially welcomed at the Great Hall of the People and meet with His Excellency Li Keqiang, Premier of the State Council of the People’s Republic of China. He will also meet with His Excellency, Chairman Zhang Dejiang of the Standing Committee of the National People’s Congress, and His Excellency, President Xi Jinping of China.</p><p>The Prime Minister will then head to the city of Guangzhou where he will meet with Li Xi, Party Secretary of the Guangdong Provincial Committee of the Communist Party of China. He will then deliver the keynote address at a special session of the Fortune Global Forum, and hold several meetings with global business leaders to discuss ways to increase trade and attract international investments to Canada.</p><h2>Quote</h2><blockquote><p>“A strong relationship with China is essential to creating jobs, strengthening the middle class, and growing the Canadian economy. A closer relationship also means more opportunity to hold regular, frank dialogue on human rights issues like good governance, freedom of speech, and the rule of law. As we approach the Canada-China Year of Tourism in 2018, I look forward to meeting again with China’s leaders to strengthen our relationship and set the stage for even greater trade and investment cooperation.”<br>— <cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Justin Trudeau undertook his first official visit to China from August 30 to September 6, 2016, when he also participated in the G20 Leaders’ Summit in Hangzhou.</li><li>China is Canada’s second-largest trading partner, largest and fastest growing source market for international students, and third-largest source of tourists.</li><li>Canada’s merchandise exports to China were almost $21 billion in 2016, an increase of four per cent over 2015, with top exports being forest and agricultural products, copper and iron ores, and motor vehicles.</li><li>In 2016, Canada and China agreed to make 2018 the Canada-China Year of Tourism, which includes initiatives to increase the flow of tourists and promote cultural activities.</li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/china-chine/bilateral_relations_bilaterales/index.aspx?lang=eng&amp;_ga=2.56003307.1168694504.1511191876-108037952.1511191871\">Canada-China Relations</a></li></ul></div>\n      "
}