{
  "path": "/en/news/readouts/2023/01/30/prime-minister-justin-trudeau-meets-quebec-city-mayor-bruno-marchand",
  "pageTitle": "Prime Minister Justin Trudeau meets with Quebec City Mayor Bruno Marchand | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau and the Minister of Health, Jean-Yves Duclos, met with the Mayor of Quebec&nbsp;City, Bruno Marchand, to discuss priority issues on which they are co-operating.</p>\n\n<p>The leaders discussed public transit in the greater Quebec City area, including the Quebec City tramway project. The Prime Minister reiterated the federal government’s commitment to contribute 40 per cent of the eligible costs of this major project for the Quebec City region. They also talked about building more affordable housing, the fight against homelessness, and federal government investments under the Rapid Housing Initiative and the Housing Accelerator Fund.</p>\n\n<p>They went on to talk about Quebec City’s efforts to obtain international designation as a UNESCO biosphere reserve. Prime Minister Trudeau affirmed that Canada would support the City’s efforts for this innovative and ambitious project.</p>\n\n<p>The Prime Minister and the Mayor agreed to continue working together on these priority issues for Quebec City.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://tramwaydequebec.info/\">Quebec City tramway</a> (in French only)</li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/professionals/project-funding-and-mortgage-financing/funding-programs/all-funding-programs/rapid-housing\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://www.ville.quebec.qc.ca/apropos/espace-presse/actualites/fiche_autres_actualites.aspx?id=24567#:~:text=Qu%C3%A9bec%2C%20le%2012%20d%C3%A9cembre%202022,Biological%20(COP15)%20%C3%A0%20Montr%C3%A9al.\">Protection of biodiversity: Quebec City is taking steps to obtain designation as a UNESCO biosphere reserve</a> (in French only)</li>\n</ul></div>\n      "
}