{
  "path": "/en/news/statements/2020/10/28/statement-prime-minister-global-dignity-day",
  "pageTitle": "Statement by the Prime Minister on Global Dignity Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark Global Dignity Day in Canada:</p>\n\n<p>“Today, students and young people in Canada are marking <a href=\"https://globaldignity.ca/\">Global Dignity Day</a>. On this day, we reaffirm that everyone – regardless of who they are or where they come from – deserves a fair and equal chance at success, and acknowledge that together, we still have a lot of work to do in achieving a fairer and more inclusive world.&nbsp;&nbsp;</p>\n\n<p>“This year, the Global Dignity movement’s #UniteKindness campaign aims to connect young people around the world through positive actions during the global COVID-19 pandemic. The campaign is also a reminder to be kind to one’s self and to others. Demonstrating that by being there for others and by showing compassion, and recognizing everyone’s worth, we can appreciate that everybody deserves dignity – no matter their identity, beliefs, or circumstances.</p>\n\n<p>“As Canada and the world continue the fight against COVID-19, let us remember that we must all do what we can to uphold and respect the dignity of every human life. That includes ensuring Canadians can put food on the table, pay their bills, and have access to the supports they need to keep themselves and their families safe and healthy. During this difficult time, Canada will also continue to work with our partners to help build a world guided by compassion, equality, and dignity – because we know that we can’t end the pandemic in Canada without ending it everywhere. Together, we can build a more resilient Canada and a world that is fairer, safer, and more inclusive for everyone.</p>\n\n<p>“As one of Global Dignity’s National Role Models, I call on Canadians and everyone around the world to rally behind young people and to show that, by working together as a global community, we can help advance human rights and dignity for all. &nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I applaud all those involved in the Global Dignity movement for their passion and hard work, and wish them success with this year’s activities.”</p></div>\n      "
}