{
  "path": "/en/news/readouts/2022/02/18/prime-minister-justin-trudeau-convenes-sixth-incident-response-group",
  "pageTitle": "Prime Minister Justin Trudeau convenes the sixth Incident Response Group meeting on the illegal blockades and occupations | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the sixth meeting of the Incident Response Group where ministers and senior officials provided updates on the progress being made under the <em>Emergencies Act </em>to end the illegal blockades and occupations that started last month<em>.</em></p>\n\n<p>The group was briefed on the ongoing police enforcement efforts in Ottawa where the Royal Canadian Mounted Police, the Ottawa Police Service (OPS), Ontario Provincial Police, and other law enforcement agencies from across the country have moved into the downtown core. As a result of the enforcement actions, some protesters and people are leaving the area.</p>\n\n<p>The group were briefed on the comments made this afternoon by the Acting Chief of OPS who stated that the federal <em>Emergencies Act</em> along with provincial and city emergencies declarations gave police the tools to use new and existing powers to be able to properly deal with the demonstration to ultimately bring it to an end. The group noted the situation in Ottawa resulted in the unprecedented cancellation of today’s sitting of the House of Commons and the extension of the adjournment period of the Senate of Canada until February 21 due to the ongoing enforcement operations.</p>\n\n<p>The group was provided with an update on the progress in implementing finance-related measures under the&nbsp;<em>Emergency Economic Measures Order</em>. Financial Services providers have frozen several accounts.<strong> </strong>Additionally, FINTRAC’s pre-registration process is ongoing as it responds to several dozen inquiries received from small and medium-sized banks on the impact of the <em>Emergencies Act</em> orders.</p>\n\n<p>The group was briefed on the work by other federal agencies involved as well as efforts underway in other sites across the country to avoid any further blockades. They reconfirmed the ultimate goal is to bring a safe end to these illegal blockades and occupations across the country and see order restored. They were reassured the use of temporary powers being exercised under the <em>Emergencies Act</em> is being done responsibly and proportionately.&nbsp;</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/17/prime-minister-justin-trudeau-convenes-fifth-incident-response-group\">Prime Minister Justin Trudeau convenes the fifth Incident Response Group meeting on the illegal blockades and occupations</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/speeches/2022/02/18/remarks-deputy-prime-minister-and-minister-finance-regarding-emergencies\">Remarks by the Deputy Prime Minister and Minister of Finance regarding the&nbsp;<em>Emergencies Act</em>&nbsp;and the Trans Mountain Expansion Project</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/02/federal-government-declares-a-public-order-emergency-under-the-emergencies-act-to-end-disruptions-blockades-and-the-occupation-of-the-city-of-ottawa.html\">Federal government declares a public order emergency under the <em>Emergencies Act</em> to end disruptions, blockades, and the occupation of the city of Ottawa</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/02/15/canada-invokes-emergencies-act-limit-funding-illegal-blockades-and\">Canada invokes the <em>Emergencies Act</em> to limit funding of illegal blockades and restore public order</a></li>\n</ul></div>\n      "
}