{
  "path": "/en/news/statements/2019/08/12/statement-prime-minister-international-youth-day",
  "pageTitle": "Statement by the Prime Minister on International Youth Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Youth Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/youthday/\">International Youth Day</a>, we celebrate young people in Canada and around the globe.</p>\n\n<p>“Whether fighting the climate crisis or pushing for social justice, young people are changing the world, and shaping a better future for all of us. That’s why supporting young people is so important – and that’s exactly what our government is doing.</p>\n\n<p>“This year’s theme, ‘Transforming education,’ highlights the need to make education more inclusive and accessible for young people everywhere. The Government of Canada is a leader in making sure young people have an equal chance to learn and succeed. During our G7 presidency, Canada and partners announced an investment of $3.8 billion in education for women and girls in conflict and crisis situations – the largest of its kind ever made. At the United Nations General Assembly this past September, we welcomed another $527 million from partners to help developing countries give every young person access to the education and training they need to succeed.</p>\n\n<p>“Here at home, we are also taking action to help young people reach their full potential. We increased student grants and lowered interest rates on student loans. With Budget 2019, we made major investments in work placements – a significant step towards making sure there’s a work placement for every student that wants one. This year, we also launched Canada’s <a href=\"https://www.canada.ca/en/youth/programs/policy.html\">first-ever Youth Policy</a>, to make sure young people have a voice in the decisions that affect them. And in Budget 2019, we boosted funding for initiatives like the <a href=\"https://www.canada.ca/en/services/youth/canada-service-corps.html?utm_campaign=CanadaServiceCorps&amp;utm_source=SocialMedia_Print_Poster&amp;utm_medium=VanityUrl&amp;utm_term=en&amp;utm_content=canada-ca_canada-service-corps\">Canada Service Corps</a>, and launched the modernized <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a> to help young Canadians pursue the careers of their choice.</p>\n\n<p>“Earlier this month, I welcomed new members to the Youth Council, who will help shape government decisions on issues like advancing reconciliation, fighting the climate crisis, and creating more jobs and opportunities for Canadians. Together, the Council will help inspire young people to shape their communities – and our country – for the better.</p>\n\n<p>“As Minister of Youth, I know that when young people can create change and make their voices heard, they help build a better world. Young people are leaders – and we will keep fighting for you, and with you, to build a better future.”</p></div>\n      "
}