{
  "path": "/en/news/readouts/2022/03/10/prime-minister-justin-trudeau-meets-prime-minister-poland-mateusz",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Poland Mateusz Morawiecki | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Prime Minister of Poland, Mateusz Morawiecki, in Warsaw, Poland.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Morawiecki strongly condemned Russia’s ongoing military aggression against the territorial integrity, sovereignty, and independence of Ukraine, and deplored the catastrophic human consequences of Russia’s reckless military actions as they indiscriminately continue to strike civilians.</p>\n\n<p>Both leaders highlighted the heroic efforts of the Ukrainian military and people, as well as the inspirational leadership of Ukrainian President Volodymyr Zelenskyy, who are risking their lives to defend their country. They agreed on the need to continue imposing severe costs on Russia, and to provide additional support for Ukraine, including military aid and humanitarian assistance.</p>\n\n<p>Prime Minister Trudeau expressed his appreciation for Poland’s efforts in welcoming over one million refugees fleeing from Ukraine. He highlighted the increasing need for support from the international community to coordinate the growing exodus, including through calls to allow civilians to access humanitarian corridors. Prime Minister Trudeau pledged Canada’s support in this regard.</p>\n\n<p>The two leaders discussed relations between Canada and Poland, and emphasized the importance of trade and innovation in continuing to bring the two economies closer together.</p>\n\n<p>Prime Minister Trudeau commended Poland’s leadership in addressing this crisis.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland relations</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/news-releases/2022/02/24/canada-announces-additional-measures-support-ukraine\">Canada announces additional measures to support Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}