{
  "path": "/en/news/news-releases/2017/11/14/prime-minister-launches-canadacaresults",
  "pageTitle": "Prime Minister launches Canada.ca/Results | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is committed to being the most open and accessible government possible. In keeping with this commitment, the Prime Minister, Justin Trudeau, today announced the launch of <a href=\"https://www.canada.ca/en/privy-council/campaigns/mandate-tracker-results-canadians.html\">Canada.ca/Results</a>.</p><p>This new website reports publicly on the progress we have made to deliver real and meaningful results for Canadians. It also gives Canadians a sense of the results they should expect to see and how we intend to make change real.</p><p>Using <a href=\"https://www.canada.ca/en/privy-council/campaigns/mandate-tracker-results-canadians.html\">Canada.ca/Results</a>, Canadians will be able to track progress for each of the <a href=\"/en/mandate-letters\">mandate letter</a> commitments and top government-wide priorities, such as fighting climate change, advancing reconciliation with Indigenous Peoples, growing our economy, and strengthening the middle class.</p><p>Over the past two years, we have taken significant strides to fulfill our mandate. This progress would not be possible without the hard work and dedication of public servants, who make a real difference in Canadians’ lives every day.</p><p>Today’s launch is only the first step – we will continue to improve <a href=\"https://www.canada.ca/en/privy-council/campaigns/mandate-tracker-results-canadians.html\">Canada.ca/Results</a> to enhance its functionality, and we intend to update the website often as commitments progress.</p><h2>Quote</h2><blockquote><p>“We’re working hard every day to grow the middle class and deliver real, meaningful results for people across the country. Canadians should have the best tools possible to hold us accountable. That is what <a href=\"https://www.canada.ca/en/privy-council/campaigns/mandate-tracker-results-canadians.html\">Canada.ca/Results</a> is all about. We want Canadians to know exactly how we’re doing, and help drive progress on issues that matter most to them.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>In November 2015, the Prime Minister took the unprecedented step of publicly releasing all ministerial mandate letters, as part of his plan for open and transparent government for Canadians.</li><li>Mandate letters provide Ministers with the Prime Minister’s expectations of approach and priorities. They are not intended to be an exhaustive list of all the files a Minister needs to work on.</li></ul><h2>Associated Link</h2><ul><li><a href=\"/en/news/news-releases/2015/11/13/prime-minister-canada-makes-ministerial-mandate-letters-public\">Prime Minister of Canada makes ministerial mandate letters public</a></li><li><a href=\"/en/mandate-letters\">Mandate letters</a></li><li><a href=\"http://open.canada.ca/en\">Open Government</a></li></ul></div>\n      "
}