{
  "path": "/en/news/news-releases/2019/06/10/canada-ban-harmful-single-use-plastics-and-hold-companies-responsible",
  "pageTitle": "Canada to ban harmful single-use plastics and hold companies responsible for plastic waste | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Plastic pollution is a global challenge that requires immediate action. Plastic waste ends up in our landfills and incinerators, litters our parks and beaches, and pollutes our rivers, lakes, and oceans, entangling and killing turtles, fish, and marine mammals.</p>\n\n<p>Less than 10 per cent of plastic used in Canada gets recycled. Without a change in course, Canadians will throw away an estimated $11 billion worth of plastic materials each year by 2030. We’ve reached a defining moment, and this is a problem we simply can’t afford to ignore.</p>\n\n<p>That is why the Prime Minister, Justin Trudeau, today announced that the Government of Canada is taking additional steps to reduce Canada’s plastic waste, support innovation, and promote the use of affordable and safe alternatives. Working with governments and businesses across Canada, the Government of Canada will:</p>\n\n<ul>\n\t<li>ban harmful single-use plastics as early as 2021 (such as plastic bags, straws, cutlery, plates, and stir sticks) where supported by scientific evidence and warranted, and take other steps to reduce pollution from plastic products and packaging</li>\n\t<li>work with provinces and territories to introduce standards and targets for companies that manufacture plastic products or sell items with plastic packaging so they become responsible for their plastic waste.</li>\n</ul>\n\n<p>These measures will be grounded in scientific evidence and will align, where appropriate, with similar actions being taken in the European Union and other countries. They will also support the Canadian Council of Ministers of the Environment’s development of an action plan to implement the Canada-wide Strategy on Zero Plastic Waste.</p>\n\n<p>By improving how we manage plastic waste and investing in innovative solutions, we can reduce 1.8 million tonnes of carbon pollution, generate billions of dollars in revenue, and create approximately 42,000 jobs.</p>\n\n<p>With the longest coastline in the world and one-quarter of the world’s freshwater, Canada has a unique responsibility – and opportunity – to lead in reducing plastic pollution. From launching the Ocean Plastics Charter at the 2018 G7 Summit to investing in new Canadian technologies that turn plastic waste into valuable resources, we are doing just that. Together, we can make our economy stronger and take an important step toward protecting wildlife and the places Canadians love.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians know first-hand the impacts of plastic pollution, and are tired of seeing their beaches, parks, streets, and shorelines littered with plastic waste. We have a responsibility to work with our partners to reduce plastic pollution, protect the environment, and create jobs and grow our economy. We owe it to our kids to keep the environment clean and safe for generations to come.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“We’ve all seen the disturbing images of fish, sea turtles, whales, and other wildlife being injured or dying because of plastic garbage in our oceans. Canadians expect us to act. That’s why our government intends to ban harmful single-use plastic products where science warrants it, and why we’re working with partners across Canada and around the world to reduce plastic pollution. Taking these steps will help create tens of thousands of middle-class jobs and make our economy even stronger—while protecting fish, whales, and other wildlife, and preserving the places we love.”</p>\n\n<footer class=\"default\">The Hon. Catherine&nbsp;McKenna, Minister of Environment and Climate Change</footer>\n</blockquote>\n\n<blockquote>\n<p>“The health of our oceans is vital to the economic, cultural, and social well-being of Canada’s coastal communities. We know plastic pollution harms Canada’s oceans, wildlife, communities—and our economy. It’s a problem we simply can’t afford to ignore. We are working with industry to prevent and remove ghost fishing gear, to protect marine animals and the marine environment now and for future generations.”</p>\n\n<footer class=\"default\">The Hon. Jonathan Wilkinson, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Every year, Canadians throw away over 3&nbsp;million tonnes of plastic waste. This represents up to $8&nbsp;billion per year in lost value and wastes valuable resources and energy.</li>\n\t<li>About one-third of the plastics used in Canada are for single-use or short-lived products and packaging. In fact, in Canada, up to 15 billion plastic bags are used every year and close to 57 million straws are used daily.</li>\n\t<li>Every year, 640,000 tons of abandoned, lost or discarded fishing gear enters our oceans. It can persist in the environment for up to 600 years.</li>\n\t<li>Every year, one million birds and over 100,000 sea mammals worldwide are injured or die when they mistake plastic for food or become entangled.</li>\n\t<li>Globally, one garbage truckload of plastic waste enters the ocean every minute, and that amount is increasing steadily.</li>\n\t<li>Over the last 25 years, nearly 800,000 volunteers have removed over 1.3 million kilograms of trash from across Canada’s shorelines through Ocean Wise and World Wildlife Fund’s Great Canadian Shoreline Cleanup program, supported by the Government of Canada.<sup> </sup>The most commonly littered items on our shorelines are single-use or short-lived products, many made of plastics.</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li>Backgrounder - <a href=\"/en/news/backgrounders/2019/06/10/government-canada-taking-action-reduce-plastic-pollution\">Government of Canada taking action to reduce plastic pollution</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.ccme.ca/en/current_priorities/waste/waste/strategy-on-zero-plastic-waste.html\" title=\"Strategy on Zero Plastic Waste\">Canadian Council of Ministers of the Environment - Strategy on Zero Plastic Waste </a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-reducing-waste/international-commitments/ocean-plastics-charter.html\" title=\"Ocean plastics charter\">Ocean Plastics Charter</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2018/09/government-helping-small-businesses-develop-sustainable-solutions.html\">Government helping small businesses develop sustainable solutions</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/about-invest-apropos-eng.html\" title=\"Investing in Canada Plan\">Investing in Canada Plan</a></li>\n\t<li><a href=\"https://www.canada.ca/en/fisheries-oceans/news/2018/09/investing-in-our-oceans.html\" title=\"Investing in our oceans\">Investing in our oceans</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/services/managing-pollution/publications/plastic-waste-report.html\">Economic Study of the Canadian Plastic Industry, Markets and Waste: summary report</a></li>\n</ul></div>\n      "
}