{
  "path": "/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7",
  "pageTitle": "Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced he will participate in the Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda, the G7 Summit at Schloss Elmau, Germany, and the NATO Summit in Madrid, Spain. He will also participate in an official bilateral visit hosted by the Prime Minister of Spain, Pedro Sánchez.</p>\n\n<p>The world is facing shared crises: Russia’s illegal invasion of Ukraine is a direct challenge to democracy and the rule of law, which has also driven up the cost of living for people around the world; and climate change is already impacting people’s livelihoods and our economies. At these meetings, the Prime Minister will further strengthen key partnerships and advance our shared priorities, including defending peace, security, and human rights; taking ambitious climate action and growing the economy; and making life better and more affordable for people around the world.</p>\n\n<p>At the CHOGM, from June 23 to 25, 2022, Prime Minister Trudeau will reaffirm Canada’s commitment to the core values that bring the countries of the Commonwealth together: free and democratic societies and the promotion of peace and prosperity to improve the lives of all people. He will advance collaboration on continuing to hold Russia accountable for its unjustifiable invasion of Ukraine, addressing food security, and fighting climate change. This year, leaders will meet under the theme “Delivering a Common Future: Connecting, Innovating, Transforming” and discuss how to improve the lives of the citizens of the Commonwealth’s 54 countries.</p>\n\n<p>At the G7 Summit, from June 26 to 28, 2022, the Prime Minister will build on the close collaboration of G7 partners in recent months in response to Russia’s military aggression against Ukraine, including how to best support the millions of Ukrainians who have been displaced. As part of its G7 presidency this year, Germany has identified “Progress towards an equitable world” as the theme for this year’s G7 Summit. The Prime Minister will continue to advance shared priorities, including supporting Ukraine unequivocally, building a cleaner future, continuing to get COVID-19 vaccines to those who need them, and the G7 values that unite our counties including democracy, human rights, and gender equality.</p>\n\n<p>At the NATO Summit, from June 28 to 30, 2022, Prime Minister Trudeau will participate in a meeting of the North Atlantic Council and discuss ongoing and future transatlantic security threats and challenges, including Russia’s attack on Ukraine and ways to strengthen our shared security commitments to keep people in our countries safe.</p>\n\n<p>Following the NATO Summit, Prime Minister Trudeau will participate in an official bilateral visit hosted by the Prime Minister of Spain, Pedro Sánchez on June 30, 2022. The visit will be an opportunity to advance Canada and Spain’s shared commitments to create economic growth that benefits everyone, combat climate change, advance gender equality, and work towards a safer and more peaceful world.</p>\n\n<p>The international community is strongest when it acts together to defend the values our countries share – above all, a commitment to making life better for people. Canada will continue to work with our global partners and democracies around the world to address the challenges of today while rising to meet the opportunities of tomorrow.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“When the world comes together to address the challenges of our time, we achieve the best outcomes for people. Defending democracy and human rights, addressing the rising cost of living, and taking ambitious climate action will take the collective will of the Commonwealth, G7, and NATO. I look forward to meeting with leaders in the coming weeks to advance our efforts to tackle these key challenges and make life better for people around the world.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The CHOGM, the G7 Summit, and the NATO Summit are key meetings for Canada to collaborate with other countries, align our efforts, and develop collective solutions to the world’s most pressing challenges.</li>\n\t<li>The modern Commonwealth is a values-based association of 54 countries, most with historic links to the United Kingdom and home to over 2.4 billion citizens over five continents.</li>\n\t<li>Decisions taken at the CHOGM will also guide the work of the Commonwealth Secretariat. &nbsp;</li>\n\t<li>Canada is the second largest donor to the Commonwealth and contributed a total of $10.73 million to the organization in 2020-21. Canada is also the proud host of the <a href=\"https://www.col.org/\">Commonwealth of Learning</a> which uses distance learning and technologies to expand access to education and training that leads to economic growth, social inclusion and environmental conservation</li>\n\t<li>The G7 includes Canada, France, Germany, Italy, Japan, the United Kingdom, the United States, and the European Union.</li>\n\t<li>Leaders of the G7 have come together since the 1970s to discuss issues of domestic and global concern.</li>\n\t<li>In addition to G7 members, Germany has also invited leaders from Argentina, India, Indonesia, Senegal, and South Africa as guest countries.</li>\n\t<li>Canada last held the presidency of the G7 in 2018. Germany holds the presidency in 2022, and Japan will hold it in 2023. Canada will next host the G7 in 2025.</li>\n\t<li>The North Atlantic Treaty Organization (NATO) is a cornerstone of Canada’s international security and defence policy, and the primary international forum in which to engage and collaborate with Allies and partners on transatlantic defence and security.</li>\n\t<li>Canada and Spain are partners and allies that enjoy a strong relationship based on shared interests and values including human rights, democracy, fighting climate change, and advancing gender equality.</li>\n\t<li>In 2021, Canada’s bilateral goods and services trade with Spain reached $6.5 billion, making Spain Canada’s 18th largest global trading partner in goods and services.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.chogm2022.rw/\">CHOGM Rwanda 2022</a> (in English only)</li>\n\t<li><a href=\"https://www.g7germany.de/g7-en\">G7 Germany 2022</a> (in English only)</li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g7/index.aspx?lang=eng\">Canada and the G7</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/spain-espagne/relations.aspx?lang=eng\">Canada-Spain relations</a></li>\n</ul></div>\n      "
}