{
  "path": "/en/news/readouts/2022/01/31/prime-minister-justin-trudeau-speaks-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay spoke with Prince Edward Island Premier Dennis King to discuss the export of P.E.I. potatoes to the United States, the urgency of resolving this issue, as well as other shared priorities.</p>\n\n<p>The Prime Minister and Premier underscored the strong collaborative relationship between Canada and the province. They discussed the meeting Minister MacAulay and Minister of Agriculture and Agri-Food Marie-Claude Bibeau had in Washington, D.C. last week with U.S. Secretary of Agriculture Tom Vilsack. The Prime Minister and Premier reaffirmed their support for farmers and their jobs, families, and livelihoods. They agreed to continue to work together on restoring U.S. market access to P.E.I. potatoes.</p>\n\n<p>The two leaders also spoke about the COVID-19 pandemic, including the importance of health human resources in the province and across the country, cooperative efforts on health care, and support for mental health. The Prime Minister emphasized that the Government of Canada remains ready to provide further support to Prince Edward Island, as needs emerge.&nbsp;The Prime Minister and Premier also discussed support for the province’s bioscience sector, noting its importance to the Island’s economy.</p>\n\n<p>Prime Minister Trudeau and Premier King agreed to continue collaborating on these priorities and other issues of importance to Islanders and all Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/12/14/prime-minister-justin-trudeau-holds-35th-call-premiers-covid-19-response\">Prime Minister Justin Trudeau holds 35th call with premiers on COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/agriculture-agri-food/news/2022/01/minister-bibeau-and-minister-macaulay-meet-with-united-states-secretary-of-agriculture-vilsack.html\">Minister Bibeau and Minister MacAulay meet with United States Secretary of Agriculture</a></li>\n\t<li><a href=\"https://www.canada.ca/en/atlantic-canada-opportunities/news/2022/01/supporting-market-expansion-for-pei-potatoes.html\">Supporting market expansion for PEI potatoes</a></li>\n</ul></div>\n      "
}