{
  "path": "/en/news/readouts/2020/02/02/prime-minister-justin-trudeau-convenes-incident-response-group-update",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group for an update on the coronavirus situation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the Government of Canada’s response to the novel coronavirus, including next steps to assist Canadians who have requested help in departing from Wuhan, China, health measures, and travel advisories. The government remains fully engaged on the issue, and will do all that is necessary to ensure the safety of Canadians, both at home and abroad. Ministers and Government of Canada officials at all levels have been in close contact with our international partners including Australia, New Zealand, the United Kingdom, the United States of America, and the World Health Organization to share information on responses to the novel coronavirus outbreak.</p>\n\n<p>Minister of Foreign Affairs François-Philippe Champagne, Minister of Health Patty Hajdu, Minister of National Defence Harjit Sajjan, and Minister of Public Safety and Emergency Preparedness Bill Blair provided an overview of discussions Canada has had with its international partners on the coronavirus response. They also updated the group on actions being taken to bring Canadians home from the affected areas and prevent and limit the spread of the virus. The Government of Canada has chartered a plane that will fly to Wuhan, and is in the process of finalizing the necessary authorizations to land in China and facilitate Canadians’ departure.</p>\n\n<p>The group discussed actions that will be taken once the Canadians on board arrive from China at the Canadian Forces Base in Trenton, Ontario. These actions include thorough health screenings and a period of observation at the base in order to protect the health and safety of Canadians. They highlighted work being done with provincial, territorial, and local health services to support Canadians upon their arrival and to arrange for further care if the need arises.</p>\n\n<p>The Prime Minister remarked on his visit yesterday to Toronto where he celebrated the Lunar New Year with Chinese Canadians and again underlined the importance of Canadians’ support for each other, and of combatting fear, stigma, and racism.</p></div>\n      "
}