{
  "path": "/en/news/statements/2018/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p><p>“Today on <a href=\"http://www.un.org/en/events/humanrightsday/\">Human Rights Day</a>, we celebrate the progress we have made as a global community to advance human rights. We also reflect on what more we can do as a country and as individuals to ensure that every single person – here in Canada and around the world – can live a life with dignity and respect.</p><p>“On this day, seventy years ago, the United Nations General Assembly adopted the <a href=\"http://www.un.org/en/universal-declaration-human-rights/\">Universal Declaration of Human Rights</a>. This milestone document declares that all human beings are born free and equal in dignity and rights, no matter their identity, beliefs, or circumstances. Today, we proudly recognize the important contributions made by Canadian John Humphrey, who helped draft the original declaration.</p><p>“Canada is unwavering in its commitment to protect and promote human rights. We will not stand idle while hundreds of thousands of people around the world suffer gross human rights violations, nor will we hesitate to condemn violations of human rights, regardless of where they take place.</p><p>“At home, we are working hard to build a country where all Canadians are free and safe to be themselves, and can go as far as their dreams will take them. We continue to take concrete measures to fight racism and discrimination based on sexual orientation, gender identity, and gender expression. We will keep taking meaningful actions to advance reconciliation with Indigenous peoples, and continue to work hard to put an end to human trafficking.</p><p>“Last month, we also delivered <a href=\"/en/news/news-releases/2018/11/07/prime-minister-delivers-apology-regarding-fate-passengers-ms-st-louis\">an apology regarding the fate of the MS <i>St. Louis</i> and its passengers</a> who were refused refuge in Canada. Measures like this cannot rewrite history or undo the harm of past actions, but they are vital for us to move forward together, as a more diverse, just, and inclusive country.</p><p>“On the 70th anniversary of the Universal Declaration of Human Rights, I encourage all Canadians to join me to thank those around the world who work hard every day – often at grave personal risk – to advance human rights and protect the world’s most vulnerable.</p><p>“Standing up for human rights starts with our everyday actions – respecting people’s differences, speaking up for others, and speaking out against those who foment hate and seek to divide us. Human rights are universal and fundamental – and so is our responsibility to protect them.”</p></div>\n      "
}