{
  "path": "/en/news/statements/2017/01/26/prime-minister-announces-changes-parliamentary-secretaries",
  "pageTitle": "Prime Minister announces changes to Parliamentary Secretaries | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement after the appointment of 34 parliamentary secretaries:</p>\n<p>“I want to thank all Parliamentary Secretaries who have served our government and the Canadian people during our first 14 months in office. At the same time, I am delighted to announce 34 <a href=\"/en/parliamentary-secretaries\">parliamentary secretaries</a> who will work with their respective cabinet ministers to deliver real results for Canadians. This team’s talent, dedication, and breadth of experience will prove invaluable as we pursue our plan to rebuild and strengthen Canada’s middle class, and deliver long-term economic growth that is felt by all Canadians.</p>\n<p>“The parliamentary secretaries involved in today’s announcement are either newly appointed, staying in their current portfolio, or taking on new responsibilities. Parliamentary Secretaries will resume or take on their duties on January 30, 2017, as will <a href=\"/en/news/news-releases/2017/01/18/prime-minister-canada-announces-parliamentary-secretary-minister\">Andrew Leslie</a>, who was recently appointed as Parliamentary Secretary to the Minister of Foreign Affairs (Canada-U.S. Relations).</p>\n<p>“I am also pleased to announce the appointment of Filomena Tassi as the Deputy Government Whip, effective January 30, 2017. Ms. Tassi will join Chief Government Whip Pablo Rodriguez in helping implement the priorities of the Government of Canada in Parliament.</p>\n<p>“Each of these individuals, from a variety of backgrounds and communities across Canada, bring their own skills and points of view to government. I am confident they will complement our current cabinet strengths and help build an even better future for all Canadians.”</p>\n<p>For more information on the role of parliamentary secretaries, please consult:&nbsp;<a href=\"/en/news/backgrounders/2015/11/27/open-and-accountable-government\">Open and Accountable Government</a>.</p></div>\n      "
}