{
  "path": "/en/news/news-releases/2016/01/11/prime-minister-travel-davos-attend-world-economic-forum",
  "pageTitle": "Prime Minister to travel to Davos to attend World Economic Forum | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, announced today that he will travel to Davos, Switzerland, from January 20 to 23, 2016, to attend the World Economic Forum (WEF) annual meeting.</p>\n<p>At the WEF, the Prime Minister will share the real and positive economic changes he intends to undertake to create jobs, strengthen the middle class, and grow the Canadian economy. These changes include: historic investments in transit, green, and social infrastructure; tax cuts for the middle class and small businesses; renewed innovation; and Canada’s enhanced participation in international institutions.</p>\n<p>In Davos, Prime Minister Trudeau will also have the opportunity to discuss a wide range of international issues – and advance economic opportunities for Canada – with global business leaders, representatives of civil society, and other world leaders.</p>\n<p><strong>Quote</strong></p>\n<p>“At the World Economic Forum, we will signal the return of a more positive, open, and innovative Canada to the international business community. In an increasingly interconnected global economy, Canada’s diversity and connections to the world are among our greatest economic assets, and will prove vital as we work to grow the middle class. Moving forward, we will focus not only on enhancing the prosperity of Canadians, but of all global citizens in an inclusive way.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick facts</strong></p>\n<ul>\n<li>The WEF brings together the world’s foremost private and public sector and civil society leaders in collaborative activities focused on shaping global, regional and industry agendas.</li>\n<li>The Prime Minister will be joined in Davos by Minister of International Trade Chrystia Freeland, Minister of Finance Bill Morneau, Minister of Innovation, Science and Economic Development Navdeep Bains, Minister of Environment and Climate Change Catherine McKenna, and President of the Treasury Board Scott Brison, each of whom will have his or her own program of meetings during the four-day conference. Canada’s strong presence at the WEF underscores the importance of this meeting for shaping the international agenda and advancing economic opportunities for Canada.</li>\n<li>The theme for this year’s conference is “Mastering the Fourth Industrial Revolution” which refers to the current global context where technological breakthroughs, demographic shifts and political transformations are providing both challenges and opportunities, and resulting in societal and economic circumstances that require collaborative action.</li>\n</ul>\n<p><strong>Associated link</strong></p>\n<ul>\n<li><a href=\"http://www.weforum.org/events/world-economic-forum-annual-meeting-2016\">World Economic Forum Annual Meeting</a></li>\n</ul></div>\n      "
}