{
  "path": "/en/news/statements/2020/06/08/statement-prime-minister-world-oceans-day",
  "pageTitle": "Statement by the Prime Minister on World Oceans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, issued the following statement on World Oceans Day:</p>\n\n<p>“From the Atlantic to the Pacific to the Arctic, oceans are at the heart of many Canadian communities, providing people with places to live, work, and play. They give us clean air, food to put on our tables, and support our economy.</p>\n\n<p>“Today, on World Oceans Day, we join people around the world to promote the importance of our oceans and rededicate ourselves to their protection. With more than seven&nbsp;million Canadians living along the world’s longest coastline, we have a responsibility to safeguard our oceans and recognize their unique role in Canadian history and culture, and in Indigenous traditions across the country.</p>\n\n<p>“Oceans are also central to our fight for the planet’s future. We must continue to fight climate change, which puts the health of our oceans at risk. We must also use our oceans in a sustainable way so we can protect marine ecosystems and provide opportunities to the people and communities who depend on them for their livelihoods.</p>\n\n<p>“The theme of this year’s World Oceans Day – <a href=\"https://unworldoceansday.org/page/home\">Innovation for a Sustainable Ocean</a> – reminds us that we need to invest in science and research to better protect our oceans. Innovation, determination, and collaboration will help us find new ways to tap into the potential of our oceans to build a cleaner, more prosperous future for generations to come.</p>\n\n<p>“The people, businesses, and coastal communities that rely on our oceans understand how closely connected they are to our wellbeing and the health of our planet. That is why the Government of Canada is working closely with partners to protect aquatic species at risk, conserve 25 per cent of Canada’s land and oceans by 2025 and 30 per cent of each by 2030, and support advancements in research and clean technologies. We have already protected nearly 14 per cent of our marine and coastal areas, up from around 1 per cent in 2015 and past our goal of 10 per cent by 2020. We also launched the <a href=\"https://www.tc.gc.ca/en/initiatives/oceans-protection-plan/report-canadians-investing-coasts-oceans-protection-plan.html\">Oceans Protection Plan</a>, our largest investment ever to make our coasts and waterways safer and healthier, partnering with coastal and Indigenous communities.</p>\n\n<p>“We are working with international partners to support resilient coasts and coastal communities, and lead a global movement toward a sustainable blue economy. The blue economy is about harnessing the potential of our waters to improve the lives of all, particularly women, young people, Indigenous peoples, and people in developing states.</p>\n\n<p>“Last week’s virtual ocean dialogues hosted by the World Economic Forum and the Friends of Ocean Action – the first-ever virtual global ocean conference – was an opportunity to come together to continue our ambitious global action for healthy oceans, in light of the COVID-19 pandemic. Oceans are important for small island developing states, which are highly vulnerable to ocean-related impacts of climate change. Canada is taking a lead role on these issues internationally, and we will continue to work with our partners to make sure that we put our people and our environment at the heart of everything we do.</p>\n\n<p>“We can all take action to ensure our oceans continue to be safe, clean, and healthy. Today, I encourage Canadians to take part in one of the virtual events being held across the country and around the world, and to think about what they can do to protect their local waterways and the world’s oceans for our children and grandchildren.”</p></div>\n      "
}