{
  "path": "/en/news/news-releases/2017/09/13/prime-minister-lead-canadian-delegation-united-nations-general",
  "pageTitle": "Prime Minister to lead Canadian delegation to the United Nations General Assembly in New York | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to New York City, from September 19 to 21, to lead Canada’s delegation to the opening of the 72<sup>nd</sup> Session of the United Nations General Assembly (UNGA).&nbsp;</p><p>At the UNGA, the Prime Minister is scheduled to deliver Canada’s national address on the afternoon of September 21. The UNGA, with its 193 member states, provides an important opportunity for Canada to voice its commitment to strengthening multilateralism and the rules-based international order, advancing human rights, including gender equality and women’s empowerment, and championing diversity and inclusion.</p><p>While in New York, the Prime Minister will be honoured at the Atlantic Council dinner on September 19 as part of the annual “Global Citizen Awards.” He will receive the award in recognition of his leadership to advance inclusiveness, diversity, and economic growth that works for everyone.</p><p>On September 20, the Prime Minister will speak to more than 6,000 youth at WE Day UN to mobilize youth action on the UN’s Sustainable Development Goals, which aim to end poverty, protect the planet, and ensure prosperity for all. He will also participate in the Bloomberg Global Business Forum to discuss how leaders from business and government can create a more transparent, equitable, and sustainable framework for the global economy.</p><h2>Quote</h2><blockquote><p>“In building a better world, multilateralism is the recognition that we are stronger when we stand together. Canada believes our collective peace and prosperity can only be achieved through diverse and meaningful partnerships. A modern United Nations focused on the challenges and opportunities of the 21st century will ensure a brighter future for all.”<br>—<cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Fact</h2><ul><li>Canada is the fifth largest donor to the UN system.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/genev/mission/canada-UN_nu.aspx?lang=eng\">Canada and the United Nations</a></li><li><a href=\"/en/news/speeches/2016/09/20/prime-minister-justin-trudeau’s-address-71st-session-united-nations\">Prime Minister Justin Trudeau’s Address to the 71<sup>st</sup> Session of the United Nations General Assembly</a></li><li><a href=\"http://www.atlanticcouncil.org/events/global-citizen-awards\">Atlantic Council – Global Citizen Awards 2017</a></li></ul></div>\n      "
}