{
  "path": "/en/news/statements/2022/11/26/statement-prime-minister-holodomor-memorial-day",
  "pageTitle": "Statement by the Prime Minister on Holodomor Memorial Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Holodomor Memorial Day:</p>\n\n<p>“Today, we remember the millions of innocent people in Ukraine who suffered and died at the hands of Joseph Stalin’s totalitarian Soviet regime during the Holodomor.</p>\n\n<p>“The Holodomor was a systemic and heinous campaign of deliberate starvation across Ukraine in 1932 and 1933. The Soviet regime starved millions of Ukrainians, stole their land, and seized their crops. The regime arrested, deported, or executed Ukrainians in a genocide designed to repress their rights and identity, and destroy their aspirations for a free and independent Ukraine.</p>\n\n<p>“In the face of this cruelty, Ukrainians held on to their language and culture, and persevered to win their independence in 1991, after almost 70 years of Soviet control. Until its collapse, the Soviet regime denied the atrocities of the Holodomor, and the suffering of Ukrainians was not known to the international community for over five decades. Russia still denies the Holodomor as a genocide.</p>\n\n<p>“Ukrainians are resilient. Today, we continue to be inspired by their strength and bravery in the face of the Russian regime’s brutal and unjustifiable invasion of their country. Just as the generations before them, the people of Ukraine will not give up their centuries-long vision for a free and independent country. The Government of Canada will continue our steadfast support of the people of Ukraine as they defend their country, as well as our shared values of democracy and respect for human rights. We will always stand up for what is right as we build a better world for all.</p>\n\n<p>“Today, it is up to all of us to remember the Holodomor genocide as it happened, learn from it, and honour those who lost their lives. On this solemn day, I join Ukrainians here in Canada and around the world to remember, to mourn, and to stand with them as they defend their country, and our shared values.”</p></div>\n      "
}