{
  "path": "/en/news/news-releases/2020/03/27/prime-minister-announces-support-small-businesses-facing-impacts",
  "pageTitle": "Prime Minister announces support for small businesses facing impacts of COVID‑19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Government of Canada is focused on helping Canadians and businesses through this tough economic time. We will continue to protect the health and safety of Canadians, while supporting families and businesses and keeping our economy strong in the face of uncertainty.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced additional new measures to support small businesses dealing with the economic impacts of the pandemic. These measures will help Canadian businesses protect the jobs that Canadians depend on, and pay their workers and bills during these difficult times.</p>\n\n<p>Today’s announcement is a part of the government’s COVID-19 Economic Response Plan, which already commits $107 billion in support to Canadians so they can buy groceries, pay rent, and care for their loved ones, and also supports businesses through this difficult time.&nbsp;</p>\n\n<p>To further support small businesses, the Government of Canada will:</p>\n\n<ul>\n\t<li>Announce a 75 per cent wage subsidy for qualifying businesses, for up to 3 months, retroactive to March 15, 2020. This will help businesses to keep and return workers to the payroll. More details on eligibility criteria will start with the impact of COVID-19 on sales, and will be shared before the end of the month.</li>\n\t<li>Allow businesses, including self-employed individuals, to defer all Goods and Services Tax/Harmonized Sales Tax (GST/HST) payments until June, as well as customs duties owed for imports. This measure is the equivalent of providing up to $30 billion in interest-free loans to Canadian businesses. It will help businesses so they can continue to pay their employees and their bills, and help ease cash-flow challenges across the country.</li>\n\t<li>Launch the new Canada Emergency Business Account. This program will provide up to $25 billion to eligible financial institutions so they can provide interest-free loans to small businesses. These loans – guaranteed and funded by the Government of Canada – will ensure that small businesses have access to the capital they need, at a zero per cent interest rate, so they can pay for rent and other important costs over the next number of months.</li>\n\t<li>Launch the new Small and Medium-sized Enterprise Loan and Guarantee program that will enable up to $40 billion in lending, supported through Export Development Canada and Business Development Bank, for guaranteed loans when small businesses go to their financial institutions to help weather the impacts of COVID-19. This is intended for small and medium-sized companies that require greater help to meet their operational cash flow requirements.</li>\n</ul>\n\n<p>These new investments will help Canada’s financial institutions provide the credit and liquidity options that a range of Canadian businesses need immediately.</p>\n\n<p>The Government of Canada understands that some sectors have been disproportionally impacted by the COVID-19 pandemic. We will continue to carefully monitor all developments, and take further action in the near term. We’re all in this together, and the Government of Canada will continue to work around the clock to ensure all Canadians and small businesses get the support they need to weather this crisis.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Small businesses are the backbone of our economy, and an important source of good jobs across this country. They are facing economic hardship and uncertainty during the COVID-19 pandemic, and that is why we are taking action now to help them get the financial help they need to protect their workers and pay their bills.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The measures that we are taking to protect Canadians and our economy from the impacts of the COVID-19 pandemic remind us that extraordinary times demand extraordinary actions. With the new measures we are announcing today to support businesses, we are showing once again that we will do what we must to ensure that workers and businesses are supported through the outbreak, and that our economy remains strong in the face of adversity.”</p>\n\n<footer class=\"default\">The Hon. Bill Morneau, Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The deferral to June of GST/HST payments, as well as customs duties owing on imports, will generally apply to remittances that become due in March, April, and May. These amounts would normally have been due to the Canada Revenue Agency and the Canada Border Services Agency as early as the end of this month. This measure will take effect immediately, through existing authorities.</li>\n\t<li>The Canada Revenue Agency is introducing a series of administrative measures to remove some of the burden on businesses experiencing financial hardship.</li>\n\t<li>The new Canada Emergency Business Account will provide funding to eligible financial institutions so that they can provide interest-free loans in the form of lines of credit of up to $40,000 to businesses with payrolls of less than $1 million. A quarter of this loan (up to&nbsp;$10,000) is eligible for complete forgiveness.</li>\n\t<li>The new Small and Medium-sized Enterprise Loan and Guarantee program will operate as follows:\n\t<ul>\n\t\t<li>Export Development Canada will provide guarantees to financial institutions so that they can issue new operating credit and cash flow term loans of up to $6.25 million to small and medium-sized businesses. These loans will be 80 per cent guaranteed by Export Development Canada, to be repaid within one year.</li>\n\t\t<li>Small and medium-sized businesses can also get support through a new Co-Lending Program that will bring the Business Development Bank of Canada together with financial institutions to co-lend term loans to these businesses for their operational cash flow requirements. Eligible businesses may obtain incremental credit amounts of up to $6.25 million through the program, which will be risk-shared at 80 per cent between the Business Development Bank of Canada and the financial institutions. Eligible financial institutions will conduct the underwriting and funding directly for customers.&nbsp;</li>\n\t</ul>\n\t</li>\n\t<li>The government has already introduced several measures to support businesses affected by COVID-19:\n\t<ul>\n\t\t<li>Providing eligible small employers a temporary wage subsidy for a period of three months. The subsidy will be equal to 10 per cent of remuneration paid during that period, up to a maximum subsidy of $1,375 per employee and $25,000 per employer. Businesses will be able to benefit immediately from this support by reducing their remittances of income tax withheld on their employees’ remuneration.</li>\n\t\t<li>Extending the maximum duration of the <a href=\"https://www.canada.ca/en/employment-social-development/services/work-sharing/eligibility.html\">Work-Sharing program</a>, from 38 weeks to 76 weeks, for workers who agree to reduce their normal working hours because of developments beyond the control of their employers.</li>\n\t\t<li>Establishing a&nbsp;<a href=\"https://www.canada.ca/en/department-finance/programs/financial-sector-policy/business-credit-availability-program.html\">Business Credit Availability Program</a>, largely targeted to small and medium-sized businesses, through the Business Development Bank of Canada and Export Development Canada. These organizations are working closely with private sector lenders to coordinate on credit solutions for individual businesses, including in sectors such as oil and gas, air transportation, and tourism.</li>\n\t\t<li>Increasing credit available for farmers and the agri-food sector through <a href=\"https://www.fcc-fac.ca/en/covid-19.html\">Farm Credit Canada</a>.</li>\n\t\t<li>Deferring the payment of income taxes. The government is allowing all taxpayers to defer, until after August 31, 2020, the payment of income tax amounts owed on or after March&nbsp;18 and before September 2020. This relief would apply to tax balances due, as well as instalments, under Part I of the&nbsp;<em>Income Tax Act</em>. No interest or penalties will accumulate on these amounts during this period.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"http://www.Canada.ca/en/department-finance/news/2020/03/additional-support-for-canadian-businesses-from-the-economic-impact-of-covid-19.html\">Additional support for Canadian businesses from the economic impact of COVID-19</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/11/prime-minister-outlines-canadas-covid-19-response\">Prime Minister outlines Canada’s COVID-19 response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/canadas-reponse/government-canada-takes-action-covid-19.html\">Government of Canada takes action on COVID-19</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2020/03/canada-outlines-measures-to-support-the-economy-and-the-financial-sector.html\">Canada outlines measures to support the economy and the financial sector</a></li>\n</ul></div>\n      "
}