{
  "path": "/en/news/statements/2021/01/22/weestamakaywin-ouschi-kischee-li-ministr-avek-saenk-laniversayr-ouschi",
  "pageTitle": "Weestamakaywin ouschi Kischee li Ministr avek saenk laniversayr ouschi ka ki pawshkishikayhk didawn La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Kischee li Ministr, Justin Trudeau, anoush kaypakitinam oohiin ikouhk weestamakaywin enn maark ooma saenk laniversayr ouschi ka ki pawshkishikayhk nipastawkaywin didawn La Loche, Saskatchewan.</p>\n\n<p>“Seank aen naw anoush, pa dispree mawyahkamikishiwin didawn ooma a lawntour La Loche, Saskatchewan, nipahawak kaatr aen zhawnd Canada akwa siirieu mayitotakow set kiyawpit nawut. &nbsp;</p>\n\n<p>“Ooma ka tipishkinawkwahk laniversayr, ni weechihwak Saskatchewanians akwa kuhkiyuw Aen zhawnd Canada aen kishkishihk akwa aen salu aykwawniki opimawtishiwin ka wunihtachik. Niyanawn i va oofayr mitouni kichimawkaymowin ishi wiyawow la famee akwa parawn prosh, ishi chipashpeewak, akwa kuhkiyuw ka pimawtishichik avek ooma li pwaen akwa kwawtakistawin ouhchi ooma mawyahkamikishiwin. Niyanawn meena l'onoer li promyee nashkwaystawaywak, Lii Pramyii Nawsyoon a lawntour, akwa li promyee weechihiwaywak aykwawniki soon shoohkitayhewin weechihiwayw aen pashpeenahk pimawtishiwin naytay Dene High L'ikol akwa nakeenam ayiwaak kakwawyakipayiwin.</p>\n\n<p>“Li choer ouschi kuhkiyuw Aen zhawnd Canada ki peekounikawtawy seank aen naw ashpin akwa kiyanawn ki ahkaami awnsawmbl pleu boon ashpin ouhchi. Niki nakishkayn ooma alawntour naytay La Loche akwa niwahpaastayn wiyawow soon mamashkachi shoohkatishiwn, la fors, akwa shoohkitayhewin. Ishi shakaen maambr ouschi ooma a lawntour: namoo wiya nawunikishkishinawn. Li gouvarnimaw ouschi Canada tuhkinay li koorazk kawmayik, ka natouhtak, akwa aen nakinam isti kakwawyakipayiwin ay-ishpayihk keehtwawm.</p>\n\n<p>“Ishi aen kayshchinahoo pat dawnzhee akwa kanawaymowin ouschi kuhkiyuw Aen zhawnd Canada, akwa meena li mood ouschi La Loche, niki weehtamawkaynawn paasii aen naw aen <a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/01/prime-minister-announces-ban-assault-style-firearms\">nakinamahk ayiwaak 1,500 la sort</a>&nbsp;ouschi nootinikaywin-itouwuhk lee feezee akwa ka ay-ischikawtayk. Akwa meena, niyanawn da bor noo kayawsh <a href=\"https://www.canada.ca/en/indigenous-services-canada/news/2020/08/government-of-canada-is-responding-to-immediate-indigenous-mental-wellness-demands-during-the-covid-19-pandemic.html\">$82.5 million</a> aen weechihiwaywin avek Lii Pramyii Nawsyoon a lawntour mawhmayhkouchipayin akwa aen mishawpayin avek lee kor mental la sawntee akwa chimiyoumahchihouhk weechihiwaywin, nawut kwayesh piihtikwaywin akwa aen deelee kaw-ahkikihk dmawdee. Niyanawn ki ahkaami atoushkawtaynawn didawn wiichihiwayin avek Lii Pramyii Nawsyoon, la municipalitii, li territwayr, akwa la provayns di gouvarnimaw aen kayshchinahoo pleu boon li tawn ki vyaen poor Lii Pramyii Nawsyoon yet zhenn. Niyanawn meena ki ahkaami wiichihiwayahk avek a lawntour lout bor Canada, didawn ishi akwawnima li koorazk soon bizwaen. Awnsawmbl, kiyanawn ki pleu boon li koorazk la sawntee akwa aen deelee avek li troob ka ayimiihikoot La Loche akwa kootaka a lawntour.</p>\n\n<p>“Opeekishkweestamakayw ouschi Li gouvarnimaw didawn Canada, aen awnkourazhee kuhkiyuw Aen zhawnd Canada aen kishkishichik anoush oki kitimahakanak akwa paashpiiwak ouschi ooma kakwawyakipayik mawyahkamikishiwin, akwa keestwawm aen weestamakayk niyanawn kaw-itwayahk li koorazk poor li mood ouschi La Loche.”</p></div>\n      "
}