{
  "path": "/en/news/statements/2018/06/20/statement-prime-minister-world-refugee-day",
  "pageTitle": "Statement by the Prime Minister on World Refugee Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on World Refugee Day:</p><p>“On <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/campaigns/world-refugee-day.html\">World Refugee Day</a>, we join the global community to recognize people around the world who have been forced to flee their homes. We honour the resilience and strength of refugees and displaced people, acknowledge the profound hardships they face, and stand with them.</p><p>“Each year, thousands are forced to flee conflict, insecurity, and persecution – and today, over 68 million people around the world are forcibly displaced. But these statistics do not capture the faces and stories behind the numbers.</p><p>“People who have been driven from their homes face immense loss, barriers, and trauma – both old and new. They carry with them memories, dreams, and hope for a better future. We share a moral responsibility to help them find shelter and start their lives anew – and as Canadians, we know first-hand the contributions they make. Over the generations, refugees have helped build the strong, open, and prosperous Canada we know today.</p><p>“Canada will not stand idle while hundreds of thousands of people – including Rohingya refugees – suffer forced displacement and human rights violations. In response to the work of the Honourable Bob Rae, Special Envoy to Myanmar, we will lead on initiatives to promote human rights and improve living conditions of Rohingya refugees and those displaced by the conflict in Myanmar. We will also support efforts to bring perpetrators of gross human rights violations to account. Guided by the Feminist International Assistance Policy, Canada has dedicated $300 million over the next three years to step up its response to this ongoing humanitarian crisis, with a particular emphasis on ensuring that the needs of women and girls are met.</p><p>“Women, girls, and other marginalized groups suffer different and disproportionate effects of conflict and displacement – and their empowerment is key to building lasting peace and prosperity. That is why, at the G7 Summit in Charlevoix earlier this month, Canada and partners announced a <a href=\"/en/news/news-releases/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and\">historic investment</a> of nearly $3.8 billion in education for women and girls in crisis and conflict situations – the largest of its kind ever made. This is about making a real difference in the lives of millions of women and girls, including those growing up in refugee camps. They deserve the chance to learn and get the education they need to reclaim their future and their dreams.</p><p>“Today, I ask Canadians and people around the world to stand with refugees, displaced people, and all those who are forced to leave home behind. How we treat the most vulnerable among us defines who we are – as individuals, as countries, and as a global community. Let’s choose justice over fear and compassion over division – because to see ourselves in each other, all we have to do is look.”</p></div>\n      "
}