{
  "path": "/en/news/news-releases/2022/04/12/supporting-small-businesses-and-creating-good-jobs",
  "pageTitle": "Supporting small businesses and creating good jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Small and medium-sized businesses are the backbone of the Canadian economy and the heart of our communities. That’s why the Government of Canada is proposing new measures in Budget&nbsp;2022 to support small and medium-sized businesses so they can grow, innovate, and stay competitive, while creating good, middle class jobs.</p>\n\n<p>The Prime Minister, Justin Trudeau, today highlighted key measures included in <em>Budget&nbsp;2022: A Plan to Grow Our Economy and Make Life More Affordable </em>to help small and medium-sized businesses.</p>\n\n<p>The measures proposed in Budget&nbsp;2022 include:</p>\n\n<ul>\n\t<li><strong>Cutting taxes for Canada’s growing small businesses</strong> by ensuring growing businesses can take advantage of Canada’s low small business tax rate until their taxable capital reaches $50&nbsp;million, rather than $15&nbsp;million. This will encourage small businesses to continue growing and creating jobs.</li>\n\t<li><strong>Growing Canada’s health-focused small and medium-sized businesses</strong> by investing $30&nbsp;million to expand the Coordinated Accessible National Health Network to Quebec, the territories, and Indigenous communities to help health technology businesses grow, create good middle class jobs, and deliver better care to Canadians.</li>\n\t<li><strong>Increasing access to Canada’s trade remedy system</strong> by providing $4.7&nbsp;million over five years and $1.1&nbsp;million ongoing to create a Trade Remedy Counselling Unit within the Canada Border Services Agency to help companies understand and access Canada’s trade remedy system, with a focus on small and medium-sized enterprises.</li>\n\t<li><strong>Encouraging employee ownership of a business </strong>by creating the Employee Ownership Trust under the <em>Income Tax Act</em> to facilitate the transition of privately owned businesses to employees.</li>\n\t<li><strong>Supporting recovery and growth for businesses </strong>by making smart investments to minimize the impacts of changes in global trade and other disruptions on sectors including transport, agriculture, and tourism and help them increase economic activity.</li>\n\t<li><strong>Continuing consultations to reduce credit card transaction fees</strong> in a way that benefits small businesses and protects existing reward points for consumers.</li>\n</ul>\n\n<p>Budget&nbsp;2022 is proposing strategic investments and measures to ensure that small and medium-sized businesses continue to drive economic growth, create good middle-class jobs, and lead global production and innovation – now and for decades to&nbsp;come.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“When we support our small businesses, we support our workers, our communities, and our economy. With measures in Budget 2022, we strive to ensure that small businesses in Canada can continue to grow, create jobs, compete and win in the changing global economy.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Our small businesses are at the heart of our communities, and supporting them is one of the most important things we can do to build a thriving economy. Budget&nbsp;2022 will make it easier for them to innovate and grow, and will help ensure they can continue to create more of the good-paying jobs that so many Canadians count on.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Small businesses currently benefit from a reduced federal tax rate of nine per cent on their first $500,000 of taxable income, compared to a general federal corporate tax rate of 15 per cent. A business no longer has access to this lower rate once its level of capital employed in Canada reaches $15&nbsp;million.</li>\n\t<li>Budget&nbsp;2022 proposes to provide $603.2&nbsp;million over five years to Transport Canada to make supply chains more efficient, help ease the movement of goods across Canada, and cut needless regulatory red tape.</li>\n\t<li>Budget&nbsp;2022 proposes to establish the Canada Growth Fund to help businesses reduce emissions and achieve Canada’s climate goals; diversify investment in the growth of low-carbon industries and technologies; and help restructure supply chains in key industries such as the natural resources sector.</li>\n\t<li>Budget&nbsp;2022 announces a $1&nbsp;billion investment for the creation of an independent federal innovation and investment agency that will help Canadian industries and businesses innovate, grow, create jobs, and be competitive in a changing global economy.</li>\n\t<li>These investments build on the many actions the Government of Canada has taken to support small businesses and grow the economy including:\n\t<ul>\n\t\t<li>Enhancing the Canada Small Business Financing Program, increasing annual financing to small businesses by an estimated $560&nbsp;million;</li>\n\t\t<li>Helping small and medium-sized businesses to invest in new technologies and capital projects by allowing for the immediate expensing of up to $1.5&nbsp;million of eligible investments beginning in 2021;</li>\n\t\t<li>Helping small businesses grow and compete in the digital economy by launching the $4&nbsp;billion Canada Digital Adoption Program to help grow their business online and boost their existing business technology;</li>\n\t\t<li>Investing in women entrepreneurs and small businesses through over $6&nbsp;billion into the Women Entrepreneurship Strategy, unlocking access to financing, resources, and developing a supportive ecosystem they need to succeed; and</li>\n\t\t<li>Supporting Black entrepreneurs and business owners by investing $265&nbsp;million into the Black Entrepreneurship Program.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/a-strong-growing-and-resilient-economy.html\">Budget&nbsp;2022 Backgrounder: A Strong, Growing, and Resilient Economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/creating-good-middle-class-jobs.html\">Budget&nbsp;2022 Backgrounder: Creating Good Middle Class Jobs</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-finance/news/2022/04/tax-fairness.html\">Budget&nbsp;2022 Backgrounder: Tax Fairness</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://budget.gc.ca/2022/home-accueil-en.html\">Budget&nbsp;2022</a></li>\n\t<li><a href=\"https://canhealthnetwork.ca/\">Coordinated Accessible National Health Network</a></li>\n</ul></div>\n      "
}