{
  "path": "/en/news/statements/2020/02/01/statement-prime-minister-black-history-month",
  "pageTitle": "Statement by the Prime Minister on Black History Month | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Black History Month:</p>\n\n<p>“Today, we celebrate the start of <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month.html\">Black History Month</a> and honour the legacy of Black Canadians. This year’s theme – Canadians of African descent: Going forward, guided by the past – reminds us of the need to reflect on our history to build a successful future.</p>\n\n<p>“This is a time to learn more about the important role that people of African descent have played in our history. Time and again, Black Canadians have demonstrated courage, resilience, and leadership when faced with adversity.</p>\n\n<p>“William Hall was the first Canadian sailor and Black person to receive the Victoria Cross. While serving on the HMS <em>Shannon</em>, he volunteered with a relief force sent to protect a British garrison. The garrison was besieged and, by the end of the attack, he was the last sailor standing. In a remarkable act of bravery, he continued to fight alone, until the garrison was safe.</p>\n\n<p>“Mary Ann Shadd Cary was an educator, publisher, and abolitionist. She established a racially integrated school for Black refugees in Windsor, and was the first Black female publisher in North America, co-founding <em>The Provincial Freeman</em> weekly newspaper in the 1850s.</p>\n\n<p>“Devon Clunis, who moved to Canada from Jamaica when he was 12 years old, joined the Winnipeg Police Service in 1987. After 25 years of service, he was sworn in as the Chief of Police, becoming the first Black Canadian to hold the position.</p>\n\n<p>“While these Canadians helped build the more diverse and inclusive society we enjoy today, too many people continue to face systemic racism and discrimination. As a government, we are committed to standing up for human rights and fighting racism in all its forms, here at home and around the world.</p>\n\n<p>“To mark the <a href=\"https://www.un.org/en/events/africandescentdecade/\">United Nations International Decade for People of African Descent</a>, we also <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy/international-decade-african-descent.html\">committed to projects</a> that celebrate, share knowledge, and build capacity in Black Canadian communities. By listening to communities, activists, and advocates, we can combat anti-Black racism and help give every Canadian an opportunity to thrive. &nbsp;</p>\n\n<p>“This month, let us celebrate the contributions of Black Canadians, and learn more about their past and present experiences.” &nbsp;</p></div>\n      "
}