{
  "path": "/en/news/readouts/2021/09/29/prime-minister-justin-trudeau-speaks-alberta-premier-jason-kenney",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Alberta Premier Jason Kenney | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Alberta Premier Jason Kenney to discuss the COVID-19 pandemic and the rising number of cases in Alberta.</p>\n\n<p>The Prime Minister emphasized that the Government of Canada remains ready to respond to any requests from the Government of Alberta, including supplying doses of the Janssen vaccine (Johnson and Johnson), in addition to the seven million doses of mRNA vaccines already delivered, as well as rapid tests and resources from the Canadian Armed Forces and the Canadian Red Cross. The two leaders also spoke of the importance of continuing to increase vaccination rates throughout the province. The Prime Minister reiterated his commitment to have people’s backs in Alberta and to do whatever it takes until we end this pandemic.</p>\n\n<p>The Prime Minister and Premier discussed early learning and child care and major industrial projects. They highlighted the significance of the completion of the Enbridge Line 3 replacement pipeline as well as the importance of the Line 5 pipeline for Alberta and Canada’s energy security.</p>\n\n<p>The Prime Minister and Premier re-committed to working together and to remain in touch.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Canada’s vaccine supply</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/campaigns/covid-19-military-response.html\">Military response to COVID-19</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/21/10-day-child-care-canadian-families\">$10 a day child care for Canadian families</a></li>\n\t<li><a href=\"https://www.nrcan.gc.ca/our-natural-resources/energy-sources-distribution/clean-fossil-fuels/pipelines/energy-pipeline-projects/line-3-replacement-project/19188\">Line 3 Replacement Project</a></li>\n\t<li><a href=\"https://www.ourcommons.ca/DocumentViewer/en/43-2/CAAM/report-1\">Enbridge’s Line 5: An Interim Report</a></li>\n</ul></div>\n      "
}