{
  "path": "/en/news/news-releases/2016/02/10/prime-minister-meet-indigenous-leaders-and-host-first-ministers",
  "pageTitle": "Prime Minister to meet with Indigenous leaders and host First Ministers’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he and the Premiers will meet with First Nations, Inuit, and Metis leaders on March 2, 2016. The Prime Minister will then host a First Ministers’ Meeting (FMM) with Premiers on March 3, 2016. Both meetings will take place in Vancouver, British Columbia.</p>\n<p>Climate change is an issue of great concern for all Canadians and the Government of Canada is committed to working together with our partners to address it. The meeting between the Prime Minister, the Premiers, and Indigenous leaders is part of the follow up to the commitments made on climate change last year in Paris. The discussion will focus on the opportunity for Canada to become a leader in the global clean growth economy, and to responsibly deliver on our climate commitments while delivering real benefits for Canadians.</p>\n<p>Building off the discussions with Indigenous leaders, the First Ministers’ Meeting will focus on developing a pan-Canadian framework to grow our economy while also reducing emissions. The clean growth framework will be science-based and will build on actions the provinces and territories have already taken, so that Canada can meet – or exceed – its climate commitments.</p>\n<p>The meeting will focus on effective ways to adapt to climate change, reduce greenhouse gas emissions, and capitalize on the opportunities presented by a low-carbon economy to create good-paying and long-term jobs.&nbsp;</p>\n<p>The First Ministers will consider all policy measures at their disposal to make sure Canada can take advantage of the significant appetite for expertise in the clean growth economy. The government is committed to working together with the provinces, territories, and Indigenous leaders to ensure a sustainable future for all Canadians, our children, and our grandchildren.</p>\n<p><strong>Quotes</strong></p>\n<p>“I look forward to working with the Premiers on combatting climate change and moving toward a greener, more sustainable Canadian economy better positioned to compete globally in the areas of clean knowledge and technologies.”<br>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;</em></p>\n<p>“Canada’s Indigenous peoples have a sacred relationship with the Earth. Their unique perspective will help guide us in developing policies that ensure our land, air and water are protected for future generations.”<br>–<em> Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>The Prime Minister will also deliver the keynote speech at the Globe Conference 2016 in Vancouver, at 9:00 am PT, on March 2<sup>nd</sup>.</li>\n</ul>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.climatechange.gc.ca/default.asp?lang=En&amp;n=E18C8F2D-1\">Canada’s Action on Climate Change</a></li>\n<li><a href=\"http://canadaspremiers.ca/en/\">Canada’s Premiers</a></li>\n</ul></div>\n      "
}