{
  "path": "/en/news/news-releases/2016/10/20/governor-general-canada-visit-middle-east",
  "pageTitle": "Governor General of Canada to visit the Middle East | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Excellency the Right Honourable David Johnston, Governor General of Canada, will travel to the Middle East – visiting Jordan, Israel and the West Bank – from October 29 to November 6, 2016.</p><p>The visit will focus on security, refugee resettlement, and development issues – as well as promoting stronger innovation and education ties with the region.</p><p>In Jordan, the Governor General will visit a refugee camp and the Queen Rania Teacher Academy.</p><p>In Israel, he and Mrs. Johnston will visit Technion University to discuss student diversity. The Governor General will receive an honorary doctorate for his contribution to the Canada-Israel innovation relationship. His Excellency will also participate in a panel discussion on sustainability and environmental innovation at Bethlehem University, in the West Bank.</p><h2>Quote</h2><blockquote><p>“Canada is committed to deeper engagement in the Middle East. Canada’s policy in the region reflects what Canada is all about: defending our interests alongside our allies, working constructively with partners to build long-term peace and stability, and working to alleviate the suffering of those forced to flee their homes – including through resettlement.”<br>- <cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This will be the first time a Canadian Governor General conducts State visits to Jordan and Israel and a visit to the West Bank. The Governor General will be accompanied by a delegation of parliamentarians and civil society leaders.</li><li>During his time in the Middle East, the Governor General will meet with a number of political leaders including: His Majesty King Abdullah II ibn Al Hussein of the Hashemite Kingdom of Jordan, as well as Jordan’s Prime Minister H. E. Dr. Hani al-Mulki; Israel’s President Reuven Rivlin and Prime Minister Benjamin Netanyahu; and Palestinian Authority President Mahmoud Abbas. He will also meet with researchers, innovators, and education partners to explore how to deepen Canada’s ties within the Middle East.</li><li>Jordan is a valued partner for Canada in the Middle East given its peaceful vision for the region, strong bilateral trade links, and close collaboration on refugees.</li><li>Canada values its steadfast relationship with Israel. Relations between the two countries are multifaceted and have been enhanced in recent years through increased cooperation in several areas, including trade, investment and innovation.</li><li>Canada remains committed to working with the Palestinian Authority, with whom we have a strong relationship.</li><li>A two-state solution to the Israeli-Palestinian conflict remains the only viable option to a comprehensive, just and lasting peace.</li></ul></div>\n      "
}