{
  "path": "/en/news/statements/2018/07/06/statement-prime-minister-fifth-anniversary-lac-megantic-tragedy",
  "pageTitle": "Statement by the Prime Minister on the fifth anniversary of the Lac-Mégantic tragedy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the fifth anniversary of the Lac‑Mégantic tragedy:</p><p>“Five years ago, a terrible tragedy took place in Lac-Mégantic. During the night, a runaway train carrying a shipment of crude oil derailed and caught fire in the heart of the community. The explosion that followed destroyed close to half of the downtown area and took the lives of 47&nbsp;people, in the deadliest rail disaster in our country’s modern history.</p><p>“Today, we remember the victims, and our thoughts go out to all those whose lives were forever changed. The tragedy left scars that cannot be erased – but in the weeks, months, and years that followed, Lac‑Mégantic became a symbol of hope, determination, and solidarity. Today, the people of Lac‑Mégantic continue to show resilience and courage as they rebuild their community.</p><p>“This spring, the Government of Canada and the Government of Quebec agreed to jointly fund a 12.8&nbsp;kilometre <a href=\"/en/news/news-releases/2018/05/11/new-rail-bypass-support-recovery-and-reconstruction-lac-mégantic\">rail bypass line</a> to respond to this unique tragedy. The project will support recovery and reconstruction efforts, and help heal the wounds of a community that has been through so much. We hope that by permanently removing the rail line from Lac-Mégantic’s downtown, we can create more peace of mind and support the healing process, as well as strengthen the community’s economy.</p><p>“Rail safety and the safe transportation of dangerous goods in Canada remain top priorities for the Government of Canada, and we will continue to take steps to prevent another tragedy like this from ever happening again.</p><p>“To the people of Lac‑Mégantic, please know that you are in our thoughts. For five years, you have stood shoulder to shoulder and carried the immense weight of your loss. Today, we offer you our full support as you continue to rebuild your town, your community, and your future.”</p></div>\n      "
}