{
  "path": "/en/news/statements/2023/01/08/statement-prime-minister-national-day-remembrance-victims-air-disasters",
  "pageTitle": "Statement by the Prime Minister on the National Day of Remembrance for Victims of Air Disasters | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the National Day of Remembrance for Victims of Air Disasters:</p>\n\n<p>“Air disasters have claimed the lives of far too many Canadians. Today, on the third National Day of Remembrance for Victims of Air Disasters, I join people across Canada and Canadians around the world to honour the people we have lost to these tragedies and mourn alongside those they left behind.</p>\n\n<p>“On this solemn occasion, we remember the victims of all air disasters, including Air Ontario Flight 1363, Ethiopian Airlines Flight&nbsp;302 (Flight ET302), Air India Flight&nbsp;182, and Ukraine International Airlines Flight&nbsp;752 (Flight&nbsp;PS752).</p>\n\n<p>“Canada is a world leader in safety and security in civil aviation. The Government of Canada is working to ensure the safety and security of air travel worldwide by collaborating with partners to prevent further tragic losses of life. With our international partners, we are taking <a href=\"https://www.canada.ca/en/global-affairs/news/2022/12/joint-statement-from-the-international-coordination-and-response-group-for-the-victims-of-flight-ps752-on-arbitration.html\">concrete action</a> to ensure Iran is held accountable for its egregious and unlawful downing of Flight PS752. Canada is also demonstrating strong leadership on the <a href=\"https://tc.canada.ca/en/initiatives/safer-skies-initiative\">Safer Skies Initiative</a>, alongside international partners, to ensure the safety of civilian aircraft travelling in or near conflict zones. We continue to advocate for the International Civil Aviation Organization to review its aircraft accident investigation framework, to enhance the transparency and credibility of investigations.</p>\n\n<p>“We continue to support the families and loved ones of the victims of tragic air disasters. In summer 2022, the government launched <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/notices/pathway-pr-families-victims-air-disasters-outside-canada.html\">a pathway to permanent residence</a> for family members of victims of Flight ET302 and Flight PS752 who are outside Canada and who have close ties to surviving family members in Canada. We are working to provide 176 scholarships, averaging $25,000 each, in memory of the victims of Flight PS752. Canada has also established the <a href=\"https://tc.canada.ca/en/programs/commemoration-fund-victims-ethiopian-airlines-flight-302-tragedy\">Commemoration Fund for the Victims of the Ethiopian Airlines Flight 302 Tragedy</a>, which includes scholarships and support for commemorative projects that pay tribute to the victims.</p>\n\n<p>“As we honour the victims of air disasters, we stand with families, friends, and all those who have lost loved ones to these tragedies. We will always remember them.”</p></div>\n      "
}