{
  "path": "/en/news/readouts/2021/02/23/prime-minister-justin-trudeau-speaks-prime-minister-australia-scott",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Australia Scott Morrison | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the Prime Minister of Australia, Scott Morrison.</p>\n\n<p>The two leaders discussed ongoing efforts in Canada and in Australia to fight the global COVID-19 pandemic, save lives, and support people and communities through the crisis. They underlined the vital role of safe and effective vaccines to protect people around the world and noted the importance of safeguarding supply chains. The prime ministers reaffirmed their shared commitment to support vulnerable countries in responding to the pandemic.</p>\n\n<p>Prime Minister Trudeau noted his strong condemnation of the coup in Myanmar. In discussing the situation, the two leaders emphasized the importance of a swift return to the democratic process and an end to violence against protesters. They agreed that Canada and Australia should continue to work closely together in the Indo-Pacific region.</p>\n\n<p>The prime ministers noted the growing cooperation between Canada and Australia on the regulation of online platforms. They agreed to continue coordinating efforts to address online harm and ensure the revenues of web giants are shared more fairly with creators and media.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Morrison committed to continue working closely together, bilaterally and in the G7, G20, and other forums, to strengthen global trade, uphold human rights, and reinforce international rules.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/australia-australie/bilateral_relations_bilaterales/canada_australia-australie.aspx?lang=eng\">Canada–Australia Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/02/canada-imposes-sanctions-on-myanmar-military-officials-in-response-to-coup-detat.html\">Canada imposes sanctions on Myanmar military officials in response to coup d’état</a></li>\n</ul></div>\n      "
}