{
  "path": "/en/news/readouts/2021/02/18/prime-minister-justin-trudeau-holds-27th-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 27th call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the 27th call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic. They were joined by the Chief Public Health Officer of Canada, Dr. Theresa Tam.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 situation. They recognized the toll the pandemic has taken on Canadians. The Prime Minister provided an update on the vaccine rollout, highlighting that Canada is approaching a significant increase in the delivery of vaccines. He reiterated that Canada will receive 2 million doses of the Moderna vaccine and 4 million doses of the Pfizer vaccine by the end of March. He emphasized once again that by September, all Canadians who want to receive a vaccine will be able to. Minister LeBlanc provided an update on the work federal, provincial, and territorial governments are undertaking to build up Canada’s domestic biomanufacturing capacity.</p>\n\n<p>First Ministers discussed the continued monitoring of the newly identified variants of the virus and Dr. Tam updated premiers on the latest modelling data. Building off this presentation, the Prime Minister spoke about the critical importance that public health measures will play in the coming weeks to prevent a third wave of the virus. He stressed the importance of wide-scale rapid testing, contact tracing, quickly identifying and isolating new variant cases, and ensuring an effective rollout of vaccines. He also spoke about the need to work with the private sector and third parties like pharmacies to roll out rapid testing. The Prime Minister reiterated the government’s commitment to support provinces and territories as they undertake these measures.</p>\n\n<p>All First Ministers firmly reiterated their commitment to a collaborative approach to fighting COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines and treatments for COVID-19: Vaccine rollout</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/02/02/new-support-produce-covid-19-vaccines-and-treatments-canada\">New support to produce COVID-19 vaccines and treatments in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/02/government-of-canada-invests-53-million-to-address-covid-19-virus-variants-of-concern.html\">Government of Canada invests $53 million to address COVID-19 virus variants of concern</a></li>\n\t<li><a href=\"https://www.canada.ca/en/health-canada/news/2021/01/covid-19-expert-panel-provides-science-based-advice-on-optimizing-testing-and-screening-in-canada.html\">COVID-19 Expert Panel provides science-based advice on optimizing testing and screening in Canada</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/epidemiological-economic-research-data/mathematical-modelling.html\">Mathematical modelling and COVID-19</a></li>\n</ul></div>\n      "
}