{
  "path": "/en/news/news-releases/2019/05/16/prime-minister-concludes-successful-visit-france",
  "pageTitle": "Prime Minister concludes successful visit to France | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to France, where he endorsed the Christchurch Call to Action and shared Canada’s vision for restoring trust in the digital world.</p>\n\n<p>On May 15, Prime Minister Trudeau joined other government leaders and tech industry representatives in endorsing the Christchurch Call to Action to eliminate terrorist and violent extremist content online. The Christchurch Call recognizes the need for enhanced cooperation among a wide range of actors, including governments, civil society, and online service providers.</p>\n\n<p>On May 16, Prime Minister Trudeau delivered a keynote address at VivaTech, where he emphasized the importance of protecting privacy and countering online hate speech and disinformation. The Prime Minister also announced that Canada would be launching a Digital Charter, to guide the creation of a new, transparent, and accountable digital policy.</p>\n\n<p>Following his address, the Prime Minister also met with Canadian businesses and start-ups at the conference, and underlined the role they can play in combatting toxic rhetoric and ideologies online.</p>\n\n<p>After leaving VivaTech, Prime Minister Trudeau met with the President of France, Emmanuel Macron, to discuss France’s G7 Presidency priorities, including promoting a human-centric approach to AI grounded in human rights, transparency, and openness. They also discussed ways to continue important work to combat terrorist and extremist content online. The Prime Minister also offered to provide Canadian steel and lumber to support restoration efforts for Paris’s Notre Dame Cathedral.</p>\n\n<p>During the visit, the Prime Minister also held bilateral meetings with French President Emmanuel Macron, New Zealand Prime Minister Jacinda Ardern, His Majesty King Abdullah II of Jordan, Prime Minister Erna Solberg of the Kingdom of Norway, as well as the founder of Wikimedia Foundation, Jimmy Wales.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“We are living in an exciting, constantly evolving digital world. Governments, tech companies, and people around the world all have a role to play in shaping the new digital landscape. Our new Digital Charter will outline what Canadians can expect from our government as it relates to digital technologies, and will help make sure restoring trust and maintaining accountability is at the heart of our policy-making.”<br>\n— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<blockquote>\n<p><br>\n&nbsp;“We need a coordinated, global approach to eradicate terrorist and violent extremist content online, and to make sure what happened in Christchurch never happens again. The Christchurch Call to Action is an important, foundational step that outlines what we as a global community – governments and online service providers – must do to get this right.”<br>\n— The Rt. Hon. Justin Trudeau, Prime Minister of Canada</p>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li class=\"s3\">Canada is taking concrete action to restore trust in the digital space by:\n\t<ul>\n\t\t<li class=\"s3\">Working with allies and platforms through the Global Internet Forum to Counter Terrorism to identify and take down terrorist content online;</li>\n\t\t<li class=\"s3\">Creating the Canada Centre for Community Engagement and Prevention of Violence, which leads the Government of Canada's efforts to counter radicalization to violence;</li>\n\t\t<li class=\"s3\">Stepping up our investigations into extremists and&nbsp;hate groups, including white supremacist and neo-Nazi groups;</li>\n\t\t<li class=\"s3\">Launching citizen resilience and digital literacy initiatives so that people can learn to identify, and resist, disinformation campaigns;</li>\n\t\t<li class=\"s3\">Launching a review of the Broadcasting and Telecommunications Acts to ensure that they reflect the digital era we live in, both in terms of opportunities and risks;</li>\n\t\t<li class=\"s3\">Launching the&nbsp;<a href=\"https://www.publicsafety.gc.ca/cnt/rsrcs/pblctns/ntnl-strtg-cntrng-rdclztn-vlnc/index-en.aspx\">National Strategy on Countering Radicalization to Violence</a>, which outlines Canada’s approach and priorities to prevent the kind of radicalization that leads to violence to begin with;</li>\n\t\t<li class=\"s3\">Creating a new task force, which brings together our top intelligence and policing agencies to prevent foreign interference and tasking our national police force with investigating and prosecuting those who try to subvert Canadian democracy;</li>\n\t\t<li class=\"s3\">Passing laws that prohibit online platforms from knowingly selling election advertising to foreign entities and requiring that platforms maintain a registry of the advertising run during an election;</li>\n\t\t<li class=\"s3\">Proposing, through Budget 2019, to provide $45 million over three years to support a new Anti-Racism Strategy which will identify ways to counter racism in its various forms, with a strong focus on community-based projects.</li>\n\t</ul>\n\t</li>\n\t<li class=\"s3\">As a permanent member of the United Nations Security Council, NATO, the G7 and the G20, and as a founding country of the European Union and a major partner in the Francophonie, France is an important ally for Canada on the international stage.</li>\n\t<li class=\"s3\">The Prime Minister also met with Irish Taoiseach Leo Varadkar and with the CEO of Twitter, Jack Dorsey.</li>\n\t<li class=\"s3\">Viva Technology, or “VivaTech”, is a three-day event bringing together the world’s leaders in technology and business with the most promising startups and the disruptors of tomorrow to explore transformational ideas on a global scale. Since its inception in 2016, VivaTech has welcomed more than 100,000 attendees – among them 9,000 of the most innovative startups in the world.</li>\n</ul>\n\n<h2><strong>Associated Links</strong></h2>\n\n<ul>\n\t<li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France relations</a></li>\n\t<li><a href=\"https://www.elysee.fr/en/g7\">G7</a></li>\n\t<li><a href=\"https://www.christchurchcall.com/call.html\">Christchurch Call to Action</a></li>\n\t<li><a href=\"https://pm.gc.ca/eng/news/2019/05/08/prime-minister-attend-christchurch-call-meeting-eliminating-terrorist-and-violent\">Prime Minister to attend the Christchurch Call meeting on eliminating terrorist and violent extremist content online</a></li>\n</ul></div>\n      "
}