{
  "path": "/en/news/statements/2016/09/23/joint-statement-between-canada-and-peoples-republic-china",
  "pageTitle": "Joint Statement Between Canada and the People's Republic of China | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>At the invitation of the Right Honourable Justin Trudeau, Prime Minister of Canada, His Excellency Li Keqiang, Premier of the State Council of the People's Republic of China is paying an official visit to Canada from September 21 to 24, 2016, with a view to further building a strong and stable foundation for the Canada-China relationship. While in Ottawa, Premier Li Keqiang met with His Excellency, the Right Honourable David Johnston, Governor General of Canada, held talks with Prime Minister Justin Trudeau, inaugurating the Annual Dialogue between the Premier of China and the Prime Minister of Canada, and had meetings with the Honourable George Furey, Speaker of the Senate and the Honourable Geoff Regan, Speaker of the House of Commons. Premier Li Keqiang and Prime Minister Justin Trudeau also attended the 6<sup>th</sup> Canada-China Economic and Trade Cooperation Forum in Montreal.</p>\n<p>Both sides spoke highly of the recent official visit to China by Prime Minister Justin Trudeau, and agreed to take further actions to open a new chapter in the Canada-China strategic partnership. The two sides believed that the back-to-back visits by the two Leaders demonstrate a renewed commitment for a growing relationship. Recalling their conversations in Beijing, Premier Li and Prime Minister Trudeau reflected on the important development of Canada-China relations during the past 46 years since the establishment of diplomatic ties, and agreed to strengthen engagement between Canada and China in order to foster greater economic and social benefits for both countries and to promote peace, stability and prosperity across the Asia-Pacific region and the world at large.</p>\n<p>Both sides agreed the Leaders of the two countries should keep in close contact through bilateral visits, meetings on multilateral occasions, and telephone conversations as well as correspondence, to strengthen communication on important issues of mutual interest. Both sides agreed to make full use of existing high-level dialogues and consultation mechanisms, and recognized the importance of regular, respectful and frank discussions on both opportunities and challenges as part of a robust and comprehensive bilateral relationship. Frequent dialogue not only promotes new areas for growth and deepened cooperation, but creates new avenues to promote common understanding on issues such as human rights and rule of law.</p>\n<p>Both sides agreed to take vigorous measures to expand trade by committing to creating a fair, transparent and welcoming business environment. They also agreed to promote practical cooperation in the areas of agriculture, energy, manufacturing, financial services and infrastructure. The two countries stressed the importance of two-way investment as a means of growth and job creation, while committing to encourage innovation, science and technology collaboration of mutual benefit.</p>\n<p>Both sides agreed to strengthen exchanges and cooperation on judicial affairs and law enforcement, as well as explore options for further engagement on counter-terrorism, cyber security and cybercrime. Both sides also agreed to strengthen military-to-military interactions and explore ways to conduct more joint exercises and training.</p>\n<p>In recognizing the importance of connecting citizens from the two countries, both sides agreed to expand people-to-people ties and deepen cooperation in the areas of culture, education and tourism. In anticipation of Canada’s 150<sup>th</sup> anniversary, both sides will celebrate their shared history, encourage greater exchanges between peoples, and expand cultural and sports cooperation. Both sides committed to raise the number of mutual visits and promote two-way student exchanges, for the purpose of which the two sides will further streamline visa application processing.</p>\n<p>As both countries committed during the G20 Leaders’ Summit in Hangzhou, both sides are determined to foster an innovative, invigorated, interconnected and inclusive world economy. Both sides also reaffirmed their commitment to usher in a new era of global growth and sustainable development.</p>\n<p>Both sides agreed that it is in their common interest to expand cooperation on regional and global issues. On this, both sides decided to expand communication and cooperation in multilateral bodies such as the United Nations, Asia Pacific Economic Cooperation, ASEAN Regional Forum and others. They reaffirmed their continued commitment to address climate change, support UN peacekeeping, and to find new means to cooperate on international development, global health and the empowerment of women and children. The Chinese side welcomes Canada’s application for joining the Asian Infrastructure Investment Bank (AIIB), and looks forward to close cooperation with Canada in the AIIB.</p>\n<p>During the visit, the two sides announced a series of important developments and signed relevant agreements. These include the following: &nbsp;</p>\n<p>1. In solidifying the new chapter in the strategic partnership, both sides welcomed the successful inaugural meeting of the Annual Dialogue between the Prime Minister of Canada and the Premier of China.</p>\n<p>2. Reaffirming Leaders’ commitment to launch the Canada-China Economic and Financial Strategic Dialogue which is at a Vice Premier level, at an early date.</p>\n<p>3. Announcing the goal of doubling bilateral trade by 2025 based on 2015 statistics.</p>\n<p>4. In acknowledgement of the interconnected nature of the two economies and the untapped potential of the Canada-China economic and commercial relationship, the two sides agreed to launch exploratory discussions for a possible Canada-China Free Trade Agreement.</p>\n<p>5. Signing the Joint Statement between the Government of Canada and the Government of China to Develop Cooperation in Third-Party Markets, in order to encourage and support enterprises of both countries to pursue economic development opportunities in third party markets.</p>\n<p>6. Signing the Memorandum of Understanding between the Department of Foreign Affairs, Trade and Development Canada and Statistics Canada and the Ministry of Commerce of China on the Establishment of a Joint Working Group on Trade Statistics Reconciliation.</p>\n<p>7. Recognizing the importance of efficient capital markets and a strong and stable financial system for growing the economy, both sides welcome cooperation as appropriate to develop direct trading between the Renminbi and the Canadian dollar on the China Foreign Exchange Trade System in Shanghai, as well as relevant Canadian financial institutions to issue Renminbi bonds in China's inter-bank bond market.</p>\n<p>8. Announcing the goal of doubling two-way visits by 2025 based on 2015 statistics.</p>\n<p>9. Signing the Memorandum of Understanding between the Department of Innovation, Science and Economic Development of Canada and the National Tourism Administration of China in the Field of Tourism.</p>\n<p>10. Signing the Action Plan between the Department of Agriculture and Agri-Food Canada and the Ministry of Agriculture of China (2016-2020) for Agricultural Cooperation.</p>\n<p>11. Signing the Memorandum of Understanding on Cooperation between the Canadian Grain Commission and the State Administration of Grain of China.</p>\n<p>12. Signed a Memorandum of Understanding on trade in canola between Canada and China.</p>\n<p>13. Recognizing the mutual importance of agriculture and the necessary safeguards for plant and animal health, as well as food safety, the two countries have agreed to expand market access to Canadian bone-in beef and to advance several key initiatives to support the trade of Canadian beef and pork, bovine genetics, Chinese pears and filled grain products.</p>\n<p>14. Signing the Memorandum of Understanding between the Department of Health of Canada on Cooperation and the General Administration of Quality Supervision, Inspection and Quarantine of China in the Field of Consumer Product Safety.</p>\n<p>15. Signing the Bilateral Aviation Technical Arrangement between the Department of Transport Canada and the Civil Aviation Administration of China.</p>\n<p>16. Agreeing to further enhance our bilateral air transport relationship through recent negotiations, which expanded the Canada-China air transport agreement. Both sides also agreed to meet again in 2017 to discuss a further expansion of air transport rights.</p>\n<p>17. In preparation for the Beijing 2022 Olympic and Paralympic Winter Games and as an opportunity to strengthen cultural and people-to-people ties, agreeing to enhance cooperation in the area of winter sports.</p>\n<p>18. Reaffirming our commitment to enhancing efforts to address climate change through the full and effective implementation of the historic Paris Agreement and to work together with international partners to strengthen the global response to climate change，and to achieve successful outcomes in related multilateral fora this year.</p>\n<p>19. Signing the Memorandum of Understanding between the Department of Foreign Affairs, Trade and Development Canada and the Ministry of Education of China concerning Education Cooperation and welcoming the renewal of the Canada-China Scholars' Exchange Program.</p>\n<p>20. Welcoming Canada being named the Country of Honour at the 2017 China Education Expo, as well as the expansion of the Canada Learning Initiative in China Program, a partnership to help Canadian students to gain experience in China as part of their degree program.</p>\n<p>21. Agreeing to establish the Canada-China Innovation Dialogue under the Agreement for Scientific and Technological Cooperation.</p>\n<p>22. Signing the Agreement between the Government of Canada and the Government of China on Sharing and Return of Forfeited Assets.</p>\n<p>23. Signing the Memorandum of Understanding on Cooperation in Combating Crime between the Royal Canadian Mounted Police and the Ministry of Public Security of China.</p>\n<p>24. In recognition of health as an important area of the bilateral relationship, the two sides committed to holding the 5<sup>th</sup> Ministerial dialogue on health within the next year and renewing the Plan of Action on Cooperation for the period of 2017-2019.</p>\n<p>25. Agreeing to reinforce exchange and cooperation in the field of ocean science, including the prevention and control of marine oil spills.</p>\n<p>26. Signing the Cooperation Agreement between the Canada Border Services Agency and the General Administration of Customs of China.</p>\n<p>27. Welcoming the Entry into Force of the Canada-China Social Security Agreement early next year.</p>\n<p>28. Agreeing to support the pursuit of a dialogue to expand exchanges between provinces and territories of both countries.</p>\n<p>29. Agreeing to actively support relevant institutions of both countries to launch track II dialogues, including on energy and foreign policy, at an early date.</p></div>\n      "
}