{
  "path": "/en/news/readouts/2020/10/15/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the twentieth call with Canada’s provincial and territorial premiers to discuss their shared response to the COVID-19 pandemic.</p>\n\n<p>Canada’s Ambassador to the United States, Kirsten Hillman, provided an update to First Ministers on Canada-U.S. relations in the lead up to the United States’ presidential elections. The Prime Minister thanked premiers for their close collaboration on Canada-U.S. relations. First Ministers agreed that Canada’s strong relationship with the United States is fundamental to the economic prosperity and national security of our country.</p>\n\n<p>First Ministers continued discussions on the recent and significant increase in COVID-19 cases in certain parts of the country. They emphasized the importance of encouraging Canadians to be vigilant and follow public health advice. The Prime Minister highlighted the federal government’s assistance to provinces and territories in need of additional support, and updated premiers on the procurement and distribution of rapid testing solutions. The Prime Minister also highlighted the need for all orders of government to work together to ensure the health and safety of seniors in long-term care facilities. The Prime Minister also updated premiers on international travel restrictions.</p>\n\n<p>All First Ministers reiterated their support for the Team Canada approach to fighting COVID-19, in order to minimize the impacts of an increase in cases of COVID-19 and support economic recovery.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2020/10/government-introduces-new-border-measures-to-protect-canadian-public-health-provides-update-on-travel-restrictions.html\">Government introduces new border measures to protect Canadian public health, provides update on travel restrictions</a></li>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n</ul></div>\n      "
}