{
  "path": "/en/news/statements/2020/01/29/statement-prime-minister-third-anniversary-fatal-shooting-centre",
  "pageTitle": "Statement by the Prime Minister on the third anniversary of the fatal shooting at the Centre culturel islamique de Québec | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the third anniversary of the fatal shooting at the Centre culturel islamique de Québec:</p>\n\n<p>“Three years ago tonight, six people were killed and nineteen others were seriously injured in a terrorist attack at the Centre culturel islamique de Québec in Ste-Foy.</p>\n\n<p>“Today, we mourn those who were senselessly killed, and suffered at the hands of ignorance, Islamophobia, and racism. We share the pain of their children, spouses, friends, and neighbours, who were robbed of their loved ones far too soon. Our thoughts are also with those injured, whose lives forever changed after this brutal and inhumane attack.</p>\n\n<p>“On the anniversary of this tragedy, we also remember the heroes and first responders whose extraordinary actions saved lives that night. Their courage inspired Canadians across the country who, despite their differences, rallied together in support of Muslim communities across Canada.</p>\n\n<p>“This spirit of unity drives the Government of Canada’s fight against hatred, intolerance, and fear. Whether by <a href=\"https://pm.gc.ca/en/news/news-releases/2019/05/15/canada-joins-christchurch-call-action-eliminate-terrorist-and-violent\">countering terrorist and violent extremist content online</a> or taking steps to strengthen gun control, we are working to build a country where everyone is safe—regardless of their religion, beliefs, or background.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to take a moment today to remember the victims. Together, let us show that we will never forget their memory, and honour them by fighting Islamophobia and all other forms of hatred and discrimination.”</p></div>\n      "
}