{
  "path": "/en/news/news-releases/2019/02/15/investment-automotive-innovation-make-vehicles-safer-and-create-jobs",
  "pageTitle": "Investment in automotive innovation to make vehicles safer and create jobs for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Self-parking, automatic braking, driverless – the vehicles of tomorrow are bound not only to be autonomous, but also connected to one another. That is why the Government of Canada is making bold investments to establish Canada as a global leader in cybersecurity and automotive software for connected and autonomous vehicles.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced an investment of $40 million in BlackBerry QNX, a business unit of BlackBerry Limited, to develop safe and secure software systems for the next generation of connected and autonomous vehicles.</p>\n\n<p>The company will create more than 800 new middle class jobs in Canada over the next ten years, and maintain nearly 300&nbsp;more. They will also provide new skills development and learning opportunities to help train Canadians for the jobs of tomorrow and keep Canada competitive in today’s global economy.</p>\n\n<p>With this funding, BlackBerry QNX will develop new automated control systems, upgrade and secure communications in vehicles, and improve vehicle safety and security by expanding its advanced driver-assistance system. BlackBerry QNX will also develop and use concept cars as labs for technology and software development.</p>\n\n<p>The Government of Canada will continue to invest in new automotive technologies that make our vehicles safer and more secure, and position our country as the place where cars of the future are designed and built.</p>\n\n<h3>Quotes</h3>\n\n<blockquote>\n<p>“The race for a top spot in the new economy has already begun, and if we want to see Canadians take the lead, we need to have their backs. That is why our government is investing $40 million in BlackBerry QNX to design and develop a new software platform for the cars of today and tomorrow. This investment will create 800 good, middle class jobs for Canadians, make our cars safer and more secure, and further position Canada as a global hub for innovation.”&nbsp;<br>\n<cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“We are betting on innovation driving our success at home and abroad. Our government is proud to invest in BlackBerry QNX’s exciting project and to position Canada as a global leader in automotive innovation. That’s how our investments today are creating new middle class jobs of tomorrow.”<br>\n<cite>—The Honourable Navdeep Bains, Minister of Innovation, Science and Economic Development</cite></p>\n</blockquote>\n\n<blockquote>\n<p>“BlackBerry is trusted by automakers and Tier 1s around the world to protect hardware, software, applications, and end-to-end systems from cyberattacks. Thanks to the Canadian government’s commitment we’re now in an even stronger position to deliver on the demand for BlackBerry’s safe and secure QNX software. Together we will spur innovation, create great jobs, educate the workforce of tomorrow, and solidify Canada as a world leader in automotive technology.”<br>\n<cite>—John Chen, Executive Chairman and CEO, BlackBerry</cite></p>\n</blockquote>\n\n<h3>Quick Facts</h3>\n\n<ul>\n\t<li>BlackBerry will invest $310.5 million in the project, as well as commit $5 million to cybersecurity to collaborate with government, post-secondary institutions, and private sector firms.</li>\n\t<li>The Government of Canada’s $40 million investment is made through the Strategic Innovation Fund, a program designed to attract and support high-quality business investments across all sectors of the economy by encouraging research and development that will accelerate technology transfer and the commercialization of innovative products, processes and services, and will facilitate the growth of innovative firms.</li>\n\t<li>In 2017, Canada’s automotive industry – one of our country’s largest export industries – produced 2.2 million vehicles, contributed over $18 billion in GDP, and directly and indirectly employed over 500,000 people in well-paying, middle class jobs.</li>\n\t<li>BlackBerry’s pedigree in safety, security, and continued innovation has led to its QNX technology being embedded in more than 120 million vehicles on the road today. It is used by the top seven automotive Tier 1s, and by 40+ OEMs including Audi, BMW, Ford, GM, Honda, Hyundai, Jaguar Land Rover, KIA, Maserati, Mercedes-Benz, Porsche, Toyota, and Volkswagen. The company partners with automotive Tier 1s, like Aptiv, Bosch, Denso, Panasonic and Visteon, and silicon partners, such as Intel, Qualcomm, Nvidia, and Renesas.</li>\n\t<li>BlackBerry employs nearly 2,000 people in Canada.</li>\n</ul>\n\n<h3>Associated Links</h3>\n\n<ul>\n\t<li><a href=\"http://www.ic.gc.ca/eic/site/125.nsf/eng/home\">Strategic Innovation Fund</a></li>\n\t<li><a href=\"https://blackberry.qnx.com/en\">BlackBerry QNX</a></li>\n</ul></div>\n      "
}