{
  "path": "/en/news/news-releases/2018/01/16/prime-minister-launches-canada-service-corps",
  "pageTitle": "Prime Minister launches Canada Service Corps | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister and Minister of Youth, Justin Trudeau, today launched the design phase of Canada Service Corps, Canada’s new national youth service initiative.</p><p>Canada Service Corps will encourage young Canadians to get involved in service to their communities and gain valuable skills and experience that will benefit them in every aspect of life. It will also provide young Canadians with service opportunities that currently do not exist.</p><p>More meaningful volunteer and service opportunities means more young people will have the chance to practice leadership, develop individual strengths, and gain essential life and work experiences. As a nationwide initiative, Canada Service Corps will help more young Canadians to understand the importance of serving their communities, and instill a sense of civic engagement and global citizenship.</p><p>During this first phase, the Government of Canada will work with young Canadians to find out more about their motivations and interests, and to explore what service means to them. Their ideas will directly shape the initiative, and help to ensure it meets the needs and priorities of young people once it is fully implemented in 2019.</p><p>The Government of Canada will work closely with national, regional, and local organizations to explore how best to engage and inspire young Canadians, and to connect youth with meaningful service opportunities. Understanding that volunteering is often the first step to meaningful service, the Government of Canada will offer an online matching service through Volunteer Canada that helps young people to find volunteer opportunities in their communities. Young Canadians can also apply for funding that will help them and their team make their service-related projects a reality.</p><h2>Quotes</h2><blockquote><p>“Young people should have more chances to serve their communities, while gaining valuable skills and experience. That is what Canada Service Corps is all about. If we’re going to get this right, we need to hear from young Canadians. Together, let’s inspire a new culture of service in Canada and build a better country, one community at a time.”<br>—<cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada and Minister of Youth</cite></p></blockquote><blockquote><p>“Our future prosperity depends on young Canadians getting the experience and skills they need to succeed. Young Canadians are leaders today; they want to be involved, and we are giving them the opportunity to build a program that is for them, by them. The design phase of Canada Service Corps is all about engagement and collaboration with young people so that together we can create a program that reflects what matters most to them.”<br>—<cite>Hon. Patty Hajdu, Minister of Employment, Workforce Development and Labour</cite></p></blockquote><blockquote><p>“Service can open the door to new and meaningful opportunities and experiences. The launch of the design phase of Canada Service Corps is another&nbsp;significant step in our work&nbsp;with our country’s young people to build a&nbsp;program that will engage those who already serve their community,&nbsp;as well as encourage others to take up service where they live, across Canada and abroad. This is an exciting&nbsp;opportunity to design an initiative to meet the needs of our youngest leaders.”<br>—<cite>Peter Schiefke, Parliamentary Secretary to the Prime Minister (Youth)</cite></p></blockquote><h2>Quick Facts</h2><ul><li>As part of this first phase of Canada Service Corps, the Government of Canada will:<ul><li>Launch a new website for young Canadians so they can provide feedback about what service means to them.</li><li>Fund national, regional, and local scale projects to engage young Canadians from all backgrounds, and provide them with flexible opportunities to get involved in service projects that suit their interests.</li><li>Provide young Canadians with access to funding– through TakingITGlobal – which will provide them with fixed amounts of $250, $750, or $1,500 to fund service-related projects. Up to 4,000 young Canadians are expected to be awarded funding by March 2020.</li><li>Help eligible organizations apply for funding so they can launch innovative local and regional projects that engage young people and get them involved in meaningful service opportunities.</li><li>Offer an online matching service through Volunteer Canada that helps young people to find volunteer opportunities in their communities.</li></ul></li><li>Canada Service Corps will be provided with $105 million up to March 2021, and will fund eligible projects that present opportunities for young Canadians to get involved in service to communities.</li></ul><h2>Related Product</h2><ul><li>Backgrounder: <a href=\"/en/news/backgrounders/2018/01/16/canada-service-corps\">Canada Service Corps</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://canada.ca/canadaservicecorps\">Canada.ca/canadaservicecorps</a>&nbsp;</li></ul></div>\n      "
}