{
  "path": "/en/news/itineraries/2018/12/05/itinerary-thursday-december-6-2018",
  "pageTitle": "Itinerary for Thursday, December 6, 2018 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Note: All times local</p><h2>Montréal, Quebec</h2><p><b>8:15 a.m.</b> The Prime Minister will participate in <i>La Guignolée des médias</i> with the Cogeco Media team.&nbsp;&nbsp;</p><p>Rue de la Gauchetière Ouest at Boulevard Robert-Bourassa</p><p><b>Notes for media:</b></p><ul><ul><li>Photo opportunity</li><li>Media are asked to present themselves to the Cogeco Media building foyer at 800 Rue de la Gauchetière, Portail Nord-Est, no later than 7:45 a.m.</li></ul></ul><p><b>9:30 a.m.&nbsp;</b>The Prime Minister will meet with Premier of Yukon Sandy Silver.</p><p>Studio Room, Espace C2, 21<sup>st</sup> Floor<br>Fairmont Queen Elizabeth Hotel<br>900, Boulevard René-Lévesque Ouest</p><p><b> Notes for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li><li>Media are asked to present themselves to the lobby no later than 9:00 a.m.</li></ul></ul><p><b>1:10 p.m.</b>&nbsp;The Prime Minister and Minister of Innovation, Science and Economic Development Navdeep Bains will make an announcement on jobs, artificial intelligence and digital government with Minister of Economy and Innovation of Quebec Pierre Fitzgibbon and Secretary of State for Digital Affairs of France Mounir Mahjoubi. A media availability with the Prime Minister will follow.</p><p>Element AI<br>6650, Rue Saint-Urbain, Suite 500</p><p><b>Notes for media: </b></p><ul><ul><li>Open coverage for the announcement and media availability</li><li>Media are asked to present themselves to the registration desk on the ground floor no later than 12:00 p.m.</li></ul></ul><p><b>3:50 p.m.</b> The Prime Minister will meet with Premier of Ontario Doug Ford.</p><p>Marriott Château Champlain, Habitation B<br>1050, Rue de la Gauchetière Ouest</p><p><b> Notes for media: </b></p><ul><ul><li>Pooled photo opportunity at the beginning of the meeting</li><li>Media are asked to arrive no later than 3:20 p.m.</li></ul></ul><p><b>5</b><b>:00 p.m.&nbsp;</b>The Prime Minister and Ms. Grégoire Trudeau will participate in a vigil honouring the victims of the 1989 École Polytechnique Montréal attack.</p><p>Belvédère Kondiaronk, Chalet du Mont-Royal<br>1196 Voie Camillien-Houde</p><p><b>Notes for media: </b></p><ul><ul><li>Photo opportunity</li><li>Media are asked to present themselves to the Chalet du Mont-Royal no later than 4:00 p.m.</li><li>Reserved parking will be available at the Chalet du Mont-Royal for media with equipment. All other media will be required to park at Smith House.</li></ul></ul><p><b>7</b><b>:00 p.m.&nbsp;</b>The Prime Minister will attend a First Ministers’ Meeting reception and dinner.</p><p><b><i>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</i></b><i>Closed to media.</i></p><h2>Media appearance</h2><ul><li>An interview with the Prime Minister and Paul Arcand will air on 98.5 FM Montréal’s <i>Puisqu’il faut se lever</i> at 7:40 a.m.</li></ul></div>\n      "
}