{
  "path": "/en/news/news-releases/2018/04/04/prime-minister-travel-peru-france-and-united-kingdom",
  "pageTitle": "Prime Minister to travel to Peru, France, and the United Kingdom | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Lima, Peru, from April 12 to 14, to Paris, France, from April 15 to 17, and to London, United Kingdom, from April 17 to 20.</p><p>In Lima, the Prime Minister will participate in the VIII Summit of the Americas and speak at the III CEO Summit of the Americas on the benefits of investing in Canada. Along with his counterparts, the Prime Minister will promote progressive trade that creates good, middle class jobs, and address climate change and ocean protection, the theme of democratic governance against corruption, and the ongoing crisis in Venezuela.</p><p>The Prime Minister will then head to Paris for an official visit to further strengthen our close and important relationship with France. This will be an opportunity for the Prime Minister to enhance the trade and investment ties between our two countries, and create economic growth that benefits people on both sides of the Atlantic. The Prime Minister will also discuss issues of importance to both Canada and France, including climate change, gender equality, diversity, and inclusion.</p><p>While in Paris, the Prime Minister will meet with President Emmanuel Macron, Prime Minister Édouard Philippe, as well as the Right Honourable Michaëlle&nbsp;Jean, Secretary General of the International Organisation of La Francophonie. The Prime Minister will also deliver an address to the Assemblée Nationale and give remarks at the Paris Institute of Political Studies.</p><p>In London, the Prime Minister will meet with Prime Minister Theresa May to build on our economic and trade partnership, and discuss ways to create more opportunities for all of our citizens. The Prime Minister will also have an audience with Her Majesty Queen Elizabeth II, and attend the Commonwealth Heads of Government Meeting under the theme “Towards a Common Future.” There, he will emphasize the need for action on climate change and ocean protection, and the need to create economic growth that benefits everyone.</p><h2>Quotes</h2><blockquote><p>“I thank Peru for their work organizing the Summit of the Americas, which provides a unique opportunity for leaders in the region to meet and agree on a forward-looking agenda for our hemisphere, and promote economic growth that is broadly shared. The Summit’s focus on the need for democratic governance in the fight against corruption is very relevant, and I look forward to discussing what we can all do to promote healthy democratic societies.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and France share an unwavering friendship founded on our common history, strong people-to-people connections, and shared language. While in Paris, I will promote increased collaboration between our two countries on climate change and innovation, and explore ways to deepen economic and trade ties between our two countries.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and the United Kingdom enjoy a deep and enduring relationship, forged by centuries of shared history, values, and traditions. During this visit, we will explore how to strengthen these bonds, build on our economic and trade partnership, and find new and innovative ways to work even more closely together on issues that matter to people on both sides of the Atlantic.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“The Commonwealth plays an important role promoting and upholding core values of democracy, peace and security, good governance, the rule of law, and human rights – values that are paramount to the member states. I look forward to working with my counterparts and addressing critical issues such as climate change, gender equality, progressive trade, and creating economic growth that works for everyone.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Minister of Foreign Affairs, Chrystia Freeland, will accompany the Prime Minister for the duration of the trip; the Minister of International Trade, François-Philippe Champagne, will lead a trade delegation to France and will accompany the Prime Minister to the United Kingdom; the Minister of the Environment and Climate Change, Catherine McKenna, and the Minister of Canadian Heritage, Mélanie Joly, will accompany the Prime Minister in France.</li><li>The Summit of the Americas brings together leaders of the countries of the Americas. The first Summit of the Americas was held in 1994. Canada has hosted the Summit once, in Québec in 2001. The Organization of American States, which serves as the secretariat for the summit process, was founded in 1948 and is built on the pillars of democracy, human rights, security and development. Canada was an observer for 28 years before becoming a permanent member in 1990.</li><li>Canada and France have a longstanding relationship, based on history and a common language, shared values and wide-ranging social, economic, and political cooperation. France is Canada’s second most important trading partner within the European Union. This will be the Prime Minister’s first official visit to France.</li><li>Prime Minister Trudeau will be the first Canadian prime minister in history to address the Assemblée Nationale.</li><li>Beyond a shared heritage, the United Kingdom is one of Canada’s largest trading and investment partners, and a significant partner in diplomacy, development, defence cooperation, law enforcement, and intelligence. This will be the Prime Minister’s third visit to the United Kingdom.</li><li>The Commonwealth is the world’s oldest political association of sovereign states. The organization brings together 53 countries that account for a combined population of 2.4 billion. Canada joined the Commonwealth in 1931.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/oas-oea/index.aspx?lang=eng\">Permanent Mission of Canada to the Organization of American States</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/multilateral-multilateraux/commonwealth.aspx?lang=eng\">Canada and the Commonwealth</a></li><li><a href=\"http://www.canadainternational.gc.ca/united_kingdom-royaume_uni/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada and the United Kingdom</a></li><li><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></li></ul></div>\n      "
}