{
  "path": "/en/news/readouts/2022/06/08/prime-minister-justin-trudeau-visits-north-american-aerospace-defense",
  "pageTitle": "Prime Minister Justin Trudeau visits the North American Aerospace Defense Command with the United States Secretary of Defense Lloyd J. Austin III | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau visited the&nbsp;North American Aerospace Defense Command (NORAD) in Colorado Springs, Colorado. He was joined by the United States&nbsp;Secretary of Defense, Lloyd J. Austin III, and the Minister of National Defence, Anita Anand.</p>\n\n<p>The Prime Minister underlined the strength of the unique defence partnership between Canada and the United States, and recognized the importance of NORAD’s binational command structure and its ability to detect, deter, and defend against threats to the continent, which have protected North America since 1957.</p>\n\n<p>During the visit, the Prime Minister participated in classified briefings and several meetings on the evolving threats posed by new technologies and recent geopolitical developments and on priorities for the development of NORAD’s capabilities and the future of continental defence with NORAD’s Commander,&nbsp;United States General Glen D. VanHerck, and NORAD’s Canadian Deputy Commander, Lieutenant-General Alain Pelletier.</p>\n\n<p>Prime Minister Trudeau also met with members of the Canadian Armed Forces currently serving within NORAD, and thanked them for the important role they play each day to ensure the safety and security of both countries.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://www.norad.mil/\">North American Aerospace Defense Command</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/03/prime-minister-visit-norad-and-attend-summit-americas\">Prime Minister to visit NORAD and attend the Summit of the Americas</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2021/08/joint-statement-on-norad-modernization.html\">Joint Statement on NORAD modernization</a></li>\n</ul></div>\n      "
}