{
  "path": "/en/news/readouts/2020/10/18/prime-minister-justin-trudeau-speaks-prime-minister-new-zealand-jacinda",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of New Zealand Jacinda Ardern | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of New Zealand, Jacinda Ardern, to congratulate her on her electoral victory.</p>\n\n<p>The prime ministers discussed shared priorities such as addressing the health and economic impacts of the COVID-19 pandemic and ensuring timely and equitable supply and access to vaccines domestically and internationally. The leaders also discussed how COVID-19 exposure notification apps such as Canada’s COVID Alert can help break the cycle of infection and protect communities. They exchanged views on the need to address historic inequalities and the shecession, invest in affordable housing, and promote economic growth that benefits everyone. They also discussed policies on medically-assisted dying, cannabis legalization, and continued action to tackle climate change, including investments in renewable energy.</p>\n\n<p>Building on their excellent working relationship, the prime ministers welcomed the close cooperation between Canada and New Zealand and looked forward to deepening collaboration across a wide range of common objectives and social and economic policies. They discussed the importance of working across partisan lines to combat polarization and focus on building a more equitable, prosperous, and sustainable future for everyone. They agreed to stay in touch including in the lead up to the 2021 Asia-Pacific Economic Cooperation forum hosted by New Zealand.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/new_zealand-nouvelle_zelande/bilateral_relations_bilaterales/canada_new_zealand-nouvelle_zelande.aspx?lang=eng\">Canada-New Zealand Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/10/17/statement-prime-minister-canada-results-general-election-new-zealand\">Statement by the Prime Minister of Canada on the results of the general election in New Zealand</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/04/canadas-support-for-international-efforts-to-fight-the-covid-19-pandemic.html\">Canada’s support for international efforts to fight the COVID-19 pandemic</a></li>\n</ul></div>\n      "
}