{
  "path": "/en/news/readouts/2021/07/08/prime-minister-justin-trudeau-meets-british-columbia-premier-john-horgan",
  "pageTitle": "Prime Minister Justin Trudeau meets with British Columbia Premier John Horgan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with British Columbia Premier John Horgan in Coquitlam.</p>\n\n<p>The Prime Minister and the Premier discussed a number of issues of shared importance, including creating jobs, strengthening the middle class, and growing the economy in British Columbia and Canada. They talked about working together on the historic first early learning and child care agreement in Canada announced earlier today, which will make life better and more affordable for families, and help parents – especially women – advance their careers while raising families. They also discussed the wildfires and extreme weather conditions in British Columbia, and agreed to continue working closely with Indigenous communities to keep people and communities safe, and enhance effective communications around impacts, resources, and response and recovery efforts.</p>\n\n<p>Prime Minister Trudeau and Premier Horgan also discussed investments in public transit infrastructure to help people get around faster and spend less time in traffic, and to create good middle class jobs. They also talked about their governments’ initiatives to protect the environment and biodiversity, and fight climate change by reducing pollution.&nbsp;The Prime Minister looked forward to Premier Horgan’s contributions at the next First Ministers’ Meeting, which will include further discussions on border measures and finishing the fight against COVID-19. The two leaders agreed to stay in close contact and advance shared priorities in the months ahead.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/08/canada-announces-historic-first-early-learning-and-child-care\">Canada announces historic first early learning and child care agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/07/08/prime-minister-justin-trudeau-convenes-incident-response-group-discuss\">Prime Minister Justin Trudeau convenes the Incident Response Group to discuss wildfires and extreme weather in British Columbia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/news/2021/06/government-of-canadas-first-phase-to-easing-border-measures-for-travellers-entering-canada3.html\">Government of Canada’s first phase to easing border measures for travellers entering Canada</a></li>\n</ul></div>\n      "
}