{
  "path": "/en/news/news-releases/2018/07/03/prime-minister-trudeau-travel-latvia",
  "pageTitle": "Prime Minister Trudeau to travel to Latvia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that he will travel to Latvia on July 9 and 10, 2018, before attending the NATO Summit in Belgium on July 11 and 12.</p><p>The visit will be an opportunity for the Prime Minister to reaffirm Canada’s commitment to the NATO Alliance and Euro-Atlantic security. It will also be a chance to deepen the strong ties between Canada and Latvia, as Latvia marks its centenary.</p><p>Prime Minister Trudeau will meet Prime Minister Māris Kučinskis and President Raimonds Vējonis in Riga. Together with Prime Minister Kučinskis, Prime Minister Trudeau will then visit the Canadian-led multinational NATO enhanced Forward Presence battlegroup Latvia to support the Canadian Armed Forces leading the battlegroup and witness firsthand the important work they are doing with partner countries.</p><p>The NATO enhanced Forward Presence battlegroup Latvia plays a key role in Canada’s efforts, together with Allies and partner countries, to maintain stability and security in Central and Eastern Europe. Canada’s leadership of the battlegroup is a significant contribution to security in the Baltic region, and represents Canada’s largest sustained military presence in Europe in over a decade.</p><p>During his visit, the Prime Minister will be accompanied by Minister&nbsp;Chrystia&nbsp;Freeland, Minister Harjit&nbsp;Sajjan, and General Jonathan Vance, Chief of the Defence Staff.</p><h2>Quote</h2><blockquote><p>“I look forward to meeting with Prime Minister Kučinskis and President Vējonis to reaffirm the strong bilateral relationship between Canada and Latvia, as well as Canada's solid commitment to NATO and the security of the Baltic region. The NATO enhanced Forward Presence battlegroup Latvia is an example of that, and I look forward to seeing in person the work Canadian Armed Forces members are doing with partner countries. Canada and Latvia also share close commercial ties thanks to the Canada-European Union Comprehensive Economic and Trade Agreement. Together, we will explore ways to build on our relationship and create new economic opportunities for workers and businesses in both our countries.”<br><cite>—The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>This is the first bilateral visit by a Canadian Prime Minister to Latvia.</li><li>Canada is home to a very active 28,000-strong Latvian-Canadian community.</li><li>Canada enjoys excellent relations with Latvia. Canada was the first G7 country to recognize the restoration of Latvia's independence in 1991, and one of the first countries to ratify Latvia's accession to NATO in 2004.</li><li>Since 2014, Canada has actively worked alongside NATO Allies to maintain security and stability in Central and Eastern Europe. Measures include training, exercises, and other operational tasks.</li><li>Canada leads the multinational NATO enhanced Forward Presence battlegroup Latvia, serves as the Framework Nation, and contributes approximately 450&nbsp;troops to the deployment&nbsp;as part of Operation REASSURANCE.</li><li>Canada is proud to serve alongside Latvia with our NATO Allies in the battlegroup: Albania, Czechia, Italy, Poland, Slovakia, Slovenia, and Spain.</li><li>Operation REASSURANCE is the Canadian Armed Forces’ support to NATO assurance and deterrence measures in Central and Eastern Europe. As part of this operation, Canada has established its largest sustained military presence in Europe in over a decade by leading a multinational NATO battle group in Latvia.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.forces.gc.ca/en/operations-abroad/nato-ee.page\">Operation REASSURANCE</a></li><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\">Canada in NATO</a></li><li><a href=\"/en/news/news-releases/2018/06/25/prime-minister-trudeau-attend-nato-summit\">Prime Minister Trudeau to attend NATO Summit</a></li></ul></div>\n      "
}