{
  "path": "/en/news/statements/2022/09/23/g7-leaders-statement",
  "pageTitle": "G7 Leaders’ Statement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>We, the Leaders of the Group of Seven (G7), strongly condemn the sham referenda that Russia attempts to use to create a phony pretext for changing the status of Ukrainian sovereign territory, which is subject to an ongoing Russian aggression. These actions clearly breach the United Nations Charter and international law and go diametrically against the rule of law among nations.</p>\n\n<p>These sham referenda initiated today by Russia and its proxies have no legal effect or legitimacy, as demonstrated by Russia’s hasty methods of organisation, which in no way respect democratic norms, and its blatant intimidation of local populations. These referenda in areas that have been forcibly put under Russia’s temporary control in no way represent a legitimate expression of the will of the Ukrainian people, who have consistently resisted Russian efforts to change borders by force. We will never recognise these referenda which appear to be a step toward Russian annexation and we will never recognise a purported annexation if it occurs.</p>\n\n<p>In addition, we deplore deliberate Russian escalatory steps, including the partial mobilisation of reservists and irresponsible nuclear rhetoric.</p>\n\n<p>We call upon all countries to unequivocally reject these sham referenda as Russia’s attempt to give false cover to its violations of international law. We stand ready to impose further economic costs on Russia, and on individuals and entities – inside and outside of Russia –providing political or economic support for Russia’s illegal attempts to change the status of Ukrainian territory.</p>\n\n<p>We are steadfast in our commitment to providing the support Ukraine needs to uphold ist sovereignty and territorial integrity, to defend itself, and to choose its own future. We will continue to provide financial, humanitarian, military, diplomatic and legal support, and will move ahead on reconstruction efforts, including through the International Expert Conference on the Recovery, Reconstruction and Modernisation of Ukraine in Berlin on 25 October.</p>\n\n<p>We will stand firmly with Ukraine for as long as it takes.</p></div>\n      "
}