{
  "path": "/en/news/readouts/2021/11/21/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss floods and extreme weather in British Columbia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss the floods, landslides, and extreme weather conditions affecting thousands of people in British Columbia that resulted in the terrible loss of four lives.</p>\n\n<p>The Prime Minister thanked the President of the Queen’s Privy Council for Canada and Minister of Emergency Preparedness, Bill Blair, for his leadership in collaborating and coordinating the federal response to the province of British Columbia. Minister Blair provided an overview of the evolving situation on the ground, and noted his appreciation to colleagues for the exceptional support that he has been receiving from across federal government organizations in response to the ongoing state of emergency in British Columbia.</p>\n\n<p>The Prime Minister acknowledged and thanked the Minister of National Defence, Anita Anand, and the Acting Chief of the Defence Staff, General Wayne Eyre, for the outstanding support of the Canadian Armed Forces (CAF), who have responded so quickly to assist Canadians in impacted communities. Several CAF aircraft assigned to relief operations, including helicopters and fixed-wing aircraft, will be in British Columbia by later today.&nbsp;The CAF are continuing dike mitigation at Sumas Prairie, providing assistance to farmers and supporting isolated communities with food delivery.</p>\n\n<p>The ministers in attendance reassured the Prime Minister that they are working in close collaboration with provincial counterparts and Indigenous leaders to assist the many communities across British Columbia who are facing immediate impacts to their daily lives.&nbsp;The Federal / Provincial Supply Chain Recovery Working Group announced yesterday will play an essential role in meeting the needs of those affected by this difficult situation.</p>\n\n<p>The Prime Minister underlined that, with the weather forecast calling for more rain in the coming days and the devastating effects facing important sectors, including the agriculture sector, federal government organizations are working together with the province to respond to the needs of people and communities in British Columbia, and will do whatever they can to urgently assist them in this challenging time. While focused on dealing with the current emergency, the Prime Minister and ministers highlighted the importance of all orders of government working together to accelerate action to improve climate resilience of communities and key infrastructure.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/16/prime-minister-justin-trudeau-speaks-british-columbia-premier-john-horgan\">Prime Minister Justin Trudeau speaks with British Columbia Premier John Horgan</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/11/17/prime-minister-justin-trudeau-asks-minister-blair-convene-incident\">Prime Minister Justin Trudeau asks Minister Blair to convene the Incident Response Group to discuss floods and extreme weather in British Columbia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2021/11/government-of-canada-to-assist-british-columbia-with-response-to-extreme-flooding.html\">Government of Canada to assist British Columbia with response to extreme flooding</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/11/governments-of-canada-and-british-columbia-announce-joint-supply-chain-recovery-working-group.html\">Governments of Canada and British Columbia announce joint supply chain recovery working group</a></li>\n</ul></div>\n      "
}