{
  "path": "/en/news/news-releases/2022/06/06/prime-minister-concludes-successful-visit-president-chile-gabriel",
  "pageTitle": "Prime Minister concludes successful visit of President of Chile Gabriel Boric | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today met with the President of Chile, Gabriel Boric, to further strengthen the relationship between the two countries and their partnership in the Americas.</p>\n\n<p>During the meeting, Prime Minister Trudeau and President Boric re-affirmed their commitment to work together as progressive leaders on issues that matter to Canadians and Chileans alike, including promoting democracy and&nbsp;safeguarding human rights,&nbsp;generating economic growth that creates good jobs and benefits everyone, protecting the environment, and furthering meaningful engagement with Indigenous Peoples.</p>\n\n<p>Prime Minister Trudeau and President Boric strongly condemned Russia’s unjustifiable invasion of Ukraine and highlighted their unwavering support of&nbsp;Ukraine’s democracy, sovereignty,&nbsp;and territorial integrity.</p>\n\n<p>The leaders also pledged to work together to support internationally displaced persons, including the millions of refugees and migrants fleeing Venezuela to seek a secure future in the hemisphere.</p>\n\n<p>Prime Minister Trudeau also announced that Canada will co-sponsor the America for the Protection of the Ocean Declaration, a Chilean initiative for countries to work together to protect the Pacific Ocean.&nbsp;This underscores Canada’s commitment to keeping our oceans and coasts clean and healthy and fighting climate change. Building on Canada and Chile’s ambitious climate action, the two leaders also issued a joint statement identifying pollution pricing as one of the most efficient ways to cut emissions and create jobs, and agreed to work together to promote its adoption in the Americas and beyond.</p>\n\n<p>During the visit, Canada and Chile signed the Memorandum of Understanding&nbsp;on Cooperation in Gender Equality and Women’s Empowerment&nbsp;to establish a framework to promote gender equality and women’s empowerment.</p>\n\n<p>Prime Minister Trudeau also welcomed Chile’s decision to join the Freedom Online Coalition, a group of countries dedicated to ensuring that the human rights people have offline, are also protected online. Canada is serving as the Chair of the coalition for 2022, with a particular focus on reinforcing democracy by ensuring informed and engaged publics can participate meaningfully in society.</p>\n\n<p>Later this afternoon, Prime Minister Trudeau and President Boric will meet with high school students for a discussion on the environment and climate change, leadership, democracy, and gender equality.</p>\n\n<p>Following this visit, the leaders will travel to Los Angeles to attend the Summit of the Americas from June 8 to June 10.<strong>&nbsp;</strong></p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Canada and Chile are close friends and partners in the Americas. We are&nbsp;united by our steadfast commitment to climate action, democracy, peace and security, human rights, engagement with Indigenous Peoples, economic growth that benefits everyone, and gender equality. It’s never been more important for progressive leaders to work together to make life better for people, by growing the middle class and helping people working hard to join it. By protecting our oceans, putting a price on pollution, and continuing to lead on gender equality, we will continue strengthening our partnership and create a better future for everyone in Canada and Chile.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>At COP26 in November 2021, Prime Minister Trudeau called on all countries to take bold action to expand the use of pollution pricing globally with a goal of having 60 per cent of global emissions covered by pollution pricing by 2030.</li>\n\t<li>Canada and Chile have enjoyed vibrant diplomatic relations since 1941, spanning over 80 years.</li>\n\t<li>This year marks the 25th anniversary of the Canada-Chile Free Trade Agreement (CCFTA) and Environmental and Labour Cooperation Agreements. Bilateral merchandise trade has more than quadrupled since the CCFTA came into force in 1997. In 2021, Canada exported more than $1.2 billion in merchandise to Chile in 2021, while imports from Chile totalled more than $1.8 billion. Canada is the second most important foreign investor in Chile.</li>\n\t<li>In addition to the Summit of the Americas, Canada and Chile are close partners in several regional and multilateral fora, including the United Nations, the Asia-Pacific Economic Cooperation forum, the World Trade Organization, the Organization of American States, and the Pacific Alliance.</li>\n\t<li>A growing number of Chileans have been choosing Canada for their studies, with study permits issued to Chileans more than tripling in the past five years – from 430 in 2016 to nearly 1,400 in 2021.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/06/joint-statement-prime-minister-justin-trudeau-and-president-gabriel\">Joint statement by Prime Minister Justin Trudeau and President Gabriel Boric</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/06/06/canada-chile-announcement-carbon-pricing\">Canada-Chile announcement on carbon pricing</a></li>\n\t<li><a href=\"https://women-gender-equality.canada.ca/en/international-involvement/canada-chile-memorandum.html\">MOU between the Republic of Chile and the Government of Canada on Cooperation in Gender Equality and Women’s Empowerment</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/05/31/president-chile-gabriel-boric-visit-canada\">President of Chile Gabriel Boric to visit Canada</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/chile-chili/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Chile relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/chile-chili/index.aspx?lang=eng&amp;_ga=2.67006890.589644227.1640126716-2017077305.1613070365\">Canada-Chile Free Trade Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/environment-climate-change/corporate/international-affairs/partnerships-countries-regions/latin-america-caribbean/canada-chile-environmental-agreement.html\">Canada-Chile Agreement on Environmental Cooperation</a></li>\n\t<li><a href=\"http://www.summit-americas.org/default_en.htm\">Summit of the Americas</a></li>\n</ul></div>\n      "
}