{
  "path": "/en/news/statements/2021/11/08/statement-prime-minister-global-entrepreneurship-week",
  "pageTitle": "Statement by the Prime Minister on Global Entrepreneurship Week | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Global Entrepreneurship Week, which runs from November 8 to 14, 2021:</p>\n\n<p>“Entrepreneurs are innovators, risk takers, and key drivers of the Canadian economy. They launch startups that bring new ideas to life, invest in our communities, and create good paying jobs for Canadians.</p>\n\n<p>“During <a href=\"https://www.genglobal.org/canada\">Global Entrepreneurship Week</a>, we celebrate the ingenuity and hard work of entrepreneurs, and thank them for their important contributions to Canada’s economic prosperity. This week is designed to connect people around the world with the tools and resources they need to engage in entrepreneurial activity, transform their ideas into products and services, and unlock economic opportunities.</p>\n\n<p>“Over the past year and a half, entrepreneurs have faced hardship and uncertainty as a result of the COVID-19 pandemic. Yet, in communities across the country, countless entrepreneurs found new ways to do business, proving that the entrepreneurial spirit of Canadians is strong and resilient.</p>\n\n<p>“From the onset of the pandemic, the Government of Canada has taken many steps to help Canadian businesses and entrepreneurs facing financial hardship adapt and position themselves for recovery. We launched programs such as the <a href=\"https://ceba-cuec.ca/\">Canada Emergency Business Account</a> to provide support to businesses through partially forgivable loans, and the <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/emergency-wage-subsidy.html\">Canada Emergency Wage Subsidy</a> and <a href=\"https://www.canada.ca/en/revenue-agency/services/subsidy/recovery-hiring-program.html\">Canada Recovery Hiring Program</a> to help them cover part of their employees’ wages. Last year, we provided $15 million in additional funding through the <a href=\"https://ised-isde.canada.ca/site/women-entrepreneurship-strategy/en\">Women Entrepreneurship Strategy</a> to help women entrepreneurs navigate the pandemic, and <a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap4\">Budget 2021</a> made further investments of $146.9 million to help women entrepreneurs succeed over the long term. Similarly, we created the <a href=\"https://www.ic.gc.ca/eic/site/150.nsf/eng/home\">Black Entrepreneurship Program</a> in September&nbsp;2020 with an investment of $144.7 million to date, including launching the first-ever <a href=\"https://www.ic.gc.ca/eic/site/150.nsf/eng/00009.html\">Black Entrepreneurship Loan Fund</a> to help Black business owners and entrepreneurs access loans and grow their businesses.</p>\n\n<p>“Through the Canadian <a href=\"https://www.tradecommissioner.gc.ca/index.aspx?lang=eng\">Trade Commissioner Service</a>, we adapted existing funding and support programs to help Canadian businesses navigate the new challenges brought on by the COVID-19 pandemic, and continue to support entrepreneurs through virtual trade events and trade missions as they grow into the global marketplace. This includes by introducing new eligible funding activities to the <a href=\"https://www.tradecommissioner.gc.ca/funding-financement/canexport/sme-pme/index.aspx?lang=eng\">CanExport SMEs</a> program to support e‑commerce projects and online advertising, as well as adapting our <a href=\"https://www.tradecommissioner.gc.ca/cta-atc/index.aspx?lang=eng\">Canadian Technology Accelerators</a> to run virtually.</p>\n\n<p>“As our recovery gets underway, we recognize that many businesses still need support. That is why we have extended the crucial support measures that have served as a lifeline to many businesses and entrepreneurs through the pandemic, to help them recover from its economic impacts. We have also announced targeted measures to support businesses that are still facing significant pandemic-related challenges, including the <a href=\"https://www.canada.ca/en/department-finance/news/2021/10/targeting-covid-19-support-measures.html\">Tourism and Hospitality Recovery Program and Hardest-Hit Business Recovery Program</a>. By extending measures and introducing new ones, the government is making sure that Canadian entrepreneurs and businesses can continue to have access to the support they need so they can invest in their recovery and long-term prosperity, create jobs, and help revitalize our communities. As we build back better from the pandemic, their success is essential to ours as a country.</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me to celebrate and thank our entrepreneurs for using their skills, energy, and drive, to help ensure our country remains one of the most prosperous in the world.”</p></div>\n      "
}