{
  "path": "/en/news/news-releases/2016/08/22/prime-minister-canada-announces-changes-structure-and-mandate-cabinet",
  "pageTitle": "The Prime Minister of Canada announces changes to structure and mandate of Cabinet committees | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced changes to the structure and mandate of Cabinet committees to reflect recent changes to the Canadian Ministry, and to further enhance the direction, strengths, and representation of the Government of Canada’s ministerial team.</p>\n<p>These changes will ensure that government priorities—including those related to an open and transparent government, growth for the middle class, and responsible defence procurement—can continue to be delivered effectively and efficiently.</p>\n<p><strong>Quote</strong></p>\n<p>\"I thank all Cabinet committees for the work they have done to put Canadians first, and to help run a government that is open, transparent and accountable to the public. I have the utmost of confidence in my colleagues who will be assuming new responsibilities and leadership roles, and I look forward to working with all of them to continue to implement our ambitious agenda of real change for Canadians.”&nbsp; &nbsp;</p>\n<p>—<em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick facts</strong></p>\n<ul>\n<li>The following adjustments have been made to the structure and mandate of Cabinet committees:</li>\n<ul>\n<li>The Cabinet Committee on Open and Transparent Government has been merged with the Cabinet Committee on Parliamentary Affairs, and re-named the Cabinet Committee on Open Transparent Government and Parliament;</li>\n<li>A Cabinet Committee on Litigation Management has been created, and Minister Dominic LeBlanc has been named as its Chair;</li>\n<li>The Cabinet Committee on Inclusive Growth, Opportunities and Innovation has been re-named the Cabinet Committee on Growing the Middle Class to reflect the committee’s central role in advancing this key objective; and</li>\n<li>The Ad Hoc Cabinet Committee on Defence Procurement and the Sub-Committee on Canada-United States Relations have been given full committee status.</li>\n</ul>\n<li>The membership of various committees, including some Chair and Vice-Chair positions, have also been adjusted to make better use of ministerial experience and availability.</li>\n<li>In addition, Minister Bardish Chagger will join Minister LeBlanc as the privy councillors appointed to be members of the Board of Internal Economy.</li>\n<li>Finally, the following adjustments will be made to the Employment and Social Development (ESDC) portfolio:</li>\n<ul>\n<li>In order to deliver on an ambitious ESDC portfolio agenda, the mandate responsibilities of Minister Jean-Yves Duclos and Minister MaryAnn Mihychuk will be rebalanced. Minister Duclos will now lead on delivering mandate commitments for Employment Insurance, such as parental and compassionate care. In addition, he will also be responsible to lead on the commitment to rationalize and expand intergovernmental agreements that support skills training.</li>\n<li>Minister Mihychuk will continue to lead on workforce development related to Indigenous training, post-secondary education reform and youth employment initiatives..</li>\n</ul>\n</ul>\n<ul></ul>\n<p><strong>Associated links</strong></p>\n<ul>\n<ul>\n<li><a href=\"/sites/pm/files/docs/Cab_committee-comite.pdf\">Cabinet Committee Mandate and Membership</a></li>\n</ul>\n</ul></div>\n      "
}