{
  "path": "/en/news/news-releases/2020/02/14/building-more-secure-and-prosperous-future-prime-minister-attends",
  "pageTitle": "Building a more secure and prosperous future: Prime Minister attends Munich Security Conference | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada is working to build partnerships to advance Canada’s security and prosperity, and address pressing global challenges. Now more than ever, it is critical that we continue to work with others to make the world a safer place.</p>\n\n<p>The Prime Minister, Justin Trudeau, today attended the Munich Security Conference. The Conference brings together world leaders, officials, senior military officers, academics and other leaders to discuss current and future security challenges.</p>\n\n<p>During the conference the Prime Minister highlighted Canada’s contributions to international peace and security. He noted our continued commitment to working with other countries, and through international institutions, to defend democracy, human rights and gender equality, and fight against climate change.</p>\n\n<p>Prime Minister Trudeau announced that Canada is developing a Safer Skies Strategy, which will bring together partners to establish a common set of practices to better protect passengers from the risk of flying in or near foreign conflict zones. Together, we can improve aviation safety and prevent tragedies like the downing of Malaysian Airlines Flight MH-17 and more recently Ukraine International Airlines Flight PS-752, from ever happening again.</p>\n\n<p>Prime Minister Trudeau also met with international leaders. They talked about common priorities such as security and growth that benefits everyone.</p>\n\n<p>In addition, the Prime Minister participated in an armchair discussion with Canadian author Kim Thuy, showcasing Canada as 2020 Guest of Honor of the Frankfurt Book Fair. The Frankfurt Bookfair is the world's largest annual trade fair for publishing.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“In our rapidly changing and uncertain world, Canada will always stand up for the values and interests of Canadians. These values will guide our work as we address global challenges and promote democracy, gender equality, economic prosperity, and the fight against climate change. By working with other countries and leaders on important initiatives like the Safer Skies Strategy, we will build a safer, more secure, and prosperous future for all of our citizens.”</p>\n\n<footer class=\"default\"><em>The Rt. Hon. Justin Trudeau, Prime Minister of Canada </em></footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>While attending the conference, Prime Minister Trudeau met with:\n\t<ul>\n\t\t<li>United States Congressional Delegation led by the Senator from South Carolina and Chair of the Senate Judiciary Committee, Lindsey Graham.</li>\n\t\t<li>Prime Minister of Albania, Edi Rama.</li>\n\t\t<li>Prime Minister of Niger, Brigi Rafini.</li>\n\t\t<li>President of Kazakhstan, Kassym-Jomart Tokayev</li>\n\t\t<li>President of Lithuania, Gitanas Nausėda</li>\n\t\t<li>President of Montenegro, Milo Đukanović</li>\n\t\t<li>President of North Macedonia, Stevo Pendarovski</li>\n\t\t<li>Chancellor of Austria, Sebastian Kurz</li>\n\t</ul>\n\t</li>\n\t<li>Since its founding in 1963, the Munich Security Conference in Germany has become a premier event for international security policy dialogue.</li>\n\t<li>With around 7,500 exhibitors from over 100 countries, more than 285,000 visitors, over 4,000 events, and around 10,000 journalists and bloggers, the Frankfurt Bookfair (Frankfurter Buchmesse) is the world's largest annual trade fair for publishing.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://securityconference.org/en/\">Munich Security Conference</a></li>\n</ul></div>\n      "
}