{
  "path": "/en/news/statements/2020/06/17/statement-prime-minister-outcome-united-nations-security-council-vote",
  "pageTitle": "Statement by the Prime Minister on the outcome of the United Nations Security Council vote | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the outcome of the United Nations Security Council vote:</p>\n\n<p>“On behalf of the Government of Canada, I would like to congratulate Norway, Ireland, India, and Mexico on their election to the United Nations (UN) Security Council, and thank all countries for engaging with Canada throughout this campaign.</p>\n\n<p>“Canada sought election on the UN Security Council to work with the world to help build a better future that benefits everyone. One that furthers sustainable peace, addresses the impacts of climate change, promotes economic security, advances gender equality, and strengthens multilateralism.</p>\n\n<p>“Throughout every step of our campaign, and in a time of global uncertainty, we promoted the Canadian values of peace, freedom, democracy, and human rights. We listened and learned from other countries, which opened new doors for cooperation to address global challenges, and we created new partnerships that increased Canada’s place in the world. This important engagement has contributed to our broader efforts to tackle the most important challenges of our time, including the COVID-19 pandemic, and has acted as a foundation for further international cooperation on other key issues. We will continue to pursue this approach at the United Nations and in other international forums – because Canada does well, and Canadians do well, when we strengthen our international relationships and fully engage on the world stage.</p>\n\n<p>“Canada is large enough to make a difference, but we know we can’t do it alone. As we move forward, we remain committed to the goals and principles that we laid out during this campaign, and we will continue to play a vital role in advancing global cooperation and building a more peaceful, inclusive, and sustainable world.”</p></div>\n      "
}