{
  "path": "/en/news/readouts/2020/02/14/prime-minister-justin-trudeau-meets-united-states-congressional-delegation",
  "pageTitle": "Prime Minister Justin Trudeau meets with United States Congressional Delegation | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met today with a delegation from the United States Senate and House of Representatives, led by Senator Lindsey Graham, at the Munich Security Conference.</p>\n\n<p>The Prime Minister and members of Congress discussed the new North American Free Trade Agreement and the economic benefit trade brings to all partners.&nbsp;They also had an exchange on protecting the environment and fighting climate change, including through pollution pricing and notably the strong environmental protections negotiated in the new NAFTA.</p>\n\n<p>The participants raised a range of international issues of mutual concern, including Russia, Venezuela, and WTO reform, and welcomed the strong collaboration and deep ties between the two countries. The Congressional delegation thanked Canada for its leadership on the Lima Group and for supporting Interim President Juan Guaidó and the Venezuelan National Assembly in their efforts to achieve a peaceful democratic transition in Venezuela.</p>\n\n<p>The group discussed relations with China, and the Prime Minister thanked the U.S. legislators for their ongoing support for the two Canadians, Michael Kovrig and Michael Spavor, who continue to be arbitrarily detained in China. They also discussed collaboration on coronavirus, with Canada thanking the U.S. for its assistance evacuating Canadians from Wuhan, China.</p>\n\n<p>No two nations work more closely together for their mutual prosperity and security than the U.S. and Canada. The U.S. sells more goods to Canada than to any other country, and the two countries cooperate extensively in the defence of North America and in operations around the world to promote global security.</p></div>\n      "
}