{
  "path": "/en/news/readouts/2021/03/17/prime-minister-justin-trudeau-speaks-prime-minister-italy-mario-draghi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Italy Mario Draghi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of Italy, Mario Draghi in their first bilateral engagement since Prime Minister Draghi took office.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Draghi discussed the strong partnership between Italy and Canada, including vibrant ties and shared values between our people. Prime Minister Draghi reflected on the important partnership between Canada and Europe, and the long friendship the two countries have enjoyed over the years. The two leaders looked forward to further opportunities for transatlantic cooperation, and to working together on many common priorities, such as addressing the impacts of the global COVID-19 pandemic, combatting climate change, and strengthening trade and commercial links between the two countries for the benefit of Canadians and Italians.</p>\n\n<p>The Prime Ministers discussed the pandemic and spoke about the public health and economic measures in Canada and Italy to keep people safe and to support individuals, families, and businesses. They agreed on the importance of safe and effective vaccines, and of getting people vaccinated as quickly as possible. They spoke about their support for global response initiatives to protect the most vulnerable and defeat the virus everywhere.</p>\n\n<p>Prime Minister Trudeau expressed support for Italy’s leadership role this year as President of the G20. The two leaders committed to continue to collaborate together and with other international partners to protect democratic values, address inequality, and strengthen global health systems.</p>\n\n<h2>Associated links:</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Italy Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/13/statement-prime-minister-canada-welcome-new-prime-minister-italy\">Statement by the Prime Minister of Canada to welcome the new Prime Minister of Italy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/11/22/prime-minister-concludes-virtual-g20-leaders-summit\">Prime Minister concludes virtual G20 Leaders’ Summit</a></li>\n\t<li><a href=\"https://ukcop26.org/\">26th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP26)</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}