{
  "path": "/en/news/news-releases/2017/09/07/prime-minister-host-first-ministers-meeting-and-meeting-national",
  "pageTitle": "Prime Minister to host First Ministers’ Meeting and meeting with national Indigenous leaders | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, announced today that he will host the First Ministers’ Meeting (FMM), including a meeting of First Ministers with national Indigenous leaders, in the National Capital Region on October 3, 2017.</p><p>Since the last FMM on December 9, 2016, federal, provincial, and territorial governments have been working closely together to implement the pan-Canadian Framework on Clean Growth and Climate Change.</p><p>At the FMM on October 3, First Ministers will discuss strong, sustainable economic growth that benefits everyone. The meeting with Indigenous leaders will focus on economic development in Indigenous communities.</p><h2>Quotes</h2><blockquote><p>“A prosperous Canada depends on a strong partnership between the federal government and the provinces and territories. I look forward to sitting down with Premiers to discuss ways we can build on Canada’s economic growth and create good, middle class jobs in every region of the country.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada is making progress towards a true nation-to-nation, Inuit-Crown, and government-to-government relationship with First Nations, Inuit, and Métis peoples in Canada. I look forward to meeting with Indigenous leaders and building on the real progress we have made toward renewing our relationship with Indigenous Peoples.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Budget 2017’s $3.4 billion, building on the historic investments of Budget 2016’s $8.4 billion, will continue to support the aspirations of Indigenous Peoples. It will help build stronger communities and close the socio-economic gap from coast to coast to coast.</li><li>Budget 2017’s $13.7 million over two years will support the establishment of new permanent bilateral mechanisms with the Assembly of First Nations and self-governing First Nations, the Inuit Tapiriit Kanatami and self-governing Inuit groups, and the Métis National Council and its Governing Members. Agreements were reached with each organization over the course of 2017.</li></ul><h2>Associated Links</h2><ul><li><a href=\"/en/news/statements/2016/12/09/communiqué-canada’s-first-ministers\">Communiqué of Canada’s First Ministers – December 9, 2016</a></li><li><a href=\"/en/news/statements/2016/12/09/commitment-action-prime-minister-canada-justin-trudeau-and-president\">Commitment to action by the PM and the President of Inuit Tapiriit Kanatami – December 9, 2016</a></li><li><a href=\"/en/news/statements/2016/12/15/statement-prime-minister-canada-advancing-reconciliation-indigenous\">Statement by the Prime Minister of Canada on advancing reconciliation with Indigenous Peoples – December 15, 2016</a></li><li><a href=\"/en/news/news-releases/2017/02/09/prime-minister-canada-and-president-inuit-tapiriit-kanatami-announce\">PM and President of Inuit Tapiriit Kanatami announce the Inuit-Crown Partnership Committee – February 9, 2017</a></li><li><a href=\"/en/news/news-releases/2017/04/12/prime-minister-canada-and-president-métis-national-council-welcome\">PM and President of the Métis National Council welcome the Signing of the Canada-Métis Nation Accord – April 13, 2017</a></li><li><a href=\"/en/news/news-releases/2017/06/12/prime-minister-and-national-chief-assembly-first-nations-sign\">PM and National Chief of the Assembly of First Nations sign Memorandum of Understanding on shared priorities – June 12, 2017</a></li></ul></div>\n      "
}