{
  "path": "/en/news/readouts/2020/05/21/prime-minister-trudeau-speaks-permanent-representatives-united-nations",
  "pageTitle": "Prime Minister Trudeau speaks with the Permanent Representatives of the United Nations’ Asia-Pacific Group | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Permanent Representatives of the United Nations’ Asia-Pacific Group to discuss Canada’s candidacy to serve on the United Nations Security Council (UNSC) for 2021-2022.</p>\n\n<p>The Prime Minister highlighted that Canada, as a Pacific country, shares deep economic, cultural, and people-to-people ties with countries in the Asia-Pacific Group, including through Canada’s membership in the Asia-Pacific Economic Cooperation (APEC) and close ties with the Association of Southeast Asian Nations (ASEAN). He spoke of the millions of Canadians that draw their heritage from the region, representing multiple generations of families that have contributed to the diversity that is Canada’s strength.</p>\n\n<p>The Prime Minister reiterated Canada’s commitment to be a productive and collaborative UNSC member, focused on working together with partners to address complex global issues. He pointed to the challenge posed by the COVID-19 pandemic, noting the importance of multilateral cooperation in addressing the health and economic impacts of the pandemic, and highlighting the central role of the United Nations in the international response.</p>\n\n<p>Prime Minister Trudeau and the Permanent Representatives spoke about the continued need for peacebuilding and peacekeeping in conflict zones. The Prime Minister commended the Asia-Pacific countries for their significant contributions to United Nations Peacekeeping, noting that countries from the region account for nearly 40 per cent of all blue helmets deployed around the world. He underscored Canada’s commitment to support peacekeeping efforts and increase the meaningful participation of women in peace processes as an important step in achieving gender equality.</p>\n\n<p>Highlighting Canada’s membership in the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), the Prime Minister discussed the importance that Canada attaches to free trade, open markets and maintaining the integrity of global supply chains as a means of increasing global economic security and prosperity.</p>\n\n<p>The Prime Minister and the Permanent Representatives discussed other issues with international security implications, including climate change, economic security, and the need to strengthen multilateralism. They spoke of the role that Canada can play in bringing these priorities to the forefront of discussions at the United Nations Security Council.</p>\n\n<p>As Canada pursues its candidacy for election to the United Nations Security Council for 2021-2022, we will continue to advance shared interests to benefit people and businesses in Canada and around the world.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/campaign-campagne/unsc-csnu/index.aspx?lang=eng\">Canada: UN Security Council Candidate 2021-2022</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asia_pacific-asie_pacifique/index.aspx?lang=eng\">Canada and the Asia-Pacific</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/apec/index.aspx?lang=eng\">Canada and the Asia-Pacific Economic Cooperation (APEC)</a></li>\n</ul></div>\n      "
}