{
  "path": "/en/news/readouts/2022/10/27/prime-minister-justin-trudeau-speaks-prime-minister-united-kingdom-rishi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of the United Kingdom Rishi Sunak | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the Prime Minister of the United Kingdom (UK), Rishi Sunak.</p>\n\n<p>Prime Minister Trudeau congratulated Prime Minister Sunak on his recent appointment. The two leaders discussed the importance of building on the strong relationship between their two countries, particularly to address ongoing global concerns such as Russia’s illegal and unjustifiable invasion of Ukraine, uncertainties facing the global economy, challenges to energy security, and opportunities for supporting opportunities for clean growth and job creation.</p>\n\n<p>Prime Minister Trudeau also underlined his interest in working closely with Prime Minister Sunak to address climate change and to support a successful COP15 in Canada in December. The prime ministers further discussed the deepening of the security cooperation between Canada and the UK, and agreed to pursue related efforts through the Canada-UK enhanced national security partnership.</p>\n\n<p>The two leaders confirmed their shared support for&nbsp;efforts to reinforce supply chain security and to&nbsp;promote free and open rules-based trade globally. Prime Minister Trudeau underscored Canada’s support for the UK’s accession to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership. The prime ministers emphasized that ongoing negotiations toward a comprehensive, ambitious, and inclusive free trade agreement between Canada and the UK remain a priority. They also discussed the importance of the G7, and agreed to continue closely collaborating with its members. &nbsp;</p>\n\n<p>Prime Minister Trudeau and Prime Minister Sunak looked forward to meeting in person during the upcoming G20 Leaders’ Summit in Indonesia.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/united_kingdom-royaume_uni/relations.aspx?lang=eng\">Canada-United Kingdom relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2022/10/25/statement-prime-minister-welcoming-new-prime-minister-united-kingdom\">Statement by the Prime Minister welcoming new Prime Minister of the United Kingdom Rishi Sunak</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/18/prime-minister-justin-trudeau-meets-prime-minister-elizabeth-truss-united\">Prime Minister Justin Trudeau meets with Prime Minister Elizabeth Truss of the United Kingdom</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cptpp-ptpgp/index.aspx?lang=eng\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n</ul></div>\n      "
}