{
  "path": "/en/news/readouts/2021/11/25/prime-minister-justin-trudeau-speaks-high-representative-african-union",
  "pageTitle": "Prime Minister Justin Trudeau speaks with High Representative of the African Union Commission for the Horn of Africa Olusegun Obasanjo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the High Representative of the African Union Commission for the Horn of Africa and former President of Nigeria, Olusegun Obasanjo.</p>\n\n<p>Prime Minister Trudeau welcomed the High Representative’s efforts toward a peaceful resolution of the ongoing conflict in northern Ethiopia and expressed appreciation for his work to support dialogue among all parties. The Prime Minister underscored the importance of working toward a ceasefire and de-escalating tensions, and reaffirmed his strong support for Africa-led mediation efforts.</p>\n\n<p>The Prime Minister reinforced Canada’s strong and ongoing commitment to supporting efforts to bring a peaceful resolution to the conflict. He emphasized the need to respect human rights and protect civilians. The Prime Minister also underscored the need to ensure unhindered access to and delivery of humanitarian assistance for those affected by the conflict.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/statement-by-minister-of-foreign-affairs-and-minister-of-international-development-on-release-of-investigation-report-on-atrocities-in-the-tigray-r.html\">Statement by Minister of Foreign Affairs and Minister of International Development on release of investigation report on atrocities in the Tigray region in Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/canada-withdraws-canadian-embassy-staffs-dependants-and-non-essential-personnel-from-ethiopia.html\">Canada withdraws Canadian embassy staff’s dependants and non-essential personnel from Ethiopia</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/11/joint-statement-on-release-of-ohchr-ehrc-joint-investigation-november-6-2021.html\">Joint Statement on release of OHCHR-EHRC joint investigation, November 6, 2021</a></li>\n</ul></div>\n      "
}