{
  "path": "/en/news/statements/2022/09/21/statement-prime-minister-armenias-independence-day",
  "pageTitle": "Statement by the Prime Minister on Armenia’s Independence Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Armenia’s Independence Day:</p>\n\n<p>“Today, we join Armenian communities across Canada and around the world to celebrate the anniversary of Armenia’s independence.</p>\n\n<p>“Canada was one of the first Western countries to recognize the independence of Armenia in 1992. Since then, our two countries have enjoyed a relationship built on strong people-to-people ties, as more than 60,000 Canadians of Armenian descent call Canada home. Canada and Armenia work together to advance shared priorities, both bilaterally and within multilateral institutions such as the United Nations, the Organization for Security and Co-operation in Europe, and the Organisation internationale de la Francophonie.</p>\n\n<p>“The Government of Canada is committed to further deepening our bilateral relationship, supporting the strengthening of democracy in Armenia, and contributing to economic development that benefits everyone. In June, we announced that Canada would open a full embassy with a resident ambassador in Armenia and as we mark the 30th anniversary of our diplomatic relations this year, we look forward to reinforcing the personal, cultural, and economic ties connecting our peoples.</p>\n\n<p>“Today, we also recognize the impact the rise in hostilities between Armenia and Azerbaijan has on people in the region. Canada supports the ceasefire and diplomatic efforts to maintain peace.</p>\n\n<p>“Today is a time to celebrate Armenia’s long and proud history, its rich culture, and the many contributions of its people. On behalf of the Government of Canada, Sophie and I extend our best wishes to Canadians of Armenian heritage, and to the people of Armenia.”</p></div>\n      "
}