{
  "path": "/en/news/statements/2018/01/22/statement-prime-minister-second-anniversary-shootings-la-loche",
  "pageTitle": "Statement by the Prime Minister on the second anniversary of the shootings in La Loche, Saskatchewan | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the second anniversary of the deadly shootings in La Loche, Saskatchewan:</p><p>“On January 22, 2016, four Canadians were killed and seven more were injured in attacks in La Loche, Saskatchewan. On this solemn anniversary, we remember those whose lives were taken, and offer our deepest sympathies to their families and friends, and all those affected by these attacks.</p><p>“We also honour the first responders – law enforcement and medical personnel – who responded to this difficult situation with bravery and professionalism and, in so doing, prevented more deaths.</p><p>“Two years later, the people of La Loche continue the process of healing. Each day, this community demonstrates its strength and resilience. La Loche continues to come together, rebuild, and move forward with hope.</p><p>\"Our government has no greater responsibility than to ensure the safety and security of Canadians. We must also make sure that people across Canada have the support and opportunities they need. We will continue to work in partnership with communities, Indigenous Peoples, municipal governments and provincial governments to address the issues facing La Loche and other communities across the country.</p><p>“On behalf of the Government of Canada, Sophie and I ask all Canadians to reflect on this solemn anniversary, and to remember all those whose lives were forever changed that day. To the whole La Loche community, please know that you are in our thoughts, and continue to have our unwavering support.”</p></div>\n      "
}