{
  "path": "/en/news/news-releases/2022/03/11/prime-minister-concludes-successful-visit-europe-and-announces",
  "pageTitle": "Prime Minister concludes successful visit to Europe and announces additional sanctions | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded a successful trip to Europe, including visits to the United Kingdom, Latvia, Germany, and Poland. The Prime Minister met with leaders and allies to continue our coordinated response against Russia’s unprovoked and unjustifiable aggression against Ukraine. The Prime Minister conveyed Canada’s support to European partners as they seek to address the emerging security and humanitarian challenges in the region.</p>\n\n<p>Canada, alongside our European allies, is supporting Ukraine by providing military aid, imposing significant sanctions on Russia, and addressing the emerging humanitarian crisis in the region. Canada is also increasing its military presence in Europe to support NATO Allies and reinforce NATO’s eastern flank.</p>\n\n<p>Today, the Prime Minister announced that Canada is imposing new sanctions under the <em>Special Economic Measures (Russia) Regulations</em>. These new measures will impose restrictions on 32 entities working in Russia’s defence sector and on five current and former Russian senior officials and associates of the regime who are complicit in President Putin’s choice to invade a peaceful and sovereign country. These measures build on a growing number of sanctions previously announced.</p>\n\n<p>While in Poland, the Prime Minister announced additional measures and investments to continue supporting Ukraine amidst Russia’s ongoing aggression, including:</p>\n\n<ul>\n\t<li>Matching an additional $20 million in donations from Canadians to the Canadian Red Cross, for a total of $30 million in government contributions to support immediate and ongoing relief efforts in the region;</li>\n\t<li>Allocating $50 million, from Canada’s $100 million contribution for humanitarian aid in the region, to: the World Food Programme, the UN Refugee Agency, the World Health Organization, the International Federation of the Red Cross and Red Crescent Societies, the Ukraine Humanitarian Fund, HelpAge, Save the Children, SOS Children’s Villages, and others to provide immediate assistance where it is needed most; and</li>\n\t<li>Investing an additional $117 million to implement Canada’s new immigration measures to welcome those fleeing the war in Ukraine. This funding will help set up new immigration pathways, expedite the processing of applications, and provide support to newcomers once they arrive in Canada.</li>\n</ul>\n\n<p>During his visit to Poland, Prime Minister Trudeau met with President Andrzej Duda, to discuss regional defence and security challenges and to broaden the bilateral trade relationship. Prime Minister Trudeau commended President Duda on Poland’s response to the rapidly growing refugee crisis, as more than one million refugees have fled to Poland, and he thanked the President for hosting Canada’s embassy staff following relocation from Ukraine. He also emphasized the formidable and longstanding military cooperation between Canada and Poland.</p>\n\n<p>Prime Minister Trudeau also met with the Prime Minister of Poland, Mateusz Morawiecki, to discuss continued coordination on further sanctions and support to Ukraine.</p>\n\n<p>Following bilateral meetings, Prime Minister Trudeau visited the Atrium Centrum temporary refugee shelter in Warsaw for Ukrainians and other people fleeing Russian aggression. During the visit, Prime Minister Trudeau met with representatives from non-governmental organizations providing support to refugees. Since the beginning of Russia’s invasion, the City of Warsaw has welcomed and cared for over 130,000 refugees.</p>\n\n<p>While in Poland, the Prime Minister also met United States Vice President Kamala Harris to discuss next steps in their coordinated response to Russia, as well as continued work on energy security. Canada and the United States will continue to impose severe economic consequences on Russia and on those complicit in Russia’s invasion.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Russia’s ongoing illegal and unjustifiable war against Ukraine is not going unpunished. Canada will continue to stand alongside our European allies and partners to advance our shared commitments to support Ukraine and its people, and defend democracy against authoritarianism everywhere.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Over the past days, I have been on the ground in Moldova and Romania with partners such as Save the Children and the UNHCR seeing the humanitarian assistance that they provide. The people of Moldova and Romania have shown great compassion to their neighbours. I have heard from these organizations about the needs of those impacted by Russia’s invasion of Ukraine, which has disproportionally impacted women and children. This $50 million worth of assistance will help those partners in providing critical and live-saving assistance.”</p>\n\n<footer class=\"default\">The Hon. Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>During the trip to Europe, the Prime Minister made additional announcements, including:\n\t<ul>\n\t\t<li>Imposing new restrictions on 10 individuals complicit in Russia’s unjustifiable invasion of Ukraine, including former and current senior government officials, and supporters of Russian leadership;</li>\n\t\t<li>Canada will renew its multi-year commitment to Operation REASSURANCE, the Canadian Armed Forces support to NATO’s assurance and deterrence measures in Central and Eastern Europe;</li>\n\t\t<li>Providing an additional $50 million in military aid to Ukraine, including highly specialized military equipment which will be sent to Ukraine in the near future;</li>\n\t\t<li>Providing $13.4 million over five years to support the G7 Rapid Response Mechanism (RRM), which strengthens coordination between G7 countries to identify and respond to foreign threats to democracies, including foreign state sponsored disinformation;</li>\n\t\t<li>Investing $3 million to support the Government of Ukraine’s priority of countering disinformation and other malign influence activities in Ukraine.</li>\n\t\t<li>Canada and Germany will&nbsp;collaborate&nbsp;on pollution pricing,&nbsp;energy and critical minerals,&nbsp;and&nbsp;agreed to&nbsp;jointly advance&nbsp;climate ambitions through a new Canada-Germany Dialogue; and</li>\n\t\t<li>Canada and Germany agreed to&nbsp;further securing&nbsp;energy&nbsp;supply chains by&nbsp;launching&nbsp;a clean hydrogen initiative&nbsp;to&nbsp;bring&nbsp;governments and industry in&nbsp;both countries together&nbsp;to develop a safe and secure supply of&nbsp;clean energy.</li>\n\t</ul>\n\t</li>\n\t<li>On February 24, 2022, the Prime Minister announced <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/02/additional-immigration-support-for-those-affected-by-the-situation-in-ukraine.html\">measures to support Ukrainians and people residing in Ukraine</a>, and to make it easier and faster for Canadian citizens, permanent residents, and their accompanying family members to return to Canada.</li>\n\t<li>On March 3, 2022, Immigration, Refugees and Citizenship Canada announced that it will introduce two <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/03/canada-to-welcome-those-fleeing-the-war-in-ukraine.html\">new immigration streams</a> for Ukrainians who want to come to Canada temporarily or permanently, including:\n\t<ul>\n\t\t<li>A Canada-Ukraine Authorization for Emergency Travel that will be open as soon as possible to individuals fleeing Ukraine, pending a background check and security screening, and would allow them to extend their stay in Canada by at least two years.</li>\n\t\t<li>Allowing those who come to Canada as part of this measure to apply for open work permits, making it easier for employers to quickly hire Ukrainian nationals.</li>\n\t\t<li>A special family reunification sponsorship pathway to permanent residence for immediate and extended family members of Canadian citizens and permanent residents, in development with the Ukrainian-Canadian community.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Related Product</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine-sanctions.aspx?lang=eng\">Sanctions – Russian invasion of Ukraine</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/poland-pologne/relations.aspx?lang=eng\">Canada-Poland Relations</a></li>\n\t<li><a href=\"https://donate.redcross.ca/page/100227/donate/1?_gl=1*li75g9*_ga*MTYxMTE4MjA2Ni4xNjQ0NjE1NDcw*_ga_376D8LHM0R*MTY0NTc5MzU5MC4xMi4wLjE2NDU3OTM1OTAuMA..&amp;_ga=2.8498675.712879640.1645730482-1611182066.1644615470\">Donate to the Ukraine Humanitarian Crisis Appeal</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the crisis in Ukraine</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/04/prime-minister-travel-united-kingdom-latvia-germany-and-poland\">Prime Minister to travel to the United Kingdom, Latvia, Germany, and Poland</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/07/prime-minister-concludes-successful-visit-united-kingdom\">Prime Minister concludes successful visit to the United Kingdom</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/08/prime-minister-concludes-successful-bilateral-visit-latvia\">Prime Minister concludes successful bilateral visit to Latvia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/03/09/prime-minister-participates-successful-visit-germany\">Prime Minister participates in successful visit to Germany</a></li>\n</ul></div>\n      "
}