{
  "path": "/en/news/news-releases/2019/05/10/government-canada-partners-municipalities-build-better-lives",
  "pageTitle": "The Government of Canada partners with municipalities to build better lives for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Whether getting busy parents home sooner, building recreation centres for young people, or helping communities adapt to climate change, investments in local infrastructure create good, middle class jobs and make our cities and towns better places to live.</p>\n\n<p>The Prime Minister, Justin Trudeau, today visited Edmonton, Alberta, to highlight a one-time Municipal Infrastructure Top-Up in Budget 2019. The Top-Up will double this year’s federal transfer to municipalities in support of local infrastructure priorities. In 2018, Edmonton received over $51 million in federal funding for local infrastructure priorities. With the Top-Up this year, this funding is expected to increase to over $102 million.</p>\n\n<p>Edmonton is currently putting federal funding toward important projects, including building the Edmonton Downtown Community Arena and replacing its bus fleet with low emission vehicles. New funding from the Top-Up will allow the city to advance these and other key priorities, which could include expanding recreational facilities, upgrading transportation routes, and improving water and wastewater systems.</p>\n\n<p>By working more closely with municipalities, the Government of Canada is providing communities across the country with the tools they need to complete important infrastructure projects and make everyday life easier and more affordable for the middle class and people working hard to join it.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Since 2016, our government has invested in thousands of infrastructure projects across the country. This year, we are doubling funding for local priorities to help leaders like Mayor Iveson complete important infrastructure projects, create good, middle class jobs, and make our communities better places to live.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“This investment answers our call for the federal government to work directly with local government. It's a recognition of our local frontline expertise and ability to be a good partner in delivering projects that will directly contribute to the local economy and a better quality of life for Edmontonians.”</p>\n\n<footer class=\"default\">Don Iveson, Mayor of Edmonton</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>With many municipalities across Canada facing serious infrastructure needs, Budget 2019 proposes a one-time transfer of $2.2 billion through the federal Gas Tax Fund to address short-term priorities in municipalities and First Nations communities.</li>\n\t<li>Projects under this fund can be used for:\n\t<ul>\n\t\t<li>Productivity and economic growth – including highways and local roads, public transit, and regional and local airports</li>\n\t\t<li>Clean environment – including drinking water, wastewater, and community energy systems</li>\n\t\t<li>Strong cities and communities – including sport and recreation, cultural and tourism, and capacity building</li>\n\t</ul>\n\t</li>\n\t<li>The federal Gas Tax Fund delivers over $2&nbsp;billion every year to over 3,600&nbsp;communities across the country. In recent years, funding has supported approximately 4,000 projects each year.</li>\n\t<li>The Gas Tax Fund provides municipalities with the flexibility to allocate the funding according to their infrastructure priorities, as they see fit.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/plan/toc-tdm-en.html\">Budget 2019</a></li>\n\t<li><a href=\"https://www.infrastructure.gc.ca/plan/gtf-fte-eng.html\">Federal Gas Tax Fund</a></li>\n</ul></div>\n      "
}