{
  "path": "/en/news/news-releases/2018/10/01/prime-minister-canada-welcomes-new-united-states-mexico-canada",
  "pageTitle": "Prime Minister of Canada welcomes new United States-Mexico-Canada Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed an agreement-in-principle between Canada, the United States, and Mexico on a modernized trade agreement – the United States-Mexico-Canada Agreement (USMCA) – that will create good, well‑paying, middle class jobs, strengthen economic ties, and expand Canada’s trade in North America.</p><p>Following more than a year of negotiations, the three countries have reached understandings in key areas, including rules of origin for automotive manufacturing, agriculture, labour, intellectual property rights, culture, and dispute settlement. Further, Canada has ensured that any US Section 232 tariffs will not impact Canadian auto and auto parts exports. Canada has successfully preserved key elements of the original NAFTA, while building on the agreement to expand opportunity and improve protections for workers across North America. The resulting agreement offers crucial predictability and stability for Canadian businesses, investors, traders, workers, and innovators.</p><p>Throughout the negotiations, Canada’s approach has been constructive. Negotiating objectives remained clear: defend Canadians’ interests, uphold Canadian values, and fight for Canadian jobs and living standards within an agreement that is mutually beneficial for all three countries.</p><p>When implemented, the USMCA will help Canadians compete globally and prosper in a healthy, integrated North American economy. The Government of Canada will continue to engage with North American partners to finalize the details of an agreement that benefits all Canadians.</p><h2>Quote</h2><blockquote><p>“The agreement-in-principle we reached today is good for Canada, good for Canadian businesses, and most importantly, good for Canadian workers and their families. When this improved agreement is implemented, North American trade will be preserved and modernized for the 21st century – just as we set out to do.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>North America is home to more than 486 million people.</li><li>When the North American Free Trade Agreement came into effect on January&nbsp;1, 1994, it created the largest free trade region in the world at that time, generating economic growth and helping to raise the standard of living for the people of all three member countries.</li><li>The United States and Mexico are, respectively, Canada’s first- and third-largest merchandise trading partners in the world. Canada is respectively the second- and fifth-largest merchandise trading partner of the United States and Mexico, and the largest export market for the United States.</li><li>In 2017, trilateral trade reached nearly USD $1.1 trillion – more than a three-fold increase since 1993.</li><li>To reach this renewed trilateral trade understanding, the Prime Minister, Ministers, Parliamentarians, federal officials, Premiers, and industry representatives directly engaged political and business leaders in the United States to advocate on behalf of Canadians.</li><li>Since January 2016, “Team Canada” visited the United States more than 300 times, and made more than 500 individual contacts with American officials, including the President, the Vice-President, 16 United States Cabinet members, more than 310 members of Congress, and 60 governors and lieutenant governors.</li><li>To help guide negotiations, the Government of Canada consulted with Canadians from across the country and from all sectors and backgrounds about trade. Consultations included meetings with the provinces and territories, industry, unions, civil society, think tanks, academics, Indigenous peoples, women, youth, and the general public.</li></ul><h2>Associated Links</h2><ul><li><a href=\"https://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/index.aspx?lang=eng\">A new United States-Mexico-Canada Agreement</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/summary-sommaire.aspx?lang=eng\">Summary Backgrounder: United States-Mexico-Canada Agreement (USMCA)</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/agri.aspx?lang=eng\">Agriculture chapter</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/auto.aspx?lang=eng\">Automotive rules of origin summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/culture.aspx?lang=eng\">Cultural industries summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/enviro.aspx?lang=eng\">Environment chapter summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/ip-pi.aspx?lang=eng\">Intellectual property chapter summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/labour-travail.aspx?lang=eng\">Labour chapter summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/state-etat.aspx?lang=eng\">State-to-state dispute settlement chapter summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/dispute-differends.aspx?lang=eng\">Trade remedies and related dispute settlement (Chapter 19) summary</a></li><li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/usmca-aeumc/article-232.aspx?lang=eng\">U.S. Section 232 side letters summary</a></li></ul></div>\n      "
}