{
  "path": "/en/news/news-releases/2016/05/06/prime-minister-welcomes-twenty-third-annual-report-public-service",
  "pageTitle": "Prime Minister welcomes Twenty-Third Annual Report on the Public Service of Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today welcomed the Twenty-Third Annual Report to the Prime Minister on the Public Service of Canada from Michael Wernick, the Clerk of the Privy Council, Secretary to the Cabinet, and Head of the Public Service.&nbsp;</p>\n<p>The report outlines the Clerk’s priorities and expectations of the Public Service for the coming year, and emphasizes the need to improve mental health and well-being in the workplace, and boost efforts to attract, retain, and develop talented public servants.</p>\n<p>The report also highlights a number of success stories from the past year that made a real difference in the lives of Canadians, including efforts to:</p>\n<ul>\n<li>Work with partners at all levels – international, federal, provincial, territorial, and municipal – to bring Syrian refugees to Canada, and help them resettle as quickly as possible;</li>\n<li>Help move goods across the longest international border, at a rate of over $1 million per minute; and,</li>\n<li>Process 82 per cent of all tax returns electronically, making tax filing faster and easier for Canadians.</li>\n</ul>\n<p>The report is available on the Clerk of the Privy Council’s website: <a href=\"http://www.clerk.gc.ca/report\">www.clerk.gc.ca/report</a>.</p>\n<p><strong>Quote</strong></p>\n<p>“A modern, professional Public Service plays a vital role in our democracy. The Clerk is taking important steps to renew this important institution. By working together, I am confident that we can build an even better, more capable, and effective Public Service – one that addresses the needs and expectations of the Canadians we serve.”</p>\n<p><em>- Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Michael Wernick was appointed the 23<sup>rd</sup> Clerk of the Privy Council and Secretary to the Cabinet on January 22, 2016, by the Prime Minister to help the government deliver its agenda and to renew the Public Service.</li>\n<li>The Annual Report to the Prime Minister on the Public Service of Canada—a requirement under section 127 of the <em>Public Service Employment Act</em>—was first introduced in 1992.</li>\n<li>The Public Service of Canada is the country’s largest employer, with approximately 257,000 employees. It is also the country’s most diverse workforce, including administrative, scientific, engineering, medical, and enforcement professionals, among others.</li>\n</ul></div>\n      "
}