{
  "path": "/en/news/statements/2021/10/24/statement-prime-minister-united-nations-day",
  "pageTitle": "Statement by the Prime Minister on United Nations Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on United Nations Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/observances/un-day\">United Nations Day</a>, we join people around the world to commemorate the 76th anniversary of the founding of the United Nations (UN). We also reflect on the vital role that the UN plays to improve people’s well-being by creating a safer and more prosperous world for all.</p>\n\n<p>“Since its creation, the UN has contributed to making a real difference in the lives of millions of people around the world. From ending wars, to delivering humanitarian and development assistance, and strengthening multilateralism, it brings together all countries to take action to make a positive difference in people’s lives and for the planet. The UN continues to work to build a more effective, relevant, and accountable organization equipped to meet the challenges of the 21st century.</p>\n\n<p>“Canada has a long and proud history of working with the UN to help address important global challenges. We helped draft the UN Charter, and resolve the Suez Canal crisis. We have championed human rights, worked on advancing gender equality, and taken part in peacekeeping missions in every corner of the world. We have also played a leadership role in helping fight diseases around the world. Our support to UN entities, such as the WHO and UNICEF, has helped immunize more than half a billion children around the world. Canada is also working with UNAIDS to help end AIDS by 2030.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>“The world is facing simultaneous crises, including climate change and the COVID-19 pandemic, which have made inequalities worse, tested our resilience, and highlighted our collective shortcomings. These challenges remind us how interconnected and vulnerable we are, which is why we have to work together to find collective solutions to our shared problems. We are committed to achieving net-zero emissions by 2050. We have also strengthened our emissions reduction targets to between 40 and 45 per cent below 2005 levels by 2030. Since the start of the COVID-19 pandemic, Canada has mobilized more than $2.5 billion in international assistance, and taken actions to address the unfair distribution of vaccines. We are working to achieve the <a href=\"https://sdgs.un.org/goals\">Sustainable Development Goals</a> at home and abroad to help make the world healthier, more peaceful, and more prosperous for all.&nbsp;</p>\n\n<p>“On behalf of the Government of Canada, I invite all Canadians to join me to celebrate United Nations Day and recognize the international organization’s important work to promote peace, human rights, and social progress around the world.”</p></div>\n      "
}