{
  "path": "/en/news/statements/2016/03/10/us-canada-joint-statement-climate-energy-and-arctic-leadership",
  "pageTitle": "U.S.-Canada Joint Statement on Climate, Energy, and Arctic Leadership | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>President Barack Obama and Prime Minister Justin Trudeau share a common vision of a prosperous and sustainable North American economy, and the opportunities afforded by advancing clean growth.&nbsp; They emphasize and embrace the special relationship between the two countries and their history of close collaboration on energy development, environmental protection, and Arctic leadership.&nbsp; The two leaders regard the Paris Agreement as a turning point in global efforts to combat climate change and anchor economic growth in clean development.&nbsp; They resolve that the United States and Canada must and will play a leadership role internationally in the low carbon global economy over the coming decades, including through science-based steps to protect the Arctic and its peoples. Canada and the U.S. will continue to respect and promote the rights of Indigenous peoples in all climate change decision making. Furthermore, the leaders emphasize the importance of the U.S. and Canada continuing to cooperate closely with Mexico on climate and energy action and commit to strengthen a comprehensive and enduring North American climate and energy partnership.</p>\n<p><strong>Implementing the Paris Agreement</strong></p>\n<p>Canada and the U.S. will work together to implement the historic Paris Agreement, and commit to join and sign the Agreement as soon as feasible.&nbsp; As we implement our respective Intended Nationally Determined Contributions (INDCs), the leaders also commit to, in 2016, completing mid-century, long-term low greenhouse gas emission development strategies pursuant to the Paris Agreement and encouraging this approach with members of the G-20.</p>\n<p>Canada and the U.S. will work with developing country partners to assist in implementation of their INDCs and strengthening their adaptation efforts.&nbsp; Both countries will strive to enhance the effectiveness of adaptation assistance by coordinating support for adaptation planning and action through the National Adaptation Plans Global Network. &nbsp;The leaders also commit to working closely to promote the full implementation of the enhanced transparency framework with common modalities, procedures and guidelines under the Paris Agreement.&nbsp; They affirm their support for the new Capacity Building Initiative for Transparency, designed to enhance institutional and technical capacity to meet transparency requirements.</p>\n<p>Recognizing the role that carbon markets can play in helping countries achieve their climate targets while also driving low-carbon innovation, both countries commit to work together to support robust implementation of the carbon markets-related provisions of the Paris Agreement.&nbsp; The federal governments, together and in close communication with states, provinces and territories, will explore options for ensuring the environmental integrity of transferred units, in particular to inform strong INDC accounting and efforts to avoid “double-counting” of emission reductions.&nbsp; They will also encourage sub-national governments to share lessons learned about the design of effective carbon pricing systems and supportive policies and measures.&nbsp; The countries will expand their collaboration in this area over time.</p>\n<p><strong>Coordinated domestic climate action&nbsp; </strong></p>\n<p>Building on a history of working together to reduce air emissions, Canada and the U.S., commit to take action to reduce methane emissions from the oil and gas sector, the world’s largest industrial methane source, in support of achieving our respective international climate change commitments. To set us on an ambitious and achievable path, the leaders commit to reduce methane emissions by 40-45 percent below 2012 levels by 2025 from the oil and gas sector, and explore new opportunities for additional methane reductions. The leaders also invite other countries to join the target or develop their own methane reduction goal. To achieve this target, both countries commit to:</p>\n<ul>\n<li><em>Regulate existing sources of methane emissions in the oil and gas sector:</em></li>\n<ul>\n<li>The U.S. Environmental Protection Agency (EPA) will begin developing regulations for methane emissions from existing oil and gas sources immediately and will move as expeditiously as possible to complete this process. Next month, EPA will start a formal process to require companies operating existing methane emissions sources to provide information to assist in development of comprehensive standards to decrease methane emissions.</li>\n<li>Environment and Climate Change Canada will also regulate methane emissions from new and existing oil and gas sources. Environment and Climate Change Canada will move, as expeditiously as possible, to put in place national regulations in collaboration with provinces/territories, Indigenous Peoples and stakeholders. Environment and Climate Change Canada intends to publish an initial phase of proposed regulations by early 2017.</li>\n</ul>\n<li><em>Work collaboratively on federal measures to reduce methane emissions</em>: Building on the U.S.-Canada Air Quality Agreement, both countries will work collaboratively on programs, policies, and strategies, and share experiences on reducing oil and gas methane emissions as they implement their respective federal regulations, beginning this year. &nbsp;</li>\n<li><em>Improve data collection, transparency, and R&amp;D and share knowledge of cost-effective methane reduction technologies and practices</em>: To ensure our actions are based on the best available data and technology, Canada and the U.S. will work together to improve methane data collection and emissions quantification, and transparency of emissions reporting in North America, and share knowledge of cost-effective methane reduction technologies and practices.</li>\n<li><em>Jointly endorse the World Bank’s Zero Routine Flaring by 2030 Initiative</em>:&nbsp; Reflecting their increasing concern about the climate, environment, and energy security impacts of oil and gas flaring, particularly in sensitive regions such as the Arctic, the U.S. and Canada commit to jointly endorse the World Bank’s Zero Routine Flaring by 2030 Initiative, and report annually on progress. &nbsp;</li>\n</ul>\n<p>Both Canada and the U.S. affirm their commitment to reduce use and emissions of hydrofluorocarbons (HFCs) using their respective domestic frameworks&nbsp;and will propose new actions in 2016. &nbsp;Canada and the U.S. are both demonstrating leadership by updating their public procurement processes to transition away from high global warming potential HFCs, whenever feasible, through government purchase of more sustainable and greener equipment and products.</p>\n<p>Recognizing the excellent collaboration between Canada and the U.S. to establish world-class, aligned regulations and programs to improve the fuel efficiency and reduce greenhouse gas and air pollutant emissions from on-road vehicles, the leaders reaffirm their commitment to continue this strong collaboration towards the finalization and implementation of a second phase of aligned greenhouse gas emission standards for post-2018 model year on-road heavy-duty vehicles.&nbsp; The two countries are currently implementing aligned requirements for greenhouse gas emission standards for cars and light trucks and the leaders commit to continue close collaboration in conducting mid-term evaluations of the applicable standards for the 2022-2025 model years to ensure further acceleration of the improvement of vehicle efficiency and zero emission technologies</p>\n<p>Given the integrated nature of many aspects of the U.S. and Canadian economies, alignment of analytical methods for assessing and communicating the impact of direct and indirect GHG emissions of major projects, and of measures to reduce those emissions, can be mutually beneficial.&nbsp; Canada and the U.S. will align approaches, reflecting the best available science for accounting for the broad costs to society of the GHG emissions that will be avoided by mitigation measures, including using similar values for the social cost of carbon and other GHGs for assessing the benefits of regulatory measures.</p>\n<p><strong>Advancing climate action globally</strong></p>\n<p>Beyond the Paris Agreement and areas of coordinated domestic climate action, President Obama and Prime Minister Trudeau underline the important opportunities to make further progress on climate action globally.</p>\n<p>The U.S. and Canada affirm their commitment to adopt a Montreal Protocol HFC phasedown amendment in 2016, and upon adoption to provide increased financial support to the Protocol’s Multilateral Fund to help developing countries implement a phase-down. The U.S. and Canada will continue to support a range of activities that promote alternatives to high global warming potential HFCs and promote greener technologies, including in those countries facing challenges such as high ambient temperatures.</p>\n<p>The leaders express their strong commitment to work together and through the International Civil Aviation Organization (ICAO) to reduce emissions from international aviation by fostering technological and operational advancements, implementing&nbsp;the new carbon standard for airplanes, and adopting in 2016 a carbon offset measure that will allow for carbon neutral growth from international civil aviation.&nbsp; They encourage world leaders to join them in supporting adoption of the carbon offset measure at ICAO's fall 2016 Assembly.</p>\n<p>The leaders will also work together and with other countries to encourage robust leader-level G-20 commitments to improve the environmental performance of heavy-duty vehicles, including through the implementation of stringent domestic regulations on fuel efficiency and/or greenhouse gas emissions, air pollutant emissions and low-sulphur fuels and green freight programs. They will also pursue G-20 commitments to reduce emissions of methane, including through private sector commitments and voluntary mechanisms such as the Oil and Gas Methane Partnership.&nbsp;</p>\n<p>Recognizing the particular impact of climate change on countries already dealing with conflict and fragility, the leaders commit to addressing the intersection of climate change and security as an issue for foreign, defense, and development policies.&nbsp;Through the G-7 working group on climate and security and elsewhere, both sides will work together to support sound analysis, practical recommendations, and meaningful cooperation to address climate-fragility risks.</p>\n<p><strong>Cooperation on clean energy</strong></p>\n<p>Building on the strong and ongoing efforts by energy ministers under institutional arrangements such as the Canada-U.S. bilateral framework on energy cooperation, the North American Energy Ministers’ recent understanding on Climate Change and Energy Cooperation, Mission Innovation, the Clean Energy Ministerial, and the Regulatory Cooperation Council, the leaders reaffirm their commitment to working together to strengthen North American energy security, phase out fossil fuel subsidies, accelerate clean energy development to address climate change and to foster sustainable energy development and economic growth.&nbsp; Specifically, the leaders pledge to enhance efforts in the following areas:</p>\n<ul>\n<li><em>Facilitate the integration of renewables on </em><em>our interconnected grids</em>: jointly study, identify, and implement options for broad integration, including how to bring more wind, solar, hydro and other renewable energy online.</li>\n<li><em>Align energy efficiency standards and expand shared labeling programs</em>: better align and further improve appliance and equipment efficiency standards by 2020 and expand cooperation on the ENERGY STAR program.</li>\n<li><em>Accelerate clean energy and clean technology innovation</em>: leverage participation in Mission Innovation, and strengthen collaboration on clean energy research and development for: reducing methane emissions; improving electrical grids; accelerating electric vehicle development and integration; unconventional oil and gas; carbon capture, use and storage; and, new cutting-edge technologies.&nbsp;</li>\n<li><em>Advance global efforts to accelerate clean energy</em>: partner to help to lead important multi-lateral efforts such as Mission Innovation and the Clean Energy Ministerial and its initiatives.</li>\n<li><em>Develop a joint U.S.-Canadian strategy for strengthening the security and resilience of the North American electricity grid</em>: work together to strengthen the security and resilience of the electric grid, including against the growing threat from cyber-attacks and climate change impacts.</li>\n</ul>\n<p><strong>A shared Arctic leadership model</strong></p>\n<p>Beyond deepening cooperation to reduce greenhouse gas emissions – which will have an outsized impact on the long-term health of the global Arctic – President Obama and Prime Minister Trudeau are announcing a new partnership to embrace the opportunities and to confront the challenges in the changing Arctic, with Indigenous and Northern partnerships, and responsible, science-based leadership. Arctic communities rest on the territories of Indigenous peoples, who possess a wealth of knowledge, distinct ways of life, and a richness of cultural diversity. It is home to natural marine, land and air migrations that know no borders. It is also the frontline of climate change. Acting for a shared future, we call on all Arctic nations and those with Arctic interests to embrace a new future for Arctic leadership, with our four objectives:</p>\n<p><em>Conserving Arctic biodiversity through science-based decision making.</em> Canada and the U.S. re-affirm our national goals of protecting at least 17% of land areas and 10% of marine areas by 2020. We will take concrete steps to achieve and substantially surpass these national goals in the coming years. Specifically, we will work directly with Indigenous partners, state, territorial and provincial governments to establish this year a new, ambitious conservation goal for the Arctic based on the best available climate science and knowledge, Indigenous and non-Indigenous alike. We will also play a leadership role in engaging all Arctic nations to develop a pan-Arctic marine protection area network.</p>\n<p><em>Incorporating Indigenous science and traditional knowledge into decision-making.</em> Canada and the U.S. are committed to collaborating with Indigenous and Arctic governments, leaders, and communities to more broadly and respectfully include Indigenous science and traditional knowledge into decision making, including in environmental assessments, resource management, and advancing our understanding of climate change and how best to manage its effects.</p>\n<p><em>Building a sustainable Arctic economy.</em> We confirm that for commercial activities in the Arctic - including shipping, fishing, and oil and gas exploration and development - we will set a world-class standard by basing development decisions and operations on scientific evidence. Further, commercial activities will occur only when the highest safety and environmental standards are met, including national and global climate and environmental goals, and Indigenous rights and agreements. Canada and the U.S. will work to develop this year a shared and science-based standard for considering the life-cycle impacts of commercial activities in the Arctic.</p>\n<ul>\n<li><em>Low impact shipping corridors: </em>We will work together to establish consistent policies for ships operating in the region, taking into account important ecological and cultural areas, vessel traffic patterns, Indigenous and Northern Arctic input, and increased cooperation of our Coast Guards. The two countries will also work together to share assessments of navigation data quality and capacities for supporting safe and low-impact shipping in the Beaufort Sea. In addition, we will determine with Arctic partners how best to address the risks posed by heavy fuel oil use and black carbon emissions from Arctic shipping.</li>\n<li><em>Abundant Arctic fish: </em>The leaders call for a binding international agreement to prevent the opening of unregulated fisheries in the Central Arctic Ocean to preserve living marine resources and promote scientific research in the region. Canada offers to host the next round of negotiations, to continue momentum and build on a precautionary, science-based principle to commercial fishing that both countries have put in place in their Arctic waters.</li>\n<li><em>Science-based approach to oil and gas: </em>If oil and gas development and exploration proceeds, activities must align with science-based standards between the two nations that ensure appropriate preparation for operating in Arctic conditions, including robust and effective well control and emergency response measures.</li>\n</ul>\n<p><em>Supporting strong Arctic communities.</em> We commit to defining new approaches and exchanging best practices to strengthen the resilience of Arctic communities and continuing to support the well-being of Arctic residents, in particular respecting the rights and territory of Indigenous peoples. All Indigenous Peoples in the Arctic are vital to strengthening and supporting U.S. and Canadian sovereignty claims. We commit to working in partnership to implement land claims agreements to realize the social, cultural and economic potential of all Indigenous and Northern communities. With partners, we will develop and share a plan and timeline for deploying innovative renewable energy and efficiency alternatives to diesel and advance community climate change adaptation. We will do this through closer coordination among Indigenous, state, provincial, and territorial governments and the development of innovative options for housing and infrastructure. We also commit to greater action to address the serious challenges of mental wellness, education, Indigenous language, and skill development, particularly among Indigenous youth.&nbsp;</p>\n<p>In moving forward, we welcome the upcoming White House Arctic Science Ministerial this fall, which will bring together Science Ministers from nations with Arctic interests, and the twentieth anniversary of the Ottawa Declaration, which established the Arctic Council in 1996. Canada and the U.S. commit to a regular bilateral dialogue to ensure progress towards the realization of these objectives, to continuing their strong cooperation on scientific work and research, and to advancing our shared Arctic leadership model through the Arctic Council.&nbsp;</p></div>\n      "
}