{
  "path": "/en/news/statements/2021/08/01/statement-prime-minister-emancipation-day",
  "pageTitle": "Statement by the Prime Minister on Emancipation Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Emancipation Day:</p>\n\n<p>“On this day in 1834, the British Parliament’s <em>Slavery Abolition Act</em>, 1833, came into effect and laid the pathway to freeing enslaved people of African descent across most of the British Empire. Since then, many people of African descent and their allies commemorate August 1 as Emancipation Day, an important milestone on the quest for freedom, justice, and equality.</p>\n\n<p>“Slavery existed in what is now Canada from the 16th century until its abolition in 1834 – Black people’s fight for freedom and emancipation in Canada was far from over. After slavery was abolished, people of African descent in Canada still had to face exclusion from public spaces, such as restaurants and theatres, as well as segregation in housing, schooling, and employment through specific laws and practices.</p>\n\n<p>“Despite the abolition of enslavement nearly two centuries ago, the legacy of anti-Black racism is still prevalent today, entrenched in our institutions, policies, and practices. Canada’s history of enslavement, racial segregation, and marginalization of people of African descent is a part of Canadian history that is often forgotten, functionally normalizing institutional and systemic forms of racism or rendering them invisible.</p>\n\n<p>“Today, Black Canadians continue to face prejudice, discrimination, and longstanding disparities in access to education, housing, and employment that limit their full and equal participation in society. The ongoing COVID-19 pandemic has only further highlighted the social, health, and economic&nbsp;disparities that undermine the livelihoods of Black Canadians and many other people in Canada.</p>\n\n<p>“Earlier this year, the House of Commons and the Senate voted unanimously to mark Emancipation Day on August 1. Today, we recognize and honour people of African descent for their courage, their determination, and their resilience in the face of the transatlantic slave trade’s devastating effects on their individual freedoms, families, and cultures. For Black Canadians, this day represents a culmination of decades of activism in Black and allied communities. It also demonstrates the themes of the International Decade for People of African Descent – recognition, justice, and development.</p>\n\n<p>“Thanks to a legacy of advocacy and dedication of Black Canadians, many strides have been made, but there is still much work to be done to ensure an equitable future for all Canadians. Through our&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/anti-racism-engagement/anti-racism-strategy.html\">Anti-Racism Strategy</a> and with the support of the&nbsp;<a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/federal-anti-racism-secretariat.html\">Federal Anti-Racism Secretariat</a>, we will continue to tackle anti-Black racism in Canada, and address important issues, such as economic inclusion, advancing justice reforms, modernizing policing standards and practices, and enhancing local community supports.</p>\n\n<p>“On Emancipation Day, we also take the opportunity to celebrate the achievements of Black Canadians and take part in community and cultural activities to learn more about their sacrifices for emancipation and freedom in Canada. Whether it is through culture, science, sports, or business, Black Canadians have made significant contributions across many domains of Canadian society.</p>\n\n<p>“Emancipation Day is a representation of social activism, justice, and our commitment to an equitable future. Today, we recommit ourselves to fighting anti-Black racism, xenophobia, racial discrimination, and related intolerance faced by people of African descent in Canada. On behalf of the Government of Canada, I encourage everyone to reflect on the contributions of Black Canadians, to learn more about the history of Emancipation Day, and to stand up against racism. Together, we will continue to build a better Canada for everyone.”</p></div>\n      "
}