{
  "path": "/en/news/news-releases/2021/10/06/prime-minister-announces-mandatory-vaccination-federal-workforce-and",
  "pageTitle": "Prime Minister announces mandatory vaccination for the federal workforce and federally regulated transportation sectors | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>From the beginning of the COVID-19 pandemic, we made a commitment to protect the health and safety of all Canadians. That is why we worked hard to deliver safe and effective vaccines and set the stage for a recovery that benefits everyone. Thanks to the millions of Canadians who rolled up their sleeves to get vaccinated, and now with 82 per cent of eligible Canadians fully vaccinated, Canada is a world leader on COVID-19 vaccinations. As the country’s largest employer, the Government of Canada will continue to play a leadership role in protecting the safety of our workplaces, our communities, and all Canadians by ensuring that as many of them as possible are fully vaccinated.</p>\n\n<p>The Prime Minister, Justin Trudeau, and the Deputy Prime Minister, Chrystia Freeland, today announced details of the government’s plans to require COVID-19 vaccination across the federal public service and federally regulated transportation sectors.</p>\n\n<p>Under the new policy, federal public servants in the Core Public Administration, including members of the Royal Canadian Mounted Police, will be required to confirm their vaccination status by October 29, 2021. Those who are unwilling to disclose their vaccination status or to be fully vaccinated will be placed on administrative leave without pay as early as November 15, 2021.</p>\n\n<p>Employers in the federally regulated air, rail, and marine transportation sectors will have until October 30, 2021, to establish vaccination policies that ensure employees are vaccinated. Effective October 30, 2021, travellers departing from Canadian airports, and travellers on VIA Rail and Rocky Mountaineer trains, will be required to be fully vaccinated, with very limited exceptions. The government is working with industry and key partners to put a strict vaccine requirement in place for cruise ships before the resumption of the 2022 cruise season.</p>\n\n<p>Crown corporations and separate agencies are being asked to implement vaccine policies mirroring the requirements announced today for the rest of the public service. The Acting Chief of the Defence Staff will also issue a directive requiring vaccination for the Canadian Armed Forces. The government will keep working with employers in other federally regulated workplaces to ensure vaccination is prioritized for workers in these sectors.</p>\n\n<p>By requiring vaccination from federal public servants, travellers, and employees in federally regulated transportation sectors, the Government of Canada will reduce the risk of COVID-19, prevent future outbreaks, and better protect the health of Canadians. Vaccination continues to be a priority for the government as we work to ensure a strong economic recovery and build a safer and healthier Canada for everyone.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Vaccines are the most effective tool against COVID-19, and countless Canadians – including many public servants – have already done their part and gotten their shots. But no one is safe until everyone is safe. We have enough doses in Canada for every person to be fully vaccinated across the country, so I encourage all Canadians who haven’t been vaccinated to book their shot today. Together, we will finish the fight against COVID-19.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The best economic policy is a strong public health response, including encouraging vaccination for all eligible Canadians. As the country’s largest employer, the Government of Canada is leading by example. By requiring people who work in the public service to be fully vaccinated, we are putting the health and safety of public servants, their families, and their neighbours, first. This also protects the safety of anyone who enters a federal office to get the services they need. And we’re making sure travellers are safe, which will help hard-hit sectors recover. These responsible and practical actions will accelerate our economic recovery and give businesses valuable confidence that our strong economy is less vulnerable to COVID-19-related lockdowns.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“The requirements announced today bring us one step closer to ensuring that every public servant who is able to be vaccinated, is vaccinated. We’ll be able to count on vaccination as an extra layer of protection in communities where our employees live and work, where Canadians access federal government services, and when we travel. Any public servant who has not yet received their first dose should get vaccinated now.”</p>\n\n<footer class=\"default\">The Hon. Jean-Yves Duclos, President of the Treasury Board</footer>\n</blockquote>\n\n<blockquote>\n<p>“Vaccines are the best way to keep each other safe. Requiring travellers and employees to be vaccinated ensures that everyone who travels and works in the transportation industry will better protect each other and keep Canadians safe.”</p>\n\n<footer class=\"default\">The Hon. Omar Alghabra, Minister of Transport</footer>\n</blockquote>\n\n<blockquote>\n<p>“Vaccines are the best way to protect people from COVID-19 and end this pandemic. Throughout this crisis, federal public servants have gone above and beyond to deliver help to Canadians at an unprecedented speed. Our government will continue to use all means at our disposal to protect them and all Canadians.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, President of the Queen’s Privy Council for Canada and Minister of Intergovernmental Affairs</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Core Public Administration comprises departments and organizations named in Schedules I and IV of the&nbsp;<a href=\"http://laws-lois.justice.gc.ca/eng/acts/F-11/\"><em>Financial Administration Act</em></a>. The requirement for employees to be vaccinated applies whether they are teleworking, working remotely, or working on‑site. Contracted personnel who require access to federal government worksites will also need to be vaccinated.</li>\n\t<li>Employees unable to be vaccinated due to prohibited grounds under the <em><a href=\"https://laws-lois.justice.gc.ca/eng/acts/h-6/\">Canadian Human Rights Act</a></em>, such as a medical contraindication, may request accommodation.</li>\n\t<li>Employees have an obligation to provide a true attestation. Failure to do so would constitute a breach of the <a href=\"https://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=25049\">Values and Ethics Code for the Public Sector</a> and may result in disciplinary action up to and including termination.</li>\n\t<li>The Government of Canada strongly advises any Canadians planning to travel by plane or train in the coming weeks to get vaccinated as soon as possible or they will be unable to travel.</li>\n\t<li>There will be a short transition period during which travellers not yet fully vaccinated will be able to travel if they can show a negative COVID-19 molecular test within 72 hours of travel. This transition period will end on November 30, 2021.</li>\n\t<li>There will be very limited exceptions to the vaccination requirement for travellers to address the realities of remote, fly-in communities; emergency travel; and exceptional medical reasons.</li>\n\t<li>The Government of Canada is committed to engaging with Indigenous groups, provinces, and territories to ensure that unvaccinated Canadians living in remote communities will still be able to obtain essential services in support of their medical, health, or social well-being, and return safely to their communities.</li>\n\t<li>There will be consequences for travellers caught falsifying documentation, as well as for transportation operators who don’t comply.</li>\n\t<li>These plans were informed by engagement with key stakeholders, including bargaining agents, other employers, operators, and the Office of the Privacy Commissioner.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/treasury-board-secretariat/news/2021/10/backgrounder-covid-19-vaccine-requirement-for-the-federal-workforce.html\">COVID-19 vaccine requirement for the federal workforce</a></li>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2021/10/mandatory-covid-19-vaccination-requirements-for-federally-regulated-transportation-employees-and-travellers.html\">Mandatory COVID-19 vaccination requirements for federally regulated transportation employees and travellers</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/government/publicservice/covid-19/vaccination-public-service.html\">COVID-19 vaccination for federal public servants</a></li>\n\t<li><a href=\"https://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=32694\">Policy on COVID-19 Vaccination for the Core Public Administration Including the Royal Canadian Mounted Police</a></li>\n\t<li><a href=\"https://www.canada.ca/en/treasury-board-secretariat/news/2021/08/government-of-canada-to-require-vaccination-of-federal-workforce-and-federally-regulated-transportation-sector.html\">Government of Canada to require vaccination of federal workforce and federally regulated transportation sector</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid/travel-restrictions/covid-vaccinated-travellers-entering-canada\">COVID-19 vaccinated travellers entering Canada</a></li>\n</ul></div>\n      "
}