{
  "path": "/en/news/news-releases/2019/02/12/prime-minister-announces-public-transit-improvements-winnipeg",
  "pageTitle": "Prime Minister announces public transit improvements in Winnipeg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>In 2016, the Government of Canada launched the biggest infrastructure plan in Canadian history. Since then, we have invested in and approved thousands of infrastructure projects, including 51 public transit projects in Manitoba. These projects play a key role to reduce long commute times and create more inclusive communities where everyone has access to the services and opportunities they need to thrive.</p><p>The Prime Minister, Justin Trudeau, today announced an investment of more than $2.5&nbsp;million to improve public transit services in Winnipeg, Manitoba, through vital upgrades to the city’s bus maintenance facility. This project will provide much needed improvements, make the 50-year old facility more energy-efficient, and support good, middle class jobs. The upgrades will help maintain and repair buses and keep the transit system running smoothly for Winnipeg residents.</p><p>Once completed, these improvements will help better position Winnipeg Transit to offer reliable, safe, and efficient public transportation that meets the needs of Winnipeg’s communities, today and into the future.</p><h2>Quotes</h2><blockquote><p>“Every community should have the infrastructure it needs to grow and prosper. Today’s investment will help Winnipeg residents get where they need to go quickly, safely, and efficiently, while protecting the environment and creating good, middle class jobs. We will continue to invest in Manitoba’s future, and support projects that create new opportunities for people and businesses across Canada.”<br><i>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></i></p></blockquote><blockquote><p>“Investing in public transit infrastructure is key to build sustainable communities, encourage economic growth, and strengthen the middle class. I’m very proud of our ongoing investments in this bus maintenance facility, which will help Winnipeg continue to provide safe and reliable public transportation services as ridership increases.”<br><i>—<cite>The Hon. François-Philippe Champagne, Minister of Infrastructure and Communities</cite></i></p></blockquote><h2>Quick Facts</h2><ul><li>The project involves the replacement of the maintenance facility’s roof and ventilation system, the installation of new overhead doors for the truck servicing bay, the replacement of up to four hoists, and the purchase of new transit shop equipment.</li><li>The Government of Canada will contribute over $2.5 million through the Public Transit Infrastructure Fund, and the City of Winnipeg will also contribute more than $2.5 million.</li><li>The Public Transit Infrastructure Fund is part of the Investing in Canada infrastructure plan, through which the Government of Canada will invest more than $180 billion over 12&nbsp;years in public transit infrastructure, green infrastructure, social infrastructure, trade and transportation routes, and Canada’s rural and northern communities.</li><li>More than $28 billion of this funding will support public transit projects, including $5&nbsp;billion that will be available for investment through the Canada Infrastructure Bank.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.infrastructure.gc.ca/plan/icp-publication-pic-eng.html\">Investing in Canada: Canada’s Long-Term Infrastructure Plan</a></li><li><a href=\"http://www.infrastructure.gc.ca/map\">Investing in Canada Plan Project Map</a></li></ul></div>\n      "
}