{
  "path": "/en/news/news-releases/2017/10/11/prime-minister-concludes-visit-washington-dc",
  "pageTitle": "Prime Minister concludes visit to Washington, D.C. | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his visit to Washington, D.C., and will now travel to Mexico City for his first official visit to Mexico.</p><p>While in Washington, Prime Minister Trudeau took part in a keynote conversation with Pattie Sellers at the 2017 Fortune Most Powerful Women Summit. He stressed the importance of gender equality and how women’s empowerment creates economic growth that benefits everyone.</p><p>The next day, the Prime Minister participated in a roundtable led by WomenOne to discuss solutions to the challenges women and girls face every day globally.</p><p>The Prime Minister then met with members of the U.S. House Committee on Ways and Means to discuss the vital trade and economic relationship between Canada and the United States.</p><p>Prime Minister Trudeau also met with United States President Donald J. Trump. The Prime Minister reiterated Canada’s commitment to modernize the North American Free Trade Agreement (NAFTA) for the benefit of all three partners – Canada, the U.S., and Mexico.</p><h2>Quote</h2><blockquote><p>“There is no relationship in the world quite like the Canada-U.S. relationship. Canadians and Americans know that we are all better off when we work together to grow the middle class and create prosperity on both sides of the border. Canada will continue to work with the U.S. to modernize NAFTA so that people in Canada, the United States, and Mexico can benefit from good, well-paying jobs and increased opportunities to provide for their families.”<br>—&nbsp;<cite>Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Canada and the United States share one of the largest trading relationships in the world. Bilateral trade between the two countries was valued at nearly $882&nbsp;billion in 2016.</li><li>Canada is the largest secure supplier of energy to the United States.</li><li>The two countries share the longest, secure border in the world, over which approximately 400,000 people and more than $2 billion worth of goods and services cross daily.</li><li>Canada is the number one export destination for most American states, and cross-border trade and investment support nearly nine million jobs in the United States.</li></ul><h2>Related product</h2><ul><li><a href=\"/en/news/news-releases/2017/10/03/prime-minister-travel-united-states-and-mexico\">Prime Minister to travel to the United States and Mexico</a></li></ul><h2>Associated link</h2><ul><li><a href=\"http://international.gc.ca/world-monde/united_states-etats_unis/relations.aspx?lang=eng\">Canada and United States Relations</a></li></ul></div>\n      "
}