{
  "path": "/en/news/readouts/2020/02/24/prime-minister-justin-trudeau-convenes-incident-response-group-discuss",
  "pageTitle": "Prime Minister Justin Trudeau convenes the Incident Response Group to discuss progress on ending blockades | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau convened the Incident Response Group to discuss ongoing work to end the blockades and restore fully functional rail service across Canada. Deputy Prime Minister Chrystia Freeland, Minister of Crown-Indigenous Relations Carolyn Bennett, Minister of Transport Marc Garneau, Leader of the Government in the House of Commons and Quebec Lieutenant Pablo Rodriguez, Minister of Public Safety and Emergency Preparedness Bill Blair, and Minister of Indigenous Services Marc Miller participated in the meeting, along with RCMP Commissioner Brenda Lucki and Government of Canada officials.</p>\n\n<p>The Prime Minister and Deputy Prime Minister updated the group on continued discussions with premiers to address the impacts that the blockades are having across the country on Canadians and the economy. They will remain in close contact with premiers to support coordinated efforts toward a peaceful and lasting resolution.</p>\n\n<p>Minister Garneau updated the group on the economic impacts of the blockades on farmers, businesses, and families in Canada. The group discussed measures being taken in coordination with provinces to ensure that critical needs are addressed across Canada, including propane, chemicals to treat drinking water, and essential agricultural products. Minister Bennett and Minister Miller discussed their ongoing outreach to Indigenous communities. Minister Blair reported that the RCMP had confirmed that as of 3 p.m. on Friday, February 21st, they completed the relocation of their base of operations to Houston Detachment and the Community-Industry Safety Office has been temporarily closed. He also provided an update on the police operation underway in Tyendinaga.</p>\n\n<p>The Prime Minister and ministers will continue to work directly with premiers and Indigenous leaders to resolve the situation as soon as possible. The Government of Canada remains focused on finding a peaceful and lasting resolution with the objective of ending the blockades in a way that protects the rule of law and builds trust and respect among all parties involved.</p></div>\n      "
}