{
  "path": "/en/news/news-releases/2023/01/25/his-majesty-king-abdullah-ii-jordan-visit-canada",
  "pageTitle": "His Majesty King Abdullah II of Jordan to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that His Majesty King Abdullah&nbsp;II of Jordan will visit Canada on January&nbsp;26 and&nbsp;27,&nbsp;2023.</p>\n\n<p>During the King’s visit, the two leaders will discuss issues of mutual interest, including promoting peace and regional security in the Middle East and countering violent extremism. They will explore opportunities to support and advocate for sustainable solutions to the conflicts in Syria and Iraq, the Israeli-Palestinian conflict, as well as the situation in Iran. They will discuss strengthening their commitment to protecting refugees, ensuring the delivery of humanitarian assistance, and advancing the right to education. Their conversations will also focus on cooperation around accountable governance, trade and economic growth, women’s economic empowerment, energy, and defence.</p>\n\n<p>The Prime Minister and the King will discuss the impacts of Russia’s illegal and unjustifiable invasion of Ukraine, including global food insecurity, which is felt more strongly by the most vulnerable and those already facing humanitarian crises.</p>\n\n<p>During the visit, the King will also meet with the Governor General of Canada, Her Excellency the Right Honourable Mary Simon.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“The partnership between Canada and Jordan is deep and enduring. I look forward to once again welcoming His Majesty King Abdullah&nbsp;II to Canada and discussing shared priorities so we can continue making progress on important issues, for the benefit of Canadians and Jordanians alike.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This will be His Majesty King Abdullah&nbsp;II’s sixth visit to Canada since his ascension to the throne in&nbsp;1999.</li>\n\t<li>Canada and Jordan work closely in multilateral forums, including the International Civil Aviation Organization (ICAO), the International Criminal Court&nbsp;(ICC), the Open Government Partnership, the United Nations, and the World Trade Organization.</li>\n\t<li>Canada and Jordan are both founding supporters of the “Christchurch Call to Action to Eliminate Terrorist and Violent Extremist Content Online.”</li>\n\t<li>Canada and Jordan are working alongside international partners in the Global Coalition against Daesh to address the threat of terrorism in the region.</li>\n\t<li>Canada has been an important trade and investment partner for Jordan since the implementation of the Canada-Jordan Free Trade Agreement.</li>\n\t<li>In 2021, Canadian merchandise exports totalled almost $59.6&nbsp;million and Canada’s merchandise imports from Jordan totalled $121.4&nbsp;million.</li>\n\t<li>Through development and humanitarian assistance programs, Canada supports the Government of Jordan’s efforts to provide a safe haven for Syrian refugees who have taken sanctuary in the country.</li>\n\t<li>Canada has remained a steady contributor to United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), in support of its mandate to provide assistance that benefits over 2.3&nbsp;million Palestinians registered in Jordan.</li>\n\t<li>Canada also works closely with Jordan to help resettle people fleeing ongoing crises in the region.&nbsp;Jordan offers a safe environment from which families can be processed for resettlement in Canada.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/jordan-jordanie/relations.aspx?lang=eng\">Canada-Jordan relations</a></li>\n\t<li><a href=\"http://international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/jordan-jordanie/fta-ale/background-contexte.aspx?lang=eng\">Canada-Jordan Free Trade Agreement</a></li>\n\t<li><a href=\"http://theglobalcoalition.org/en/home/\">The Global Coalition against Daesh</a></li>\n\t<li><a href=\"https://www.unrwa.org/\">United Nations Relief and Works Agency</a></li>\n</ul></div>\n      "
}