{
  "path": "/en/news/readouts/2021/02/25/prime-minister-justin-trudeau-speaks-prime-minister-ethiopia-abiy-ahmed",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Prime Minister of Ethiopia Abiy Ahmed | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister of Canada, Justin Trudeau, today spoke with the Prime Minister of Ethiopia, Abiy Ahmed.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Abiy discussed ongoing efforts in Canada and Ethiopia to fight the global COVID-19 pandemic, save lives, and support people and communities through the crisis. They agreed on the importance of continued international collaboration to ensure access to vaccines through such mechanisms as COVAX, the vaccines pillar of the Access to COVID-19 Tools (ACT) Accelerator.</p>\n\n<p>The two leaders spoke about the importance of building back better to ensure a strong economic recovery that benefits everyone. They agreed on the need for continued international collaboration to address debt and liquidity challenges associated with the economic impacts of COVID-19, including through the Financing for Development in the Era of COVID-19 and Beyond initiative at the United Nations.</p>\n\n<p>The prime ministers also discussed the situation in Ethiopia, including the importance of humanitarian access and human rights in the Tigray region. Prime Minister Trudeau welcomed efforts to expand access for humanitarian assistance and journalists, to restore critical services and infrastructure, and to protect people. Prime Minister Trudeau reaffirmed Canada’s support for ongoing reforms intended to consolidate durable, inclusive peace and democracy in Ethiopia.</p>\n\n<p>During the meeting, Prime Minister Trudeau and Prime Minister Abiy affirmed the deep and enduring friendship between Canada and Ethiopia, which was strengthened by Prime Minister Trudeau’s successful visit to Ethiopia and participation in the African Union Summit in February 2020, and ongoing collaboration as part of the coordinated global response to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/ethiopia-ethiopie/bilateral_relations_bilaterales/canada_ethiopia-ethiopie.aspx?lang=eng\">Canada-Ethiopia Relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/29/prime-minister-co-chairs-high-level-meeting-address-economic\">Prime Minister co-chairs high-level meeting to address economic devastation caused by COVID‑19 and announces new funding to fight the pandemic</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/11/statement-on-situation-in-ethiopia.html\">Statement by the Minister of Foreign Affairs on situation in Ethiopia</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/02/10/prime-minister-concludes-productive-visit-ethiopia-promote\">Prime Minister concludes productive visit to Ethiopia to promote partnerships</a></li>\n</ul></div>\n      "
}