{
  "path": "/en/news/news-releases/2019/04/02/prime-minister-announces-first-ever-canada-youth-summit",
  "pageTitle": "Prime Minister announces first-ever Canada Youth Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Young Canadians are serving their communities, challenging the status quo, and using their drive and creativity to shape our country for the better. The Government of Canada is working to make sure young people have the platform and opportunities they need to take the lead on building a better, more just, and more sustainable future.&nbsp;</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced that the first-ever Canada Youth Summit will be held in Ottawa, Ontario, on May 2 and 3, 2019. The Summit will bring together 300&nbsp;young people from every province and territory to discuss issues that matter to them, from protecting our environment and fighting climate change, to supporting good jobs and service opportunities, to building more equal and inclusive communities.</p>\n\n<p>Young Canadians play an important role in shaping the government’s priorities and decisions, and engaging and empowering young people helps our whole country move forward. With initiatives like the Canada Service Corps, young Canadians can learn valuable new skills, develop their strengths, and gain essential work experience. Through the new online Youth Digital Gateway platform announced in Budget 2019, it will be even easier for young people to find service placements that fit their interests, and share their experiences with others. The upcoming Summit will be another opportunity for young people to come together to learn, share their stories, and find new ways to create positive change.</p>\n\n<p>Young Canadians who would like to attend the Summit are invited to participate in the Youth Video Challenge. They can enter to win a trip to the Summit by posting a video on social media using the hashtag #InspiredToServe, capturing what service means to them and how it benefits their community, and submitting an online application.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Young Canadians are shaping a better future for all of us. You have deep compassion and big ideas about how to tackle the greatest challenges we face – and our government works hard every day to make sure you have the opportunities you need to make your voices heard. I look forward to connecting with all of you during our first-ever Canada Youth Summit to continue these important conversations, and raise the bar on what we can achieve together.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Young Canadians who have been invited to attend the two-day Summit at Carleton University in Ottawa were nominated because of their work on Canada’s Youth Policy, or by provinces, territories, and youth-serving organizations from across the country.</li>\n\t<li>Eligible Canadians from 18 to 24 years old who would like to participate in the Youth Video Challenge have until April 14 to share their video. Contestants must be at or over the age of majority in their home province.</li>\n\t<li>To enter, contestants must share video entries on social media and fill out an application form on the Youth Video Challenge website, including a link to their video. The winners will be announced by April 22 and will travel to Ottawa to attend the Canada Youth Summit.</li>\n\t<li>Budget 2019 proposes to introduce new programs and investments that will continue to prepare young Canadians for their future, and help them thrive in every stage of life.</li>\n\t<li>The Canada Service Corps was created to help young Canadians serve their communities while gaining valuable skills and leadership experience. Budget 2019 proposes additional funding for the Canada Service Corps, which will create up to 15,000 service placements for young Canadians in the next four years.</li>\n\t<li>Through Budget 2019, the government is also lowering interest rates on Canada Student Loans and Canada Apprentice Loans, and eliminating interest charges entirely during the six-month grace period. Together, these measures will save the average borrower approximately $2,000 over the lifetime of their loan and help make paying back student loans more affordable.</li>\n\t<li>Budget 2019 investments will also create up to 84,000 new student work placements per year by 2023-2024 to help young people learn new skills, build their resumes, and start their careers.</li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/services/canada-service-corps.html?utm_campaign=CanadaServiceCorps&amp;utm_source=SocialMedia_Print_Poster&amp;utm_medium=VanityUrl&amp;utm_term=en&amp;utm_content=canada-ca_canada-service-corps\">Canada Service Corps</a></li>\n\t<li><a href=\"https://www.canada.ca/en/youth/services/canada-youth-summit.html\">Canada Youth Summit</a></li>\n\t<li><a href=\"https://www1.canada.ca/en/contact/video_challenge.html\">Youth Video Challenge</a></li>\n\t<li><a href=\"https://www.canada.ca/en/campaign/prime-ministers-youth-council.html\">Prime Minister’s Youth Council</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2019/docs/youth-jeunes/youth-jeunes-en.html\">Budget 2019 - Investing in Young Canadians</a></li>\n</ul></div>\n      "
}