{
  "path": "/en/news/news-releases/2022/11/16/prime-minister-advances-indo-pacific-engagement-and-shared-priorities-g20",
  "pageTitle": "Prime Minister advances Indo-Pacific engagement and shared priorities at G20 Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the G20 Summit in Bali, Indonesia, where he worked with G20 leaders to drive progress on shared priorities, including ensuring energy and food security, improving global health, protecting the environment and fighting climate change, and building an economy that works for all Canadians. He also continued to condemn – in the strongest possible terms – Russia’s brutal and unjustifiable invasion of Ukraine, and reiterated Canada’s steadfast support for the Ukrainian people.</p>\n\n<p>Throughout the G20 Summit, the Prime Minister announced support to help make Canada an even more active and engaged partner in the Indo-Pacific, including by making investments to expand trade and investment to benefit Canadian businesses and their workers, promote security and stability in the region, increase pandemic resilience, and build a cleaner future for everyone.</p>\n\n<p>At the Summit,&nbsp;Prime Minister Trudeau announced that Canada will invest $750&nbsp;million to significantly expand FinDev Canada’s global efforts to meet demand for&nbsp;infrastructure&nbsp;and enhance the reach and impact of Canada’s private sector&nbsp;activities. The additional capital will enable FinDev to increase its engagement in&nbsp;the&nbsp;Indo-Pacific&nbsp;and&nbsp;help respond to the region’s massive infrastructure needs,&nbsp;address existing funding gaps, and support wider regional progress toward ending&nbsp;poverty, fighting climate change, and&nbsp;building a future that works for everyone.&nbsp;This&nbsp;will&nbsp;help&nbsp;improve lives, connect people, spur economic growth, and contribute to a&nbsp;cleaner&nbsp;future&nbsp;while offering&nbsp;Canadian expertise and a development model that is&nbsp;accountable&nbsp;and leaves no one behind.</p>\n\n<p>The&nbsp;Prime Minister made the&nbsp;announcement at a Partnership for Global Infrastructure and Investment event co-hosted by the President of the United States of America, Joe Biden, the President of the European Commission, Ursula von der Leyen, and the President of Indonesia, Joko Widodo.</p>\n\n<p>In Bali, Prime Minister Trudeau continued to push for ambitious action on climate change and the environment by urging countries to adopt a robust post-2020 Global Biodiversity Framework at COP15 in Montréal next month to halt biodiversity loss and ensure a healthy future. He emphasized the importance of increasing efforts to protect the environment, fight climate change, and protect peoples’ livelihoods from its devastating effects. He announced that Canada will provide:</p>\n\n<ul>\n\t<li>$20&nbsp;million to restore and protect mangroves in coastal communities in Indonesia, which will help prevent biodiversity loss and store carbon to fight climate change;</li>\n\t<li>$15&nbsp;million to support Indonesia’s efforts to scale-up its climate change adaptation and mitigation efforts in response to rising sea levels, environmental degradation, and biodiversity loss;</li>\n\t<li>$10&nbsp;million for the Oceans for Prosperity initiative to continue improving the sustainable management of coral reef ecosystems to support local communities in Indonesia; and</li>\n\t<li>$3&nbsp;million to help Indonesia restore coastal and marine ecosystems – essential carbon-storing ecosystems – to better adapt to and mitigate the impacts of climate change.</li>\n</ul>\n\n<p>The Prime Minister also highlighted recent progress in advancing negotiations toward a Canada-Indonesia Comprehensive Economic Partnership Agreement, which would create jobs and opportunities for people and businesses in both countries. This could include meaningful opportunities for Canadians across a broad range of sectors, including agriculture and agri-food, advanced manufacturing, clean tech, natural resources, and services. Canada and Indonesia launched negotiations in 2021 and held three rounds of negotiations in 2022.</p>\n\n<p>At the Business&nbsp;20 (B20) Summit, attended by private sector delegates from across the G20, Prime Minister Trudeau delivered a keynote address where he highlighted the potential emerging technologies have to cut pollution and grow the clean economy to benefit everyone. He also stressed the urgent need to accelerate the transition to clean energy, and underlined that Canada is rapidly becoming the provider of clean energy and clean technologies that the world needs, particularly in critical minerals, batteries, and electric vehicles.</p>\n\n<p>During the Summit, G7 Leaders and Indonesia issued a <a href=\"/en/news/statements/2022/11/15/joint-statement-new-just-energy-transition-partnership\">joint statement</a> announcing a new Just Energy Transition Partnership (JETP) with the Government of Indonesia to accelerate its clean energy transition in an inclusive way. Canada will allocate $550&nbsp;million to Indonesia from existing climate commitments under this new partnership. Canada is also contributing to coal phase-out and the clean energy transition in Indonesia through its commitment of $1&nbsp;billion to the Climate Investment Funds’ Accelerating Coal Transition Program, of which Indonesia was one of the first funding recipients.</p>\n\n<p>The COVID-19 pandemic has had devastating impacts, particularly on people in low- and middle-income countries. To further protect global health and prevent future pandemics, Prime Minister Trudeau announced a new commitment of $50&nbsp;million to the new Pandemic Fund – a key G20 initiative hosted by the World Bank – to help fill critical gaps in pandemic prevention, preparedness, and response capabilities in&nbsp;low- and middle-income countries in key areas like investing in the health care workforce and strengthening disease surveillance. He also announced a $15&nbsp;million allocation to manufacture mRNA vaccines and technologies in Africa, Asia, and Latin America, building on $15&nbsp;million in Canadian funding announced at the G20 Summit in 2021, and a $15&nbsp;million allocation to increase the manufacturing of and equitable access to vaccines for low- and middle-income countries in the Americas.</p>\n\n<p>At the G20, Prime Minister Trudeau announced an additional $500&nbsp;million to provide military support to the Armed Forces of Ukraine. He also announced new sanctions on 23 members of the Russian justice and security sectors involved in gross and systematic human rights violations against Russian opposition leaders. Throughout his meetings with G20 and guest leaders, he reiterated the importance of continuing to support Ukraine and remaining united in the face of Russian aggression.</p>\n\n<p>The Prime Minister also announced that Canada is extending the Canadian Armed Forces’ (CAF) training mission of recruits of the Armed Forces of Ukraine in the United Kingdom until the end of December 2023. This training began in August 2022, and is part of Operation UNIFIER.</p>\n\n<p>Given the presence of Russia at the G20 table, the Prime Minister used his G20 interventions to condemn Putin’s attacks on Ukraine and the rules-based international order. He also stressed the consequences of Russia’s aggression on people, and food and energy security, particularly in the Global South. We continue to be steadfast in our support for Ukraine.</p>\n\n<p>On November 16, in response to Russia’s latest attacks on Ukrainian cities and civilian infrastructure, NATO and G7 Leaders issued a <a href=\"/en/news/statements/2022/11/16/joint-statement-nato-and-g7-leaders-margins-g20-summit-bali\">joint statement</a> reaffirming their steadfast support for Ukraine and their commitment to hold Russia accountable. Prime Minister Trudeau also held calls with the President of Ukraine, Volodymyr Zelenskyy, and the Prime Minister of the United Kingdom, Rishi Sunak, as well as the President of Poland, Andrzej Duda.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“On the world stage, Canada will always defend our values as we drive progress on the critical challenges of our time. When we work together, we can achieve great things – from ambitious climate action, to creating jobs, upholding peace and security, and driving economic growth that benefits everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the eighth G20 Summit attended by Prime Minister Trudeau.</li>\n\t<li>This was the second leg of the Prime Minister’s three-stop tour of the Indo-Pacific that also includes his participation in the Association of Southeast Asian Nations (ASEAN) Summit in Phnom Penh, Cambodia and the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting in Bangkok, Thailand. The Prime Minister will then travel to Djerba, Tunisia to participate in the 18th Summit of La Francophonie.</li>\n\t<li>The G20 is an important platform to discuss global economic, financial, and trade policy issues. G20 members are the world’s major economies and represent all inhabited continents, with 80 per cent of world GDP, 75 per cent of global trade, and 60 per cent of the world’s population.</li>\n\t<li>In Bali, the Government of Canada welcomed memorandums of understanding with local governments to respond to food security challenges in Indonesia, build infrastructure that will stimulate growth and create opportunities, and support deeper cooperation on counter-terrorism.</li>\n\t<li>To advance gender equality and the empowerment of women and girls, Canada is investing $10&nbsp;million for Build Back Equal in the Eastern Caribbean, working with UN Women to help address the unequal distribution of unpaid and domestic care work in communities and households, advance sexual and reproductive health and rights, and ensure care services are integrated in gender-responsive social protection systems.</li>\n\t<li>From November 14 to 16, Prime Minister Trudeau held bilateral meetings with the Prime Minister of the United Kingdom, Rishi Sunak, and the Prime Minister of Italy, Giorgia Meloni.</li>\n\t<li>The Prime Minister also held a pull-aside meeting with the President of South Korea, Yoon Suk Yeol.</li>\n\t<li>During the B20 Summit, the Prime Minister met with major business executives, including Seiji Izumisawa, President and CEO of Mitsubishi Heavy Industries Ltd.</li>\n\t<li>Canada last hosted the G20 in 2010. Indonesia holds the presidency in 2022, and India will hold it in 2023.</li>\n\t<li>The G20 includes Argentina, Australia, Brazil, Canada, China, Germany, the European Union, France, India, Indonesia, Italy, Japan, Mexico, Russia, Saudi Arabia, South Africa, South Korea, Turkey, the United Kingdom, and the United States of America. Spain, Singapore, the Netherlands, and the United Arab Emirates were invited by Indonesia to participate in the G20 as guests this year.</li>\n\t<li>Indonesia is the world’s 4th most populous country, a G20 economy, and offers vast opportunities for mutually beneficial trade with Canada. Indonesia is Canada’s largest export market in Southeast Asia, with two-way bilateral merchandise trade of $4.2&nbsp;billion in 2021.</li>\n\t<li>A Canada-Indonesia Comprehensive Economic Partnership Agreement could increase Canada’s GDP by $328&nbsp;million and exports to Indonesia by $446.5&nbsp;million.</li>\n\t<li>In August 2022, the Government of Canada announced the deployment of Canadian Armed Forces (CAF) members under Operation UNIFIER to provide training to the Armed Forces of Ukraine in the United Kingdom, in collaboration with the United Kingdom’s Operation INTERFLEX. The approximately 170 CAF personnel who deployed in late August have trained a total of 400 Armed Forces of Ukraine recruits and will graduate another tranche of approximately 400 members on November 21, 2022.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/11/16/canadian-investments-indo-pacific-and-g20-priorities\">Backgrounder: Canadian investments in the Indo-Pacific and&nbsp;G20 priorities</a></li>\n\t<li><a href=\"/en/news/statements/2022/11/15/joint-statement-new-just-energy-transition-partnership\">Joint Statement on new Just Energy Transition Partnership</a></li>\n\t<li><a href=\"/en/news/statements/2022/11/16/joint-statement-nato-and-g7-leaders-margins-g20-summit-bali\">Joint Statement of NATO and G7 Leaders on the margins of the G20 Summit in Bali</a></li>\n\t<li><a href=\"/en/news/readouts/2022/11/14/prime-minister-justin-trudeau-meets-president-and-ceo-mitsubishi-heavy\">Prime Minister Justin Trudeau meets with President and CEO of Mitsubishi Heavy Industries Limited Seiji Izumisawa</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/13/prime-minister-strengthens-ties-asean-and-expands-partnerships-indo\">Prime Minister strengthens ties with ASEAN and expands partnerships in the Indo-Pacific</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/11/14/prime-minister-announces-additional-military-assistance-ukraine-and\">Prime Minister announces additional military assistance for Ukraine and additional sanctions against Russia</a></li>\n\t<li><a href=\"https://www.g20.org/bali-summit/\">G20 Indonesia&nbsp;2022</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p></div>\n      "
}