{
  "path": "/en/news/statements/2020/07/16/joint-communique-safe-restart-agreement",
  "pageTitle": "Joint Communiqué – Safe Restart Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada’s First Ministers today issued the following joint statement:</p>\n\n<p>“Governments in Canada, backed by efforts by individual Canadians, have taken measures to successfully slow and contain the spread of COVID-19, including through strong and continued federal/provincial/territorial (FPT) collaboration. First Ministers agreed in our joint statement of April 28, 2020, on principles to safely restore economic activity, while protecting the health of Canadians.</p>\n\n<p>“Today, First Ministers agreed to an FPT Safe Restart Agreement, supported by over $19 billion in federal investments, to help provinces and territories restart the economy over the next six to eight months while making Canada more resilient to possible future waves of the virus.</p>\n\n<p>“Funding under the Safe Restart Agreement will help provinces and territories, who have had to respond to COVID-19 in unique ways and have already made major investments and will continue to do so, in critical areas, such as healthcare, childcare and municipal services. First Ministers recognize that the territories and smaller jurisdictions face distinct challenges and circumstances, which will need to be addressed separately.</p>\n\n<p>“Funding includes support for expanding testing and contact tracing capabilities so that provincial and territorial health authorities are able to mitigate outbreaks of COVID-19. This funding will also support capacity in health care services; procurement of personal protective equipment; and support for Canadians facing mental health challenges, including problematic substance abuse. First Ministers also agree to jointly provide support to municipalities to maintain the delivery of critical services. There is also a dedicated stream of funding for public transit for jurisdictions with additional investment needs in this area. Funding will also support measures to protect vulnerable populations, including seniors in long-term care facilities, and child care services, so parents can return to work.&nbsp; Under the agreement, the Government of Canada will establish a temporary income support program to provide workers with up to ten days of paid sick leave related to COVID-19. Provinces and territories will establish job protected sick leave legislation or regulation in their respective jurisdictions.</p>\n\n<p>“Strong FPT collaboration to date has served Canadians well. First Ministers agree that continued collaboration is key to ongoing success and will build on the Team Canada approach that has taken place throughout the pandemic.”</p></div>\n      "
}