{
  "path": "/en/news/news-releases/2017/08/30/prime-minister-announces-appointment-new-senator",
  "pageTitle": "Prime Minister announces the appointment of a new Senator | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN\" xml:lang=\"EN\">The Prime Minister, Justin Trudeau, today announced that the Governor General appointed David Adams Richards as an independent Senator to fill a vacancy for New Brunswick.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">Mr. </span><span lang=\"EN-US\" xml:lang=\"EN-US\">Richards is an acclaimed Canadian novelist, essayist, screenwriter and poet, whose commitment to the Miramichi River valley, New Brunswick, and Canada is reflected in his body of work.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">He was chosen using the open merit-based process the Government of Canada put in place in early 2016. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</span></p><p><span lang=\"EN\" xml:lang=\"EN\">The Prime Minister intends to recommend individuals for additional vacancies in the Senate in the near future. More information about the latest appointments cycle will soon be made public when the Independent Advisory Board for Senate Appointments publishes its report to the Prime Minister.</span></p><h2>Quote</h2><blockquote><p>“I am pleased today to put forward another exceptional candidate as new Senator for the province of New Brunswick. I look forward to working with Mr. Richards, and all Senators, as they put their vast knowledge and experience to the service of our Parliament and our great country.”<br> <cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Under the Canadian Constitution, the Governor General appoints people to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Since 2016, the selection process for Senators has been opened up to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which then provides the Prime Minister with recommendations. From that pool of candidates, the Prime Minister selects the individuals he recommends to the Governor General for appointment to the Senate.</li><li>In making their recommendations, the Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan and merit-based criteria to identify highly-qualified people.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers in examining and revising legislation, investigating national issues, and representing regional, provincial and minority interests – all important functions in a modern democracy.</li></ul><h2>Related Product</h2><ul><li><a href=\"/en/news/backgrounders/2017/08/30/david-adams-richards\">Biographical notes</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/democratic-institutions/services/senate-appointment-process/faq.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/7/minister-of-democratic-institutions-announces-launch-of-the-permanent-phase-of-the-independent-senate-appointments-process.html\">Minister of Democratic Institutions announces launch of the permanent phase of the Independent Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/1/minister-of-democratic-institutions-announces-establishment-of-the-independent-advisory-board-for-senate-appointments.html\">Minister of Democratic Institutions announces establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2015/12/government-announces-immediate-senate-reform.html\">Government announces immediate Senate reform</a></li></ul></div>\n      "
}