{
  "path": "/en/news/readouts/2022/05/07/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden, to discuss the current situation in Ukraine, and further steps Canada and the U.S. can take to support the government and people of Ukraine.</p>\n\n<p>The Prime Minister and President commended the Ukrainian people for their unwavering courage in the face of Russian aggression. They reiterated their strong support for Ukrainian President Volodymyr Zelenskyy and his government, and committed to ongoing economic, security, and humanitarian support for Ukraine.</p>\n\n<p>The leaders expressed concern for the broader global impacts of the war, including its effects on energy and food security. They also shared their concern for the large and growing number of internally displaced persons and refugees, and agreed to redouble efforts to support vulnerable populations.</p>\n\n<p>The Prime Minister and President looked forward to discussing these and other pressing issues related to the conflict with G7 partners and President Zelenskyy this Sunday, May 8.</p>\n\n<p>Prime Minister Trudeau and President Biden looked forward to meeting in person soon.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/ukraine.aspx?lang=eng\">Canada’s response to the Russian invasion of Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://www.international.gc.ca/country-pays/ukraine/relations.aspx?lang=eng\">Canada’s engagement in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpMiddle\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/19/prime-minister-justin-trudeau-participates-teleconference-meeting\">Prime Minister Justin Trudeau participates in teleconference meeting with President of the United States of America Joe Biden, Prime Minister of Japan Kishida Fumio, and European leaders on the war in Ukraine</a></li>\n\t<li class=\"wordsection1CxSpLast\"><a href=\"https://pm.gc.ca/en/news/readouts/2022/04/09/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n</ul></div>\n      "
}