{
  "path": "/en/news/statements/2017/12/03/statement-prime-minister-international-day-persons-disabilities",
  "pageTitle": "Statement by the Prime Minister on the International Day of Persons with Disabilities | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of Persons with Disabilities:</p><p>“The <a href=\"https://www.un.org/development/desa/disabilities/international-day-of-persons-with-disabilities-3-december.html\">International Day of Persons with Disabilities</a> is a time to celebrate the contributions that people with disabilities make to our country and our world. It is also an opportunity to learn about what we can do so that everyone is able to fully participate in our communities and workplaces without barriers.</p><p>“This year’s theme – <i>Transformation towards sustainable and resilient society for all </i>– reminds us that resilient societies are inclusive societies. We must acknowledge the leadership of people with disabilities, and work with them to address the challenges they face and to achieve the goals laid out in the United Nations’ 2030 Agenda for Sustainable Development.</p><p>“While our country has made important progress toward advancing the rights of people with disabilities, Canada must continue to show leadership and actively promote diversity, equality, and inclusion – here at home and abroad. That is why we are investing in programs like the <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/enabling-accessibility-fund.html\">2017 Enabling Accessibility Fund</a>, which will help enhance and ensure greater accessibility and opportunities for people with disabilities in our communities, schools, workplaces, sport facilities, and beyond.</p><p>“Our Government is committed to helping Canadians with disabilities or functional limitations fully participate in their workplaces and communities. From July 2016 to February 2017, we consulted with people across the country on planned accessibility legislation. We will use this feedback as we move toward tabling this legislation in early 2018.</p><p>“This year, the 150<sup>th</sup> anniversary of Confederation reminded us that our diversity that is our greatest strength. All of us benefit when everyone’s rights are protected – and each one of us has a role to play to make inclusion a reality.</p><p>“On behalf of the Government of Canada, I invite all Canadians to join me in celebrating International Day of Persons with Disabilities. Not just today, but throughout the year, I urge you to take action and help create a truly accessible, just, and inclusive world for all.”</p></div>\n      "
}