{
  "path": "/en/news/statements/2017/06/27/statement-prime-minister-canadian-multiculturalism-day",
  "pageTitle": "Statement by the Prime Minister on Canadian Multiculturalism Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to highlight <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada-days/multiculturalism-day.html\">Canadian Multiculturalism Day</a>:</p><p>“Today, Canadians from coast to coast to coast join together to celebrate the multiculturalism and openness that make us who we are as a country.</p><p>“Canadians come from every corner of the world, speak two official languages and hundreds more, practice many faiths, and represent many cultures. Multiculturalism is at the heart of Canada’s heritage and identity – and as Canadians, we recognize that our differences make us strong.</p><p>“Canada’s strong tradition of multiculturalism has allowed our society to benefit from fresh perspectives and find new answers to old problems. It has also helped Canada attract some of the most innovative and entrepreneurial people from around the world, showing that openness is the engine of both creativity and prosperity.</p><p>“This year, we mark both the 150th anniversary of Confederation and the 35th anniversary of the <i>Canadian Charter of Rights and Freedoms</i>. These milestones remind us of the values that unite us – openness, inclusion, and deep respect for our differences. Whoever we are, wherever we come from, these values bring us together as equal members of this great country.</p><p>“On behalf of the Government of Canada, Sophie and I wish all those celebrating a happy, fun, and educational Multiculturalism Day. I invite Canadians to take part in the <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-canada-days/multiculturalism-day/activities.html\">many activities happening across the country</a>, and I ask all of us to work even harder to protect and promote multiculturalism. Today, and every day, let us celebrate the differences that make Canada strong, diverse, inclusive, and proud.”</p></div>\n      "
}