{
  "path": "/en/news/statements/2018/11/20/statement-prime-minister-national-child-day",
  "pageTitle": "Statement by the Prime Minister on National Child Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on National Child Day:</p><p>“Today, on <a href=\"http://www.childday.gc.ca/\">National Child Day</a>, we celebrate young Canadians, and the joy and inspiration they bring to our lives. We also recognize the importance of giving our children the best possible start in life. For our children to become leaders and speak to the issues that matter to them, we must defend their rights and protect them from harm. All of us benefit when every child has an equal and fair chance at success.</p><p>“Over the past three years, we have given more children the opportunity to succeed by putting more money in the pockets of Canadian families. The <a href=\"https://www.canada.ca/en/employment-social-development/campaigns/canada-child-benefit.html\">Canada Child Benefit</a> (CCB) now helps more than six million children and their families, and has made things like healthy food, summer programs, and winter clothes more affordable. In July, two years earlier than originally planned, we indexed the CCB to keep pace with the cost of living – giving parents even more each month to help with the high cost of raising their kids.</p><p>“We are committed to improving access to the full range of federal services and social benefits like the CCB for Indigenous peoples, particularly those living in remote and northern communities, so that Indigenous children are able to learn and thrive. We will continue to improve the delivery of services to Indigenous children and families, and work with partners including First Nations, Inuit, and the Métis Nation to develop community-driven solutions that empower children and keep them safe.</p><p>“Canadians know that education is the key to success. However, around the world, about a quarter of young people – most of them female – are not working or in school, and do not have access to the training and the opportunities they need to build their own future. This year, at the G7 Summit in June, Canada helped bring the international community together to invest $3.8&nbsp;billion to support quality education for women and girls in conflict and crisis situations. In September, at the United Nations General Assembly, we welcomed another $527&nbsp;million to help developing countries give every child access to the education and training they need to succeed.</p><p>“This year, we also welcome the release of the Canadian Children’s Charter. A year in the making, the Children’s Charter is a plan of action – created for children, by children – to respect, protect, and fulfill the rights of children. I look forward to reading the final version of the Children’s Charter, and have no doubt it will benefit young people across Canada for generations to come.</p><p>“Sophie and I invite Canadians to join us to celebrate National Child Day, by taking time to make a difference in the life of a child. Together, we can make sure that every child has a safe and happy childhood, and real opportunities to achieve their dreams.”</p></div>\n      "
}