{
  "path": "/en/news/statements/2016/12/07/statement-prime-minister-canada-launch-christmas-lights-across-canada",
  "pageTitle": "Statement by the Prime Minister of Canada on the launch of Christmas Lights Across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the official launch of the 32<sup>nd</sup> edition of Christmas Lights Across Canada:</p>\n<p>“Tonight, Canadians will gather on Parliament Hill for the official illumination ceremony of the Christmas Lights Across Canada program, kicking off the holiday season.</p>\n<p>“These lights illuminate our nation’s capital and provincial and territorial capitals across the country. They connect our communities and represent the values that bring us together – those of peace, unity, and confidence in the future.</p>\n<p>“This year, the Christmas Lights Across Canada tradition holds special significance as we count down towards the 150<sup>th</sup> anniversary of Confederation in 2017.</p>\n<p>“As we share the holiday season with family and friends, let us take a moment to reflect on how fortunate we are to call Canada home. Let us also remember the brave women and men of the Canadian Armed Forces, and their families, who make incredible sacrifices for our country each and every day.</p>\n<p>“Finally, I encourage all Canadians to warmly welcome those who have recently arrived in Canada as they experience the Canadian holiday season – and a Canadian winter – for the first time. We are neighbours who look out for each other, and lending a hand to those in need is at heart of the holiday season.”</p>\n<p>Canadians from coast to coast to coast can join in on the capital’s annual gathering by watching the evening’s festivities live on <a href=\"https://www.facebook.com/capitalexperience/videos/10155110267956029/\">Facebook</a>.</p>\n<p>For more information, please visit: <a href=\"http://canada.pch.gc.ca/eng/1445434705202\">Christmas Lights Across Canada</a></p></div>\n      "
}