{
  "path": "/en/news/readouts/2021/01/18/prime-minister-justin-trudeau-speaks-chancellor-angela-merkel-germany",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Chancellor Angela Merkel of Germany | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau spoke today with the Chancellor of Germany, Angela Merkel.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel discussed the measures in place in Canada and in Germany to limit the spread of the COVID-19 virus, to save lives and support people. They underlined the vital role of safe and effective vaccines to control and end the pandemic around the world. They agreed on the importance of a coordinated international response, highlighting the significant work of the ACT-Accelerator as well COVAX to advance equitable access to vaccines, diagnostics, and therapeutics.&nbsp;</p>\n\n<p>The Prime Minister and the Chancellor spoke about global issues and collaboration between Canada and Germany on shared priorities, such as climate change, democracy and human rights, international trade, and peace and security. They looked forward to making progress in these areas through cooperation within the G7, the G20, and other multilateral forums.</p>\n\n<p>The leaders discussed relations with China, with Prime Minister Trudeau thanking Germany for having recently raised at the United Nations Security Council the arbitrary detention of two Canadian citizens. They also exchanged views on Russia, and expressed concern about the detention of Russian political opposition figure, Alexei Navalny.</p>\n\n<p>Prime Minister Trudeau and Chancellor Merkel agreed to continue working closely together, including on green energy.<strong>&nbsp;</strong></p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/germany-allemagne/relations.aspx?lang=eng\">Canada-Germany relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-by-international-development-minister-on-appointment-to-the-covax-advance-market-commitment-engagement-group.html\">Statement by International Development Minister on Appointment to the COVAX Advance Market Commitment Engagement Group</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/04/canada-and-international-partners-launch-coronavirus-global-response\">Canada and international partners launch the Coronavirus Global Response</a></li>\n</ul></div>\n      "
}