{
  "path": "/en/news/news-releases/2021/10/30/global-health-and-economy-prime-minister-concludes-productive-first",
  "pageTitle": "Global Health and Economy: Prime Minister concludes productive first day of G20 Leaders’ Summit in Italy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his first day at the G20 Leaders’ Summit in Rome, Italy. Under Italy’s leadership, this year’s G20 Summit is focused on global economy and global health, climate change and environment, and sustainable development.</p>\n\n<p>On the first day of the Summit, Prime Minister Trudeau continued to advocate for ambitious, collective G20 action on pandemic response that includes equitable access to vaccines for countries around the world. No one is safe from COVID-19 until everyone is safe, which is why Canada remains committed to supporting a strong global response. Canada will keep working to ensure access to vaccines through investments in the COVID-19 Vaccine Global Access (COVAX) Facility and through the donation of surplus vaccine doses.</p>\n\n<p>As part of this commitment, the Prime Minister announced that, in total, Canada will donate the equivalent of at least 200 million doses to the COVAX Facility by the end of 2022. This includes an immediate commitment to contribute up to 10 million Moderna vaccine doses. Canada will continue to prioritize the sharing of excess doses through the COVAX Facility, to ensure vaccines get to those who need them most.</p>\n\n<p>Canada is also working with international partners to address barriers to equitable access of vaccines by improving global capacity to manufacture them. While at the Summit, the Prime Minister announced an investment of up to $15 million, to COVAX Manufacturing Task Force partners, in support of the establishment of the South Africa Technology Transfer Hub. This initiative will help build capacity to enable development and production of mRNA vaccines and technologies in the region.</p>\n\n<p>With a current contribution of over $1.3 billion, Canada has also made significant investments to ensure that COVID-19 vaccines, therapeutics, and diagnostics are available around the world through the Access to COVID-19 Tools (ACT) Accelerator. This includes the commitment of previously unallocated ACT-A funding of $70 million for vaccine distribution and delivery and COVID-19 diagnostics through existing ACT-A partners. The Prime Minister also confirmed Canada’s support for a G20 commitment on pandemic preparedness, including through the establishment of a G20 Joint Finance-Health Task Force.</p>\n\n<p>The Prime Minister reaffirmed Canada’s dedication to supporting the global economic recovery from the pandemic, including through inclusive and transparent debt relief measures and innovative financing. He announced that Canada will channel $3.7 billion, or 20 per cent of its newly allocated International Monetary Fund (IMF) Special Drawing Rights (SDRs), to support low-income and other vulnerable countries. As part of this, the Prime Minister announced that approximately $982 million would be distributed to the Poverty Reduction and Growth Trust (PRGT).</p>\n\n<p>During the Summit, the Prime Minister also attended an event focused on supporting small and medium-sized enterprises and women-owned businesses. The COVID-19 pandemic has exposed and amplified the gender gaps that exist in our societies, and has also had grave impacts on entrepreneurs and small and medium-sized business owners. The economic empowerment of women is of utmost importance to Canada, which is why we led efforts to develop and continue to co-chair G20 EMPOWER, an important initiative that seeks to accelerate women’s leadership and representation in the private sector. Canada will continue to support and advance issues that promote gender equality and the empowerment of women and girls worldwide.</p>\n\n<p>Only by working together can we build a better future, where no one is left behind. Canada will continue to collaborate closely with its partners, both within and beyond the G20, to contribute to the global fight against COVID-19, and to ensure a global recovery that creates jobs and growth for everyone.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“We know that to end the pandemic at home, we must work to end it everywhere. Together with our G20 partners, Canada will continue to work to finish the global fight against COVID-19, ensure equitable access to vaccines around the world, and build a healthier and safer future for everyone.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>This is the seventh G20 Summit attended by Prime Minister Trudeau.</li>\n\t<li>Italy holds the G20 presidency in 2021, and Indonesia will hold it in 2022.</li>\n\t<li>G20 EMPOWER was launched in 2019 at the G20 Leaders’ Summit in Osaka, Japan, and established during Saudi Arabia’s G20 Presidency. It has 28 members, including G20 and guest countries, as well as the European Union. It brings together over 60 business leaders and government representatives with the aim of building partnerships to accelerate women’s leadership and empowerment in the private sector.</li>\n\t<li>SDRs are an international reserve asset created by the IMF to supplement the official reserves of its member countries. The SDR is defined by a basket of currencies: the US dollar, Euro, Chinese Yuan, Japanese Yen, and the British Pound.</li>\n\t<li>Canada’s contribution to the PRGT includes a grant of SDR 61 million, the equivalent of about $107 million, as well as a new loan commitment of SDR 500 million, the equivalent of about $875 million.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/10/25/prime-minister-travel-netherlands-italy-and-united-kingdom\">Prime Minister to travel to the Netherlands, Italy, and the United Kingdom</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.g20.org/rome-summit.html\">G20 Rome Summit 2021 </a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/italy-italie/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Italy Relations</a></li>\n\t<li><a href=\"https://www.g20.org/about-the-g20/g20-empower.html\">G20 EMPOWER</a></li>\n\t<li><a href=\"https://www.imf.org/en/About/Factsheets/Sheets/2016/08/01/14/51/Special-Drawing-Right-SDR\">IMF: Special Drawing Rights</a></li>\n</ul></div>\n      "
}