{
  "path": "/en/news/news-releases/2023/04/12/building-clean-economy-with-good-middle-class-jobs",
  "pageTitle": "Building a clean economy with good middle-class jobs | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Across the country, Canadian workers are building the clean technologies we need to grow the economy and create good middle-class jobs while fighting climate change. That includes innovations in technology like electric vehicles, which are happening right here at the University of Manitoba.</p>\n\n<p>The Prime Minister, Justin Trudeau, was at the University of Manitoba in Winnipeg today to highlight both new and expanded investment tax credits proposed in <em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em>.</p>\n\n<p>These investment tax credits will help produce, manufacture, or use clean energy and clean technology in Canada, which will support good jobs for the middle class and a clean, made-in-Canada economy for generations to come:</p>\n\n<ul><li>Introducing a 15 per cent refundable Clean Electricity Investment Tax Credit for eligible investments in technologies required for the generation and storage of clean energy and its transmission between provinces and territories, which is available to taxable and certain tax-exempt entities;</li>\n\t<li>Introducing a refundable Clean Technology Manufacturing Tax Credit to cover 30 per cent of investments in new machinery and equipment used to manufacture or process clean technologies and extract, process, or recycle key critical minerals;</li>\n\t<li>Moving forward with the Clean Hydrogen Investment Tax Credit, first announced in the <em>2022 Fall Economic Statement</em>, to support between 15 and 40 per cent of eligible project costs to produce clean hydrogen right here at home;</li>\n\t<li>Expanding the Carbon Capture, Utilization, and Storage Investment Tax Credit to additional types of equipment used to capture carbon dioxide emissions for storage or other uses in industrial processes, and provide tax credit access to geological storage projects in British Columbia; and</li>\n\t<li>Expanding eligibility for the refundable<strong> </strong>30 per cent<strong> </strong>Clean Technology Investment Tax Credit to include geothermal energy systems, further supporting the growth of Canada’s clean technology sector.</li>\n</ul><p>These clean investment tax credits build on the work we have already done from coast to coast to coast to grow our clean economy and create and secure tens of thousands of good middle-class jobs.</p>\n\n<p>At the University of Manitoba, the Prime Minister also highlighted Budget 2023 measures to enhance financial assistance for students by increasing Canada Student Grants by 40 per cent, providing up to $4,200 for full-time students, and raising interest-free Canada Student Loans. In total, proposed changes would allow post-secondary students to access up to $14,400 in enhanced Canada Student Financial Assistance for the upcoming school year.</p>\n\n<p>Budget&nbsp;2023 lays out the federal government’s plan to build a stronger, more sustainable Canadian economy for everyone. It will continue to deliver real results, make life more affordable, and build a healthier, cleaner future for Canadians from coast to coast to coast.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“When it comes to clean energy and clean technology, Canada is a world leader. That’s why companies from around the world continue to choose Canada – and above all, Canadian workers – to grow their operations. The investments we are proposing in Budget&nbsp;2023 will help us continue to build an economy that works for everyone, with good middle-class jobs, while leaving a stronger, healthier future for our kids.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer></blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul><li>In the past year alone, Canada has secured historic investments in our growing clean economy and provided funding to support Canadian workers. These include:\n\t<ul class=\"bulletOutline\"><li>In March 2022, the Government of Canada announced a new federal investment of up to $131.6&nbsp;million, matched by the Government of Ontario, to help Honda Canada retool its manufacturing operations in Alliston, Ontario, to launch the next generation of hybrid-electric vehicles and secure well-paying, high-quality jobs across the Canadian supply chain.</li>\n\t\t<li>In May 2022, the Government of Canada announced a new federal investment of up to $529&nbsp;million to support a multi-billion-dollar project from automaker Stellantis to modernize its assembly plants in Windsor and Brampton, Ontario, help the company increase its production of electric vehicles, and support thousands of jobs. The Government of Ontario also supported the project with an investment of up to $513&nbsp;million.</li>\n\t\t<li>In October 2022, the Government of Canada announced a new proposed federal investment of up to $222&nbsp;million through the Strategic Innovation Fund to help Rio Tinto Fer et Titane (RTFT) increase its production of critical minerals for products like electric vehicles and batteries, and to help feed clean technology supply chains at home and abroad.</li>\n\t\t<li>In November 2022, the Government of Canada announced an investment of up to $300&nbsp;million, alongside a contribution of $161.5&nbsp;million from the Government of Alberta, to support a $1.6&nbsp;billion project by&nbsp;Air Products Canada Ltd. to advance clean fuels and clean energy in Canada and secure hundreds of middle-class jobs.</li>\n\t</ul></li>\n\t<li>If a particular machinery or equipment is eligible for more than one clean investment tax credit, businesses would only be able to claim one of the credits outlined above. The full extent of the tax credits rates will be provided only if the labour conditions are met, where applicable.</li>\n\t<li>Other investments in a clean economy proposed in Budget&nbsp;2023 include:\n\t<ul class=\"bulletOutline\"><li>at least $20&nbsp;billion, sourced from existing resources, to be invested by the Canada Infrastructure Bank to support the building of major clean electricity and clean growth infrastructure projects;</li>\n\t\t<li>$3&nbsp;billion over 13 years to recapitalize funding for the Smart Renewables and Electrification Pathways Program to support critical regional electricity priorities and Indigenous-led projects; renew the Smart Grid Program and further support grid innovation; and support science-based projects to leverage Canada’s offshore wind potential; and</li>\n\t\t<li>$500&nbsp;million over 10 years to the Strategic Innovation Fund to attract and spur high-quality business investments to support the development and application of clean technologies in Canada.</li>\n\t</ul></li>\n\t<li>In March 2022, the Government of Canada released the <em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em>, an ambitious and achievable roadmap that outlines a sector-by-sector approach for Canada to reach its climate target of cutting emissions by 40 per cent below 2005 levels by 2030, and to put us on track toward our goal of achieving net-zero emissions by 2050.</li>\n</ul><h2>Related Products</h2>\n\n<ul><li><a href=\"https://www.canada.ca/en/department-finance/news/2023/03/a-made-in-canada-plan-affordable-energy-good-jobs-and-a-growing-clean-economy.html\">Budget&nbsp;2023 Backgrounder: A Made-in-Canada Plan: Affordable Energy, Good Jobs, and a Growing Clean Economy</a></li>\n\t<li><a href=\"https://www.budget.canada.ca/2023/report-rapport/tm-mf-en.html\">Tax measures: Supplementary Information</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/weather/climatechange/climate-plan/climate-plan-overview/emissions-reduction-2030.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_emissions-reduction-plan\"><em>2030 Emissions Reduction Plan: Canada’s Next Steps for Clean Air and a Strong Economy</em></a></li>\n</ul><h2>Associated Links</h2>\n\n<ul><li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2023/03/28/government-canada-releases-budget-2023\">Government of Canada releases Budget&nbsp;2023</a></li>\n\t<li><a href=\"https://www.budget.canada.ca/2023/home-accueil-en.html\"><em>Budget&nbsp;2023—A Made-in-Canada Plan: Strong Middle Class, Affordable Economy, Healthy Future</em></a></li>\n\t<li><a href=\"/en/news/news-releases/2022/03/16/supporting-canadas-automotive-manufacturing-sector-and-its-workers\">Supporting Canada’s automotive manufacturing sector and its workers</a></li>\n\t<li><a href=\"/en/news/news-releases/2023/01/17/building-electric-vehicles-canada-create-jobs-and-cleaner-future\">Building electric vehicles in Canada to create jobs and a cleaner future for everyone</a></li>\n\t<li><a href=\"/en/news/news-releases/2022/10/11/delivering-good-jobs-and-strengthening-canadas-clean-economy\">Delivering good jobs and strengthening Canada’s clean economy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2022/11/government-of-canada-makes-significant-investment-in-albertas-clean-hydrogen-sector-and-outlines-next-steps-to-help-canadian-industry-sectors-cut-p.html\">Government of Canada makes significant investment in Alberta’s clean hydrogen sector</a></li>\n</ul></div>\n      "
}