{
  "path": "/en/news/statements/2022/03/24/statement-prime-minister-death-former-united-states-secretary-state",
  "pageTitle": "Statement by the Prime Minister on the death of former United States Secretary of State Madeleine Albright | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the death of Madeleine Albright:</p>\n\n<p>“It is with great sadness that I learned of the passing of former United States Secretary of State Madeleine Albright at the age of 84.</p>\n\n<p>“As a refugee herself, Mrs. Albright was a force for good in the world and a trailblazer for women in government and beyond. Through her work for the National Security Council and as United States Ambassador to the United Nations – the second woman to hold that position – Mrs. Albright championed diplomacy and democratic values on the world stage.</p>\n\n<p>“In 1997, she became the 64th United States Secretary of State and the first woman to serve in that position. At the time, she was the highest-ranking woman in the history of the United States government. As Secretary of State, Mrs. Albright promoted the North Atlantic Treaty Organization (NATO), successfully pressed for NATO’s intervention to end the humanitarian crisis in Kosovo, supported poverty reduction and debt relief efforts in developing countries, and advocated for the fight against climate change and environmental degradation on the world stage. In 2018, she said that she had no better relationship as Secretary of State than the one she had with Canada.</p>\n\n<p>“Our country has lost a friend, who for many years demonstrated a deep commitment to our close partnership as we worked together to advance our shared values on the world stage. In addition to teaching as a professor at Georgetown University, Mrs. Albright was involved with a number of boards and foundations, and founded the Albright Institute for Global Affairs at Wellesley College. She also co-founded the Community of Democracies, an intergovernmental coalition of states, of which Canada is a Governing Council member, that upholds democratic values expressed in the Warsaw Declaration. In 2012, she was awarded the Presidential Medal of Freedom, the United States’ highest civilian honour, for her work to bring peace to the Balkans.</p>\n\n<p>“On behalf of the Government of Canada, Sophie and I offer our deepest condolences to Mrs. Albright’s family, friends, and the people of the United States. She will be remembered for courage in championing democracy and diplomacy and paving the way for women around the world to become involved in politics.”</p></div>\n      "
}