{
  "path": "/en/news/news-releases/2018/05/23/canadas-strategy-respond-rohingya-crisis",
  "pageTitle": "Canada’s strategy to respond to Rohingya crisis | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The grave humanitarian and security crisis in Myanmar is a global tragedy, which has led more than 717,000 Rohingya to flee their homes in Rakhine State and seek refuge in neighbouring Bangladesh.</p><p>The Prime Minister, Justin Trudeau, today unveiled Canada’s strategy to step up its response and meet the needs of those displaced and most vulnerable. This comprehensive strategy is based on recommendations highlighted in the <a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/rep_sem-rap_esm.aspx?lang=eng\">final report</a> from the Prime Minister’s Special Envoy to Myanmar, the Honourable Bob Rae.</p><p>Guided by the Feminist International Assistance Policy, the strategy places a central emphasis on the needs of women and girls, and puts forward concrete and timely initiatives to promote human rights, gender equality, human dignity, and peace and security in the region.</p><p>Canada will lead on several initiatives, including those to improve living conditions of Rohingya refugees in camps and settlements. We will support efforts to bring perpetrators of gross human rights violations to account, and to achieve a political solution to the plight of the Rohingya and other ethnic minorities in Myanmar. We will also help coordinate international efforts to address the crisis.</p><p>Canada will dedicate significant funding – $300 million over three years – to address the region’s humanitarian, development, and stabilization needs in a coordinated and timely way.</p><p>Canada was one of the first countries to respond to the crisis, and remains one of the top humanitarian donors. This strategy builds on our current efforts, and represents our commitment to do more while continuing to work closely with the international community and the United Nations on a path forward.</p><h2>Quote</h2><blockquote><p>“Canada will not stand idle while hundreds of thousands of people – Rohingya communities and other minorities – suffer gross human rights violations. We share a global responsibility to respond to this crisis. We commend others who have acted in a compassionate and generous way, especially the Government of Bangladesh and host communities in the region who continue to provide safe refuge to their neighbours in need. We will continue to step up to protect human rights, and promote inclusion, respect for diversity, and security for all, while working towards sustainable peace and true reconciliation in Myanmar.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>The Government of Canada’s strategy addresses the four areas of action of Mr. Rae’s final report:</li></ul><p>1. The humanitarian crisis in Bangladesh and Myanmar<br>2. The political situation in Myanmar<br>3. The question of accountability and impunity<br>4. Effective coordination and cooperation</p><ul><li>The Government of Canada is providing assistance to the region through humanitarian partners, including United Nations agencies, the International Red Cross and Red Crescent Movement, and other non-governmental organizations.</li><li>Since the beginning of 2017, Canada has provided $45.9 million for aid partners to deliver life-saving and gender-responsive support for refugees, displaced people, and the communities who are hosting them. This includes $12.5 million for the Myanmar Crisis Relief Fund that matched the generous contributions Canadians made to charities last year between August and November 2017.</li><li>On October 23, 2017, Prime Minister Trudeau named Mr. Rae as his Special Envoy to Myanmar. Mr. Rae was asked to engage in diplomatic efforts to address the crisis, and to advise the Prime Minister on how Canada could best support efforts to respond to the needs of those affected and displaced by violence.</li><li>Mr. Rae has made two trips to Myanmar and three to Bangladesh. He has met with officials, leaders and non-governmental organizations in those countries and others, including Indonesia, Vietnam, and the United Kingdom, to assess the crisis and identify what Canada could do to address it. He has also visited the United Nations in New York to meet with senior officials and member states, and travelled to Geneva to engage with Kofi Annan – Chair of the Advisory Commission on Rakhine State – and others working to address the crisis and promote peace and reconciliation in Myanmar.</li><li>Foreign Affairs Minister Chrystia Freeland and Minister of International Development and La Francophonie Marie-Claude Bibeau have each visited Bangladesh once since August 2017.</li><li>The Prime Minister also continues to engage with other world leaders on the crisis in Myanmar and Bangladesh, expressing his deep concerns over the situation in Rakhine State for Rohingya and other minorities.</li><li>The Prime Minister has spoken directly with Her Excellency Daw&nbsp;Aung&nbsp;San&nbsp;Suu&nbsp;Kyi, State Counsellor of the Republic of the Union of Myanmar, to highlight the need for Myanmar to accelerate efforts to uphold human rights and protect ethnic and religious minorities, and the importance of ensuring the safety of civilians and people returning voluntarily. During all exchanges, he confirmed Canada’s support for ongoing reforms in Myanmar and Canada’s readiness to help.</li></ul><h2>Related product</h2><ul><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/strat-rohingya.aspx?lang=eng\">Canada’s strategy to respond to the crisis in Myanmar and Bangladesh</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"http://international.gc.ca/world-monde/issues_development-enjeux_developpement/response_conflict-reponse_conflits/crisis-crises/myanmar.aspx?lang=eng\">Canada and the crisis in Myanmar’s Rakhine State</a></li><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/iap-pai/index.aspx?lang=eng\">Canada’s Feminist International Assistance Policy</a></li><li><a href=\"/en/news/news-releases/2017/10/23/prime-minister-appoints-honourable-bob-rae-special-envoy-myanmar\">Prime Minister appoints the Honourable Bob Rae as Special Envoy to Myanmar</a></li><li><a href=\"/en/news/news-releases/2017/06/07/prime-minister-announces-support-peace-process-and-humanitarian\">Prime Minister announces support for peace process and humanitarian assistance in Myanmar</a></li><li><a href=\"/en/news/statements/2018/04/03/prime-minister-welcomes-final-report-special-envoy-myanmar\">Prime Minister welcomes final report from Special Envoy to Myanmar</a></li></ul></div>\n      "
}