{
  "path": "/en/news/statements/2022/11/20/bangkok-goals-bio-circular-green-bcg-economy",
  "pageTitle": "Bangkok Goals on Bio-Circular-Green (BCG) Economy | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><ol>\n\t<li>Recalling the Putrajaya Vision 2040, APEC reiterates our commitment to pursuing strong, balanced, secure, sustainable and inclusive growth in the Asia-Pacific region.</li>\n\t<li>APEC is determined to<strong> </strong>continue advancing its sustainability objectives in a bold, responsive, and comprehensive manner to address the heightened economic and environmental challenges and disruptions facing the region, building on our commitments in the Putrajaya Vision 2040 and the actions set out in the Aotearoa Plan of Action (APA), for the prosperity of all our people and future generations.</li>\n\t<li>By adopting the Bangkok Goals, APEC moves forward with outlining how to achieve its comprehensive and ambitious sustainability and inclusion objectives, while reinforcing and contributing to ongoing global actions. APEC explored approaches such as the bio-circular-green (BCG) economy model that integrates three economic approaches, where technology and innovation are used to create value, reduce waste, advance resource efficiency, and promote sustainable business models. It also calls for more holistic efforts to achieve more balanced, inclusive and sustainable growth. Such efforts should build on APEC’s existing commitments and workstreams as well as consider new aspirational ones to further APEC’s sustainability objectives.</li>\n\t<li>APEC will marshal existing targets and workstreams in conjunction with the following goals, key areas and aspirational targets:\n\t<ol class=\"lowerAlphaDot\">\n\t\t<li><strong>Supporting </strong>global efforts to comprehensively address all environmental challenges, including climate change, extreme weather and natural disasters, for a sustainable planet, particularly in terms of climate mitigation, adaptation and resilience by:\n\t\t<ol class=\"lowerRoman\">\n\t\t\t<li><strong>Contributing </strong>practical, ambitious and concrete initiatives to transition to a climate-resilient future global economy which align with global efforts, such as the achievement of the 2030 Agenda for Sustainable Development and the goals of the Paris Agreement, as well as appreciating and supporting APEC members’ respective net zero / carbon neutrality commitments, recognising the urgent need to collectively address climate change and reduce greenhouse gas emissions and the need to provide international support including capacity building, technological and financial support, which are key enablers in this regard;</li>\n\t\t\t<li><strong>Enhancing </strong>adaptive capacity, strengthening resilience and reducing vulnerability to the adverse effects of climate change and associated risks, including through mainstreaming adaptation measures into policies, strategies and planning, as well as disaster and emergency preparedness and management;</li>\n\t\t\t<li><strong>Strengthening </strong>cooperation to develop and exchange policies and best practices, and promote capacity building and awareness-raising programmes that address all environmental and climate challenges, and support sustainable growth;</li>\n\t\t\t<li><strong>Ensuring </strong>diversity and inclusion in our collective efforts to address climate change;</li>\n\t\t\t<li><strong>Advancing&nbsp;</strong>the transition to clean and low-carbon energy through various pathways reflecting the different circumstances in each economy, strengthening energy resilience, promoting energy security, and ensuring affordable and reliable energy access, including by fostering technical collaboration and exchange of best practices and experiences. We acknowledge the importance of stable energy markets and clean energy transitions. Noting the progress made to date, APEC economies are discussing goals for further strengthening the region’s capacity to adopt renewable energy and other clean and low-emissions energy technologies;</li>\n\t\t\t<li><strong>Recalling </strong>our commitment to rationalise and phase out inefficient fossil fuel subsidies that encourage wasteful consumption while recognising the importance of providing those in need with essential energy services, and, to reach this goal, continuing efforts in an accelerated manner;</li>\n\t\t\t<li><strong>Promoting </strong>sustainable, resilient, productive, and inclusive food systems and agricultural practices, achieving food security and nutrition, reducing food loss and waste, including through encouraging environmentally-friendly policies and minimising environmentally-harmful ones, conserving agrobiodiversity, and enhancing the use of agricultural biotechnology, digitalisation and other innovative approaches;</li>\n\t\t\t<li><strong>Promoting </strong>research, development and deployment of cost-effective low and zero emissions technologies, acknowledging that there are a variety of technologies and approaches available;</li>\n\t\t\t<li><strong>Supporting </strong>finance and investments in sustainability and climate action, including disaster risk finance insurance, and, if appropriate, carbon pricing and non-pricing mechanisms and international carbon credit markets, as well as exploring options to support the alignment of financial flows towards a greener and cleaner global economy, for example taxonomies and other alignment approaches.</li>\n\t\t</ol>\n\t\t</li>\n\t\t<li><strong>Progressing </strong>sustainable and inclusive trade and investment and ensuring that they are mutually supportive with our environmental policies by:\n\t\t<ol class=\"lowerRoman\">\n\t\t\t<li><strong>Intensifying </strong>work that enhances stability, resilience and sustainability of supply chains, as well as improves connectivity, including through the implementation of the APEC Connectivity Blueprint and advancing cooperation and sharing best practices on green public procurement;</li>\n\t\t\t<li><strong>Advancing </strong>work on the facilitation of trade in environmental goods and services, building on discussion about the APEC List of Environmental Goods and the Reference List of Environmental and Environmentally Related Services and further discussing the impact of non-tariff measures on trade in environmental goods;</li>\n\t\t\t<li><strong>Advancing </strong>concrete initiatives on responsible business conduct, environment, social and governance (ESG) industry practices, for example through the development of sustainable tourism, manufacturing, agriculture, transport and logistics sectors, as well as the green and low-carbon digital and technology sectors;</li>\n\t\t\t<li><strong>Advancing </strong>gender equality and economic integration, inclusion and empowerment of women;</li>\n\t\t\t<li><strong>Strengthening </strong>the roles of micro, small, and medium enterprises (MSMEs), including encouraging the formulation of an updated APEC Strategy for Green, Sustainable and Innovative MSMEs, building capabilities for MSMEs in sustainability practices such as the ESG and BCG approaches, and collaborating to improve opportunities for MSMEs to be competitive, specialised, innovative and expand into international markets.</li>\n\t\t</ol>\n\t\t</li>\n\t\t<li><strong>Promoting </strong>environmental conservation, sustainable use and management of natural resources, as well as halting and reversing biodiversity loss by:\n\t\t<ol class=\"lowerRoman\">\n\t\t\t<li><strong>Enhancing </strong>conservation and sustainable use and management of coastal and marine resources and ecosystems as well as sustainable fisheries and aquaculture, including preventing, combatting and working towards ending illegal, unreported, and unregulated (IUU) fishing and implementing the APEC Roadmap on Combatting IUU<strong> </strong>Fishing;</li>\n\t\t\t<li><strong>Continuing </strong>work to prevent and reduce marine debris and plastic pollution, including through the implementation of the APEC Roadmap on Marine Debris;</li>\n\t\t\t<li><strong>Strengthening </strong>efforts to combat illegal logging and associated trade, stop the degradation of forest ecosystems, and promote trade and consumption in sustainably managed and legally harvested forest products;</li>\n\t\t\t<li><strong>Striving </strong>to ensure diversity and inclusion to improve our efforts in maintaining, conserving, managing and protecting the environment and natural resources.</li>\n\t\t</ol>\n\t\t</li>\n\t\t<li><strong>Advancing </strong>resource efficiency and sustainable waste management towards zero waste by:\n\t\t<ol class=\"lowerRoman\">\n\t\t\t<li><strong>Increasing </strong>cooperation to advance circular economy approaches, including through promoting circular business models as well as exchange policies and best practices, and sustainable production and consumption patterns.</li>\n\t\t</ol>\n\t\t</li>\n\t</ol>\n\t</li>\n\t<li>To achieve the above and the three economic drivers of the Putrajaya Vision 2040 requires the adoption of an inclusive approach that improves the quality of life for all members of society and advances gender equality as well as economic inclusion and empowerment of MSMEs, women, and other groups with untapped economic potential, such as Indigenous Peoples as appropriate, people with disabilities, and those from remote and rural communities, while also promoting the role of youth. Further, there is a need for stronger whole-of-society partnerships and whole-of-system approaches within APEC, particularly across all fora and sub-fora in order to deliver comprehensive, coherent and mutually-reinforcing outcomes.</li>\n\t<li>The following enablers should be accelerated through relevant APEC mechanisms:\n\t<ol class=\"lowerAlphaDot\">\n\t\t<li>Conducive and agile regulatory frameworks and enabling business environment, including through structural reform, good regulatory practices and international regulatory cooperation, particularly advancing the implementation of the Enhanced APEC Agenda for Structural Reform (EAASR) and taking into account the findings and recommendations of the 2022 APEC Economic Policy Report (AEPR) on Structural Reform and a Green Recovery from Economic Shocks and other relevant AEPRs to inform policies and approaches.</li>\n\t\t<li>Capacity building by deepening economic and technical cooperation, exchange of experiences and best practices to achieve sustainable and inclusive growth, voluntary technology transfer on mutually agreed terms, as well as inclusive human resource development, especially reskilling and upskilling to boost recruitment, retention and promotion of a diverse workforce.</li>\n\t\t<li>Enabling environment for the development of quality infrastructure, financing and investment, as well as further leveraging science, technology, innovation and digitalisation.</li>\n\t\t<li>Networks for collaboration among public sector, private sector, financial sector, academia, other international and regional organisations, other relevant stakeholders, as well as mechanisms within and related to APEC, including ABAC, the APEC Study Centers Consortium, and APEC permanent observers namely ASEAN, PECC, and PIF.</li>\n\t</ol>\n\t</li>\n\t<li>The APEC Committees and relevant sub-fora will integrate and advance the above agenda in their respective strategies and work plans, where appropriate, as well as to deepen cross-fora collaboration. The APEC Secretariat will maintain an evergreen compendium of the actions and initiatives taken and to provide regular updates to Senior Officials as the means to review our progress to contribute to and in accordance with the APA review process. Senior Officials will have the overall responsibility for monitoring and evaluating progress under the Bangkok Goals on BCG Economy. The furtherance of the sustainability agenda in a comprehensive and ambitious manner will support APEC’s growth trajectory towards a strong, balanced, secure, sustainable and inclusive future.</li>\n</ol></div>\n      "
}