{
  "path": "/en/news/news-releases/2022/03/14/governor-general-travel-middle-east",
  "pageTitle": "Governor General to travel to the Middle East | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General of Canada, Her Excellency the Right Honourable Mary Simon, will travel to the Middle East for working visits from March 17 to 23, 2022.</p>\n\n<p>The Governor General will visit the United Arab Emirates (UAE), Qatar, and Kuwait. In each of these three countries, she will meet with Canada’s ambassadors, Canadian Armed Forces members deployed to the region, as well as heads of state and other senior leaders of the three countries to strengthen our bilateral relations. In these times of uncertainty around the world, bolstering relationships between countries is of utmost priority.</p>\n\n<p>While in the UAE, the Governor General will represent Canada and be a guest of honour at Canada’s National Day at Expo&nbsp;2020, in Dubai. Her Excellency’s attendance at Expo&nbsp;2020 will help promote Canadian leadership, innovation, and opportunities throughout all sectors of society while highlighting the importance of collaboration across countries and cultures.</p>\n\n<p>During her visits, Her Excellency will take the opportunity to thank the governments of the UAE, Qatar, and Kuwait for their pivotal role in evacuating Canadians and Afghans from Kabul since August, as part of global evacuation efforts from Afghanistan. While in Kuwait, in her capacity as Commander-in-Chief of Canada, she will also tour Camp Canada at the Ali Al Salem Air Base, where she will meet with members of the Canadian Armed Forces stationed in the country in support of Operation IMPACT. In Qatar, Her Excellency will meet with Canadian Armed Forces personnel stationed at the Al-Udeid Air Base.</p>\n\n<p>This will be Her Excellency’s second visit abroad since becoming Governor General of Canada.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Her Excellency’s visit to the UAE, Qatar, and Kuwait will help reinforce Canada’s commitment to strengthening our relations with allies and partners globally amidst uncertain times. Her participation at Expo&nbsp;2020 will also showcase Canadian culture on the world stage and her visit to Camp Canada will help demonstrate our support for our Canadian Armed Forces members, no matter where they serve.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Canada and the UAE have a broad and deep relationship focused on building prosperity for both societies, strengthening regional and global security, and contributing to economic and social development in third countries, including empowering women and girls.</li>\n\t<li>While its opening was originally planned in Dubai for October 2020, Expo&nbsp;2020 was postponed due to the COVID-19 pandemic. It boasts the most participating countries in Expo history, with 192 – each with their own pavilion. Canada’s National Day at the Expo is March 19, 2022.</li>\n\t<li>Canada and Qatar have enjoyed uninterrupted diplomatic relations since 1974. The Gulf state is an important security partner and diplomatic actor in the region.</li>\n\t<li>Qatar hosts the U.S. military’s Central Command (CENTCOM) at Al-Udeid Air Base in Doha, including Canadian Armed Forces personnel who are supporting the Global Coalition against Daesh.</li>\n\t<li>Canada and Kuwait have enjoyed strong bilateral ties since diplomatic relations were established in 1965. Our two countries share common views and interests in several areas, including peace and security, humanitarian affairs, and trade and investment.</li>\n\t<li>Kuwait houses hundreds of members of Canadian Armed Forces personnel at the Ali Al Salem Air Base. Home to Camp Canada, the air base is the centre for Operation IMPACT.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/uae-eau/relations.aspx?lang=eng\">Canada-United Arab Emirates Relations</a></li>\n\t<li><a href=\"https://expo2020.canada.ca/en/\">Canada at Expo&nbsp;2020 Dubai – The Future in Mind</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/qatar/bilateral_relations_bilaterales/index.aspx?lang=eng\">Canada-Qatar Relations</a></li>\n\t<li><a href=\"https://www.canadainternational.gc.ca/kuwait-koweit/bilateral_relations_bilaterales/canada-kuwait.aspx?lang=eng\">Canada-Kuwait Relations</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/services/operations/military-operations/current-operations/operation-impact.html\">Operation IMPACT</a></li>\n</ul></div>\n      "
}