{
  "path": "/en/news/news-releases/2017/02/15/prime-minister-trudeau-welcomes-european-parliaments-approval",
  "pageTitle": "Prime Minister Trudeau welcomes the European Parliament’s approval of the Comprehensive Economic and Trade Agreement and Strategic Partnership Agreement | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the European Parliament voted to approve the implementation of the Canada-EU Comprehensive Economic and Trade Agreement (CETA) and the Strategic Partnership Agreement (SPA).</p><p>CETA sets a new bar for progressive trade agreements that create good, middle class jobs, give consumers more choice, and protect both workers and the environment.</p><p>Prime Minister Justin Trudeau welcomed the achievement of this important milestone which brings CETA closer to full ratification. Canada and the EU will now complete their respective legislative and regulatory processes that will bring virtually all significant parts of the Agreement into force by spring 2017.</p><p>Canada also welcomes the positive vote in the European Parliament on the SPA, which will deepen and strengthen the already strong cooperation between Canada and the EU on a wide range of issues, including human rights, international peace and security, and the environment.</p><h2>Quote</h2><blockquote><p>“Canada is pleased that the European Parliament has voted to support CETA and SPA. Today’s vote is an exciting milestone on the way to bringing the benefits of these progressive free trade and partnership agreements to Canadians and Europeans. These agreements set the stage for an even stronger relationship with the EU, which will create greater opportunities for the middle class on both sides of the Atlantic.”<br> —&nbsp;<cite>Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>Prime Minister Justin Trudeau, together with Donald Tusk, President of the European Council, and Jean-Claude Juncker, President of the European Commission, signed CETA during the European Union-Canada Leaders’ Summit on October 30, 2016.</li><li>Bill C-30, the legislation to implement CETA in Canada, was introduced in the House of Commons on October 31, 2016. Bill C-30 passed third reading in the House of Commons on February 14, 2017, and was introduced in the Senate on February 14, 2017.</li><li>Tomorrow also marks the first time that a Canadian Prime Minister addresses the European Parliament.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2017/02/15/canada-and-european-union-support-ratification-comprehensive-economic\">Canada and the European Union support the ratification of the Comprehensive Economic and Trade Agreement (CETA) and the Strategic Partnership Agreement (SPA)</a></li><li><a href=\"/en/news/speeches/2017/02/16/address-prime-minister-justin-trudeau-european-parliament\">Address by Prime Minister Justin Trudeau to the European Parliament</a></li></ul><h2>Associated links</h2><ul><li><a href=\"http://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">CETA: A progressive trade agreement for a strong middle class</a></li><li><a href=\"/en/news/news-releases/2016/10/30/canada-and-eu-sign-historic-trade-agreement-during-eu-canada-summit\">Canada and EU sign historic trade agreement during Canada-EU Summit</a></li><li><a href=\"http://www.europarl.europa.eu/news/en/news-room/20170209IPR61728/ceta-meps-back-eu-canada-trade-agreement\">CETA: MEPs back EU-Canada trade agreement</a></li><li><a href=\"/en/news/backgrounders/2016/10/30/benefits-canada-eu-comprehensive-economic-and-trade-agreement\">Benefits of the Canada-EU Comprehensive Economic and Trade Agreement</a></li><li><a href=\"http://www.international.gc.ca/world-monde/international_relations-relations_internationales/spa-aps.aspx?lang=eng\">Canada-European Union Strategic Partnership Agreement</a></li></ul></div>\n      "
}