{
  "path": "/en/news/readouts/2022/09/21/prime-minister-justin-trudeau-meets-secretary-general-united-nations",
  "pageTitle": "Prime Minister Justin Trudeau meets with Secretary-General of the United Nations António Guterres | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the Secretary-General of the United Nations (UN), António Guterres, on the margins of the 77th Session of the UN General Assembly.</p>\n\n<p>Prime Minister Trudeau and Secretary-General Guterres expressed their steadfast support for a strong and effective UN system. Both leaders agreed that the UN is at the forefront of multilateral efforts to safeguard the rules-based international order, while listening to and addressing the concerns of all global partners.</p>\n\n<p>The two leaders discussed Prime Minister Trudeau’s role within the Sustainable Development Goals (SDG) Advocates group, which he co-chairs with the Prime Minister of Barbados, Mia Mottley, and the need to pursue ambitious, collective action on all of the SDGs, including financing for the countries that need it most.</p>\n\n<p>Prime Minister Trudeau also shared his appreciation for Secretary-General Guterres’ leadership in advancing progress to address the global crises that are climate change, biodiversity loss, and pollution – in particular plastic pollution. The leaders discussed the importance of an ambitious outcome at COP15 in order to focus&nbsp;the world’s collective efforts to stop biodiversity loss and the degradation of nature.</p>\n\n<p>Following a meeting of the Ad Hoc Advisory Group and Caribbean partners on the situation in Haiti earlier in the day, the two leaders agreed on the need to continue to work with the international community to advance a Haitian-led solution and help support stability and sustainable development in the country.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/un-onu/index.aspx?lang=eng\">Canada and the United Nations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/09/17/prime-minister-attend-united-nations-general-assembly-new-york\">Prime Minister to attend United Nations General Assembly in New York</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/02/28/prime-minister-justin-trudeau-speaks-secretary-general-united-nations\">Prime Minister Justin Trudeau speaks with Secretary-General of the United Nations António Guterres</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Canada takes action on the 2030 Agenda and the Sustainable Development Goals</a></li>\n\t<li><a href=\"https://www.canada.ca/en/services/environment/wildlife-plants-species/biodiversity/cop15.html\">UN conference on biodiversity: COP15 in Montréal</a></li>\n</ul>\n\n<p>&nbsp;</p></div>\n      "
}