{
  "path": "/en/news/statements/2021/05/23/statement-prime-minister-anniversary-komagata-maru-incident",
  "pageTitle": "Statement by the Prime Minister on the anniversary of the Komagata Maru incident | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the anniversary of the Komagata Maru incident:</p>\n\n<p>“Over a century ago, the Komagata Maru steamship arrived in Vancouver’s Burrard Inlet. On board were 376 Sikhs, Muslims, and Hindus of South Asian origin. Like so many people before and after them, they came to Canada in hope of a better future.</p>\n\n<p>“But for two months, the Komagata Maru sat in the harbour. Immigration officials, enforcing discriminatory laws of the time, prevented most passengers from entry.</p>\n\n<p>“Only a few passengers would ever set foot on Canadian soil. The rest were confined to the ship, sometimes going days without food or water. Local South Asian communities tried to protest the federal government’s decision, but to no avail. On July 23, 1914, everyone still onboard the Komagata Maru was forced to return to India, where some were killed and many others imprisoned.</p>\n\n<p>“The shame and suffering caused by this event are a part of our past, and always will be. Five years ago, I stood in the House of Commons to apologize on behalf of the Government of Canada to all those whose lives were impacted by the Komagata Maru incident. What happened more than a century ago still matters today. Whether we choose to learn from the mistakes of the past, and make sure to never repeat them, is up to us all.</p>\n\n<p>“As we remember the victims of the Komagata Maru tragedy and their descendants, I invite all Canadians to reflect on the many contributions Canada’s South Asian communities have made, and continue to make, to our country. Diversity and inclusion are among our greatest strengths, and the cornerstones of a better, fairer, and more prosperous society.”</p></div>\n      "
}