{
  "path": "/en/news/statements/2020/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p>\n\n<p>“First Nations, Inuit, and Métis are the historical backbone of this country. Today, on the <a href=\"https://www.un.org/en/events/indigenousday/\">International Day of the World’s Indigenous Peoples</a>, we celebrate the traditions, values, cultures, and strengths of Indigenous peoples in Canada and around the world. It’s a time to remember and appreciate the contributions they have made in forming the nations we know today, and recommit ourselves to recognizing and protecting their rights. &nbsp;</p>\n\n<p>“No relationship is more important to Canada than the one with Indigenous peoples. That is why we are working to advance reconciliation with Indigenous peoples through a renewed, nation-to-nation, Inuit-Crown, and government-to-government relationship based on affirmation of rights, respect, co-operation, and partnership as the foundation for transformative change.</p>\n\n<p>“We recognize that Indigenous peoples have the inherent right to self-determination, including self-governance, and we are supporting Indigenous communities in implementing their visions. We have made progress in recent years—we have enacted legislation respecting First Nations, Inuit and Métis children, youth and families to affirm jurisdiction in relation to child and family services, and the <em>Indigenous Languages Act</em> as Indigenous peoples are best placed to take the leading role in reclaiming, revitalizing, maintaining, and strengthening Indigenous languages. We know there is still much work to do. We are moving forward with legislation to advance the implementation of the <a href=\"https://www.aadnc-aandc.gc.ca/eng/1309374407406/1309374458958\">United Nations Declaration on the Rights of Indigenous Peoples</a> before the end of this year. The Declaration sets out the standards for the survival, dignity, and well-being of Indigenous peoples around the world and provides guidance to help reconciliation flourish in 21st century Canada.</p>\n\n<p>“We live in a world where the existence, cultures, livelihoods, languages, and unique ways of life of Indigenous peoples have been jeopardized for far too long. We must eliminate the injustices and systemic racism Indigenous peoples have faced for centuries, and continue to face. We know that it is only by working in partnership that we will make real progress in righting historic wrongs, and build a new relationship between Canada and Indigenous peoples to better support Indigenous communities and leadership.</p>\n\n<p>“Reconciliation calls on all of us to confront our past, our biases and actions, and commit to an equitable future. To do this, we must work with Indigenous leaders and communities, amplify their voices, and work to dismantle racism and the barriers to equality Indigenous peoples experience. Working in partnership with Indigenous peoples provides a shared path forward, which includes renewing the Government of Canada’s <a href=\"https://www.canada.ca/en/department-justice/news/2019/08/renewed-legal-relationships-with-indigenous-peoples.html\">relationship with Indigenous peoples</a> in line with the recommendations of the Truth and Reconciliation Commission. This partnership also includes taking important steps together to address gender-based violence against Indigenous women and girls, and the recommendations in the National Inquiry into Missing and Murdered Indigenous Women and Girls’ Final Report.</p>\n\n<p>“This year’s theme for the International Day of the World’s Indigenous Peoples is COVID-19 and Indigenous peoples’ resilience. Longstanding social and economic inequities mean Indigenous communities could be disproportionately affected by COVID-19. We acknowledge the work and strength of First Nations, Inuit, and Métis leaders and communities to establish the needs and priorities within their communities and all the positive measures taken to protect their populations during this unprecedented time. We thank them for their leadership and for the work they have done to help limit the spread of COVID-19 in Canada. The Government of Canada will continue to work closely with Indigenous partners to address the health, economic, and social impacts of the pandemic through distinctions-based, community-led solutions.</p>\n\n<p>“On behalf of the Government of Canada, I encourage us all to learn more about the diverse cultures, languages, and traditions of <a href=\"https://www.bac-lac.gc.ca/eng/discover/aboriginal-heritage/Pages/introduction.aspx\">Indigenous peoples in Canada</a> and around the world. We must continue on the path of reconciliation to ensure that the rights, cultures, and identities of all Indigenous peoples are recognized, implemented, respected, and celebrated, and this is an important step towards that.”</p></div>\n      "
}