{
  "path": "/en/news/statements/2022/11/08/statement-prime-minister-indigenous-veterans-day",
  "pageTitle": "Statement by the Prime Minister on Indigenous Veterans Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Indigenous Veterans Day:</p>\n\n<p>“Today, on <a href=\"https://www.veterans.gc.ca/eng/remembrance/people-and-stories/indigenous-veterans\">Indigenous Veterans Day</a>, we express our heartfelt gratitude to all First Nations, Inuit, and Métis service members who have served in the Canadian Armed Forces. On this day, we also remember those who never made it home and those whose lives – and the lives of their families – were forever changed by conflict and war.</p>\n\n<p>“For over 200 years, Indigenous Peoples have been – and continue to be – an integral part of Canada’s military history. Key battles in the War of 1812 were won thanks to the contributions of brave First Nations and Métis people. In the last century, thousands of volunteers from Indigenous communities across the country enlisted to serve in the First and Second World Wars, in the Korean War, and in peacekeeping missions under the United Nations.</p>\n\n<p>“While serving, a number of Indigenous soldiers became specialized reconnaissance scouts and snipers due to their ability to adapt to different landscapes. In the Second World War, some First Nations soldiers earned the title of ‘code talkers’ for secretly communicating and delivering military intelligence in the Cree language. Code talkers provided a unique service that helped protect our allies and win the war.</p>\n\n<p>“Despite their service and sacrifice during these conflicts, many Indigenous Veterans endured hatred and systemic racism while serving. When they returned to Canada, they did not receive the same benefits, honours, and respect as non-Indigenous Veterans. The Government of Canada is working to ensure that all Indigenous service members and Veterans receive the recognition and the support they deserve – we owe it to them.</p>\n\n<p>“Indigenous Peoples’ legacy of courage and service continues today: there are more than 2,700 Indigenous members serving in the Canadian Armed Forces. We are thankful for their sacrifices and contributions to Canada’s security and peace efforts at home and around the world – from missions to places like Africa, the Middle East, and Afghanistan in recent years, to North Atlantic Treaty Organization duties in Europe, and responding to domestic emergencies such as the COVID-19 pandemic and patrolling the Arctic.</p>\n\n<p>“We all have a duty to remember and honour the sacrifices of Indigenous Peoples who have answered the call to serve. On behalf of the Government of Canada, I encourage everyone to take some time today to honour Indigenous Veterans and learn more about their past and current contributions to Canada’s proud military history.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}