{
  "path": "/en/news/statements/2017/09/04/statement-prime-minister-labour-day",
  "pageTitle": "Statement by the Prime Minister on Labour Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Labour Day:</p><p><span lang=\"EN\" xml:lang=\"EN\">“On Labour Day, we celebrate the many accomplishments of Canada’s labour movement. For more than a century, Canadians have come together to fight for a safer, more equitable, and just workplace. Their hard-won victories brought about fair wages, weekends, and paid sick days, among many other benefits and protections we take for granted today. The discipline and dedication of organized labour continue to build our country and lay the foundation for one of the strongest middle classes in the world. </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Our government was elected on a promise to grow the middle class, and pave the way for more Canadians to have a real and fair chance at success. We have taken great strides to prepare Canadians for the changing economy, and create good, middle class jobs from coast-to-coast-to-coast.&nbsp; </span></p><p><span lang=\"EN\" xml:lang=\"EN\">“Over the past year, we introduced measures to relieve the pressures adults face when deciding to go back to school, made it easier for Canadians on EI to obtain new certificates and training, and helped hundreds of thousands of low- and middle-income students pay their tuition. We also launched the union-based apprenticeship training program, and established agreements to expand affordable, high quality child care across the country.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In the coming months, we </span>will update laws to better support Canadian workers as they seek to balance the responsibilities of work and family. Targeted amendments to the <i>Canada Labour Code</i> will give federally-regulated employees the right to request more flexible work arrangements, such as the ability to work from home, and provide unpaid leave for family responsibilities.</p><p>“We continue to work closely with organized labour to protect and promote workers’ rights, and affirm the vital role unions play in helping the middle class grow and prosper. We recently passed Bill C-4, restoring a fair and balanced approach to federal labour relations, and ratified the International Labour Organization’s Convention 98, recognizing workers’ right to collectively bargain. We also pledged to ban the manufacture, import, export and use of asbestos in Canada by 2018, and renewed our commitment to ensure the Westray Law is applied effectively and negligent employers are held responsible.</p><p>“Organized labour has a strong partner in the Government of Canada. We will continue to stand up for the middle class and invest in Canada’s hardworking, creative, and diverse workforce. Since <span lang=\"EN-US\" xml:lang=\"EN-US\">December 2015, Canada’s unemployment rate has dropped from 7.1 per cent to 6.3 per cent. In the last year, the Canadian economy has created almost 400,000 new jobs. Today, we celebrate Canada’s workers and labour movement who made this progress possible. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On behalf of the Government of Canada, Sophie and I wish all Canadians a safe and happy Labour Day.”&nbsp;</span></p></div>\n      "
}