{
  "path": "/en/news/statements/2017/06/22/statement-prime-minister-canada-accomplishments-made-government-canada",
  "pageTitle": "Statement by the Prime Minister of Canada on accomplishments made by the Government of Canada since January 2017 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, issued the following statement today to highlight some of the accomplishments made by the Government of Canada </span>since January 2017<span lang=\"EN-US\" xml:lang=\"EN-US\">:</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Last year, we raised taxes on the wealthiest one per cent so we could cut taxes for the middle class. We put more money in the pockets of nine out of ten families through the Canada Child Benefit, and strengthened the Canada Pension Plan so more Canadians can achieve a strong, secure, and stable retirement. In 2017, we have built on these accomplishments, and taken further steps to create good, middle class jobs while growing the economy over the long term.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span><span lang=\"EN-US\" xml:lang=\"EN-US\">Between February and June, I signed agreements with the leaders of Inuit Tapiriit Kanatami, the Assembly of First Nations, and the Métis National Council, establishing a process to advance shared priorities for Inuit, First Nations, and the Métis Nation.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In February, I welcomed the European Parliament’s approval of the Comprehensive Economic and Trade Agreement (CETA) between Canada and the European Union. CETA is a gold-standard agreement that will give consumers more choice, make it easier and less costly for businesses to compete, and create good, middle class jobs on both sides of the Atlantic. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In March, Minister Morneau tabled one of the most forward-looking budgets in Canada’s history. With its strong focus on innovation and skills, Budget 2017 prepares Canadians for the changing economy and secures Canada’s place as a hub of innovation. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Budget 2017 makes significant investments in public transit systems, which will result in shorter commute times, less air pollution, and more efficient, better integrated transit. It also invests $11.2 billion in affordable housing to make sure all families have access to a safe and affordable place to live. Budget 2017 is the first federal budget ever to include a gender-based statement, which looks at the ways our policies and investments affect women and men differently.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span><span lang=\"EN-US\" xml:lang=\"EN-US\">In April, we introduced a bill to legalize, strictly regulate, and restrict access to cannabis no later than July 2018. Our legislation will, for the first time, make it a specific criminal offence to sell cannabis to a minor and create significant penalties for those who engage young Canadians in cannabis-related offences.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“In May,</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> we unveiled tax relief measures for deployed Canadian Armed Forces personnel and police officers. We also introduced Bill C-48, the Oil Tanker Moratorium Act, and kept our promise to put a moratorium on crude oil tanker shipping on British Columbia’s north coast. At the end of the month, we announced that Canada will host the 2018 G7 Summit in Charlevoix, Quebec.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“On June 6, Minister Freeland outlined a new foreign policy for Canada, and underscored our commitment to a rules-based international order, progressive trade policies, gender equality, and fighting climate change. The next day, Minister Sajjan unveiled Canada’s new defence policy, which establishes a credible, realistic, and funded strategy for our military and, most importantly</span><span lang=\"EN-US\" xml:lang=\"EN-US\">, will deliver the standard of service and care our women and men in uniform deserve. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“A few days later, Minister Bibeau </span><span lang=\"EN-US\" xml:lang=\"EN-US\">launched Canada’s new Feminist International Assistance Policy. This vision focuses Canada’s international assistance on the empowerment of women and girls, and positions Canada as a leader on gender equality in aid programming. Minister Duclos also announced the Multilateral Early Learning and Child Care Framework, which </span><span lang=\"EN-US\" xml:lang=\"EN-US\">will ensure more Canadian families have access to affordable,</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> high</span><span lang=\"EN-US\" xml:lang=\"EN-US\">-</span><span lang=\"EN-US\" xml:lang=\"EN-US\">quality, </span><span lang=\"EN-US\" xml:lang=\"EN-US\">and </span><span lang=\"EN-US\" xml:lang=\"EN-US\">inclusive</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> child</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> care</span><span lang=\"EN-US\" xml:lang=\"EN-US\">.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“This month, we announced that we will introduce legislation to make it possible to erase the convictions for Canadians who were found guilty of consensual sexual activity with a same sex partner under historical, unjust laws. Three important pieces of government legislation passed Parliament: Bill C-4, which restores a fair and balanced approach to labour relations; Bill C-6, which ends second-class citizenship and makes it easier for hardworking immigrants to become citizens; and Bill C-16, which ensures the full protection of transgender people across Canada.</span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“Earlier this week, Minister Goodale tabled legislation to create a new National Security and Intelligence Review Agency and introduce changes to Bill C-51, which will strengthen security and better protect Canadians’ rights. </span></p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span><span lang=\"EN-US\" xml:lang=\"EN-US\">We have made real progress in helping the middle class and those working hard to join it. Since December 2015, Canada’s unemployment rate has dropped from 7.1 per cent to 6.6 per cent. In the last year, the Canadian economy has created over 300,000 new jobs. We still have plenty of work to do, but as we get ready to celebrate the 150</span><span lang=\"EN-US\" xml:lang=\"EN-US\">th</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> anniversary of Confederation, I am confident that Canada’s best days lie ahead.”</span></p></div>\n      "
}