{
  "path": "/en/news/news-releases/2022/10/04/rebuilding-after-hurricane-fiona",
  "pageTitle": "Rebuilding after Hurricane Fiona | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Atlantic Canadians and Quebecers are resilient. In the wake of Hurricane Fiona’s devastation, thousands are rebuilding their homes and communities, and businesses of all sizes are getting back on their feet. The Government of Canada will continue to respond to the immediate needs of people impacted by the storm and support the long-term recovery of impacted regions and local economies.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the creation of the Hurricane Fiona Recovery Fund. The Fund will provide up to an additional $300&nbsp;million over two years, starting this year, to help those impacted by the storm and to support long-term recovery efforts.</p>\n\n<p>Building on the government’s ongoing response to Hurricane Fiona in Atlantic Canada and Eastern Quebec, the Fund will support recovery efforts such as:</p>\n\n<ul>\n\t<li>Helping local communities and businesses rebuild and recover more quickly from the impacts of Hurricane Fiona.</li>\n\t<li>Restoring the economic activity that local communities depend on by beginning to repair and rebuild critical infrastructure, including fishing wharves and small craft harbours that were damaged or destroyed by the storm. Repairs will ensure that the infrastructure is better able to withstand any future damage.</li>\n\t<li>Ensuring the safety of navigation and protecting marine wildlife.</li>\n</ul>\n\n<p>The new Fund will provide support for costs that may not be covered by existing federal programs, including the Disaster Financial Assistance Arrangements (DFAA). Through the DFAA, the federal government covers up to 90 per cent of eligible provincial expenses following a disaster, including providing transportation, emergency food, and shelter, and restoring or replacing uninsurable dwellings and items.</p>\n\n<p>Recovering from the widespread impacts of Hurricane Fiona will require a collective effort. The new Hurricane Fiona Recovery Fund builds on the support the federal government has already announced, including deploying Canadian Armed Forces members and matching donations made to the Canadian Red Cross. We will keep working in partnership with provincial governments, municipal partners, and local First Nations communities to continue providing additional financial support to rebuild communities and the economy.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Our thoughts are with all Canadians dealing with the aftermath of Hurricane Fiona. There is still much work to be done in the days and months ahead to clean up and rebuild, but I know Atlantic Canadians and Quebecers will continue to be there for each other, and so will the Government of Canada. This new Fund, announced today, will help people and local communities move forward on the path to recovery.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“The people of Atlantic Canada and Eastern Quebec have already done so much to begin recovering from Fiona’s devastation. And now, they need our support to restart their economy.&nbsp;The new Hurricane Fiona Recovery Fund, and the existing Disaster Financial Assistance Arrangements, will provide that much needed support. Together, we will help build back the lives and livelihoods that have been uprooted.”</p>\n\n<footer class=\"default\">The Hon. Chrystia Freeland, Deputy Prime Minister and Minister of Finance</footer>\n</blockquote>\n\n<blockquote>\n<p>“In tough times, Atlantic Canadians come together. Neighbours are helping neighbours, and crews have been working long hours to clear the debris off our streets and restore power to our homes. Our government is doing everything we can to help. This Fund is welcome news for our region, allowing our wharves, small businesses, and communities to get the financial assistance they need as we build back from Hurricane Fiona and get life back to normal.”</p>\n\n<footer class=\"default\">The Hon. Sean Fraser, Minister of Immigration, Refugees and Citizenship</footer>\n</blockquote>\n\n<blockquote>\n<p>“My heart goes out to all the people in Atlantic Canada and Eastern Quebec dealing with the aftermath of Hurricane Fiona. The Hurricane Fiona Recovery Fund will support those areas impacted by the storm through long-term recovery efforts, such as critical infrastructure and fishing wharves to help restore the local economy. As we begin to rebuild our communities, the Government of Canada will continue to be there to support Newfoundlanders in making sure you have a place to return to and call home. Having been on the ground and seen the devastation first-hand, I know how important it is for our local communities to get back on their feet.”</p>\n\n<footer class=\"default\">The Hon. Gudie Hutchings, Minister of Rural Economic Development</footer>\n</blockquote>\n\n<blockquote>\n<p>“Communities across Atlantic Canada and Eastern Quebec have pulled together in the wake of Hurricane Fiona and our government will be there to help them regain a sense of normality as quickly as possible. As we rebuild, we are committed to making our core infrastructure more resilient so that we can be better prepared for future natural disasters. We will continue working closely with our provincial partners as we help Atlantic Canadians and Quebecers get through this.”</p>\n\n<footer class=\"default\">The Hon. Dominic LeBlanc, Minister of Intergovernmental Affairs, Infrastructure and Communities</footer>\n</blockquote>\n\n<blockquote>\n<p>“I have seen firsthand the heartbreaking damage caused by Hurricane Fiona, as well as the dedication and resilience of the people of les Îles-de-la-Madeleine and our neighbours in Atlantic Canada. We are helping people by extending GST/HST filing deadlines, and providing relief to impacted businesses and taxpayers, whenever possible. The Canada Revenue Agency strives to put people first, and this continues to be its priority.”</p>\n\n<footer class=\"default\">The Hon. Diane Lebouthillier, Minister of National Revenue</footer>\n</blockquote>\n\n<blockquote>\n<p>“Islanders are feeling the impacts of Fiona in everything they do and everywhere they go. I’ve seen the destruction that Fiona has brought to our homes, our businesses, and our communities. This $300&nbsp;million Fund will go a long way to rebuild so much of what we’ve lost, including wharves and other infrastructure, and will help strengthen them to withstand future storms.”</p>\n\n<footer class=\"default\">The Hon. Lawrence MacAulay, Minister of Veterans Affairs and Associate Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“I’ve been hugely concerned about Hurricane Fiona’s impact. The scope of loss for harvesters in Atlantic Canada and Eastern Quebec has been tremendous, including gear loss and damage to small craft harbours. Today’s announcement is an important step in cleaning up the ocean, and starting repairs at affected harbours. We need to make sure these critical pieces of community infrastructure are safe and accessible to the people who rely on them, and to make them more resilient to future extreme weather events.”</p>\n\n<footer class=\"default\">The Hon. Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard</footer>\n</blockquote>\n\n<blockquote>\n<p>“Hurricane Fiona hit us hard. People displaced, homes and businesses destroyed, memories lost. Newfoundlanders know the days ahead will not be easy. But we will get through this and rebuild.”</p>\n\n<footer class=\"default\">The Hon. Seamus O’Regan Jr., Minister of Labour</footer>\n</blockquote>\n\n<blockquote>\n<p>“The Atlantic Canada Opportunities Agency has always been there for Atlantic Canadians in times of need.&nbsp;Today, we announce the launch of the Hurricane Fiona Recovery Fund, an important step that will help Atlantic Canadians in their rebuilding efforts. We remain committed to working closely with businesses of all sizes, organizations, and communities who are dealing with the devastating impacts of Hurricane Fiona.”</p>\n\n<footer class=\"default\">The Hon. Ginette Petitpas Taylor, Minister of Official Languages and Minister responsible for the Atlantic Canada Opportunities Agency</footer>\n</blockquote>\n\n<blockquote>\n<p>“We know that for families, businesses, and municipalities, rebuilding after a disaster can seem like an insurmountable task – but we’re here to help relieve some pressure from the communities devastated by Hurricane Fiona. We don’t choose when a disaster will hit, but I know the courage and resilience of the people in Eastern Quebec and the Maritimes, and I know they will prevail. I am proud that the agency I’m overseeing contributes to this recovery fund.”</p>\n\n<footer class=\"default\">The Hon. Pascale St-Onge, Minister of Sport and Minister responsible for the Economic Development Agency of Canada for the Regions of Quebec</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The Hurricane Fiona Recovery Fund will be coordinated by the Atlantic Canada Opportunities Agency, which will work with other federal departments and agencies, such as Canada Economic Development for Quebec Regions, Fisheries and Oceans Canada, and Transport Canada, to determine local needs and allocate funds accordingly.</li>\n\t<li>Immediately following Hurricane Fiona’s landfall, the federal government approved a request for federal assistance from the Government of Nova Scotia, and further requests for assistance from Prince Edward Island and Newfoundland and Labrador were also approved shortly after they were received.</li>\n\t<li>In response to these requests, the government continues to support provinces with their immediate needs. Since the storm, up to 850 Canadian Armed Forces members have been deployed to remove debris to assist in the restoration of transportation links and the power grid, as well as perform wellness checks in affected communities.</li>\n\t<li>The Government of Canada will also provide financial assistance to provincial governments through the Disaster Financial Assistance Arrangements (DFAA). Through the DFAA, the government covers up to 90 per cent of eligible provincial expenses following a disaster, including:\n\t<ul>\n\t\t<li>Evacuation, transportation, emergency food, shelter, and clothing;</li>\n\t\t<li>Repairs to public buildings and related equipment, roads, and bridges;</li>\n\t\t<li>Restoration or replacement of individuals’ uninsurable dwellings (principal residences only), personal furnishings, appliances, and clothing; and,&nbsp;</li>\n\t\t<li>Restoration of small businesses and farmsteads, including uninsurable buildings and equipment.</li>\n\t</ul>\n\t</li>\n\t<li>On September 25, 2022, the Government of Canada announced a donation-matching program with the Canadian Red Cross to support those impacted by the storm. The government will continue to match donations Canadians and corporations make for the next 30 days from September 25, with the possibility of extension.</li>\n\t<li>Residents who have been impacted by Hurricane Fiona should register with the Canadian Red Cross by calling 1-800-863-6582 or online at <a href=\"http://www.redcross.ca/hurricanefiona\">www.redcross.ca/hurricanefiona</a>.</li>\n\t<li>Canadians wishing to make a financial donation to help those impacted by Hurricane Fiona can do so online at <a href=\"https://donate.redcross.ca/page/114083/donate/1?locale=en-CA&amp;_ga=2.59294957.1709095202.1664890699-1179579043.1664052953&amp;_gl=1*zr38lv*_ga*MTE3OTU3OTA0My4xNjY0MDUyOTUz*_ga_376D8LHM0R*MTY2NDg5MDY5OC41LjEuMTY2NDg5MDc1My4wLjAuMA..\">www.redcross.ca</a>, by calling 1-800-418-1111, or by texting FIONA to 20222 to make a $10 donation.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/campaigns/hurricane.html?utm_source=canada-ca&amp;utm_medium=promo&amp;utm_campaign=hurricane-fiona\">Government of Canada Response to Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/10/government-of-canada-providing-assistance-to-atlantic-canada-with-recovery-from-hurricane-fiona.html\">Government of Canada providing assistance to Atlantic Canada with recovery from Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/09/government-of-canada-and-canadian-red-cross-establish-donation-matching-program-to-support-canadians-impacted-by-hurricane-fiona.html\">Government of Canada and Canadian Red Cross establish donation-matching program to support Canadians impacted by Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/mrgnc-mngmnt/rcvr-dsstrs/dsstr-fnncl-ssstnc-rrngmnts/index-en.aspx\">Disaster Financial Assistance Arrangements</a></li>\n</ul></div>\n      "
}