{
  "path": "/en/news/news-releases/2018/03/15/prime-minister-announces-appointment-senator",
  "pageTitle": "Prime Minister announces the appointment of a Senator | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Governor General has appointed Yvonne Boyer as an independent Senator to fill a vacancy for Ontario.</p><p>A member of the Métis Nation of Ontario, Dr. Boyer has enjoyed a distinguished career as a lawyer, professor, and researcher. Throughout her career, she has worked tirelessly to examine and address the inequalities that exist between Indigenous Peoples and non-Indigenous people in health care services and delivery.</p><p>Dr. Boyer was recommended by the Independent Advisory Board for Senate Appointments and chosen using the merit-based process open to all Canadians. This process ensures Senators are independent, reflect Canada’s diversity, and are able to tackle the broad range of challenges and opportunities facing the country.</p><h2>Quote</h2><blockquote><p>“I am delighted to welcome Parliament’s newest independent Senator, Yvonne Boyer. I am confident that Parliament will benefit from Dr. Boyer’s knowledge and experience, and that she will be a great ambassador for Ontario, the Métis Nation, and all of Canada.”<br><cite>– Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Dr. Boyer will be the first Senator from Ontario to identify as Indigenous. She is a member of the Métis Nation of Ontario with ancestral roots in the Métis Nation-Saskatchewan and the Red River.</li><li>There have been 33 appointments to the Senate made on the advice of Prime Minister Justin Trudeau.</li><li>Under the Canadian Constitution, the Governor General appoints individuals to the Senate. By convention, Senators are appointed on the advice of the Prime Minister.</li><li>Since 2016, the selection process for Senators has been opened to allow all Canadians to apply. Candidate submissions are reviewed by the Independent Advisory Board for Senate Appointments, which provides the Prime Minister with recommendations. From the recommended pool of candidates, the Prime Minister selects the individuals he then recommends to the Governor General for appointment to the Senate.</li><li>Canadians may now apply for a Senate seat at anytime. For the next applications review cycle, the Independent Advisory Board for Senate Appointments will consider applications received by April 3, 2018, to fill vacancies in 10 provinces and territories.</li><li>The Independent Advisory Board for Senate Appointments is guided by public, transparent, non-partisan and merit-based <a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/assessment-criteria.html\">criteria</a> to identify highly qualified candidates.</li><li>Once appointed by the Governor General and summoned to the Senate, the new Senators join their peers to examine and revise legislation, investigate national issues, and represent regional, provincial and minority interests –important functions in a modern democracy.</li></ul><h2>Biographical Notes</h2><ul><li><a href=\"/en/news/backgrounders/2018/03/15/yvonne-boyer\">Yvonne Boyer</a></li></ul><h2>Associated Links</h2><ul><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/frequently-asked-questions.html\">Frequently Asked Questions – Senate appointments process</a></li><li><a href=\"https://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments.html\">Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2018/02/minister_gould_announcesimprovementstothesenateappointmentsproce.html\">Minister of Democratic Institutions announces improvements to the Senate appointments process and launches call for applications</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/7/minister-of-democratic-institutions-announces-launch-of-the-permanent-phase-of-the-independent-senate-appointments-process.html\">Minister of Democratic Institutions announces launch of the permanent phase of the Independent Senate Appointments Process</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2016/1/minister-of-democratic-institutions-announces-establishment-of-the-independent-advisory-board-for-senate-appointments.html\">Minister of Democratic Institutions announces establishment of the Independent Advisory Board for Senate Appointments</a></li><li><a href=\"https://www.canada.ca/en/democratic-institutions/news/2015/12/government-announces-immediate-senate-reform.html\">Government announces immediate Senate reform</a></li></ul></div>\n      "
}