{
  "path": "/en/news/statements/2018/01/04/statement-prime-minister-20th-anniversary-great-ice-storm",
  "pageTitle": "Statement by the Prime Minister on the 20th anniversary of the Great Ice Storm | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement to mark the 20<sup>th</sup> anniversary of the Great Ice Storm:</p><p>“On this day, twenty years ago, freezing rain began to fall in Eastern Canada. For the next five days, the rain fell, coating cars, homes, trees, power lines – everything – in as much as 100 mm of ice.</p><p>“Power lines and hydro towers collapsed under the weight of the ice, leaving more than three million people in Ontario, Quebec, New Brunswick, and Nova Scotia in the dark. Blackouts lasted for days, weeks, and, in some cases, even months.</p><p>“The storm paralyzed Eastern Canada, as day-to-day routines became nearly impossible. Without electricity, heat, food, and water, people were forced out of their homes and businesses could not stay open. The freezing rain made all forms of transportation treacherous. Impassable roads hindered basic services and made it difficult for emergency vehicles to help those most in need. Thirty-five Canadians died as a result of the storm.</p><p>“Almost 16,000 Canadian Armed Forces personnel were deployed in the largest peace time deployment in Canadian history. Soldiers and police officers went from home to home, checking on people, making sure they were okay. Hydro workers toiled day and night to clear debris and restore power.</p><p>“Meanwhile, Canadians welcomed neighbours, friends, and family into their homes, sharing generators and hot food. They prepared meals by candlelight, and turned libraries and arenas into shelters so people could find refuge from the cold.</p><p>“Twenty years later, time has not dimmed the outpouring of compassion, and sense of community, Canadians showed to each other. Today, I hope all Canadians reflect on, or learn more about, the Great Ice Storm, and how we were there for each other.”</p></div>\n      "
}