{
  "path": "/en/news/news-releases/2020/10/01/prime-minister-announces-reappointment-canadas-top-scientist",
  "pageTitle": "Prime Minister announces reappointment of Canada’s top scientist | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Science is essential to ensuring Canada has the tools, opportunities, and expertise needed to address the most pressing questions we face as a country.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced Dr. Mona Nemer’s reappointment as Canada’s Chief Science Advisor.</p>\n\n<p>In this role, Dr. Nemer will continue to promote science and its benefits for Canadians, and provide impartial scientific advice to the Prime Minister, the Minister of Innovation, Science and Industry, and Cabinet. Over the past few months, she has also been advising on the latest scientific developments in COVID-19 research to assist with the response to the global pandemic.</p>\n\n<p>Dr. Nemer has served as Canada’s Chief Science Advisor since September 2017. Her reappointment will allow her to build on the achievements of her first term, which include the creation of science advisor positions across federal organizations, and guidance and recommendations on a $2.8 billion investment to build federal science and technology facilities. She also helped develop a policy to guide federal scientists, departments, and employees conduct and use federal research and science responsibly, and to better communicate the results to Canadians.</p>\n\n<p>Dr. Nemer is a distinguished medical researcher in the field of molecular cardiology. Before becoming Chief Science Advisor, she spent more than ten years as the Vice‑President of Research at the University of Ottawa, and was the Director of its Molecular Genetics and Cardiac Regeneration Laboratory. Dr. Nemer is the author of over 200 academic publications, and has served on many national and international scientific advisory committees and boards. She is a Member of the Order of Canada, and a Knight of the Ordre national du Québec.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Over the past three years, Dr. Nemer has provided invaluable expert advice to myself and all members of Cabinet, and worked to ensure that government science is fully available to the public. Now more than ever, science will lead the fight as we work to overcome the global COVID-19 pandemic, and Dr. Nemer will continue to be a key player in her role as Chief Science Advisor.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Dr. Mona Nemer has played a pivotal role advising the Government of Canada on matters of science over the last three years, and has been an invaluable resource over the course of the COVID-19 pandemic. I am pleased that she will continue in this important role ensuring that science and evidence-based decision making continues to inform government decision making.”</p>\n\n<footer class=\"default\">The Hon. Navdeep Bains, Minister of Innovation, Science and Industry</footer>\n</blockquote>\n\n<blockquote>\n<p>“I am delighted and honoured to be reappointed as our country’s Chief Science Advisor. My team and I are happy to continue working with Canada’s diverse, committed, and exceptional science community to advise our decision-makers as we continue our fight against the pandemic and build a better future for us all.”</p>\n\n<footer class=\"default\">Dr. Mona Nemer, Canada’s Chief Science Advisor</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>Dr. Nemer was appointed as Canada’s Chief Science Advisor following an open, transparent, and merit-based selection process.</li>\n\t<li>Dr. Nemer’s second term is effective September 25, 2020, for a period of two years.</li>\n\t<li>The Office of the Chief Science Advisor is housed at Innovation, Science and Economic Development Canada.</li>\n\t<li>The Chief Science Advisor’s key functions include:\n\t<ul>\n\t\t<li>providing advice on the development and implementation of guidelines to ensure that government science is fully available to the public and that federal scientists are able to speak freely about their work.</li>\n\t\t<li>providing advice on creating and implementing processes to ensure that scientific analyses are considered when the government makes decisions.</li>\n\t\t<li>assessing and recommending ways to improve the existing science advisory function within the federal government.</li>\n\t\t<li>assessing and recommending ways for the government to better support quality scientific research within the federal system.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2020/10/01/dr-mona-nemer-cm-cq-frsc\">Dr. Mona Nemer, C.M., C.Q., FRSC<strong>&nbsp;</strong></a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.ic.gc.ca/eic/site/063.nsf/eng/h_97646.html\">Office of the Chief Science Advisor</a></li>\n</ul></div>\n      "
}