{
  "path": "/en/news/statements/2016/10/22/statement-prime-minister-canada-anniversary-attack-national-war-memorial",
  "pageTitle": "Statement by the Prime Minister of Canada on the anniversary of the attack at the National War Memorial and Parliament Hill in Ottawa | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the two-year anniversary of the attack at&nbsp;the National War Memorial and Parliament Hill:</p>\n<p>“Two years ago, Canadians were shocked by the brutal attack that took place in and around Parliament that claimed the life of Corporal Nathan Cirillo and injured others.</p>\n<p>“This vicious attack, at the very heart of our democracy, sought to frighten and divide Canadians. Instead it had the exact opposite effect, drawing us closer together and making us stronger. In the wake of this deadly assault, parliamentarians and Canadians united in condemning terrorism and further embracing our diversity.</p>\n<p>“The whole country honoured first responders – Senate and House of Commons Protective Services, the RCMP, former House of Commons Sergeant-at-Arms Kevin Vickers, medical personnel and others – for their bravery and their willingness to put themselves in harm’s way for Canadians of all backgrounds and faiths.</p>\n<p>“It showed the world that Canada will not be intimidated by hatred and violence, but will meet these acts with strength and conviction. This also showed me yet again that our diversity and collective love of democracy are what make our country strong and our nation great.</p>\n<p>“I join all Canadians today in mourning the loss of Corporal Cirillo and Warrant Officer Patrice Vincent – who was killed two days earlier in an attack in Saint-Jean-sur-Richelieu, Quebec.</p>\n<p>These two members of the Canadian Armed Forces made the ultimate sacrifice for the country they loved. The most fitting tribute that we can pay them is defending the values that they so personified.”</p></div>\n      "
}