{
  "path": "/en/news/news-releases/2016/11/18/prime-minister-justin-trudeau-concludes-successful-first-official",
  "pageTitle": "Prime Minister Justin Trudeau concludes successful first official visit to Argentina | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today wrapped up a productive official visit to Argentina, where he took concrete action to strengthen Canada’s relationship with one of its largest trading partners in South America.</p><p>During the meeting with President Mauricio Macri, the two leaders discussed issues of importance to Canada and Argentina – including the creation of good-paying, middle class jobs, the promotion of economic growth that benefits all citizens, increased collaboration on polar research, and the relaunch of consultative mechanisms on human rights and nuclear cooperation.</p><p>While in Buenos Aires, the Prime Minister met with members of the Argentina-Canada Chamber of Commerce and participated in a roundtable organized by the Canadian Council for the Americas.</p><p>In these meetings, the Prime Minister highlighted how Canadian companies already consider Argentina an important market and commercial partner. He also noted that Canadian businesses recognize the potential for increased commerce with Argentina as the country implements an ambitious, inclusive, and sustainable economic plan with a strong focus on international trade and investment.&nbsp;</p><h2>Quote</h2><blockquote><p>“My first official visit to Argentina has reaffirmed that both of our countries have much in common with respect to diversity, inclusive growth, and prosperity. We look forward to building on our relationship with Argentina – particularly with regard to trade and investment –creating real opportunities for the middle class and those working hard to join it.”<br><cite>—Rt. Honourable Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li>Prime Minister Trudeau last met with President Macri on March 31, 2016, in Washington, D.C. on the margins of the Nuclear Safety Summit.</li><li>Argentina is a key partner for Canada in the Americas, with a robust trade and investment relationship.</li><li>In 2015, bilateral merchandise trade between Canada and Argentina totalled nearly $2.2&nbsp;billion.</li><li>The stock of Canadian direct investment in Argentina totalled $1.18 billion in 2015.</li><li>The two countries pledged to collaborate in the lead up to 2018, when Argentina will host the G20 Summit and Canada will host the G7 Summit.&nbsp;</li><li>During his visit, the Prime Minister visited the Parque de la Memoria, a memorial to the victims of the 1976-1983 military regime.</li></ul><h2>Related Products</h2><ul><li><a href=\"/en/news/backgrounders/2016/11/18/fact-sheet-ensuring-sound-and-sustainable-natural-resource-management\">Fact Sheet - Ensuring sound and sustainable natural resource management</a></li><li><a href=\"/en/news/backgrounders/2016/11/18/fact-sheet-strengthening-ties-between-canada-and-argentina-and\">Fact Sheet - Strengthening ties between Canada and Argentina and creating new opportunities for trade and investment</a></li></ul><h2>Associated Link</h2><ul><li><a href=\"http://www.canadainternational.gc.ca/argentina-argentine/index.aspx?lang=eng\">Embassy of Canada to Argentina</a></li></ul><p>&nbsp;</p></div>\n      "
}