{
  "path": "/en/news/readouts/2021/07/15/prime-minister-justin-trudeau-holds-33rd-call-premiers-covid-19-response",
  "pageTitle": "Prime Minister Justin Trudeau holds 33rd call with premiers on COVID-19 response | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Intergovernmental Affairs Dominic LeBlanc held the 33rd call with Canada’s provincial and territorial premiers to discuss their shared response to the global COVID-19 pandemic.</p>\n\n<p>The Prime Minister began the meeting by reiterating his commitment to reconciliation in Canada, highlighting the first Coordination Agreement under the <em>Act respecting First Nations, Inuit and Métis children, youth and families </em>signed with Cowessess First Nation – Treaty 4 Territory – and the Province of Saskatchewan. The Prime Minister noted the historic appointment of Mary Simon as Canada’s 30th Governor General, the first Indigenous person to fill this role. He also touched on the progress in implementing a Canada-wide system of quality early learning and child care, and highlighted the importance of continuing to advance this priority.</p>\n\n<p>The Prime Minister and premiers spoke of the serious wildfire situation across the country, particularly in British Columbia and Ontario. With the dry conditions and anticipated extreme weather, this season is expected to be a challenging one. The federal government is providing air and evacuation support, and jurisdictions across the country are also assisting in the fight against wildfires. The Prime Minister highlighted the importance of working closely together, particularly with Indigenous communities, to ensure an effective and rapid emergency response. He committed to continuing to work with premiers and reiterated that the federal government stands ready to provide additional support to manage wildfires and floods, and keep people safe.</p>\n\n<p>First Ministers continued their discussions on the COVID-19 situation, noting that case numbers and severe illness continue to decline across the country as vaccination rates continue to increase. The Prime Minister noted that Canada continues to lead G20 countries in vaccination rates with approximately 80 per cent of eligible Canadians vaccinated with their first dose and over 50 per cent of eligible Canadians fully vaccinated. He thanked premiers for their efforts in ramping up vaccinations across the country. With the risk of localized outbreaks and the threat posed by variants of concern, the Prime Minister encouraged collective momentum to ensure that as many people as possible are fully vaccinated.</p>\n\n<p>First Ministers also discussed how to continue safely adjusting border measures. The Prime Minister noted that, if our current positive path of vaccination rate and public health conditions continue, Canada would be in a position to welcome fully vaccinated travellers from all countries by early September. He noted the ongoing discussions with the United States on reopening plans, and indicated that we could expect to start allowing fully vaccinated U.S. citizens and permanent residents into Canada as of mid-August for non-essential travel. First Ministers expressed their support of reopening plans, and agreed on the importance of ensuring clarity and predictability as initial steps are taken. The Prime Minister indicated that ministers would share more details on these plans early next week. Finally, First Ministers discussed the importance of working collaboratively on a proof of vaccination credential, and prioritizing work to implement a system that would enable Canadians to travel internationally with confidence.</p>\n\n<p>First Ministers reiterated their commitment to a collaborative approach to ending the COVID-19 pandemic and reopening Canada’s economy.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/new-support-child-and-family-services-cowessess-first-nation\">New support for child and family services in Cowessess First Nation</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Prime Minister announces The Queen’s approval of Canada’s next Governor General</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2021/07/14/prime-minister-justin-trudeau-convenes-incident-response-group-discuss\">Prime Minister Justin Trudeau convenes the Incident Response Group to discuss wildfires and extreme weather across the country</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/covid-19-vaccine-treatment/vaccine-rollout.html\">Vaccines for COVID-19: Shipments and deliveries</a></li>\n\t<li><a href=\"https://travel.gc.ca/travel-covid\">COVID-19: Travel, testing, quarantine and borders</a></li>\n</ul></div>\n      "
}