{
  "path": "/en/news/readouts/2022/12/20/prime-minister-justin-trudeau-meets-quebec-premier-francois-legault",
  "pageTitle": "Prime Minister Justin Trudeau meets with Quebec Premier François Legault | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with Quebec Premier François Legault to discuss shared priorities. They agreed to continue working together to make life more affordable for Quebecers and all Canadians.</p>\n\n<p>The Prime Minister and the Premier agreed that, in the context of high inflation over the past several months, an increased risk of cost overruns, and significant changes to the scope of a number of infrastructure projects that will improve the lives of Quebecers, both governments will increase their funding for projects related to the Montréal Metro’s Blue Line, Quebec City’s tramway, and the construction of the Lac-Mégantic rail bypass, all in the same ratios as initially announced.</p>\n\n<p>The Prime Minister and the Premier discussed health care funding and the importance of sharing data in order to compare and measure results, while respecting each government’s respective jurisdictions.</p>\n\n<p>The Prime Minister and the Premier welcomed the success of the 15th meeting of the Conference of the Parties (COP15) to the United Nations Convention on Biological Diversity, which was held in Montréal from December&nbsp;7 to 19, and recognized the collaboration between Canada and Quebec on environmental issues.</p>\n\n<p>The Prime Minister and the Premier reaffirmed both governments’ commitment to actively working together to increase temporary and permanent Francophone immigration in Quebec and across Canada, as well as their joint commitment to protecting French in Quebec.</p>\n\n<p>Prime Minister Trudeau reiterated that Quebec is a very important partner in managing the arrival of irregular asylum seekers who enter via Roxham Road, and that the Government of Canada will continue to support Quebec on this issue.</p>\n\n<p>Prime Minister Trudeau and Premier Legault agreed to continue working together on these issues and other shared priorities.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/transport-canada/news/2022/11/the-government-of-canada-reaches-an-agreement-in-principle-with-the-town-of-lac-megantic-on-the-rail-bypass-project.html\">The Government of Canada reaches an agreement-in-principle with the Town of Lac-Mégantic on the rail bypass project</a></li>\n\t<li><a href=\"https://deputypm.canada.ca/en/news/news-releases/2022/12/16/federal-government-announces-record-transfers-provinces-and\">Federal government announces record transfers to provinces and territories</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/12/06/canada-welcomes-world-cop15-protect-nature\">Canada welcomes the world for COP15 to protect nature</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/19/prime-minister-justin-trudeau-meets-quebec-premier-francois-legault\">Prime Minister Justin Trudeau meets with Quebec Premier François Legault</a></li>\n</ul></div>\n      "
}