{
  "path": "/en/news/news-releases/2021/06/30/4500-more-homes-canadians",
  "pageTitle": "4,500 more homes for Canadians | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Every Canadian deserves a safe and affordable place to call home. However, the COVID-19 pandemic has increased the need for affordable housing and led to rising levels of homelessness. The Government of Canada created a national strategy to build thousands of units and provide affordable housing to people across the country. By continuing to make investments in affordable housing, the government is building stronger communities, creating jobs, and growing our middle class, while fighting homelessness and helping vulnerable Canadians.</p>\n\n<p>The Prime Minister, Justin Trudeau, today announced the creation of 4,500 new affordable housing units across the country with an additional investment of $1.5&nbsp;billion through the Rapid Housing Initiative (RHI). These housing units will support Canadians who are in uncertain housing situations, experiencing or at risk of homelessness, or living in temporary shelters because of the pandemic.</p>\n\n<p>This funding will be divided into two streams:</p>\n\n<ul>\n\t<li><strong>Cities Stream:</strong> $500 million will be allocated to 30 pre-determined municipalities across Canada based on the number of renters in severe housing need, local market housing costs, and a regional distribution.</li>\n\t<li><strong>Projects Stream:</strong> $1 billion will be allocated to eligible applications submitted during the RHI’s initial application period last fall and having not yet received funding.</li>\n</ul>\n\n<p>Since 2015, the Government of Canada has helped more than one million Canadians have a safe and affordable place to call home. Today’s announcement is in addition to $1&nbsp;billion in funding for the RHI announced in October 2020, and combined, these investments will support over 9,200 new affordable housing units for vulnerable Canadians across the country. This new investment will create thousands of good jobs in the housing and construction sector, grow the middle class, and build back stronger communities, while getting us closer to our goal of eliminating chronic homelessness in Canada.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“Canadians should not have to choose between paying rent and putting food on the table. By continuing to make substantial investments in affordable housing, we’re creating new jobs, growing our middle class, and strengthening our communities. As we finish the fight against COVID-19, we will keep focusing on the priorities of Canadians, and build back a stronger and more resilient country.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>“Every Canadian deserves a safe and affordable place to call home. Today's additional funding through the Rapid Housing Initiative will go a long way to support those who need it most by creating 4,500 additional affordable homes for vulnerable individuals and families. This is one of the ways our National Housing Strategy continues to ensure no one is left behind.”</p>\n\n<footer class=\"default\">The Hon. Ahmed Hussen, Minister of Families, Children and Social Development and Minister responsible for Canada Mortgage and Housing Corporation</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The RHI is delivered by the Canada Mortgage and Housing Corporation (CMHC), under the National Housing Strategy (NHS).</li>\n\t<li>Canada’s NHS is an ambitious, 10-year plan that will invest over $72 billion to give more Canadians a place to call home. Launched in 2017, the NHS will build and repair thousands of housing units, and help households with affordability support.</li>\n\t<li>Today’s announcement of $1.5 billion for the RHI in 2021-22 was outlined in Budget 2021 to address the urgent housing needs of vulnerable individuals by providing them with affordable housing in short order.</li>\n\t<li>Funding under the Cities Stream will be allocated to the following municipalities: Toronto, Montréal, Vancouver, Region of Peel, Ottawa, Calgary, Edmonton, Surrey, Halifax, Hamilton, Winnipeg, Capital Regional District (British Columbia), Region of Waterloo, Burnaby, London, Québec City, Niagara Region, Region of Durham, Windsor, Laval, Longueuil, Regina, Saskatoon, Kingston, Sudbury, Gatineau, St.&nbsp;John's, Whitehorse, Yellowknife, and Iqaluit.</li>\n\t<li>Based on feedback from stakeholders, CMHC has introduced new flexibilities to the RHI:&nbsp;\n\t<ul>\n\t\t<li>Program applicants will be eligible to receive funding for additional forms of new construction beyond modular, if units can be built within 12 months.</li>\n\t\t<li>Non-profits will now have an opportunity to demonstrate that they have the financial capacity to support the viability of units without government subsidy (self-funded).&nbsp;</li>\n\t\t<li>Cities will have a longer time to submit projects (60 days instead of 30).</li>\n\t\t<li>Project delivery timelines have been adjusted for projects located in the North and special access communities.</li>\n\t</ul>\n\t</li>\n</ul>\n\n<ul>\n\t<li>At least 25 per cent of this new funding will go toward women-focused housing projects. The units will be built within 12 months of when funding is provided to program applicants.</li>\n\t<li>The RHI will continue to prioritize proposals that target units serving Indigenous peoples, and to provide flexibilities on timelines to Indigenous governing bodies or organizations as needed.</li>\n\t<li>Due to the considerable response during the first round of the Projects Stream, many eligible applications remain unfunded. Applicants with eligible proposals from the first round of RHI that have not yet received funding will be contacted directly with further details.</li>\n\t<li>The RHI takes a human rights-based approach to housing, serving people experiencing or at risk of homelessness and other vulnerable people under the NHS, including: women and children fleeing domestic violence, seniors, young adults, Indigenous peoples, people with disabilities, people experiencing mental health and addiction issues, veterans, LGBTQ2 individuals, racialized and Black Canadians, and recent immigrants or refugees.</li>\n\t<li>CMHC supports the government’s efforts to improve the well-being of Canadians facing housing and homelessness challenges caused by the COVID-19 pandemic.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.cmhc.ca/RapidHousing\">Rapid Housing Initiative</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/nhs\">National Housing Strategy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/27/new-rapid-housing-initiative-create-3000-new-homes-canadians\">New Rapid Housing Initiative to create up to 3,000 new homes for Canadians</a></li>\n\t<li><a href=\"https://www.cmhc-schl.gc.ca/en/media-newsroom/news-releases/2021/canada-provides-update-rapid-housing-initiative\">Rapid Housing Initiative will exceed targets by creating more than 4,700 new homes for Canadians</a></li>\n\t<li><a href=\"https://www.budget.gc.ca/2021/report-rapport/p2-en.html#chap6\">Budget 2021: A Recovery Plan for Jobs, Growth, and Resilience</a></li>\n</ul></div>\n      "
}