{
  "path": "/en/news/statements/2022/05/13/statement-prime-minister-welcoming-his-holiness-pope-francis-upcoming",
  "pageTitle": "Statement by the Prime Minister welcoming His Holiness Pope Francis’ upcoming visit to Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement welcoming the announcement of His Holiness Pope Francis’ visit to Canada. His Holiness will be in Canada from July 24 to 29, 2022:</p>\n\n<p>“I welcome the news of His Holiness Pope Francis’ visit to Canada this summer to formally deliver the Roman Catholic Church’s apology for its role in operating residential schools that caused lasting pain and suffering to Indigenous Peoples in this country.</p>\n\n<p>“His Holiness’ upcoming visit would not be possible without the bravery and determination of the Survivors, Indigenous leaders, and youth who shared their stories<a name=\"_Hlk102425002\" id=\"_Hlk102425002\">.</a></p>\n\n<p>“While His Holiness delivered an apology in Rome last month, a formal in-person apology in Canada from the Roman Catholic Church to Survivors and their families would respond to Call to Action #58 of the Truth and Reconciliation Commission (TRC). This would be an important – and necessary – step for the Roman Catholic Church to continue engaging in dialogue with First Nations, Inuit, and Métis in order to advance meaningful reconciliation for Indigenous Peoples in our country. For far too long, this has been a burden carried by Indigenous Peoples alone. I encourage all Canadians to watch this historic moment and reflect on the impacts of colonialism.</p>\n\n<p>“The Government of Canada is committed to implementing the TRC’s Calls to Action and supporting Survivors and their communities in the journey of healing. We will continue to support First Nations, Inuit, and Métis by investing in their efforts to identify and recover those who never came home. Recognizing that this work can trigger painful memories, the government will also continue to invest in culturally appropriate mental health and wellness supports so that individuals, families, and communities can grieve and heal.</p>\n\n<p>“If you need to talk to someone, mental health supports will continue to be available to residential school Survivors, their families, and communities throughout the Pope’s visit to Canada, including through national helplines and other mental wellness services.”</p>\n\n<p><em>National helplines are available 24/7 to support Indigenous Peoples across Canada:</em></p>\n\n<ul>\n\t<li><em>The Hope for Wellness Help Line provides immediate, toll-free telephone and online-chat based support and crisis intervention to all Indigenous people in Canada. This service is available in English and French, and upon request in Cree, Ojibway, and Inuktitut. Counsellors are available by phone at 1-855-242-3310 or by online chat at </em><a href=\"https://hopeforwellness.ca/home.html\"><em>hopeforwellness.ca</em></a><em>.</em></li>\n\t<li><em>The National Indian Residential School Crisis Line is available to provide emotional and crisis referral services by phone at 1-866-925-4419.</em></li>\n</ul></div>\n      "
}