{
  "path": "/en/news/readouts/2020/07/06/prime-minister-justin-trudeau-speaks-president-mexico-andres-manuel-lopez",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Mexico Andrés Manuel López Obrador | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Mexico, Andrés Manuel López Obrador.</p>\n\n<p>The Prime Minister and the President agreed that the recent entry into force of the new NAFTA would strengthen the deep economic ties and longstanding friendship between Canada and Mexico, and advance social as well as economic development in both countries.</p>\n\n<p>The Prime Minister expressed regret that he is unable to travel to Washington D.C. this week and wished President López Obrador a successful meeting with the President of the United States, Donald Trump.</p>\n\n<p>The two leaders discussed the significant efforts made by each country to fight the COVID-19 pandemic and looked forward to their next opportunity to meet in person.</p>\n\n<p>The Prime Minister and President discussed investment in renewable energy infrastructure to help fight climate change and support economic growth.</p>\n\n<p>The two leaders&nbsp;committed to continue working closely together to advance shared values.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/mexico-mexique/canmex.aspx?lang=eng\">Canada-Mexico Relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/06/30/statement-deputy-prime-minister-entry-force-new-nafta\">Statement by the Deputy Prime Minister on the entry-into-force of the new NAFTA</a></li>\n</ul></div>\n      "
}