{
  "path": "/en/news/readouts/2019/11/22/prime-minister-justin-trudeau-and-deputy-prime-minister-chrystia-freeland",
  "pageTitle": "Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland meet with Ontario Premier Doug Ford | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister and Minister of Intergovernmental Affairs Chrystia Freeland met with Ontario Premier Doug Ford to discuss shared priorities. The Prime Minister reaffirmed his commitment to work collaboratively with Premier Ford and the Government of Ontario.</p>\n\n<p>The leaders discussed the shared infrastructure investments being made through the Investing in Canada Plan, and agreed on the importance of continuing to invest in public transit to help improve commutes, reduce air pollution, strengthen Ontario communities, and grow Canada’s economy. The Prime Minister, the Deputy Prime Minister, and the Premier also exchanged views on rural economic development in Ontario, and how to strengthen Canada’s immigration system and broadband infrastructure. They all agreed that investments and initiatives to support entrepreneurship in Ontario and across the country are important to strengthen Canada’s economic competitiveness.</p>\n\n<p>They also discussed the importance of investments in health care, including mental health and access to primary health care. The two governments also agreed to continue to work together to fight gang-related violence.</p>\n\n<p>The Prime Minister, the Deputy Prime Minister, and the Premier reaffirmed their commitment to advance the implementation of the Canadian Free Trade Agreement to break down internal trade barriers and encourage a competitive domestic market. They also discussed the CN Rail work stoppage and the serious impact it is having across the country, and that the most timely resolution would be a negotiated settlement.</p>\n\n<p>They agreed to continue to collaborate on these important priorities, and looked forward to the next First Ministers’ Meeting.</p></div>\n      "
}