{
  "path": "/en/news/statements/2022/03/24/statement-nato-heads-state-and-government",
  "pageTitle": "Statement by NATO Heads of State and Government | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>“We, the Heads of State and Government of the 30 NATO Allies, have met today to address Russia’s aggression against Ukraine, the gravest threat to Euro-Atlantic security in decades.&nbsp; Russia’s war against Ukraine has shattered peace in Europe and is causing enormous human suffering and destruction.</p>\n\n<p>We condemn Russia’s invasion of Ukraine in the strongest possible terms. We call on President Putin to immediately stop this war and withdraw military forces from Ukraine, and call on Belarus to end its complicity, in line with the Aggression Against Ukraine Resolution adopted at the UN General Assembly of 2 March 2022.&nbsp; Russia should comply with the 16 March ruling by the UN International Court of Justice and immediately suspend military operations.&nbsp; Russia’s attack on Ukraine threatens global security. Its assault on international norms makes the world less safe. President Putin’s escalatory rhetoric is irresponsible and destabilizing.</p>\n\n<p>Ukrainians have inspired the world with heroic resistance to Russia’s brutal war of conquest.&nbsp; We strongly condemn Russia’s devastating attacks on civilians, including women, children, and persons in vulnerable situations. We will work with the rest of the international community to hold accountable those responsible for violations of humanitarian and international law, including war crimes. We are deeply concerned about the increased risk of sexual violence and human trafficking. We urge Russia to allow rapid, safe, and unhindered humanitarian access and safe passage for civilians, and to allow for humanitarian aid to be delivered to Mariupol and other besieged cities. We also condemn attacks against civilian infrastructure, including those endangering nuclear power plants. We will continue to counter Russia’s lies about its attack on Ukraine and expose fabricated narratives or manufactured “false flag” operations to prepare the ground for further escalation, including against the civilian population of Ukraine.&nbsp; Any use by Russia of a chemical or biological weapon would be unacceptable and result in severe consequences.</p>\n\n<p>Russia needs to show it is serious about negotiations by immediately implementing a ceasefire. We call on Russia to engage constructively in credible negotiations with Ukraine to achieve concrete results, starting with a sustainable ceasefire and moving towards a complete withdrawal of its troops from Ukrainian territory.&nbsp; Russia’s continuing aggression while discussions are taking place is deplorable.&nbsp; We support Ukraine’s efforts to achieve peace, and those undertaken diplomatically by Allies to weigh in on Russia to end the war and relieve human suffering.&nbsp;</p>\n\n<p>We stand in full solidarity with President Zelenskyy, the government of Ukraine, and with the brave Ukrainian citizens who are defending their homeland.&nbsp; We honour all those killed, injured, and displaced by Russia’s aggression, as well as their families. We reaffirm our unwavering support for the independence, sovereignty, and territorial integrity of Ukraine within its internationally recognized borders extending to its territorial waters.</p>\n\n<p>Ukraine has a fundamental right to self-defence under the United Nations Charter.&nbsp;&nbsp; Since 2014, we have provided extensive support to Ukraine’s ability to exercise that right.&nbsp; We have trained Ukraine’s armed forces, strengthening their military capabilities and capacities and enhancing their resilience.&nbsp; NATO Allies have stepped up their support and will continue to provide further political and practical support to Ukraine as it continues to defend itself.&nbsp; NATO Allies will also continue to provide assistance in such areas as cybersecurity and protection against threats of a chemical, biological, radiological, and nuclear nature.&nbsp; NATO Allies also provide extensive humanitarian support and are hosting millions of refugees. &nbsp;Foreign Ministers will discuss further our support to Ukraine when they meet in April.</p>\n\n<p>We are united in our resolve to counter Russia’s attempts to destroy the foundations of international security and stability. We are holding Russia and Belarus to account.&nbsp; Massive sanctions and heavy political costs have been imposed on Russia in order to bring an end to this war. We remain determined to maintain coordinated international pressure on Russia. We will continue to coordinate closely with relevant stakeholders and other international organizations, including the European Union. Transatlantic coordination remains crucial for an effective response to the current crisis.</p>\n\n<p>We call on all states, including the People’s Republic of China (PRC), to uphold the international order including the principles of sovereignty and territorial integrity, as enshrined in the UN Charter, to abstain from supporting Russia’s war effort in any way, and to refrain from any action that helps Russia circumvent sanctions. We are concerned by recent public comments by PRC officials and call on China to cease amplifying the Kremlin’s false narratives, in particular on the war and on NATO, and to promote a peaceful resolution to the conflict.</p>\n\n<p>We remain committed to the foundational principles underpinning European and global security, including that each nation has the right to choose its own security arrangements free from outside interference. We reaffirm our commitment to NATO’s Open Door Policy under Article 10 of the Washington Treaty.&nbsp;</p>\n\n<p>We are providing tailored support to partners affected by Russian threats and interference and will step up our assistance to help them resist Russian malign influence and strengthen their resilience, based on our partners’ requests and our long-standing partnership programmes. In April, Foreign Ministers will consider concrete proposals for enhancing our support to these partners.</p>\n\n<p>We will continue to take all necessary steps to protect and defend the security of our Allied populations and every inch of Allied territory. Our commitment to Article 5 of the Washington Treaty is iron-clad.</p>\n\n<p>In response to Russia’s actions, we have activated NATO’s defence plans, deployed elements of the NATO Response Force, and placed 40,000 troops on our eastern flank, along with significant air and naval assets, under direct NATO command supported by Allies’ national deployments. We are also establishing four additional multinational battlegroups in Bulgaria, Hungary, Romania, and Slovakia. We are taking all measures and decisions to ensure the security and defence of all Allies across all domains and with a 360-degree approach.&nbsp; Our measures remain preventive, proportionate, and non-escalatory. We will now accelerate NATO’s transformation for a more dangerous strategic reality, including through the adoption of the next Strategic Concept in Madrid. In light of the gravest threat to Euro-Atlantic security in decades, we will also significantly strengthen our longer term deterrence and defence posture and will further develop the full range of ready forces and capabilities necessary to maintain credible deterrence and defence. These steps will be supported by enhanced exercises with an increased focus on collective defence and interoperability.</p>\n\n<p>We are increasing the resilience of our societies and our infrastructure to counter Russia’s malign influence. We are enhancing our cyber capabilities and defences, providing support to each other in the event of cyber-attacks. We are ready to impose costs on those who harm us in cyberspace, and are increasing information exchange and situational awareness, enhancing civil preparedness, and strengthening our ability to respond to disinformation. We will also enhance our preparedness and readiness for chemical, biological, radiological and nuclear threats. We will take further decisions when we meet in Madrid.&nbsp;</p>\n\n<p>The steps we are taking to ensure the security of our Alliance and of the Euro-Atlantic area will require adequate resourcing.&nbsp; Allies are substantially increasing their defence expenditures. Today, we have decided to accelerate our efforts to fulfil our commitment to the Defence Investment Pledge in its entirety. In line with our commitment in Article 3 of the Washington Treaty, we will further strengthen our individual and collective capacity to resist all forms of attack. At our meeting in Madrid, we will submit additional plans on how to meet the Pledge.</p>\n\n<p>Russia’s unprovoked war against Ukraine represents a fundamental challenge to the values and norms that have brought security and prosperity to all on the European continent. President Putin’s choice to attack Ukraine is a strategic mistake, with grave consequences also for Russia and the Russian people. We remain united and resolute in our determination to oppose Russia’s aggression, aid the government and the people of Ukraine, and defend the security of all Allies.”</p></div>\n      "
}