{
  "path": "/en/news/statements/2021/04/13/statement-prime-minister-vaisakhi",
  "pageTitle": "Statement by the Prime Minister on Vaisakhi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span><span><span>The Prime Minister, Justin Trudeau, today issued the following statement on Vaisakhi:</span></span></span></p>\n\n<p><span><span><span>“Today, the Sikh community in Canada and around the world will celebrate Vaisakhi, the holiest day in the Sikh faith.</span></span></span></p>\n\n<p><span><span><span>“For more than three hundred years, Sikhs have come together on this day to <span>mark the creation of the Khalsa Panth – the community of baptized Sikhs – by Guru Gobind Singh Ji. </span></span></span></span></p>\n\n<p><span><span><span><span>“In Canada, this day would usually be celebrated in Gurdwaras, Sikhs’ place of worship, and through colourful Khalsa Day parades, from coast to coast to coast. This year, many Vaisakhi traditions will once again look different as we continue to fight the global COVID-19 pandemic and find alternative ways to celebrate in order to keep each other and our communities safe. </span></span></span></span></p>\n\n<p><span><span><span><span>“In these difficult times, we can all find inspiration in Sikhism’s teachings of equality, compassion, and selfless service. Over the past year, Sikh Canadians have put these values into practice by supporting seniors in isolation, delivering meals to those in need, and raising money for community initiatives across the country. The spirit of seva teaches us that, even when we are apart, we can still be of service to one another.</span></span></span></span></p>\n\n<p><span><span><span><span>“Canada is proud to be home to one of the largest Sikh populations in the world. I hope all Canadians join me today in taking a moment to recognize the significant contributions Sikh Canadians have made, and continue to make, to our country. </span></span></span></span></p>\n\n<p><span><span><span>“On behalf of our family, Sophie and I wish everyone celebrating a joyful Vaisakhi.</span></span></span></p>\n\n<p><span><span><span>“Waheguru Ji Ka Khalsa, Waheguru Ji Ki Fateh.”</span></span></span></p></div>\n      "
}