{
  "path": "/en/news/readouts/2021/06/14/prime-minister-justin-trudeau-meets-nato-secretary-general-jens",
  "pageTitle": "Prime Minister Justin Trudeau meets with the NATO Secretary General Jens Stoltenberg | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Prime Minister Justin Trudeau met today with the Secretary General of the North Atlantic Treaty Organization (NATO), Jens Stoltenberg.</p>\n\n<p>Prime Minister Trudeau reaffirmed Canada’s steadfast support for the Alliance and NATO’s role in upholding the rules-based international order. He underscored that NATO is a cornerstone of Canada’s international security and defence policy and a central pillar of Euro-Atlantic security and international stability.</p>\n\n<p>Prime Minister Trudeau commended the Secretary General for his leadership of the NATO 2030 process, which leverages NATO’s capacity to adapt to the security challenges of today, and to new and emerging threats.</p>\n\n<p>The Prime Minister and the Secretary General agreed that Allies must stand united, including in the face of Russia’s aggressive, destabilizing, and illegal actions.&nbsp;The Prime Minister underscored Canada’s support for Ukraine’s sovereignty, security, and territorial integrity. Prime Minister Trudeau and Secretary General Stoltenberg also spoke about the importance of a coordinated approach to addressing the challenges posed by China.</p>\n\n<p>The Prime Minister highlighted that Canada will continue to support NATO’s work on climate change and security. He confirmed Canada’s interest in hosting a NATO Centre of Excellence (COE) on Climate and Security, and to work closely with NATO and Allies toward this goal. The COE would play an important role in helping the Alliance to better understand, adapt to, and address the security implications of climate change.</p>\n\n<p>Recognizing the increasingly broad and sophisticated cyber threats facing Allies, Prime Minister Trudeau highlighted that Canada is providing cyber effects to NATO. The Prime Minister reiterated that Canada’s cyber operations will be subject to all applicable domestic and international law. Canada is among a group of Allies that has committed their cyber effects on a voluntary basis to support NATO operations.</p>\n\n<p>Prime Minister Trudeau also announced that Canada will contribute to NATO’s Trust Fund to support United Nations (UN) peacekeepers. This new funding will allow NATO to share its expertise with the UN in support of&nbsp;more effective peacekeeping operations.</p>\n\n<p>Prime Minister Trudeau and Secretary General Stoltenberg looked forward to working together in charting a clear course for a renewed Alliance in support of a safer, more peaceful world for people everywhere.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/nato-otan/index.aspx?lang=eng\">Canada and the North Atlantic Treaty Organization</a></li>\n\t<li><a href=\"https://www.nato.int/nato2030/\">NATO 2030: Making a strong Alliance even stronger</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/topics_68372.htm?\">NATO Centres of Excellence</a></li>\n\t<li><a href=\"https://www.nspa.nato.int/about/support-to-operations/trust-fund-projects\">NATO Trust Fund Projects</a></li>\n\t<li><a href=\"https://www.nato.int/cps/en/natohq/184620.htm\">2021 NATO Summit</a></li>\n</ul>\n\n<ul>\n</ul></div>\n      "
}