{
  "path": "/en/news/readouts/2023/04/05/prime-minister-justin-trudeau-speaks-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>This evening, Prime Minister Justin Trudeau spoke with the President of the United States of America, Joe Biden.</p>\n\n<p>The Prime Minister and the President&nbsp;discussed migration and the implementation of the Safe Third Country Agreement.</p>\n\n<p>The two leaders spoke about the President’s recent visit to Canada, which helped drive significant progress on shared priorities. They both are looking forward to the first meeting of the Energy Transformation Task Force, which was launched during the President’s visit to accelerate our work together over the next year across the spectrum of the clean economy.</p>\n\n<p>Prime Minister Trudeau&nbsp;updated President Biden on his phone call yesterday with the President of Ukraine, Volodymyr Zelenskyy. The&nbsp;Prime Minister and the President spoke about Russia’s illegal detention of Wall Street Journal reporter Evan&nbsp;Gershkovich&nbsp;and called for his immediate release.</p>\n\n<h2>Associated Links</h2>\n\n<ul><li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2023/04/04/prime-minister-justin-trudeau-speaks-president-ukraine-volodymyr-zelenskyy\">Prime Minister Justin Trudeau speaks with President of Ukraine Volodymyr Zelenskyy</a></li>\n\t<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/agreements/safe-third-country-agreement.html\">Canada-US Safe Third Country Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2023/03/24/working-united-states-grow-our-clean-economies-and-create-good-middle\">Working with the United States to grow our clean economies and create good, middle-class jobs on both sides of our border</a></li>\n</ul></div>\n      "
}