{
  "path": "/en/news/statements/2016/05/17/statement-prime-minister-canada-international-day-against-homophobia",
  "pageTitle": "Statement by the Prime Minister of Canada on the International Day Against Homophobia, Transphobia, and Biphobia | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day Against Homophobia, Transphobia, and Biphobia:</p>\n<p>“Today, I join Canadians – and people around the world – to recognize the International Day Against Homophobia, Transphobia, and Biphobia.</p>\n<p>“Everyone deserves to live free of stigma, persecution, and discrimination –&nbsp;no matter who they are or whom they love. Today is about ensuring that all people – regardless of sexual orientation or gender identity – feel safe and secure, and empowered to freely express themselves.</p>\n<p>“On this important day, I encourage all Canadians to raise awareness, and mobilize to end the violence, prejudice, and judgement faced by LGBTQ2 persons.</p>\n<p>“As a society, we have taken many important steps toward recognizing and protecting the legal rights for the LGBTQ2 community – from enshrining equality rights in the <em>Canadian Charter of Rights and Freedoms</em> to the passage of the<em> Civil Marriage Act</em>. There remains much to be done, though. Far too many people still face harassment, discrimination, and violence for being who they are. This is unacceptable.</p>\n<p>“To do its part, the Government of Canada today will introduce legislation that will help ensure transgender and other gender-diverse people can live according to their gender identity, free from discrimination, and protected from hate propaganda and hate crimes.</p>\n<p>“Today, let us unite in a global celebration of diversity, and reaffirm our commitment to unequivocally defend LGBTQ2 rights as human rights. We will never stop fighting for a safer, more equal, and more just world for all of our children.”</p></div>\n      "
}