{
  "path": "/en/news/readouts/2020/11/10/prime-minister-justin-trudeau-speaks-mayor-calgary-naheed-nenshi",
  "pageTitle": "Prime Minister Justin Trudeau speaks with Mayor of Calgary Naheed Nenshi | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with Mayor of Calgary Naheed Nenshi to discuss the COVID‑19 pandemic.</p>\n\n<p>The Prime Minister and the Mayor spoke about the rising number of COVID-19 cases in Calgary. Prime Minister Trudeau reiterated his commitment to helping municipalities, provinces, and territories respond to the global COVID-19 pandemic and ensuring economic recovery.</p>\n\n<p>Prime Minister Trudeau and Mayor Nenshi discussed the homelessness situation in Calgary and the Rapid Housing Initiative, which will help address urgent housing needs of vulnerable Canadians by rapidly creating new affordable housing. They also discussed infrastructure priorities for Calgary.</p>\n\n<p>The Prime Minister and the Mayor agreed on the importance of every order of government continuing to take action on these issues and working together on the response to COVID-19, in order to protect the health and safety of the people of Calgary, Albertans and all Canadians.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/09/16/prime-minister-announces-next-steps-safe-restart-agreement\">Prime Minister announces next steps for Safe Restart Agreement</a></li>\n\t<li><a href=\"https://www.canada.ca/en/intergovernmental-affairs/services/safe-restart-agreement.html\">Safe Restart Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/10/27/new-rapid-housing-initiative-create-3000-new-homes-canadians\">New Rapid Housing Initiative to create up to 3,000 new homes for Canadians</a></li>\n\t<li><a href=\"https://www.canada.ca/en/employment-social-development/programs/homelessness/notice-covid-19.html\">Reaching Home: Canada’s Homelessness Strategy – COVID-19</a></li>\n</ul></div>\n      "
}