{
  "path": "/en/news/news-releases/2016/09/14/premier-state-council-peoples-republic-china-li-keqiang-visit-canada",
  "pageTitle": "Premier of the State Council of the People's Republic of China, Li Keqiang, to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Premier of the State Council of the People's Republic of China, Li Keqiang, will travel to Ottawa and Montréal, Canada for an official visit from September 21 to 24, 2016.</p>\n<p>While in Ottawa, Premier Li will meet with the Prime Minister and other senior officials to continue to deepen a stronger, more stable relationship between Canada and China.</p>\n<p>During the visit, the two leaders will also explore how to expand the potential of the Canada-China relationship and create new opportunities for the middle class and those working hard to join it—including in the areas of trade and investment, environmental cooperation, legal and judicial collaboration, cultural exchanges and people-to-people ties.</p>\n<p>Premier Li will then travel to Montréal where he will meet with senior political leaders, leading businesspeople and members of the Chinese-Canadian community.</p>\n<p><strong>Quote</strong></p>\n<p>“After being so warmly welcomed during my first official visit to China, it will be a great pleasure to welcome Premier Li to Canada next week. Together, we will build on the progress made during my visit to China, deepening understanding between our two countries, and working on growing our economies and strengthening the middle class.”&nbsp;</p>\n<p>—<em>Rt. Hon. Justin Trudeau, Prime Minister of Canada</em></p>\n<p><strong>Quick Facts</strong></p>\n<ul>\n<li>Canada and China established formal diplomatic relations in 1970.</li>\n<li>Both countries enjoy strong people-to-people ties with Canadians of Chinese descent making up approximately 4.5 percent of Canada's population.</li>\n<li>China is Canada's second-largest single-country trading partner.</li>\n<li>Two-way merchandise trade between Canada and China amounted to nearly $85.8 billion in 2015, a 10.1 percent increase over 2014, and accounted for 8.1&nbsp;percent of Canada's total merchandise trade. In 2015, bilateral merchandise trade with Hong Kong reached $4.2 billion.</li>\n<li>Canada's two-way foreign direct investment relationship with China reached $33&nbsp;billion at the end of 2015 and two-way investment relationship with Hong Kong amounted to $23.7 billion in 2015.</li>\n</ul></div>\n      "
}