{
  "path": "/en/news/news-releases/2016/10/06/prime-minister-france-visit-canada",
  "pageTitle": "Prime Minister of France to visit Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced that the Prime Minister of France, Manuel Valls, will travel to Canada for his first official visit to the country starting October 12th, 2016.</p><p>Canada is committed to deepening relations with France, building on the significant commercial, historical, and cultural ties both countries enjoy. This includes an unfailing commitment to promote the French language both at home and around the world.</p><p>While in Ottawa, on October 12<sup>th</sup> and 13<sup>th</sup>, Prime Minister Valls will meet with Prime Minister Trudeau to explore how to increase commercial flows between the two countries, including opportunities provided under the Comprehensive Economic and Trade Agreement (CETA).</p><p>The leaders will examine how Canada and France can work together to fight climate change and foster opportunities for youth. They will also discuss how to increase collaboration in science, innovation and technology, and promote protection for women and children.</p><p>Prime Minister Valls will also meet with Governor General David Johnston while in Ottawa.</p><p>Following the Ottawa portion of the visit, the two Prime Ministers will participate in an event initiated by Quebec Premier Philippe Couillard to discuss opportunities arising from CETA. &nbsp;</p><h2>Quote</h2><blockquote><p>“We have very warm ties with France given the historical and cultural influence it has had on our country. This visit is part of our mutual effort to build on these foundations to foster closer collaboration on fighting climate change. The visit will also allow us to promote greater trade and innovation flows – particularly through CETA – to help grow the middle class and strengthen our economies.”&nbsp; <br> <cite>—Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2><strong><br></strong>Quick Facts</h2><ul><li>As a permanent member of the United Nations Security Council, NATO, G7, G20, founding nation of the European Union (EU) and leading partner in La Francophonie, France is a key ally for Canada on the international stage.</li><li>Both countries enjoy strong people-to-people ties, sharing the French language, and making it possible to cooperate closely on academic relations.</li><li>France is one of the most popular destinations for Canadian post-secondary students, particularly among non-English-speaking destinations.</li><li>Since 2004, a youth mobility agreement has facilitated the movement of Canadian and French nationals aged 18-35 to each other’s country.</li><li>France is Canada’s eighth largest merchandise trading partner globally and fourth largest export market in the EU, with bilateral trade valued at $9.9&nbsp;billion and Canadian exports to France valued at $3.1 billion in 2015.</li><li>Canada's two-way foreign direct investment relationship with France nearly reached $14.8 billion at the end of 2015.</li></ul><h2><strong><br></strong>Associated Links</h2><ul><li><strong><a href=\"http://www.canadainternational.gc.ca/france/bilateral_relations_bilaterales/canada_france.aspx?lang=eng\">Canada-France Relations</a></strong></li><li><a href=\"http://www.international.gc.ca/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\"><strong>Comprehensive Economic and Trade Agreement (CETA)</strong></a></li></ul></div>\n      "
}