{
  "path": "/en/news/readouts/2022/11/17/prime-minister-justin-trudeau-meets-prime-minister-italy-giorgia-meloni",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prime Minister of Italy Giorgia Meloni | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the Prime Minister of Italy, Giorgia Meloni, on the margins of the G20 Summit.</p>\n\n<p>Discussing shared priorities at the G20, the two leaders commended Indonesia’s leadership as host and agreed on the importance of further strengthening collaboration on multilateralism and open, rules-based trade. They reaffirmed their desire for continued coordination among allies and partners to maintain and increase international support to Ukraine, at the Summit and beyond. The prime ministers discussed the importance of building on the strong relationship between their two countries to address the ongoing global impacts of Russia’s illegal invasion of Ukraine, including on food and energy security.&nbsp;</p>\n\n<p>With 2022 marking the 75th anniversary of relations between Canada and Italy, the prime ministers reflected on the deep people-to-people ties between Canadians and Italians, and the importance of their bilateral relationship in addressing current global challenges.</p>\n\n<p>Prime Minister Trudeau highlighted the significant increase in trade between both countries since the provisional application of the Canada-European Union Comprehensive Economic and Trade Agreement. The two leaders agreed on the potential for heightened bilateral trade relations to create good, middle-class jobs on both sides of the Atlantic and to help both countries build clean economies. The prime ministers identified clean technologies, critical minerals, and energy as sectors with strong potential for further growth.</p>\n\n<p>The two leaders also noted their interest in strengthening cooperation in support of regional and international security, and in the promotion and defence of democratic values, including at the G7, G20, and NATO.</p>\n\n<p>Prime Minister Trudeau and Prime Minister Meloni agreed to stay in close contact.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/italy-italie/relations.aspx?lang=eng\">Canada-Italy relations</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/11/10/prime-minister-justin-trudeau-speaks-prime-minister-italy-giorgia-meloni\">Prime Minister Justin Trudeau speaks with Prime Minister of Italy Giorgia Meloni</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/ceta-aecg/index.aspx?lang=eng\">Canada-European Union Comprehensive Economic and Trade Agreement (CETA)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/11/02/prime-minister-participate-asean-summit-g20-summit-apec-economic\">Prime Minister to participate in the ASEAN Summit, G20 Summit, APEC Economic Leaders’ Meeting, and the Sommet de la Francophonie</a></li>\n</ul></div>\n      "
}