{
  "path": "/en/news/statements/2021/07/26/ediri-yati-holi-ki-ta-koldhere-nedhe-prime-minister-betsiane-si-canada",
  "pageTitle": "Ɂedırı yatı holı̨ k’ı T’ą K’oldhere nedhe Prime Minister bets’ı̨ɂąne sı Canada hots’ı̨ 30th Governor General hulye benereltł’ıs ha, T’ąt’u hudzı hade Her Excellency T’a besudı hoɂą Right Honourable Mary Simon hulyé | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>T’ą K’oldhere nedhe Prime Minister, Justin Trudeau, ɂedų dzıne k’e ɂedırı ts’ekuı Canada bets’ı̨ Governor General godhe holı̨ ha bela hunılthı ha nezų nı̨dhęn sı, Ku ɂedırı ts’ekuı ɂedırı hudzı sı Right Honourable Mary Simon:</p>\n\n<p>“Canada bebası nıh ts’ęn k’olde yastı sı dųhų, ɂedırı ts’ekuı besuhudı chu marsı nesdhęn sı ɂeją Canada bets’ı̨ 30th Governor General hęlı̨ ha nı̨ltı̨, Mary Simon Ts’ekuı ɂeją la nedhe nı̨ya sı̨ Ts’ekuı t’ak’oldhere ha thedá ɂeją nąne hoɂá.</p>\n\n<p>“Nunavik ts’ęn nǫ́k’enı̨ya, Quebec yutthı̨ ts’ęn, Ku ɂedırı ts’ekuı t’anı̨̨łtha ɂası hełtsı hots’ı̨ bedene ha ɂası k’enaı̨dher. Bech’alanıe chu Hotena dene ha hoketł’a ɂası k’enadher ɂedırı dene kı, dene godhe hu, nı̨h k’e ha ɂası hu t’a ɂası thełtsı̨ ha bek’anota chu ɂası łą ɂeyı ha beghǫnı̨dı dųhų ts’ęn ɂedırı Canadian ambassador tth’I ghı̨le nı̨.</p>\n\n<p>“T’oho t’a ɂası thełtsı̨ huk’e ɂedırı ts’ekuı, ku tthere hulta hotıe dene ha yatı gheɂal hu, la bası hu t’ok’e narade dąlı̨ chu dene ha. Ku dene t’a t’ok’e Ɂedza nęnę narade ha hotthe ɂası hetłsı huya horelyų nąne hoɂa dene ha. Ɂa dųhų ɂedırı Canada bets’ı̨ Governor General hęlı̨ k’ı t’a yatı nedhe bet’a hoɂą Constitution chu bets’ı̨ ɂası hoghełnı̨ ha belaa sı, Deghare bek’oshyą sı t’a ɂası ɂa huya sı hotıe ɂeyı t’a dene ha ɂası k’enadher ha Canada nask’athe horelyų dene ha, ɂeją nąne hoɂa chu t’ok’e losı ts’ęn, sughua chu ɂełtth’ı́ hel Canada bets’ı̨ nah yatıe bek’anota ɂa. Ku ɂeyı hel ɂedırı deghare haıyıle ha nesdhęn, Canada bets’ı̨ Denexal-dene ha tthere hulta, ɂedırı t’ą Denexal dene Canadian Armed Forces hots’ı̨ dene k’ı ts’erenı̨ dene chu nehenęnę hodoghełnı̨ ɂa.</p>\n\n<p>“Deghare senı̨k’esı nodher sı ɂedųhų ɂedırı t’anǫłtth’er horelyų nuheba, nuhnı̨ ɂeją naraıdé k’e yune t’anodher sı net’ı̨ nadłı̨ chu sehenųt’a hoɂą tulu k’e ghıdeł chu ɂełts’ęn nanı̨ɂa haılye hoɂą yunadhe bası. Ɂedırı bek’oshyą deghare, Canada ha t’atthe Denededłı̨ne benerıłt’ıs sı Governor General holı̨ ha, Ku ɂedırı Tthere hulta k’ı hotıe nuheba ɂası k’enadher ha t’a ɂası due nodher sı chu t’a ɂełtth’ı hanalye ha t’ąt’u ɂeła ghıdeł ɂeją nąne hoɂa naraıde sı nuhexa.</p>\n\n<p>“Ɂa dųhų dzıne k’e Ts’ekuı T’ak’oldher Queen Elizabeth II bek’anota tth’ı́ hoɂą, Canada ha Queen ts’ekuı k’oldher hulta, 69 nęnę ɂąsı ghı̨yı̨ sı ɂedırı ɂełk’ech’a Commonwealth dene ba sughua chu ɂełtth’ı́ hel. Ku ɂedırı 13th dene benerıltł’ıs sı Governor General Canada bebası t’oho K’oldhere ha 1952 k’e nı̨łtı̨nı̨ hots’ı̨.</p>\n\n<p>“Deghare marsı benesdhęn sı ɂedırı ts’ekuı Right Honourable Mary Simon ɂedırı la hı̨łchu ha deghare sedzıe t’a ba sı̨nı̨ye sı ɂedųhų. Horelyų Canada nąne hoɂą hots’ı̨ dene noreské sı ɂedırı naraıt’eth godhe sı bası, chu sel ɂedırı dene benerıltł’ıs k’ı ba sughua nı̨de nesdhęn t’a nezų ɂası hełtsı, ɂełk’esı dene hąłthęn Canada nask’athe dene xa ɂedırı t’ok’e nı̨łtı̨ hots’ı̨ tthere hudzı sı ɂeyer theda k’ı.”</p>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"/en/news/news-releases/2021/07/06/prime-minister-announces-queens-approval-canadas-next-governor\">Prime Minister ɂedırı yatı thełtsı̨ sı Canada Governor General godhe beghąl</a></li>\n</ul></div>\n      "
}