{
  "path": "/en/news/readouts/2022/09/27/prime-minister-justin-trudeau-meets-prince-edward-island-premier-dennis",
  "pageTitle": "Prime Minister Justin Trudeau meets with Prince Edward Island Premier Dennis King | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Minister of Veterans Affairs and Associate Minister of National Defence Lawrence MacAulay met with Prince Edward Island Premier Dennis King to discuss the devastating impacts of Hurricane Fiona on the province, its residents, and people across the Atlantic region and Eastern Quebec.</p>\n\n<p>The leaders explored ways the federal and provincial governments would continue to work together to support Islanders. The Premier noted that power outages remain a concern for many people and businesses in the province, and that key infrastructure, including schools and small craft harbours, are significantly affected. The Prime Minister highlighted federal support programs available to help with recovery efforts and rebuild communities. The leaders discussed the particular challenges for the province’s important fishing and agriculture industries, which could have longer-term impacts on harvests, and agreed to work together on a path forward to support industry and workers.</p>\n\n<p>The Prime Minister reiterated the commitment of the federal government to keep working with provincial and municipal partners and local First Nations communities to provide support in areas affected by the hurricane. The Prime Minister and the Premier recognized the work of first responders and emergency relief organizations, including the Canadian Red Cross, in providing support to impacted communities. The two leaders also thanked Canadian Armed Forces personnel who have been providing support to provincial and municipal officials and to people in the province.</p>\n\n<p>The leaders agreed to stay in close contact as recovery efforts continue.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/24/prime-minister-justin-trudeau-convenes-incident-response-group-discuss\">Prime Minister Justin Trudeau convenes the Incident Response Group to discuss Hurricane Fiona</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/09/25/prime-minister-justin-trudeau-convenes-second-incident-response-group\">Prime Minister Justin Trudeau convenes the second Incident Response Group meeting to discuss Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.canada.ca/en/public-safety-canada/news/2022/09/government-of-canada-and-canadian-red-cross-establish-donation-matching-program-to-support-canadians-impacted-by-hurricane-fiona.html\">Government of Canada and Canadian Red Cross establish donation-matching program to support Canadians impacted by Hurricane Fiona</a></li>\n\t<li><a href=\"https://www.publicsafety.gc.ca/cnt/mrgnc-mngmnt/rcvr-dsstrs/dsstr-fnncl-ssstnc-rrngmnts/index-en.aspx\">Disaster Financial Assistance Arrangements (DFAA)</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/readouts/2022/01/31/prime-minister-justin-trudeau-speaks-prince-edward-island-premier-dennis\">Prime Minister Justin Trudeau speaks with Prince Edward Island Premier Dennis King</a></li>\n</ul></div>\n      "
}