{
  "path": "/en/news/readouts/2021/01/20/prime-minister-justin-trudeau-speaks-president-afghanistan-ashraf-ghani",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of Afghanistan Ashraf Ghani | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of Afghanistan, Ashraf Ghani.</p>\n\n<p>Prime Minister Trudeau and President Ghani spoke about the intra-Afghan peace process and strongly denounced the ongoing surge of violence in Afghanistan. The Prime Minister expressed concern about the increase in assassinations targeting journalists, prosecutors, government officials, civil and women’s rights activists, and members of minority groups. The Prime Minister emphasized Canada’s support for efforts to reach a negotiated outcome that protects the hard fought gains on human rights – especially women’s equal rights – as well as education, health, democracy, and the rule of law.</p>\n\n<p>The Prime Minister and the President underlined the strong relations between Canada and Afghanistan, including through ongoing bilateral and multilateral assistance, and looked forward to continued cooperation. The leaders also agreed to continuing their close collaboration related to the Ukraine International Airlines Flight PS752 tragedy.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/afghanistan/relations.aspx?lang=eng\">Canada-Afghanistan relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/01/08/statement-prime-minister-canada-mark-first-anniversary-downing-ukraine\">Statement by the Prime Minister of Canada to mark the first anniversary of the downing of Ukraine International Airlines Flight 752</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/01/statement-from-international-coordination-and-response-group-for-the-victims-of-flight-ps752-marking-one-year-since-the-tragic-downing-of-flight-ps752.html\">Statement from International Coordination and Response Group for the victims of Flight PS752 marking one year since the tragic downing of Flight PS752</a></li>\n</ul></div>\n      "
}