{
  "path": "/en/news/news-releases/2016/03/02/prime-minister-trudeau-and-premiers-meet-indigenous-leaders-discuss",
  "pageTitle": "Prime Minister Trudeau and Premiers meet with Indigenous leaders to discuss climate change | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, and provincial and territorial Premiers met today with First Nations, Inuit, and Métis Nation leaders on the traditional territory of the Coast Salish people to discuss how they can work together, in the spirit of the renewed relationship, to address climate change and promote clean growth.</p>\n<p>Across the country, communities are facing new challenges as a result of climate change. During the meeting, Indigenous leaders outlined a path forward for partnering to stimulate clean, sustainable economic growth – while also ensuring our land, air, and water are protected for future generations. &nbsp;</p>\n<p>The knowledge and ideas shared by Indigenous leaders will inform the Prime Minister and the Premiers as they meet tomorrow to discuss the development of a pan-Canadian framework to address climate change and create clean growth. They discussed&nbsp;effective ways for Canada to adapt to new challenges, reduce emissions, and capitalize on the opportunities presented by a low-carbon economy to create jobs.</p>\n<p>The Prime Minister looks forward to collaborative work with Indigenous leaders and Premiers on clean growth and climate change.</p>\n<p><strong>Quote</strong></p>\n<p>“Climate change is the greatest collective challenge we face as a nation. Today’s meeting affirmed that our leaders, from coast to coast to coast, we will stand together in their passion and commitment to tackling climate change and growing the economy. We will work collaboratively with First Nations, Inuit, and Métis across the country to ensure a more sustainable and prosperous future for Canada.”</p>\n<p>– <em>Rt. Hon. Justin Trudeau, Prime Minister of Canada&nbsp;</em></p>\n<p><strong>Associated Links</strong></p>\n<ul>\n<li><a href=\"http://www.afn.ca/en\">Assembly of First Nations</a></li>\n<li><a href=\"http://www.itk.ca\">Inuit Tapiriit Kanatami</a></li>\n<li><a href=\"http://www.metisnation.ca/\">Métis National Council</a></li>\n</ul></div>\n      "
}