{
  "path": "/en/news/readouts/2022/06/28/prime-minister-justin-trudeau-meets-president-indonesia-joko-widodo",
  "pageTitle": "Prime Minister Justin Trudeau meets with President of Indonesia Joko Widodo | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Yesterday, Prime Minister Justin Trudeau met with the President of Indonesia, Joko Widodo, on the margins of the G7 Summit.</p>\n\n<p>Prime Minister Trudeau and President Widodo welcomed the opportunity to further strengthen collaboration, including through the recently completed bilateral Plan of Action and across areas such as trade and investment, defence and security, and multilateral cooperation. They also discussed opportunities to cooperate on climate change and critical minerals. The two leaders welcomed ongoing negotiations for a Canada-Indonesia Comprehensive Economic Partnership Agreement and looked forward to increasing trade that creates good middle-class jobs and opportunities for businesses in both countries.</p>\n\n<p>The leaders discussed Russia’s illegal invasion of Ukraine and considered its global consequences, including shortages and rising prices of food and fuel. Prime Minister Trudeau pledged Canada’s support for Indonesia’s G20 Presidency this year and welcomed Indonesia’s invitation to Ukrainian President Volodymyr Zelenskyy to attend the G20 Summit. The Prime Minister and the President also discussed the importance of a free, open, and inclusive Indo-Pacific region and looked forward to Indonesia assuming the chair of the Association of Southeast Asian Nations (ASEAN) in 2023.</p>\n\n<p>In the context of the G7, Prime Minister Trudeau welcomed the opportunity to engage with President Widodo and the leaders of other partner countries, including by exchanging views on pressing global issues, such as the pandemic response, resilient democracies, and food security.</p>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/indonesia-indonesie/index.aspx?lang=eng\">Canada and Indonesia</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/g20/index.aspx?lang=eng\">Canada and the G20</a></li>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/asean/index.aspx?lang=eng\">Canada and the Association of Southeast Asian Nations (ASEAN)</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/06/canada-to-begin-negotiations-with-indonesia-on-a-comprehensive-economic-partnership-agreement.html\">Canada to begin negotiations with Indonesia on a Comprehensive Economic Partnership Agreement</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2022/06/15/prime-minister-participate-commonwealth-heads-government-meeting-g7\">Prime Minister to participate in Commonwealth Heads of Government Meeting, G7 Summit, NATO Summit, and Spanish bilateral visit</a></li>\n</ul></div>\n      "
}