{
  "path": "/en/news/statements/2017/12/07/statement-prime-minister-launch-christmas-lights-across-canada",
  "pageTitle": "Statement by the Prime Minister on the launch of Christmas Lights Across Canada | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the launch of Christmas Lights Across Canada, which runs every night from December 7, 2017, to January 7, 2018:</p><p>“Tonight, thousands of holiday lights will illuminate Parliament Hill as we launch <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/christmas-lights.html\">Christmas Lights Across Canada</a>. For the next month, lights will shine in Canadian capitals from coast to coast to coast, in celebration of all that unites us.</p><p>“Holiday traditions like this brighten cold winter days and bring family, friends, and communities together to celebrate the spirit of the season. The lights also remind us of our treasured Canadian values – peace, openness, compassion, and hope – which guide us even in times when the world seems dark. They represent the light we all bring to the world, and the power we have to shape it for the better.</p><p>“This year, as we mark the beginning of Christmas Lights Across Canada, the 150<sup>th</sup> anniversary of Confederation draws to a close – a time for all of us to reflect on the country we have become. Canadians come from every background and culture, practice many faiths, and share both values and dreams of a better tomorrow. We are strong in our diversity, and we are a work in progress with the constant, remarkable opportunity to do better and be better.</p><p>“On behalf of the Government of Canada, I invite all Canadians to celebrate the final weeks of Canada 150 and to think about how we want to shape our country in the decades and centuries to come.Together with our family, Sophie and I wish all those celebrating a merry Christmas.”</p></div>\n      "
}