{
  "path": "/en/news/readouts/2021/08/11/prime-minister-justin-trudeau-speaks-president-european-commission-ursula",
  "pageTitle": "Prime Minister Justin Trudeau speaks with President of the European Commission Ursula von der Leyen | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau spoke with the President of the European Commission, Ursula von der Leyen.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen expressed their strong opposition to the decisions by Chinese courts to uphold a death sentence against Robert Schellenberg, and to convict and sentence Michael Spavor. The Prime Minister thanked the President for the continued support of the European Union. The two leaders agreed to continue working together against arbitrary detention.</p>\n\n<p>The Prime Minister and President&nbsp;discussed the wildfires, flooding, and heatwaves in Europe and Canada. They stressed that these tragic events have put into focus the urgent need for increased action on climate change and protection of biodiversity. They agreed to continue working together to raise global ambition in the lead up to the UN Climate Change Conference (COP26) in Glasgow.</p>\n\n<p>The two leaders discussed efforts in Canada and in the European Union to fight the global COVID-19 pandemic and deploy safe and effective vaccines. They emphasized the continued importance of global coordination, including through the ACT-Accelerator and COVAX. They also discussed proof of vaccination, including the EU Digital COVID Certificate.</p>\n\n<p>Prime Minister Trudeau and President von der Leyen expressed concern over ongoing human rights abuses in Belarus, and the leaders agreed to continue to coordinate responses, including through sanctions.</p>\n\n<p>The two leaders looked forward to continuing to work together to advance shared priorities.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/world-monde/international_relations-relations_internationales/eu-ue/index.aspx?lang=eng\">Canada and the European Union</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/08/11/statement-prime-minister-verdict-michael-spavor\">Statement by the Prime Minister on the verdict of Michael Spavor</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/04/22/prime-minister-trudeau-announces-increased-climate-ambition\">Prime Minister Trudeau announces increased climate ambition</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2020/12/canada-announces-additional-support-for-equitable-access-to-covid-19-tests-treatments-and-vaccines.html\">Canada announces additional support for equitable access to COVID-19 tests, treatments and vaccines</a></li>\n\t<li><a href=\"https://www.canada.ca/en/global-affairs/news/2021/08/canada-imposes-additional-sanctions-on-first-anniversary-of-belaruss-fraudulent-presidential-elections.html\">Canada imposes additional sanctions on first anniversary of Belarus’s fraudulent presidential elections</a></li>\n</ul></div>\n      "
}