{
  "path": "/en/news/statements/2020/12/10/statement-prime-minister-human-rights-day",
  "pageTitle": "Statement by the Prime Minister on Human Rights Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Human Rights Day:</p>\n\n<p>“Today, we mark <a href=\"https://www.un.org/en/observances/human-rights-day\">Human Rights Day</a> and celebrate the United Nations General Assembly’s adoption of the <a href=\"https://www.un.org/en/universal-declaration-human-rights/\">Universal Declaration of Human Rights</a> in 1948. This document, which Canadian John Humphrey helped draft, outlines the fundamental rights and freedoms to which we are all entitled, and has inspired laws to protect human rights in Canada and around the world.</p>\n\n<p>“Equality, justice, and freedom lie at the heart of the <em>Canadian Charter of Rights and Freedoms </em>and guide the Government of Canada’s work to build a stronger and more resilient country for everyone. While we have made progress on human rights, we must do more to address inequalities and challenges experienced by people across the country.</p>\n\n<p>“This year, while the global COVID-19 pandemic has been hard for everyone, it has laid bare fundamental inequities in our society. Many groups, including seniors, Indigenous peoples, racialized individuals, women, people with disabilities, members of LGBTQ2 communities, and refugees, have been disproportionately affected by this crisis – and we are committed to continuing to help address their needs in our response to COVID-19. That is why, since the start of the crisis, we have helped individuals with disabilities cover extra expenses, supported women experiencing violence through investments in shelters, and put in place measures to support the specific needs of Indigenous peoples. In recognition of their exceptional service to our country, we are also providing a temporary pathway to permanent residency for asylum claimants who are working on the front lines in the health care sector during the pandemic, so they can secure a better future here in Canada.</p>\n\n<p>“Beyond the pandemic, the government is committed to building back better and creating a fairer and more equal Canada for everyone. We will continue to work together with racialized communities to fight systemic racism and inequalities in our society, and through Canada’s first-ever Black Entrepreneurship Program, we are advancing equitable access to support and opportunities for Black business owners and entrepreneurs. We are also developing a Disability Inclusion Action Plan to further help individuals with disabilities, creating an Action Plan for Women in the Economy which will help get women back into the work force, and we have introduced legislation to implement the United Nations Declaration on the Rights of Indigenous Peoples to move forward on the shared path of reconciliation.</p>\n\n<p>“On the international stage, Canada has been a consistently strong voice for protecting human rights and advancing democratic values. Last month, we co-hosted the second Global Conference for Media Freedom with Botswana, which highlighted our commitment to advocate for freedom of expression, including media freedom and the protection of journalists. Through our Feminist International Assistance Policy, we are working to promote gender equality and the empowerment of women and girls in all their diversity to reduce poverty and inequality, and to build prosperity. We also continue to co-chair the International Contact Group on Freedom of Religion or Belief to encourage and deepen coordination between countries committed to advancing religious freedom for everyone.</p>\n\n<p>“Protecting and advancing human rights at home and around the world is our shared duty, and together there is still much work to be done. Today, I invite all Canadians in reflecting on how we can all advance this important cause, so we can further build a safer, fairer, and more equal world for everyone.”</p></div>\n      "
}