{
  "path": "/en/news/news-releases/2022/07/09/prime-minister-delivers-apology-descendants-no-2-construction",
  "pageTitle": "Prime Minister delivers apology to descendants of No. 2 Construction Battalion | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, the Prime Minister, Justin Trudeau, and the Minister of National Defence, Anita Anand, delivered an apology on behalf of the Government of Canada for the systemic anti-Black racism that members of No.&nbsp;2 Construction Battalion endured before, during, and long after the First World War.</p>\n\n<p>The Prime Minister apologized at a ceremony in Truro, Nova Scotia, for the government’s appalling mistreatment of soldiers who served in the battalion, and to their families, descendants, and communities. For the blatant anti-Black hate and systemic racism that denied these men dignity in life and in death, we are sorry.</p>\n\n<p>One the most selfless things a person can do is stand up and volunteer to fight for their country – it is an act of extraordinary bravery, honour, sacrifice, and loyalty. At the onset of the First World War, many Black volunteers were turned away when they offered to sacrifice their lives for us all.</p>\n\n<p>No.&nbsp;2 Construction Battalion was formed in 1916 as a segregated unit, since many Black service members were not permitted to fight alongside their white compatriots. It was the first and only all-Black battalion-sized formation in Canadian military history, formed only after Black communities across Canada put pressure on the government and military officials.</p>\n\n<p>While the contributions of No.&nbsp;2 Construction Battalion members to the war effort were invaluable – they cut the lumber that was used in the trenches, railways, and even aircraft – they faced systemic anti-Black racism throughout the war.</p>\n\n<p>Following the end of the First World War, the unit was officially disbanded without recognition for their service or sacrifices on behalf of the Government of Canada.</p>\n\n<p>During his speech, the Prime Minister acknowledged and apologized for these injustices. The story of No.&nbsp;2 Construction Battalion is one of resilience, determination, and strength in the face of adversity. The men who served in the battalion are Canadian heroes.</p>\n\n<p>Today, as we apologize for the overt anti-Black racism these brave men faced, we take every opportunity to learn from the past and build a better, more inclusive Canada for all. As we continue, as a country, to confront systemic racism, discrimination, and xenophobia in all its forms, the No.&nbsp;2 Construction Battalion story will play an important role in ensuring this injustice never happens again.</p>\n\n<h2>Quotes</h2>\n\n<blockquote>\n<p>“For the blatant anti-Black hate and systemic racism that denied these men dignity in life and in death, we are sorry. Only when the truths of the past are acknowledged can we begin to dress the wounds they created and build a better, more inclusive Canada for all. I would like to thank the descendants of No.2 Construction Battalion, members of the National Apology Advisory Committee, and members of Black communities in Nova Scotia and across Canada for their important advocacy which was instrumental in bringing this day forward. The story of No.&nbsp;2 Construction Battalion, and the stories of bravery, honour, and sacrifice of many other trailblazing Canadians, will play an important role in ensuring this horrible treatment never occurs again.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<blockquote>\n<p>﻿“The members of the No. 2 Construction Battalion were discriminated against before, during and after their service in the Great War. We are deeply sorry to all of the Battalion’s descendants, and to the members of the Battalion who are no longer with us today. I hope that today’s apology will help recognize every Black Canadian who bravely served this country in times of war, and in the pursuit of peace. May today contribute to building a Canada that lives up to the ideals that the members of the Battalion fought so bravely to protect. We have more road to travel but we will keep walking that road together until we get this right.”</p>\n\n<footer class=\"default\">The Hon. Anita Anand, Minister of National Defence</footer>\n</blockquote>\n\n<blockquote>\n<p>“The story of No.&nbsp;2 Construction Battalion is remarkable in many ways; not least because its members stood up for Canada in a time when it did not offer them fair or equal treatment in return. This official apology is a necessary step in correcting the record and recognizing the significant legacy and contributions of No.&nbsp;2 Construction Battalion members to the history of the Canadian Armed Forces. As we continue to work toward equity and justice for all, we must remember the courage and sacrifices of members of No.&nbsp;2 Construction Battalion who played a vital part in the fight on the field, and the fight against racism.”</p>\n\n<footer class=\"default\">General Wayne Eyre, Chief of the Defence Staff</footer>\n</blockquote>\n\n<blockquote>\n<p>“The brave men of No.&nbsp;2 Construction Battalion served with pride and valour, despite the harsh adversity they faced. These Black Canadians having a long-standing presence in our country felt the patriotic call at war time, but sadly faced obstacles due to the colour of their skin. Today, we can remember and honour their important legacy, as this is a step toward racial equality in our country.”</p>\n\n<footer class=\"default\">Russell Grosse, Executive Director, Black Cultural Centre for Nova Scotia</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>In preparation for today’s event, the Canadian Armed Forces worked with a community-led National Apology Advisory Committee (NAAC) that conducted six cross-Canada community consultations in which 690 descendants of former members of No.&nbsp;2 Construction Battalion participated. The NAAC is comprised of community leaders, historians, and No.&nbsp;2 Construction Battalion descendants serving as volunteers. It is co-chaired by Lieutenant-Colonel Barry Pitcher, representing the Canadian military, and Russell Grosse, Executive Director of the Black Cultural Centre for Nova Scotia (BCCNS), the event partner.</li>\n\t<li>The NAAC proposed eight recommendations to the Government of Canada. The government is committed to all of the recommendations.</li>\n\t<li>No.&nbsp;2 Construction Battalion, Canadian Expeditionary Force (CEF) was created on July&nbsp;5, 1916, in Pictou, Nova Scotia, during the First World War. On September 9, 1916, No.&nbsp;2 Construction Battalion’s headquarters were relocated to Truro, Nova Scotia, to accommodate the size of the unit. Recruitment took place across the country and more than 600 men were initially accepted, most coming from Nova Scotia, with others from New Brunswick, Ontario, Western Canada, and from the United States and the West Indies.</li>\n\t<li>While No.&nbsp;2 Construction Battalion was a segregated black unit, its leadership was predominantly white. The battalion’s only black officer was the chaplain, the Honorary Captain Reverend William Andrew White.</li>\n\t<li>The field on which the men of No.&nbsp;2 Construction Battalion paraded before deployment to Europe in March 1917 is the same field on which the apology event was held today.</li>\n\t<li>The men of No.&nbsp;2 Construction Battalion were denied from serving in the front-line units due to the colour of their skin. They mostly served in France, with the majority being assigned to No.&nbsp;5 District, Jura Group, Canadian Forestry Corps to support logging operations.</li>\n\t<li>On June 1, 2022, No.&nbsp;2 Construction Battalion was <a href=\"https://www.canada.ca/en/department-national-defence/news/2022/06/no-2-construction-battalion-awarded-france-and-flanders-1917-18-battle-honour--black-battalion-to-be-perpetuated-by-4-engineer-support-regiment.html\">awarded the ‘France and Flanders, 1917-18’ Battle Honour</a>, a distinguished military honour recognizing and paying tribute to their brave service in the Great War. On the same day, the Branch of Canadian Military Engineers announced the perpetuation of the Battalion, and the 4 Engineer Support Regiment (4 ESR) located at Canadian Forces Base Gagetown, New Brunswick, publicly recognized the Battalion, ensuring it takes its rightful place in Canada’s proud military history so that its members be remembered and honoured for generations to come.</li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/army/services/events/2-construction-battalion.html\">No.&nbsp;2 Construction Battalion</a></li>\n\t<li><a href=\"http://www.journal.forces.gc.ca/vol16/no3/page51-eng.asp\" title=\"No. 2 Construction Battalion: Operational History\">No.&nbsp;2 Construction Battalion: Operational History</a></li>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/black-history-month/transcript-construction-battalion.html\">Video – No.&nbsp;2 Construction Battalion</a></li>\n\t<li><a href=\"https://www.veterans.gc.ca/eng/remembrance/memorials/national-inventory-canadian-memorials/details/2126\" title=\"No. 2 Construction C.E.F. Memorial\">No.&nbsp;2 Construction C.E.F. Memorial</a></li>\n\t<li><a href=\"https://www.canada.ca/en/department-national-defence/news/2021/07/minister-of-national-defence-marks-the-105th-anniversary-of-the-establishment-of-the-no-2-construction-battalion.html\">Minister of National Defence marks the 105th anniversary of the establishment of the No.&nbsp;2 Construction Battalion</a></li>\n</ul></div>\n      "
}