{
  "path": "/en/news/news-releases/2017/05/25/prime-minister-trudeau-attends-nato-leaders-meeting",
  "pageTitle": "Prime Minister Trudeau attends NATO Leaders’ Meeting | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span lang=\"EN-US\" xml:lang=\"EN-US\">The Prime Minister, Justin Trudeau, participated today in the NATO Leaders’ Meeting. NATO is a cornerstone of Canada’s international security policy and is one of our most important relationships outside of North America. </span>Canada is committed to <span lang=\"EN-US\" xml:lang=\"EN-US\">continue playing a leading role&nbsp;</span><span lang=\"EN-US\" xml:lang=\"EN-US\">in </span>the Alliance.</p><p><span lang=\"EN-US\" xml:lang=\"EN-US\">At the meeting, NATO Heads of State and Government discussed burden-sharing within the Alliance and counter-terrorism. During the discussion, Prime Minister Trudeau </span>reaffirmed Canada’s commitment to NATO. The Prime Minister reinforced this message by highlighting Canada’s leadership of the multinational battlegroup deploying to Latvia, as part of the NATO enhanced Forward Presence.</p><p>NATO Heads of State and Government participated in a handover ceremony for the new NATO Headquarters. The leaders also took part in an event to unveil memorials for the tragic events of September 11, 2001, and the historic fall of the Berlin Wall in November 1989.</p><p>The Prime Minister will now travel to Taormina, Italy, <span lang=\"EN-US\" xml:lang=\"EN-US\">to participate in the 43<sup>rd</sup> G7 Leaders’ Summit, followed by a visit to Rome and Vatican City.</span></p><h2>Quote</h2><blockquote><p><span lang=\"EN-US\" xml:lang=\"EN-US\">“</span><span lang=\"EN\" xml:lang=\"EN\">In Brussels – together with our Allies and partners – we took important steps that will promote international peace and security, and help us to better respond to security concerns around the world.</span><span lang=\"EN-US\" xml:lang=\"EN-US\"> Canada plays a key role in the Alliance. We are leading a multinational NATO battlegroup that will soon deploy to Latvia. We will continue to be a strong and reliable ally, now and into the future.”<br> </span><cite>— Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick Facts</h2><ul><li><span lang=\"EN-US\" xml:lang=\"EN-US\">The NATO Leaders’ Meeting was held at NATO’s new Headquarters in Belgium, Brussels.</span></li><li><span lang=\"EN\" xml:lang=\"EN\">Canada, along with 11 other countries, founded NATO in 1949 on the fundamental values of democracy, individual liberty, human rights, and the rule of law. Over the past 68 years, NATO has proven itself to be a major contributor to international peace and security.</span></li><li><span lang=\"EN\" xml:lang=\"EN\">Since 2014, Canada has actively worked alongside NATO Allies to maintain security and stability in Central and Eastern Europe. Measures include training, exercises and other operational tasks.</span></li><li><span lang=\"EN-US\" xml:lang=\"EN-US\">On July 8, 2016, Prime </span><span lang=\"EN\" xml:lang=\"EN\">Minister Justin Trudeau announced that Canada would establish and lead a robust multinational NATO battlegroup in Latvia as one of four framework nations for the enhanced Forward Presence. </span></li><li><span lang=\"EN\" xml:lang=\"EN\">Canada will contribute a Land Task Force of up to 455 personnel including a battlegroup headquarters element, a mechanized infantry company, combat service support, and vehicles and equipment based in Latvia to support NATO’s enhanced Forward Presence in Eastern and Central Europe.</span></li><li>In parallel, the United Kingdom is leading a battlegroup in Estonia, Germany is leading one in Lithuania, and the United States is leading one in Poland.</li></ul><h2>Associated Links</h2><ul><li><a href=\"http://www.international.gc.ca/nato-otan/index.aspx?lang=eng\"><span lang=\"EN-US\" xml:lang=\"EN-US\">Canada in NATO</span></a></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"/en/news/news-releases/2016/07/08/canada-makes-commitment-nato-defence-and-deterrence-measures\">Canada makes commitment to NATO defence and deterrence measures</a></span></li><li><span lang=\"EN\" xml:lang=\"EN\"><a href=\"https://www.canada.ca/en/department-national-defence/news/2017/04/technical_arrangementtosupportnatoenhancedforwardpresenceinlatvi.html\">Technical Arrangement to support NATO enhanced Forward Presence in Latvia</a></span></li><li><a href=\"http://www.nato.int/\"><span lang=\"EN-US\" xml:lang=\"EN-US\">North Atlantic Treaty Organization</span></a></li></ul></div>\n      "
}