{
  "path": "/en/news/news-releases/2022/08/15/prime-minister-announces-new-lieutenant-governor-manitoba",
  "pageTitle": "Prime Minister announces new Lieutenant Governor for Manitoba | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today announced the appointment of the Honourable Anita Neville as the new Lieutenant Governor of Manitoba.</p>\n\n<p>A dedicated community leader and a respected public servant, Ms.&nbsp;Neville is a long-time advocate for Manitobans. From helping revitalize Winnipeg’s urban core to working in education and advancing skills training, Ms. Neville has a unique set of experiences and expertise. She spent over a decade working in education, including as a member – and later Chair – of the Winnipeg School Division Board of Trustees.</p>\n\n<p>From 2000 to 2011, she represented her community of Winnipeg South Centre as a Member of Parliament, where she defended the rights of minorities and helped advance reconciliation, and served on numerous committees, parliamentary associations, and parliamentary groups. She also served as the Parliamentary Secretary to the Minister of Canadian Heritage and Minister responsible for Status of Women.</p>\n\n<p>The Prime Minister thanked the outgoing Lieutenant Governor, the Honourable Janice C. Filmon, for her dedication and service to the people of Manitoba over the past seven years, and wished her all the best in the future.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“Ms.&nbsp;Neville has long been a champion for the people of her community, her province, and our country. As Lieutenant Governor of Manitoba, I know she will continue to make a difference for Manitobans and Canadians. I wish her all the best in her new role.”</p>\n\n<footer class=\"default\">The Rt. Hon.&nbsp;Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>When she assumes office, Ms.&nbsp;Neville will become the third woman to serve as Lieutenant Governor of Manitoba. She will be the first Jewish Lieutenant Governor of Manitoba.</li>\n\t<li>Lieutenant Governors are the representatives of Her Majesty The Queen of Canada in their respective provinces. They fulfill the roles and functions of The Queen, including granting Royal Assent to provincial laws, opening legislative sessions with the Speech from the Throne, and swearing in members of the Executive Council.</li>\n\t<li>Lieutenant Governors are appointed by the Governor General of Canada on the recommendation of the Prime Minister.</li>\n</ul>\n\n<h2>Biographical Notes</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2022/08/15/honourable-anita-neville-pc\">The Honourable Anita Neville, P.C.</a></li>\n</ul>\n\n<h2>Associated Link</h2>\n\n<ul>\n\t<li><a href=\"https://www.canada.ca/en/canadian-heritage/services/crown-canada/lieutenant-governors.html\">The Lieutenant Governors</a></li>\n</ul></div>\n      "
}