{
  "path": "/en/news/news-releases/2018/02/19/canada-and-indias-relationship-strengthened-people-people-ties",
  "pageTitle": "Canada and India’s relationship strengthened by people-to-people ties | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Canada and India enjoy a close relationship that is based on similar institutions and forms of government, and a shared commitment to pluralism, diversity, and democracy. Our friendship is bolstered by strong people-to-people and cultural ties, and a long history of cooperation in a range of areas, including education.</p><p>As part of his official visit to India, the Prime Minister, Justin Trudeau, today spent time at cultural and religious sites of significance to people in Canada, India, and around the world.</p><p>Prime Minister Trudeau visited the Gandhi Ashram, Mahatma Gandhi’s former residence and the starting point for the Salt March, a major protest in 1930 that played a significant role in India’s independence movement. He also visited the Akshardham Temple, one of India’s largest Hindu temples. The Prime Minister will spend time at other sites of similar importance later this week, including the Golden Temple, a place of religious significance to Sikhs, the Jama Masjid Mosque, the largest mosque in India, and the Sacred Heart Cathedral, Delhi’s largest Catholic church.</p><p>The Prime Minister’s visits to these sites highlight how both Canada and India gain strength from their commitment to diversity and pluralism. They also build on the already strong people-to-people ties enjoyed by our two countries.</p><p>Canada is home to a vibrant Indian diaspora, with approximately 1.4 million Canadians of Indian heritage. The Indo-Canadian community makes significant contributions to Canadian society in a range of areas, including business, arts and culture, health care and medicine, public service, journalism, advocacy, and philanthropy.&nbsp;</p><p>Our people-to-people ties are deepened through a shared focus on the importance of excellence in education. The Prime Minister highlighted that common priority today while speaking to students and participating in a question and answer session at the Indian Institute of Management Ahmedabad. The Institute has student exchange programs with Canadian universities, including McGill University, the University of British Columbia and its Sauder School of Business, as well as the Schulich School of Business at York University. These exchange programs demonstrate the close connections enjoyed between educational institutions in our two countries.&nbsp;</p><h2>Quotes</h2><blockquote><p>“These holy sites are of great significance to Indians and people of faith from around the world, including many Canadians. I am grateful to have had the opportunity to visit them, and look forward to the rest of the trip as an opportunity to deepen the already strong Canada-India friendship.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><blockquote><p>“Canada and India both embrace education as one of the most important pathways to success. It is essential to both our countries that our students and institutions have access to the tools and resources they need to be competitive on the world stage. I thank the students from the Indian Institute of Management Ahmedabad for a great discussion on how education and innovation can help us build a more prosperous future.”<br>—<cite>The Rt. Hon. Justin Trudeau, Prime Minister of Canada</cite></p></blockquote><h2>Quick facts</h2><ul><li>India is Canada’s second largest source of immigrants (approximately 40,000 in 2016).</li><li>India is also Canada’s 10th largest source of tourists and international visitors, with 224,000 visits made from India to Canada in 2016.</li><li>An estimated 124,000 students from India held a permit to study in Canada for six months or more in 2017. Canada is the second most popular destination for Indian students going abroad for higher education.</li><li>Canadian universities and colleges are also very active in India, and there are currently over 400 agreements between institutions in both our countries. &nbsp;</li></ul><h2>Associated links</h2><ul><li><a href=\"/en/news/news-releases/2018/01/22/prime-minister-trudeau-travel-india-state-visit\">Prime Minister Trudeau to travel to India for state visit</a></li><li><a href=\"/en/news/news-releases/2018/02/20/prime-minister-announces-new-commercial-partnerships-india-and\">Canada announces new commercial partnerships with India</a></li><li><a href=\"/en/news/news-releases/2018/02/22/canada-announces-new-partnerships-india\">Canada announces new partnerships with India</a></li></ul></div>\n      "
}