{
  "path": "/en/news/statements/2017/08/09/statement-prime-minister-international-day-worlds-indigenous-peoples",
  "pageTitle": "Statement by the Prime Minister on the International Day of the World’s Indigenous Peoples | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the International Day of the World’s Indigenous Peoples:</p><p>“On the <a href=\"http://www.un.org/en/events/indigenousday/\">International Day of the World’s Indigenous Peoples</a>, we recognize Indigenous Peoples around the world, and recommit to protect and promote the rights of Indigenous Peoples.</p><p>“This year, the United Nations highlights the 10th anniversary of the <a href=\"https://www.un.org/development/desa/indigenouspeoples/declaration-on-the-rights-of-indigenous-peoples.html\">United Nations Declaration on the Rights of Indigenous Peoples.</a> The declaration addresses the rights of Indigenous Peoples, including the right to self-determination. It also outlines how principles of equality, partnership, and mutual respect must form the foundation of collaborative relationships with Indigenous Peoples.</p><p>“Many Indigenous leaders in Canada persevered over twenty-five years to advocate for, draft, and negotiate the UN Declaration. Canada is grateful for their leadership, and fully supports the declaration.</p><p>“No relationship is more important to Canada than the one with Indigenous Peoples. We are taking concrete steps to create a renewed relationship with First Nations, Inuit, and the Métis Nation – based on recognition of rights, respect, collaboration, and partnership.</p><p>“We are working in partnership with Indigenous Peoples to review federal laws and policies to ensure we respect both our constitutional obligations and international standards, including those set out in the UN Declaration. We are also working collaboratively, transparently, and on a distinctions-basis to co-develop national First Nations, Inuit, and Métis Nation languages legislation, and we are making progress to address the Calls to Action of the Truth and Reconciliation Commission. We are also creating a new space for Indigenous Peoples near Parliament Hill, which will honour our nation-to-nation, Inuit-Crown, and government-to-government relationship with Indigenous Peoples and recognize their importance to this country’s foundation and its future.</p><p>“Despite this progress, much work remains to be done to advance meaningful reconciliation and to make sure that Indigenous Peoples’ rights and voices are fully respected. We will continue to work with First Nations, Inuit, and the Métis Nation to identify and make progress on shared priorities, so that their voices and perspectives guide the way forward.</p><p>“Our world’s history is one in which the rights, culture, history, and languages of Indigenous Peoples have been dismissed or violated for far too long. Today, we acknowledge this unacceptable past, and we commit to build a world where the rights of Indigenous Peoples are respected. Together, we can continue our journey of reconciliation with Indigenous Peoples – and create a better future for all of us.”</p></div>\n      "
}