{
  "path": "/en/news/statements/2020/07/11/statement-prime-minister-imamat-day",
  "pageTitle": "Statement by the Prime Minister on Imamat Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Imamat Day:</p>\n\n<p>“Today, Ismaili Muslims in Canada and around the world will celebrate Imamat Day. This day marks the 63<sup>rd</sup> anniversary of the accession in 1957 of His Highness Prince Karim Aga Khan as the 49th hereditary Imam – spiritual leader – of the Shia Imami Ismaili Muslims.</p>\n\n<p>“The Aga Khan has devoted himself to improving the lives of all people, regardless of their origin, background, or faith. His tireless work, through the Aga Khan Development Network, has advanced humanitarian causes, promoted health and education, especially for women and girls, in some of the poorest regions of the world, and encouraged us all to be more active and engaged in our communities.&nbsp;</p>\n\n<p>“The values that His Highness promotes – pluralism, compassion, and respect for diversity and human rights – are those that we Canadians hold dear. We are proud to have bestowed honorary Canadian citizenship on the Aga Khan, and are honoured to be the home of both the Aga Khan Museum and the <a href=\"https://www.pluralism.ca/\">Global Centre for Pluralism</a>. The Centre’s work continues during COVID-19, as it plays a leadership role to advance diversity and pluralism at a time when the health, social, and economic impacts of the pandemic are compounding existing inequalities in our society.</p>\n\n<p>“Ismaili communities in Canada are working to support our response to COVID-19, with volunteers providing thousands of cloth masks to essential workers, over 10 tonnes of non-perishable food items for food banks, and vital blood donations in support of National Blood Donor Week. These are perfect examples of Ismaili Canadians’ long-standing commitment to volunteerism, and the core values of peace, compassion, and care for the vulnerable. And today, even as the celebrations will look different due to COVID-19, we still take the time to acknowledge this work and the other important contributions that the Aga Khan and Ismaili Canadians have made to the richness and diversity of our country.</p>\n\n<p>“On behalf of our family, Sophie and I extend our best wishes to His Highness Prince Karim Aga Khan and thank him for his important work in Canada and around the world.</p>\n\n<p><em>“</em>Khushiali Mubarak!”</p></div>\n      "
}