{
  "path": "/en/news/readouts/2021/11/18/prime-minister-justin-trudeau-meets-president-united-states-america-joe",
  "pageTitle": "Prime Minister Justin Trudeau meets with the President of the United States of America Joe Biden | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau met with the President of the United States of America, Joe Biden, to reaffirm their commitment to advance the Canada-U.S. relationship.</p>\n\n<p>The two leaders recognized the progress achieved under the February 2021 Roadmap for a Renewed U.S.‑Canada Partnership. This includes fighting COVID‑19 around the world, such as through significant donations of vaccines globally, building back better with an economic recovery that benefits everyone, accelerating action on climate change, advancing diversity and inclusion, bolstering security and defence, and building global alliances. As deaths and harm from drug use rises in both countries, the leaders affirmed their Joint Action Plan on Opioids.</p>\n\n<p>The Prime Minister and President’s top priority remains ending the COVID-19 pandemic and advancing health security. The leaders recalled their previous commitments to the global vaccination effort, and mentioned that both countries have provided financial support to help low- and middle-income countries overcome debt and liquidity constraints to an economic recovery from COVID‑19.</p>\n\n<p>Recognizing the essential role the Canada‑U.S. border plays in supporting the social and economic well‑being of their citizens, the Prime Minister and President agreed to develop a renewed vision for joint management of the border, including increasing the efficiency, effectiveness, and safety of bilateral measures, and applying lessons learned from the pandemic.</p>\n\n<p>The Prime Minister and the President reaffirmed their shared vision for a sustainable and inclusive economic recovery that strengthens the middle class, creates more opportunities for those working hard to join it, and ensures people have good jobs and careers on both sides of the border. They acknowledged that the Canada-United States-Mexico Agreement (CUSMA) is instrumental to achieving this vision, given the agreement’s strong labour protections and commitments to ensuring free trade between Canada and the United States.</p>\n\n<p>The Prime Minister noted that the bilateral trade and investment relationship is essential to both countries‘ prosperity. He raised Canada’s concerns with the United States’ proposed electric vehicle tax credits. The Prime Minister also raised the importance of Line&nbsp;5 to Canada’s energy security and economy. The two leaders further discussed bilateral economic and trade issues, including Buy America provisions, softwood lumber, and potato exports.</p>\n\n<p>The leaders underscored their commitment to supply chain security and resilience based on the principles of transparency; diversity, openness, and predictability; security; and, sustainability. They recognized the importance of these principles for cross-border economic integration and the future of the North American auto sector. To build on these efforts, the Prime Minister and President announced the launch of the Canada-United States Working Group on Supply Chains and instructed their officials to produce a progress report within 120 days. Separately, the United States and Canada committed to commencing negotiations towards a bilateral science, technology, and innovation agreement.</p>\n\n<p>Following the United Nations Climate Change Conference of the Parties (COP26), the leaders reiterated their commitments to reaching net-zero emissions by 2050, to enhanced 2030 greenhouse gas reduction targets, and to meeting commitments under the Global Methane Pledge. Canada and the U.S. are working closely to expand clean electricity innovation and adoption, grow zero-emissions vehicles and charging infrastructure deployment, and accelerate carbon dioxide removal innovation. Both countries will also work to reduce oil and gas sector emissions and end new direct public support for unabated fossil fuels internationally by the end of 2022, except in limited and clearly defined circumstances consistent with a 1.5 degrees Celsius warming limit and the goals of the Paris Agreement. They affirmed their commitment to nature conservation, recognizing the importance of Indigenous-led conservation efforts, and to unlocking financing for Small Island Developing States, especially Caribbean countries. They pledged to support the High-Level Panel for a Sustainable Ocean Economy, to realize the potential of ocean-based solutions to climate change, nature conservation, and economic opportunity.</p>\n\n<p>Further to cooperation under the U.S.-Canada High Level Ministerial Dialogue on Climate Ambition, the Prime Minister noted the importance of redoubling efforts to collaborate on the transition to net-zero emissions economies. This includes exploring further cooperation on clean electricity and clean transportation, cooperating on a technical level on adaptation planning, and accelerating zero-emissions vehicle deployment within the context of an integrated North American auto industry.</p>\n\n<p>The leaders recalled their roadmap commitment to expand cooperation on the promotion of democracy, human rights, and media freedom around the world, including at the upcoming Summit for Democracy. They emphasized that an inclusive approach to promoting gender equality and empowering women and girls is a direct path to eradicating poverty and building a more peaceful, inclusive, and prosperous world.</p>\n\n<p>The Prime Minister and the President discussed their extensive cooperation in security matters, and agreed to find opportunities to further strengthen and expand cooperation between the Five Eyes countries. The two leaders also committed to collaborating further on a strategic dialogue on cooperation in the Arctic. They recognized that biological risks are growing, and agreed to work toward a global compact on biosafety and biosecurity. They also committed to establishing a strategic dialogue on the Indo-Pacific to collaborate on regional security, the rule of law, good governance, and their approaches to China.</p>\n\n<p>As Haiti’s two leading international donor countries, the Prime Minister and the President agreed to continue collaborating closely on shared priorities, including strengthening the capacity of the Haitian National Police to address insecurity. They also agreed on the importance of supporting an inclusive political dialogue.</p>\n\n<p>The two leaders agreed to continue close coordination on Afghanistan, including to ensure safe passage out of the country for foreign nationals and Afghans, and a continued cooperation on resettlement and humanitarian assistance, diplomatic engagement, and counter-terrorism cooperation.</p>\n\n<p>Recognizing the extraordinary movement of migrants within the western hemisphere, the leaders committed to working with other partners in the Americas on this hemispheric challenge, through pursuit of a bold new regional compact on migration and protection.</p>\n\n<p>The Prime Minister and President recalled the longstanding friendship, shared values, and deep interests that bind their countries together, and emphasized their mutual commitment to continue strengthening the Canada-U.S. partnership at the core of their countries’ collective security and prosperity.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://www.international.gc.ca/country-pays/us-eu/relations.aspx?lang=eng\">Canada-United States relations</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2021/11/10/prime-minister-trudeau-attend-north-american-leaders-summit\">Prime Minister Trudeau to attend North American Leaders’ Summit</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2021/02/23/roadmap-renewed-us-canada-partnership\">Roadmap for a Renewed U.S.-Canada Partnership</a></li>\n\t<li><a href=\"https://www.state.gov/summit-for-democracy/\">The Summit for Democracy</a></li>\n\t<li><a href=\"https://www.international.gc.ca/trade-commerce/trade-agreements-accords-commerciaux/agr-acc/cusma-aceum/index.aspx?lang=eng\">Canada-United States-Mexico Agreement (CUSMA)</a></li>\n</ul></div>\n      "
}