{
  "path": "/en/news/statements/2022/02/01/statement-prime-minister-vietnamese-new-year",
  "pageTitle": "Statement by the Prime Minister on Vietnamese New Year | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Vietnamese New Year:</p>\n\n<p>“This week, Vietnamese communities in Canada and around the world will celebrate the Lunar New Year, also known as Tết Nguyên Đán, and welcome the Year of the Tiger.</p>\n\n<p>“Tết Nguyên Đán, most commonly known as Tết, is the most important festival of the year for Vietnamese communities. A time of renewal, it celebrates the beginning of a new year and the coming of spring. It is also an opportunity to reflect on the challenges and successes of the past year, and to look forward to the year ahead with optimism, joy, and hope.</p>\n\n<p>“To usher in the New Year, family and friends would typically come together to honour their ancestors, enjoy special meals, and exchange gifts, greetings, and best wishes for the year to come. While festivities may look different again this year as we continue to follow public health guidelines to keep each other and our communities safe, we can still take inspiration from the tiger, which symbolizes strength and courage. These values have guided Canadians through difficult times, and I know they will continue to inspire us as we move forward.</p>\n\n<p>“Vietnamese New Year is an opportunity to recognize the many contributions that Canadians of Vietnamese ancestry have made – and continue to make – to our country, including on the front lines of the pandemic. It is also an opportunity for us all to learn more about their rich culture, customs, and traditions, which help make Canada a stronger, more diverse, and more vibrant place to live. Diversity is our country’s strength, and together we will persevere to build a better, fairer, and more inclusive Canada.</p>\n\n<p>“On behalf of all Canadians, I wish everyone celebrating health, good fortune, and prosperity in the Year of the Tiger.</p>\n\n<p>“CHÚC MỪNG NĂM MỚI”</p></div>\n      "
}