{
  "path": "/en/news/statements/2019/09/08/statement-prime-minister-international-literacy-day",
  "pageTitle": "Statement by the Prime Minister on International Literacy Day | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on International Literacy Day:</p>\n\n<p>“Today, on <a href=\"https://www.un.org/en/events/literacyday/\">International Literacy Day</a>, we highlight the importance of literacy and recognize people around the world who are helping make education a reality for all.</p>\n\n<p>“This year’s theme, ‘Literacy and Multilingualism,’ encourages us to promote linguistic diversity – and reminds us that we need to do more to make sure everyone has access to learning in the language they speak or understand. Literacy skills are building blocks that help us create a better future. They give us the tools and independence we need to succeed – and no one should face barriers to these skills based on the language they speak.</p>\n\n<p>“Education empowers people – yet not everyone around the world has the opportunity to go to school. That is why Canada helped deliver a <a href=\"https://pm.gc.ca/eng/news/2018/06/09/canada-and-partners-announce-historic-investment-education-women-and-girls-crisis\">historic investment</a> in education for women and girls in conflict and crisis situations, and welcomed <a href=\"https://pm.gc.ca/eng/news/2018/09/26/prime-minister-concludes-successful-week-united-nations-general-assembly\">additional contributions</a> to help developing countries provide every child with access to quality education and modern skills training. By helping communities around the world teach the next generation, we can create a better tomorrow for all of us.</p>\n\n<p>“At home, the Government of Canada is taking important steps to make sure all Canadians have the education they need to thrive – education that reflects Canada’s cultural and linguistic diversity. This year, we mark the 50th anniversary of the <em>Official Languages Act</em>, and celebrate the bilingualism at our country’s core. We will continue to <a href=\"https://www.canada.ca/en/canadian-heritage/news/2019/09/new-1-billion-federal-provincial-territorial-protocol-for-agreements-to-support-education-for-official-language-minorities-and-second-language-lear.html\">support education in official language minority communities and second official language education</a> across the country. The Government of Canada has also worked closely with Indigenous peoples to co-develop <a href=\"https://www.canada.ca/en/canadian-heritage/campaigns/celebrate-indigenous-languages/legislation.html\">legislation to support the efforts of Indigenous peoples to reclaim, revitalize, maintain, and strengthen Indigenous languages</a>. By protecting these languages, we are working together to support and promote the use of Indigenous languages, and to advance the self-determination of the Indigenous peoples who speak them.</p>\n\n<p>“Supporting quality and inclusive education opens the door to new opportunities and a better quality of life for everyone. This year, we introduced funding to close gaps in education for First Nations communities and make sure Indigenous communities have access to affordable post-secondary education. We also modernized the <a href=\"https://www.canada.ca/en/employment-social-development/services/funding/youth-employment-strategy.html\">Youth Employment and Skills Strategy</a> to help all young Canadians gain the experience they need to prepare for the jobs of today and tomorrow.</p>\n\n<p>“On behalf of the Government of Canada, I thank everyone who works tirelessly to improve literacy and access to education. Whether it’s reading kids a bedtime story, helping teens with their homework, or spending time at the library, we can all take steps to promote literacy in our communities.”</p></div>\n      "
}