{
  "path": "/en/news/news-releases/2019/07/18/prime-minister-concludes-productive-canada-european-union-summit",
  "pageTitle": "Prime Minister concludes productive Canada-European Union Summit | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today concluded his participation at the Canada-European Union (EU) Summit, where he hosted European Council President Donald Tusk. The European Commissioner for Trade, Cecilia Malmström, as well as the Minister of International Trade Diversification, Jim Carr, and the Minister of Environment and Climate Change, Catherine McKenna, also took part in the Summit.</p>\n\n<p>The ever-expanding Canada-EU partnership is based on common history and shared values, and generations of Canadians and Europeans working together to face the greatest challenges of their time. During this year’s Summit, leaders discussed how Canada and the EU are working together to build economies that benefit everyone and strengthen the middle class in Canada and the EU.</p>\n\n<p>At the Summit, Prime Minister Trudeau and President Tusk highlighted the Canada-EU Comprehensive Economic and Trade Agreement (CETA), which is creating new opportunities and good, middle class jobs on both sides of the Atlantic. Prime Minister Trudeau underscored how, over the first year that CETA was in force, two-way trade between Canada and the EU grew by almost eight per cent compared with the previous year. He emphasized how CETA protects the environment, upholds labour rights, creates new opportunities for workers and businesses, and offers a blueprint for future trade deals around the world.</p>\n\n<p>Prime Minister Trudeau and President Tusk discussed the Strategic Partnership Agreement, signed together with CETA, which is further strengthening ties and deepening cooperation between Canada and the EU.</p>\n\n<p>The leaders also exchanged views on how Canada and the EU can work more closely together to reform the World Trade Organization, advance rules-based international trade, and strengthen the middle class.</p>\n\n<p>The Prime Minister welcomed the signing of a Canada-EU Ocean&nbsp;Partnership, which builds on the Canada-led 2018 G7 Ocean&nbsp;Plastics Charter. The new partnership will strengthen Canada’s leadership in protecting oceans, combatting ocean plastic waste and marine litter, and fighting the climate crisis.</p>\n\n<p>In addition, the Prime Minister announced that Canada has signed a renewed agreement to deepen its participation in EU Election Observation Missions and better support free and fair elections around the world.</p>\n\n<p>He also announced that Canada has joined the Venice Commission – the Council of Europe's advisory body on constitutional matters – as a full member, to contribute to the Commission’s independent expert constitutional advice to countries in Europe and beyond.</p>\n\n<p>Finally, Prime Minister Trudeau announced that Canada will allocate up to $50 million over the next five years to support Canadian participation in international teams applying for funding through the EU’s Horizon 2020 and Horizon Europe. These programs encourage research and innovation, stimulate economic growth, and create new jobs and opportunities.</p>\n\n<h2>Quote</h2>\n\n<blockquote>\n<p>“From one generation to the next, Canadians and Europeans have joined forces to meet the greatest challenges of their time. This generation is no different, as we come together to fight the climate crisis, create good, middle class jobs, and build a better future for people on both sides of the Atlantic.”</p>\n\n<footer class=\"default\">The Rt. Hon. Justin Trudeau, Prime Minister of Canada</footer>\n</blockquote>\n\n<h2>Quick Facts</h2>\n\n<ul>\n\t<li>The New Frontiers in Research Fund was announced in Budget 2018 with a commitment to invest $275 million over five years (between 2018-19 and 2023-24) and $65 million ongoing to fund international, interdisciplinary, fast-breaking and high-risk research.</li>\n\t<li>The EU is Canada's second largest trade and investment partner and an ally on many foreign policy and international security issues.</li>\n\t<li>Provisional application of CETA began on September 21, 2017, and all economically significant parts of the Agreement (tariffs, origin and tariff-rate quotas, services commitments, temporary entry commitments, government procurement obligations) are in force.</li>\n\t<li>In 2018, two-way merchandise trade amounted to $118.1 billion, a 9.4 per cent growth compared to 2017, and our two-way trade in service grew by 3.7 per cent, amounting to $46.7 billion.</li>\n\t<li>In 2018, Canada’s merchandise exports to the EU were nearly $44.5 billion, an increase of 7 per cent over 2017.</li>\n\t<li>Montréal, the host city for this year’s summit, has seen the benefits of CETA firsthand. During the first year the agreement was in force, the Port of Montréal saw a significant increase in cargo – 55 per cent of which connects to Europe – more than doubling the average annual historical growth.</li>\n\t<li>To date, thirteen EU Member States have ratified CETA in their national processes, and others are moving towards ratification.</li>\n\t<li>Twenty EU Member States have ratified the Strategic Partnership Agreement (SPA), the political counterpart to CETA, since October 2016. Under the SPA, regular dialogue now takes place on over 25 thematic and regional topics, across nine federal government departments.</li>\n\t<li>The signing of the Ocean Partnership Declaration during the Summit will reinforce Canada’s G7 efforts on oceans, including the Ocean Plastics Charter and those articulated in the Comprehensive Economic and Trade Agreement.</li>\n\t<li>The main role of the Venice Commission is to provide legal advice to help states in Europe and beyond who wish to bring their legal and institutional structures into line with European standards and international experience in democracy, human rights, and the rule of law. Canada has been an observer at the Venice Commission since 1991.</li>\n\t<li>The purpose of EU Election Observation Missions (EOMs) is to assist partner countries in holding elections of a high standard.</li>\n</ul>\n\n<h2>Related Products</h2>\n\n<ul>\n\t<li><a href=\"/en/news/backgrounders/2019/07/18/declaration-canada-and-european-union\">Declaration by Canada and the European Union&nbsp;concerning the establishment of an Ocean Partnership</a></li>\n\t<li><a href=\"/en/news/backgrounders/2019/07/18/canada-eu-summit-joint-declaration\">Canada-EU Summit Declaration</a></li>\n</ul>\n\n<h2>Associated Links</h2>\n\n<ul>\n\t<li><a href=\"https://www.canadainternational.gc.ca/eu-ue/bilateral_relations_bilaterales/overview-apercu.aspx?lang=eng\">Canada-EU relations: An overview</a></li>\n\t<li><a href=\"https://www.international.gc.ca/gac-amc/campaign-campagne/ceta-aecg/index.aspx?lang=eng\">CETA: A progressive trade agreement for a strong middle class</a></li>\n</ul></div>\n      "
}