{
  "path": "/en/news/statements/2020/08/19/statement-prime-minister-78th-anniversary-dieppe-raid",
  "pageTitle": "Statement by the Prime Minister on the 78th anniversary of the Dieppe Raid | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on the 78th anniversary of the Dieppe Raid:</p>\n\n<p>“Today, we honour the brave Canadians who fought in the Dieppe Raid, the bloodiest day of the Second World War for Canada.</p>\n\n<p>“On August 19, 1942, almost 5,000 Canadian soldiers, alongside British and American allies, landed on the shores around the towns of Dieppe, Puys, and Pourville in occupied France.</p>\n\n<p>“These Allied land, air, and sea forces were sent to test German defences, damage enemy shipping and port facilities, and gather intelligence to help defeat Nazi Germany. But the raid did not go as planned, and quickly turned to tragedy.</p>\n\n<p>“Allied soldiers brought to shore by a fleet of ships and a landing craft lost the element of surprise and were met with intense enemy fire. After nine hours, they were forced to withdraw. Overhead, the Royal Air Force and Royal Canadian Air Force supporting the attacks fought one of the war’s fiercest air battles. The Dieppe Raid saw more than 3,350 Canadians killed, wounded, or taken prisoner. It was one of the darkest chapters in our country’s military history.</p>\n\n<p>“While it was a day of devastating loss, it was also one of tremendous courage, strength, and resilience. The Allied forces learned invaluable lessons from the operation at Dieppe. This knowledge was used for future attacks and landings, including D-Day – a turning point that helped the Allies achieve victory during the Second World War.</p>\n\n<p>“On this solemn anniversary, we remember the thousands of Canadians who served and sacrificed so much at Dieppe, and thank all our veterans for defending the values of peace, justice, and freedom we enjoy today.</p>\n\n<p>“Lest we forget.”</p></div>\n      "
}