{
  "path": "/en/news/statements/2022/12/24/statement-prime-minister-christmas",
  "pageTitle": "Statement by the Prime Minister on Christmas | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>The Prime Minister, Justin Trudeau, today issued the following statement on Christmas:</p>\n\n<p>“Merry Christmas, everyone!</p>\n\n<p>“Like millions of Canadians, my family is excited to gather around the Christmas tree and spend some quality time together. It’s the time of year when things slow down a little bit, when Christmas movies – including <em>Die Hard</em> – are on repeat, when some of us keep an ear out for the sound of reindeer on the roof, and when we all take a moment to appreciate those who make our lives special.</p>\n\n<p>“This year, I’m thinking of Canadians who go the extra mile to make our country a better place. I’m thinking of members of the Canadian Armed Forces who are protecting our country and the values we share. I’m thinking of the doctors, nurses, and first responders who will be working throughout the holidays. And I’m thinking of everyday Canadians who find ways to show up for their friends and neighbours.</p>\n\n<p>“2022 was a challenging year, and for many this holiday season won’t be easy. But I’m confident that Canadians will continue to be there for each other in 2023 – because that’s just who we are. We show up for each other. And when times are tough, we stand together.</p>\n\n<p>“We’ve been through a lot as a country, but through it all Canadians have demonstrated the true meaning of generosity, kindness, and hope. For Christians, this is a special time where we celebrate the birth of Christ and the promise of peace and joy that comes with it. No matter your beliefs, these are values you can bring as you celebrate the season.</p>\n\n<p>“So, as we come together under the twinkle of Christmas lights, as we share a glass of good cheer with friends and colleagues, as we welcome the cousins, uncles, aunts, nieces, and nephews we haven’t seen in so long, and as we celebrate those unique traditions that reflect Canada’s diversity – let’s remind ourselves how fortunate we are to live in a country of peace.</p>\n\n<p>“Canada is a country where families can live out their faith and be proud of the communities they represent. As we look ahead to the new year, let’s continue to stand together as we build a better future for all Canadians.</p>\n\n<p>“From my family to yours, Sophie, Xavier, Ella-Grace, Hadrien, and I wish you joy, health, love, and peace this holiday season.</p>\n\n<p>“Merry Christmas.”</p></div>\n      "
}