{
  "path": "/en/news/readouts/2020/05/21/prime-minister-justin-trudeau-speaks-premiers-continued-efforts-address",
  "pageTitle": "Prime Minister Justin Trudeau speaks with premiers on continued efforts to address the impacts of COVID-19 | Prime Minister of Canada",
  "articleHtml": "\n            <div property=\"schema:text\" class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p>Today, Prime Minister Justin Trudeau and Deputy Prime Minister Chrystia Freeland held their tenth First Ministers’ call&nbsp;with the premiers about the COVID-19 pandemic. The leaders spoke about coordinated actions being taken by federal, provincial, and territorial partners to protect the health and safety of all Canadians and to support workers and businesses. First Ministers also offered their condolences to the family of Captain Jennifer Casey and their hopes for a full recovery for Captain Richard MacDougall, both of whom were involved in the Snowbirds aircraft accident in Kamloops, British Columbia, on May 17.</p>\n\n<p>First Ministers reiterated the importance of working collaboratively to keep Canadians safe while gradually restarting their economies. They discussed an approach based on increased testing capacity, timely and complete contact tracing, and data and information sharing. This approach will help ensure that all regions of the country are testing at a sufficient level, and reinforce testing with effective contact tracing and data sharing in order to contain future outbreaks. The Prime Minister thanked premiers for their continued cooperation in these areas. First Ministers also looked at ways to ensure all jurisdictions have the necessary resources, including personal protective equipment, testing material, human resources, and technology, to contain the spread of the virus as public health restrictions are eased.</p>\n\n<p>The Prime Minister provided an update on the extension of the border restrictions with the United States until June 21. First Ministers welcomed this decision, which will help keep people on both sides of the border safe. First Ministers underscored the ongoing need for strong public health measures at the border, given that essential and business travel continues in order to preserve vital supply chains between our two countries.</p>\n\n<p>All First Ministers reaffirmed their commitment to addressing COVID-19 through a Team Canada effort. The Government of Canada continues to take a whole-of-government, comprehensive, and coordinated approach to responding to COVID-19.</p>\n\n<h2>Associated links</h2>\n\n<ul>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/03/20/prime-minister-announces-temporary-border-agreement-united-states\">Prime Minister announces temporary border agreement with the United States</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/statements/2020/04/28/first-ministers-statement-shared-public-health-approach-support\">First Ministers’ statement on shared public health approach to support restarting the economy</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/05/20/prime-minister-announces-opening-program-protect-jobs-and-help\">Prime Minister announces opening of program to protect jobs and help businesses</a></li>\n\t<li><a href=\"https://pm.gc.ca/en/news/news-releases/2020/04/23/prime-minister-announces-new-support-covid-19-medical-research-and\">Prime Minister announces new support for COVID-19 medical research and vaccine development</a></li>\n</ul></div>\n      "
}